{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "The Lobsta Truck is the Bomb!\n\nI stumbled upon this truck at 400 California at lunch time. Given that I love lobster rolls I had to give it a try.\n\nFirst off, it is a traditional east  coast lobster roll. The kind that you would find out on Long Island or Boston or Maine. Split top bun toasted in butter, lobster meat with a choice of either butter or seasoned mayo. That's it. No lettuce, no tomato, nothing else. This is not a Chicago hot dog it is a lobster roll. I went with the traditional butter and for the extra meat option for $6 more. The regular is $14. Perfection! Bun Perfect. Lobster meat was impeccably fresh, tender and succulent -- Perfect. Did I say it was perfect? Sorry no picture -- it did not last long enough.\n\nAs for the Yelpers with their low ratings primarily about the size or the cost, I am sorry to put it this way, but what planet are you from?! This is fresh chunked lobster, not tuna salad. Lukes Lobster, the lobster shack that I judge all grab and go lobster rolls by is $16 in Las Vegas and New York City for 4 oz of meat on a split top butter toasted bun. This is San Francisco and the Lobsta Truck's roll is $14! \n\nIf you want a sit down place, check out Waterbar, Leo's Oyster Bar or Sauce Belden. All are excellent, perhaps a little more meat but you better be prepared to anti up some real coin -- $25 - 35 range plus all of the costs of eating in a restaurant. Lobster Me on the other hand is $24 and is the worst lobster roll I have ever had. Bun was stale and I swear the meat was previously frozen or just old -- defiantly not fresh. It is in a food court setting though, so if you are looking for a plastic chair and a table that was cleaned a couple of hours ago whether it needed it or not and surrounded by screaming kids have at it.\n\nThe Lobsta Truck is a bargain for those that know what a true lobster roll should be.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "Native New Englander here, family from New Hampshire, Maine and Boston. These are the real thing, folks. Everything is simple, fresh, and authentic. I'm a lobster with mayonaise person, my spouse a lobster with butter person. No fillers, no silly arugula or weird sauces or strange herbs that people who have never eaten a lobster roll at Brant Rock or in Bar Harbor or Hampton Beach in their lives make up in their Hollywood heads and then charge big bucks for. I also notice Lobstatruck always has an A rating. Moon pies are also good, if a little too fancy. Only sad they don't serve red top. \n\nPS the chowder and the bisque are also wicked good.", "author": "Ess K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-17", "description": "Definitely an okay place to eat at. Usually you can find them at an Off the Grid event. I knocked off the point for the size and not having the most memorable experience. I'm not a believer in over dressing seafood however, I should of looked up the reviews and went with extra butter and some mayo (this might of made a huge difference). \n\nUnderstandably, this price is justified with the great lobster meat. Mind you, most places in SF charge in between 18 to 25 for a lobster roll roughly this size as well. \n\nIt was good enough for me to want to finish it. However, not great to the extent that I would buy it again.", "author": "Ann N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-03", "description": "Struggling between a 2 and 3 star rating, soooooo... let's call it 2.5 stars and rate it a 3 here since it was \"edible\"...\n\nDo I love me some lobsta?! Yes, indeed I do. Did I love the lobsta from the \"Lobsta Truck\"?! Um... naw, not really. I didn't \"love\" it, but when you're hangry... anything goes. \n\nIt was a Wednesday evening... aka lobster truck night for yours truly, and I set out to get my lobster truck fix at the Off the Grid one night. I frequent the Cousin's Maine Lobster truck religiously, so I came with the intention of grabbing a lobster roll from my old and faithful. \n\nTo my dismay, lil ol' Cousin's wasn't there that night. You could say that I had a minor heart attack after that realization... and then I saw it: the \"Lobsta\" truck. I hadn't remembered ever trying it before, so I was excited to try a roll from a newbie. To my surprise, there was only one person ahead of me.\n\n I examined the menu and noticed that they carried many favorites; lobster rolls, clam chowder, and lobster bisque. The lobster roll was $14 which is actually cheaper than Cousin's $17 price tag. That was a good sign in itself... or so I thought. I put my order in at the window and the kind lady who took my order gave me a number. I ordered a single lobster roll and decided to get a snack from another truck to go along with it.\n\nIt didn't take long for my order and when I received it, I noticed that the lobster looked... different. Visually, it wasn't the most appealing. I was hungry... I'm sorry, I was \"hangry\", so I didn't really wasn't worried too much about how it looked. \n\nI took my first bite and I can't really say what it was, but something just tasted off. The flavor was just... weird. It almost tasted like imitation lobster. The consistency was unusual and the lobster didn't taste the freshest. I could taste the butter and I did really enjoy the crispy roll, but it did nothing to mask that unusual taste. It wasn't gross but it just didn't taste... right. Maybe it wasn't fresh?! It definitely wasn't what I was used to. The portion size was also pretty small for the price.  \n\nWhen I was done eating it, I felt the urge to gargle or to eat something else to get that taste out of my mouth. I guess I'm just spoiled by Cousin's Maine because the Lobsta Truck's rolls can't even touch the quality of Cousin's rolls. I'm hoping that it was just an off day for them, but I'll probably just continue to go to Cousin's in the meantime. The  quality and taste of their lobster rolls are just so much better in my opinion.", "author": "Shayla B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-19", "description": "4 stars for the food, 2 stars for the portion and price :/ delicious lobster, but could have eaten 2-3 of them to be comfortably full!", "author": "Shin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-20", "description": "$14 for tasteless crab slapped onto a small slice of Texas toast that was slathered in butter.  The crab could have used some seasoning, at least some Old Bay.  Also, the sandwich was small.  Will never come back to this truck!", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-09", "description": "I was so excited to eat a lobster roll, this was heartbreaking. Exaggerating, hyperbole you say? Naw, I cried after. This was not a diamond in the rough, this place was extremely expensive and even if it was not over priced, the food was not quality. I guess they stay open because dumb dumbs like me are willing to try this place because they are e excited to eat lobster and don't look at yelp reviews.", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-14", "description": "Decent, if petite lobster rolls. At $14 each, they're not as egregiously priced as those of, say, Sam's Chowdermobile, but the serving size is a hot dog bun that, depending on the generosity or attention span of the server, can be stuffed with lobster filling or can be rather stingy with it.\n\nIt's all an OK treat, but if you have $14 to spend at a food truck festival, you might be able to get better value at other trucks.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-18", "description": "Not worth the money!\n13 bucks for half a cup of completely tasteless crab meat slapped on a single slice of toast, for which I waited about 15 minutes even though there was practically no line.", "author": "Leslie V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-15", "description": "Excellent taste but pricy for a food cart and small portions. I was starving so i opted for the 21 buck lobster roll with extra meat added. Presentation and taste were great but finished it in a couple bits and needed to get a 2nd lunch elsewhere. It felt more like a snack. I understand the going rate for lobster but one expects a hook up from a food cart. Maybe if it had fries or something else filling included with it the meal would be more well rounded.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "The lobster roll with added meat was great\n\nI had it it with mayo and the nice man working there, suggested a drizzle of butter on top\n\nLoved it\n\n$21", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-08", "description": "Off grid often has food trucks during lunch time near by my office. So I came to the food trucks after 1pm and Lobsta was the only one that didn't have to wait. As expected, i got the food real fast. I can never have enough lobster rolls, but this is the worst one ever had. Here's what I think about the food, \n\n1) The bread was ok but they put too much butter so it's quite oily. 2) it's a really really small roll, not as big as a Asian female's palm. The smallest ever had. 3) it's $14+tax, total $15.3. I can get a really good and reasonable size lobster roll at wood house fish company or crabsters for less than $3 more and way better. 4) not much lobster in there, part of the lobster taste either not fresh or didn't cook well. \n\nAlthough the cook was pretty nice and wrapped my roll with tin foil since I couldn't hold the paper plate, I would never recommend this place if you are trying to get a reasonable priced lunch.", "author": "Gemma C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-20", "description": "Not bad! The lobster roll was delicious and very much like the one I had in Boston. I got the spiced mayo on the side and it was a very nice addition. However, for $15.56 (including tax) the portion you get is TINY. This is more like a snack than a full meal. I know this is SF but the value really isn't there to justify the price, unfortunately. See photo below with the small spoon for comparison.", "author": "Cameron C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-21", "description": "I love lobster rolls. So I had to try this one. It was good, but it is on the rather small side.  I opted for butter on a lobster roll w/ extra lobster meat for $21. and some change.  Don't think I'm coming back because it was truly sooooo small and I'm still super hungry.  Friendly staff...no line...", "author": "Jill P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-02", "description": "I was at the Sunnyvale Off The Grid , Perusing the Lineup Of Food Trucks.  This is when I ran into the Lobsta Truck !!! Being a Baller On A Budget , I love Lobster !!!\n\nSo I perused the Lobsta Truck Menu .  This is when I spotted a Naked Lobster Roll for $14 .\nSo I ordered 1 . I was given the option of having it with Mayonnaise Or Butter . I opted for Butter .\n\n6 Minutes later I had a Butter Dressed Lobster Roll . It looked Good the only thing I didn't like was the portion size the Lobster Roll was on the Small size for the price.  \n\nQuality was there as the Lobster was cooked just right and the Roll was nicely Toasted . \n\nThe Lobster Roll tasted great . \n\nA few minutes later my Ankle bracelet went off and I had too leave.\n\nI would eat at the Lobsta Truck again if I had a Lobster Craving and needed to Satisfy it .", "author": "Eugene L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-07", "description": "So 2 things. \n1.The lobster sandwich was really chewy and I could not even eat it. I purchased the sandwich from off the grid @ Fort Mason on Friday 8/4/17. Total Waste of money.\n2. Not only was it a waste of money but they overcharged me. The female cashier did not give me a receipt but told me it was $15 and some change which makes sense if the sandwich is 14 plus tax. Please explain how a $14 dollar sandwich ended up costing $17.55. Poor business practices", "author": "M B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-26", "description": "I went to Off the Grid in Larkspur and had the Lobsta Truck's lobsta roll with butter for $14.  It is as small as people have said it is in their reviews, and I was done eating it in lickety split.  I found it to be very tasty, though, and I did not feel like I was starving after I finished eating it.  Plus, it is the perfect size for someone like myself who is trying to watch their figure :p  I did not get any sides, but I did have some crackers of my own that I ate with my sandwich.  \n\nIf the service were friendlier, I'd give it a higher rating, but unfortunately, it was not.  I opted not to add tip onto my card payment as I planned on giving a cash tip, but after receiving cold treatment when I placed my order and paid, I decided to wait to see if it would be any better at pick-up.  Well, people who placed their order after me got served before I did, I'm guessing because they gave tips at payment.  I have to report service was no better at pick-up either; hence, the three stars instead of four I would give just for the roll itself.", "author": "Carnita M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-05", "description": "Every time I go to one of these food truck gatherings, I feel compelled to try a different truck. I like lobster rolls, so naturally I was drawn to this truck.\n\n$14 Lobsta Roll - fresh Maine lobster on toasted split top roll w/ butter:\nThe price is pretty good for a lobster roll, if you do a little price comparison with the other lobster rolls on the market. I'm not sure what happened, but mine was a little soggy. The roll, albeit buttery, was deflated and absorbed too much moisture. The lobster could have used a little more seasoning. However, there were nice big chunks of lobster stuffed into the roll, so that was great.", "author": "Joy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "Made it to Fridays OTG at Fort Mason, knowing it's lent Fridays the Lobsta truck sounds amazing. Luckily there wasn't a long line of people due to we thought it was suppose to storm but rain or shine they will be there. \nChoices?? Lobster or Crab sammich or soup?? \nHmm.. I'll take the lobster, extra meat for $$ na I'll just stick to the regular with butter on a top slice roll. Done within 5mins. My first bite was amazing, that Maine lobster was Phat!! But sadly I finished it in 4 bites. It is small but very good. \n\nThanks Lobsta truck!", "author": "Kathy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-27", "description": "As a native New Englander,  I was so excited when I was this truck parked outside my office.  \"Lobsta\" is one of my favorite things on the planet -- but it's really hard for me to find lobster that is actually good in the Bay.  I will say, this lobster tastes pretty great.  It tasted fresher than what I usually find around here, and it was awesome.\n\nI got the lobster roll with extra meat, and I did the butter (no mayo).  The lobster roll was small, which they usually are...I mean it's lobster, its expensive -- you're not paying for a cheeseburger here.  Oh -- the roll was toasted perfectly, and it was buttery -- so delicious!  I also got Cape Cod Chips and a small lobster bisque -- which was really good too.\n\nI definitely recommend trying this place, but I will admit it is not cheap, but its lobster guys -- come on.  Honestly, best lobster roll I've had in the Bay Area.", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "There wasn't a long line waiting to order at the Lobsta truck at Off the Grid in Pleasant Hill, which surprised me. Their prices are higher than the other trucks, however, lobster is expensive and the rolls are nowhere near as pricey as they are at a sit-down restaurants charge. \n\nI'm not much of a lobster fan. S loves this shellfish, so, I ordered a roll with butter to-go; it did not make in home intact.  The small bite I sampled tasted fresh. I worked at rearranging the lobster in the roll so it was not apparent that I had tasted anything, and it seemed to me that it was a good value. I took home the doctored roll, S thought it was great. I suspect that I will bring another one home, and perhaps order one for myself.", "author": "Terry T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-16", "description": "Came here for quick bite for lunch with my boyfriend. It was near his office so we decided to give it a try.\n\nWe had the lobster roll, calm chowder and lobster bisque. The soups were okay, I prefer the calm chowder more than the lobster bisque, it had more flavoring. Lobster roll was mediocre and pricey. Not worth your dollar dollar bills ya'll. It's pretty small and not enough lobster. I mean I know lobster is expensive these days, but I expected more since it was more on the pricey side.\n\nOverall, go to New England lobster, you can get a big lobster roll with cole slaw and chips for around $19!", "author": "Natalie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-09", "description": "Sandwich is tiny for the price. It was literally 4-5 bites. This would not even fill up my 3yr old. It needed seasoning and it wasn't worth the 4 blocks I walked to get it..", "author": "Ayana K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-07", "description": "I arrived at their Front St. location and was expecting a long line but apparently, it was pretty short. I was having trouble deciding on the lobster roll or the bisque and ultimately went with the  $13 bisque because it was a gloomy day and thinking a bisque would be perfect for the weather. Once I dug my spoon in, my day remained gloomy! I kept fishing and fishing and not one single lobster meat in sight. Am I spoiled because every other lobster joint I've visited usually have chunks of lobster in the bisque? Anyhow, I took a bite and then finally realize there's little grindy texture of lobster in it, but it is really real fresh lobster? Who knows because I can't even really taste the lobster! It smelled and tasted like a bit of alcoholic, is it suppose to taste like that? It's super watery and oily at the same time. Too much cream/milk. I should have went for the $14 lobster roll instead so at least I could have a more fulfilling bite from the overpriced roll. Super upset and unsatisfied.\n\nThis is going to go down in history as one of my biggest life regrets. I shall share this story to my great children one day.....", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-17", "description": "When you can't get to Maine in time, Lobsta Truck is almost the next best thing! You can't expect much more in LA where lobster roll seems to be low on demand from all the other amazing goodies there is to offer in LA. \n\nWill you be full? No, but it will satisfy your lobster roll craving! Simple menu with two types of roll (Lobster $13 or Crab $12) and soup (clam chowder $4-7 or lobster bisque $6-12). Everything else that is offered are chips, whoopie pie, and drinks. \n\nOverall, a great truck for a quick craving fix! The turnaround time is fast, no complaints! Lobsta Truck has their location updated weekly, so check it out and see if they're in your neighborhood. You won't be disappointed, enjoy!", "author": "Jen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-19", "description": "For some context, this truck is located about 2 blocks from where I work. Had a lobster roll craving one day so decided to finally check it out. Was debating whether to get the regular or double meat but after seeing someone else's regular and realizing it was so little meat I just went double. Still wasn't substantial enough but with some free chips from the office it was a decent meal. Wouldn't be a regular here but if you really crave a lobster roll, and have 30 mins to get lunch, then yeah this is a solid option", "author": "Laura D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-17", "description": "YAS!  That's really all that needs to be said.  Having grown up in New England, I am so grateful that San Francisco is finally on to the lobster roll bandwagon.  When I was growing up I'd enjoy lobster rolls by an idyllic Atlantic Ocean beach while in San Francisco I get to munch on my $20 lobster roll a block from all the SROs of 6th Street.  Not quite the same ambiance, but still an amazing lunch.\n\nLobsta Roll (extra meat) with Drawn Butter: In my homeland of Connecticut, I knew this as merely a lobster roll.  In any other State, I have to specify Connecticut-style to emphasize that it's not that abomination with cold lobster meat and mayonnaise.  Here, they don't try to partake in the debate and just offer the lobster roll both ways: the right way (butter) and the wrong way (mayo).  I upgraded to the extra meat for another $6 (for a grand total for $20/roll) and got a very healthy portion of lobster (compared to lobster roll norms).  They used a split bun and it was lightly toasted on both sides.  This is probably the closest to home I've had while living in California.  My only suggestion would be slightly hotter lobster and a tad more butter, but generally it is well ahead of the competition.\n\nLobster Bisque: The soup itself was very tasty, creamy and filled with real lobster flavor.  Sadly, there were no bits of lobster floating around (as is sometimes common with lobster bisque).   Was pretty watery and could have used some crackers or bread to make it heartier.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-15", "description": "The food was cold :(. Additionally, it was snack sized at best. The flavor was okay, slightly rubbery, but edible. SUPER expensive if you consider the size.", "author": "Jazmyn B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-16", "description": "Absolutely the most insulting price per portion I've ever witnessed in the city. $15.26 for NOTHING. Please go out of business you crooks.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-12", "description": "What a rip off.\n\nThere was no line and this should have been my first tip off. \n\nThe portions are super small. It is way to pricey. \n\nSave your money and go somewhere else.", "author": "Tata S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-12", "description": "Hmm...\n\nThe bad- What a let down...my bf asked for extra meat, that was an additional 6 bucks, which made the sandwich a whopping $20 dollars.\n\nWith that in mind and going off of the pictures with extra meat, it looks like we got stiffed.\n\nThe lobster was over cooked and rubbery. \n\nThe good- the actual toast it was on was crunchy, soft and buttery. The house mayo was really good!!! Tons of flavor and went well with the lobster.\n\nVerdict- I don't know if I'd ever come back for the price of what you get.", "author": "Jerrica N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "Delicious lobster bisque: \n- Very savory and comes with good amount of seafood bits.\n\nSlightly above-average lobster roll (comparison within SF Bay): \n- $14 for a wimpy looking roll isn't too bad for food truck prices. Lobster tasted decently fresh with a choice of butter or mayo dressing.", "author": "Tian Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-12", "description": "This was the absolute worst piece of crap I've ever eaten in my life. Where do I begin. First I requested the large sandwich which was $21. The sandwich was the size of two sliders. I question if it was the large she said \"There's extra meat on the small bread\". Of course, I get back to my office and that was a lie.\n\nThe bread was soggy/mushy.\n\nThe \"lobster\" was soggy/mushy. There were shells in it. It had no flavor and quite honestly had a very fishy (not fresh) smell.\n\nI pray I don't get sick. \n\nSam's Chowder is WAYYYYYYYYYYY BETTER!\n\nLobsta truck isn't fit for human consumption.", "author": "Sheila C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-10", "description": "Find this guys at of the Grid in San Francisco \nI seriously don't know how the lobsta truck is still on business \nThe lobster was really bad , that bad that I actually got sick from \nI'm riding the Bart home to oakland and I can't believe this lobster truck ruined my hole night !\nNever again", "author": "Pablo C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-11", "description": "I debated getting a lobsta roll for the longest time. I finally pulled the trigger. The flavor was ok. But MAN do I feel ripped off!!!!! $14 for a tiny little roll that's maaaaaybe worth $10. I've had many lobster rolls in my life. Most are a bit more than $14 but they are definitely very generous with the portions. Lobsta Truck, if you don't start giving more generous portions for the price you charge, you're not surviving for long.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "It was 20-30 minutes in line to order all the way to pick-up.  I won't do it again.  I ate the sandwich in 4 bites.\n\nTruthfully, It wasn't even that great. \n\n$14 for a mediocre lobster roll. \n\nWill to go by reviews instead of (filtered) pictures next time around..", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-10", "description": "Wow, unbelievable this place still in business. Aweful taste makes you want to puke, my buddy actually did puke!\nNever again", "author": "Dean R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "This truck is closer to my work for the next two weeks because of the Super Bowl coming into the city. I  decided to try it for lunch today because it sounded appetizing. Although it's a \"lobsta\" truck I ended up ordering a pint of clam chowder and a fresh squeezed lemonade. The guy informed me they didn't have ice, but the lemonade was still cold enough. The guy was nice but was confused on how to take a cash and credit payment since I was splitting it up. It came out alright and I waited about five minutes to get my food. The clam chowder is fantastic! Not watery at all and very creamy. It was very flavorful and not fishy tasting. It was great and I already wanted to go back and even get more! Perfect food for the cold weather and not too badly priced for the amount you get ($8 bucks). Overall, I'm bound to try this again in the coming week!", "author": "James R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-17", "description": "I and my wife are fan of lobster roll. We hunt this trunk down in Alameda several weeks ago. The experience is way disapoointed. The roll is plain and overpriced. The portion is terribly small. Butter is all you got. No add-ons. We made another trip to the five guys across the alley right after we finished it.", "author": "T W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-09", "description": "I've had Lobsta Truck many times and I've pretty much always felt the same way. Good food, ridiculous prices. If you want lobster, head to an actual restaurant. \n\nThis time, we got the crab roll (tasted great) and the lobster bisque (awesome). The lobster bisque is very flavorful but I would've loved bigger bits of seafood. Overall, good food.", "author": "Davelyn C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-29", "description": "Mediocre lobster roll at best, but really just bland and over-priced :(\n\nI consider myself an a-fish-anado of lobster rolls, having spent the first 17 years of my life in New England and eating them with great regularity even now whenever I visit the East Coast.  This, my friends, is NOT the \"real deal\"!!\n\nI had anticipated something better.  I waited in line for almost 20 minutes.  And I even ordered the \"extra lobster meat\" option.  But alas, what I received was a barely-filled roll of watery, bland, semi-minced lobster meat.  Sigh.  People, making a proper lobster roll isn't rocket science.  You only need two, maybe three ingredients:  Lobster, mayo or butter, salt.  That's really it.  Okay, some of you like some celery in there...that's okay, I guess, as long as the chunks aren't too big.  But you definitely don't want to add celery seeds or lemon juice or anything excessively pungent like that...Lobster is a subtle, sweet meat, and like many other delicacies from the sea, is easily over-powered by forthright seasonings.\n\nHowever, this wasn't really a problem here.  The problem was that the meat was flavorless (I'm guessing previously frozen?), watery, and if there was mayo or salt or any seasoning whatsoever, I couldn't really detect it.\n\nAnd most of all, I was incensed that I paid over $20 for an \"extra meat\" lobster roll that was barely a regular lobster roll.  Seriously??  I pay $6.50 for a lobster roll that size at Stop & Shop on Martha's Vineyard.  \n\nThere's just no good excuse.  I get that it's a delicacy and those cost money.  I get that your meat probably comes from a freezer.  But honestly?  If you're charging that much for a lobster roll, it really should be MUCH better than that one was.\n\nI won't be back to this food truck...I consider it to be a waste of money.  If I need a lobster roll, I'll either pony up the bucks at the Woodhouse Fish Co., or buy a lobster at the Chinese fish store down the street and make it myself.  I guarantee mine will be 1000% tastier than the one I got  from Lobsta Truck!!!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "As this California girl's quest rages on to find the most authentic Maine lobster roll this side of the Mississippi, Lobsta Truck is a worthy contender!  They are present every other week at Off The Grid Pleasant Hill on Wednesday evenings, and I've enjoyed their rolls many times!  They are an excellent place to get your lobster fix, and trust me, with many pretenders out there, this is extremely high praise.  Lobsta Truck is the real goods!\n\nIn terms of authenticity, they are on point - toasted and lightly buttered New England style sandwich rolls, stuffed with large and well-cooked lobster chunks, and you can get it tossed with mayo or butter (Connecticut style).  Their standard roll is $14 and is decent size for the price (for anyone who gripes, lobster is a top shelf item.  It doesn't matter that it's coming off a food truck - this is fresh seafood that has to be flown in from the other side of the damn country, and cooked properly - if you cringe at the price, MOVE ON).  You can get your roll beefed up with some extra lobster for another $6, though I always opt to keep it original - I'm just happy to be getting my fix!  I've devoted a LOT of time, paycheck and gas mileage to seeking out a proper lobster roll, and the wares at Lobsta Truck is worth all of it.  Every other week, I venture down to Off The Grid, order up a lobster roll (or two!) and a bottle of Maine Root blueberry soda, and for those precious bites and sips, I am in true heaven.  \n\nLobsta Truck is legit, and I thank them for serving up a delicious and authentic product daily!  You keep this California girl very happy!", "author": "Terri N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-20", "description": "I read about The Lobsta Truck from a few food blogs and heard pretty good things about them.  Like Nom Nom Truck and MeSoHungry, they've come a long way from SoCal.\n\nBasically if you're looking for simple Lobster Rolls with no bells and whistles then this is the truck for you.  Their menu is really straightforward.  For the Rolls you have a choice to pick between Lobster or Crab and to dress it with either Mayo or Butter.  For $13-14 you get a decent sized Roll.  They give you option to add more meat for $5 more if you're really hungry.  But for me, their standard size Rolls are good enough.  They also have Clam Chowder and Lobster Bisque which you can order a cup or a big bowl.\n\nLobsta Roll with Butter --  http://bit.ly/PVQHRq\nI'd probably compare this to Luke's Lobster in NYC.  The brioche roll is slightly smaller than Sam's or New England but they definitely give you a fair share of Lobster.\n\nCrab Roll with Mayo --  http://bit.ly/1glp7ll\nFor a dollar less, you can pick up the Crab Roll.  Like the Lobster Roll, they give a good amount of lump Crab meat.  This in my opinion is the better of the two.  It might be because I'm more of a Crab fan than a Lobster fan.\n\nI'll have to come back again to try their soups.  I wouldn't mind coming back to visit the Lobsta Truck as their rolls are pretty legit, cheaper than other Lobster Food Trucks, fresh, and rightly sized, especially if you visit them at any Food Truck events.", "author": "Rodney H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-26", "description": "Before heading to the Lobsta Truck at Off the Grid in Alameda, I read the reviews others had posted on yelp: The sandwich is too small.  It's too much for $14. There was a short wait for food. \n\nI headed out to see what the fuss was about. I love a good lobster roll so why not? There were about 5 people in front of me and, by the time I ordered my lobster roll with butter, 6 people behind. The cashier was friendly and took my order.  5 minutes later, I was passed my lobster roll. Although it can be considered small, remember that you're buying from a food truck. Most items here are going to be smaller portioned and more expensive. \n\nI took a bite of the perfectly crispy \"bun\" (no, it isn't a hot dog bun...think more like a well-defined grilled cheese) and into the lobster. The lobster was fresh with that notable \"crunch\" that you get when you know your seafood wasn't frozen. It probably took me about 5 or 6 bites to finish it...and then a couple more to eat what had fallen out into the tray. \n\nWould I go back? Absolutely. $14 is hefty, but for the quality and fast service, it's definitely worth it.", "author": "Olivia C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-14", "description": "Went to the OTG in Alameda and was on a mission to try food trucks I never tried yet. The lobsta truck caught my attention and sucked me in like tracker beams. I ordered the $14.00 lobster roll and you get a choice of butter and/or mayo so I ordered it with both. The lobster roll were literally the size of sliders. \n\nI appreciate there was lobster meat falling out of my sandwich but seriously, the lobster roll is the size of a iPhone. I finished the lobster roll in 3-4 bites and wasn't satisfied at all.  I really didn't taste any mayo but did taste the butter on the lobster. Definitely skipping the lobster truck next time I go to a OTG.", "author": "Jocelyn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-04", "description": "$14 for a lobster roll?? You be the judge whether that's worth it. My friend and I decided to give Lobsta Truck a try since we've always been eying it ever since we first checked out OTG. Pricing aside, you really get a small piece of bread that's stuffed with lobster claw meat.\n\nNow, the lobster is indeed delicious. Add the butter and the crunchy roll and you're in heaven. However, you can easily gulf down $14 in two bites. This aint sushi where it seems like eating $14 in a bit is like heaven. It's lobster... and though I love lobster, I don't think it's worth paying that much. Not when you can get it at restaurants.\n\nHowever, it's worth a try so I recommend you check it out!", "author": "Bryan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-19", "description": "Lobsta Truck is now serving the San Francisco Bay Area! I feel silly having been the first one in line when they made their debut at the Off the Grid: 5th and Minna for lunch. \n\nTheir schedule is posted on the website. \n\nIf I would return I would go for the non traditional mayo lobsta roll only because I was not a fan of the low quality tasting butter which kind of ruined it for me. While the prices are actually cheaper than a standard lobster roll (~$22) I was not a fan of the quality of the bread (light and airy like cheap grocery store bread) or the butter/margarine mix.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-16", "description": "I had 2 tacos before eating here, so wasn't that hungry and I was lucky it was so small.\n\nWent to find them last Fri 4/11/14 at 5th & Minna in SOMA where Off the Grid was for lunch.\n\nI asked about the Lobsta Roll to get it with Butter or Mayo and the cashier said for first timers she recommends the Butter so I got that $14.\n\nIt took about 10 minutes or more to get my food.  It was a small roll nicely toasted & buttered.  Lots of lobster meat in that roll though.  I enjoyed it, but if you didn't eat 2 tacos beforehand maybe get something else too like clam chowder (cup $5/ pint $8).\n\nI charged it.\n\nwww.lobstatruck.com\nFollow them on Twitter & FB\ninfo@lobstatruck.com", "author": "Ann L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-05", "description": "2.5 STARS\n\nThe Lobsta truck was having a Fort Mason special. A lobsta roe roll. I love roe so I thought why not?! Plus it was their last one so it was meant to be right?!\n\nI was disappointed in the roll. It had a nice egginess to it but since they didn't do much except put roe on a bread roll, it was just eggy and dry. I wish they would have used a spread or mayo at least.\n\nI'll probably try a normal lobster roll next time I see the Lobsta truck, but the roe roll was a huge miss for me!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-31", "description": "The lobsta roll is very tasty, but $14 for two bites is a bit pricey.  Their clam chowder is very good and reasonably priced.  I will go back again, after I get a 2nd job and save up some money.", "author": "Jin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-07", "description": "Very meh and very small portions as everyone keeps saying. If someone in your group says hey we should get seafood - remind them this from a food truck and you should get seafood elsewhere. Not sure how this truck is still trucking along with other Off The Grid frontrunners with such low reviews.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-21", "description": "I am a huge fan of lobster so whenever I see lobster roll, I always want to try it.  I always like getting it with butter vs. mayonnaise so that the lobster flavor can shine through and at $14, it is decently priced for lobster rolls which are usually $18+.  It is on the light side (literally as the wind blew it across the table) which is great if you want to try another truck but not so great if you're on a budget.  \n\nIn comparison to other lobster rolls like Woodhouse that I have tried, it's nothing memorable but as long as they do not increase the price, I would get it again.", "author": "Joyce Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-29", "description": "Got the lobster roll with extra meat for $20\n\nPros:\n- Lobster meat was very good, good quality, and cooked right!\n- Simple\n- Tastes and smells like the ocean! Lol\n\nCons:\n- Small\n- Pricey for a food truck food \n\nOverall:\nWe bought 1 lobster roll with extra meat and fell in love so we eventually bought another one. I guess people are complaining because it's expensive, but you are getting ALOT of lobster meat. I bought one lobster roll at the fishermen's wharf before for $20 and it was crap with hard bread and hardly any lobster (they trick you!) so this place definitely gives you what you pay for. It's seafood people... You can't expect them to give you that for like $5 lol", "author": "Vonnie T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-06", "description": "I was disappointed at the lobster roll I ordered. I had the expectation that it would look like the lobster rolls in the East Coast, but to my surprise, the lobster roll was a lot smaller than I thought.\n\nThe lobster roll was very simple--buttered lobster and grilled slice of bread.  With it being $14.00, I really wish they didn't use a grilled regular slice of bread that you use to make your sandwiches.  I would rather have them cut a baguette into fourths and use that instead!  The lobster was nothing special and the portion was SO SMALL that I was still starving afterwards.  I really wished it had more intricacy so I could at least feel like I'm getting my money's worth. As a result, I ended up buying some pork belly fries from another food truck at OTG, which was $7.00 and I was way happier purchasing that than the lobster roll.\n\nedit: Also, I just checked my credit card statement and it said they charged me $16.00 instead of $14.00!!!!! I called the credit card company to modify the $2.00 difference.", "author": "Iris C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-12", "description": "Paid $14 for basically a hot dog bun filled with some lobster. Total rip off. They advertise that they sell Maine root soda and when I asked the girl for a certain flavor she just stared at me. I had to repeat it and she awkwardly replied \"uh, whatever we have down there\" and motioned to something that looked like it should have been a cooler filled with sodas. There was no ice and there were just a handful of cans in there that were beat up and dirty looking. I gave one extra star because the lobster was tasty sure, but the value was shit. Will never ever get food from this truck again. I would actually walk up to people that are about to order and stop them from wasting their money", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-20", "description": "This is my first review, but this place warranted comment.  The lobster and crab rolls were minuscule, the taste meh and the experience forgettable!  We were the first in line and they had no mayonnaise!  This was definitely not worth the price! \nsigned,\nDesperately Disappointed from Walnut Creek", "author": "Kimberly K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-27", "description": "We had a work event and Lobsta Truck was one of the food trucks present. It had the longest line and the longest wait. I waited over 30 minutes to get my lobster roll with butter. It was good, but eating lobster rolls in Boston is much better. The lobster roll was small, and the size of a hot dog bun. I realize that lobster is expensive, but I would not pay $14 for it. \n\nNext time I would consider the crab roll.", "author": "Jackie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-16", "description": "had this recently service was good, food didn't take too long and the price for the Lobster roll is about industry average in the bay area $14 and maybe even cheap considering it's in SF. As other have mentioned it's not a huge sandwich so it can be an expensive habit but these rolls were pretty tasty and I enjoy that they are an option in the city.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-15", "description": "Normally I try not to write bad reviews unless it's absolutely warranted. All I have to say is the cook is quite a horrible person!\n\nMy wife and I ate at this truck at the off the grid in pleasant hill about 2 weeks ago and the food was actually quite good.  The problem however is the lady who waited on us was new, but very pleasant and friendly. She ended up messing up our order which is still totally okay, but the owner/cook turned and friggen yelled at her!! It was sufficiently bad that when she turned back to us there was tears in her eyes while she had to finish helping us. \n\nAnyone who treats their employees that way is definitely NOT going to get my business again.", "author": "George A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-21", "description": "The lobster in the roll tasted \"off.\" Not spoiled, just very bitter and astringent. Maybe old (or frozen) lobster? A long way from the great taste of fresh lobster.  It's also a tiny roll for $14.\n\nThe clam chowder was very heavy and lacked flavor. It''s about the quality you'd expect from a chain restaurant.\n\nPrices would be fair if the quality was better, but they charge way too much for the mediocre food they're serving up.  \n\nBottom line: Pass it by.", "author": "B D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "Yesterday was my first SF food truck experience. I spent $23 for the lobster roll (not including tip) a Diet Coke, and chips. I paid $6 for extra meat. \n\nWas it worth it?\n\nYAAASSS!\n\nEvery cent. The plump, buttery chunks of meat left me forlorn after the last bite was finished. Now I find myself fantasizing about the next sandwich. It's a good thing that I live an hour away. My recommendation: buy two of them so that you are not filled with regret.", "author": "Annette D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-09", "description": "2 stars only because I like the concept; but pretty much stops there. Tried the 'Dungeness' crab with butter and portion was way too small for a $13 sandwich...totally unseasoned crab, cheap bread, cheap butter, and not even a lemon wedge (?). \n\nThankfully there was no line, as our 1 order took over 7 minutes to produce...what's going on here guys?\n\nWe will not try the Lobsta Truck again.", "author": "Alan R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-05", "description": "Shell in the lobster rolls, they dont serve their food in order of purchase.\n\nWorst lobster truck out there. Overpriced lobster shell sandwiches are all they serve.\n\nJust spent $55 at off the grid el cerrito, including a $10 tip. They left A TON of shells in my lobster roll, and they served food to the 4 people that ordered after me.\n\nDO NOT GO HERE. DO NOT GO HERE.", "author": "A S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-13", "description": "Food is great if not large. I am worried though about the practice of the guy counting my change and not washing his hands in front of me but repeatedly touching my food tepeatedl", "author": "John R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "Perfect lunch - price/food quality/portion is on par for the type of food they serve...c'mon folks, seafood is expensive...more than enough meat.  Clam chowder and Lobster bisque were both good - could use a little bit of meat but still delicious.  \n\nI like the simple no nonsense menu.  Glad to see a different food truck in FiDi.  \n\nDefinitely a fan and will go again.", "author": "Grace D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-31", "description": "I was on my way over to Split Bread on Mission and saw the Lobsta Truck parked nearby. There was no line which should have given me a hint. I walked passed the Senior Sisig truck and you would think it was a ride for Disneyland nearby...\n\nI ordered the $13 Crab Roll which was given to me within a minute.\n\nThe first thing I noticed is that it felt small, which it was.\n\nOverall, the toast had a nice buttery taste to it, but it didn't have any crunch. So it must have been sitting there. The crab tasted fresh, didn't have a fishy smell and I was pleased that there were no crunch shell parts.\n\nSo if this was a $8 dollar sandwich it would be great, but definitely not worth $13 since the portion was small and the bread would have been freshly toasted.\n\nNext time trust I'll trust my instincts when there's no line (or look at Yelp first).", "author": "Gary C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "OMG!!! They have Maine Root soda!! I've been looking everywhere for the Mandarin  Orange Maine Root soda and Lobsta Truck sells them!! \n\nTheir Lobsta Roll is good but it's so damn expensive!!!", "author": "Alice X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-11", "description": "What's not to like?  If you get there early and beat the long line, you're going to enjoy some buttery, lobster goodness.  For $12, it isn't cheap, but the lobster roll came with a generous helping of lobster that was fresh, tender, and cooked just enough to still have some snap to it (not mushy and overcooked).  It was probably about a lobster tail's worth of lobster, so for $12 it isn't a rip off.\n\nWe got lucky and there was a mini food truck gathering a few blocks from our house.  I made sure to get there right when it started.  By the time I ordered and got my lobster roll, there was already 15-20 people in line.  \n\nThese guys should open up a restaurant somewhere.  Near the LB Aquarium would be perfect.  While the food truck thing is fun, sometimes it's nice to not stand in line and to enjoy your food while sitting at a table!", "author": "Fernando A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-22", "description": "Heard good things from coworkers about this truck so I decided to try it out.  I wasn't too hungry and only ordered the lobster roll with butter which cost $14.  It only took 30 seconds to cook it up and then I was handed my roll.  Dang, this lobster roll was sooo tiny!  I'm petite but this definitely wasn't enough for my lunch.\n\nBesides the small size of the roll, the lobster was pretty good but I really liked how buttery the bread was with the lobster.  It's a single slice of bread but it was toasty warm, soft and a bit crunchy.  I'm glad I finally got to try this truck that my coworkers keep talking about but I had to take off one star for the pricing and another star for the small quantity you get.", "author": "Sam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-20", "description": "We tried the Lobsta Truck at Off the Grid - North Berkeley (Sunday Nights). It's new to the Nor Cal food truck scene and probably the most expensive truck at OTG, but my goodness, those rolls were divine! I tried the crab roll with light mayo (you can choose butter or mayo for the rolls; they're mixed to order). My date had the lobster roll with butter. I actually thought the crab was more flavorful, and the bread they use is perfectly soft, lightly buttered and toasted. I could have eaten two, easily.\n\nThe lobster bisque was way too creamy, and not flavorful enough for my taste. Kind of like eating heavy cream with a hint of seafood flavor. So lesson learned, splurge on the rolls and you'll be very happy!", "author": "Nique F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-08", "description": "While it was a decent tasting lobster roll $14 to pay for what is essentially an appetizer is a little disappointing... They could at least have a decent size roll to go with your lobster, it was the size of a half of a piece of bread, it reminded me of when I was a child and used to make sandwiches on one piece of bread and fold it in half... Taste was good, but the price was too much...", "author": "Nicholas G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "Oh, Yummy!  I have been waiting to visit this truck since I first learned about it.  I had the lobster roll with extra meat and butter.  A little pricey for lunch, but I expected to pay and it was delicious!  The bread was soft and grilled perfectly.  The lobster was all big chunks of claw meat and had just the perfect amount of melted butter.  Can't wait to try the chowda and crab roll--these are next!  I also love that the website shows locations around the Bay Area--I can easily find a truck and eat there at least once a week.", "author": "Patty R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-25", "description": "At the OTG: Pleasant Hill, Lobsta Truck caught our eye and we decided that their lobster roll will be one of the foods we will sample. \n\nIt was delicious! The lobster meat was cooked properly and not at all rubbery like some lobster we have had before. We are definitely fans, but I don't think I can say that we will order from them every single time. Even though it is lobster and they do not skimp on the meat, at $14 for a sandwich that is on the smaller side, it is quite a luxury. The cup of clam chowder is $5. It has good flavor but a little watery for our liking, so we probably will not try it again.\n\nIf you have a hankering for some lobster, Lobsta Truck is worth the place to do so. 3.5 stars but because it is on the pricey side, I cannot round them up to 4.", "author": "Clarice O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-17", "description": "I went recently as I was on a bisque kick. A small cup is $7 and has decent lobster flavor. The meat is really finely shredded in so there's no satisfaction of getting a chunk like in their roll. I think for twice the amount just plunk down for the roll and get the real satisfaction!", "author": "Kim N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-15", "description": "I ordered a lobster roll. It was $14. The roll was a folded over slice of bread. The filling was just lobster and butter. Not worth it for the price. The only reason I gave 2 stars is cause the lobster itself was tasty. \n\nI could make 3 lobster rolls at home for this price and they would be much better tasting and bigger.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "Oh sweet lobster that was good!  General consensus seams to be that the Lobsta Roll is delicious, but grossly overpriced.  I couldn't agree more.\n\nIt's an East Coast staple.  They take a buttered and toasted slice of white bread, fold it in half, and stuff it with huge chunks of lobster covered in butter (or mayo if you prefer).  It's really good, but it's almost comically small.  The whole thing takes 4 or 5 bites to finish max.  While they do give you a decent amount of lobster, at $12 a pop I don't think I would get it again.\n\nThe lobster roll would have left me still starving had I not also ordered their clam chowder which was also pretty good.  It was creamy and great flavor, but could have benefited from more clams.  But like the lobster, it was expensive.  A cup will set you back $4, while a pint costs $7.\n\nThere's something to be said about spending nearly $20 at a food truck for a meal that doesn't even fill you.  But still, the food was quite tasty and there just aren't too many places around that serve lobster rolls.\n\nNote: This is the same truck as the one in LA.  They just make stops in both counties.", "author": "Peter P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-12", "description": "I'm going to say 3.75 stars or so? definitely will eat it again because there really are no places to get a lobster roll....it's weird going to a fancy sit down restaurant asking for a lobster roll to go on my lunch break.\n\nI craved and I craved for a good lobster roll ever since my east coast trip and this truck was going to be my saving grace, but I was let down by my high expectations. If you like lobster, but have never had a good lobster roll, you will like this, it's not bad. but don't you EVER say this is like the ones you've had in Maine or Boston. this does NOT compare to that. Like I said it's not bad. You have to try these things if you've never had one, $12 is actually cheap compare to the restaurants that serve these. But when you've had as many as I've had in the past. this is like Burger King....just a little better than McDonald's...but nothing to brag about.\n\nThe lobster was fresh, need a bit more salt/flavor, the roll was TOO buttery, when I bit into it, oil DRIPPED out. I think if they add a bit more salt and made it a tad bigger I would've felt better paying $12 for one sandwich at a food truck,  $9 would've been more reasonable for \"gourmet\" kitchen on wheels. I put up a picture of the roll along with a $5 bill for size reference, take out a bill, the sandwich is smaller than that, and mostly bread anyway.\n\nCheck out my review of Lobster Me at Planet Hollywood/Miracle Mile in Las Vegas, NV. THAT place had much better rolls than this...but it's $17. given that they are in the middle of the dessert I can live with that, after all, I can lose $20 at the table in less than a minute anyway.\n\nHere's a list of LA places that have decent (some of them) rolls http://laist.com/2010/07/22/lobster_rolls.php#photo-1", "author": "Mike N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-22", "description": "When i seen the truck I was excited. There was no One waiting. That should have made me walk away.  For the price of the roll I expected a bigger sandwich. It fit in the palm of my hand. It was big enough to feed my two year old niece.  The taste was bland. Customer service was horrible. I will never eat here again and neither will my friends. Boooo!", "author": "Latritaha R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-16", "description": "I happened to be in Alameda last Sunday so I took BART to North Berkeley for Off the Grid specifically to eat at Lobsta Truck.  It was well worth the trip.\n\nLots and lots of tasty lobster.  I didn't mind the thin bun because I came to eat lobster, not bread.\n\nI'll be going back to try the version with mayo and then the crab roll.", "author": "David B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-22", "description": "Had your Lobster Roll at Dreamforce! It was so good I thought I'd try it again so I walked in rain to go get it... and the truck wasn't there! I waste my whole lunch break! And I'm still hungry #buzzkill #hangery", "author": "Latashia G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-14", "description": "Wasn't there when I went! Extremely frustrating especially when I had looked forward to this!", "author": "Trevor A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-09", "description": "ZERO STARS!\n\nGot a cup of lobster bisque with extra meat for $10 ($7 for soup, $3 for meat).\n\nVery disappointed because:\n\n1) the cup is super tiny\n2) the bisque is super watery - taste like they used 1 tablespoon of soup and diluted it down with 3/4 water\n3) There is NO LOBSTER OR CRAB MEAT\n4) Basically just threw $10 away for a tiny cup of flavored warm water.\n\nI didn't even bother trying the lobster roll because they were the size of my fist for $14! (And I have tiny hands)!\n\nSorry Lobsta truck. You lotsa suck. Goodbye forever.", "author": "I-Ching L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-25", "description": "Ahh the infamous Lobsta roll.  \n\nFor $12 it's much smaller than I expected or that you see in these pic.  http://www.yelp.com/biz_photos/8y3O9KJmofweGxvAclw2tQ?select=vyNWGiUrCCGO7VT0YufWQw.  Good size chuncks of lobster is stuffed in a toasted buttery roll.  The lobster itself didnt have a lot of butter on it but was good.  I didnt order anything else from the truck so I was still a tad bit hungry.  Next time I will try the crab roll and maybe a soup.\n\nIt was crustacean from a truck yummy goodness!", "author": "Lica N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-22", "description": "Lobster Truck has a limited menu:\n-lobster roll\n-crab roll\n-clam chowder\n-lobster bisque\n\nlocale: OTG: lake merritt(3/21)\neats: lobster roll(14) w/butter\n-small roll (little bigger than a dinner roll)\n-overflowing with lobster chucks (about 4) in a tiny roll\n-butter faintly tasted, lobster flavor just as faint\nnot sure if sourced from fresh lobster\n-came out within minutes.\n\nleftovers:\n-not really a fan of lobster\nusually like lobster only as lobster yee mein (fried noodles, cantonese style)\n-value 2 stars.\n-chips, drinks sourced from cape cod area. nice touch.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-11", "description": "After having tried the lobster roll from Doyle's Cafe in Boston, I've been craving for a delicious lobster roll in CA. When I found out about Lobsta Truck, I got so excited and decided to visit one of their trucks right away. Luckily, one of their trucks is part of Alameda Off The Grid. \n\nWhen I got there, around 2p, the line was really long and they're out of their lobster bisque. After waiting in line for around 15 minutes, it was finally my turn. I ordered 2 lobster rolls, one with mayo and one with butter. I waited for another 10 minutes for my food and finally....\n\nI was so disappointed when I opened my bag, they're so tiny! Yes they are filled with lobster, but the lobster was really chewy. It's probably the fat of the lobster. There's also absolutely no flavor in them! It's basically just lobster fat and bread. With the price that they charge for, it's totally not worth it. Not even to satisfy a craving!\n\nI guess my mission of finding a good lobster roll in CA will continue.", "author": "Cathy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-22", "description": "I ventured to Off the Grid Fort Mason tonight. Not too hungry but more than curious as to what they had at the event.\n\nOne new truck that I spotted was Lobsta Truck. Gotta try it.\nThe line was not huge (compared to other trucks) so I hunkered down for the wait and contemplated the offerings.\nLobster roll. Check. \nCrab roll. Check. \nClam Chowder. Check. \nLobster Chowder. Check. \nCape Cod Chips. Check.\nWhoopie Pie (?)\n\nIt was cold. I needed something hot. Got the clam chowder cup $5. It was not a very big cup but I know why. It's R-E-A-L-L-Y rich soup. The soup musta been thickened with heavy cream and pureed potatoes. There were big pieces of clams and bacon which you could taste with each mouthful. Delicious but not low-cal food.", "author": "Joanna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "Yum!  I've had the lobster sandwich with butter twice now at the Off the Grid Fort Mason and the 5th and Minna OtG location.  So good with the lightly toasted bun, chunks of lobster dripping with melted butter!  I noticed they had a crab sandwich last time as well.  I need to try that next time!  I didn't post a picture of my lobster sandwich as I am sure there are already tons of them posted anyway.  Can't wait to see you again, Lobsta Truck!", "author": "Maile N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-26", "description": "OTG Oakland/Lake Merritt\nFriday pm\n\nExcited to see Lobsta Truck was going to be at the event, so dragged hubby and my teenage son there for dinner.\n\nLimited menu:  Lobster Roll.  Crab Roll.  Clam Chowder.  Lobster Bisque (I think that was it)\n\nOrdered 2 lobster rolls and cup of lobster bisque.\nI kid you not.  My 13 yr old inhaled the sandwich in 2 mins.\nIt was on the small side, a bit pricey IMO\nThere were chunks of lobster on the roll - which is prob the size of 2 King Hawaiian rolls put together.\nBisque was flavorful.\nNot sure if I'll go back since there are other better lobster roll joints in the Bay Area.", "author": "Margaret W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-05", "description": "I finally hunted down the Lobsta Truck at Off The Grid in Berkeley - well, I persuaded my husband to hunt it down. I'd  love to give it more than 3 stars. Portion size was the cincher - the only one.\n\nI had the lobster roll.  It was divine.  You can have your lobster with buttery goodness or mayo.  I am not a mayo person. \n\nThe bread looked like Texas Toast - lightly grilled and buttery.  However it was softer and there appeared to be only one slice.\n\nMy sandwich was heavenly - just small.  Given lobster is the main ingredient the price is justified.  However,  I recommend you not come hungry.  Eat a salad first or between meals.\n\n\nService was quick and courteous. Bring your tastebuds, not your appetite.", "author": "Joanna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-11", "description": "Let's face it, we are a long way from New England, and lobster is expensive here. The food truck is certainly more expensive than other food trucks, and more expensive than Sam's Chowdermobile.\n\nHowever, the lobster and lobster chowder were very high quality (better than the last lobster roll I had at Sam's which tasted rubbery and stale). The sandwich (which I wished could have been larger) had large chunks of very fresh tasting, sweet lobster. The claim chowder had a rich taste and there were chunks of lobster in the soup (even without ordering extra meat).", "author": "Matt R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "DELICIOUS.  I always get the crab with extra meat.  The crab is fresh, not frozen; you can taste it.  Big chunks, lightly seasoned, perfect with the bread they use.\nYes, it seems kinda \"small\" relative to today's US super-size portions, but honestly it's more than enough.  They pack it with meat, and then cover it in butter.  When I'm feeling particularly gluttonous, I get two sandwiches. But that usually puts me over the edge.  And I eat a LOT.   I certainly don't mind the cost because they do the work and hand me the perfect snack.  I also don't always get to splurge on this, so when I can, I don't hesitate or skimp!\nThanks, Lobsta Truck!  You guys make me smile!", "author": "Steph C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-10", "description": "I was pretty excited to see this truck sitting outside our building on Pine street.\n\nThen I got even more excited when at 12 o'clock on a Friday, there was only 1 person in line!\n\nBut I should have gotten the hint....\n\nFirst and foremost, the size vs price ratio is wayyyyyy outta whack. Our sandwich was ridiculously tiny and 14.00....don't add extra meat else you are looking at a 20.00 for about 5 bites.\n\nNow maybe it was my fault for getting a crab sandwich at a lobsta truck but seriously, it tasted like oily bread with no flavor.\n\nOverall, glad I tried it but I will not be returning.", "author": "Andrea P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-27", "description": "What a let-down. 14 dollars for the tiniest lobster roll I've ever had. You can finish that thing in about three bites. I also ordered a cup of clam chowder, which was really gritty and bland.", "author": "Zach B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-04", "description": "Boooo... what a disappointment.  \n\nI got the opportunity to try this little food truck at the huntington beach food truck festival.  We ordered the crab roll which was $11.  They asked us if we wanted mayo or butter.  We told them we wanted both.  Well that was exactly what we got.  The crab roll was basically a slice of bread rolled like a taco with stuffed crab meat mixed with butter and mayo.  Waste of money.  The crab tasted like its been from a can.  Definitely not fresh.  The only up side to this place is their delicious $2 lemonade.  Was so good we came back for another one.", "author": "Cat N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-30", "description": "I tried the Lobsta Truck for the first time earlier this summer at the Munchathon event in Irvine. I had been dying to try it ever since I read about it's entry into the food truck scene in the OC Register. I was so sad when I saw the huge line for it at the event, but I was determined to try it so I waited patiently until I could order.\n\nThey have two main items that they serve on their menu - the \"lobsta\" roll and the crab roll. They have a few other items such as clam chowder, desserts and drinks as well, but my eyes were on the lobsta roll. The lobsta roll is fresh lobsta meat on a toasted split top roll and you can get it with either mayo or butter. For $12, I thought it would be bigger so I was a little disappointed to see that it wasn't that big (hehehe, I can't help myself - *insert \"that's what she said\" joke). Nonetheless, the lobsta roll tasted bombbb. The bread was toasted just right and the lobsta meat wasn't drenched in butter, just enough to give it the additional flavor.\n\nService was excellent. The guys in the truck were super nice. I guess one of them heard it was another customer's birthday so when he called up her order, he also gave her a whoopie pie for free as a birthday gift. Overall, yes, the food here is really good, but for the price, it's sorta meh, since the one roll won't fill you up and you'll leave still hungry. Still, it definitely doesn't hurt to try it.", "author": "Elise V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-25", "description": "Incredibly delicious lobster and heavily buttered roll.  Loved it.  But it was so small.  I probably could've eaten another one and still not be full.  I'm glad I tried it but don't think I'll stop by the truck again.  Too expensive for what you get.", "author": ".Hon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "So I got the $5 cup of clam chowder. I love the taste of freshness ..felt like you're eating a healthy soup. the only downside is that I only found one potato in my small soup I wish it was more chunky but oh well. I love clam chowder period if I could I would eat it all day everyday .. The price I understand that's just most of the food trucks.", "author": "Myrna R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-19", "description": "Yeah, this place wasn't a homerun. Last week at Off the Grid Daly City I saw people with awesome looking lobster rolls, and I thought that they were from here (but maybe not). So this week when there wasn't a long line, I decided to check it out.\n\nHonestly, it was just a bit bland. I make lobster rolls myself, imitating the recipe used at Son of a Gun in Los Angeles (AWESOME)... and there's just more of every flavor. More lemony. More sriracha-ey. More garlicky.\n\nLacking in flavor, kind of on the small side, and really pricey. Yeah, not impressed.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-16", "description": "First saw this truck at OTG: Millbrae's soft opening but there were too many trucks I wanted to try, this one didn't make the cut. Saw them at OTG: Serramonte so I had to try them this time around.\n\nMy Order:\nLobster Roll: ($14) w/butter\n\nI'm not a fan of mayo so I opted for the butter sauce. Honestly, it wasn't that memorable. The lobster pieces were nice and juicy and the sauce was barely noticeable. This was fine since I could taste the lobster better, but for the price, I'd rather go to New England Lobster Market as you get more value (and food) and a better roll.", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-01", "description": "Wish I could check in at a truck but apparently yelp thinks I'm too far away from it .\n\nThe lobsta truck serves lobsta rolls and they are good. \n\nIt's been weeks since I've been here and I think about them all the time so I might upgrade this review to a 4.", "author": "C D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-11", "description": "Yum, yum, yum! Lobsta Truck was at Dreamworks for a party serving up their delicious lobster rolls. They were so good! Everyone kept going back for more! The bread was nice, thick and slightly toasted. The lobster was fresh and delicious and covered in yummy butter! I really enjoyed it.", "author": "Kari G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-13", "description": "Terrible value for such a high price. My lobster roll was 14$, and was quite literally 5 small cubes of lobster, on a lightly toasted roll that was probably four inches long. I would say it was moderately tasty, but nothing that knocked me on my ass. \n\nI don't know what else to say, as that was all I ordered.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-01", "description": "I thought this was really mediocre. The bread was dry but the lobster was dry and lacked flavor even with the butter. For 14 bucks i don't see how this would be a must have. I think if there was a way to create more flavor with and fix the issue with the dryness I'd come back. It did taste fresh and I love lobster but I think perhaps on this one day it missed the mark.", "author": "Derek S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-12", "description": "Lobsta truck would be the ideal place if you're craving for a quick and clean lobster meal. The price was overly expensive, $14 dollars for a very very small lobster roll with tiny lobster bits. Unfortunately, the price just did not match the amount of food and lobster pieces on the roll.", "author": "Ka Yan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-26", "description": "Complete rip off for the price. Cashier Ask if you want extra meat and doesn't tell you the price. For six dollars the meat looked the same as it would with nothing extra. The butter made my stomach hurt.", "author": "Josephine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-05", "description": "Lobster Roll with butter\n- about 4 bites worth for $14. is it good? yes. is it worth it? meh not really.  i enjoyed the buttery bread more than the rubbery lobster meat\n\nthe wait is long even if the line is short, don't be fooled, hands are moving slow in here.  i giggled as i saw one of the guys in the truck open a bag of bread and stare off into the distance for a good minute.\n\nP.S.: make sure to check your change if you pay cash and your order before you leave, during my 5 person wait in line for ordering/picking up there were 2 people who were either not given change or the wrong change and had to ask for their change back, also there were 2 orders that had been messed up (lacking extra meat)", "author": "Tina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-15", "description": "Did I forget to mention I love the food truck round up on Wednesdays off Teller and Michelson?\n\nThe lobsta truck line was amazingly short when my friend and I decided on frequenting their truck for lunch yesterday.  The truck had a good selection of different kinds of rolls so I opted for the lobster roll with mayo and she got the one with butter.  Yes, the prices are slightly steep but do you actually eat lobster every day? And for lobster this fresh, it is definitely worth it.\n\nThe roll was a wonderful concoction of mayo, the freshest lobster roughly chopped in a delicious roll that was lightly toasted with butter on the outside.  I loved the lobster, don't get me wrong, but the roll was what did it for my friend and I.\n\nThe service was super quick as well (which is always a plus) and super friendly.  I only had the roll and a diet coke for lunch, and I was pretty full.\n\nIf you go to the food truck round up, go after 12 and closer to 1PM, it helps avoid the lines and you will be able to find a seat where you can enjoy your tasty meal.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "Let me start by making fun of all the morons crying about how expensive and small the lobster rolls are at this food truck. Do your fucking homework rookies. I don't know if you yelpers are getting lobster rolls off the lobster black market for less than $10 bucks but fyi lobster rolls aren't cheap and they are not  supposed to be served on colossal buns. And for those complaining of the crappy bun....ask to have it extra toasted, problem solved. Would I go back to this truck, hell ya. Next time I'm gonna ask for extra butter. Friendly cashier, fast service, main root soda (only found this in Brooklyn)! Fin! If you like this place definitely check out Red Hook in Brooklyn, it will blow your mind. But wait for it, the lobster roll at the Red Hook are in the realm of $20 bucks per roll, that includes tax (lobster is straight from Maine). Now complain rookies!", "author": "Nick L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-18", "description": "I've tried their lobster roll with extra meat twice at the Foster City Off-The-Grid event. Both times the lobster smelled fishy and tasted off. In contrast, the lobster from Sam's Chowder I had this past week did not have the fishy smell.", "author": "Wilson C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "I tried the Lobsta Truck in Novato. \n\nI wanted to hate this small $14 (yikes!) sandwich, the size of a regular Hot Dog Bun, filled but not overstuffed. \n\nBut I have to say- it had plenty of lobster meat in it- including a nice mixture of claw and tail. Just because you CAN eat the whole thing in 5-6 bites doesn't mean you really SHOULD eat more lobster than that. \n\nI consider lobster kind of a special summer luxury. And, lobster IS very rich.\n\nI had mine on decent grilled roll- similar to a hot dog bun (but maybe it has been trimmed prior to grilling?) which was hot and fresh. Grilled with care. I chose drawn butter (rather than mayo- the alternative that was offered)\n\nI think I would like just a spritz of lemon and a sprinkling of chives or scallions, to balance the delicious flavor. Maybe that's just me?\n\nThat being said- the lobster I ate at this  truck was sweet, fresh-tasting, perfect texture- and superior to some lobster  I've eaten in some expensive restaurants. How can that be? This guy must know what he's doing. So much can go wrong with this delicate shellfish...\n\nLobster- It's a special treat. \n\nPlease, Lobsta Man, consider charging $12 for this sandwich, be reasonable. It's just not quite large enough to be $14. \n\nAnd it doesn't need to be larger.! It just needs to be $12.\n\nAnd keep up the good work!", "author": "Susan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-29", "description": "Small sandwich for 14 bucks.  They tried to upsell me on extra meat for another 6 bucks.  Actually the amount of meat was adequate.  Lobster was fairly fresh, but totally naked.  It needed mayo or a bit of butter.  I probably won't return.", "author": "Max K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-29", "description": "the first time i tried this truck was at the OTG in the Marina on my birthday the first Friday of October. I know that lobster is expensive so i sucked it up didnt let the $14 price scare me away. \n\ni ordered the Lobster Roll with butter and my cousin ordered the Lobster Roll with mayo and EXTRA lobster. by the time we arrived to the next food truck, we had both finished our sandwiches. paying an extra $6 for \"extra\" meat i feel personally wasnt worth it. my cousins lobster had maybe 3 or 4 extra claw pieces than mines. plus she said the mayo sorta threw off the taste on the sandwich (she said she'll definitely get butter next time).\n\ni went back when they were on 5th and Townsend a week later and ordered the 2 Lobster Rolls with butter (1 for lunch and for dinner). the guy who took my order looked really annoyed that he was working at the truck. as soon as i unwrapped my food, i was surprised at how much less meat was in there than the first time i went (in the Marina). i wasnt expecting the roll to be overflowing with meat but it didnt even reach the top of the bread. i just went again yesterday and same thing, the meat was even that much more less than the second time  (young slim guy who took my order was actually talking and super cheerful. this was at Serramonte 10/28/14)\n\ni wish they would be consistent with the amount of meat they put every single time. one thing i could say is the bread they use is pretty good!!\n\ni dont think i'll be going out of my way to find this truck unless i just so happen to walk/drive by it \n\n1.5 stars for the bread\nhalf star for the lobster\n2 stars for the really nice guy", "author": "Leilah M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-03", "description": "Claw Meat only. Small portion to price. Dried out or rubbery. Watered Bisque.\n\nThis was not fresh Maine lobster as the truck states and maybe I'm being harsh, but growing up in New England and having an uncle who was in the lobster business, putting \"Fresh Maine Lobster\" on your menu is a risky move. \n\nThe Lobster Bisque was of water consistency with ZERO meat, not even shredded meat bits.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-04", "description": "I ordered a lobster bisque for 7 dollars and all I got was a mini 8oz cup. My first impression was this cant be my order. My second impression was i just got conned. The soup literally had zero lobster or meat. I just overpaid for flavored water. My last impression was to never ever come back.", "author": "Babak K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-13", "description": "Went to their truck, $14 for a snacksized roll. Bread was toasted, lobster was fine but nothing better than average.", "author": "Ronald S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-29", "description": "It was meh.  Honestly I think they were one or two spoonfuls of butter away from a 5.  The bread was good and they give you A LOT  of lobster.  But what was missing was the buttery taste I was craving for on my lobster.  I ordered one with mayo and the other with butter. If I would suggest anything it would be that they ask customers how they want their lobster roll.  Everyone has a different preference and I would have preferred it with more butter and seasoned mayo.  It also seemed like the food was sitting there pre-made because within a coupe minutes my order was ready.  The roll was somewhat warm and the lobster wasn't warm at all.  I know that with food trucks they require that most of the food be prepared before hand but it doesn't hurt to stick it in a toaster oven for a little.", "author": "JJ S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-06", "description": "I agree with other yelpers that the lobster roll is impressive but also not cheap. In this case though, you definitely get what you pay for. I've eaten their lobster roll once but I crave it all the time. I found the portion to be satisfactory, I can see why others think it's too small but considering the portion of lobster I received and the richness of the butter, I personally don't think it needs to be any bigger.\n\nLobsta Truck if you're out there, please hear us. A lower price would make for very happy and loyal customers. For the record, I'd pay $12!", "author": "Laura C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "I ordered a pint of the lobster bisque. When the (super foxy) guys behind the counter realized they were almost out, they charged me only half price and threw in the clam chowder. I'm so glad they did, the chowder was DELICIOUS. Super creamy and bacon-y and distinctively of the Maine style. I'll be back to try the rolls.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-18", "description": "it's not cheap, but i enjoyed every bite. it's worth it! i got the lobster roll with butter, clam chowder and the lemonade... the lemonade is nothing special, i just needed something to drink.... \n\none lobster roll AND a small cup of clam chowder could be filling enough, at least for me. next time though i'd try the crab one! start following them on fb! yummy lobsters off the truck! i love it.", "author": "Bonnie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-17", "description": "Decent lobster rolls. However, based on other lobster rolls I've gotten off of food trucks, the amount of physical lobster was pretty disappointing. In fact, I would almost recommend the extra lobster addition as mandatory to turn this into a real meal, although that boosts the price of the roll into the stratosphere. \n\nHowever, the lobster bisque is what saved my impression of this place, and is extremely good! (However, like some other reviewers state, its hard to find solid lobster in the bisque, so keep that in mind)", "author": "Oliver Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-22", "description": "Tried the lobster roll at the soma streat food park. Chunks of fresh, somewhat chewy lobster on a buttered sandwich roll, mayonnaise for me please. $12.99.\nThe roll was tasty, but dry. The dryness of the roll made it hard to taste the lusciousness of the lobster. I needed lobster lube to rise above the drag of the roll. Some suggested a margarine flavor on the bread and i agree. The lobster itself was delicious, but the concoction was a step down. A moister filling, some green onions and a better roll is my Rx.\nThe truck also offers crab rolls, chips and moon pies. \nYou can find a better lobster roll at prime dip in streat food, or the lobster shack in redwood city.", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-19", "description": "I wanted to hate this sandwich. \nFOURTEEN DOLLARS! \n\nBut it's delicious. \nAnd expensive.", "author": "Mimi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-21", "description": "LOBSTA ROLL\n\nIt's just OK.  People just hyped it up and disappointed me big time.  Why do you all have to do this to me?\n\nA friend and I shared, since we were eating other food items from other food trucks.  We got their Lobsta Roll w/ mayo: http://www.yelp.com/biz_photos/8y3O9KJmofweGxvAclw2tQ?select=xI5yKVuX7t_atmKaXlBOZQ\n\n$12 later and about 10 minutes later, the lobsta roll was ready.  When we got it, we looked at each other and said \"wow, that's it?\".  We split it in half and ate it.  It wasn't really mind blowing but it wasn't that bad, either. It was actually pretty tasty, but I'm not sure if it was well worth the price.  It's really expensive for something small, but it's worth trying once... or twice.", "author": "Jay Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "Really tasty crab roll with butter. Just a little expensive for a very small sandwich, $13. Should have had more meat.", "author": "B K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-14", "description": "Tasty lobster rolls but the size would suit Mighty Mouse ...maybe. The lobster was very fresh and \"naked\" as a true lobster roll should be... Just butter and the traditional buttered bun was the case... And if it were more than three bites I'd spend the $$ again for another... One and done. Think it was $14", "author": "Carlos G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "My wife loves crab and she loves crab rolls. Saw this truck tonight at Off the Grid Haight and decided to take a  gamble and bring one home for her (a good crab roll off a food truck? No way).\n\nWow. The thing was delicious. And for $13? Amazing flavor and and a shitload of crab. I'll have a real hard time NOT picking one up next time I see these guys. Mad props Lobsta Truck!!!", "author": "Food D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "OTG - San Francisco, Tribune Building, Friday the 11th\n\nMenu was sparse but what else do you need? I had the crab roll (with extra crab), buttered, with chips and a ginger soda. Everything was top-notch. The roll with extra was pricey, but well worth it. Excellent!", "author": "Hans S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-09", "description": "Lobsta Truck knows what people want and they deliver.  They serve nothing but Lobster and Crab Rolls, prepacked potato chips, and drinks.  Nothing more, nothing less.  \n\nI opted for the Lobster Roll, since that is what the truck is named after.  For $12, you get a 6\" split-top roll that has been gratuitously buttered and grilled.  I opted to have my lobster dressed with butter instead of mayo because I wanted the clean taste of the lobster to come through.  Each bite was to be savored.  It was nothing but butter, firm meat, and crispy bread.  Admittedly, there is a lot of butter in this dish so if you are shy about that, maybe you should ask for mayo.  Not like that would be less rich.  \n\nA part of me wishes that the truck would expand its offerings and make itself into a seafood shack.  It's hard to treat this truck as a place where you can get a full meal when they serve so little yet at such a high price point.  Can you imagine being served piping hot trays of fat, fried clam strips or a fish and chips with a tartar sauce?", "author": "Les L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "I see a lot of reviews complaining about the amount of food you get.\n\nHere's my reality:\n\nToday I hadn't eaten anything all day (not even a glass of water) and so this was the first food I ate (at 5pm). I had a lobster roll, extra meat, with butter, and a cup of lobster bisque.\nI weigh 235 pounds (on a bad day), I can eat 4 pieces of Costco pizza, or 2 Big Macs plus a 20-piece nuggets in a single sitting, and folks, this was plenty of food (remember, I had an empty stomach going into this, too). In fact, as I neared the end of the lobster roll, I thought to myself \"even if this thing had a bit less meat, I'd be completely satisfied.\" And then I realized I still had the bisque. \n\nSo why the discrepancy? Part of it might be that if you've ever had lobster in a restaurant (like the actual animal, steamed in its shell), you realize that there isn't really THAT much meat in a 1.5 pound lobster. It's mostly shell. So I have to say I was impressed when I got the lobster roll that the amount of meat that was there (with the extra meat option) seemed like the majority of what's inside most lobsters. Lobster is dense meat. It's like eating filet mignon. You can't compare the quantity of lobster or filet mignon to the quantity of microwave popcorn you get in a bag. \n\nThe toast was perfectly prepared and the butter was plentiful (and I'm a guy who doesn't scrape off the big scoop of butter they put on the Denny's pancakes). The taste was what made this for me. I did not mind spending $20. I've had less satisfying meals in restaurants where my meal exceeded $20.\n\nThe $7 for the cup of bisque? I didn't find that item worth it. It was \"ok\" but not memorable. There were no bits of lobster (I expected at least something), and the bisque wasn't as creamy as I expect.\n\nIt seemed like the wait was longer than it should have been, but I wasn't in any hurry. If I was in a hurry, I probably would have been a bit annoyed.", "author": "Henry K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-26", "description": "Lobsta truck is A-OK and I will be back.  In short- the Lobster Rolls are excellent- I've had them on several occasions and they were always great.  Price is $14 (not cheap) and the portion is relatively small.  So I will recommend Lobsta Truck for their quality of food and as a 'luxury food truck'- but not from the perspective of 'best value' as you will likely be hungry when you finish your lobster roll.  The taste will delight but the portion may underwhelm.  Lobster isn't cheap- I get it- but you need to consider all of these factors when planning out your meal at an OTG event.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-17", "description": "I got the lobster roll with extra meat. Smallest $20 lobster roll I ever did see. It's the size of a Oscar Meyer hot dog. You're going to need to shell out another 10-15 bucks to get a real meal after the roll. So disappointing. You can go to New England lobster company and get a real sized lobster roll with chips for the same price. Taste is whatevers too. Worst purchase today.", "author": "Joyce S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-26", "description": "Way too small.  Put some actual thought into this, no one wants to spend $14 for miniscule portions.  If you can't afford more lobster add a corn salsa, or cheese, anything to make it better.  Use better bread, just don't expect to survive very long selling that portion for $14.", "author": "Tree P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-10", "description": "Paid the extra $$$ for extra meat on my lobster roll at Off The Grid Fort Mason, frankly a total rip off, and very average quality. \n\nFails massively In comparison to some of the other food trucks there. I honestly sat there and wondered what it would have cost in gas money & time to find a \"RedLobster\" vs the cost of this never-again as I ate it.\n\nThe meat was pulpy and over saturated in butter on a cheap-ass bun. $24 I'll never buy again. Honestly felt stupid for falling for this!", "author": "Steve L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-10", "description": "Yep the reviews are all true. The lobster roll is a mighty small $12 sandwich. But you know what? It's almost worth it. Lots of huge chunks of fresh lobster, drizzled with butter on a soft lightly toasted roll. Very yum and I'm not even a huge fan of these scavengers of the sea. \n\nThe Lobsta (spelled to be pronounced with that very annoying New England accent)Truck was parked in front of the OC Mix, a part of the South Coast Collection maze of shops off the 405 in Costa Mesa. This location was a key part of making this a def hit. Walk your order of choice into the OC Mix building where the always hilarious and sometimes sarcastic Phil will await you at We Olive with vino and beer. He not only recommended the perfect chardonnay to accompany the lobster, he also gave us some garlic olive oil to add on. Wow, thanks Phil! Man did that kick it up several notches. \n\nThey have trucks parked here every Saturday as well as Tues and Thurs, and according to Phil they mix it up with dif trucks each week. We arrived at 11:30 yesterday to 6 or 7 trucks and it was pretty dead. Sweet.\n\nThe staff manning the Lobsta Truck are very cool and funny and my roll was handed to me in a mere 5 minutes. No painfully long waits here, not yet anyway. One lobster roll, one bag of Cape Cod chips and one Chard from We Olive = $27 inc tips. As I mentioned to my friends: 27 bucks and I'm not even full or buzzed. \n\nSo yeah, not a casual Saturday lunch that I will be repeating any time soon, but it was fun for a one off. I will return to try some of the other trucks in the near future though.", "author": "Dan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "First off ... I'd like to thank the Kogi truck for being parked along the same street. With you and your loyal mass followers ... who flock to every siting ... I was able to stroll up to the Lobsta Truck behind two other eager patrons ... allowing me just enough time to make my order selection for the night.\n\nThe menu is simple: Lobster Roll, Crab Roll, Clam Chowder. I was so tempted to get all three ... but i decided \"I need other dishes to get me back\".  So, this being my virgin run ... I went for the Lobster Roll.\n\nAfter I ordered ... i waited less than 5 minutes (no, I didn't time it) before they called out my name.  Ahh, my Lobster roll and Fresh Lemonade was ready.  As I reached for my meal from the high window counter and lowered it to eye level ... i noticed my meal getting bigger, but by not much.  Other reviews were not kidding; the stuffed roll was so petite, I could easily eat two, if not three. But at $12 each ... this food truck delight could turn easily into a $40 meal.\n\nAs I walked back to my car to enjoy my hand sized roll stuffed with lobster covered with grade aaa butter ... I was guessing how many bites it would take to finish (three? four??).\n\nIt took me about 5 -6 bites but i truly lost count because once i took that first bite into the perfectly toasted roll ... my mouth was in heaven.\n\nThe Lobster was very fresh, so much that I swear I smelled salt water ... and with the meat so tender, either it was flown in fresh that day ... or they really tenderized it! Either way ... it was divine!\n\nI am a fan for sure, but my wallet says \"um, let's wait til next pay day\".\n\nIf this was at a sit down place where I can enjoy my meal while soaking up some Maine Lobsta culture ... I'd say well worth the price. But coming from a food truck that I trekked over to find and to eat the meal ... either in my car or like other patrons ... standing around in a circle like black crows attacking it's last meal ... I can't get myself to justify the $12 price (knowingly that my stomach aches for more).\n\nUntil next time....", "author": "gene d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "fantastic crab and lobster! friendly staff and fresh seafood. Will be returning!", "author": "Dario L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-15", "description": "I loved the idea of this truck and so far I gotta say it's 50/50.  Been there twice. The first time was in Novato and it was great. The lobster roll is expensive at $14 per roll but it is worth it if it is flavorful.  We tried it again this past weekend at OTG Larkspur and it was not nearly as good...the flavor was just not there. I will be trying it again along with other things but I was severely disappointed this time.\n\nOn the other hand the Maine rootbeers are good and they are nice in the truck so thats good. Hopefully the lobster roll tastes like lobster next time :/", "author": "Cole K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-02", "description": "It was good but not really worth it... $14 for a little snack. I need to go buy myself some real lunch now.", "author": "Megan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-06", "description": "I've been craving lobster rolls lately so when I saw that the Lobsta truck would be nearby I told my bf we should hit up the food trucks for lunch. I looked them up on Yelp beforehand and it worried me that they had a three-star average rating... But my stomach was growling and fixated on lobster rolls so I threw caution to the wind and ordered a lobster roll with butter.\n\nThe roll was the typical lobster roll white bread that was buttered inside. The lobster was plentiful but not sweet. It was also bland - there was no melted butter on the lobster chunks and just the tiniest bit of salt. As other reviewers have mentioned, the sandwich was pretty small for $14. You have the option of adding extra lobster for $6 more, which would be comparable to Old Port Lobster Shack prices.\n\nKind of a letdown, so I wouldn't recommend.", "author": "Bella L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-21", "description": "Okay. Read the reviews about the size of the sandwich & they are true! I've frequented many trucks & by far this is the most expensive priced item & by far the smallest bang for $14!!! Yes, it is lobster with butter & it was good. However I couldn't call it a sandwich. Literally it was a big slice of bread with lobster meat & butter. It was smaller than the length of the palm of my petite hand. My 6 yo could eat the entire thing & still be hungry. So good is good but way overpriced & portion is skimpiest I've ever seen. So beware!", "author": "Jules K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-05", "description": "Novelty vs. Quality\n\nSo I have bought into the food truck craze: hook, line, and sinker.  But in true foodie fashion, I will jump right off the bandwagon the second the novelty of an experience overshadows the food.  \n\nYesterday I ventured to a local high school's fundraiser here in Fullerton anticipating a number of food trucks to try with some friends.  The Lobsta Truck was our first stop.  Expecting to order from several different trucks that day, we all hesitated when we saw the prices here.  $12 for the lobster roll and $11 for the crab roll.  But we wanted good lobster and weren't disheartened.  One of our group left to drive around town and find an ATM.  (We found out after he left that they accept credit cards).\n\nWe ordered two lobster rolls with butter and one clam chowder (the clam chowder was a reasonable $4).  The food was ready in literally one minute, which was surprising.  The first thing we instantly noticed was the small size of the sandwiches.  Despite how it may look in pictures, it's about the size of a small hotdog.  Not a good first impression to a hungry group intending to share.  \n\nAfter my first bite, I realized why the sandwich was ready so fast.  It was served cold, which wasn't what I'd been expecting.  I can see how this makes sense from a business standpoint.  It's certainly easier to precook and separate lobster for quick serving later.  All they had to do was grill bread on the spot.  But for lobster, the quality suffers while the price remains high.  I'd rather go to a nice seafood restaurant.  When our friend returned from the ATM, we told him to save his $12 for another truck.  \n\nI reject the idea in other Yelpers' posts of \"It's lobster!  Of course it's expensive\".  If it were truly amazing lobster, I doubt anybody reviewing here would have an issue with the price.  \n\n**Sidenote:  I didn't get to try the clam chowder, but I'm told it was \"pretty good\" and not too salty.  If I go to this truck again, I'll be going with that.", "author": "Jamie R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-29", "description": "I just had a lobster role in Larkspur. Cost me $20 as I asked for extra meat. Also asked the mayo instead of butter. When it came it looked small. I wonder what the portion size would have been if I didn't order the extra meat... It was open faced and when I asked for a fork I was told no, they didn't have any and spoons were reserved for soup... There was no taste of mayo to detect... I shared a bit with my son, a couple bites, and I am still really hungry! Spent $20, no fork, no mayo and a really small portion... I'd say total ripoff?!", "author": "Wim L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-21", "description": "For $14, you get a good toast, and a reasonable amount of lobster. It's snack-size, not meal-size. I know it's lobster, but it's really not a lot of food. It was fine, but not worth the money.", "author": "Max T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-18", "description": "I've been fortunate to have devoured lobster rolls when I lived in the New England area, in Boston, Connecticut, and Rhode Island. Nothing in Maine, however. Obviously, it's a bit unfair to compare to Lobsta Truck, in both price, value, and flavor. But there's at least some type of reference to draw from during my 3 bites of Lobsta Truck's lobsta roll.\n\nAfter opening up a half hour late to a massive line (I could see one of the workers inside mouthing OMG with bulging eyes once the door opened), orders finally started. Of course, there was drama already. They were handing out food at random order, annoying a lot of people, and I overheard a lady complaining about how small the lobster roll was. The guy at the front snapped at her and said \"you can hand it over, we can give your money back.\" I didn't know we were also supposed to be getting the Boston 'tude to go along with the food!\n\nI fork over $24 in cash for two lobster rolls, one with butter and one with mayo. The food comes out, and my wife and I waste little time in sinking our teeth into these lobster rolls. After trying both the mayo and butter versions, I'd have to give the edge to the butter version. The buttah just enhanced the lobsta meat flavor, while the mayo didn't really bring anything to the table. If anything, it was more bland. It desperately needed more seasoning. \n\nYes, the lobster rolls are small. It took me 3 bites to finish one. There could've been a bit more meat -- it's an illusion that the meat is overflowing from the roll, because they don't really fill the bottom part of the roll (so you're getting a little bite of air). The lobster meat itself was tender, and you can actually differentiate between the tail and claw meat by the texture and chewiness of each bite.\n \nI'm a huge seafood lover -- lobster, crab, shrimp, you name it -- and I'm not afraid to pay good money for good food. With the long lines, it looks like I'm not the only one. But hey, I get the appeal. It's LOBSTER. But my main gripe is that the lobster roll lacked any soul, if that makes sense. There's no point in trying to replicate an authentic lobster roll, so why not give it a SoCal twist? Perhaps introduce new ingredients, new flavors, bring something new to the game. I don't know, that's just me.", "author": "Dru C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-22", "description": "OTG Burlingame.  Had a lobsta roll with extra lobsta.  If this is the extra lobster, I'd hate to see what the regular roll is like.  $20 is way too much for this.  Not blown away by the quality of the lobster either.  Texture of pre-frozen lobster which has been slightly overcooked and the roll is less than impressive.  Wouldn't go here again.", "author": "Julia A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-27", "description": "Had the lobster roll and it was pretty good as far as taste. I don't care what anyone says, size does matter. The sandwich is roughly the size of one slice of wonder bread split in half, which is ridiculously small for a $14 sandwich unless it has gold in it. I'll save my money and go to Sam's Chowder Mobile in the park. Their rolls are a bit more appropriate in size.", "author": "M T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "got the chance to try the Lobsta Truck food at Off the Grid @ Evergreen.\n\nwe ordered:\nLobsta Roll with extra lobster in butter\nLobsta Bisque\n\nhubby & i loved them both.\nLobsta Roll was very delicious:  moist lobster & nicely toasted bread\nLobsta Bisque was very flavorful\n\nthanks to the guys working the truck that day...we want to say...\"the food was Delicious\"", "author": "Kei .."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-06", "description": "Good taste, rip off price. Dude I ate my lobster roll in 5 bites. I counted. More like an appetizer. Like I can understand if it's $14 for a lobster roll that was at least bigger than my iPhone, and came with chips or something. I expect to get full on $14. It seriously was as big as my iPhone 4s. Good taste, but no way in hell worth $14.", "author": "Celeste M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-24", "description": "I was craving some lobster and OTG Pleasant Hill was my chance.  I headed to the long line in front of the Lobsta Truck with my money in hand.  The wait was about 25 minutes but we noticed the orders were getting filled fast.  I ordered a lobster roll, crab roll, clam chowder cup and lobster bisque pint.  Total $45.  A lot for a food truck but lobster prices are high. \n\nThe lobster roll was good.. I opted for mayo topping and it wasn't overwhelming with good chunks.  Crab roll was good, flakes of crab again with mayo covering.  Clam chowder was creamy, flavorful and among the top I've had.  Now the lobster bisque... honestly a fail.  It was basically blended cream!  No chunks of lobster, no nothing but watery cream blend.  I was disappointed since I had opted for the larger pint hoping this would be the highlight of the meal.  I would go back for a lobster roll fix another time but not for my soup craving.", "author": "Gina W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-18", "description": "Poor customer service. Puny 'lobsta' roll. For 14 bucks NOT WORTH IT. Not very fresh either.. very unimpressed.", "author": "Mark K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-09", "description": "Lobsta Truck rocks. If you love lobster, the lobster roll will be perfect for you. It's so simple, yet so satisfying. You get a warm toasty hotdog bun LOADED with lobster, I always get it with butter. It's nothing fancy, but I'm  also eating it in a parking lot. I really like that it's not all creamy and gooey where you have to look for the lobster like most places. They've got it spot on.", "author": "Nickel C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-20", "description": "I had a chance to try out the Lobsta truck when I went to the Best buy plaza where there were many food trucks that was there as well. I think I only gave it a two star because I couldn't find myself enjoying the crab roll at all and the fact that we waited in line and they ran out of the clam chowder. SADNESS :( Lobster clam chowder sounds pretty damn good to me! \n\nThe crab roll : The only thing I find enjoyable about the crab roll was the bread itself haha. For some reason(even though i like crab) I feel like it was a sandwich that went wrong. It's like putting chocolate in a sandwich...I couldn't figure out what was going on.\n\nRegardless I was quite happy with the lobster roll. It's not because the lobster roll itself would ever get me full but for $12 they gave a HUGE amount of lobster in proportion to the bread that they provided you with. The buttery lobster with the nicely toasted butter bread was quite delicious.\n\nOverall : i would consider going back to try out the clam chowder and I would consider getting lobster roll again but I know I wouldn't find myself be full just eating one lobster roll by myself...or maybe I'm just a fatass. haha", "author": "Ernest Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-18", "description": "I didn't have a problem with the portion size of the lobsta roll. In fact, I was pleasantly surprised at how much lobsta they give you. We asked for light butter, which was great because you could still taste the fresh flavor of the lobster itself. I would order it again if I ate something else beforehand. I would probably skip it if it was my only dinner (because I wouldn't be full!)\n\nThey ran out of clam chowder by the time we got there, which was disappointing. If the clam chowder is decent, I would round it up to 3.5 stars.", "author": "Allison S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-11", "description": "Their clam chowder is pretty decent. We tried it several times and although not as consistent as others' chowders, it tastes good. A little short on clams, not very thick and the celery and other veggies are cut very Inconsistently so it doesn't distribute very evenly (yes, we stir it up a lot). The prices are crazy high (higher than at nice sit-down restaurants) and the lobster roll is still as ridiculously expensive as it is small (it's appetizer size with a premium entree price). I still don't get this truck, it's got the ingredients to do a great job but somehow missed the mark and the service is a begrudging, so it detracts from what little I do like about it. Lower the prices, pay attention to knife cuts, season a bit more liberally and make the portion size suitable for dinner then this place might just succeed.", "author": "Bob L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-01", "description": "$14 for a roll that was so small I can't believe it I'm in FiDi i know, but I could have gotten an enormous salad or ramen or at lease a sandwich with sides. I'm still hungry. And in the two blocks back to my office it's cold. It tasted good enough. Needs more salt. I'm not going back.", "author": "Namita K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-22", "description": "I was all excited when my phone get a msg from twitter that lobstatruck will be away from my house about 9 mins :D It was a little hard to be found. but yeah finally we found it hiding in the parking lot. bought the lobster roll, crab roll, and a clam chowder. \n- lobster roll was blank :( not as good as i expected\n- crab roll was really good\n- i'm in love with their clam chowder\nThe price ain't cheap but worth the try!", "author": "Yen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-03", "description": "Enjoyed a lobster roll with butter and crab roll with mayo. Tried it as MB off the grid. Knew to expect small portions for a food truck meal, so I savored every single bite. \n\n$13-$14 rolls ($6 for extra meat, that's probably like one extra bite). It's like $3/$4 for 4 bites/mouthfuls. Fresh and tastes like real lobster/crab, no mysterious fillers. Bread was soft and lightly toasted, taste like potato bread. \n\nI was temped to try the lobster bisque for a $7 cup the size of a gelato cup. Many propel in line were ordering it. \n\nI wouldn't stand in a long line or go out of my way to eat here. If you can afford it, enjoy.", "author": "Sarina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-23", "description": "The butter Lobsta roll is quite simply, delicious. So delicious that you mourn how small it is because you can easily eat two but they are $12 each so...  They now offer extra meat for an additional $5.", "author": "Robin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-18", "description": "Small portion of Lobster Roll disappointed me at first; however, the taste got be thinking that 'I will be back next week.'   My opinion is very credible since I am an ex-Bostonian with ample experiences in 'lobster roll' including the McDonald Lobster Roll [only available in New England].   FYI: McD Lobster Roll sucks.", "author": "Jake C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-30", "description": "The lobster roll had great flavor, some parts of the lobster felt a little over cooked. For $14, it is small especially when compared to other lobster rolls in the bay area. Decent bite, but no value for the price.", "author": "Dave W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "As a former East Coaster, I can say that is pretty darn close to what I'm used to eating when I would go up to Maine. The only problem is how expensive it is, compared to what I would pay in Maine... I guess, because it's 3,000 miles away. Anyway, the price doesn't stop me from satisfying my lobster roll craving, whenever I see this food truck.", "author": "Erika L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "Lobstatruck changed suppliers and now serves the best lobster roll in California and as good as any of the hundreds I have had in Maine...\nPerfect ratio of tail meat to crispy roll\nAlameda location is great--would eat there every day if they had a pop up location nearby.", "author": "Bonnie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "Good but just so expensive. I had a crab roll, just a nicely toasted bun, crab and butter. Was super tasty, but for $13 I would really have liked a little larger roll. But it was really good. Hard to hate on something so tasty and I know crab isn't cheap, but it would be nice to have even a little more.", "author": "Kyle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-28", "description": "If you're looking for a really traditional lobster or crab roll like from back east, this is the place to go, or I should say, place to find wherever it is. Their sandwiches have piles of quality lobster and crab in large pieces. I actually ordered one of each and both were really delicious. \n\nNow, lobster and crab meat really speak for themselves, so they really don't have to do a lot to make the sandwiches taste great. The bread is good and they really offer authentic, east coast style shellfish rolls. \n\nThey are costly, about $10 each, but they are worth it. I guess what keeps me from giving them 5 stars is that the menu really is simplistic and a little boring. Overall though, these guys are good.", "author": "Brad K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-05", "description": "Ordered a crab roll and a \"side\" of clam chowder. Apparently side means \"largest size we offer\". That's on me. I should have been more specific.\n\nThe roll itself was about half the meat of what you expect for this kind of thing. I'm comparing it the tourist trap lobster/crab roll shops at the Pier, so our bar is already quite low. It was about 4 bites of food, 1 if you're feeling industrious. It tasted only a bit below average, which is to say it was good, which is to say it wasn't worth $13.\n\nI guess I understand why \"side\" means \"largest size\" to them. I should have gotten a side cheeseburger from the next truck over. Maybe a nice side entire ham? A side decision to order from somewhere else to begin with? Too far?\n\nThe soup tasted fine, but it didn't really live up to the \"clam\" part of the promise. Sure it was chowder, but this isn't grad school; 50% is still an F. It was on par with canned soup from Safeway. \n\nSo, yeah, $21 for a can of soup and a wisp of seafood. A solid \"meh\".", "author": "Andy M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-29", "description": "I always hope that these food trucks will live up to their rep of preparing great food but my lobster roll which was essentially dry did not.  I asked for the mayo one but couldn't even taste the mayo went back to ask for for and they gave me a teaspoon amount! At $14.00 a pop I don't think that would have been their profit.  Mayo didn't really even give the wet lobster any extra flavor.  Bun was toasted well.", "author": "Alison B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "Note: This review is based solely on the lobster roll. \n\nIt simple and to the point. \nLobster Roll: warm bread, heaps of lobster, lightly buttered (around $12). \nThat's it. \n\nDon't go in expecting some extravagant herbs, flavors, or additives that make lobster non longer taste like lobster. \nSo, if your into simple and clean seafood, this is it. \n\nI'll chase you down anytime lobsta truck!", "author": "Jenny A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-03", "description": "Finally caught up with the Lobsta Truck last night at the OC Fair Grounds and it did not disappoint! Soft hot crispy rolls stuffed with fat juicy lobster imported from the East Coast! \n\nHave been raving about it all day! \n\nPrice is extremely reasonable for the amount of Lobster you get!", "author": "Mike S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-10", "description": "I really like the lobster roll and the clam chowder. The big knock against it is the price, but that's somewhat expected when you are eating lobster (I'd actually be more suspicious if it was really cheap). If you're a big eater and you're hungry (which I happened to be today when I got the roll), you'll probably have to get at least 2, which for lunch is a bit pricey. I just got one to try and went somewhere else to get more food so I don't have to drop another $14 for lunch. Clam chowder was good, but I happened to be walking by the truck one time when they were closing and they just gave it to me for free. It was amazing for a free chowder, but maybe not as much for a $5 chowder. If I didn't account for the price, I'd probably give it a 4 star rating. The $/amount of food ratio just doesn't make it worth it unless I really really really want lobster", "author": "Edison T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-29", "description": "I'm originally from New England, so I get homesick for a good LobRoll....but go somewhere else. Let's put the high prices aside. We just wanted a couple of decent rolls. My wife and I got the $20 numbers (with extra meat). Supposedly 6 oz. instead of the 4.5 which $14 buys you.\nThey were waaay overcooked and really chewy. If all you do, basically, is sell lobster rolls, learn how to cook the critters.", "author": "David D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-29", "description": "I am sorry but the outrageous price for this little bun with either lobster or crab takes away from the experience.   Had this at Larkspur Landing today (3/29).   $19 for ONE litle roll, including $6.00 for \"extra meat\" and $3.00 for a root beer.   Gawd.   Two people -- 20 seconds to down the \"roll\" and move on.   No side dish, no cole slaw, chopped anything, just meat on the bun.    Sorry, not good enough.   We could pick up a 2 pound dungeness crab at the market on the way home, and make at least 2 meals from that for 2 adults.\nLobstaTruck, stay away.", "author": "Lloyd L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-26", "description": "I tried the Lobster Roll but it is a rip off!!!  Okay, I get it, lobster is expensive, but for $14 I really was expecting more, more lobster, more flavor, etc.....  It is basically like a slice of wonder bread with few chucks of lobster, that is it.  I tried other Lobster rolls places in the bay area and have to say that Woodhouse fish company does it right.  This one is really plain.  Glad that I tried it but will not be going back.", "author": "Eva E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-09", "description": "I had the lobsta roll (half mayo, half butter). It was pretty darn good and the buttery bread was the perfect compliment to the lobster. However, the price of the SMALL sandwich is far too high, hence my rating.\n\nBtw, in case you're wondering, the butter was better than the mayo.", "author": "Ami Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-30", "description": "We did the research on offthegridsf before flying in from Michigan. We hit the Minna location between 5th and 6th during lunch. We each had the lobster roll with butter. YUMMY X 2! The bread is perfect for the sandwich/roll they make. Just a perfect combination. Nice portion of lobster too. After each of us finished a roll, we then split a crab roll. That was every bit as good as the lobster roll. Yes, these aren't cheap, but we are talking lobster and crab here, not canned tuna fish! Worth the price, and it made for a positive memorable experience. When were in SF again, we will hit the truck for sure. Recommend!", "author": "Bri A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-03", "description": "I really enjoyed my buttered lobsta roll. Big juicy, plentiful pieces of tasty lobster on a seasoned roll with butter. It was simple, unmasked, and worth $14.  Yes their menu is limited, but that's because they're damn good at what they do. This was my first lobster roll ever and I'm hooked. Will definitely be back on Wednesday nights at off the grid upper haight just to find them.", "author": "Jamie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-24", "description": "finally got to try out the lobsta truck at the del mar races this past weekend. yum, yum, YUM!\n\nreview is solely for the lobsta rolls! ordered 2, one for me & one for hubby. they offer the lobster tossed with either mayo or butter. i got one with butter and the other (thanks to a friends recommendation) mixed with both mayo & butter-mmm gluttony at its best! both were good but true to reviewers comments, you get more of the lobsta flavor when it's just mixed with butter. despite the long line, we got our food pretty quickly. the roll was still nice and toasty and the lobster was yummy and tender.  \n\nafter reading all the reviews...i get it, $12 for a tiny lobsta roll sounds like a lot right? how about, $12 for a perfectly toasted split top roll oozing with lobster goodness. LOBSTER folks. lobster that you usually see at the restaurants and grocery store at market price. yet here we have the lobsta truck, serving up a delicious roll without us having to deal with cooking and prepping the lobster ourselves.\n\ni've been lucky enough to have some yummy lobster rolls back in boston, and i think the lobsta truck does pretty well considering they're bringing the lobster roll scene to cali. i'm glad the lobsta truck now has an OC truck roaming around whenever i need my lobsta roll fix. back in bean town we'd pay anywhere from $18-$24 for a lobster roll...some were worth it and some weren't. in this case i'd say the $12 is worth it bc you get all lobster - no celery/lettuce fillers in these rolls!\n\n$12 still too much? then gitouttaheya (said in my best boston accent=P!!).", "author": "Belle L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-16", "description": "Got the lobster bisque. Don't know I'd they just skimmed it off the surface or if that's what its like but there wasn't s single piece of lobster in the large pint I got. 13 bucks for a tub of reddish creme. Definitely do not recommend.", "author": "Nicholas N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-22", "description": "I was super excited to learn that there would be a Lobster truck at Off the Grid Fort Mason...unfortunately it was a disappointment. I wasn't terribly hungry so I just got a cup of the lobster bisque. It was on the small side but still tasted like it had an entire stick of butter in it. The texture reminded me of watery cottage cheese and it left an odd, unpleasant aftertaste in my mouth. Maybe the lobster roll is worth a try but I will not be back for the bisque.", "author": "Cara K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-01", "description": "yes this truck is expensive...but it's lobster!!!! and from what I can tell..it seems like all lobster tail meat. That's just insanely awesome!\n\nTheir lobsta roll with butter is just .... I don't even know the word for it. It's so simple, yet so YUMMY! it's the simple things in life that make my tummy happy! The bread is toasted perfectly with massive sized lobster pieces. It is on the pricey side of $12 a pop...but hey...it's lobsta~!!! it's gooooooooood!", "author": "Kim T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-11", "description": "It is Sooo small. Nothing special, very small, nothing on the side, 14 bucks. What do you expect", "author": "Nlza G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-30", "description": "This is a very popular dish in Maine and other places on the northeastern seaboard. The lobsta roll is awesome! You have a choice of butter or mayo. I recommend butter to bring out the sweetness of the lobster. It will definitely give you an OMG moment or two. They fly their lobsters out 3-times a week from Maine so you know that you're getting the freshest lobsters in SoCal. They also sell a Pennsylvania Dutch favorite, Whoopie Pie, which are concave chocolate cakes and creamy vanilla filling in the middle, kind of like a Suzie Q, but round. It really hits the spot when you need sweet fix. Thumbs up!", "author": "Chelsea M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-09", "description": "Tried this lobster roll today in Marin and the lobster was cold. In my opinuin the food is over priced for the portion I received.", "author": "JJ S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-30", "description": "I was excited to hear Lobsta Truck now has an OC outpost. I had a stellar lobster roll at Luke's Lobster in NYC last year and have been craving that same experience here in OC/LA. This past Friday, they were part of the food truck meet up in Fullerton in the Best Buy parking lot on Imperial and Harbor. Food roundup:\n\nLobster roll: Comes on a traditional grilled split roll (not hotdog bun), with big chunks of chilled lobster meat (I think tail and claw). Got half mayo and half butter. I liked the butter side a tad more since it gave it a salty kick the mayo side was missing. The lobster was cooked perfectly and it tasted really fresh and clean.\n\nLowdown: Great place for your lobster roll fix, reasonable price for the amount of lobster you get. Granted, this is not going to get you completely full, but hey, it's a lobster roll for $12. The meat wasn't as sweet as the one I had in NYC, but lobster is cooked well. I'll be back, mmmm! Also from their website: AS A RESULT, LIKE THE LOBSTER, WE GET OUR BREAD FRESH FROM NEW ENGLAND, score!\n\n**For all you concerned with price: You're getting high quality lobster for a decent price! When I was in NYC, you'd be lucky to find any place with a roll for less than $25, a lot of places there start around $25-$32 for a bit larger roll with fries in a sit down place. Even Luke's Lobster in NYC, a modest order at the counter joint charges $15. Just to give some perspective for all you not familiar with how much these things run (outside of Maine which I imagine is cheaper). \n\nReality check: If you want to get full off a lobster roll with at least 1/2 lb of meat in it or more, you gotta pay more than $12!!!!\n\nhttp://laist.com/2010/07/22/lobster_rolls.php#photo-1", "author": "Jackie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-03", "description": "Good lobster and decent buttery flavor on mediocre bread. $12 is pretty expensive for what you get though, which is a very small roll (think the size of a regular toast folded in half) with a disappointing amount of lobster. Wouldn't get again for the price.", "author": "Yian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-18", "description": "I had a very good experience to try their Lobster roll at the Pleasanton Off the Grid last Sunday.  It was very tasty and worth the money! I paid $14.00 for a sandwich that was filled up with a lot of lobster meat, amazing!  And the lobster meat had good quality, fresh, tasty, and cooked right.  I don't understand why people complain about the price because this is Lobster we are talking about, do they know how much it cost to eat a lobster sandwich at a restaurant???  I highly recommend this if you are a lobster fan, it is totally worth it!", "author": "Chris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "Yes I know, these lobsta rolls are pretty expensive for $12 a pop but I can't help being in love with them!\n\nLOBSTA ROLL WITH BUTTER-I love the toasted buttery roll these use to sandwich their chunks of lobster in. I think they give you an okay amount of lobster, but I won't lie one lobster roll does not fill me up at all but I don't have the heart to drop $36 just to be full. These lobsta rolls are more of a snack since they are pretty small.I always go with the lobsta roll with butter since I hate mayo but if you like mayo, go for it.\n\nCLAM CHOWDER-I LOVE their clam chowder and I think it is decently priced compared to their lobsta rolls. It is $7 a pint and it is really good. It isn't too salty or too creamy like some clam chowders and the seafood taste in the chowder is really fresh and isn't sickening after a couple bites. I usually get sick of clam chowders after a small bowl or two but I can eat a pint of this clam chowder all by myself. I suggest taking a pint home, picking up some sourdough or french bread at a grocery store on the way and dipping it in the chowder while enjoying your favorite movie. \n\nI wish they would lower the price for these rolls or I would become a millionaire so I could eat them everyday....hopefully both will come true!", "author": "Carol N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-30", "description": "OTG Alameda- We almost went to Señor Sisig but when we saw your truck we thought we'd give it a try.    So My husband walks over to where we're sitting and offered me a bite and I almost refused but I wanted to see if the taste made up for the small roll ($14 for hotdog bun size- ouch) and sadly it did NOT make up for the size- it needed more seasoning it was just... disappointing.", "author": "Dani R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-08", "description": "The Lobsta Truck is a New England style of eating Lobster.  If you have been back east (Boston area) and had a Lobster Roll you will realize everything including the roll is authentic New England fare.  You are getting real New England Lobster meat too. For $12.00, which may sound a little steep, you are getting the real deal.  it is delicious and worth every penny. Try buying a Lobster at a local restaurant and see how much you will pay.  I like the Lobster roll with Butter. It is amazing.\n\nThe clam chowder soup is rich and has Avery good flavor to it.", "author": "Jim P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-13", "description": "Very disappointed with the lobster rolls the quantity and quality. Quantity: regular @ $14 was pretty skimpy on the lobster, and you barely tell the difference from the one we ordered with extra meat @ $20. Quality: lobster with butter was juicy and tender, but very bland. We're going to stick with Sam's Chowdermobile in the future.", "author": "Monica W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-11", "description": "Ok I wish I could give like a 3.5 since i feel they dont quite deserve a 4 but 3 is a little low...... so I walked outside of my salon to say hi to the people at the flower shop behind it and holy crap lobsta truck! I pretty much ran across the street to squeeze in the back of the line. Excitedly I placed my order for a lobsta roll with butter (Mayo and I are sworn enemies) and a blueberry soda. I got halfway through the soda and my order came up. I pulled the red checkered paper down from the truck greedily and was immediately disappointed. It was so tiny! $14.50 for lunch I figured I'd be able to fill up on awesomeness and be full for a while.\n\nWell I popped a little piece of the butter coated lobster in my mouth and my hope was restored! Yum! It was sweet and fresh and buttery goodness in a toasted roll of awesome (Brioche maybe?) I savored every amazing bite for as long as possible but too quickly it was gone...... much too quickly.  Disappointed in my lack of hunger satisfaction I finished my (awesome) blueberry soda and trudged to my car. \n\nI guess in Costa mesa on the border of new port beach those portion sizes and prices are ok. But if you're looking for sustainability for a good price this isn't your truck.", "author": "Kayla C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-24", "description": "I decided to check out the Lobsta Truck at OTG in Larkspur Sunday afternoon.  The lobster was well cooked, but I have to say that I was really disappointed with the amount of lobster on the roll.  I'm use to Sam's Chowder mobile and the Old Port Lobster Shack.  I just don't feel like a got my money's worth.  I also got the crab roll and the lobster bisque and felt cheated by the lack of meat.  They do allow you to purchase extra meat, but I feel that I shouldn't  have to do that.  If you can't get to OPLS or Sam's, and you're having a lobster craving, they will do, if you get extra meat.", "author": "Gia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-07", "description": "I never tried a crab roll before, but have always wanted one.  The Sandwich was absolutely prefect,  so fresh and savory.  The only issue I had was that it was a fairly small size for the price but I understand because of the high price of crab.  But I will definitely seek out the Lobsta Truck again for another sando.", "author": "Sam d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-15", "description": "Ok so I finally got to try the Lobsta truck after seeing it around. I was really excited to eat the lobsta roll with butter. I decided to split it with my sis since we were going to get a couple of other items from the other trucks. Ordering wad quick and easy. When I picked up my lobsta roll I was so so so sad that it was so so so tiny! I mean the thing doesn't even look like 6\"... Whaaaat??!!\n\nAny ways after cutting the tiny roll in half. I bit into it.... And the lobster was very juicy , tasty and mmmm buttery. The roll was good too! It was crispy and buttery on the outside and soft on the inside.  I finished it in one more bite. How sad. I gave it 3 stars because of the size and price. If they kept it that size I think it should be a Lil less than $12. Other than that I would of given it 5 stars. I wouldn't eat this again for $12 I would need to buy at least 3 of the Rolls to fill my tiny belly and that would be $36 for a sandwich...hmmm pass", "author": "Couture C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-04", "description": "Really disappointed in the lobster roll.  Mealy lobster with no seasoning and very dry even though we asked for the mayo.  Not making that mistake again.  Loved the Maine Root Beer though!", "author": "Will B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-09", "description": "I had the opportunity to try this food truck today at 12:06 pm... I ordered the Lobster Roll with Butter $12.00 and the Lemon lemonade.. \n\nFirst it's tiny for $12.00... it looked like a stuff taco or mini burrito. Yes they did packed it with lots of flavorless lobster and that's about it. This lobster roll is a memorable little sandwich but not due to the taste rather the lack off any sort of taste. When you adventure into eating something like this you want to remember it for the rest of your life just as you remember the first time you stuck  your tongue in and electrical socket or one of those square batteries sending electrical sensations throughout your taste buds, but sadly all I'll remember is the price and what the meal was missing. \n\n\nNote to cook how about maybe adding a little bit of seasoning to the lobster not to much just a wink... maybe a dash of paprika on the meat would be nice... or on the mayo how about some scallions to bring out the flavor of the meat .... So for $12.00 I do expect a little more than a buttered dinner roll and some flavorless could be out of the can Lobster...", "author": "Juan P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-01", "description": "Lobsta roll way too small for $14 and was not good. Chowder was decent so they get a star for that", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-28", "description": "I always look for the Lobsta truck when they're in Irvine for \"Truck Day\" at the Michelson lot. The lobster and crab rolls are fantastic, simple fare....made with really fresh seafood.", "author": "T. J. K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "The price is well worth the quantity of lobster that they put into the roll. I have to agree with the previous post though, that the bread was not my favorite, but I can overlook the cheap buttered bread, for the main attraction the Lobster! I actually tried both the butter (which I got on the side), and the seasoned mayo. I liked the mayo more than the butter. The butter should have been salted, with a couple splashes of lemon, maybe then it would have been better than the mayo. I will definitely come back to the Lobsta Truck if they hit the SOMA area again. 4 stars for the quantity and quality of the lobster, and a reasonable price. The crab roll was really yummy as well. Can't hardly wait for you guys to come back to 5th & Minna.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-02", "description": "OTG Oakland, the Lobsta Truck is indeed on point, it's higher than the other trucks, but it is definitely worth it.  You have to get the Lobster Roll.", "author": "Lonnie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-07", "description": "Spotted this truck on my way home and thought of trying their stuff atleast once. The lobsta roll was good although it was a bit pricey for me. Still they have quite a unique selection so I'm thinking of trying out the rest next time.", "author": "Samir C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-03", "description": "Lobster roll is ok for a food truck. Sorry I had to add Sriracha for that extra punch, to one side of course.", "author": "Steve K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-30", "description": "To say that the Lobsta Roll was not good would be a lie. The bread was perfectly toasted. The lobster was tender and fresh. The butter was the smooth flavor that combined the two elements together to create a light but rich lobsta roll experience.\n\nSo why doesn't this get a higher score?\n\nBecause you're paying $12 fricken dollars for something you can eat in four bites, that's why.\n\nI don't care how good your stuff is. If it comes from a truck, if it doesn't fill you, and if it's not the most amazing thing on sliced bread, it should not be that expensive.\n\nPlus $3 for a bottle of soda.\n\nShame on you Lobsta Truck. At a reasonable price, you coulda been a contdenda.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-08", "description": "Tonight at PH BART station - lobster not good - overcooked, tough, and old/fishy tasting.  Paid for extra meat too.  Threw 3/4 of it away - waste of $20.  So disappointed its usually really good and I was looking forward to a great dinner tonight.", "author": "P O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-08", "description": "You have to get there early.  I didn't get any lobster but I made it for the crab roll.  There was 3 orders after us and it was all gone.  To appease the remaining customers in the line, they offered a free small clam chowder.  I think it is hard to estimate the amount of customers they are going to get and if you want things fresh, there will be estimation errors (more shortfalls since it is to their benefit not to waste).  I thought the prices would be lower since there was an oversupply of lobsters on the east coast.  I think prices there this season was $4 a lb.  I haven't tried the mayo but the butter was great!  The sandwich is small but it is a very rich dish so it was enough for me.  Gotta try it!", "author": "F O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-15", "description": "Last Friday, there was a gathering of food trucks in the Best buy parking lot on the corner of Imperial and Harbor, this is borderline La Habra/Fullerton.  There were many trucks and this was one of the trucks that was there.\n\nI have never had a Lobster roll before, and my experience of a lobster roll is from seeing it on TV on the Food Network.  My brother has told me of a place in NY but I live in Cali so I suppose this is the closest I can get until I venture up and east to NYC.  Anyways, the Lobsta Truck didn't have a big line went we started but I wanted to give it a try.  We just ordered one roll and shared.  I agree for $12 its a small portion if you're a hungry man (my boyfriend ate his half in maybe three bites, me I took like 4-5 bites), but it's MF-ing lobster people, LOBSTER!!  I think for me my mistake was ordering it with the mayo, thinking it will be spread on like a sandwich.  I was wrong, it was tossed in the mayo.  I should have ordered it with the butter, as many others had done after us.  Nonetheless, it was still fairly tasty, though you could not taste the freshness of the lobster through the mayo.\n\nIf I see this truck again, lobster roll with butter, maybe a better bet.", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-11", "description": "I'm always hesitant about ordering shellfish from a truck, mostly because the thought of spending hours sitting or bent over a toilet isn't my idea of a good time. Fortunately, I've had the Lobsta Truck a handful of times and have yet to regret it later. The Lobsta Truck keeps things simple, and their only offering is essentially a lobster roll with butter or mayo. The menu has a few other things (like a crab roll or clam chowder), but honestly the only reason you'd come here is for the lobster roll. Unless you're the kind of person who sees a place called 'Lobsta Truck' and thinks to themselves that's where they have to try the crab. Don't be that guy. Nobody likes that guy.", "author": "Eatosaurus R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "THE VERY BEST!! I was raised in New England, and can honestly say that everything Lobsta Truck serves is SUPERB! They are as unique and authentic as any lobster stand back east..Everything on their menu is so fresh, yummy, and very resonably priced....Look for them, they're all over...ENJOY!", "author": "Nancy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-12", "description": "I do have to say that I have never had lobster before, yet have always had a strange craving/want to eat a lobster roll.. so when i was driving home and A yelled out lobsta truck, i literally screamed with joy. hehe.\n\nThe lobster roll was a bit small, but I guess we are getting a good deal so I am fine with that, the service is quick if you are able to get a head in line :) The clam chowder is also yummy, full of lots of clam bits and other veggies.\n\nHowever, after eating the lobster roll I realized it wasn't exactly what I thought it would be. FOr some reason I imagined sizzling lobster on a hot roll. But overall everything was kind of cold, so I was a little sad, but I guess that's how it is? No idea actually. Anyway, that's why I'm giving it three stars. Not because the service was terrible or the food was bad. I'm just not that big of a fan I guess.", "author": "Joy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-27", "description": "3.5 stars\n\nGot the lobsta roll with butter.  Very good.  Lobster was fresh bread was excellent and had a nice little toast to it.  Perfect amount of butter (not too much) and a pretty good amount of lobster.  Basic and very good.  The service was good too.  Received food fast and girls were friendly and nice.\n\nThere are a few things that keep this truck from being a 4.5/5 star truck.  The main one is the prices.  The lobsta roll is 12 bucks (crab roll 11).  That is just too pricey for a 5 inch sandwich.  I know quality lobster is expensive and they do give you a pretty good amount of meat but 8 to10 bucks would be a fair price for what they are serving.\n\nVery good truck (above avg) but not spectacular, overpriced, but I would like to try the crab roll and the clam chowder if I ever get the chance to go back.", "author": "Mr W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-01", "description": "Started with 3 stars because...lobster. BUT, minus one star for the sandwich being the size of a dinner roll. Subtracted another star because the guy taking the order has ZERO customer service skills. He seemed angry to be there. I mean, wouldn't you be smiling if you just sold a $3 two-bite hors d'oeuvres for a whopping $14! Ka-Ching!", "author": "Sydney R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-02", "description": "Lobster Roll = amazing. Priced high but its lobster so its understandable. On the small size but still very D licious!!", "author": "Mark R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-15", "description": "Went to Off the Grid in Millbrae today and tried the crab roll with butter.  The bun was perfectly toasted.  The crab was fresh, rich, and delicious.", "author": "Leila .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-11", "description": "My husband and I ordered your crab and lobster rolls plus we got clam chowder and lobster bisque. Everything was really good. I really like that you have the butter options for the rolls because I'm not a huge fan of mayo. The lobster bisque was really good I ended up not sharing. Definitely put this truck at the top of my food truck list.", "author": "Heather L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-18", "description": "The lobsta truck is awesome, I go visit them at least once a week. They have great food and friendly service. Their prices are reasonable and quality of meat is excellent. Definitely recommend anyone who hasn't had a lobster roll before to definitely check these guys out.", "author": "Shannon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-21", "description": "Yummy  is written all over this truck, however portions are smaller than expected.", "author": "Marisol G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-09", "description": "Hate to ding a place for charging too much but that's what this place does. I understand lobster and crab is expensive, but this place still over charges for what it is. I had both the lobsta and crab roll.....There isn't a whole lobster or crab on it, its more like 1/2. The taste isn't really great either, over buttered and the bread gets soagy fast. You are much better off going to the supermarket and making it yourself.", "author": "James C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-01", "description": "Sooo freaking good. Second time having the lobster roll with butter at the OC fair grounds. I don't think I will ever be able to pass up their truck! Pricey but totally worth it!", "author": "Jen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-16", "description": "I finally tried a lobsta sandwich yesterday, and I was quite impressed.  The lobsta meat is stuff into a roll that is lightly buttered with garlic.   You can order the sandwich with either mayo or butter.  Or you can order a mayo sandwich with butter on the side.  Light mayo is another option as well.  While the chucks of meat are very large, the sandwich is very small.  It's about the size of a hot bun and it will not fill you up if you're hungry.  For $12, I expect a bigger sandwich but that's the only real drawback.  The sandwich is delicious.  The bun compliments the meat perfectly.  I ordered the light mayo sandwich and it had a light creamy taste without feeling artery clogging.  Be warned, the wait is very long.  I visited the truck at Irvine Lanes which had several other trucks there.  None of the other trucks had a line except for the Lobsta Truck which was about a 40 minute wait.  I'm not sure any sandwich is worth a 40 minute wait but YMMV.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-05", "description": "So, obviously this lobster roll is not as good as one you may find in Maine, and also obviously, it is a lot more expensive.  That being said, I don't think this lobster roll is expensive because it is a lobster roll! Unless you are right in a fishing town where they trap lobster, it will always be expensive. This lobster roll was tasty.  I ordered the regular one and was still hungry.  I recommend the extra meat roll ($20).", "author": "Julia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-27", "description": "Loved the crab roll!! Sure it was $11 and it was a little on the small side but the crab was fresh and sweet and piled high onto the buttery roll.  I am a small girl and I probably could eat two.\n\nWorth every bite.  Normally I would spend $12 on a sushi roll easy and with this sandwich, you get so much more crab.\n\nService was really fast, even with a lot of people around.", "author": "jen k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-24", "description": "i tried your lobster on a roll last week in novato,cal.\nvery good,as good as the lobster roll which is served at\nsam's chowder house in half moon bay,cal.\nmy lobster sandwich has a  little better flavor because i\nuse potato bread which is sized for hot dogs and hamburgers.\nthe brand i use is baked by orowheat.\n\n\n\n                  nat m.       7/27/14", "author": "Nat M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-23", "description": "I had the pleasure of tasting dee-licious food from the Lobsta Truck. Headed over to SOCO farmer market to check-out the line-up of trucks and knew I wanted some seafood. The line was not too long but once my food came out the crowd began to grow. Ordered the Lobsta roll and lemonade. You think pricey for a $12 sandwhich but once you take a bite of the crispy bead with lobster it's totally worth every dollar. Got the roll with butter, not a big fan of mayo. The lobster meat tasted fresh and the bread was perfectly toasted. Washed it down with the lemonade and it hit the spot. Can't wait to try the clam chowder next time.", "author": "Cristy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-08", "description": "Tried the crab roll and the lobster roll, both with mayo, like I had in New Hampshire/Massachusetts. Lobster roll tasted better, but both were excellent. Fresh squeezed lemonade was pretty good too...a little on the tarty side, just the way I like it. The cost is pretty steep, especially for the three-bite portion you're given. It's kinda like paying $5 for a $1 street taco.", "author": "Dennis R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-30", "description": "MMM... tried lobster.. i mean Lobsta.. truck for the first time in the OC. The Clam Chowder is amazinggg. Definitely try it. Another classic item to order from their menu is the Lobster roll. It's lobser wrapped in a some kind of bread roll with either mayo, butter, or both. This is also a definite must try. The only thing that caught my attention was the price and the size of the lobster roll. The lobster roll is $12 and it pretty small. But I guess it is a reasonable price since the lobster, according to the website, is fresh!", "author": "Toni R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-17", "description": "I gotta give a big shout out and thank you to the Lobsta Truck for having an amazing menu and awesome customer service. When we rolled up yesterday, the truck was already closed but the dude inside made two last minute sandwiches for us. They were delicious and so was the lemonade. Thanks for being cool.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-28", "description": "The food quality is good, but the prices are too high. I paid $14 for a lobster roll, and the small size of it was a shock. Some pictures posted by the other users don't properly convey the scale, so the best description I can think of is this: The folded paper tray they put the sandwich in is used as condiment containers at other restaurants. I'd say the bun is about 4 inches long, and the whole sandwich was gone in three bites. As a standalone review, I would have given them 3.5 stars, but I bumped it down because I felt the 5-star reviews needed some countering here.", "author": "J. P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-15", "description": "Walked 3 miles to this truck as it was hyped and came to San Francisco.  Really disappointed with the tiny portion of a Lobsta roll we received for $14.", "author": "Seasbass A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-19", "description": "Finally tried the lobsta truck. First it was really good, cook perfectly & you have a choice of butter or mayo. I chose butter & it just melted in my mouth. The problems are it's very expensive at $12 for a 3 bite lobsta roll. I kinda felt ripped off. Don't get me wrong, it was good but wouldn't come back cuz of the price & size. There lemonade is awesome though", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-28", "description": "Simple sandwich.... Lobsta roll. Simply deelicious. Packed heavy with what youre paying for... Lobsta! But who would ever ruin lobster with mayo!?", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-07", "description": "I was honestly a little disappointed with this truck, especially considering that I was looking forward to it so much before today. I was aware of the prices even before today so they weren't a surprise when I saw them. The big letdowns were the portions and, well, the amount of flavor. Don't get me wrong, I love lobster with every bit of my being. I love its natural buttery richness and the orgy is creates in your mouth when you add actual butter on top of it. However, the butter lobster roll just didn't really do it for me. It was definitely buttery but I guess I was just expecting some other flavors to be present besides butter, so to me it seemed rather bland and boring. Also, as I mentioned, the portion of the sandwich was extremely small in my opinion; all they did was put some chunks of lobster in a buttered-up slice of normal bread and served it. It was really nothing special. Price usually doesn't bother me, but $12 for what I got was a little ridiculous. I think $8 or $9 would be a bit more reasonable.\n\nI am definitely not trying to discourage others from trying the Lobsta truck, I am simply giving a heads up to those who might actually think twice about these kinds of things. While I was a little disappointed overall, there are still other things I would like to try on their menu such as the clam chowder, and for that I will give them another try.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-03", "description": "Tasty stuff.  I have to admit that lobster doesn't float my boat as much as it does other people so if you're one of them take my review with a grain of salt.  My wife and I picked up the crab and lobsta rolls when the truck was in Fullerton tonight.  Pay attention to when they say they're serving cause even though they're there 30 minutes prior (as is their fan line), they don't open until they're good an ready, which  tonight was 5 minutes later than advertised.  \nOnce they are open, the system runs pretty efficiently and the service is friendly.  We ended up getting 2 rolls apiece which fills you up, but not over the top.  The bread is a little overbuttered for my taste, however.  All in all, $46 for the two of us.  If it were $30, I'd give it 4 stars but overall, the quality was good.", "author": "Andrew P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-30", "description": "I suppose the $12 price tag is in line for a lobster roll, but it seemed a little on the pricey side for what you get.  It tasted good, don't get me wrong, but mine didn't fill me up, and I'm not a big eater.  A $12.00 sammich should at least fill a dude up.", "author": "Chris A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-16", "description": "Yum. Not the cheapest, not the healthest, but the worthest because the yummest!", "author": "Stephanie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-10", "description": "I understand that lobster is quite expensive, but the price really is much too expensive for what you get.  I got the lobsta roll and I was able to eat it in like 5 bites.  It's sooo small and doesn't fill you up at all.  The lobster itself is very good, but I just can't get over how small it is!  They take ONE piece of toast, fold it in half and fill that with the lobster.  So yeah, it's TINY.  I absolutely do not believe that they are stuffing even CLOSE to $12 worth of lobster in there.  And the roll was ready super super fast, so I dunno how hard the prep is...  It was a nice novelty, but I won't be eating there again.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-01", "description": "I had hopes of a tasty new England dinner for the 4th of July weekend.  I purchased a lobster roll and a cup of clam chowder.  The lobster roll was a bland bit of lobster on a piece of toast and a so so cup of chowder.  One of my friends bought the crab roll and said it was very tasty.", "author": "Joe C."}
