{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "Earl did an AMAZING job and made me the BEST Key Lime Pie that I have EVER had (says a lot because I lived in FL for 15 years before moving to SF). \n\nThe texture was perfectly firm yet creamy, the balance of sweet and tart was exceptional and the crust was graham cracker buttery goodness (and I loved how it crumbled...not too firm like eating a graham cracker whole). \n\nThank you Earl!", "author": "Erica S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-02", "description": "The service is ultra-nice and I would love to support this shop, but the quality and taste just does not justify both the price and calories. Maybe their cakes are better though? I kind of have a feeling they don't always sell the freshest baked goods and maybe my batch were 1+ day old.\n\nShared the walnut brownie and lemon bar. I couldn't get myself to finish either half.\n\nThe ghirardelli brownie mix is a lot more moist, chewier and packed with chocolate flavor. Even without the mix, I think most at-home brownies are better than this one. \n\nThe lemon bar crust is bad. I wish the lemon gelatin part was more lemony. It needs some umph, though I don't have a solution.\n\nAt $3.75 a piece, I'd rather go to a bougie bakery (e.g., Craftsman and Wolves, b.pattisserie) to spend my money and waste my calories. Or go across the street and eat Bob's Donuts!!!", "author": "Jeanie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Lotta's Bakery is a unique place, it's an antique shop within a bakery - or a bakery within an  antique shop. That itself sets Lotta's Bakery apart from most other places and is already reason enough to stop by and visit Lotta's Bakery.\nWe recently ordered our wedding cake from Lotta's Bakery. We went for their signature Princess Cake and it is to die for. It is soooo delicious, yummy, you won't be able to stop eating!!! If you have any kind of celebration coming up that requires a cake, do yourself a favor and go to Lotta's Bakery.  \nOn top, Earl, the owner, is AMAZING. I am sure you can find other bakeries with delicious cakes, but Earl will go the extra mile for you - and this is something you won't find anywhere else. \nWe will be back and so should you!", "author": "F. P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "Really disappointed after seeing the high reviews here. What is unique about the bakery is that it's an antique shop too. Quirky!\n\nI picked up a red velvet cupcake this weekend, and it was extremely stale. Dry and dry! My heart hurt to throw both the baked good and my money down the drain. What a waste!\n\nNote they also don't carry decaf coffee here. Asked about it, and the response was that no one had asked for it in 8 months. Judge much?\n\nSkip it! You'll waste a whole lotta of your taste buds and money here.", "author": "Tricia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-23", "description": "Very easy to place orders by phone for special occasions, with various sizes that allows less cake to be tossed if the event is for a small party. Owner/baker is friendly. Also sells antiques.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "It's a bakery and an antique shop all in one. You'll miss the bakery if you think you see antiques and walk right by but walk in and you'll go past some antiques to see yummy baked goods. Then more antiques and then a huge kitchen area for him to bake. I had no idea there was a giant kitchen behind the store. \n\nMy favorite CARROT CAKE with amazing cream cheese frosting. And no raisins! I bought a 4\" cake ($20) just because.  I felt a little guilty when he asked if I wanted any writing on it. I was like um, no it's just because I want carrot cake and why buy one slice when I can order the whole cake\n\nRed velvet is pretty good too but the cake itself is a little on the drier side but the frosting is so good.\n\nStrawberry cream with white chocolate flower cake is really good too.  The white chocolate is a little sweet but it's actually a nice accent for the cake.\n\nOrder your full cakes 24 hours in advance or just ask him.  I ordered less than 24 hours before and they were able to do it (ordered at 5pm for 2pm the next day). I think it depends on how busy they are and what you're requesting.  \n\nLove love love this place.\n\nAccepts credit card over a certain amount - I think $10 but I forgot.", "author": "Traci H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "I was walking down Polk street after hitting the gym on a beautiful Friday afternoon and realized I was craving something sweet. So I looked up the closest bakeries on Yelp and came across this little gem. \n\nI walked in the bakery and to my right there were all kinds of great looking cookies, but right underneath these cookies I spotted something even more magical: magic bars. \n\nMagic bars are every brownie lover's dream. They contain coconut, chocolate chips and I'm not sure what else, but I could taste the butter so there's definitely some butter in there... Needless to say, it was freaking amazing and I'm glad I went to the gym beforehand. Totally.worth.it.", "author": "Sabrina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "Its an antique shop within a bakery.  I'd been shopping all around this business and somehow never noticed it and went in.  The guy that works the counter is terrific, rare to see enthusiastic, friendly. efficient staff in this city.  I recommend the pumpkin bread, moist, delicious, possibly the best I've ever tried.  Good work guys, I'll be back.  I've also tried the cookies and mini chocolate tart, pumpkin bread is where they shine!", "author": "M M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-02", "description": "Their cakes looked great, I ordered a brownie and 2 cookies. The brownie was good, and everything was well priced, but I have to give 3 stars because both of the cookies were hard as rocks :(", "author": "Colleen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "Love Lotta's.  I've been going ever since a friend gave me a box of the bakery's cookies years ago.  Stopped in today before closing for some cake for my birthday, a delish plum cake.  Had to get cookies too.", "author": "E C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "Cake was delicious (red velvet). Cake design - Earl did an amazing job and everyone was talking about it at the party. This the second cake from Earl in the past 6 months, and they have been perfect each time. The price is great for what you get, compared to some other higher priced (and not so tasty) places in the city. John is super helpful too. \nTry them you will not be sorry!!\nI will definitely be calling upon Earl for my next celebration!!", "author": "Sara R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-30", "description": "I live close to this place , but it's my first time buying from here. I ordered a lemon custard cake with blueberries & white chocolate for my sis's birthday. It's good, but just a little too sweet. The 4\" is enough for my family to share and not eat too much ! Thanks.", "author": "Catherine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Holy jeez!  That was the most delicious German Chocolate cake I've ever had.  God bless my coworker for having a birthday!!", "author": "S. Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "I have been bringing my business to Lotta's Bakery for the past 2years. Since then, Earl (Chef Baker) has been delivering some of the most amazing, great tasting cakes. In August, we decided to use  Lotta's Bakery for our wedding event. Let me tell you, from the initial cake testing, to the delivery of the cake, I have been satisfied with the overall service and products Lotta's Bakery has been delivering. \n\nDuring our cake testing, Earl took the time to get to know us as customers, along with explaining the styles and flavors of the cakes we were tasting. Ultimately, my wife fell in love with the service and the cake (simple white butter cream cake with strawberries).  Earl was also kind enough to let us borrow a cake stand at no charge.\n\nIf your looking for great tasting cakes and service, then this is your place.", "author": "Hugo C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "Stumbled upon this place through Yelp this past weekend. I was looking for a place to get a small cake to celebrate my friend's birthday. All other places seem to offer cakes 6\" or bigger, nothing smaller...except this place. They offer a 4\" cake for about $20, a perfect size for folks who are watching their figures but want a small taste. I found out that if you don't give the bakery at least a 24 hour notice, they will implement a $5 extra charge so please be advised. \n\nWhen I came to pick up the cake the gentleman that helped me was super sweet. Although I forgot his name (he goes by a different name than his official name), he was knowledgeable and told me about the French pastry chef who takes the time to make these mater pieces and was nice enough to provide me with a candle for my cake. Although a small 4\" cake, they were able to customize it with \"Happy Birthday Sese,\" the name of my friend. The flavor I got was a red velvet cake and it was moist and delicious. I'm definitely coming back in the future, so happy it's right around the corner from me on Polk. \n\nGreat job Lotta's! I'm coming back for that bread pudding!", "author": "Rockne H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-09", "description": "i bought a piece of orange sponge cake  it was dried , also tasted cheap , the frosting tasted just sugary,\nthis cake was not a sponge cake at all !!! tasted like a  simple cake !!!!!! not good at all.\nservice :  the guy who works there also seems like he was in a bad mood  . \nif u work  specially in a bakery a little smile does not hurt and is free .\ni will never go back there.", "author": "Cecilia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "We have been stopping by to try different goodies whenever we are near Lotta's. Every item we order has been excellent so far- we love the Cheese scone, chicken pie, pumpkin bread and this season- hot cross buns! Next we plan to try the sweet stuff: lemon meringue tarts and red velvet cupcakes.", "author": "Helen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "Lotta's bakery was one of a few we tasted before we had a cake made for our wedding.  Once we saw the princess cake and tasted it we were sold.  It is a really classic look and was perfect for us.  Earl was great to work with and we recommend him and his beautiful shop.\n\nStop in and have some cake while taking a look at the antiques in his store! It is a wonderful stop on any Polk street walk.\n\nWe will be back in the future!", "author": "Matt D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "Cute little shop.  It was an antique shop and a bakery.  Small and very charming.  The lemon merengue tart was delicious - the merengue was amazing!  The bundt cake and the cream cheese brownie were also delicious.  Great little place to stop in for a quick treat!", "author": "Shelley M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-17", "description": "Was given a princess cake for my birthday. It was absolutely beautiful but unfortunately looked much better than it tasted. The custard and whipped cream we're fine but the cake was probably one of the driest cakes I have EVER HAD. It also tasted like a super dry vanilla cake rather than a sponge cake (the type of cake that is traditionally in all princess cakes). It was very disappointing and INEDIBLE. I would not recommend ever getting a princess cake here and hope that this was just a mistake (?)", "author": "Isabella L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "This is a lovely neighborhood bakery and amazing customer service. The cakes made to order are done perfectly with decorations as you want and taste delicious. They can do any edible decorations on the cake and give great suggestions too. We get the birthday cakes always from here and they are always perfect and so special!\nP. S. I love the carrot cake!", "author": "Neha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "I ordered a lemon meringue pie for my Sister's birthday and it was exquisite! We asked for extra meringue because it's our favorite part. The meringue was perfect. It reminded us of our French grandmother's meringue we loved as children. It was my first time trying this bakery and I chose it based on the good reviews. The service was top notch too. Please try this place, you will love it.", "author": "Kimberly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "I was looking for a German chocolate cake for a birthday celebration and discovered Lotta's Bakery. The order was for the day before Thanksgiving, so I knew they would be very busy.  When I went to pick it up, the order was ready to go, and turned out to be the most delicious German chocolate cake any of us had ever eaten. These folks are bakers!", "author": "Mary T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "My girlfriend & I decided to get married the night of the 2016 presidential election. We notified our immediate family in Ohio & NY and they decided to fly out for our city hall wedding. My mom searched bakeries online and found Lotta's-- she called from Cincinnati and ordered a red velvet cake to celebrate us. It was delivered to our hotel and it was both beautiful and delicious! Thanks for contributing to our celebration!", "author": "Becca H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "Thanks Earl for making Becca and Kat's wedding cake so special. The girls really loved the cake and everyone agreed it was delicious.  It was a pleasure working with you and I wish you much happiness.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Love this place. Always delicious. Cute. Tons of interesting items for sale inside. I've been coming here for years, just felt the need to get a review in. The chocolate silk cake is amazing. Seems to be my go to for birthdays. Everything I've had here is amazing. I've even bought a few of the odd items that they sell. One of them being an actual tin man.", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-27", "description": "So I trekked up to this part of Nob Hill in order to try Bob's donuts. After suffering through that disappointment, I was walking around and passed by Lotta's and popped in here on a whim. I am so glad I did.\n\nLotta's is an eccentric shop which combines a bakery with an antique shop which serves coffee. Strange, I know, but they pull it off. After talking for a bit with the very friendly antique dealer/bakery cashier, I ordered a few unique pastries that caught my eye. They seem to be popular for their pies as well, although I did not try any of them. Maybe next time.\n\nHamentashen - This is a small triangular pastry which has jewish origins. It has a poppy seed paste in the center. It turned out to be slightly sweet and very interesting. I would rate it slightly above average, although I don't think I would order it again.\n\nBlackstrap molasses gingerbread - I had high hopes for this item as I love gingerbread and am a big fan of molasses. Sadly, it did not really deliver and I did not end up finishing it. It was not as moist as it looks although it did have a decent flavor.\n\nBaba au rum - Wow. Just wow. I randomly ordered this as my last item because I noticed rum in the name. I wish I had ordered two more of these instead of the other stuff I got. It was simply amazing. Dripping in rum, this pastry was soft and sweet and delicious. I will be coming back here for this again and again.", "author": "Mark O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "This place is amazing! I had to call soooo many bakeries to find one that made a German chocolate cake and this place did!! The price was reasonable and they decorated it exactly as I asked. Now for the real important part... This was the BEST CAKE I HAVE EVER TASTED!!! So moist and full of the yumminess! We are it for breakfast the next 2 days after serving!! Thank you so much for making my husbands 30th birthday memorable with your amazing cake!!", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-12", "description": "This place is one of the weirdest, yet best hole-in-the-walls I could have the happy fortune of stumbling upon. I had no clue this place even existed until my girlfriend went next door to KT Nails (great place, by the way) to get her nails done. It just so happened there was a cafe next door, and I had an interview to prep for. Coffee is $1.80 for a cup of organic joe (decaf or regular, your choice), and cookies are .80 a piece or $8/dozen (try one of their, gooey oatmeal raisins, you'll thank me later). There are also massive pies (apple, rhubarb, etc.), bread pudding, and pastries of all kind, all of which are extraordinarily cheap. After you're done eating (place is tiny and has about 3 small tables), you can peruse this store's many antique delights. Ah, if you're into clowns, and I don't know why you would be, there's a creepy one outside that you can sit. Don't know if you'll thank me later for that one. Service is great as well. Can't go wrong with the people who run Lotta's.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "What an eclectic mix--an antique store and bakery!  The bakery was a feast for the eyes with so many wonderful looking desserts. But since we had just bought half a dozen donuts from Bob's Donuts down the street (and I have a weakness for chicken pot pies) we picked up pies. The pies are a must, buttery flakey crust with savory chicken filling.  So delicious reheated. What a surprise!", "author": "Terry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "I picked up a lemon merengue pie for my husbands birthday and it was delicious.  Yum!", "author": "Laura M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "Here's the deal:  this place has AMAZING baked goods, made the old school way.  They have my favorite bread pudding in town (made from the challah bread they make in store). The gentlemen at the counter are always so pleasant and informed about their products. The berry tarts are always sooooo delicious. I just... I just can't.", "author": "Pam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Came here for a gender reveal cake.  They were super friendly and got me a beautiful lemon curd cake the next day.  I don't know if all reveal cakes are like this, but the \"reveal\" part was just in the middle, so it was fun to cut the slice and pull it mostly out before we had our surprise.  I've walked past this place a zillion times and so am glad I finally had a reason to go in.", "author": "Keith A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "How did this gem escape me?! Ordered a reveal carrot cake from here and it was a resounding success. Tasted wonderful and great value for the money. I've never had so many guests compliment the flavor of a cake before. Easy to order in advance and to pick up on the day. Be sure to check out some of the other desserts when you stop in.", "author": "Robin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "Made a pineapple upside down cake for my husband's birthday! Was delicious with lots of caramel flavors.  In particular, they did a great job putting the wording on top of the pineapple (which is a bit tricky by the nature of the cake) with a marshmellow-y fondant.", "author": "Anjali B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "I stopped in and purchased a cake last minute for a birthday. The gentleman that helped me out was so sweet and wrote the birthday greeting for me still even though that takes a while. \n\nI didn't love the cake but that could have been because the birthday girl chose coconut and I don't like the flavor and found it dry. \n\nI'm definitely coming back to try the tarts and other cakes.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "I ordered my wedding cake from here and was so happy with the results.  Earl is extremely helpful and knowledgeable.  I wasn't sure how big or small a cake I needed for our small wedding and he assured me that a two tier cake (6' and 8') would be plenty.  I showed him some Pinterest pics and he created the exact cake I dreamed!  He suggested I come in for a tasting and let me choose which flavors I wanted to try.  My maid of honor and I went in on a Saturday morning and there was so much cake!  We loved all the flavors and picked chocolate cake and a white cake with strawberry jam filling.  Our guests loved it!  The cake was delivered to our dinner reception location for a small fee and there were no issues in delivery.  The cake was reasonably priced and the service was excellent.  I should also add that because I forgot to confirm my order, my cake almost wasn't made.  I called Earl a week before my wedding just to confirm everything was still set and he didn't have the order, BUT assured me it wasn't an issue and delivered the cake on time!!", "author": "Theresa H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-22", "description": "I felt the need to write a review as I had such a TERRIBLE experience with Lotta's. I called this morning to reserve a challah for shabbat...the man on the phone (he works friday mornings) was rude and impatient with me from the start and all I asked was if I could pick up a challah. After reserving a Challah, I hung up and found out I would not be needing one after all and called back less than two minutes later to cancel my reservation. He answered and responded with \"Great thanks for wasting my time!\" and hung up on me.... I was in shock at his immaturity and unprofessionalism. I did not have to even call back to tell them to take the Challah off hold, but I did because I did not want them to waste it. NEVER will I go here again!", "author": "Maya B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "For any family occasion we always get a Princess cake. I gave Lotta's Bakery a shot since it's in a convenient location for me to pick up the cake. The 8\" princess cake was so tall the box smushed the little decorative flower into itself, I was really impressed with the height and weight of it - they didn't skimp out at all!  It was a winner at the dinner table, everyone (even those that don't normally eat sweets) had at least a slice or two and everyone took some home with them! By far one of the better princess cakes in the city. I'll definitely go back.", "author": "Robyn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-25", "description": "I came here to get a few slices of cake for my dads birthday. They have a huge selection which can be overwhelming. I got the coconut frosted cake and a cake dipped in rum. The coconut frosted cake was perfect - moist, mildly sweet, light frosting, and fresh. We kept one slice in the fridge for my grandpa the next day and it was still good. The other selection was also newly baked. I appreciate their dedication to selling freshly made goods rather than resell old pastries which I have seen around the area. I was not a huge fan of the cake dipped in rum sauce. It was way too boozey and the cake becomes texture of mush. However, as a disclaimer,\nI'm fickle with texture of food.", "author": "Rowena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-08", "description": "What a great eclectic place Lotta's Bakery is. Who would have ever thought to pair a bakery with some antiques?  We were looking for some treats for Thanksgiving and ended up getting a few different pieces of pies here.  They were good but nothing mouth shattering.\n\nIf you're into antiques and treats this is the place for you.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "This is not my first review of Lotta's -- I'm sure I reviewed them the first time I was there.  \n\nI have been buying baked goods from Lotta's since they opened.  I love that they're an old fashioned bakery. Their prices are reasonable -- not like the fancy cupcake stores that have popped up all over the place and sell $5 cupcakes  I buy something yummy every weekend.  His pie crusts are flaky, even the next day.  The chicken pot pie is one of my favorites, but I tend to get more sweet than savory like apple strudel, fruit tarts, Hamantaschen, cookies, Lemon squares, Magic Bars (coconut, chocolate chip and pecans --not sure about pecan) on a thin cookie dough.  I've tried almost everything Earl bakes.\n\nI recommend Lotta's to all my friends.", "author": "Lois L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Really nice service.\nGood selection of cakes and pies. Not the same selection as other bakeries so you can find some unique items. \nThe family raved about the Apple Cake that we selected - very moist, nice flavor.", "author": "Brad R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-30", "description": "Sweet treats and antiques! I never thought I would find myself in a quirky antique shop that doubles as a bakery as suggested by the sign of the red jester doll sitting by the store's entrance. I felt like I was on-scene of the Pretty Little Liars show with the dolls and eccentric props. I decided to eat there and take it all in, spooking myself a little with my wild imagination.  \n\nOn to the desserts! I noticed they had a lot of Jewish pastries such as hamentasch and comfort desserts. They had four types of pie that day; all fruits: apple, cherry, blueberry, and blackberry. I got a slice of blueberry pie and a rustic berry tart. The pie was okay; lots o' crust which I like but it turned out to be slightly bland and thick/doughy. The crust of the rustic berry tart was another story - flaky, croissant-like with caramelized edges and bottom. It was topped with some streusel crumble and made with 3 types of berries!\n\nThey have small cookies for 60 cents each, great for sampling. I got their chocolate orange drop cookie, coconut cookie, and plain shortbread. The shortbread was too thin and not crunchy, but the other two were fantastic. They offer a dozen for $6.50 so I'll go for that next time. \n\nAfter finishing the goods, I decided 5 treats weren't enough and went back for two more. I had my eye set on the peanut butter cup, which was this adorable sugar covered peanut cookie with a drop of chocoolate in the middle. Unfortunately, it was too sweet and I wasn't a fan of the hard texture. I also got rugelach; I chose the one with the chocolate filling because that was unorthodox. It tasted more like a mini chocolate croissant, but I liked how flaky and soft it was. \n\nThe young and bubbly girl working there at the time was great and answered all my questions. The baker himself who I saw decorating sugar cookies and talked to later on seemed like a lovely man who was into his work. I would definitely return to this bakery with a flair.", "author": "Alice L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "I ordered to 2  1/4 sheet cakes for two birthday parties happening the same day...the traditional chocolate and the red velvet.  I have never used their bakery or tasted any thing from them but I saw all the great reviews and decided to give it a shot.  Both cakes were excellent but the chocolate was my favorite!  I will definitely be using Lotta's for future parties!", "author": "LaKiesha H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "Earl has done it again. amazing amazing amazing cake for my sister's bridal shower. Cream cheese frosting is to die for and the prices are very reasonable. Thanks again!", "author": "maria k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-27", "description": "I had time to kill before dinner at 1760 so walked around this area -- cute area -- and this place caught my eye.  \n\nLove the concept!  Love the antiques.  Loved the full-body dog costume until I tried it on and it didn't fit . . . very, very sad about that . . . \n\nSo I consoled myself by buying a dozen cookies and they were DELICIOUS.  The baked goods are SO GOOD.  This place is an absolute treasure.  \n\nNow I must find somewhere else to buy a dog costume.", "author": "Karen r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-17", "description": "A very small and unique bakery with all sorts of nick naks. I almost missed it because it didn't look like a bakery from the outside. Ordered the classic apple pie and the seasonal blackberry pie. The apple pie was not bad..just decent. 5 stars for the blackberry pie! It is so moist and not overwhelmingly sweet, which is great for my Asian palette. The man who helped us was very nice.", "author": "Rosanna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-01", "description": "-- Pie to die for --\n\nCame in on a rainy Saturday \n\nApple pie ***** 5 stars!\n\nPecan pie 5 more! \n\nGreat small shop with adequate seating space \n\nLast their cakes look amazing", "author": "Evan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "What an awesome place! Antiques and Bakery in one tiny store... Who could ask for anything more. Talked with one of the owner for about 10 minutes and he was so great. The pastries were awesome!!!! Just loved this place. If you're in the neighborhood make sure to stop by. We will definitely be back!", "author": "Jamie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "Lotta's Bakery is a cute little bakery in SF, tucked away in the Nob Hil neighborhood (right by Swan's Oyster Depot, so make sure you come here if you are eating at Swan's. Or better yet, pick up a snack from Lotta's while you're waiting in line). I got there 20 minutes before they closed on a Saturday, and there were still plenty of people hanging out inside the bakery. I purchased:\n\n-Strawberry Yogurt Cake ($3.80, http://www.yelp.com/biz_photos/lottas-bakery-san-francisco?select=jM_kCM8ypMmUj7EXrgItXg#jM_kCM8ypMmUj7EXrgItXg): Yum! There was a little tang from the yogurt, but the cake was really moist, and the strawberries were really good. They also gave me a big slice, so recommended! I also loved that they will sell their customers a whole pie for $24, but have a sign that says they will slice any pie.\n-Shortbread Cookie ($0.65, http://www.yelp.com/biz_photos/lottas-bakery-san-francisco?select=jM_kCM8ypMmUj7EXrgItXg#ho-pDnKqfFEjRlR521S5sQ): Yum! The cookie was buttery tasting but still light and crisp. Recommended!\n-Coconut Almond Cookie ($0.65, http://www.yelp.com/biz_photos/lottas-bakery-san-francisco?select=jM_kCM8ypMmUj7EXrgItXg#K0Kd1k3q3DJpfxqIU9gkWw): Just ok. There was more coconut flavor than almond, and I think they needed to make the cookie bigger to have both flavors come through.\n\nCookies are $0.65 or $6.50/dozen, so you get 2 free if you purchase 10. The girl who was helping me was really nice, and super patient answering all my questions about the different items. My only criticism is that they need more labels for the items! None of the cookies were labeled, so you have to ask them what each flavor is (and they have 10+ varieties so it can take a little while). I felt like I would have purchased additional items if I knew what everything was. In any case, I will have to come back to Lotta's during the summer when they have more berry pies available! There are also a few tables inside the bakery for you to sit down and eat your items in if you'd like. Parking in this area was easy to find around 5pm on a Saturday, but all the street parking spots are metered.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "Lottas bakery has the finest  gingerbread molasses cake I have ever had or ever conceived of. I stop by about once a month.   Everybody should try this at least once in their short life", "author": "bill h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "The pastries (chocolate brownies) here are legit. I haven't tried too many of their pastries but I'm sure to come back for more!", "author": "Julie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-22", "description": "A quirky little store that's part bakery, part antiques shop. Depending on which owner you ask, either the bakery or the antiques shop is the primary business of the venue.\n\nDropping in after a stopping at Bob's across the street (yes, I know, I tend to binge buy when it comes to baked goods), I perused their offerings briefly and decided to pick up four of their cookies: shortbread, oatmeal raisin, Mexican wedding cake, and double ginger, at $0.65 per (alternatively, you can get a dozen for just $6.50 - essentially two free cookies). \n\nOverall, not bad, not great. My favorite of the bunch was easily the oatmeal raisin, followed by the shortbread (one of the lighter-tasting varieties I've had though), ginger, and Mexican wedding cake.\n\nWorth dropping in on if you're already in the area, but I don't really see myself craving them enough to make a trip of it. Bob's on the other hand... I can see myself possibly stopping by after fulfilling a doughnut craving. \n\n***Accessibility Info***\n\nVenue - No problems with accessibility here, as long as you're just here for the baked goods. If you're here to do some antiques shopping, I suspect there may be some difficulties navigating, as the back seemed a bit more cramped (but I didn't actually check them out to verify).\n\nBathroom - I'm not really sure if they even had any.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "I absolutely love this bakery it's one of my top bakeries to go to!! I have an extremely bad sweet tooth and when I want a really good fix I go here cause it's just so damn good. A few of my favorite pastries from here are 1). Buba A rum, it's so fluffy and delicious 2). Bread pudding! Wow it's fantastic! 3). There lemon squares are to die for also highly recommended. Not just cause they have great pastries I rate them five stars also their  service is great the gentleman that work as bakers and ringers are all very sweet and friendly I love browsing at the antique section also great deal for your buck. This is truly a San Francisco gem.", "author": "Josh R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "Wow!  What a great place!  My daughter had a birthday, and I Lotta's came to the rescue!!!!!!!  Folks, absolutely unbelievable customer service and great folks all around.\nI had some 'other' Bakery let me down and they had a cake ready, and delivered in less than an hour!\nTHANK YOU so much for allowing me from far away, to still make her day special.\nFolks whether you are in SanFrancisco,,,,or out of town - highly recommend!", "author": "Beth F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "The owner is a 10! The Thomas the Train cake he did for our son's 2nd birthday was amazing!  It looked fantastic and was absolutely delicious! It was a huge hit at the party!  He also made cupcakes for the party that were so yummy! We wanted to go with a local place for this occasion and we are so happy we did.  The prices were reasonable and so worth it.  The order process was super easy: we called, we sent some pictures for ideas, we came in, discussed and ordered.  Then the day of the party we picked up, right on time, everything was ready to go.  Great transaction.  We definitely recommend and will be going here for future events! Overall great experience!", "author": "Diana P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "This is such an amazing hidden gem. Great coffee, baked goods, and quirky rare findings. What a great combination.", "author": "Pablo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "I had a gift certificate I'd been putting off using for a special occasion. Finally I went for a pie on 3/14. Get it?... Pi?... 3.14... ANYWAY...\n\nThe owner is such a sweet man. We first met over the phone when I called ahead to see what they offered in the way of pies. As soon as I heard \"pecan pie\" I was sold (though I must say now I want to try the lemon meringue). I drove over and luckily found a parking spot right in front of the shop. Polk can be tough sometimes!\n\nThe storefront is adorably decorated with vintage/antique trinkets and nic-nacs and photos of dames of the past like Marylin Monroe. Super charming. There are two display cases filled with delicious pastries, cookies and much more! I had come for the pie, but also added a cheddar onion scone and a couple wedding cookies (my fave) for just a few more bucks. I'm so glad I did!\n\nPecan Pie: buttery, rich, flaky pie crust, unlike anything I've ever tasted. Perfectly toasted pecan chunks on top, with a filling of brown sugar and caramel flavors. I already really like pecan pie, but this one? IT'S LOVE.\n\nCheddar Onion Scone: Fluffy, yet holds its structure well. I ate it the next morning, toasted, sliced in half with scrambled egg in the middle. So so tasty, and way up there on my scone list. Scones are meant to be soft and delicious, not brick blocks of flour. Lotta's scones I'll be back for for sure. \n\nMexican Wedding Cookies: Also a fave of mine to start, and these did NOT disappoint. Super rich and buttery and the walnuts! OH the deliciously decadent walnuts. \n\nPretty sure I've found my new favorite bakery.", "author": "Meredith S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "I love Lotta's!  The proprietors (\"The Baker and the Antique Guy\") are the most talented, gracious and personable fellows.  The confections and antiques make this a must stop on Polk.  However,  I have just learned of a NEW treat there: the Chicken Pot Pies that are  baked from scratch (with love!) only on Saturdays.  $6.00 each.  OMG!   Although I like Mollie Stone's for some salads...I've noticed that their Chicken Pot Pies are 8.99 and look like a baby elephant's toe nail!  No bueno.  RUN to Lotta's!  You will be glad you did!", "author": "Patrick J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-16", "description": "I really can't rave enough about Lotta's! Around 7 months before our wedding, we walked by their store on Polk St and took a flyer. After seeing their SUPER reasonable prices, we booked a cake tasting.\n\nWe tasted the Strawberry Cream, German Chocolate, and Princess Cakes.... And fell in love with all three!\n\nWe decided to go with a \"presentation\" princess cake for the grooms, and Earl was able to duplicate the photo we brought in pretty much exactly.\n\nFor the rest of the guests, we got a 1/2 sheet of the two other types of cake.\n\nEverything was perfectly on time, Earl was amazing about communicating with us, just super friendly & professional throughout the whole thing.\n\nPlus, it was incredibly affordable.\n\nI will give Lotta's as much business as I can in the future!", "author": "Will C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-07", "description": "Good apple pie, but crust need more butter to get that true flavor and flakey-ness.", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-21", "description": "I have ordered a few bespoke things from here and all have been incredible. \n\nWe've had a multi-layered raspberry chocolate cake with adorable garnishes on top that was soooo delicious - made for an office birthday celebration\n\n4 dairy free (and I found out later - vegan!) chocolate cupcakes for a small family holiday celebration that were ah-ma-zing! We're not vegans but who would care if all vegan food tasted like these!?\n\nI'm also expecting a couple of cakes for tomorrow and am so excited to taste those too! \n\nOh, and the antiques are adorable. The prices are reasonable. The staff and customer service are really just fine - 1 of the 2 gentlemen that works there is quite accommodating and sweet. The other one does a fine job too. \n\nI have been told that they can make all kinds of custom things, the trick is to call several days ahead and they will cheerfully and expertly make whatever you want. \n\nI'll keep going back over and over.", "author": "Katie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-24", "description": "Very good bakery and the owner is an absolute love. Very kind and light-hearted. Everything we tried was good and I noticed that everything was very European in that there were no strong, overpowering flavors. Nothing was very sweet, which is what my pallet is used to. I appreciate Los the more simple flavors and high quality.", "author": "Melissa D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-17", "description": "I've been wanting to try Lotta's for quite sometime now, but late riser me seems to never make it there before their 3pm closing time on Sundays. Luckly, much to my excitement today I woke up at a decent hour and took a short walk down to Lotta's.  I was mesmerized by all the treats as I walked in.\n\nI knew for sure I was getting the bread pudding plus whatever else struck my fancy. WRONG... I ended up not getting the bread pudding because just as I was about to say, \"one bread pudding please\" a little fly landed on top of it! Maybe it's me being overly sensitive, but I had to chage me choice. I ended up with the mixed berry tart, that the fly probably landed on also and the coconut shortbread and Mexican wedding cookie.\n\nThe berry tart was yummy and I'm going to try other cookies on my next visit.", "author": "Jennie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-15", "description": "I didn't recall seeing this bakery before, but judging by the Yelp reviews it's been here for awhile.  There's even a red Yelp sticker on the door.  From the outside looking in I noticed there was nobody inside, but even by looking through the glass door the beautifully decorated baked goods in a pastry case and behind a glass counter caught my attention and drew me in.  I was so taken by the assortment of the cookies, breads and cakes I didn't notice the antique items for sale until I stood before the cash register.\n\nI purchased only a small number of items just as a snack to take on CalTrain for my ride down to the Sharks game.  \n\nThe miniature lemon meringue tarts (http://www.yelp.com/biz_photos/L-P-Vqy45mTOeYUdLjyMfQ?select=sl-Lm-CdXLg7K5S6YlGJGQ) caught my attention immediately.  There are two sizes.  One is about three inches in diameter and the other is about an inch.  Had I known these were so good I would have taken the larger size over the mini size.  In fact, I thought these were excellent.  Over-filled in a thin shortbread crust is a tart and tangy lemon curd topped off by a swirl of fluffy, sweet meringue.  It was a bit on the sweet side, but isn't that why we eat dessert?  The little minis were only $1.25 each.\n\nThe chocolate orange drop cookies (http://www.yelp.com/biz_photos/L-P-Vqy45mTOeYUdLjyMfQ?select=OroPpqXUePs8yxi0uxMBbg) were very good.  These were almost as chewy as a chocolate brownie.  Topped with a sprinkle of powdered sugar there was significant orange essence noticeable with every bite.\n\nThe peanut butter cookies (http://www.yelp.com/biz_photos/L-P-Vqy45mTOeYUdLjyMfQ?select=6XkasOvw-DCtuW5j1yVF0Q) were very good too.  They had good peanut butter taste with just the right amount of saltiness to sweetness, and they were moist and crumbly.  If you're like me and not a fan of crunchy peanut butter and prefer not to have chopped peanuts in your cookies, these would be a good choice for you too.\n\nThe checkerboard shortbread cookies (http://www.yelp.com/biz_photos/L-P-Vqy45mTOeYUdLjyMfQ?select=OCQmIoURm5ovj5nFB-rC6w) was the only selection that did not thrill me.  The cookies looked fine but tasted boring with not enough butter or shortening, and in my opinion, not enough sugar.  I'll pass on these next time.\n\n55 cents per cookie, but I think there is another price if you're not buying just individual cookies.  The woman that helped me was very nice and very patient as I peered through the glass display uncertain of what I wanted to try.  I'll be back for more.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "Very quaint little location, definitely has a very homey/friendly ambiance to it (complemented by the antique store towards the back.)\n\nThe gingerbread is definitely one of the better ones around; it is VERY gingery/spicy, much more authentic than what you would get at a supermarket. The cheese scone was very light and great small snack, and the double chocolate cookie was phenomenal.", "author": "Landon E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-28", "description": "I and my husband have visited Lotta's Bakery quite a few times and.we love the neighborhood and the antiques and have brought a few pieces. How nice we can have coffee and pastry and browse the antiques. We love the ambiance and the very friendly staff and owners.. It feels at home there. \nNow, the pastries are nothing short of amazing, baked to perfection. The cakes, cookies, biscotti and pies are also scrumptious and if you need a wedding cake, this is the place! Also, the prices are reasonable. So, enjoy!  We always do when we visit.", "author": "Donna C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-10", "description": "We ordered a red velvet cake for my moms 60th birthday from Lotta's based on all of the reviews. It was beautiful, but the flavor was disappointing. The cake was very bland and the icing just tasted like butter. Pretty bummed...", "author": "Courtney O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-08", "description": "I was trying my best to eat healthy this week.\n\nSalads. No sweets. No fried foods. No heavy creams. Lots of fruit...\n\nuntil I had to run an errand on Polk street and spied Lotta's Bakery.\n\nI only went inside to browse.\n\nTo peruse the rows of decadent baked goods and pastries.\n\nI kindly thanked the warm people behind the counter, and was on my way out -  when I saw it.\n\nA simple sign which neatly read - \"Honey Cake.\"\n\nBeing polite - I commented on it.\n\n\"Yum - Honey Cake. Sounds good. Trying to be healthy - but I will definitely have to come back for that.\"\n\nI smiled real big and made my way to the door, when the gentleman behind the counter - wiped his hands on his apron and jovially yelled after me.\n\n\"Unfortunately it won't be here next week. It was made specially for Rosh Hashanah.\n\nI stopped. Took one real long hard look at that oh so sweet pastry. That limited edition masterpiece - and a defeated look crossed my face.\n\n\"ahhhhhhhh  - I was trying so hard to be healthy, but I'll take one Honey Cake then, please.\"\n\nThey cut me off a massive slice of freshly made, moist honey cake.\n\nIt was lovely. The perfect thing to satiate my sweet cravings and I made sure to share it with my co-workers as well.\n\nLotta's - a solid spot for sugar cravings - after you've picked up a sandwich from Miller's Deli.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-07", "description": "FABULOUS PIE!!! \nWhen it comes to pie, it's all about the pie crust and NOBODY does pie crust better than Lotta's!  The bottom crust is crunchy.  Always!  Never soggy.  That alone makes every pie delicious to the max.  I have tried the  pumpkin, pecan and have special ordered the most scrumptious banana cream pie (twice! because once was NOT enough!)  I've even bought an empty crust to fill with my own filling.  Wonderful and glorious.   Next I am going to try the lemon meringue.  Earl also has excellent cookies and very tasty coconut macaroons.     But I can't say enough about the PIE!!!!\nIf you LOVE pie, you will LOVE Lotta's!", "author": "Kassy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-11", "description": "I love the pies from Lotta's Bakery and often get them for get togethers with friends. I always get asked where the pies are from, since they are so good and fresh. \n\nI tried their chicken pot pie for the first time the other day, and was blown away. It was so flavorful, with the right balance of chicken and veggies. \n\nLastly, the service at Lotta's is always great. I have had a positive experience with the friendly people working there every time I go, and I stop by at least once a month!", "author": "Yuki S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-19", "description": "Oh.my.gawd.  The rum cake!  Perfect blend of rum and syrup, but not too sweet.  Soooo tasty.  We also got the bread pudding but had to immediately write this Yelp review as the rum cake was incredible.  You can tell that everything is carefully handmade.  Such a cute little cafe!", "author": "Nicole K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-08", "description": "It is a very cute store.  I tried the following:\nStrawberry/cherry tart  not crunchy enough:  3\nPecan pie -- the pecans fell apart not enough \"glue\", but I liked it a lot as it was not too sweet and had a crispy crust:  4 \nLemon Meringue Pie - PERFECT crunchy crust that was golden brown, but it was a bit too sweet, thus:  4.5.  I would come back for this alone.\n\nThey over charged me by $3 and did not get an apology from the lady that did it for having to come back to the store. However, the gentleman that handed me back the money did.  Pay attention to the charges.", "author": "A D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "Baba au rhum and bread pudding are delicious. But how about some silverware? Your an antique store and I have to take down this great big eggy moist slice of bread pudding with a plastic fork? The plastic fork can break trying to eat the Baba or Bread Pudding.", "author": "Devin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-18", "description": "I have not even stepped foot in this bakery but I am reviewing simply on the customer service I had on the phone today. I called to ask about cake prices for my mom's birthday and whoever answered the phone today (6/18, around 1:00 pm) was very rude and hung up the phone so quickly without saying \"Thanks\" or \"Bye\". Sorry but you just lost a potential customer and I will be taking my business else where!", "author": "Kimberly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-13", "description": "Delicious!I love you I love you I love you so much I had to more far far away from to to prevent.... Think the worse!\n\nI love this place. The manager is so nice and talented. They have the best shortbread cookies I've tried period. I will never of course tell my grandma this... I think she has a yelp acct as well... lol I've had their bread pudding here very yummy. The PB and mexican wedding cookies.... The pumpkin bread is very good. The lemon tarts sell out everyday by noon probably still that way till this day, so sad as I've never been able to eat one, because they always were sold out. You can also order a cheesecake which you cannot by a slice prior to taste, but buy in confidence one of the best cheesecakes I've had in a longtime.\n\nLove you Lotta's, When in the city I vow to come by :)", "author": "Dominique M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-10", "description": "HAVE YOU HAD THE MOLASSES BREAD?\nDelightful bakery goods I'd recommend the world over. Literally, everything I've tried here is beyond my expectations of delicious, moist (yes, I said it) cakey sweetness. And reasonably priced.\nAh bawg gawd. Seriously.\n\nThe antiques are cute, and fun to look at.\n\nMy \"adorable anecdote\" (I won't be offended if this isn't useful to you)\nWhen I first came here, my friend and I were peeking around and kind of stumbled into the kitchen to meet the owner/baker who runs this place with his partner (who does the antiques) He showed us around and talked a little bit about how he got started and in general was extremely nice and welcoming to some drowsy spring chickens (my friend and me, 20ish tourists) He bakes all the goods, which I didn't know were so spectacular at the time, but the story was great.\nSo cute, my heart melts a little bit.", "author": "Leah Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-29", "description": "I love going here for an afternoon coffee, pastry and peaceful atmosphere.  \nThe art deco antiques keep my eyes busy and gratified.  \nMy taste buds are crying out; \"give me one of everything!\" \nI've always felt welcome and valued.\nOf course, I can't help myself, always get something to eat later at home and you will, too.", "author": "Corinne d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-19", "description": "Yes! Yes! Yes! Everything we had was good: bread , udding, pecan tassies, 3 different cookies, (shortbread which was not my fav or the 3 and sugar and snickerdoddle) cream cheese brownie, did I say bread pudding because its phenomenal. The service was great and I will definitely be stopping back by often... I have to thabj yelp for steering me to them. GO!! You will NOTreget it", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "Hands down best chocolate cake ever! You and your guests will not be sorry. I'm not a cake person, but this is amazing! Been going here for 3 years & highly recommend!", "author": "Lindsey R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-21", "description": "I really love this place! I thought the set up of antique store plus bakery was quite unique. We didn't buy any antiques but we sure did buy lots of baked goods. So far I have eaten the Rum Baba.. which is like a cake bun in rum sauce.. really really really really good!!! I am totally going back and buying a dozen of those LOL. Geesh I forget the names of the others but apple tart I think, chocolate mound thingie, meringue cookie sandwich with chocolate in the middle (yum!), apricot tarts covered in chocolate.. yes we bought a lot! And we wanted to buy even more! It's ok we live just a few blocks away from Polk so we can come back anytime! Oh and total was $18 for everything.. unbelievable!! I am in love.", "author": "Vol T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-08", "description": "I wandered into Lotta's almost by accident. I had some time to kill and my eye was drawn to their pink sign. the word \"bakery\" sealed the deal. I planned to just window shop, so I hesitated outside the door intending to read the menu. The man sweeping the stoop caught my eye and invited me in. It turns out, he's the owner and does all the baking. There were all kinds of lovely things to choose from. Bread pudding, slices of pie, gorgeous cupcakes, and a pastry that I think was swimming in rum. Basically, it was everything your Eastern European Grandmother would make and then some. \n\nI ended up buying a cheese & scallion scone for myself, chocolate rugelagh for my mother, and a rocky road brownie for the friend I was meeting. My scone was buttery, flaky and light with a lovely cheese flavor. My friend's brownie looked wonderful and disappeared in record time. \n\nDelicious baked goods are only half the story. They also have antiques. I didn't explore much, but there were definitely interesting things. Really lovely interesting things. I have to say, Lotta's is truly unique. \n\nIf you are in Nob Hill shopping on Polk Steet stop in and see what you can find. I plan to go back and try one of those rum things.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-23", "description": "The molasses gingerbread here is like crack, only in a good way. It's good fresh, and even better just a little bit stale. Chewy, spicy, rich, delicious. \n\nI ordered one of their strawberry shortcakes for a birthday and it was simply delish.", "author": "Roxmarie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-05", "description": "I only write reviews for places I absolutely love or absolutely hate.   Lotta's is fantastic.  The only bakery I go to.  I won't tell you my favorite items as I don't want you to go and buy them out before I get there.  Irt's all great so just go and try it out!", "author": "Mike F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "A lovely little bakery nestled between shops on the busy Polk st. If you have a specific cake, pastry, or pie in mind, you can call the store in advance to place a custom order. Very good prices. A great variety of over the counter treats.", "author": "Amy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-30", "description": "Yes! Randomly stumbled here but am so glad I did! Lotta is so sweet and friendly and her baked goods are outstanding! There must have been at least 10 different unique cookies and priced at only 60 cents each, you can be sure I ordered at least half a dozen just for myself. I also tried the cheddar and onion scone which was delicious as well.", "author": "Tiffany F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-13", "description": "How can you not love this place!?! But more importantly how you you not love Richard and Earl!?! Lottas is a place that you know everytime you come in you will leave with more than you expected and with a big smile.", "author": "Trevor D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-01", "description": "Awesome little shop!  They had pumpkin pie when every other bakery I called didn't.  They also have some amazing other desserts!  One comment though: they should display their food in the window, and then their popularity would sky rocket because people would see the awesome goods as they walk by, the shop is easy to miss walking by.", "author": "James M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-19", "description": "Classic SF-P.A., (p.a. stands for passive agg.) Seriously I've been there 50 times over and always say hello to you Mr. 1/2 bald white hair mustache baker.\n\nToday I tie my Great Dane to the locked door handle and stepped inside. I wait and wait to be served because one customer is buying art from your walls and as I am waiting for my change you run out of the back past me and though I smile and say hello, you blow by me and go to my dog and shoo her from the doorway. \n\nNever mind that my dog is on a short leash and only had her head in the doorway. Never mind that it was the previous customer who stopped in the doorway and was petting my Dane thus causing her head to be in the view of the door opening. Never mind that other three customers sitting at the table inside were calling to my dog and bemoaning the fact that she can't come in. Never mind that you are a D**K for assuming a dog is somehow the blame and for what, for being a sweet gentle creature who was patiently waiting OUTSIDE your business. \n\n Yea, I like your sweets, but hey your attitude is what IS being baked into them and I tossed your apricot bar into the compost bin because frankly it's about heart and you haven't got one.\n\n So, I am not giving you one star because then I would be a SFPA wisenheimer 2! \n\nI hope you read this, because you'll see me on the street and wonder why I don't buy your pastries any longer  and then also when you wonder why I tell you to your face to get bent, you won't be surprised.", "author": "Nik D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-16", "description": "Earl's goods aren't to shabby at all. His cookies are yummy adn even sweeter than his goods is his philantrophy and his attitude. Admittedly, his cookies are more crisp and saltier than other shops, but overall they're yummy.", "author": "R C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-25", "description": "Lotta's bakery is super cute. When you walk in two dapper gentlemen greet you with a very friendly but heavily laced sarcastic banter. I am a bantering champion, a winner of many grungy dumpstered medals of such a sport. These older gentlemen have been crafting their skills for years and the ride is so smooth (you must be a limousine?).\n\nIn the back of Lotta's is an antique store crammed with many wondrous delights. My sweet pal Lucky swooned over a couple of vintage pink lamps until we were both tickled by a cartoon finger that lead our floating bodies to the pastry case. \n\nWe filled a small box to take home, including a small yellow iced duck cookie for our buddy. Lotta's makes a damn good cookie. Holla.", "author": "Alysia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-23", "description": "I'm so happy we stumbled upon Lotta's Bakery while running some wedding errands in the city.  I was craving something sweet and Lotta's Bakery hit the spot!\n\nInterior: cozy, super cute, pink, antique elegance\nCustomer Service: warm and welcoming\nValue: cheap and you get more than what you pay for\n\nThey have a wide array of desserts - cupcakes, cookies, pastries, bread pudding, coffee cake, cinnamon buns, macaroons, cake, muffins, & even dog biscuits.  \n\nI only planned to get 1 thing but I walked out with 3.  The coffee cake was delectable. My favorite was the glorious serving of bread pudding which was made of their cinnamon buns. (yup, I asked because I am a bread pudding freak)  The other dessert I tried was a small roll filled with raspberry, no idea what they call it but it was equally delicious as it looked.  I wish I would've bought more!", "author": "Nikki C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-31", "description": "parking...hmm, go around the block and maybe you'll find some.\n\nI generally don't talk about service unless its a BIG DEAL or its HORRIBLE.  In this case, if its slow and the lady(maybe the owner) is reading the newspaper at one of the tables...she won't get up until you show interest in buying something.  If you're still looking she's going to still be sitting.  No Complaint by me...just an observation.\n\nSo i took a strawberry pastry but didn't ask what its called but it tasted DELICIOUS!  Cooked the way i wanted and the portion in the middle.  If you want the crust or edge...they have that too.\n\nMy mom took the strawberry/rasberry tart..it was DELICIOUS!  \n\nThe place is ALSO an ANTIQUE shop...so you can look around to see the things you might have had when you were younger...or buy it just because you've always wanted one.  I saw some things that I haven't remembered in YEARS.  I wonder if mine are worth as much as she's selling them for.\n\nGive this place a go.  Its cute, it tastes great.", "author": "Bing D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "I ordered twice by phone at Lotta's Bakery and each time it was on a special day (24th and 31st of December). They reserved the cakes and I could pick them up later during the day before 5pm. The staff is very kind and of a good advice when you hesitate between several choices.\n\nNow about the cakes. They were wonderful, tasting great and more importantly to me, not heavy at all on the stomach for what I ordered (one of them was a cheesecake). I definitely recommend trying Lotta's, they are worth it!", "author": "Emmanuel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-13", "description": "Lotta's has the best black Molasses ginger bread I have ever had. Just the right amount of moist, real molasses and real ginger. it taste's like how my momma use to make it from the South. I make mine stickier and if they did that I would be in heaven but amazing taste and texture. My next favorite is the fruit gazettes. They melt in your mouth. The fruit be it berries or peaches or apples somehow taste authentic unlike canned versions. Also, the pumking bread is pretty tasty. Wish it was more on the moist side.\n\nThe best by far is the au rum balls. OMG, sheer heaven decadence. I could eat 5 but tend to get only one as it is so rich enshrouded in rum sauce. so much sauce left over I will pour on the on the pumpkin bread which then makes it moist. Crafty me. The handmake cakes (chocolate ribbon, marzipan) are to die for. Words cannot describe the myriad of flavors mixed together in every bite. The atmosphere is quaint with antiques around you. The french roast coffee isnt my favorite and wish there was a mixed blend, holiday blend or italian roast. For this bakery I suggest Philz or Four Barrel. The proprieter is a lovely man who knows culture, desserts and everything travel. He is engaging and down to earth. My fave little dessert place on Polk. Open til 5 weeks days. Thanks Lotta's :)", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-06", "description": "Lotta's is a super cute place. Lots of atmosphere and the girl behind the counter was a sweetheart. Everything looked extremely tasty, especially the pies, but I was excited to see rugelach and hammentaschen... I got one each of the raspberry and apricot rugelach and a cheddar onion scone.\n\nThe cookies, while tasty, were made with a sort of puff pastry dough rather than the dense pastry I'm used to... they were more like mini rolled danish, but again, they tasted really good. The scone was definitely a biscuit, rather than a scone, sort of fluffy, but the flavor was wonderful with just a hint of the bite that cheddar can give savory pastry. Super mild.\n\nI'm excited to try more things here!", "author": "Allie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "Recently I ordered a wedding cake from Lotta's Bakery.  We priced out a few places and Lotta's was reasonably priced.  It was two large tiers with beautiful flowers on it to serve about 30 people, but we ended up with quite a lot extra.  The cake was lovely - exactly what we asked for.  We worked with Earl who was extremely easy to work with - his e-mail communication was prompt.\n\nThe cake we choose was the chocolate espresso mousse, which was not exactly my thing, but our guests and my husband LOVED it.  The only thing I could improve on would be the flavors.  I would have loved a carrot cake or so.  I didn't think the other flavors we tried were that delicious (lemon was good, the white cake was just okay).\n\nI would definitely go here again - they make beautiful, elegant cakes at a reasonable price and are very easy to work with.", "author": "Chelsea K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-09", "description": "I love pastries..especially cookies and brownies.  The cinnamon roll was okay, nothing special.double chocolate chip cookies didnt taste chocolatey at all..salty in fact..and the brownie was eh..not sure what ingredients they're using but I questioned whether I was treating myself or punishing with some health food.", "author": "Ghezal O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-11", "description": "Mini lemon meringue for $3.75\n\nGood beyond belief. This place is waaaaaaay too close to my house. \n\nThe pastry chef was very polite and nice to us even though I didn't place a huge order. \n\nDEFINITELY going back.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-05", "description": "After being fed up with Whole Foods's stale cookies for $1-1.25 a piece. (Even the ones in the \"freshly baked\" area are hard, what gives?) \nAnyways, I decided to grab some cookies from here. DELICIOUS chocolate chip cookie for only 65 cents a piece. I only give it 4 stars because I like my cookies to be very chewy and it wasn't the best cookie I ever had. But, I will definitely come back when I need a cookie fix and to try the brownies.", "author": "Bellal N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "Found myself with a rare, free 1/2 hour and fell into Lotta's Bakery. I was attracted by the sweet pink and white awning and the 'arts and antiques' sign. It all looked very Parisian. I wasn't disappointed. I was served a hot french press coffee and a chocoate base macaroon for the grand total of $3.15. The heck w/Starbucks (& Peet's) when you can sit for a quiet moment, do a little writing and be enchanted by old music and a stunning array of baked goods. Recommend!", "author": "joan g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-30", "description": "Super-creative clever bakers -- made an amazing cake requested by my-son-the-best-man for his brother's bachelor party.  It was tastefully lewd and VERY tasty!  The request was for something they'd never created but they did it -- fun and funny.  (All their creations are delicious ...)", "author": "Em C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-22", "description": "Customer service is lacking. I called in to potentially place an order, for the following day, half an hour before Lotta's posted closing time. When I informed the gentleman on the phone that I was calling around for prices I was told that he was closing up shop and I could leave a message for him to receive tomorrow and he promptly hung up. The desserts look great, but if you are looking for better service, there are better places in town.", "author": "Lauren N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-07", "description": "It's humble, it's quiet, and it has everything you want from cakes to cookies to pies to my favorite, their bread pudding.\n\nCupcake alert: Don't come here for cupcakes because it's far from the trendy and delicious bakeries that specializes in cupcakes, but if you must, go ahead and order one to see for yourself.\n\nJONASAPPROVED!", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-04", "description": "We stopped by here after eating at Miller's deli across the street.  I can say I only liked one of the 4 items we tried and that was the coconut shortbread cookie.  It wasn't too sweet, lots of coconut in it.\nThe red velvet cupcake $3, was very dry.  The cream cheese dollop on top was quite good but the cupcake wasn't.  \nThe coconut macaroon (sans chocolate) was cold, refrigerator cold.  I guess it was premade and then pulled out of the fridge.  The bottom had this gooey fluid.  Definitely a no-no.  A macaroon should have a nice and dry, crispy or crunchy exterior, not wet.\n\nLastly, we took home an apple pie for $18.  The pie looked good with a crust that stuck up so high like a chef's torque.  But, when sliced into it, the insides were flat like a pancake.  The apple filling inside was so overbaked that it was like pulp without any semblance of apple slices.  The flavor was good, but it clearly was overbaked.  I didn't like the crust either.  Sort of soft in the center and the edges, where the thickest part of the pie is, was too hard to eat.  It's like the crust I used to make when I first started to learn how to make pies.  \n\nThe clerk was really nice and the bakery serves as a 1/2 antique store.  Can't figure out how you can sell old dusty stuff along side with food.  The food is displayed nicely, too bad our choices disappointed.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-10", "description": "Give yourself plenty of time when you go (and you should). There are so many cookies, brownies and other baked assorted baked goodness to choose from you'll need a few minutes to figure out what you want.\n\nAfter much deliberation, I went with an orange chocolate cookie. One bite later it became an outstanding orange chocolate cookie. And since it was less than a buck, the final name I'm giving it is a cheap outstanding orange chocolate cookie.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-08", "description": "We needed a quicky wedding cake for the gallery (these things happen) and ran to Lotta's to get one of Earl's chocolate ganache cakes.  It was SO GOOD.  I'm still thinking about the nut layer on the bottom of the cake, which complemented the chocolate so very well.  And really, it was a deal when I realized how many people we served.  My husband really liked the pretty chocolate curls, which actually looked AND tasted good.  This is our new go-to cake.", "author": "Jennifer F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-18", "description": "I was hoping the quality of the desserts were as good as their presentation, but after a few experiences with stale product we've decided to pass this shop by. We did have good gingerbread here once, but the quality is inconsistent unfortunately.", "author": "Lord F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-21", "description": "I stumbled upon his little gem over the weekend with my bff. Lotta's is a unique little store that is part bakery part antique shop. In here you'll find everything from old record players to hamatashen.\n\nI got a slice of apple pie, a lemon bar, and a dog cookie (because dogs like cookies too!). I thought the lemon bar was my favorite. It was really tart and sweet at the same time and the crust was perfectly buttery. The apple pie was okay in my mind. The filling was pretty good, but the crust was okay. I can't tell you how the dog cookie was; but, my dogs would give it two paws up!", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-11", "description": "Apparently the most popular items in this bakery is the coconut macaroons and the chocolate brownie with cream cheese so I bought them both.  One of each for $4.25, I think.  The macaroons are AMAZING.  So moist and chewy and coconutty and delicious.  The brownie was alright, it was $3 for a bar.  I enjoyed the macaroon better.  The older gentleman who worked there was super nice.  I'm going back for Valentine's Day.\n\n(They have a huge array of baked goods: biscotti, whole pies, fruit tarts, cookies, et).", "author": "Walerz B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-01", "description": "I once tried to start a Yelp conversation on Lemon Meringue Pie, and only got like one reply.  I was so disconsolate.  No fans of Lemon Meringue Pie in SF, that must mean that there's no demand.  And if there's no demand, then there can be no supply.  I trudged around SF for days wondering how to carry on.  Homeless guys offered me money, I looked so bad.\n\nThen, one afternoon, I passed by Lotta's, and the sun came out.\n\nAs the great Hal David might have written: \n\n\"If you see me walking down the street, \nAnd I start to cry, no lemon meringue pie,\nDon't walk on by.\nJust send me to Lotta's\"", "author": "Nick J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-15", "description": "I went looking for Bon Bon Patisserie the other day. I got lost, and ended up wandering around in the rain for a bit before finding it... to find it closed.\n\nSo I ended up in the Nob Hill area (I moved to San Francisco only a few months ago, so Nob Hill is the only area I'm relatively familiar with), knowing there were lots of European bakery's in there.\n\nAfter wandering around in the rain for another 2 hours, unable to find a good bakery with lots of sweets, I came across Lotta's. \n\nIt seemed so promising! The store was gorgeous, and the lady behind the counter was incredibly polite and friendly. I wasn't familiar with many of the Russian items, and she was more than happy to repeat the names and explain how they were cooked.\n\nOriginally, I just wanted to buy my friend a cupcake for her birthday.\n\nSo I purchased a chocolate cupcake with butter cream frosting and a red velvet cupcake with butter cream frosting.\n\nI went back home and ate the chocolate cupcake... AND IT WAS SO DISAPPOINTING. The frosting was too light and airy. It had a nice taste, though. The cake was mediocre.\n\nNot wanting to give my friend a blah present, I ate the red velvet one too. This was even worse than the chocolate cupcake. \n\nIt was just too average, too mediocre, and they were too small for their price.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-31", "description": "Adorable, cozy, and girly interior decorating.  Very friendly and nice asian lady working the register.\n\nI got 2 cookies - chocolate chip and mexican wedding.  Awesome pricing (55 cents per cookie) allows for you to try a couple of different flavors.\n\nThe cookies weren't stale, and the texture was fine/good, but that is all the compliments I can give them besides looking tasty.  The problem was that neither cookie dough actually had any flavor!  They both just tasted like shortening.  Def not worth the calories, and not enjoyable to eat :(\n\nI wonder if other dessert products in the shop are better?  The cupcakes didn't look appetizing, and the lady who worked there didn't have any recommendations, so for now, unless I hear of something specific that is great from here, not going back.", "author": "Ali G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-20", "description": "Look no further if you're on the hunt for some good old fashioned bread pudding. Lotta's gives you a dense, crusty topping followed by a creamy, custardy center. It's the kind of rich, hearty pudding I imagine an old world, European grandma serving.", "author": "Aiko S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "I love this place!  I was having a 1960's-food themed party and asked Earl if he could make any special desserts for it.  He said he'd do some research.  He called me the next day with about 6 different suggestions.  We went with the lime tartlets and the Pavlova.  They were a big hit!  Thanks, Earl.", "author": "J. D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-19", "description": "Their pecan pie will seduce you, empty your wallet, and leave you wanting more.\n\nAHHHHHHH YEAHHHHHHHHHHHHHHH\n\nAs newbies to the area, we asked the pastry chef which creations were his favorite. He answered, \"I only bake what I like to eat\".\n\nCORRECT ANSWER BABY.", "author": "Anh .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-03", "description": "What a cool little place!\n\nI was eating across the street and noticed the antiques sign and decided that I wanted to take a look.  Wasn't I surprised to find that there was a bakery in there as well!\n\nThey had an interesting assortment of antiques, with a definite food/small household items theme.  I ended up buying a reallycool liquor decantor that looks like an old school fire extinguisher.  The prices on everything looked very reasonable.\n\nAs for the bakery, they had a lot of enticing goods.  I was even impressed to see some desserts from other cultures on display as well.  I bought a bunch of cookies, as tey were only $.60 each.  The cookies were pretty good as well!", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-11", "description": "I like the selection of pies, cakes and cookies. I'm a pie man myself and their pies are excellent! The fruit is fresh and the crust is buttery and delicious. The owner and staff are nice and accommodating. \n\nThe selection of antiques is what I love. There is a pair of matching prints in the window with four inch stainless frames. Tastefully drawn naked women with bubbles. My girlfriend says I can't get them for the living room, \"but they're awesome\" I replied. \"I don't want naked blondes in my living room!\" Touche dear, touche.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-26", "description": "In a country where European desserts are mediocre, we are lucky to have Lotta's Bakery is a fantastic place to get both European as well as American favorites.\n\nIn a word:  QUALITY!\n\nThe guy at the counter is always friendly and helpful. The shop is clean, nicely organized (appealing to the senses) and best of all...everything I have eaten there is just fantastic.\n\nThe variety for such a small place is awesome!  It is NOT easy creating so many different baked goods and pastries, and all of them being of above-average quality. The use of seasonal fruit, and fine ingredients, comes thru in a huge way!!\n\nMy personal favorites:  coconut cream pie, bread pudding, quince tart, carrot cake", "author": "Ted K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-01", "description": "I discovered  Lotta's Bakery by accident 2 years ago when a visiting guest from NYC requested Key Lime Pie, her favorite dessert.  Earl made a wonderful and original Key Lime Pie . She said it was the best  Key Lime Pie she's ever tasted.\n     A few months later,  he made the same Key Lime Pie for over 100 homeless men  fed by my church group as part of a shelter program.   Last month, he made a rich, delicious, moist , ( all butter)  chocolate  sheet cake when we did dinner for the same homeless shelter program,  and ,also a variety of tasty cupcakes for the volunteers.  Everyone was delighted.   Both  years, he donated some of the costs for the two homeless shelter desserts,  and,  was quite generous in giving us a lot of extra servings.  Many people have asked me who made these desserts?  I'm always happy to give out his card.", "author": "Patricia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-11", "description": "I don't eat baked goods much so when I do, they'd better be good! I'd heard good things about Lotta's, so when my b/f and I were in the neighborhood over the weekend we stopped in.  Thankfully, we weren't disappointed. We split three items, pumpkin bread, a cream cheese stuffed brownie and some kind of savory scone. We gulped them down before we finished running the rest of our errands. Oink, oink!\n\nThey also sell antiques at Lotta's, which makes this place not only yummy, but funky cool!", "author": "Joan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-01", "description": "I am a constant customer at Lotta's Bakery because i own Satin Crystals just next door!\n\nI am not a big fan of sweets, but Earl and Richard are very nice and friendly neighbors.  They also have the cutest pink striped interior and exterior designs, and some cool collectibles.\n\nAs for the bakery, there are things I clearly like and those I don't.\n\nWhat I love:  the weekend Quiches, peanut butter chocolate cookies, Apricot brown butter pie, Apple crumb cake, German chocolate cake.\n\nWhat I did not like:  Apple pie, cherry pie, ginger molasses cake, sugar cookies, brownies.\n\nDespite the fussiness of my taste buds, I appreciate the fact that everything is fresh and made on the location.  There are many more things for me to try, and I am sure I will!", "author": "Lisa X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-21", "description": "I love Lotta's.  Everything I've tried there has been delicious.  Earl is very nice, and has met all of my special order requests (e.g., lots of icing on birthday cakes).  Prices are reasonable.  It's my (and my familly's) favorite bakery.\nAnd take a few minutes to look at the antiques.  A couple of years ago I bought a art deco, polished aluminum sailboat that's still prominently displayed in a home window.  \nDon't miss Lotta's!", "author": "Amy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "Whoever thought of selling Antiques with Baked goods? I don't know but whoever you are, you are awesome.\n\nLotta's Bakery is a quaint little bakery that has many faces to it. It's located off of Polk street so it's best if you park at one of the garages and walk down. Keep in mind that this place has a lot of bums lingering around its door steps and you WILL be asked if you are giving away your baked goods when walking out.\n\nWhat do they specialize in? They sell antiques and household items along with an assortment of baked goods. An unlikely combination but the owner told me that he wanted to marry his two passions; \"baking and old stuff\"=) One of the BEST baked items they have are the Cheesecake brownie bars. Umm, can I say orgasmic? The Cheesecake brownie bars go for about $2.50 a pop but they are totally worth it. You can smell and taste the real cocoa powder that goes into it. One bite, and all you can say is mmmmmmmmm. The top layer is made of cheesecake and the bottom is brownie. There's a middle fudge layer which just makes both parts melt in your mouth. The after taste makes you want more. You HAVE to try them. Overall there prices are a little high for baked goods but I'd say its worth it. It's a mom and pop so I'd feed my money to them any day over the mass corporations.\n\nOther than their Cheesecake/Brownie Bar star, I'd say that the scones are good. The almond and coconut cookies are not that great and there isn't a wide selection as in most other bakeries. They do sell loaves of bread which is nice since some of them are made with 100% whole wheat flour. It's really hard to make something healthy tasty and I think they do a good job with this. They also \"theme\" their baked goods depending on what's going on in the world. When it was William and Kate's Royal Wedding, they offered scones, biscuits, and tea. Very fitting for a king and queen =)\n\nAs for their antiques, nothing remarkable. They have some cute stuff but it's not the main attraction. You can find some cute stuff like an old style piggy bank. It was definitely fun to pass some time.\n\nShould you try it? Yes, its definitely an experience. Correction. It's definitely a San Franciscan Experience since SF is known for its mix of different things!", "author": "Lakshmi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-18", "description": "This is where I go for my evening coffee and a peanut butter cup. The coffee cake is pretty good too.\n\nThe owners are super friendly and there are small items / antiques you can see at the back too.\n\nAwesome place, friendly owners, wonderful treats... what else can you ask for?", "author": "Sumit C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "So I'm walking around in the area trying to buy cinnamon-sugar.  I walk into the bakery and the gentleman offered my a cupful on the house!  I ended up buying a few baked goods afterwards - those were great too.  Would highly recommend!", "author": "Josh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-26", "description": "If you're not feeling like baked goods, stop in just for the antiques in the back. Practically everything is under $50, and most items are under $40, so visit if you like doo-dads like beautiful hand-painted Japanese hatpin holders and nautical clocks.\n\nI stopped in Lotta's for the first time today, coming directly from Town School Clothes Closet. It's hilarious that even when TSCC has one of their \"whole store is 50%\" sales, their fake antique vases and five year-old Nordstrom shoes are ridiculously overpriced.", "author": "Jena E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-24", "description": "I would rate with just 1 star but since I've only tasted one cupcake from Lotta's, I'll go with 2 stars (in case other stuff Lotta's is better).\n\nRed Velvet cupcakes are my favorite.  My co-worker says that she's going to walk to Lotta's after lunch and buy herself a dessert because she loves their cakes.  So, I ask her to bring me back to red velvet cupcake.  Yuck.  The cake was so dense (should be fluffy and moist?) and stale.  The frosting was heavy and definitely days old stale.  So many places make such good cupcakes, how can they keep this inedible thing on the menu?", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-11", "description": "How great, an antique store and a bakery all in one!!\n\nThe owner is even starting baking classes at the beginning of the year.\n\nI just had a lemon meringue tart and it was delicious!\nThere were too many great desserts to choose from so I just had to get the apple strudel too.  \n\nNext time, I'll come back for cupcakes. Or will it be coffee cake?  Maybe both!", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-17", "description": "This place is adorable and the baked good are amazing!\n\nTry the cream cheese brownie...1 layer of chocolate, followed by a layer of brownie, then the cream cheese, and another brownie layer. YUM!", "author": "Misha F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-08", "description": "Lemon Meringue Tarts are delicious; I was only planning on eating half of it, but I couldn't stop, it was THAT good...I easily finished the whole thing.\n\nThe lemon was not too tart, the meringue on top was delicious and tasted like marshmallow fluff, overall delicious dessert! (also try freezing them, they taste good cold)", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "Okay I can't comment on their food but their antiques were great.  The shop owner was working the front and just as friendly as they get.  Never bothered me as I looked around and when I made contact with him was willing to explain everything and anything in the store.  A real joy.  Just a great place to pass some time looking at \"fun\" antiques.", "author": "Frank E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-22", "description": "*Get the almond macaroon!!  It's incredible!*\n\nI stopped in on a whim to try their treats.  There were so many completely different options (cakes, cookies, cupcakes, bread pudding, other uncategorizable things...) I had no idea what to go for.  \n\nSo I picked up an almond macaroon just because it was one of the cheapest things in there (.80).  This is the best move I've ever made.  I'm not one to say food is orgasmic, but I stopped dead in my tracks and developed an instant case of Tourette's at my first bite, which for me is pretty close.  This cookie reminds me strongly of the famous Siena ricciarellis - I will definitely be back for more!", "author": "Alison M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-06", "description": "Delicious!  I love going to Lotta's to get desserts for parties - cakes, pies, cookies, you name it.  Everyone always raves about the food and asks where I got it.  So of course it was an easy decision to have Earl bake our wedding cakes.  He made a series of small cakes fashioned after a Thiebaud painting.  Each one was a different flavor and our guests loved them all.   The price for the cakes and delivery was very reasonable compared to other places I looked into.  Earl also let me borrow some adorable cake plates, helping me save money.  Wish I had some cake right now!", "author": "Suzy K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-17", "description": "It's plenty pink, super satiny and about to open any day now. Promising old-fashioned goodness  baked into cookies, cakes and savory samplings. We shall see...real review to follow as soon as the doors open and I do the snacky snack.\n\n.............................................................................................................................\n\nReview: Question - Where can you pay $3 for a dried-out leaden mess of a cupcake so bad you will throw it out after two bites? Answer - Lotta's Bakery. Sad, so sad. It's an earnest little place, with a nice guy working the counter but DAMN that was seriously the WORST cupcake I have ever had. It was so dense and dry I thought it was a frosted rock. Lotta's, I'm sorry, but we are through. It was short, but never sweet.", "author": "wendella a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-10", "description": "To start, a little background...\n\nI was talking with my mom on the phone a few days back when she went off on this tangent about how her and my dad ate all these delicious pies, blah blah blah... well, when you're a susceptible sweet tooth, we all know how that story turns out....\n\nSo there I was, craving pie... not just any, but specifically Strawberry Rhubarb.  After Yelping the city for delicious pies, I stumbled across Lotta's Bakery and it's pretty decent reviews (not to mention it's about 4 blocks away).  I walked down to the store, and there it was, taunting me with glimmering sweet baked goods.\n\nI walked into the shop and was greeted warmly, asked about the assortment of pies (mini lemon meringue pies, apple pies, etc).  Finally, we came to my craving, Strawberry Rhubarb.  The sweet lady went in the back to check and came back with one last Strawberry Rhubarb pie and was followed by Earl, the owner/baker.  I interrogated Earl about his pies and their deliciousness, then chose to purchase the whole pie for $18 (vs $3.50/slice).\n\nI walked home promptly, cut out a slice, sat down, and placed a full fork into my mouth.  An orgasm of  deliciousness exploded in my mouth.  My tongue danced and my taste buds tangoed.  I called Earl and thanked him for an amazing pie.\n\nSo yes, I highly recommend Lotta's Bakery.  Go there, buy a pie, tell Earl \"thank you\", and enjoy a slice or two from Heaven.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-01", "description": "I randomly walked by Lotta's Bakery the other day and what a darling establishment.  I love the idea of a bakery and antique shop in one.  In NYC there is an antique and cheese shop together.  I use to purchase my pre-party appetizers along with the best bookshelf ever from Maya's in NYC.  \n\nNow I am in SF and there is a similar shop.  From Lotta's I have purchased a beautiful pitcher that I'm using as my wine decanter and I have a fabulous lamp which I just picked up that was on hold.  The lamp is AMAZING.  The shade is made out of bone and heavy, but gorgeous.  What an amazing find and so affordable I couldn't believe it!\n\nI have yet to try the sweets, but looking forward to doing so when I pick my lamp up.  \n\n**An update - I tried the chocolate chip cookies when I picked up my outstanding lamp and the cookies are delicious.  I strongly recommend having at least one sweet treat and searching the antiques b/c you will find something you love - how could you not?**\n\nThe owners of the store are just as sweet as the treats!", "author": "Anjali K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-30", "description": "Very good foccacia, fruit gallette, and italian breads.  Good addition to the neighborhood.\n\nNever had the cookies or brownies -- but there's more to a bakery than just the sweets.", "author": "M.S. C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-22", "description": "I soooo wanted to like this place.  I love baked goodies and it would have been nice to have a place near by instead of having to head over to That Takes the Cake every time (which I love!)  But this place has the audacity to charge $3 for a nasty, sand dried cupcake.  I can't cook but could have made an 1000% better tasting one with Betty Crocker.\n\nThe other positive reviews here must be from friends of the owner because there was nothing tasty about the baked goods here.", "author": "Lev E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-22", "description": "What a great idea to have an antique shop and bakery in the same place! Although I'm not really into antiques, it was still nice to look through them before sitting down to some coffee and baked goods. \nSitting there on a Sunday morning, eating some bread pudding, drinking coffee, and listening to KFOG piped in made me feel like I was at my grammy's.\n\nThey had a great array of baked goods but I wished they had a little more variety in coffee. Try the bread pudding and strawberry coffee cake!", "author": "Lale G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "chicken pot pie! the bomb, place is dope", "author": "Amy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-10", "description": "Cheese and onion scones YUM! Love Love this place and the guys are so nice. Plus they have old school cameras to buy. This place is the whole package.", "author": "Mex B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-06", "description": "Tried the challah.  It was great, service was great.  Adorable shop.  Go here.", "author": "Sharon G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-09", "description": "Honestly, I wasn't expecting much.  The cake in the window isn't all that impressive looking.*  Actually, I didn't go in for the longest time for that reason.  So- note to whomever does the window display- step up your game a bit maybe.  Despite the less than inspiring window, I spontaneously decided to stop in and buy a dozen cookies on the way to a friend's house one day.  They are exceptional cookies, and I've been back for more.  The other baked goods look amazing, and the people who work there are super nice.  Way better than that cookie on a stick place that was here before. \n\n* To be fair, I watch a lot of Food Network, and so maybe am expecting too much Duff-ness out of my neighborhood bakery.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-22", "description": "My second favourite after Bob's doughnuts :))\n\nYou can satisfy your hunger and sugar cravings buying things from different categories there.\n\n2 thumbs up for quality and variety! \npastries kick ass!", "author": "Cat of a Donut J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-13", "description": "I chanced upon this super cute and sweet place and it drawn me in.  They make everything from scratch in the back.  From breads to muffins, cakes, cookies, pies and various other pastries.  My friends and I sampled a bunch of different things and everything was done right.  Not too sweet, moist and oh so good.\n\nAside from the goodies that you can buy ... the store itself is just so cute that it should probably have been made of sugar.\n\nLove it!", "author": "Winnie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-12", "description": "Wonderful neighborhood bakery that I found unexpectedly one day.  The owner is friendly and a true artist - his work is as beautiful as it is tasty.\n\nAt Christmastime, try the Bouche Noel (yule log cake).  I can't even imagine how much work must go into this amazing creation but it is well worth it.  Chocolate frosted cake shaped to look like a log with little frosted mushrooms and amazing and delicious details.  I actually took a picture of it.  It was that fabulous.  It makes a great treat to take to a Christmastime dinner or party.", "author": "Camilla R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-30", "description": "We had Earl do our wedding cake earlier this month.  As we had a small wedding, it was hard finding someone who would do a cake for 15 people.  But, Earl was very accommodating, and we ended up getting a small two-tiered cake (one tier chocolate and one red velvet), covered in fondant.\n\nThe cake was beautiful -- I had sent Earl a photo of what I wanted (basic white fondant with a fondant ribbon and bow at the base of each tier) and he nailed it.  And, it was amazingly moist and delicious -- everyone commented on how tasty it was.  So tasty in fact, that we just got back from our honeymoon yesterday, and had a slice and it was STILL good.  Even the fondant tasted good, which I had no idea it could taste like anything other than crispy cardboard.\n\nEarl delivered the cake on time, helped with set up and even let us borrow a cake stand.  We're so happy we went with Lotta's!", "author": "K. H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-12", "description": "I completely agree with everyone who says that this place is fantastic and that Earl is the nicest guy and has a real midas touch. I especially like his chocolate dipped macaroons. Something else that is great is that he doesn't use too much sugar so things really have flavor, rather than just too much sweetness. The next time I go I want to try his carrot cake.\n\nBTW - it's true, his black strap molasses cake is yum!!!", "author": "sarah k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-13", "description": "This place is lovely, the folks who work here are great and the food is delish! I went in for a birthday cake for my woman, and needed just an itty bitty cake as it was just the two of us, I ended up getting a mini chocolate cake.  We ended up calling it the chocolate cake bomb, and it was. Utterly utterly bomb. Such a good cake. We couldn't even finish it, and lord knows, we tried.", "author": "RJ M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-03", "description": "I liked the cheescake too! It was a great texture, not too sweet. Its a nice alternative to doing the hill to whole foods for a sugary cake.  I've ordered a few of these and the response is great. \n\nThey have different fresh baked breads on different days. \n\nThe owner was nice enough to come out and show me the different sized pans because I needed a visual to order my cakes.  The staff is friendly and helpful.", "author": "Cheryl D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-30", "description": "What a great place to stumble upon in the 'hood.  Had a slice of the black strap molasses ginger cake - excellent!  A couple of biscotti - nicely fruity and not too sweet.  Gorgeous antique tea cups and saucers which I may treat myself to one of these days...", "author": "Ash A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-10", "description": "It's funny how much attention a cupcake can get.\n\nI bought a vanilla cupcake at Lotta's and continued on my merry way up Polk. At my next stop, the gentleman behind the counter said I had very good taste (he apparently LOVES their pastries). Oh the pride, the joy, when sweet-tooth instincts are validated! \n\nMy dry cleaner thought it very prettily decorated and demanded an address, because a pretty cupcake is apparently very hard to find!\n\n\"How was the cupcake?\" you might ask. Well, the butter cream was quite possibly the best sugary concoction I've ever had the pleasure of tasting. However, while I'm no connoisseur, the cake part did seem much too solid for something that you might think would be light and airy. \n\nDid this minor setback keep me away? Why no. \n\nBecause on my next visit, I picked up some hot-out-of-the-oven cherry and apricot pie which truly was a thrill to eat. The bear claw was super good, too. They do seem to have good variety for a bakery that's been open for so short a time.\n\nMoral of the story: well worth a visit if you enjoy pastries and desserts with substance. If you're easily tempted by just any pretty cupcake, you might be a little disappointed. But try, try again, because Lotta's is definitely worth it!", "author": "Julia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-07", "description": "Lotta's is great: we used them to make our wedding cakes.  So... a few words on our wedding - very non-traditional, non-ordinary with a very small, close-knit group of family and friends attending.  The wedding cakes were: Black Forest cake, Charlotte Malakoff cake, and a lemon cheesecake.  Yes, three cakes, but again, very non-traditional.  We placed our order with the owner/baker ( I never got his name).  He didn't seem fazed by the fact that we wanted very specific cakes - he even knew what a Malakoff was (many of the other bakers didn't know what it was).  Since it was over 1 month before the wedding date, we planned on picking up the cakes the morning of the ceremony.  I called the day before to confirm and make sure our order wasn't forgotten, and the nice girl who works the phones and the front counter was very casually said, \"the order was being prepared and should be ready tomorrow morning.\"  So, I was pleasantly surprised they were on top of things.  The next morning wasn't a problem picking up the cakes, and when she showed us the cakes, I almost had to eat the Malakoff there... ummm, let me describe what a Malakoff is for those of you who have never had it.... the Malakoff is basically a liqueur-soaked ladyfinger cake, with rum-flavored creme.  And yes, it really was good; it was cut and devoured later that night... and then the next night we ate the crumbs.  The best cake crumbs I ever had.\n\nThanks to the baker-who-I-didn't-get-his-name - your cakes really made our wedding reception special.  Thanks!", "author": "B Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-23", "description": "Stopped in last week for some finger foods, and was impressed.  Goood food, nice folks.\n\nOrdered a birthday cake from them.  Asked for something very chocolaty, and they recommended a silk cake.  Ordered one and presented it last night at a friend's party.  Definitely chocolaty!  Had us jittering from the richness.  Awesome.", "author": "Peter D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-26", "description": "Earl, the baker, is great.  He made a birthday cake for my son who just started school in SF.  After talking with him about the possibilities, I decided on the Blum's Coffee Candy Crunch, and he specially replaced the whipped cream frosting with a vegan frosting since my son is allergic to milk and cream.  They delivered at the time I requested (nominal charge) on a Sunday (his birthday).  My son shared it with his roommates and said the cake was really good.", "author": "R.A. S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-17", "description": "This is Miss Piggy checking in again, \n\n   Lotta's was introduced to me by my lovely friend SB who lives in Nob Hill. Since she moved there, I think I've frequented this place everytime I hit the gym and decided that I'm going to come by her place. \n\n  This place is so cute and it's just nothing fancy, but really good! I think what really gets me is the man who runs this place has got those logos of a man who's a cross-dressing in heels. What a symbpl of San Francisco! Not to say, the pastries were delicious.. get some of their cookies and that little cheesecake, perfect for a small group of 4-5 and it's only 10-12 bucks I think. \n\n   You're going to really like Lotta's because it's really cute, and if you live in that neighborhood, you should definitely try it! \n\n For a time, I worked out on Vanness and Polk and would walk up to Sacramento and Polk to gain back all those calories I burnt off.  Now I say, you go try it.", "author": "Miss Pigg y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-24", "description": "Fantastic bakery.   Love the carrot cake.", "author": "Jeanne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-02", "description": "After hearing a coworker rave about Lotta's cookies, I decided to get my birthday cake from there. So my 5 stars is based on only one visit.  \n\nI went in assuming I could pre-order a cake but that wasn't even necessary because they had exactly what I wanted (made that morning apparently) sitting in the case.  It was a chocolate cake with chocolate butter cream frosting.  It looked small (maybe about a 9\" double decker round cake) but she assured me it was rich enough to last a while.  The sales person was very timid but very courteous.  The baker (Lotta?) came out from the back to tell us about storing the cake. Awesome! Very useful info about not refrigerating the cake if we were going to eat it that night.  They put my name on it in 5 minutes and I was in and out in 15 min.\n\nSo the cake was great and delicious but the frosting was hands down the best frosting I've ever had: not too sweet, rich, CREAMY, and velvety.  I couldn't stop eating it.  Actually, I think I ate all of it.  \n\nIf you want to indulge (calories not money) and love baked goods, try Lotta's.\n\nP.S. I think the cake was about $40 but it was a treat from my mom so I'm not too sure", "author": "Jennie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-28", "description": "UPDATE (9/11/07):  I'm adding one star b/c I requested a Coffee Crunch cake for my bf's party.  It currently wasn't on the list of available cakes.  (I knew to order b/c I had seen it months before in their display)  The lovely owner made it for me anyways (w/ 24 hours notice).  It was INSANELY good!  Rave reviews all around!  \n\n\nSome of the BEST cheesecake I've ever had!  I've now purchased 2 cheesecakes from this bakery for 2 different b-day dinners.  And they were a hit both times.  \n\nTheir service is very friendly!  And with enough advance notice, they will make you whatever you'd like.  \n\nMinus one star for their cupcakes.  Very disappointing.", "author": "Amanda U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-28", "description": "i'm not sure what to make of this place. i walked in and saw the cases that looked like they might house baked goods but those sights fought with sights of countless old things with tags. some might consider it charming to have a hybrid antique(?) store/bakery. i find it odd. \n\nand just as i've mentioned on an different bakery review, this baker also stares and you and asks what you want the second you approach the counter. \"HOW SHOULD I KNOW?? i just friggin got here!!!\" runs through my head. \n\nanyway, i got a cheesecake brownie which was more cheesecake than it was brownie. and the two brownie layers were really thin and almost crispy rather than chewy or fudgy. it was tasty nonetheless.\n\n***be careful for meter maids. all my life i thought that you could park in  yellow zones for atleast 15 minutes as long as you put money in the meter.  i guess i stand corrected.  i literally was in a yellow zone for 3 minutes and got a $75 ticket. that is one damn expensive brownie.", "author": "Regina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-09", "description": "I love finding special vintage pieces...at the flea market, on line, and garage sales but ever since I found Lotta's it is my go to place. Picture a 1950's console on a marble platform with a fake fireplace on the bottom  that lights up when you plug it in, a working radio, and a bar on top with red curtains...Don Draper would be in heaven-and it was only $400! After I bought it the owner said 10 people wanted to buy it and I believe it...someone tried to buy it when i went in to pick it up. There is a great bakery in front and tons of vintage finds in back...I bought a gorgeous art deco mirror-another steal-and a 1920's fashion illustration. Prices are great, the people are nice, and it's so fun to poke around the treasures.", "author": "ruth c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-25", "description": "I dare you to try walking past this place without going in to try at least 1 baked good!  Pumpkin bread was fresh out of the oven this morning, and completely delicious.  The gentleman who rang up my order was delightful.  Great spot!", "author": "Breah P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-07", "description": "Lotta's is a real neighborhood bakery. I sat there and enjoyed a piece of extremely rich (gooey and expen$ive) carrot cake with an OK cup of pre-brewed coffee and listened as neighborhood residents came in to peruse and order pastries.", "author": "stephanie l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-30", "description": "Best apricot pie I have ever had.  Looks like an antique shop from the outside...don't let that fool you, these folks know what they are doing.", "author": "Randy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-17", "description": "OK god the bread pudding is like heaven. Try something you like and you will be happy. I was and will be next time!!!!!", "author": "Brandi R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-26", "description": "Super cute and friendly but I need good product as well. Cookies are great but the cinnamon rolls are dry and bread pudding is basically just bread.", "author": "David C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-04", "description": "Their cookies taste like shortening mixed with water and flour.  I have never had worse cookies.", "author": "Emma Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-22", "description": "I followed the advice and didn't get any cupcakes. I got some bread pudding, a few cookies, and a piece of apple strudel. The place is nice but the bakery area seems like a pretty small portion of it, and the employee who helped me was quite friendly. I brought all of this to a brunch, along with some delicious donuts from Bob's donuts. The donuts were demolished pretty quickly, and people eventually moved on to the items from Lotta's. The apple strudel was honestly not good, and I would not recommend it - there was a nice amount of walnuts, but they were in huge pieces and not very tasty. The strudel itself may have just been undercooked, but it tasted floury and fairly leaden. The bread pudding wasn't very interesting either - kind of dry, and the bread was overly sweet (it paled in comparison to the bread pudding from bob's!). The cookies were better - the peanut butter was actually pretty good, and the mexican wedding cookie was fine - but neither was outstanding. The chocolate chip was mediocre - I think I can make better and I'm not the world's best baker. So, as much as I love bakeries, I won't be back to this one.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-11", "description": "Great regular cakes, pies, molasses cake, bread pudding (the best!), etc -no fine dining bakery - instead, you'll find delicious, hearty baked goods - we like to order pies and cakes for the holidays too", "author": "R F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-14", "description": "Cute place but I can't say the baked goods are that great.  The owner isn't friendly at all.  I would much rather buy my baked goods at Schubert's, Yasukochi's Sweet Stop or La Boulange.", "author": "Flog G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-06", "description": "The owner is the most adorably sweet man. The apple pie is amazing as was the lemon meringue tart. The peanut butter cookies are wonderful and the chocolate torte is fudgy and rich- perfect for a chocolate obsessed lass like myself. I cannot wait to place an order for the Coffee Crunch Cake-  I may need to throw myself a dinner party just so I have an excuse to order it.", "author": "Noelle Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-09", "description": "OH GOD, You must try the Blum's Coffee Crunch Cake, As good as I remember the Original maybe better.", "author": "Ed A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-06", "description": "They get five stars because they make great cakes and cupcakes.  My wife would rave about her favorite birthday cake growing up, so I described it to Lotta's and they made me one.  It was a hit.  I went back for the same cake this December.  Also, I love their cupcakes, but most importantly, my children love them.  I'll be back for my usual cake this December, and look forward to being in the area to pick up a sweet when I'm in the area.  Great place!", "author": "Axs S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-24", "description": "I've got a whole lotta love for Lotta's.  I've only tried the honey cake and the blueberry yogurt cake, both of which were totally scrumptious and yet unassuming (no need to do all this fanfare with icing or layers).  These cakes are perfect with tea and the store has a cozy mellow vibe.  I can't wait to go back for more!", "author": "Janut B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-30", "description": "It's fun to go into a real bakery instead of getting baked goods at the coffee shop.  Lotta's is cute and the service is amicable.  I ordered up a whole pie for company and walked out with a mini cake to go with it.  The pie was a real gem - the filling was nice and sweet, but it totally let the fruit shine - chunky peaches.  Thanks, Lotta's.", "author": "T-Bone L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-23", "description": "I would go back to San Francisco just to get a cookie from this place. I was touring the neighborhood since I was staying at the Opal on Van Ness.  I had a sweet tooth, so I figured I'd get a little something to take back to the room.  I got one peanut butter and one oatmeal raisin cookie.  When I got back to the room and dug into the cookies, I wished that I had gotten more.  I wanted to run back to the bakery and  see \"the cookie man.\"  Alas, that was to be my only taste of Lotta's Bakery.  I found them on a Sunday.  They're closed on Mondays and my plane left early Tuesday morning.  I still dream about those cookies!", "author": "Saundra L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-16", "description": "I designed some cookies with Earl the owner for my work and the sugar cookies came out very cute as well as very yummy.  Earl has been very accommodating when it comes to what I need in terms of order size and pick up times.  \n\nI always end up picking up some pie and the Strawberry Rhubarb is probably my favorite.  \n\nI've had two types of cake from here- Red Velvet Cake and the other was a Chocolate Espresso Mousse cake (?) and I've been very happy both times.  They were both ordered for special occasion and they definitely impressed the crowds.  \n\nThe only thing I wish they had were single pieces of Princess cake to go.", "author": "cynthia l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-17", "description": "I just discovered this place today. It's clean, inviting, the employee I dealt with was very friendly, and they make a moist, tongue-tingling black strap molasses gingerbread that puts that wimpy light brown gingerbread to shame.", "author": "Katrina J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-15", "description": "Ordered a cake for my fiance's 6-year old daughter this past weekend.  She wanted it to look like a princess.  Earl did a fabulous job on 2 days notice and the cake turned out even more beautiful that I expected.  It was a white cake with fresh strawberries and buttercream and was super yummy!   All the little girls at the birthday party were entranced with the cake and all the moms were asking us where we picked up the cake!  Thank you Earl!", "author": "Bonny Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-29", "description": "You simply can't go wrong at Lotta's Bakery. The chef and owner, Earl, has the Midas touch when it comes to baking, and everything I have tasted from Lotta's has been pure gold. And it's so nice to have a really great bakery in the neighborhood. From amazing breads to special occasion cakes to that afternoon pick-me-up cookie, you gotta go to Lotta's!", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-15", "description": "Lotta has the best sweet things in town. My husband and I always stop by after our Saturday workout to get our rewards... I guess you could say the only reason we get up early for a 2 hours workout is so we can then go to Lotta's Bakery.\n\nWe love their bread pudding (made partially with cinamon rolls), coffe cakes with seasonal fruits, apple pie (and all sort of seasonal pies), quiches, and the tres leche cake.... Oh, the tres leches cake.... It's to die for. Their cakes are very good too.\n\nYou certainly have to give Lotta a try.", "author": "sf g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-29", "description": "I use his service for my wedding cake (sept 5, 2009), its good impression first of all and i ask my detail for my wedding cake and end up he can do it and i dont care bout the price. And so dissapointed when i see my wedding cake its not exatcly the same what he explain to me(specailly bout the detail) and one of my detail is put a california map and virginia map, which he promises with orange color but it didn't happen. so dissapointed. but i admit the taste of the cake is good, i got compliment from my guest.", "author": "christine s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-20", "description": "Everything I have tried here has been excellent. There is an intensity of flavor in whatever they do that is difficult to match ... but certainly easy to enjoy. This is a special little place - and the blackstrap molasses gingerbread is worthy of a crosstown trip all on its own.", "author": "Steve R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-24", "description": "I was looking specifically for a German chocolate cake for my boss's birthday, and it took me a while to find a place that looked like it had a good one and this was it.  And it turned out that the cake was amazing.  Huge hit with everyone at work.", "author": "John P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-30", "description": "No, thanks I don't like macaroons, no really I'm just not a macaroon eater I guess, no I don't want a bite, frankly I  hate macaroons. Okay, just a bite, I'm not eating the whole wretched thing..wow, that's good, that's really good...give me the rest, no, I don't care what I said this isn't really a macaroon, this something good, really,really good...you got another one in that box. These should be called something different, calling them macaroons is just going to put people off, these things are awesome (and I don''t use that word, I'm just trying to find some acceptable substitute for fuckin' fabulous, oh I don't use that word either) You go GEarl !!!", "author": "James T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-30", "description": "I love this place!!! Besides doing a wonderful job on my wedding cake 2 years ago, this is my go to bakery for all my events. They just did my birthday cake and it tasted like heaven! Everyone loved it. Also all there baked goods are amazing. Everything I have bought for parties, thanksgiving and chanukah's have been a big hit. The owner is super nice and can make whatever you ask of him. This place is a gem!", "author": "jessica n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-06", "description": "San Francisco finally has a really good bakery. Most bakeries are  good to very good. Lotta's bakery is just plain fantastic and we are so happy they are here. After retiring in 2000 I worked in the bakery industry as a cake decorator for 5 years and pastry chef for 2  and know what a good baker is all about. Earl, the owner, is a fantastic pastry chef and baker that has that \"it\" factor.   My most recent purchase was a pear pie and a big slice of bread pudding. OH MY GOD!!!  Thanks Earl!  see ya next time.", "author": "paul c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-20", "description": "Meandering around Polk Street this past weekend - wondering where we might get something to please our sweet tooth.  What a shock that a BAKERY sign would catch our attention.  We took a peek in through the window, were reading a posted newspaper review and noticing that they guy in the photo looked suspiciously like the man sitting on the other side of the window...\n\nA minute later we were beckoned in by his friend.  Who are we to refuse?  We say to each other that we'll just take a peek.  \n\nThe goods looked amazing!  All kinds of cookies and pastries - and even perfect looking hamantashen - the triangular shaped pastry typically made around Purim.  There are cupcakes and macaroons and brownies and bars - all just calling out to us.  \n\nAnd you know something else...the prices are unbelievable!  When was the last time you saw ANYTHING in a bakery under $2? We decided to exert some restraint and limited ourselves to one very  delicious (and amply sized) 7 layer bar for $1.80!   It seemed like all the cookies were priced under 2 bucks.  Now I'm wishing we would've gotten more.  So much better than the strawberry galette we got from Mission Pie the night before (although I will say the crust of that galette was yummy).\n\nVery friendly staff - always a plus. We will definitely be back to try a lotta Lotta's goodies!  (And we'll likely give Mission Pie a 2nd chance as well).", "author": "L F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-15", "description": "Just a reminder about Lotta's Bakery.  They are accepting orders for Christmas.  They have gingerbread houses and bouche de noel (christmas log).  Lotta also makes, by special order, Blum's famous coffee crunch cake.  Try it", "author": "Marie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-24", "description": "This bakery is chock full of yummy things! It is impossible to leave without a big bag!  Do NOT miss the chocolate bottom macaroons and the almond macaroons! They are THE best I have had anywhere!  It's worth a drive across town!", "author": "k k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-13", "description": "I had a great experience - I wanted to order a \"special\" (not on the menu) cake.  I was able to order over the phone and my cake was perfect.  Really, it was beyond perfect.  It was the best cake I've had in a long, long time.  The marzipan \"frosting\" was amazing and the cake looked fantastic.  It is nice that we have these little non-chain places in San Francisco.  Better service, better taste.", "author": "cj f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-12", "description": "My husband and I hired Lotta's Bakery to do our wedding cake.  We were looking for a cake that was simple and a price to reflect that! We got that from Lotta's Bakery and Earl, who gave us the exact cake we wanted and a great price.  The tasting was great...we tried three flavors and went for the rich chocolate. Earl was very easy to contact, which is very important when choosing a vendor. Overall, we were very happy with our wedding cake and got compliments from our guests.  I have not yet visited Lotta's Bakery for any of their other pastries, which is why I cannot give it 5 stars. But from my experience with them, I would say that yes, I am a fan!", "author": "Vanessa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-16", "description": "The macaroons here are sooo good. It's a little pricey, but it's worth it.", "author": "K M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-07", "description": "I've been here a couple times and I've got to say that the pastries are amazing. The double chocolate chip and peanut butter cookies was so good. The scones was just heavenly and their banana bread is moist. The one thing I didn't like was their apple pie but that's because they use a mixture of apples (or it seemed like) so the apples were more sour than sweet, but some people like that and I'm not going to count that against them. The staff was very friendly and I can definitely see myself coming here again.", "author": "Richard C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-20", "description": "This is a great addition to the neighborhood. A friend served Lotta's cheesecake at Christmas dinner, and a couple of weeks later I was still craving one for home. So I picked up a mini version last week and it was as light, lemony and delicious as I remembered. The owner is a lovely man who makes his customers feel welcome and appreciated. I think the cream cheese brownie will be my next selection, based on reviews. Yum!", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-08", "description": "I love, love, love this bakery.  I was attracted to it by the vintage look with the cheerful pink and yellow stripes walls.  I tried the lemon meringue tart and thought I had died and gone to heaven.  I have since tried the pumpkin pie, apple pie, cookies, banana bread, and linzer torte.  Everything I have eaten there is to die for in desert dining.  The owner is so warm and friendly as are the staff.  I go out of my neighborhood to go there now several times a week.  You can not go wrong by any of their goodies & you will leave there happier than when you came in.", "author": "Johanna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-19", "description": "Walked by Lotta's after dinner with the bf and a couple of friends recently.   Twas a bummer they were closed or else I would've definitely paid a visit.  Went back the next day during business hours.  The bakery is small but very interesting.  As other fellow yelpers wrote it's a bakery and antique shop.  I'm not too much into antiques so didnt look around.  Besides, for me, antiques would lose to sweets anyday!  I wanted to try everything, but decided on a lemon meringue pie, a powdered cookie (I think they're called mexican cookies?), a chocolate peanut butter cup, and a chocolate macaroon.  The lemon meringue is by far the best I've had!  Seriously if you love lemon meringue you must try one at Lotta's.  You can tell after the first bite that only quality ingredients are used.  The macaroon was crispy on the outside and chewy in the inside.  My boyfriend who is not a huge fan of sweets also enjoyed the lemon meringue.  Everything we got were very good but the lemon meringue was exceptional!  Can't wait to go back and try other goodies.", "author": "Amy T."}
