{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "First time at any wax museum. Holy heck, this was a blast. \nWe attended for my daughters birthday earlier this month. Not too crowded, and tons to see. \nAll of the figures were nicely done, some better than others but you knew right away who each one was. \nClean, and well cared for. We were not rushed through and we did take our time. \nBring your camera, they'll also take photos of you and your group before you start. Super fun!", "author": "Dee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "Madame Tussaud's is located on the south side of Jefferson between Taylor and Mason not far from the turn around for the Mason street  cable car which is actually on Taylor.  Yes where there's tourist areas like Fisherman's Wharf, Hollywood Boulevard or 42nd Street these wax museums are there.  The thing is I don't find these things cheesy at all in fact I find them quite fun.\n\nI haven't been to Madame Tussaud's since LA and that was quite a few years back.  Of course between that time there's more exhibits and newer ones that make their way around the various museums I can only assume.  The San Fran version has some that you'd find to be more native to the area being that it's the bay area.  For instance at the entrance they have Mr. Facebook himself Mark Zuckerburg and you also have some locals like Harvey Milk or Steve Jobs as well.  Steve McQueen and Bullitt are all San Francisco as well.\n\nWhile the walk up price for an adult is 20 dollars, checking in with Yelp at the time gave you 5 dollars off but it's too bad I didn't notice until after I had paid.  There's various props at some of the exhibits such as if you wanted to pose with Jimi Hendrix and have a guitar or wear a NY Yankees cap beside Babe Ruth.  \n\nI was alone so I couldn't really take photos of myself with the exhibits at least ones that wouldn't be selfie distance.  There's enough exhibits for it to be worth the while, especially if you're with somebody and you have the time to take photos.  If the place is busier of course you may have to wait to take shots of the exhibits alone but being alone also gave me the chance to take all the photos I wanted without having to wait for others to be done.  \n\nThere are a few of the exhibits where the faces didn't really look as close to the real individuals as they could be.  Jennifer Aniston and Kate Winslet looked a bit off while Tiger Woods, Peter Dinklage and Leonardo DiCaprio looked really well done.  \n\nFrom my last visit in LA I learned that taking photos from their line sight (as if they're looking into the camera) make it appear more lifelike.  Sometimes the lighting will give off too much reflection because well the figures will appear \"shiny\".  Taylor Swifts legs were shiny as was Al Capone's forehead.  There's also moving light indoors for some so maybe you'll have to time your shots of Tupac when the blue spotlight is not on him.\n\nOverall I liked the experience and it was fun even though I was just in for a short time but I stopped at each exhibit.", "author": "Lambert P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-07", "description": "The ticket costs from 15 dollars. \nThe exhibits change every 2-3 months, some figures can be seen that they are made long ago. Stars already do not look like 5-10 years old.\nThere is a hall with Hollywood stars, famous leading TV shows, politicians and Beatles!\nIt was fun, I really liked it.", "author": "Anna C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-30", "description": "Interesting. I've never been to one of these before, but it was free with the GO pass so we checked it out.\n\nSome real artistry here. And fun to take pictures with some of the likenesses.\n\nSeemed a bit tone deaf to still have Johnny Depp and Morgan Freeman in there in this post-#metoo world, but I suppose if you've already made them... Kudos on skipping our current presidential embarrassment, though.\n\nBig points for Peter Dinklage- but how can you not have Lin-Manuel Miranda?!\n\nFun to spend the time, but probably not if I had to pay for it straight up.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-30", "description": "When you're in SF with a tourist, they will want to go in here.  You will then allow them to ask how much it is (pricey AF) and subsequently offer to just take their picture in front of the free figures in the lobby.", "author": "Alena W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "Place was pretty cool. We had a lot of fun posing with the celebrities for sure. Just don't let them suck you into Buying tickets for the other place in the basement. That would be a mistake as we found out. But definitely check this place out.", "author": "Ray L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "I'm such a tourist lol\nI love coming to these wax museums \nWhether it's in LA or in San Francisco I think the time and talents put in to these waxes are amazing \n-so look so real that it's kinda creepy \nSome are made so perfectly it looks just like the person. I appreciate great talent like this I think it's amazing \n-about 3 stories there's a lot to see\n-$20 Well spent   \n-restrooms are by mj and tu-pac", "author": "Koi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "My 1,325th review!\n\nOn 3/3/2018, while I was walking around Fisherman's Wharf, I discovered and visited for this funtastic museum located at Jefferson Street. It's called, \"Madame Tussauds.\" Yes this is the Madame Tussauds that we known of for creating well known celebrities into wax figurines! I've remember coming to Madame Tussauds in Las Vegas not too long ago back in 2015, and this is my 2nd visit at a different location! The atmosphere and the concept remain the same as most Madame Tussauds across the world, and for this SF location, it's pretty compact and spacious inside filled with various of wax figures across the whole room.\n\nThe employees here are doing a great job for making the customers like me a remarkable and entertaining service! No cons!\n\nEvery aisle at this museum is very well kept and tidy, so I can explore tons of figures in each walkway categories no matter where I go. Some of the wax figures are very accurate to see like Elvis Presley, Dr. Martin Luther King Jr., Robin Williams, Steve Jobs, Stephen Curry, Joe Montana, Audrey Hepburn etc. They looked real, but it looked fantastic to say \"hi\" or making a fun poses and selfies! I kinda confused about the Beyonce wax figurine in my opinion due to the looks on her face although for me, it doesn't matter cause it looked just fine. Additionally, I really enjoyed reading celebrity facts on the wall especially for taking authentic photographs provided by the clone photographer near the Oval office and creating your own wax hands. Overall, it's a fun experience!\n\nParking at Madame Tussauds in San Francisco can be challenging to park. You can park at the nearby surface metered street parking nor the parking garage nor lot if it's available. Alternatively, you can also ride a bike, walk, carpool, ride sharing or public transportation easier without the hassles and gimmicks.\n\nIn the end, Madame Tussauds is the finest well known wax museum that I've ever revisited and experienced right here in San Francisco after coming to their Las Vegas location back in 2015! Perfect for all ages from young to old! A well visit! My rating: 4 solid stars.", "author": "William L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "Always a fun time when I go. I love how you can walk right up to statues and take pictures. They have all kinds of different displays to look at and some you can interact with. If you haven't been here give it a try and I am sure you will love it.", "author": "Bernard V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "It's a delightful lil place.  You get to take your own pics with pretty much whomever you want to!  The figures are pretty exact as well.  Be careful though of the \"side\" attractions inside.  They're in addition to your entry fee.", "author": "Dar C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "We had a fantastic time here yesterday! The creations are amazingly realistic. We were a party of four and there was only one other couple there so we pretty much had the whole place to ourselves! My husband received four Groupon vouchers to the SF Dungeon as a birthday gift but we were an hour early. Because of the vouchers, we only paid $5 each to see Madame Tussauds. $20 is the regular price per person and well worth it even at that price. We all had a fantastic time. You need to go to this!", "author": "Debbie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "Great place! The selection of the celebrities is so cool! I also got to experience Alcatraz even before I actually went to Alcatraz! Got a selfie with Al Capone himself. I always enjoy going to Madame Tussaud's, but this was my first for San Francisco. I got so many pictures taken. Love this place!", "author": "Beverly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "We did this as a combo with the dungeon next door and it was well worth the money & entertainment! I loved that you could take pics at the wax museum. It amazed me how life-like the wax stars are! You can free-wander the wax museum as the dungeon is a guided tour and I highly recommend combining both for the best value. We had our family of four with 2 kids ages 10 & 12 & they loved both. They didn't recognize some of the stars, but the quotes & displays explained who they are and they loved taking their pics with them.", "author": "Carrie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "We purchased a Groupon deal for Madame Tussauds. The full price admission is a little expensive and totally not worth $30.\n\nAfter we took our pictures, the camera guy told to go to the 3rd floor. The elevator was big and it stated six people at a time. The museum is split in a few different areas: sports, music, movies, spirit of SF, leaders & entrepreneurs, and A-listers. You start on the 3rd floor and work your way down to the 2nd floor. Then you take the elevator down 1 floor to reach the gift shop to buy more junk. \n\nParking at Madame Tussauds in San Francisco can be challenging to park. You can park at the nearby surface metered street parking nor the parking garage nor lot if it's available. Alternatively, you can also ride a bike, walk, carpool, ride sharing or public transportation easier without the hassles and gimmicks. We parked at the nearest parking lot and paid $10 per hour. \nThe museum is kept nice and clean. And it wasn't crowded so we managed to take pictures with most of the status fairly quickly and move to the next. Maybe the key is to come early before all the tourists comes here. \n\nWe had an amazing time at the Madame Tussauds.", "author": "Ashi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-10", "description": "Not as good as the ones in LA or NYC but this one had attractions I hadn't seen. With Santana and Robin Williams from Mork and Mindy times on display outside. It was a nice place to\nGo for the afternoon with Ripley's right next door. And also they let you take all the pictures you want.", "author": "Kristy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Have you ever wanted to come face to face with Rosa Parks, Obama, Taylor Swift, Michael Jackson, Adele, and many more. Here you can get real close to some famous and fabulous people. But these are wax figures so if your shy or worried about what to say to them, relax because they can not hear you. Our children really enjoyed this wax museum. We came on a Sunday and we had the place pretty much to ourselves. We loved that they had the wax figures grouped into themes such as Spirit of San Francisco, History and Leaders, Behind the Scenes, Sports, A-List Party, Film, and Music.", "author": "Irina V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-15", "description": "This is my second time visiting this location. I'm just not a fan, compared to other locations it's very small and they don't have a lot of wax figures. To me it's like this location is for some of the duds.  They had wax figures of Rihanna, Dr. King, and Jennifer Aniston. They looked nothing like the actual people in some of them the coloring was off, and they looked like they had plastic surgery.  If there wasn't a name plate we wouldn't have known who they were. It was a nice 15 minute walk through. I still think that the museum in Las Vegas is better.\n\nThe one wax figure that stands out to me is Peter Dinklage, from Game of Thrones, his figurine looks so life like that we thought that he was going to pop out and scare us.", "author": "Jasmine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "At first I was thinking... wax museum, whats so  good or fun about that? Well let me tell you... its sooo amazing!!! Saw a bunch of wax figures that I just had to take a photo with. Read the descriptions of each one. Dang, learn something new everyday. I couldn't believe how real they looked. Very detailed and just mind blown!. The height of our 1st president was just amazing to me. Almost brought tears to my eyes... \n\nNow I want to check out all the other Madame Tussad's out there!!! \n\nParking is so close by and all the yummy food is next door, down the street and across.\n\nIt wasnt to busy and the few people that were there when we went were all fun to be around.", "author": "Priscilla P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Technically, every character in in Madame Tussauds displays sign of Schizophrenia due to their catatonic movement, otherwise known as WAXY flexibility...hahahahaha...get it?  Waxy movement by was figures in a waxy museum.  Even if you don't laugh, I'm laughing.  You guys will laugh however, when you come across some of these amazingly realistic characters in the museum!  I've never been to any other location of Madame Tussauds, but I'm going to go out on a limb and say that this one houses some of the best!  \n\nYou'll find Audrey Hepburn as Holly Golightly, Stephen Curry, San Francisco's beloved Robin Williams, and even Chicago's (pride and joy) Al Capone...not to mention several other iconic figures.  I simply names a few of my favorites.  You could look at every single one nose-to-nose and still be fooled into thinking it's the real deal!  So go ahead, take a selfie with Al Capone and George Clooney, and be shameless about it!   Believe me, I took plenttyyyy of pictures.\n\nIt's somewhat pricy to get into Madame Tussauds, but with the Yelp check in you can get  $5 off, making it only $22 to enter.  Pricy as it may be, the exhibits inside are worth it.  It's a truly fin exhibit whether you're and adult or are with your family, and it's easy to spend a fair amount of time in the exhibit given its breadth and interest factor!  Come one, come all and see the waxy movements of all your favorite actors, activists, artists and athletes!", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "The wax museum added a fun afternoon to our itinerary. I don't think I've been to a place where I just laughed the whole time. It's kinda creepy at times though. It's as if the wax model had moved or it just felt like they were real. If you visit here, make sure you bring a funny person who will imitate and pose like the statues. It's much smaller than the ones I've visited in London and New York.\n\nThe wax museum and the Dungeons are free if you're an annual Merlin Pass members. In our case we have a Legoland annual pass. \n\nThe place is categorized into different zones namely; music, leaders and entrepreneurs, sports, spirit of SF, film, and A-list zones. There was a section where they can take a wax mold of your hand. I think it's $20 for two with coupon. The coupon is at the back of your tix. We didn't do this but we watched how it was done. There was a small viewing area with limited seats and a small tV where one can see the story of Madame Tussaud. It's kinda creepy.\n\nMy sister, son and niece all had fun. The kids had fun posing and playing some of the interactive stuff. We had concert at the Music Zone with Madonna, Rihanna, Michael Jackson, Lady Gaga to name a few. The kids had fun playing the drums and the piano.\n\nWe hobnob with famous people at Leaders and Entrepreneurs zone with the likes of Steve Jobs, Bill Gates, Barack Obama, Mark Zuckerberg, Rosa Parks and of course Abraham Lincoln. My son learned about the Proclamation signing and had a speech with Martin Luther King. How much of that he retained? I don't know. But he had fun sitting at the oval office giving orders to the Clone troopers :-).\n\nWe played almost all the famous sports at the Sports Zone and got to meet Joe Montana and Serena Williams. Played golf with Tiger Woods and get to shoot hoops with Stephen Curry.\n\nThen we took a walk at the Spirit of SF zone by the Golden Gate Bridge and met up with the Mayor of SF, Edwin Lee. We sang with Tony Bennett on Lombard St and was serenaded by Santana and danced to the tune of Maria Maria.\n\nWe had a meeting of the minds with Alfred Hitchcock, John Travolta, ET, Steven Spielberg and my idol Audrey Hepburn. And my dream to have Breakfast at Tiffany's with Audrey Hepburn came to fruition while my sister was dancing with John Travolta.\n\nAnd finally we got to the A-list zone and rubbed shoulders with George Clooney, Laverne Cox, Anne Hathaway, our local Zendaya, Jennifer Aniston and the Emmy Award Winning Actor Peter Dinklage.\n\nIt was a lot of fun and totally worth visiting. Bring your imagination and a fully charged camera and you'll be in for a day of fun and knowledge.", "author": "Maricel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "An interesting little wax museum that has a lot of celebrities in wax form? Yup, pretty much.  It also includes a few historical figures like good 'ole honest Abe, and the Martin Luther King Jr.   \n\nThis location is smaller to the one in New York that I went to many years ago, so it caught me surprised when I figured out it was smaller as that was my base of reference.  However, it was still a fun experience and it's always interesting to see how tall some people are, or how short! \nAlso, the quality of some of the work is astounding and very lifelike, while some could use some work. Also, where the hell was Leonardo DiCaprio? Leo!!!\n\nIt was a fun time to be had, and get the combo deal with the SF dungeon as you will save a few bucks and make sure you do it online and not onsite.  Overall, a fun time to be had, just a bit smaller than I hoped.", "author": "Benny H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "My hubby and I finally got to visit this place last month and I couldn't believe we haven't gone sooner. We used to always be in this area and would pass by it but never went in. There's definitely a lot to see and I'm so amazed by all the work put in for each individual. Some are more realistic than most, but it was fun nonetheless. There were props with some which make picture taking that much more memorable. I wasn't sure if the ac was broken during our visit, but we were melting. It was SO hot and we walked around a lot faster than we wanted to because we honestly just wanted to get out of the bldg (it was that hot).", "author": "Alexandra G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-08", "description": "This place is interesting. Lots of awesome and cool stuff! They had Al Capone in his cell. I wish they had more classic figures though. I wanted to see John Travolta but I didnt see his wax. Which makes me wonder... was i not able to see it or did they remove it? The ticket is not expensive so yeah. It was fun. No regrets.", "author": "Leanna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "Fun place to check out while at the Wharf. There were many different genres and eras to choose from. The photo opps and props made it entertaining! Try to find a $5 off coupon to make it worth the visit. It was not a long tour.", "author": "Becky K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-01", "description": "Even though I live in the Bay Area this is my first time to the San Francisco wax museum.  I have been to the one in Las Vegas which is probably why I wasn't so impressed with this one.  While the wax figures themselves are amazing the museum I thought was pretty small.  Morgan Freeman is great!!  It doesn't hurt to go if you get a package with the San Francisco Dungeon but on its own it's just meh.", "author": "Michele M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "This was my first time ever going to a wax museum and it was one of the greatest experiences! I was expecting it to be kind of boring to be honest but it was actually very very extremely fun. They had like a scary haunted house thing next door and there were interactive simulations and rides, the whole thing was crazy. There was even a boat ride indoors! If you're ever down by Fisherman's Wharf in San Fran, definitely check this place out.", "author": "David K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-05", "description": "My boyfriend and I have been going to San Francisco often for quite some time.  We have many times talked about going to this wax museum and finally decided to go there as we had received tickets from an event venue.  So we went there and had pretty much a good time.  There was many chances for a photo op.   My favorite experience was playing the electronic guitar with a wax figure of Jimmie Hendrix.  That was fun.  The wax figures are very realistic.  Although I have to say that the Bill Gates and Elvis Presley figures do not look at all like them.  \n\nCool that in the gift shop you can buy Grammy and Oscar trophies, and have them autographed.  Heard that during the recent Oscars, a man stole a trophy and took a short video of himself kissing it.  The trophy eventually was returned and the guy was caught.  Gee, maybe he should have considered going to one of these wax museums and bought a novelty trophies instead.  LOL!!!\n\nBasically, it was kind of fun, a little engaging, and very strange experience.  I guess it may be the closest I ever will get to meeting these famous people, especially those that are deceased- Janis Joplin, Michael Jackson, Steve Jobs among others.  But still that kind of feeling of standing near a wax figure of someone that you admire, that kind of feeling is strange....gee...at least it was not like the classic Vincent Price Movie- Waxworks where the wax figures are actually corpses.  LOL!!!  But still, I personally like Ripley's Believe or Not Museum that is nearby more.  \n\nIt took my boyfriend and I about an hour to go through this museum.  Afterwards, I found out that adult general admission is about $30!  WOW!  I would never pay that much admission to see just a bunch of wax figures.  I would rather pay $30 to go to a party where I may meet actual local celebrities instead!\n\nPros:\n-this place has a fascinating history\n-many wax figures look like the actual people\n-esp. enjoyed the interactive exhibits\n-is a successful franchise\n-located conveniently on Fisherman's Wharf\n-lots of photo ops here! \n-you can buy a novelty Oscar or Grammy trophy here!\n-good!  No Trump wax figure!!!  \n\nCons:\n-it does not take long to see everything\n-kind of pricey admission \n-some famous people I expected to see were not there like Prince\n-a few of the statues did not look like the actual people\n-sort of a strange stalking-like experience for fans\n-no Wonderwoman wax figure?!?  WTF?", "author": "Irene S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "It was a dream for me to visit Madame Tussauds, and last year my dream came true! My manger gave me a free ticket and I was so happy to visit this museum. I made a lot of pictures, selfies with my favorite celebrities from sport, music, movies, etc. The wax models were so real-life looking. The place itself was cool and I love the wax sport figures. I would recommend coming here but only early in the morning", "author": "Elena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "I would highly remind this place.  I went with my wife and the detail in the wax figures is just amazing.", "author": "Jon S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-24", "description": "Hmmmmmmmmm. How do I start? I rated this place 3 stars, having paid the Groupon price of $13.50 per person for admission. Groupon is currently running a deal where instead of paying $19.99 (online saver price) or $27 (walk up price). If I had to pay the full price, I would definitely have rated this place lower than 3 stars. \n\nLe bf was dragged by me to Madame Tussauds on a Saturday morning around 10:15am. The first thing I noticed was that the music was extremely loud where you stand in line to purchase your ticket. I think the music was meant to go out into the street, but it didn't, and it made it hard to hear the lady at the ticket counter. \n\nOnce we presented our Groupon, we were told to go to the 3rd floor, using the slowest elevator known to man. It was large, but the signs specified that only 6 people should go in at a time. The actual museum is split in a few different areas: sports, music, movies, spirit of SF, leaders & entrepreneurs, and a-listers. You start on the 3rd floor and work your way down to the 2nd floor. Then you take the elevator down 1 floor to reach the gift shop.\n\nWhen we went, there weren't very many people so if we wanted to take pictures with the wax figures, it was extremely easy. Some of the wax figures we saw: Beyonce, Adele, and Stephen Curry. When we left, I guess a tour group came, so there was a long time of people trying to use the elevators to get up to the 3rd floor. I suggest coming here on the earlier end, especially if you come on a weekend. It is a tourist attraction after all. \n\nOverall, I think that you need to get the Groupon to make it more worth it. I don't think I would go without the deal. There weren't as many wax figures as I thought there would be. It was definitely a quick walk through. Le bf and I took just a few pictures and read all the signs (he likes to read everything) and we were done in about an hour. You can definitely take less time in there, if you wanted. Some figures didn't look that realistic. The employees were nice. If wax museums are your thing, and you've never been to one before, I think you should come. But if you've been to Madam Tussauds in NY or London, feel free to skip this one.", "author": "Carolyn Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "I didn't even know there was a Madame Tussauds here until my boyfriend and I walked passed it while we were wandering around Fisherman's Wharf.\n\nEmployees were very nice and helpful. You can buy regular tickets, VIP tickets, or a ticket that saves you the cost on going to both the wax museum and the thrill ride next door.\n\nFrom pictures I've seen it looks like they frequently change some of the mannequins so there's always somebody new to see!", "author": "Kait P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "Place was almost like Vegas but main theme and people were of sf. #SFGoCard to save money on attractions.", "author": "Maum K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "Just did a trip to SF and had time to kill so checked out Madame Tussauds. Ended up having a lot of fun here. They have the figures set up so you can take pictures with them. Most of them are so life like you think they are going to talk to you. Had a great time hamming it up and posing with them. Got some great shots. I think my boyfriend missed his calling. Only reason for 4 stars is I wish the attraction was bigger. However, I highly recommend it and just have fun with it.", "author": "Tina F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-08", "description": "Absolutely loved it! Came here thinking it was gonna be another short walk through type of wax museum, but it actually had way more then I had expected. It's super fun for adults and children. It gives you the back ground of Madame Tussauds, who she married, her family, even how she made her wax figures. The wax figures look so real and each one has their own sign giving you some basic info. about the person. They were all super interesting!\n\nAlmost all of the figures had props you could use to take photos with. These being, capes, hats, flags, there was even a guitar you could hold while taking a photo with Hendrix. \n\nThe staff was super friendly and answered any questions we had. It was such a great experience, i'm so glad I came to check it out and will defiantly be back sometime with my family!", "author": "Amber G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-06", "description": "Angry, wished they had a negative 1 for the ratings. I'm also mad that they did not have REAL celebrities that I like, instead they have people like that dude that owns facebook (NOT REAL CELEBRITY!). Went here for my birthday to hug Eminem's wax figure and take a picture with it not only did they tell me that his wax figure was moved to LA but I couldn't hug or touch anything after I was mumbling that under my breath (bummer!). To make matters worse I wasted an hour and a half trying to find the place and get parking for nothing! I could have went to my favorite cd store (that closed when I got there) that had the cd I couldn't find because it's an import than spend hours on NOT CELEBRITIES. Madame Tussands needs to add more REAL celebrities (not people like Kim Kardashian, Instagram people nor you tubers because they are not real famous people!) instead making people drive all the way Los Angeles. It just felt like much of nothing and it was a bummer there wasn't more to see. I heard they had Taylor Swift as a wax figure. Don't really care about that I saw  her in person don't need a wax figure plus she's way too tall and not very nice/acts like she's in high school even though were close in age. To sum this all up, don't bother going there because they don't really have anything special, just save money and go to LA or one of their better locations.", "author": "Brittany T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "Very interesting to see all the wax models, just seemed a little short. You need to be creative with pictures to fully enjoy your time there. Overall, I had fun.", "author": "Devin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "We went here a few weeks ago and it was great! The wax figures look so real! We had a lot of fun! You can take pictures with all the figures and it's so cool. I highly recommend this tour while you're in San Francisco! The location is great...right at Fisherman's Wharf!", "author": "Stacy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "This place is AMAZING\n\nStephen Curry? Peter Dinklage?\n\nMy eyes went wild just walking around this place. It's too much excitement to take in all at once!\n\nThe wax figures all look so real. Especially the beard on some of the figures like Peter Dinklage. Up close, it looked so real it's crazy. Plus they let me touch the figures, which actually felt kind of real and pretty neat. It's hard to describe the feeling unless you're there.\n\nI liked the singer room the most. Being surrounded by standing figures of Rihanna, Beyonce, Madonna, Selena Gomez, Jennifer Aniston, and Adele at the same time felt surreal. You can see the life-size height, the body, the facial expression. It's as close to meeting them as I will ever get in this life time :) Ever harder to get all of them in the same room.\n\n2Pac was there too. I thought he was dead!\n\nI knew Obama is really tall. Did you know Steve Jobs is actually a bit taller? I did not know that. Christian Bale is really tall in real life too--it was hard to tell since he is also quite buff in the Batman movies.\n\nThe exhibit was also very much San-Francisco-themed, with some areas decorated after Lombard Street, Golden Gate, and Cafe Zoetrope where they made the Godfather. Great for bringing friends from out-of-town, especially when passing by Fisherman's Wharf.\n\nOverall, a really GREAT place to visit. Definitely have to check out this place. I know I'll be going back again and again with friends and family.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-23", "description": "Creepy but fun!\n\nI enjoyed seeing these life-like wax figures and get up close and personal with Hollywood favorite celebrities, sports and historical wax figures. It's probably as close as I can get to the real star. This location in San Francisco opened in June 2014 so it's fairly new? Our visit here wasn't planned, it was a spur of the moment idea and the cheapest rate we could find was through the Madame Tussaud's website and purchased the tickets online at $19.75 + fees/adult ($16 if you live within the 9 local Bay Area counties).\n\nThis location had less wax figures compared to the other Madame Tussaud's I've visited in the past (London UK and Las Vegas NV), but still I enjoyed visiting each figure and reading their little captions and their stories. San Francisco had figures that is part of San Francisco's history -- Al Capone (imprisoned in Alcatraz), Harvey Milk (gay rights activist), Janis Joplin (who lived down Haight, Ashbury area of San Francisco}, Robin Williams who lived in Tiburon, Francis Ford Coppola (film maker and owns two prominent wineries in Northern CA), Edwin Lee (first Asian-American Mayor in SF's history), Joseph Strauss (chief engineer of the Golden Gate Bridge and it wouldn't be complete if there were no wax figure representing the California Gold Rush, enter John Sutter. \n\nThe wax displays were in sections-- movie celebrities, music artists, sports figures and historical figures (presidents and activists, etc).  So as I walked along and checked out each wax display I became co-director with Steven Spielberg, I flew E.T. home, I played ball with NBA's Stephan Curry (#30 Golden State Warriors), I sat next to George Clooney, I hitchhiked with Robin Williams along Lombard Street, I caught up with Christian Bale before he starts fighting crime in Gotham City, I took a mug shot near Al Capone's prison cell, had tea with Audrey Hepburn at Tiffany's, made an Uma Thurman dance move with John Travolta (Pulp Fiction), walked along the London streets with the Fab Four \"Beatles\", and sat on the bench with the Comeback Kid #16 (guess?).  These were just a few of the wax figure displays here in the San Francisco location.\n\nThere were props available for fun photo ops and you can show off your selfie in Instagram, Facebook and Twitter at #MTSFselfie.  This made for a fun afternoon. Hope they add more celebrity figures in the future. Funny how the museum had a wax of Selena Gomez and not Justin Beiber... just saying.\n\nReview #0480", "author": "May A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-30", "description": "The area of the museum is much smaller than what I expected. After entering the museum one will feel that the best is yet to come but it ends abruptly. Although I really liked some of the sculptures specially in the Hollywood and music sections - they are accurate. Overall, it is not worth the price.", "author": "Paulami C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-11", "description": "Definitely recommend hitting Madame Tussaud's and the SF Dungeon. Good campy fun; the Dungeon offers some laughs, some interesting \"history\" & fun jump scares and then you can mellow out while strolling through Madame Tussaud's. We really enjoyed the performers in the Dungeon, had the good fortune to go through with a group that got into the act so we all had fun. I'm a big huge chicken but the drop ride at the end is worth it. Madame Tussaud's was very mellow and low key (we went on a Tuesday early afternoon) and we enjoyed being able to walk around and check things out at our own pace. Tons of opportunities for photos and we were blown away by the detail on some of the figures. A bit expensive but worth it.", "author": "Heather Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "My fiancé and I visited MTs while on vacation. We had a blast! I had always wanted to visit this wax museum, and I had way more fun than I expected to. It's a great place to be silly and take photos with your favorite stars. I don't know that I'd make multiple visits, but it is certainly a must see.", "author": "MissAshley M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "The kidlet and I visited this tourist fave compliments of our local library's Discover and Go program. (What are you waiting on, parents?  Get to your library post-haste and get the hookup!) It's a wax museum so you'll be looking at realistic likenesses of celebrities, political leaders, athletes, and even Al Capone. Not surprisingly, this branch highlights locals like Zendaya, Bruce Lee, and Tupac as well as famous SF backdrops like Lombard Street and the Golden Gate Bridge. Photo opps galore!  My daughter got to rub elbows with Audrey Hepburn and don a choir robe to sing her favorite riffs from _Sister Act_while I did the twist with Travolta a la Pulp Fiction. Admission prices are steep but it's definitely a fun time.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "First I'm scared of elevators my son was with me encouraging me to go but I was still nervous. The guy who was working was super sweet and said he'd go up with us. So I went up. They have so many cool wax people. Our favorite parts were being able to interact and get cool photos. It looked like you were really with them. To save some money do the city pass or order online. Costco sales the city pass to online.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Better than the location in LA. Interactive and fun. Lots to see. 2 floors. Good spot to see for the fam!", "author": "Drew B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-17", "description": "I've never had any interest in visiting a wax museum, but upon looking at the photos posted here, I decided it was a must for my San Francisco trip. I bought my tickets online to save a few bucks, so I think they ended up being $17 each-- tip: when the receptionist up front gives you your ticket, don't just put it away. The \"ticket\" is actually a coupon that can be used in the gift shop. Most of the figurines are incredibly realistic, it's creepy. It seems like as the day goes on, the busier it gets, so try to get there early if you want to look at the figures without waiting for others to be done taking their photo. The main downside for me was that the Beatles weren't there at the time, but it really wasn't a big deal. Would love to visit at some point again!", "author": "Fiona H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Had a family trip. 3 kids and 1 infant. The kids age range 6-12 all girls. I was skeptical of doing the wax museum I've never done it before. I thought \"who wants to look at a bunch of wax?\" I thought wrong. It was fun for the whole family. Taking pictures and pretending to be different people. Kids , my love, and myself loved the place. You can also find some kind of deal for the ticket. I would definitely recommend this place for a family.", "author": "Abi A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-29", "description": "I think these places are a fading attraction to see. When I was there it was super empty and there were four staff at the front when my party was standing there waiting to be helped and it seemed like there were high schoolers or people who want to play on their phones more than help customers, I think one was even a \"manager\" I think they really need to hire better staff or go back to training. The attractions were nice and neat to see, but alot of the props were not there and messed up or broken. I think they need to do a clean sweep and get more people in there. Not worth the money paid to get in.", "author": "Travis F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-05", "description": "Get your picture with Mr Clooney!\n\nWe had received free admission since we purchased the 48 hr big bus tour pass.  I would've probably never purchased them since there is another location closer to home. \n\nThis was my first time going through the famous Madam Tussaud's.  The wax figures are definitely very life like and almost freaky.  I was expecting one of the figures to come to life.  \n\nThe tour begins showing the process and time that goes into creating the statues.  The museum is separated into different groups- presidents, celebs, singers and a few others.  Very organized.  \n\nOverall the tour is ok.  I'm hoping you can get these tickets with other tours you have booked.", "author": "Bethany E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-21", "description": "The kids enjoyed Madame Tussaud's immensely! They loved all the wax figures. The figures look so real at times. My daughter took her Polaroid camera and had us take pictures of her. She got some awesome and cute shots with the figures!\n\nI was really shocked to see that they had Bollywood actors and actresses there as well. It was the highlight of the tour to see that. \n\nThe setups were good too. There was plenty of room of take pictures in the settings itself. \n\nWe would very much recommend this to others. If you have children, take them with you. They will have even more fun!", "author": "Salma K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "We went to SF for a date night and decided to swing by the wax museum. Lot of cool celebrities and historical figures like Jackie Chan, President Obama, Adele etc. Walking around the place is a cool learning experience and there is plenty of info blurbs all around. The figures are apparently to scale, I had no idea George Washington was so tall and Robin Williams was so short. Not sure if I would recommend bringing the kids here though since it might be kind of boring for them. But my husband and I had plenty of fun! I recommend pairing your tickets with the dungeon for the best deal. They even price matched from online.", "author": "Alexis R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-16", "description": "Fun place! I wish there was more figures on the first floor because they seemed to be spaced out. None the less, it was a fun experience and I wish I had charged my phone before coming. The Wax figures are so detailed it's eerie! I liked the fun facts about the Wax itself as well as the Wax figure character. You gotta check this place out!", "author": "Mariah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "This place is crazy and amazing! Everything looks real and very detailed. People need to come here and see this place", "author": "Miguel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "This museum was cool and is right next to SF Dungeon. The wax figures are a little creepy, but it's fun to snap pictures with famous celebrities and historical figures! The wax figures are set up in cool sets that make them appear so realistic. This is a fun little museum to check out if you're in the area.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Went in expecting to walk through a museum and maybe take some pictures. What you get is an exciting interactive experience, totally worth the money. \n\nWax figures come with props to use when you take pictures. There are couches to lounge on with George Clooney, and capes to wear with Elvis. \n\nNot sure if I would bring kids, as there are a lot of references to older movies. But a great attraction!", "author": "Anna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "The wax museum was very fun. It was a unique experience to see wax figures of famous figures. I recommend this place to anyone visiting San Francisco.", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "VERY COOL!\nI had always wanted to go to a Madame Tussauds.  The last time I was in San Francisco there wasn't enough time.  This time there was and I'm so happy that I got to go. I've always loved wax museums so I had to visit the best of them! \nThe wax figures look so lifelike it's scary! I really enjoyed admiring all of the exhibits. I would have loved to have taken a few pics of myself with some of the figures, like the one with Audrey Hepburn. Unfortunately it was rather crowded compounded with extremely rude children running amok and abusing the wax figures. I kept wondering why there weren't employees or security about to keep an eye on people. Shame.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "Half the fun of visiting Madame Tussaud's is not knowing which wax characters you'll next encounter so my goal here is not to spoil things for you.  Instead, my goal is to tell you something you might not otherwise know.:\n\n1.  Many area libraries offer free museum tickets.  Did you know that those free tickets may also be offered for admission to Madame Tussaud's?  I was inspired to go solely because of the free pass offered by the Marin County Library system.  A woman in line in front of me was there with her free pass from the Alameda County library system.  The free passes are good for one adult and one child.  This is a great deal.  \n\n2.  You're going to want photos of yourself with the wax characters.  Really.  Madame Tussaud's makes this almost irresistible.  Their set-up is arranged to allow you to put yourself into iconic movie scenes, to become part of a political march, and the like.  There's even footprints on the ground in certain places to show you exactly where to stand.  So plan to take photos and if you're coming here solo, now's the time to invest in a selfie stick.\n\n3.  Madame Tussaud's didn't need to make the San Francisco version of their \"museum\" reflect San Francisco in any way, shape, or form.  That they did positively tickled me.  It would be a sad little wax museum if all they featured were San Francisco landmarks and San Francisco swells; they do a good job of balancing the SF-centric with images of people you care more about seeing.  \n\n4.  Some of these likenesses are better than others.  Some, of complete unknowns, I could appreciate for their realism alone.  As I stood 2 inches from the face of a couple of wax images I broke into laughter, so certain was I that the figure was about to break character and come alive.  When they're good, they're really good.  \n\n6.  It's time they retire a few figures and replace them with more relevant celebrities.  Get into the section featuring sports luminaries and tell me you don't agree.  \n\n5.  On-line tickets are available for $16 (advance purchase by Bay Area locals) to $22 (advance on-line purchase by non-locals).  I thought Madame Tussaud's was a fun, mindless activity but must admit that if I paid any more than $5 to get in my assessment of the experience would've lessened significantly.  Free tickets though?  You'll have fun.  \n\nThere's one million things I would suggest tourists in San Francisco do before heading into Madame Tussaud's but if you get free tickets it actually makes for a great excuse to play tourist for the day.", "author": "Tracey A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "I had TONS of fun in this place, and can't believe that I haven't EVER been to one before now. It was nice to dress up, and take pictures with the wax figures... with that being said, I didn't know that was how it worked, and I went by myself... lucky for me there were some really helpful employees, and some awesome goers that offered to trade out photos with me so that I could get the full experience of the place. I didn't realize this but I learned that each wax museum offers different \"people\" at each one... so you're never really seeing the same \"people\" twice. Can't wait to visit the one in LA, and see \"who\" they have to offer. Since hind sight is 20/20, please take your selfie stick with you to use if you're going alone. I know I'll be taking mine next time.", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-22", "description": "I was able to visit Madame Tussauds because I got a free ticket with my Big Bus Tour. While it was enjoyable and interesting, I am glad that I did not have to pay as I don't believe it is entirely worth $20-30.\n \nPROS:\n-Interactive exhibits (e.g. \"Gay Pride\" posters to hold near Castro district)\n-Informative San Francisco history exhibits\n-Interesting exhibit displaying how wax figures are made\n-Nice staff\n\nCONS:\n-Underwhelming amount of wax figures\n-Slightly scary (for my girlfriend) - although it could be argued as a pro that the wax figures were so realistic\n-Expensive ($20 for only 20-30 minutes worth of stuff)\n-One interactive exhibit for Rosa Parks suggested we sit at the back of the bus, which seems to trivialize her experiences and the civil rights movement.\n\nOverall, while I recognize how cool it is that they are able to replicate people from the past and present so perfectly, I do not think I will be going back as it is too expensive for what it is.", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-07", "description": "I've been to wax museums in several different cities. This one by far had the fewest was figures of them all. You would think for the location it would be packed to the gills with popular icons of our time. We didn't even know who half of the figures were... like, the current mayor of San Francisco... really? Anyhow, it's $20 to get in for a regular adult, and $18 for military. Took us all of 30 minutes to walk through, take pictures with the figures we liked, and exit through the gift shop. We needed to kill some time before our flight later that evening. It was fun overall, but I would have liked to see more wax figures for the price.", "author": "Brandi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-23", "description": "I brought the family here and they all really enjoyed it. Lot's of historical figures and iconic celebrities but the family and I did feel they could have had a better selection of statues. We all felt Freddy Mercury should have been in the singer section along with the Beatles and Elvis. Like we could have ditched the Selena Gomez for an actual iconic, and class singer ...I mean where was David Bowie ?? Blondie? Where is The Doors? At least they had Janis Joplin...It was fun taking pictures with the statues and we all enjoyed the tour just would have preferred to see a better selection of statues.", "author": "Esca N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-31", "description": "Madame Tussauds in San Francisco is great for families. \n\nThankfully, I received free passes to go and I was happy to check it out. It's been open for about 6 months in Fisherman's Wharf; previously, there was an independent wax museum located here. I had never been to that one, but I have been to original Madame Tussauds in London.\n\nThe SF one is much much smaller. I took plenty of pictures, and I still think it only takes an hour to see it all. You could easily get out of there in 30 minutes or less though, if you didn't want to pose for pictures. \n\nThe first floor has a couple of figures you can check out for free including, at the time, Michael Phelps, Johnny Depp, and Morgan Freeman, but I'm sure they move them around. \n\nOnce paid, you head back to the elevator and you'll pass San Francisco Mayor Edwin Lee, surprisingly. Then you'll head up to the top floor where you'll work your way down. There's two floors of figures. \n\nOddly, when you exit from the elevator, they immediately try to tell you that you've been upgraded to a VIP package and slap a wristband on you, which is all prepping you for a sales pitch at the end. Along your visit, a photographer will snap pictures of you with figures, so they can try to sell you a package at the end. I didn't care for this and the sleazy tactic of trying to pitch it to you like you were specially selected for an upgrade was ridiculous. I would have liked to have been left alone to explore the figures as I liked, not coerced into forced photos that I wasn't going to buy. By the way, the photo packages start at $35 I think. Yea...I don't think so...especially when admission is quite costly as well. \n\nAnyway, the figures are divided into sections like SF icons, musicians, politicians, historical icons, and Hollywood figures. \n\nIt was pretty cool how they had some very SF figures like Janis Joplin posed in a '60s setting with a hippie VW bus complete with a campfire and tent. This was more than just a figure; it was a complete scene from history. \n\nThere was also scenes from Haight Street and the Golden Gate Bridge. There's also props like guitars, drum sets, umbrellas, etc to use at some of the figures, so you can take some more interesting photos. \n\nThe Alfred Hitchcock figure was pretty cool because they had the shower set up from Psycho and you can step behind the shower curtain and use the knife and reenact the scene. There's special effects lighting and music too. The immersive, interactive displays were pretty fun. \n\nOverall, I think the museum is a bit too small and too pricey. The one is London is much better. However, I liked that they tried to put an SF twist to the museum. If you can find some coupons, or get a price you'd be happy with, then I think it's worthwhile to go. It's pretty cool to see the dimensions and proportions of famous people. Also, if you look at the Yelp photos on here, you can see a lot of people aren't shy about copping a feel! Grab that hottie's wax booty or feel up the biseps of Obama! When else would you have the chance?", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "Definitely worth it! Got the combo pack with The Dungeon's attraction as well, everything went perfect.", "author": "Cheryl C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-18", "description": "great place to spend kill 1-2 hours at Fisherman's Wharf! Even though this MT in San Francisco is much smaller compared to the one in Las Vegas or Los Angeles, it still is great and features many exquisite California geographic features and wax celebrities like the Beatles.\n\nAttractions like Madame Tussauds and The Dungeon (next door) are only great when you have got a groupon or some other great value saving coupon. So never pay full price for admission!!!", "author": "Philip M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "I got free passes as part of my Entertainment Book coupon!  My BFF and I were excited to look around after seeing the wax statue of Morgan Freeman that is outside the entrance and done very well.\n\nThe staff is all through the museum, and they are fun and friendly.  They ask you 4-5 times to stop for a picture that they want to sell you for $35 at the end of seeing all of the statues.\n\nFrom MLK to Abraham Lincoln to Obama, to Tony Bennett, The Beatles and Lady GaGa, to Jennifer Aniston, Alfred Hitchcock and Bruce Lee, there are statues from all parts of entertainment and from the past and present.  My friend and I had fun taking pictures and using the props set up with some of them. \n\nAt the end of the self-tour, there's a souvenir shop to take him your fake Oscar covered in gold glitter along with other goofy trophies.", "author": "Sheri C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "This is a fun place for the whole family. My daughter is 9 and she really enjoyed taking pictures with the different celebrities. They have props that you can use. I would come back again.", "author": "Luan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-08", "description": "Selfie with Betty (White)!? \n\nHere at the Madame Tussaud's in SF,  you can take as much selfies with your favorite celebrity or iconic figure (that they have in the museum) as you like. \n\nYou can stay however long you want cause there's no restricted time on your visit. Self-guided tour but there are staff throughout several areas that will take your picture & the pictures will be placed in a booklet to be available to be purchased at the gift store at the end of museum.\n\nI've been here several years ago, but the museum did definitely change from what it was before which is a good thing. Used to the wax figures were roped off so it was less fun, but I did see they have gotten rid of a lot wax figures. So less figures but more freedom to be more creative with the figures.\n\nI'd have to say that my fave is Betty White. Love her Off the Rockers show.\n\nI believe it's about $26 admission per person. But since my guy had bought tickets to SF Dungeon, it included tickets to Wax Museum. Yay!\n\nI had a pretty great time there, but my only gripe was why did they make Mark Zuckenburg sitting criss cross apple sauce!? LOL", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "I had a blast coming here! I spent a day with one my best friends just walking through and enjoying the wax figures. Some of the wax figures look so real but there are others that make you question what were these people thinking? Overall, it was a great experience!", "author": "Arcel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "The kids and the adults really enjoyed this wax museum!  Really well done and enjoyable.  Not only the special guests but the props and backdrops!  A great visit!", "author": "Robert B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "Was fun for the entire family. The majority of the wax figures were almost lifelike, I just wish it was a bit bigger, we were able to go thru the whole thing in about 30 mins, than decided to go thru again but backwards n read every informative plaque about ea person, and took about 50 mins. My favorite thing about this place is that the figures are correct down to the famous persons height and tattoos.", "author": "T S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "SO MUCH FUN!  Okay, living in the Bay Area all my life and I've never ever been here.  I always considered it a total tourist trap and had zero interest.  However ... yesterday my daughter and I spent the day in the City and were walking past Madame Tussauds  when my daughter turned to me and said \"I kinda want to see what this is all about\".  Ya, I'm a sucker for her so in we went. \n\nAt first I was not impressed.  The person who took our admission was not paying attention and over charged me.  She was not professional at all but she was young ... so .... I let it go. But once we made our way to the elevator and were greeted by another very energetic employee, my attitude mellowed and we were ready for a whatever this \"experience\" had to offer. \n\nThese wax figures are stunning.  Really, they are almost all truly lifelike and creepy in the fact that you know they're wax yet you kinda have to do a double take just to make sure.  I love that you are able to touch, hug and even kiss them!  That part was really funny because one of the employees giggled as she said we could even \"kiss\" them! Little did I know that I would actually do that when I saw Joe Montana lol. \n\nThese figures change so it's worth coming back again and again.  We took pictures with ET, Jennifer Aniston, Obama, Santana, Joe Montana, Elvis, Lady Gaga, and many many many more.  The exhibit can take as long or as short as you choose. We spent about an hour or so in there and could have probably stayed longer.  We will absolutely do this again in a few years once they rotate the figures.  So much fun!", "author": "Christie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-13", "description": "The Museum was fun for our 3-generation family group that visited before Thanksgiving, but the experience has been ruined for me by paying for a picture package that guaranteed downloads of our pictures and then not being able to access our photos online at all.  We have complained to customer service but had only promises, and no pictures.  Expensive, and not what was advertised.  Very disappointing.  I had wanted to use the picture of our whole group for a Christmas greeting and now it is too late, and we still have no pictures and don't know if we will ever have them.  If you offer something like that, make sure the vendor delivers what they promise!", "author": "Ellen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Had lots of fun here. Would go again and the staff was nice and fun. I got a ticket package and the prices wasn't too bad. I would come back and tell others to do the same. I hope they keep getting new things here.", "author": "Autumn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "I love visiting this place since there are stars that they have made perfect replicas of them.   Nice to take pictures with and without them.   If you are not into movies or pop stars of the past and present, I would skip this one to visit another attraction.   Our family has visited the LA location which has different wax replicas.   Great for the entire family.", "author": "Ala L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-08", "description": "The 3 stars is strictly because of bad custom service. The wax figures were great. The setup was great. No one working the wax hand station. NO workers anywhere in the actual showroom, so people were just doing whatever they wanted. It was crowded. They took our picture in the beginning but we had to go looking for someone to ask where they were at the end, then we had to wait for them to be printed. They weren't good photos, so no sale there. No one really talked to us unless we approached first, it was kind of awkward. We enjoyed the wax figures, but honestly don't plan on attending again.", "author": "Crimson T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "Madame Tussaud's is definitely a tourist attraction and a MUST see if you're lingering around Fishermans Wharf. I use to work at the Madame Tussauds in Hollywood and I visited the MT in New York City, Las Vegas and now San Francisco. Each attraction is different and caters to the city that they're in. Different photo ops, different rooms and props, they're all different but cohesive in a way that its true to who they are as an attraction in the city.\n\nSan Francisco was definitely worth it and I enjoyed myself. Its a bit tiny but take advantage and take every photo you can with each figure. They had a Castro area where they had Harvey Milk just relaxing, when you first enter, you enter a sort of maze but it ended up being Lombard street (super cute). The workers there are fun and they always have a good time.\n\nWe came in a lucky day because there was a Figure revealing!!! Which was reallly exciting because while working in the one in Hollywood they always had a figure revealing as a private event as suppose to a public event. Who did they reveal you ask? SAM SMITH. The man himself was there which was funny and cute. \n\nDefinitely take a lot of pictures of each of the figures there because they're amazing to look at since its life size and their exact measurements, definitely my favorite would be Laverne Cox she is queen.\n\nOne con about is that Magic Memories (Their photo department) can improve in their camera... Some pictures came out not as I expected because it looked really cheap... But I wanted to buy it anyways because it'll be a great souviner when I visit most of the Madame Tussuad's and their signiture signs and stuff. Ex; Vegas has the \"Welcome to Vegas\" Hollywood has the \"Hollywood\" sign, and New York has King Kong on the Empire State Building!!\n\nDefinitely a 5 star worthy place!!! Visit if you love that creepy celebrity wax figure type of thing!!\n\nHave Fun and Good Luck!", "author": "Steve O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "We really enjoyed this. We came here on a Sunday evening and we were the only ones there! It was Fun taking pictures with all the wax figures. The only thing is, I thought it was kinda expensive because we were in and out in about 45 minutes!", "author": "Cindy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-30", "description": "This madame tussaud's was a little disappointing compare to the one in LA and Las Vegas. Its very small and less entertaining compare to the other ones. Good thing we got our tickets cheaper coz we got the combo with san francisco dungeon and we got it online which is cheaper than at the gate.", "author": "Monica V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-19", "description": "Unfortunately, I would have to give this review a \"meh\".  For the price of admission (after discount, about $72 for 4 adults), it wasn't worth the price.  We were hoping to see more but we're immensely disappointed....\n  The wax statues of course we're excellent but the big disappointment was that if felt like there were only 4 or 5 rooms to visit (not even an Arnold Schwarzenegger to see) and there wasn't a horror section to visit  (that would be an additional  $10 a head at another location).  \n  I'm gonna say, save your money and pass this one up.", "author": "Erik E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-01", "description": "Yeah, I think it's more of a 3 stars \"A-OK\", but I'll give it a 4 being nice... \n\nI don't know why I came here in San Francisco, when I haven't even gone to the one in Hollywood where I'm closer to... The Hollywood one seems like they got cooler stuff, like more super heroes and star figures. i heard they rotate a few figures around, but it felt like there wasn't much here... \n\nThis was the first time I've been to a wax museum... I mean seeing a wax figure for the first time is pretty crazy... They really are so life-like, it's just freaky as hell... Morgan Freeman blew me away. lol it feels like it would come alive and move... I know actual celebrities have done pranks before where they actually pretend to be the figures and scare some visitors.... that's definitely a price of admission!!  \n\nAt this day and age with selfies, this is a perfect goldmine photo op place for those things... I liked how they weren't strict and let you really take pictures freely. But there is one room where one of the staff will bug the hell of you to take photos for you with their camera... I can tell she was bored as hell and desperate to do her job... lol I'm sorry, but no thank you!! \n\nI went on a really dead day, so I guess the staff wasn't expecting seeing much people and they totally freaked out seeing me... LOL Do I look that scary??? Well, they told me it's weird seeing people moving when they're used to only seeing bunch of still wax figures around... I know that feeling, as I also felt a little freaked out too when I walked into a room and someone was moving -- after being used to the presence of the figures.\n\nSo the San Francisco Madame Tussauds has the mayor figure and people relating to the city at the start. \n\nSome of the figures are really well done and look like the real person... others, not so much. Obama needs work. lol There's also Steve Jobs and Mark Zuckerberg nearby. \n\nAlfred Hitchcock has the psycho shower and I think there's a sensor or randomly it screams and lights turn red... that was pretty cool.  \n\nI like that you can put on the props too like wear the jacket and everything and pose with E.T. \n\nThe Bruce Lee one is really cool where you can stand as if he's about to kick your face. lol I like that one. That one definitely makes a fun photo opportunity. \n\nI don't care for One Direction... it should be Backstreet Boys or N'Sync. lol \n\nSome of the athletes, I don't understand... Why do we get Jeremy Lin with Lakers??!?! I want Michael Jordan!! lol \n\nIf Beyonce's wax figure is like WHOAAAAA when you first see her... she must blow people away in real life... lol \n\nThey put the good ones outside to attract people to come in... I mean, they got Leonardo DiCaprio standing right outside already... you can take photos with him without paying/going inside... Leo is taller than I thought! \n\nI parked in the public parking lot and I ended up having to pay like $20... ugh. They don't validate here\n\nIt can be fun, especially if it's your first time seeing the wax figures and depending on who you go with... but I don't think it's really worth the price... it's a short experience. The Hollywood one seems superior, but it's probably way busier.", "author": "Kiyo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "I really wasn't expecting to like this place as much as I did. The wax figures look SO real it's really amazing. The whole place is set up really neat too so it is really fun to walk through. I would probably go again!\n\nThe one thing I HATED was that when you get to the end, they have pictures of you that you took at the beginning. The thing is that they have already printed your pictures and put them in little books to sell you for a ridiculous amount of money (I think one picture was maybe $10 or $25 for 4 or $45 for the book). It makes you feel very pressured to buy them because they have already been printed. I thought it was just very scammy and wasteful! I admire that many places in San Francisco are pushing to be more green and create less trash. They really shouldn't have the picture printed like that when most people don't buy them. A digital show of the pictures would be just as luring.", "author": "Sharai K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "While in SF over the 4th of July we squeezed in a visit to the wax museum and we are glad we did. Everyone was so cheerful and attentive from the ladies at the front taking your picture, the one on the elevator and also the lady who showed us our pictures; everyone seem to love what they do and show it on how they interact with visitors. Our two teen boys really liked taking pictures with all of the figures and using props for them. It is a bit expensive with a fam of four but military discounts are always appreciated when we are visiting new places. I would recommend it to anyone who is visiting SF", "author": "Marcia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-09", "description": "The exhibit was pretty sensational! Especially for something as commercialized as Madam Tussauds!\nI had previously been to Madam Tussauds in Los Angeles, so i expected the exhibits to be almost identical. But, much to my surprise, they were more different than they were similar. They did have some similarities  (George Washington and Abe Lincoln) but for the most part, it was a completely new experience. \n\nThe models themselves are really life like and when looking at them closely there's a huge sense of realism. It feels like the wax sculptures could turn at any second!\n\nI highly recommend this. Even if you've been to a Madam Tussauds before!!\n\nMy only criticism is that it was too short!!", "author": "Aethan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-24", "description": "The museum is kinda small. It didn't take very long to wonder through. It was overpriced for how quick it was but we did have fun. My daughter was sorta creeped out and most of the celebrities she isn't really interested in but it was still cool to checkout. We walked here from a cruise ship terminal. It's easy to get to.", "author": "Erin F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-01", "description": "Very unfriendly staff. I'm not sure if people just hate their jobs but it sure seemed like it. Girl who was taking pictures was not nice and had an attitude", "author": "Darlicia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-18", "description": "I took my fiancé here for his birthday and was expecting to see the same exhibit that I saw from my birthday a few years ago. To my surprise, it changes often. And that makes sense because there are so many wax museum locations that they need to continuously rotate the exhibits and change the themes to keep one's interest. My first trip was awesome! This last time was just okay. It seems like the tour was a lot longer with even more stuff to do last time. Needless to say it was his birthday and he had a blast which is what is important. Would I go again? Yes I would. But next time, I will do some research and figure out what exhibits are there, and which one are not at that time.", "author": "Jess W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-04", "description": "Fun and enjoyable but somewhat short that's why I'm giving only 4 stars but I see potential in this place. If they improve on the customer experience then I would definitely go back. Not a lot of bang for your buck", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-06", "description": "I had no kind of discounts or free passes for this place, so I paid the full price and I wish we had our $52 back!  Yes, the statues are really life-like, but they weren't the kinds of individuals we particularly want to see.\n\nHow about a little more of the celebrities that are in current, blockbuster movies.  For example, the cast of the Expendables and Fast & Furious franchises?  Those films are popular enough for people to want to see those actors.  \n\nI've been to the Madame Tussauds in Las Vegas as well several years ago and I have the same underwhelmed feeling I had for this location.  I'm afraid this is going to be my last visit to any of these museum locations.", "author": "Rolena I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "The wax museum was really cool but I will have to say that my absolute favorite part was getting my wax hand done by Kiki! She was absolutely phenomenal, she accommodated all of our requests and was so incredibly personable! If she is working you are defiantly in for a treat! 10 out of 10 would come back just for her!", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "This is the first time I have been to a wax museum and it was awesome!\n\nThe sculptures are so lifelike it is crazy! When you take a picture with the celebrities it looks like you are actually standing with them. Admission to this exhibit was included in our SF GoCard, so it was definitely worth it for us. \n\nOnly problem with the wax museum is once you have gone one time you probably won't go again.", "author": "Alyssa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-09", "description": "As part of our Big Bus San Francisco 48-hour Dynamite tour bus ticket, we were given passes to Madame Tussauds ($26 value each) as well.  Located at Fisherman's Wharf, we decided to walk through because, well why not?  It was already an included value so why waste a free ticket.  I've never been to a Madame Tussauds before but I did know what to expect.  Lifesized wax figurines of notable celebrities and exhibits.  Some are currently living, some are not.  The SF Madame Tussauds does have a lot of notable Northern California celebrities like Robin Williams, Mark Zuckerberg, and  Steve Jobs.  Others included are Beyoncé, Lady Gaga, Neil Patrick Harris, the Dalai Lama, Martin Luther King Jr., and Rosa Parks.  You're allowed to touch the exhibits and take photos.  It was a fun little break from all the walking we had been doing and cool to see how tall these celebrities really are.  We also posed on the ET bike in the red hoodie too.", "author": "Trina D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-03", "description": "The number of exhibits is much smaller than I expected, and the ticket price is pretty high...\n\nI've been to the one in NY, and found it to be much more elaborate and fun.  If you've seen the bigger ones, simply avoid this one. It's populated by only the very famous and latest figures only.\n\nOn the up side, if you don't mind the high price of admission, there aren't usually many people here, so it's easy to take pictures.", "author": "Heather L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "This was one of the target destinations for my trip to San Francisco. I walked there from the embarcadero, and as I arrived inside their doors, I took a look around. In the somewhat small lobby, there was an unorganized blob of people.  They were enjoying the figures of Johnny Depp, Morgan Freeman and Zombie-Boris-Karloff, who greeted me silently.\n     There was an employee attempting to  wrangle the blob of people, and two girls behind the counter slinging tickets. The people-blob was discussing things amongst itself, giving me the impression that they were related. So I carefully squeezed around them, approached the counter, and talked to a girl about buying a ticket to enter the museum. Girl tried to upsell me on some stuff, but I politely declined and held onto my money.\n    After acquiring a ticket for myself, (Only $21 using a coupon from the Bay City Guide) girl behind the counter gave me an additional ticket. Complimentary entrance into the place right next door, the San Francisco Dungeon. The caveat of the free ticket was that it only good until 4pm that day.  I took note of the time, that gave me about an hour or so to enjoy THIS place before having to get over there to enjoy THAT place. Probably noticing my worried look of 'am I gonna make it', Girl behind the counter assured me that I'd make it in time. I smiled, nodded, and then walked past the counter and towards an elevator to see the wax figures.\n    The Hollywood location has a similar set up as this location. You take an elevator up all the way to the top of the building, and then you stroll back down through the facsimiles of famous people.  Actors, sports celebrities, historical figures and prominent San Franciscoites were displayed.  I very much enjoyed the historical bit. That was very cool. Seeing the guy who designed the golden gate bridge, and long dead presidents in their element was a good educational touch.\n     This place has costume-bits and props for people to dress up and appear in the scene along with their favorite famous wax people. That was cool. You could photograph yourself golfing with Tiger Woods, having a rap battle with Tupac, sharing the oval office from Barak Obama, in the shower behind Alfred Hitchcock, or even eating breakfast with Audrey Hepburn....at Tiffany's. I don't remember the props being there in Hollywood. But it was a neat 'hands on immersive' touch.\n    I meandered my way down the few floors through the actors, historical figures, sports celebrities and performers well within my hour window.  I took just about as many pictures as I wanted to take, and was not rushed in the least. Afterwards, I walked out their front door, and into the building next door, which housed the San Francisco Dungeon.\n\n    While the Hollywood location of Madame Tussards was a good size larger, with more wax people in it, this was still pretty fun. Absolutely worth the $21 to get into both places.", "author": "Scott B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-09", "description": "A little harder to take pictures with the figures if you are by yourself but the set up is great!  Wish I could have gotten pictures with the interactive parts of the rooms (maybe a staff member placed in the rooms to help take some pictures for you). Had a blast for my birthday though and the staff was really nice and helpful. Definitely something to check out while in San Francisco.  Some of the figures are so realistic. It's actually better than the one in Los Angeles.", "author": "Moe F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-24", "description": "This was way funner than I expected! I bought a groupon to go to the San Francisco Dungeons, and they gave us free passes to go into the Wax Museum too since I guess they are associated. \n\nIt was so fun! I took pictures with Mark Zuckerberg, Obama, Beyonce, Michael Jackson, and we got to stand in and wear costumes to take the Beatles picture and ET! It's a great attraction I'm glad I got to experience in SF while living in SF. I know Fisherman's wharf is super touristy, but sometimes being a tourist is just fun!\n\nYou should definitely go if you come across a deal.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "Wow. My expectations were exceeded. We bought the double ticket to go through the dungeon as well and it was  so much fun. \n\nI was a little disappointed that the website advertizes some caracters, but they aren't on display. \n\nThe dungeon tour was amazing. So realistic and interactive.\n\nOverall great experience!", "author": "Manri O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-14", "description": "So this was my first time in here  and I loved it but wish it wAs more. It started with the San Francisco and I'm from here so learning my history was good. I been to Las Vegas one which  I loved so much  I would recommend you go there  if it's your first time in San Francisco.", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-22", "description": "Have you ever had a desire to get up close with iconic personalities but you're not in the inner circle?\n\nHere's your chance.  You can mosey up and get your picture taken with very lifelike wax figures. You're greeted by Mayor Ed Lee. You can dress up and perform with Michael Jackson, play golf with Tiger Wood, drink tea with Audrey Hepburn, etc.  \n\nHubby and I had so much fun.  It's family entertainment.\n\nDuring your experience the staff takes your photo in various strategic areas.  Later you're thrown into the exit area where you can buy a souvenir album at $34.99.  Or $19.99 to access the photos online.  We passed.   And you can take your own photos.  Not from the album of course!\n\nHighly recommended.  Well done.  Not kitschy at all.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "This place is absolutely amazing! I had so much fun it was ridiculous! They have plenty of props so that you can pose with the sculptures. I absolutely fell in love all over again with Beyoncé!!! I loved the Adele sculpture as well. They make her look so big on television but she is definitely an average size woman. I got to take a picture with Rosa Parks, Obama, Martin Luther King Jr., ET, Jimmy Hendrix and plenty more. The one that will forever be the most memorable was Robin Williams. I personally know the beast of depression so his story really means a lot to me!", "author": "Cynetta M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "GREAT WAX Museum!  Before we couldn't touch the wax figures now we can which is kinda cool. Only complaint is they need to add more people in the music department I'd like to see Mariah Carey,Frank Sinatra and Bruce Springsteen. Also you gotta change Tupac's shoes he never wore brown timberlands lol. And for the acting side I'd like to see Robert De Niro and Bruce Willis. \n\nOther than that its a great wax museum", "author": "Abraham Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "We bought a Groupon for multiple attractions for our kids. We went last night and we're turned away. The next day we returned and the manager Camara completely took care of us. When were walking thru the exhibit we came across a wax hands set up. My wife and I decided to to it. Kiki and Annette took really good care of us. They walked us thru the process and made sure we were comfortable. We would recommend this to everyone. Amazing experience came out of a bit of a headache. Thank you guys for taking care of us.", "author": "Ben H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "We went to the museum today and it was fun! They look so real it's kinda creepy! They have a discount for locals so it was totally worth it. We took a bunch of photos and had a lot of fun. The only reason I didn't leave a 5 star rating is because to get the discount you have to purchase online and the online system wasn't working and I am actually unsure if my card got charged more than once. The employee tried to help me and we called the customer service line but they were closed. But she took my info and made sure we had no issues and we had a great time.", "author": "Erica N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "I went here a few years ago and thought it was alright, but it has since been made over into a more wonderfully fun place. The exhibits are interactive, the displays look phenomenal, and they cover interests from celebs to sport s to historical figures. Each exhibit also has fun and interesting facts about the person, which I loved. My favorite wax person this visit? Anne Hathaway", "author": "Katie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-19", "description": "My wife found a deal for here on Goldstar and I'm glad she did because I would have kicked myself for paying full price. There are deals out there, so look around. Ours also included free admission to the Dungeon, which is another attraction I'm glad we didn't pay full fare for. \n\n\nIt is neat how realistic all the figures are and its great they encourage pictures and the like. I find how they're made more fascinating than the figures themselves, but I'm not a big \"celebrity\" person. If you're into that then this may be more for you. I'm glad we did it and I feel we can cross it off the list.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "SOOOOOO.........The old wax museum is gone, not baaaaaaad San Francisco . \nNOt bad at all, you weren't even gonna fill us in on such great gems replacing all the things taken away from the wharf. hmm... gotta tell ya I love it. \nThis place was amazing. You can actually touch the figures and post with them. \nI had alot of fun. I hope for more from this place . I am pretty sure I'll be back and thats one thing I couldn't say about the other wax museum.  I love this place.", "author": "Luke S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "I've been to other Madame Tussauds locations in the past, and this one in  San Francisco is fairly new and replaces the previous Wax Museum.\n\nYou can actually get up close to these wax figures and have lots of fun. Very interactive exhibits, though the museum itself seems smaller than these other locations. Prices are pretty steep however, but sometimes their website offers discounted tickets if you order online. There are also various areas where the staff takes your photo and when you get to the exit, you first encounter this area where you can buy a souvenir album (didn't catch the prices, but agree with other Yelpers that it's too expensive and not worth it). Get as many of your own photos with your camera as you can!", "author": "Paul N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-04", "description": "This was my first time to visit a Madame Tussaud Wax Museum after hearing about it from other people.  This may not be as big as the other museums in the world, but was still pretty amusing.\n\nThey have a figure of Santana, Jimmy Hendrix, Barack Obama, Steve Jobs, Rhianna and other celebrities.  There is a green screen where they take a picture of your and your family (if not travelling alone) and to buy this photo is optional at the end of the tour.  There are 2 elevators that lead you up to 3rd floor. Santana, Hendrix, Mayor Lee and other notable celebrities such as Bob Marley, Tony Bennett, Madonna, Beyonce, Tupac, Michael Jackson and the old (and fatter) version of Adele just to name a few.\n\n2nd floor has Clooney, Anne Hathaway, Jennifer Aniston, Elton John. At the end of this path, you come up to 2 elevators that bring you back downstairs where you have the choice to purchase the green-screen photo of your Madam Tussaud Souvenir.  This place is also attached to the \"San Francisco Dungeon\" attraction which happens to be next door.  If you want to be more thrilled and entertained, go next door and try that one too.  Overall, not bad for a first time trip to the museum with the family.  Hope to try the one in NY sometime this summer.", "author": "Bread S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-05", "description": "This place was fun! I came here with my boyfriend yesterday and it was creepy at first but the idea that it might be an actual person goes away after realizing how awesome everything is. I wish there were more wax figures there but overall it was fun to see.", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-05", "description": "We had fun at this museum mostly because it's self guided and you can touch the actual figures. The props were fun and interactive. Wish they had some more figures didn't seem like it was enough. Still great and fun for families.", "author": "Cindy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-18", "description": "A way to spend a great hour taking photos and posing with freaky, life like wax figures!\nGreat scenes ad to the settings surrounding each figure. Well kept indeed!\n\nI just wish it was a bit longer!", "author": "Jean W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-19", "description": "We had a good time here.\nThe setup and ability to take pictures was good.\nLittle pricey for just a wax museum but I have been to a few and this place is much better than the others.  The staff throughout the museum are friendly and kind.\nI think if the price was lowered they would attract more people and still be able to get the good quality.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "The have changed this place A LOT. I miss the horror room I cannot lie about that, but I do enjoy how interactive it is now. And the wax figures are much better quality than the ones from about 5 years ago.\n\nHonestly what made the experience more enjoyable was the employee Ami, this review is a little late forgive me! But she was really compassionate and understanding to mine and my sisters circumstances. We came down for the day to do the San Francisco Dungeon, when we arrived (slightly buzzed) it was closed! We were so bummed that we made the trip all the way down there and our plans were completely destroyed in a second. I decided to see if it was possible to talk to someone at Madame Tussauds (since hey are affiliated) and see if we could upgrade so we could at least do the wax museum and come back another day for the dungeon. Anyways, Ami totally hooked us up and was totally sweet and understanding, which made me really, really appreciate giving her my business.\n\nI would definitely suggest this for something fun to do if you have no plans, it's dorky but whatever!", "author": "Kelly A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-23", "description": "This is my second time coming to Madam Tussauds and I love her and her families work. The first one I've been to was in LA. I think I like this place better. Plus my boyfriend and I got a free ticket next door to The Dungeons", "author": "Angel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-26", "description": "I came here in 2013 with my friend's and it seemed a whole lot bigger. I'm not sure if The San Francisco Dungeon took away from the museum's space or what exactly happened. I was looking forward to having my boys experience the same things I did, alas that was not the case. I left feeling kind of dissapointed. I wouldn't pay full price for admission based on the size of the place. Otherwise the wax figures looked great and the place was pretty clean.", "author": "Heather S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "Fun date location! My boyfriend and I went here one Saturday afternoon and had so much fun! I had a Groupon for $33 for 2 ppl. Sooo worth it! We loved the accessories that are placed near near all the figures, made it so fun!", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "The way they have these wax figures set it is simply amazing! At the old wax museum I feel like they had a few older wax figures like more presidents ect but all you could do was look, with these ones it's interactive! You can pose right next. They are pretty cool and so real looking, especially whoopi goldbergs looks dead on real. I loved it. My only downfall which is why I knocked off a star (really I give 4.5 but I can't take half a star) is because the photos at the end. It feels very pressured and not comfortable due to them being printed out already I feel bad declining but I'm a local so this isn't my one and only time visiting so I wasn't as interested.", "author": "Katherine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "I enjoyed my experience here at Madame Tussauds, i went on a day that wasn't too crowded wich made the experience even better. One major thing that i love is that a lot of the figures have props you could use to take pictures with them.", "author": "Devina J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "The staff at the front of the house were very friendly(Kiki and Kailin) and helpful to our family. Thank you guys.", "author": "Michael O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "Had a wonderful experience. Beautiful exhibitions of the wax figures. The four stars are for the customer service. We decided to buy pictures of us but noticed one of pics a little bent. We told the photography and they agreed to print another one. After our wait they gave us an additional free picture for waiting. We didn't even wait that long! We were delighted and happy. Thanks!", "author": "C V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "This place is awesome! You can get pictures with a lot of wax figures that look so real it's creepy! I loved getting my photo taken with Audrey Hepburn, Anne Hathaway, and E.T.!\n\nThe only downside is that it's pretty short! I hope they expand it in the future. I remember the Madame Tussauds in London being much bigger!", "author": "Molly Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-04", "description": "I went here yesterday and I was astonished by the big change they made inside the wax museum. Before you were only allowed to look at them and you couldn't even take pictures. Now they all have their own settings with props to take pictures with.\nWhat I didn't like about my experience is first of all the customer service. I don't know if the staff was just cranky since its 4th of July weekend/the elevator not working, but oh man they were rude to me. Second of all they took out a lot of the old wax figures that used to have. I think they need to add more of a variety in there and more current stars.\nI also think some wax figures don't even look like the stars. For example the wax Laverne Cox and Beyoncé don't look like the real ones. Lastly the prices are way too high and they got rid of the resident/student discount. I wouldn't come here again due to it not being that great.", "author": "Sharon G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-13", "description": "Had fun taking pics with the wax figures! Wish there were many more! But overall like the set up , I havent been here for  over 5 years and they definitely made it much better!", "author": "Dulce G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-16", "description": "This was much more fun than we anticipated! We honestly didn't know what to expect, but genuinely enjoyed the goofing around, selfies, and awe of the amount of work put into these figures. If you are \"local\" (part of the nine Bay Area counties) you can get significantly discounted tickets, just ask and show your ID!! They have other discounts for military, too, I believe.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "Our family took a day trip to the city. First we went to the California Academy of Science, very cool, then down to Pier 39 to eat, then to top it off we went to hang out with some great people. \n\nThere were only a couple of bummers tho. \n1.) No Michael Myers - for my wife\n2.) 5th Harmony - for our daughter\n... they were on tour... D'oh!\n\nBut seriously, the art they create here is a must see!!!", "author": "David E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "Normally I would have never gone to this but we had a pass and this was included. It was so fun. The weather was cloudy and th I s was a oerfect silly activity.", "author": "Kristin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-14", "description": "The owners were really cool. We had a lot of fun. I wish there was a good place to park near fisherman's wharf. I also should have read these reviews before buying a groupon! Wish I could have gotten a dungeon admission for free. \n\nAh well. I'd go back to this place, we really did enjoy it. If anyone knows of a good place to park feel free to message me! We paid $35 or something for the afternoon :(\n\nOh, and I wish the professional photos they took weren't so expensive. $15 each or $35 for all, but I guess they have to make $$ somehow!", "author": "Emma M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "Kiki was so helpful in getting us a great deal with our tickets. Also the museum is so much fun and filled with real life characters. Plus when we went it wasn't super busy. I totally recommend this when looking for something fun to do on your day off or vacation.", "author": "Stormy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-17", "description": "Overall this place is pretty fun. But as others recommend look around for the best price. The lady at the door told us $60 for four and then at the register they tried to charge us full price..no way would I pay $100 plus to get in this place that's Way over priced. In the end we only paid the $60 and we had a good time.", "author": "Sirena L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-28", "description": "Honestly, I was shocked how great of an experience it was! I was really sad when this place came along to replace the original SF wax museum. It was one of my favorite tourist spots. The wax figurines looked great and I loved how interactive it was and how you could touch the figurines and someone takes your pictures with them for a fee of course. Great spot", "author": "Heather S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "I had such a great time here! The set up was fantastic - you were able to take as many pictures with the wax figures as you wanted and there were even props! \n\nMy only reservation is that it is a bit pricey for one person but there is an option to buy tickets online and save.\n\nI had never been to a wax museum before so I expected that the figures were to be looked at and not touched so when first seeing that the price was $26 per person I thought it was overpriced. I ended up going because I received free admission when I got tickets for the SF Dungeon. I would definitely recommend going if you're willing to pay $26 per person. Great entertainment for a group of friends :)", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-21", "description": "I live an hr south of SF in Santa Clara and one weekend, my bf and I decided to do touristy stuff in the city. We purchased a Go Card (Which I highly reccomend for tourists who plans on visiting several tourist spots) which lets you enter several bay area attractions. Out of all the tours, I really didn't enjoy the wax museum that much. I mean it's okay but not amazing compared to other attractions like California Academy of Sciences. It's a hit and miss with the personalities and celebrity wax figures. I mean come on, Zendaya is not relevant. I wouldn't pay full price for it but since it came with my Go Card, it was ayt. I did enjoy Neil Patrick Harris, Obama, Beyonce to name a few. Oh and it was way warm inside btw.", "author": "Angel Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-31", "description": "This place was pretty cool. The celebrity's look so real. Steph Curry even had facial stubble that looked so real. It was fun to take pictures next to all the figures. I visited with my friend we had a good time. Only thing is it is pricey i think $35 for entrance fee. We got a san Francisco GO card which was good for 27 attractions so i would suggest getting one of those to save money.", "author": "Audrey N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-28", "description": "was okay but deff would not b worth the 35.00. But some of the peopld they had in there i didnt get like Laverne  Coxs really? And the girl ftom Disney  i frgt  her name  that was just strange but deff good to take pictures.  Deff better to get the go card", "author": "Stephany J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "I would have never gone here if it weren't for the joint ticket with the Dungeon. I would not pay to come here as I don't think it's worth the price they want but that being said, we had a blast especially being free. \nI loved how we could pose with the statues and touch them. They had some great ones too, especially for the Bay Area. The props they had were a nice touch too. Wish they would have had more as it was pretty small. Got some great pics tho!!", "author": "Laura R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "Worth every penny!! Bring your camera and be creative with your poses!! If you simply stand by the wax figures and smile the pics are boring. Use the ambiance to fashion a memorable photo shoot!! Love this place!", "author": "From C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "Luckily I got my tickets through Groupon because I find the full priced tickets quite steep. I did enjoy this wax museum and some of the figures looked so realistic, it was creepy. I loved that there were costumes and props available to use for taking pictures with the wax figures and there are workers to take pics, too. If you plan on visiting the San Francisco Dungeon (next door) as well, I suggest you go to the dungeon first, then buy your wax museum tickets at the dungeon. I was offered the chance to buy wax museum tickets for only $10 each.", "author": "Mama Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "Madame Tussaud's is a recognized name.  I've visited the museum in Vegas and enjoyed it.  So, with some happy expectations I ventured into the new Madame Tussaud's that replaced the old San Francisco Wax Museum.  I was impressed with the wax works.  Some of them were downright creepy in their realism.  I was a little disappointed at the number of waxworks though.  It seemed like that old museum had a lot more on display.  The new museum does have a lot of nice new interactive displays.  I wish they had kept some of the older waxworks around.  Robin Williams is a San Francisco icon that deserves a spot.  It also would've been nice to see some of the scientists and historical figures that the old museum had.  Overall it is a good time.  Especially if you're bringing friends or people who have been to San Francisco before.\n\nP.S. - What the hell is up with these arranged photo booths they have in these attractions???  I don't want to purchase a photo from them.  I don't want them to take my photo.  I tell them NO and keep walking and they keep after me and my group with questions of \"how will we remember the experience\" and \"it's all part of the fun\".  Please...", "author": "Nick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "Wow, wow and wow, very cool and tourist trap for sure.  I went to the one in Las Vegas as well, but this one we got through Groupon 2 for $31 dollars and definitely worth the money.  I liked all of the people they had and you can touch them and make funny photos and faces with them.  They had all sorts of celebrities like Mark Zuckerberg and Steve Jobs.  I wish they had Bill Gates. They also had a lot of people local from here like Clint Eastwood.  They had an assortment of celebrities which was nice and athletes too like Tiger Woods and Joe Montana and can not believe they had Jeremy Line. I wish they had other S.F. players like Jerry Rice or Jim Harbaugh that would have been very nice.  E.T. was pretty cool.  I wish though they had more employees take pictures as a group.  They do have particular stands where you can share the memories and get a booklet. The booklet though is overpriced however $35 dollars :(  \nBut overall I had a fun and exciting time.", "author": "Keven W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-13", "description": "My husband and I are less than an hour outside of SF, but we decided to do a tourist day and got a three-pack of tickets (what a great deal! The Aquarium, Madame Tussauds, and Ripley's? Nice) \n\nI had never been in, but I was impressed with the details and the fun, silly, interactive components. I don't know that I'd go a second time anytime soon, but it's a fun thing to do on a day in SF in-between meals.", "author": "Amber G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "Yes, it's Fisherman's Wharf, and yes, it's touristy, but what can I say...we had fun. I went here today with my 9 year old daughter (who freaked out at next door's Dungeon attraction...they offered this as an alternative). I have never been to a wax museum before and my expectations were low. The staff were lovely, although your basically just walk yourself around the figures. Some of them are amazingly lifelike...I mean, REALLY. It's fun and you will take a lot of goofy pictures. The kid loved it (ET! George Washington!) and it was an entertaining way to spend 45 minutes.", "author": "Samantha J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-08", "description": "My mother and I were pretty disappointed. So many of the big stars I expected to see were not at the SF location e.g. JLO, Brad, Christina Aguilera, Adam Lavine, Angelina, Britney, Deniro, Julia Roberts, Tom Cruise, any famous models, Elizabeth Taylor, Paul Newman, james Dean, Halle berry, lucille ball, Kim Kardashian  andmany more, so much so that It almost made me miss the old Wax Museum that Madam Tussaud replaced.\n\nIt sort of felt like the San Francisco museum, being one of most recent additions (locations) to the Madam Tussauds attraction, sort of inherited the bulk of unwanted, less famous and less interesting  and attractive figures. Hopefully over time they will make some great editions, and can live up to the Madam Tussauds museum I am accustomed to. The Wax museum did not have a scary section either...  My mom and I actually ended up walking through the museum backwards once we finished, because we were certain we must have missed a hall or something, but sadly we were wrong, the tour was just a lot smaller than any of the Madam Tussauds either one of us have previously visited  (NYC, LA and VEGAS).\nOn a positive note I appreciated that the SF attraction incorporated a lot SF culture- Silicon Tech magnates, as well as other well known bay area natives like Robin Williams, and of course Harvey Milk, and Hitchcock. \n\nIn short I would have rather seen more A listers and less BillyJean Kings, whoopi goldbergs and Michael Phelps.( I included Michael Michael Phelps,because I actually witnessed him at a gold tournament being a poor sport, and denying little kids autographs just because he was temporarily sucking at life).\n\n\n* PS I Would love to see tom Hanks and  James Franco here in the near future.\n\n\n\nOh & the Beatles section is missing the members.\n\nNo local discount given...", "author": "Ang G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-25", "description": "Glad I received free tickets here because I don't think I would have paid full price for this place.\n\nMadame Tussauds is a great place for taking pictures with well-known people and just a place to have a little fun with family and friends. Though, I was annoyed at the workers waiting with their cameras to take pictures for guests. Like, many of us are already taking FREE pictures with our phones and you want us to pay? Nah.\n\nIt got a bit tiring towards the end to the point where I was asking myself, geez, how many more wax figures to go?? I was sad James Dean wasn't there. :(\n\nI liked Alfred Hitchcock's little spot next to Whoopi. I liked how you opened the curtains and the music from Psycho played. Oh, and there was a bloody knife dangling in there too.\n\nOverall, it was a rather fun experience, but I don't think I would come again unless they bring James Dean. :)", "author": "Krystal C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-12", "description": "So my daughter wanted to try the place associated with this the Dungeons of San Francisco... they gave us free tickets to Madame Tussauds. Who would pass up a free ticket? So we all headed there after lunch at Rain Forest Cafe... It was fun... multiple stories.. My daughter is 12 and she had fun taking pics... especially when they had readily available spots all over the place.\n\nI do not think I would have paid for the experience... I don't think I was missing out on anything special... but for free? It was worth every penny", "author": "Jenn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-13", "description": "Disclaimer: I am related to an employee.\n\nThese wax figure are AMAZING!  I took a _very_ close look at many of them, and the incredible detail created such a life-like appearance that I expected them to move.  It would be so easy to spend a very long time appreciating each scene.\n\nGo see The San Francisco Dungeon at the same time, and save some scratch.", "author": "Greg G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "I loved this place! Very clean when entering, lots of fun as you can get up Close and personal with all the figures and each scene has props to interact with the figurines! \n\nMy husband and I also did wax hand souvigniers and they were reasonably priced unlike the admission. \n\n\nVery clean, very fun, steep admission. Better deal with the combo to the dungeon and getting tickets beforehand. I will hit the dungeon next time for sure!!!", "author": "Opinionated B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "STupid Touristy but still loads of fun.  Those figures sure can be creepy!  You really expect any one of them to just turn and start talking to you!  Won't take you more than 30 minutes to spin through when not over crowded. If you are a local, online tix are half price.", "author": "Flynn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "Came here after Dungeon since they had a promotion to do both for an extra $10.  Its basically a wax museum of current/past celebrities and iconic figures.  There's probably 20-30 statues.  Plus they let you take pictures up and close with the statues and have costumes you can try on.  Overall, its worth the $10, anymore and I wouldn't recommend it.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-06", "description": "A rep from Merlin Entertainment contacted me almost immediately and apologized. Considering how few businesses respond in that manner, it was very nice. Even so, that would've only merited 2 or 3 stars. The important thing is that they updated the hours of operation on their website within days of the first review going up. Such quick correction from a somewhat large corporate entity deserves praise.", "author": "Johnathan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "I went (7/19/14) and had an awesome time! So glad you're now able to get up close and personal with the wax figures. Years ago this place was simply a wax museum that you could just look at the figures. Can't believe how life like they are. I took pictures with every figure they had to offer.", "author": "Kenya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "We loved this place! I went with my 11 year old grand daughter. You are allowed to use the props and pose with the statues which look freakishly real! Be sure to take your camera. I had been to other wax museums and they were no where near this fun! The staff were very nice and very helpful. We had a great time. We also did the dungeon tour. You have to do this!! It was also a ton of fun. The people who play the characters are perfect for the parts. I loved the Judge, he was hilarious! I will be back, next time with my Hubby or another grandkid.", "author": "Vikki A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-16", "description": "I bought a Groupon that was $31 for two people, regular price is $52.00.\n\nThe remodel is wonderful! The wax figure actually look like the celebrities now and they're set up ways to be interactive with them to take pictures. I loved all of the props that people are able to use to take personal photos with. \n\nThere are stations where employees take your picture that you can buy at the very end. The pictures didn't turn out well and they're way over priced, but I can understand how it's another way for them to make money.\n\nIt's a lot smaller than it used to be, but it's much more interactive and fun. Enjoy.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "This is an awesome wax museum, it has various styled locations from horror to presidents, to historical figures ect...\n\nThe figures are VERY lifelike to the point of perhaps confusing you and permitting you to have a conversation with an inanimate object. The location is great as it's right in downtown SF and the little information blurbs they give about each \"person\" are also really cool.", "author": "Spencer G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "This place was very cool. My fiance' and I decided to check out this place along with the Ripley's believe it or not and the Wax museum. The inside where the wax figures were at were very cool and well decorative. This place is a fun attraction and a must see!", "author": "Makayla L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-18", "description": "I've been to the wax museums in NYC and Montreal and always have a lot of fun checking them out. Many of the statues are incredibly realistic!! At this smaller wax museum in Fisherman's Wharf, I was amazed at the intricate detail of skin tones. Betty White and Harvey Milk were among my favorites! I also like how each wax museum has many city natives included in their exhibits. \nSure, it's a touristy thing to do in SF, but a fun way to kill a few hours on our last day in the city. Great place to bring the kids as well. We paid $16/adult for admission.", "author": "Mariella Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "I personally love all the Madame Tussauds I've been to and this is no different. I recommend it. Good place to take loads of pics", "author": "Ben R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-30", "description": "Smaller than most locations and the price is just as high.  Limited attractions lacking the usual appeal.  We would not return.", "author": "Pat W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-09", "description": "its a fun place to go maybe once to have fun. the wax figures are simply amazing in terms of likeness and quality. but its on the expensive side and there really isnt a whole lot to see. i went this weekend for the first time and spent about an hour and fifteen minutes there. while its really fun its just too expensive for such a short amount of time. use a coupon if you can, the airports have $8 coupons and if you go to the California Welcome Center at Pier 39, they have discount offers.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "Great place to visit.  They had a lot of famous figures to take pictures with.  Luckily we bought the VIP pass (good at the dungeon as well).  By far, my favorite part was seeing how the figures were made.  We got to make a wax figure out of our hands.  Emily and Mayra were outstanding.  They made the experience so much fun.  Hats off to whom ever hired these two ladies!!!  Great experience.  I highly recommend you try this place.", "author": "Erik S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-02", "description": "I have been to the one in NY which was good.  This location is much smaller. They need to update their celebrities. It was nice but needs more figures.", "author": "Funtime P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-23", "description": "Scored 2 tickets here because I'm a part time concierge at work so I decided to give this place a shot after work. It replaced the San Francisco Wax Museum and thank goodness it did... those wax figures looked fake as hell! I've been to the Madame Tussauds in Las Vegas yeaaaaars ago and I remember I had tons of fun.\n\nThe elevators to get in take forever!! -- we probably waited 5 minutes. But once you get in, you're in. Goodness... it's crazy how realistic these figures are. Plenty of times I would scare myself because I would think that from a first glance the wax figure was a real person when in all reality, it was just a wax figure. It was neat of them to start the museum off with San Francisco historic figures such as Ed Lee. Probably did learn some great things about the city. What is also fun is that they have plenty of props just laying around so there's plenty of photo ops! You also get to touch the wax figures as much as you like ;) You talk through the museum and all the wax figures are in different sceneries, based on categories. To name a few, there were San Francisco historical figures, Hollywood actors/actresses (Audrey Hepburn, Jennifer Aniston), famous celebrities, pop stars (Lady Gaga), artists (Madonna, The Beatles), American historic figures (Abe Lincoln, Obama, Rosa Parks, etc.), and more...\n\nOverall, I had fun and the wax figures were super darn realistic. However, I must complain that it was super toasty in there and I started sweating. Probably from all the lighting? Or maybe I was getting nervous from being in the presence of such famous celebrities like Beyonce, Rihanna, Leonardo Da Vinci, etc.? \n\nQuestion is if I would recommend to others to drop $21 for admission -- maybe if the museum was slightly larger. But if you're bored in the city, have money to drop, and want a fun place to take a bunch of silly pictures, visit Madame Tussauds SF!", "author": "Cris-ann L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "This museum is awesome! They have the best wax statues period. This is awesome for all the family!! An awesome thing to do in fisherman a wharf!!!", "author": "Gary B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-24", "description": "Just attended the Invitation Only Preview - was very impressed. UNBELIEVABLE details on each celebrity figure.\n\nStaff is very well verse and very enthusiastic. It's got some great celebrity, historical, sports and entertainments personas figure to see. \n\nGreat for the entire family and some interactive fun stuff.\n\nTop Tier entertainment for the ENTIRE family. Great gift shop with some branded items that you can use again.", "author": "Liz D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-25", "description": "We loved it!!!   You can get as close as you want to the figures. My kids loved the lady gaga cause it had drums that they can play on.  I loved Michael Jackson too!!!  Oh of course Leonardo too!!!  The only thing we didn't care for was the staff taking the pictures by certain figures and then forcing us to buy them. That's my only complain. Great place and great wax figures!", "author": "Tina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "At first I expected Madame Tussaud's to be a gimmicky place, it turns out I couldn't be more wrong. The wax figures have such immense detail and look so much like the actual celebrity it is unbelievable. It is really great that the figures are not behind glass or anything and you are allowed to touch them and take as many pictures as you want with them. The elevator going from floor to floor is quite large but they only allow six people at a time on it. At first we ought they were joking but it later seemed they were not.", "author": "Matt P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "I attended a preview of the museum before the 6/27 grand opening, and was pleasantly surprised.  There are a wide variety of wax figures and even though it's a bit cheesy, you do find yourself taking selfies with them!  in some cases, t's as close as you are going to get to meeting the real people.  there are political figures, tech figures, athletes, movie stars from a variety of eras/decades, music stars, and more.  Also nice backdrops of the city in some of the displays.  i would definitely bring visiting friends here as part of the Fisherman's wharf experience.", "author": "Bebe W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-21", "description": "I've been to a couple of other Madame Tussauds museums around the world (this is my first in the US) and this one seemed smaller by comparison. I don't know how much the regular tickets are, but we paid $10 per person as an upgrade from the San Francisco Dungeon tickets, so for that price it was reasonable. One of the things I do like in these museums is seeing the local flavour, so San Francisco includes some notable people who are part of the history here (like Harvey Milk, Alfred Hitchcock, Mark Zuckerberg, Steve Jobs, and one of the famous Alcatraz prisoners). I loved the E.T. figure in the bicycle, which was adorable for taking photos of my kids with, and as someone with a filmmaking background, I couldn't help getting a picture with the wax Steven Spielberg. The room with musicians/singers is a bit small, so it can be a bit harder to get pictures with some of them without another one in the background. Same with some of the actors. They have a decent range of personalities so you may not have heard of them all, but are probably likely to find at least one you're a fan of. Apart from Hitchcock, Spielberg, and E.T., my favourites included Audrey Hepburn from a Breakfast at Tiffany's scene, Whoopi Goldberg, Martin Luther King Jnr, Adele, Laverne Cox, Morgan Freeman, and Neil Patrick Harris. The Nicolas Cage figure is hilarious because his eyes look so dead/emotionless.", "author": "Dominica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "I had such a good time here!  I like how you can get up close and personal with each figurine and touch them.  Most museums have the \"do not touch\" rule but as humans, we're a curious bunch.  What I especially liked the most was the fact that they provided props for the guests to use for pictures.  They even had photo stations where the museum would take professional pictures for you to purchase at the end of the tour.  For example, you can take pictures with the President, MJ, and etc... I really enjoyed my time at this museum and wished they had more!!", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-01", "description": "We visited the place Thursday, May 26, 2016 in the afternoon.   It was fun, we took pictures!  Going out, they showed us our pictures and we decided to buy it ($32.63)  together with the album. We were given the code.  As soon as we got home, check the website and input the code provided us.  Unfortunately, it gave the message \"code can not be found\"! I tried the following day again and again, next day again and again, no luck!  We feel CHEATED!!!  I sent them message today and hopefully will hear from them.  Not recommending to anybody.  :( I am going to dispute the charges in my card, if I don't hear from them thru this weekend.  I made shoots of the message, so I could use to dispute the charges!!  :(  :(", "author": "Edna N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "Very worthwhile attraction and wonderful addition to the legendary Fisherman's Wharf.  The wax figures are truly well-done and life-like.  Each theme in the attraction was well-thought out.  \n\nOne can tell how much effort and time is invested in each of the celebrity figures.  Guests are welcome to touch and take pictures which completes the experience.  Naturally there is expected wear and tear on a daily basis - incredibly each figure looks fresh and ready to entertain everyday!\n\nThanks so much for coming to San Francisco Madame Tussauds!!!", "author": "Chris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "Our teenagers went by themselves with our 8 year and they had a great hour of fun. Dressing up, using props and posing with celebs was great fun.", "author": "April B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "Absolutely amazing work by the artists of Madame Tussauds' studio.  Kept waiting for Steve Jobs' figure to move.  Same for Mayor Ed Lee.  Entered as a skeptic; left as a believer.  The history of the business was also fascinating.", "author": "Suzanne H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "This was a very fun time!  This wax museum is totally interactive, you can stand up next to the figures and pose with them, even touch them.  \n\nThe figures themselves are extremely life-like and not a little bit creepy.  But the posing for pictures part is great fun, some of the things people were doing were pretty funny to see.\n\nIt is well worth a visit, but it's very small.  Smaller than it should be.  They could probably lose the statue of Mayor Lee and Joseph Strauss and a couple others who no one would miss.  \n\nGo very slowly, and enjoy each figure as much as possible, because the place ends before you realize.  It should be about twice as big as it currently is. \n\nAs long as you understand this, it's really fun, though.  Got a ton of pictures.", "author": "Jon N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-06", "description": "Very fun and interactive! A big difference from the last time I'd been here in 2001! You get to take as many pictures as you want, you can touch the figures and take your time enjoying everything. We got the upgrade when we did the dungeons next door and it was worth it. Definitely a cool place to check out with a group of friends.", "author": "Renee P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "This place was pretty cool... not very busy on a Friday morning which was nice.  They allow you to get as close to and pose with the wax figures which makes it pretty fun for picture taking.  There are workers stationed around the displays to take pictures for you as well.", "author": "Brad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "This wax attraction is awesome!  The figures are so realistic that it made me want to talk to them.\n\nI Highly recommend visiting this famous wax attraction where you will feel like your standing next to a real person instead of a wax figure!", "author": "Jerry H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "This place is so much better than the old wax museum. They removed the ropes and let you now get right up next to them for pictures. They could include tv's next to the figures showing their best moments while they were alive/at their best. For example some of Michael Jackson, lady gaga, and Rihanna music videos, footage of muhammad ali's fights, babe Ruth hitting home runs, etc. Also they used to have movie scenes like the wizard of oz characters skipping down the yellow brick road, Jack and rose of titanic on the bow of the ship, all with background music from the actual movies. Would have been nice to see some movie scenes, but we did love how it's interactive now so you can pose with them in various scenes! All in all a COMPLETE upgrade but still could engage the audience a little more.", "author": "Megan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-06", "description": "This wax museum is by far the best wax museum I have ever been too! The wax people look super real! It was fun to interact, touch, and take pictures with the wax people! The entertainment was awesome! The dungeon section next store was also very fun. It wasn't too scary, more entertaining if anything however, I wouldn't recommend it for kids under 13. The only reason why I give this place a four stars instead of 5 is because the workers there are too pushy with sales. They almost wouldn't take no for an answer with buying pictures and souvenirs. It was very uncomfortable when they wouldn't let u give them back the pictures they took of you, or put items in your face and tell you, you have to buy it. If someone doesn't want to buy something or can't afford it then they shouldn't be so pushy. Other wise this place is great!", "author": "Rachel W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-23", "description": "first I thought this place was going to be boring and a waste of money and time but it was actually really fun a little bit on the expense side 26 per person I also felt rushed by the camera man even tho at that moment it was just my family and I. Hopefully in the future they get more stars that would be really great. But if you happen to be in sf give it a try", "author": "Vanessa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-03", "description": "This is the second Madame Tussauds that I've been to this year, also going to the one in Hollywood earlier. The figures are extremely impressive and are posed in such a way that it's fun to take pictures with them.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "This was so much fun. I can't begin to explain how thrilling it was to be that close to people I only read about. The workmanship is mind-boggeling in that most of them look so real. Tupac even had scars! I love Johnny Depp and this man looked so real I half expected him to turn and look at me to tell me to stop breathing down his neck! You've GOT to see this show. You will not be disappointed. I wasn't.", "author": "Valeri P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "I had complimentary tickets so I had to come before they expires. I had fun taking funny pictures with my cousins. It was my first time going to these wax museums and I expected it a lot bigger inside. They only had 2 floors but we spent a good hour there. And we got in for free!", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "Lots of fun\nMy daughters14th birthday with 6 friends had a great time\nInteracting with the wax figures \nAnd taking lots of selfies", "author": "Jim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "We've been to several of the other locations, Las Vegas and New York, and wanted to see the new Jimmy Fallon, and we were not disappointed...  The replicas are very lifelike...  Morgan Freeman was amazing, as were Tony Bennett, Lincoln, MLK, President Obama, the Beatles, Michael Jackson, and Lady Gaga.... We will definitely be back, and will bring friends, neighbors, and family...", "author": "CDR JAY C. O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "Best wax museum ever!!! U can touch them and take a ton of pictures! They let you dip your hand in wax and they will give you a wax hand! Soo awesome. Staff was very nice.", "author": "Cole F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "The wax figures looked so real, I was saying hi to them like they were really there!! Definitely worth the money! There are 3 floors of wax figures! From celebrities, to legends, and even sports. The props that they offered for you to use with the wax figures was a lot of fun!", "author": "Katrina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "My husband and I recently took our two 16 yr. old grandson's to Madame Tussauds Wax Museum at Fisherman's Wharf.  It has changed dramatically and now has such life like wax figures that I thought several of them would get up and walk around.  The workmanship was superb and so was the lay out of the Museum itself.  They also had opportunities for group pictures with certain displays as well as interactive booths for the kids.  You can also bring your camera and take your own pictures.  They have costumes you can use and you are allowed to gently touch the figures.  Sometimes you had to because they looked so real.  We all had a wonderful time and we felt it is one of the best things we have visited in SF.  I highly recommend you visit but I suggest you go in the morning so it isn't crowded.  It is great entertainment for the whole family at a reasonable price.", "author": "Pat L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-17", "description": "So glad they shut down the old wax museum and reopened as a REAL wax museum.  Now it is up to par with others in different states.  The figures are soooo real that it's creepy.  Wish they had even more figures.  Maybe they will expand.  Certainly worth checking out even if you live in the bay.", "author": "J J."}
