{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "I love coming to Makli - the best Chinese restaurants in SF! \n\nAll of the food gets top marks - comes out piping hot and full of fresh vegetables. The cod fillet with black bean sauce is delicious, as is the sweet and sour chicken. \n\nI don't know what dumplings to recommend the most because they are all so good! I'm trying more of them every time I go but a top favorite of mine is the BBQ pork buns! \n\nAlso, the service is great! Amanda is so sweet, very attentive and kind! My girlfriend and I love seeing her whenever we go there. See you very soon!", "author": "Tadhg O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-25", "description": "Dry and flavorless.\n\nThe pot stickers tasted stale.  They weren't steamed but not crispy enough to be fried. Gross.\n\nThe walnut prawns didn't have the sweet honey flavor that I'm used to. Just tasted like mayonnaise.\n\nI won't order from here again.", "author": "Kay H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-20", "description": "I was at a birthday party. Part of the spread was some chinese food. We arrived at the party on Saturday, May 12th around 5pm.\n\nI was starving, so I dug into the Peking Duck Buns: Peking-style roasted duck wrapped in Chinese soft bun. They were room temp, but I didn't care. The duck had nice flavor, though I like my buns with more green onion and hoisin sauce. I later had another heated up and it helped with the hardness of the bun. Made if softer and fluffier. I went online to look at their menu and price wise, it looks like it's $12 for 4 buns? A little pricey for my taste. I'd rather just get a whole order. And give me the whole duck. Not just the outside part used for the buns. (I know it's not the norm, but we always ask for it at family dinners.)\n\nPretty good buns. Just a little too rich for my blood.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-02", "description": "sf hegga hot n girls are dressin less\nORANGE CHICKEN the foodies taste em who's best\norder around on your phone or ipadzos\nor get your PANCAKE CHIVIN on deliveros\nback in Makli we be out in the pod\na dish called the CREAM CORN is where rbody COD\nthere's an air of lunch and of nappiness\nn this is the food eater's new dfntn of hanger madness\n\nsaw kinda mixed reviews but decided to order anyway bc frequent owner responses look like they gaf. that and rapidly increasing hanger either feed me now or find out why i have \"bruce muhfuhn banner\" tattooed across my chest. (jk no i don't)\n\n(-_^) Green Chives Pancake $8\nfun noodles inside #twss\nblandish but that's what the dip sauce is for\n\n(-_-) Chicken W Orange Sauce $12\n\"what'sa ninja gotta do to get some orange chicken around here!\"\nmoist tender but more salty than sweet\n\n(-_v) Cod Fillet W Cream Corn Sauce $12\nwhere's the cream? #twss lil salty. #twss\ndifferent from resto photos\n\n+ granpa arrived 10ish mins ahead of eat24 est\n\n- spent time after that getting him to the exact place (language barrier)\n\n+ he was friendly about it\n\n+ everything was fresh super hot\n\n- overall bland, salty where i expected sweet\n\ni wanted to still round up to 3 bc gramps was cheerful and all, but those flavor plot twists tho... otoh since the textures & service were good i don't think it would be difficult to remedy the taste. #twss", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "We come here regularly and it's so good and the workers are so nice. Their service is super fast and we can usually pick up within 10-15 minutes.", "author": "Hannay D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "Best bag for your buck place I've found in SF! Lunch specials for $9, good food and never a line! I don't know there's never a line when I go. It's like a mom and pop Chinese place you'd find in Chinatown. Great place to bring large groups.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "A good casual place for takeout and dine in Chinese food. Very fresh ingredients including al denote cooking of vegetables. The chicken was very tender in the cashew chicken I recently ordered. I also like the vegetarian noodle dishes. The service is quick and friendly.", "author": "Karen J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "Overall - the dim sum options and the wor wonton soup are the stars of the menu, and the prices are reasonable. The last time I ordered delivery, they included an order of pot stickers for free, and their pot stickers are good.\n\nFood: I have mostly stuck to the dim sum/wonton options at the restaurant. The dumplings are hot, have a chewy wrapper that isn't too thick or thin, and a generous savory, tasty filling. The pot stickers have the expected delicate wrapper with a solid crunch on the pan-fried side. The wor wonton soup has a light but flavorful broth, shrimp and pork wontons, snow peas, and carrots. I appreciated that they are generous with the wontons in the soup. It bums me out when I order wor wonton and get like 4 dumplings. I think there were at least 8 or 10 in my serving.\n\nService: at the restaurant, the service is friendly and efficient. It's not notably great, but not notably poor either. It gets the job done, and is nothing to complain about. Delivery service is better than average. My order arrived a little early, was piping hot, the soup's plastic container was well-wrapped in a plastic bag and hadn't leaked at all. And, as I mentioned, it included a freebie which earns them extra points.\n\nAmbiance: the restaurant's ambiance is pretty basic, casual Chinese eatery. Not really a date place, but a great, casual place if you have a hankering for dumplings and don't want to go out to the avenues.\n\nPrice/Value: this place is reasonably priced, especially for the quality of the dim sum. An order of dumplings is $8 and comes with 6 or 8 dumplings I think. The serving sizes are relatively large, so go with a friend so you can share a couple items and you can probably get out of there for $15 each, including tax and tip.", "author": "Sara E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "This is hands down my favorite restaurant in San Francisco. I come here regularly with my good friends to celebrate and eat delicious authentic Chinese food. The service is incredibly friendly and the owners are wonderful.\n\nI always order the lamb dumplings, the baby bok choy, the fried chicken wings, and the beef noodle soup. I also enjoy the jasmine flower tea, which is incredibly fragrant!", "author": "Tiffany X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "I love Makli - great service, family owned, delicious food. A local favorite for Chinese.", "author": "Lea C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-15", "description": "Ordered food take out and it was not good - don't understand all the praise... maybe it's better if you eat in?  \n\nEither way I won't be trying again to find out. For us food was bland and kinda slimy. They used cheap cuts of meat which left me wishing I'd ordered veg options only.    Edible but not worth the effort.  Lots of better Chinese food in SF (ahem, Eric's!) - you can skip this one.", "author": "Aaron B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-09", "description": "3.5 stars\n\nSolid fast Chinese take-out.  I've ordered take-out a few times here and also dined in to make use of their great lunch specials.  The food is tasty, although sometimes oily, and is very affordable.  Today, I ordered take out and here are my two cents:\n\n- Fried Calamari - Meh. Calamari seemed old...I wouldn't order this again.\n- Cod Fillet in Black Bean Sauce - This was great.  The fish was cooked perfectly and the sauce was savory and delicious.\n- Beef Chow Foon - Great staple.  A little oily...but that's the only way to keep the noodles separate!\n- Stir-Fried String Beans - These were alright.  Savory but maybe too limp?\n- Mapo Tofu - Spicy kick of flavor! Tasty.\n\nDefinitely a go-to for when I don't want to cook or need something quick to eat.  They said that food would be ready in 15 minutes and it takes about 10 minutes for me to get there, so the timing is perfect! I call, make my order, get ready to go, drive over, and pick up immediately.  Seamless.", "author": "Jess Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-09", "description": "Ordered their food through Eat24. Stay away, not worth the value and flavor was mediocre. \n\nHot and sour soup - $4 for 1/2 of salty soup \n\nWest lake beef soup - $9 bland and where's the beef??\n\nBeef chow fun - $9 this place doesn't seem to know what Chinese food should taste like\n\nChicken wings- $9 only thing that tasted decent \n\nOver priced, poor attempt and salty Chinese food", "author": "Vince L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-14", "description": "I usually enjoy a 4 or 5 star experience w/ Makli's dinner options, but last night's meal was off. The flavors were ok, some dishes like the black bean chicken was so salty that I got a headache after. I only enjoyed the pork and chive dumplings. Nice surprise to see the free fried dumplings w/ the takeout order. $45 for 4 dishes was not bad, but having a headache after the meal is not good.", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-22", "description": "Super disappointed after ordering $50 and 6 dishes.  was so hoping to make this my go-to Chinese restaurant but sadly another disappointment.\n\nThe good -\n$0 delivery (so I tipped well)\nsuper fast\n\nThe bad -\nThe food.  One of the worst Chinese food I've had in Sf, period.  \nSteamed Pork with chives dumplings - the only dish w decent taste decent but some of the wrappers were dark? Looks pre-cooked and reheated maybe.  \n\nThe fried spare ribs - the meat had a FOUL taste.  what the fuck.  I sniffed it after I took a bite. I plan to toss the rest out.  Don't feel safe eating it.  \n\nString beans - it was soggy and fried with preseved vegetables?  Zhai Cai for those who Speak Chinese.  It's like the spam of vegetables, loaded with preservatives.  I've never had string beans with this in China or anywhere in the U.S. I love the dried, black beans or garlic infused string beans common at Sichuan places.  This is the worst version I've seen.  \n\nBok Choy - okay, most Americans would not see this vegetable and tell you it's Bok Choy.  So I'd be careful with the labeling.  And also where's the FLAVOR?  It tastes like steamed vegetables with some garlic bits sprinkled over it.\n\nThe beef westlake soup - $11 for a not even a full cup of soup that has just egg white and some ground beef?  The broth is bland and worse than my canned Chicken broth.  You are kidding me?  This is worst than food in a food court and you charge $11 for that?  where's the vegetables in this soup?  the traditional recipe has usually watercress in it. \n\nThe fried pot stickers came for free.  I didn't order it but it was way over fried and tastes like frozen dumplings that were freezer burnt from my own freezer.  I can't believe you'd charge $8 for this.\n\nonly good was the fortune cookie b/c the message.. hopefully it's true. \n\nso sad.  will have to try yet another Chinese restaurant on yelp24.  the hunt continues", "author": "Morgan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "Food was quite tasty! \nThe service was OK, and the seating was a little cramped. The tables were also small, (or maybe my party of 2 just ordered wayy too much food?!)\n\nI think the menu is overly complex and expansive. Could be simplified.", "author": "Arjan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "#145/2016\n\nPromising, but not for the MSG-wary: Had enough of a dose that even I got a slight headache which almost never happens.\n\nWe ordered in and had the lamb and parsley dumplings and pork and shrimp wontons (both delicious). Pork gyoza were solid, complimentary with Yelp check-in.\n\nSweet and sour pork- my little boy's fav- was the right balance of sticky and savory/sweet. Chow fun noodles with BBQ pork, chicken and shrimp were slightly mushy and lacking in proteins. I wouldn't rush to order it again. Its sauce was also very salty (and I love a salt lick).\n\nPortions were smaller than other Chinese restaurants but I found Makli to have higher-quality ingredients; I'd take that trade-off in a heartbeat.\n\nWhile other Yelpers have complained, we were quite satisfied with size of the entrees and easily have leftovers for another meal.\n\n(Of course greedily diving into orders of dumplings and potstickers took the edge off our appetites!)\n\nThe star of the dinner was definitely the dumplings. While slightly pricy ($10 for 6) the ingredients were quality and the wrapper, just right. \n\nMenu is smaller than most Chinese restaurants with many Cantonese (\"Americanized\") favorites and unexpectedly delicious dim sum.\n\nI'll try 'em again.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Delicious, affordable. Ordered the chicken flat noodle soup, pork dumplings, and potstickers. \n\nDrooling right now just thinking of them!", "author": "Emily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Amazing! Great food, so much variety, very friendly service, and amicable environment.", "author": "Nabila E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-10", "description": "Empty except for us (party of 8) on a Friday night at 8. Service very slow and indifferent. Staff should learn to prioritize the guests dining there. Place appears more delivery and take out business than anything else. \n\nDumplings were tough - and no juice inside. Seemed frozen, perhaps?  Meat dishes were uniformly greasy and many vegetable dishes had the same salty dark brown gravy on them. \n\nOdd sign:  the large sign says simply \"Chinese cuisine.\"  A small plaque near the door says Mak Li. \n\nThis place was below average. Sadly.", "author": "tout le monde a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-24", "description": "Was looking for a good Chinese food place in the area and was honestly pretty disappointed with Makli. We ordered the pan fried buns (sheng jian bao) and steam bbq buns (cha shao bao) along with the mongolian chicken chow fun with bok choy. The pan fried buns were very dry and I'm pretty sure they had previously been frozen and were not heated up properly. I told the waitress and she ended up cancelling this order. At least she was understanding and the service was friendly.\n\nThe noodles were pretty good, although not exactly authentic. The portions were large so that was nice and we got the free pork pot stickers from the Yelp Check-In offer. I think this place is good if you're really in a bind and want some Chinese food but I don't think I would come back if I was looking for something authentic.", "author": "Dora T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "I've ordered Makli via EAT24 several times and I think it's safe to say I've found my 'spot' for those days when I just don't want to cook. Portions are not overwhelming or too small so I find I can order 3 or so dished between two people. My personal favs are the BBQ Pork Fried Udon  as well as the Eggplant dish. Delicious! Delivery has been reliably accurate and quick too!\n\nEdit: Makli has become my go-to delivery spot! Delivery times are excellent and food has always been fresh! A+ for consistency!", "author": "Alex P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "Makli. You should promote your dim sum. You are so much better than Red Jade, Mama Ji's-- any place. But. Speakinf of Mama Ji's they have atmosphere but you don't. Go check out Eiji the sushi spot across the street & Ji's. You get cool decor, & promote your dim sum, you will b successful.", "author": "Scott F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-22", "description": "not good at all, very disappointed. I saw this restaurant has 4 stars so i gave it a try and order it for delivery. Ordered 4 dishes.... the fried string bean, pork and chives dumplings, cod fillet with cream of corn, and a hot and sour soup. Everything was salty except the pork and chives dumplings, and the hot and sour soup was really sour. My most disappointment was that i order the string bean not spicy but when i opened the container and saw the container full of red chilly pepper. Never again would I go or order from this place again...tsk tsk tsk....shame on you Makli.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-03", "description": "The food at Makli actually tastes pretty good, if you avoid all the fried items. \n\nLast night we ordered delivery: Mongolian beef, walnut prawns, broccoli and mushroom stir fry, and chicken clay pot tofu. The first three items tasted fine.\n\nIn the clay pot I we found multiple pieces of tiny slivers of bones - really bad since we were feeding this to our baby. I also found a lovely piece of plastic, sort of like a tofu lid cover. Both of these were not enough to deter us from eating more as the dish itself was tasty. Then my husband took a bite of something that was rancid. It made him gag and spit. After that we threw everything out.\n\nWill not be going back or ordering from this place again.", "author": "Jaching H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-07", "description": "I'm sure there's some intriguing back story behind why this Chinese place has the same name as an ancient necropolis in Pakistan, but I didn't bother asking the server who was a cheery girl who couldn't have been more than 18. Jamie W. and I ended up here by accident after the Pride festivities in the Castro where we were celebrating the SCOTUS ruling on same-sex marriage. It appeared everyone else at the event was looking for places to eat, so we ducked into this low-key restaurant on the corner of 15th and Sanchez. I remember when this was the middling Daimaru Sushi before, but now it's a fairly standard Chinese restaurant among several in the general neighborhood like House of Chen and Red Jade.\n\nOur timing was good because only one other table was occupied, but it started to fill up quickly as our meal progressed. We noticed there was a lengthy list of dim sum options, so we ordered the $7 Green Chives and Pork Dumplings, a half-dozen of them steamed and filled with ground pork and chives (photo: http://bit.ly/1UDD82I). They were tender, piping hot and quite delicious with that burst-in-your-mouth savoriness we both liked. Continuing our dumpling theme, we shared an $8 bowl of the Wor Won Ton Soup, which turned out to be almost as good as Eric's, our favorite maker of won ton soup in the city. It contained pork and shrimp dumplings, snow peas and carrots in a light broth (photo: http://bit.ly/1IVnvx1).\n\nWe were pretty happy with our dinner so far, but our experience declined precipitously when the $11 Mu Shu Pork arrived. It had all the standard ingredients - stir-fried eggs, pork, cabbage, bamboo shoots, and shiitake mushrooms - but it was saturated in a heavy soy-hoisin sauce that made the entire mix too salty to eat with any satisfaction (photo: http://bit.ly/1NmPX2q). That was a shame since the crepes were prepared nicely with just enough give to allow easy wrapping of the mu shu mixture. We ended up eating a lot of our dollar bowls of Brown Rice to soak up the sauce (photo: http://bit.ly/1JONfwK). In hindsight, we probably would have preferred a more predictably crunchier dish like General Tso's Chicken to fill our palates. But hey, two out of three ain't bad.\n\nFOOD - 3 stars...starts out well with the dumplings and then falls down with the mu shu\nAMBIANCE - 3.5 stars...nice enough inside if rather compact\nSERVICE - 3.5 stars...our server was quite attentive and energetic\nTOTAL - 3 stars...stick with the dim sum and you will likely not be as disappointed as us", "author": "Ed U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-14", "description": "Ordered delivery and dinner failed to impress.\n\nThe good: the Napa cabbage and pork dumplings were good. The shrimp dumplings were good, but $7 for 3 pieces was way too pricey.\n\nThe okay: the fried rice was alright, although I did find a huge chunk of egg shell in the rice. I can forgive the sloppiness.\n\nThe bad: the orange chicken was soggy (I get it, delivery is hard to keep things crunchy) but maybe a little effort like cutting a corner if the lid to let some steam out. The sauce wasn't orangey at all, mostly just really salty. Too salty for me. I'd prefer Panda Express.\n\nI'd probably give them another shot if I were ordering just dumplings.", "author": "Chanel H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-29", "description": "My chicken was delivered Luke warm with soggy-never crispy breading.  The fried rice is best described as bland.  And to top it all off, they only gave me 1 soy sauce packet.\n\nEdit: Within the hour of leaving this review the manager called and personally apologized for the food quality.  He then proceeded to refund my purchase.  Mistakes happen, and everyone has a bad day.  I appreciate him doing what he could to make it right.", "author": "Bryce H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-08", "description": "One month ago I ordered delivery from here and got their steamed BBQ pork bun. It was amazing. 5 stars. \n\nYesterday, I had a mad craving for said steamed bun, so I ordered it again. This time, I did not receive the steamed bun. Instead, I received the lesser baked bun. It was decidedly meh. 2 stars. \n\nI call to let them know about the mistake and try to reorder the steamed bun, happy to pay as long as I can satisfy my craving. Instead, the guy on the phone says they don't carry the steamed BBQ pork bun and never have. When I tell him that I have personally eaten the steamed bun from their restaurant mere weeks ago, he says \"you probably ate it somewhere else.\" Ummm... excuse me?! ONE STAR. \n\nCheck out the attached photo #115 - BBQ pork bun - steamed bun filled with BBQ pork.  The online menu even has a picture of the bun they never carried. \n\nSo which one is it, Makli?! Disappointing all around.", "author": "Summer P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-22", "description": "The food here is absolutely terrible.\nI ordered the orange chicken and the soup dumplings through the eat24 app.\nThe orange chicken was soggy and tasted pretty awful.\nThe soup dumplings fell apart and had no soup inside at all.\nI ended up just not eating most of it and throwing it away.\nDelivery was also very slow and took more than an hour. I will never try this place again.", "author": "John K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-09", "description": "We are from out of town and used UberEATS to order food from this restaurant. Unfortunately, that was a mistake. The hot and sour soup was orange in color and covered in grease. The soup did not taste anything like the traditional hot and sour soup we are accustomed to eating. The pork fried rice was very bland and the majority of the pork was soft, gelatinous clumps of \"meat\" that were inedible. My daughter ordered vegetable noodles which were greasy. The vegetable pot stickers were the only item we ordered which we actually ate. Our order of pork pot stickers never made the delivery bag. \nWe did receive a refund for the pork pot stickers. \n\nSo although other reviews state the food here is good, our experience was not a positive one and we probably wouldn't try this restaurant again. Maybe it was late and an off night.", "author": "Karen D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-26", "description": "Ordered delivery. The food was okay but was kind of soggy. The beef quality and flavor on the Mongolian beef was better than the rest of what we got.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-17", "description": "The pork and shrimp won ton were not bad at all--the dipping sauce however was a bit bland.\n\nService was great and there are many items to choose from on their menu.  We opted for the House Special Combination Rice Noodle and a chicken/broccoli dish with rice on the side.\n\nPortions are generous but we felt that both dishes were lacking in flavor--especially the rice noodle dish.    I would like to return and try other dishes.\n\nSapporo and Tsing Tao were our choices of beer.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "This place is awesome. Everything is so good! I usually order Mongolian beef, chicken fried rice, and spicy eggplant! The owners are super friendly and the inside is clean. Best Chinese food in the City!", "author": "Josh W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-03", "description": "I'm probably writing this prematurely since we've only had their food once, by way of Amazon Restaurants because this place is way across town from us but we aren't real happy with the closer Chinese places.  I can't review all the dishes we ordered because I seem to have a few friends who don't understand what \"family style\" means and ate a whole dish and didn't share.  What I did get to eat was fairly good.  There seems to be a trend with Chinese eateries these days to pile on the minced garlic, none of that nice subtlety of flavors blended together.  Mongolian beef was good but somehow didn't taste all that much like Mongolian beef, and I really miss those little white skinny noodles we used to get when we ordered Mongolian beef, wasn't very spicy either (but I didn't ask for real spicy, thought Mb was supposed to be spicy to begin with).  Same for kung poa chicken (or however they spell it), good but didn't really taste like kung pao chicken I've had in the past.  I mean, what I did get to eat was fine, not too greasy, not too bland, not too salty, quite good in itself.  They did deliver right on time, points for that alone, gave the guy a good tip for driving all the way over to us but probably can't afford to do that much.  Wish they'd had Chinese broccoli with oyster sauce on the menu because I really do need more greens in my diet.  It's better than what I can get in my neighborhood now, too many Chinese restaurants have closed up and left.  We don't have Chinese all that often any more but it's good to know this place exists.  Now, whether they'll deliver NOT through Amazon is the question, some places won't, which I find odd since they will through Amazon.  Oh, yeah, got a point for being open in the middle of the day, far too many eating places seem to close after the lunch rush and don't reopen until dinner, but I always want food during the hours those places are closed, sigh.  It's hard to live on a whole different space time continuum from everyone else.", "author": "Kai T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "I ordered takeout from this restaurant through delivery.com. The food came when and as promised. They even threw in some free pot stickers that I didn't expect. The delivery lady was very friendly. The food was good: i ordered various dim sum and two noodle dishes. All mildly spiced, but with spicy condiments. They didn't over salt the food. This place is a safe bet for Chinese food. Recommended.", "author": "THOMAS H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-15", "description": "Everything about this place is great but the food. People are nice, price is good, and take out is quick. The quality of the food varies a lot, and usually much worse when take out", "author": "Ramin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "This is my all time favorite restaurant in San Francisco. Highly recommend: lamb dumplings, bok choy, beef noodles. Also the \"mei li hua tea\" is everything you need after a long day.  Also service is unreal /  best people ever. Seriously dont leave SF w/o dropping by Makli!!", "author": "Ariel K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-01", "description": "Had a food poison after having a cashew nut chicken dish at Makli two weeks ago. I might be the unlucky one but seriously, such bad food poison never happened to be before. I literally vomited for two days and got dehydrated. Thankfully I was sent to the hospital in time otherwise who knows what would have happened. I hope this will draw the attention to the owner of the restaurant regarding the hygiene and food prep so that no one else suffers.", "author": "Luna Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Truly good food, good service, good setting. After a really bad experience at a nearby Chinese place, was really happy to discover Makli!", "author": "Gee H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "We've been getting takeout from here for years - we've never been disappointed! The food is great and delivery reliable and pleasant. A neighborhood gem!", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-03", "description": "Nah.\n\nFood was very mediocre. They didn't honor my check-in potstickers because I guess the lunch special is already a special so you can't double up on specials?\n\nVibe was a little cold and sports bar like.\n\nIt's too bad because the lunch deal is excellent. Maybe I'll be back again to try a different dish as my friend's soup was pretty good. But the general tso's chicken was some of the worst I've had and it shouldn't be that hard to make something dipped in batter, fried, and then covered with sauce taste good.", "author": "Adrienne R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-30", "description": "First off, I hate leaving a small business a poor review, this reflects that. \nSo, I've now learned don't order Chinese on a Monday.. Eric's. Eliza's and Tail Chi all closed arrrgh. \nMakli has a 4 star rating and are close by I'll give it a try.\nGood:\nQuick delivery, old school style.. they deliver it themselves.  one star\nOrder shows up and everything is there plus a bonus, an order of egg rolls I didn't order. 2 stars\nThe rice is good. It's white, hot, not overcooked, not undercooked. 3 stars \nBad: \nMongolian Beef: so salty it was inedible. Clearly the cap fell off while seasoning. \nGenerals Tsao's Chicken: Imagine some chicken surrounded by and undercooked (mushy, wet) old fashion donut then soaked in cheap, bottled, dinner hot sauce, yup, that's it. Inedible. \nPot Stickers: Tiny, flavorless and hard. Trader Joes frozen are better.. \nFried chicken flat noodles: bland but edible. \nThe star of the meal? The egg rolls, they were just fine should maybe take everything else off the menu and stick to them. \nAnyway there you go, one crappy review disguised as a three star so I don't feel guilty.", "author": "don l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "Delicious Chinese food at a reasonable price with very quick delivery. Highly recommended to those in the Castro jonesing for Beef with Broccoli.", "author": "Samuel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "Very healthy Chinese food and the waitress is very friendly!  We will definitely be back here and will probably start using them for takeout.", "author": "R C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Solid choice for Chinese delivery here in Castro. Staff is friendly and often, very kindly, throws in a free appetizer!", "author": "Jim B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-08", "description": "I've eaten here twice now.   First time I was disappointed with the orange chicken lunch special.   It was standard fried orange chicken with a very thin extra sugary sauce.  Zero vegetables arrived. The rice was good.  On my second visit, I went for dinner with friends and had cashew chicken which was enjoyable to eat, but I wasn't blown away.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-22", "description": "This is a review for delivery. We ordered over 60 dollars worth of food on Eat24. The portions were ridiculously small. Maybe they are better when you eat in the restaurant, but the delivery portions were borderline comical. For example, we ordered honey walnut prawns, the box was about the size of a can of spam and it contained only 4 prawns. We ended up having to order 2 additional dishes at a closer Chinese restaurant to shore up the tiny amount of food we got. We spent 15 dollars at the other restaurant and got almost the same amount of food.\n\nI edited the review to 2 stars because the food was actually good. The tiny portions just completely threw us off.", "author": "Mat K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "Delicious food!   Was quiet due to the Warriors game 4.   Calamari was soft and tender as it should.  Kung Bow was nicely spicy, could've been more for our taste but delicious just the same.  Generous portion!!  Mu Shu Pork was very tasty as well, and again, generous!  Had a glass of wine each, and you guessed it, generous.  Definitely a place to return.  Atmosphere is very casual.  I am sure they do big business in take out as well.  One word - Yum!  And really, I would give it 4.5 stars if I could.", "author": "Todd M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-13", "description": "Popped in yesterday when we tried to go to Kitchen Story for brunch and there was a half-hour wait. We were ravenous, so didn't see us hanging in there, so crossed the street and decided to give Makli a shot since it was a four-star Yelp establishment.\n\nThe aesthetic is much nicer than one might expect from the street. The server couldn't have been more pleasant. Some dishes (soups, potstickers) were above average. The prices were really good for the lunch special. The entrees were just okay. The Mongolian beef my friend ordered was tasty, not amazing... the chow fun I ordered was totally not chow fun like I'm used to. Much more like Filipino pancit. It was okay, but a bit bland, I really needed to spice it up.\n\nEnjoyable, but sort of non-spectacular. Cheap decent Chinese in a pretty room.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "This is my new favorite Chinese restaurant in the Castro. It's so good that I had to go back 6 days after I first discovered it. The mongolian beef and broccoli with mixed mushrooms are particularly delicious dishes, but everything was great. Also, it's cheap! You can split many, many dishes for the table and stay under $15-20 per person. \n\nDon't forget to check in and get your free dumplings.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-01", "description": "(TL;DR:  In the running for worst Chinese restaurant in San Francisco.)\n\nI have strong doubts about the veracity of the positive reviews for Makli, mostly because I am staring at our first order from this place, as I write this.  Here is the immediate truth:\n\n1.  The potstickers and dumplings are clearly packaged frozen potstickers, like you buy in bulk at Costco.  In fact, I suspect that these are literally Costco potstickers.  I could taste the freezer-burn, and they were not even re-fried.  The edges were untouched by oil or heat.  I have a strong suspicion that a microwave may have been involved, rather than a wok or fryer.\n\n2.  The sauce that comes with potsticker and dumplings is straight from a bottle.  It is highly acidic, but otherwise flavorless, and it does not in any way complement the frozen potstickers/dumplings.\n\n3.  The Kung Pao chicken is just plain off--it even smells bad.  The chicken has been over-\"velveted,\" so it tastes slimy (also suggests that it may not be fresh chicken).  The sauce looks and tastes like it was slopped straight out of a restaurant-supply vat, with no additional spicing except red pepper.  The vegetables are potentially also from frozen, given that they have little to no taste of their own.\n\nHow a Chinese restaurant this bad could possibly survive in San Francisco is beyond me, much less how it could average 4 stars here.  The food looks and tastes like every possible corner was cut, to make it as cheap as possible.  I would be disgusted if I saw this order arrive in a strip-mall Chinese restaurant in Nebraska.  \n\nI pray that you find your way to this review, before taking a risk on ordering from this bizarrely terrible place in the Castro.  I apologize for writing so much and so passionately, but it really was an appallingly terrible dining experience that I hope no one else ever has to share.", "author": "Badunc D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "We love makli! We always order their delicious wonton soup and really the best one in sf, for delivery and they're always early and super friendly!", "author": "Iris J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "This restaurant is killin' it with their awesome dishes and super high value food.\n\nThere's tons of variety, everything tastes great, and the food is served in generous portions. I came here for dinner and ordered the mapo tofu clay pot, cod fillets with black bean sauce, fried salt and pepper cod, and shrimp and pork dumplings. The entrees were all in the $10-13 range (yes, fish at that price), the dumplings were $6, and this all came with a heaping portion of white rice that never seemed to end. They also serve free oranges for dessert, which are cut nicely and super fresh!\n\nFood-wise, if I really had to pick at issues, I'd say the fried salt and pepper cod was a tad on the salty side, but it's no problem at all.\n\nLastly, the service is terrific and ambiance is not bad - standard for a Chinese restaurant and I'd say the seating is quite spacious, probably because there weren't many people around during dinner. Why this is, I have no idea since it's soooo awesome, but I'm planning to visit as many times as possible before it gets flooded with customers.", "author": "Amy G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-13", "description": "We had guests over for Sunday dinner to watch a TV show tonight and everyone left with a terrible stomach ache after we got delivery from Makli! We had two orders of the General Tso's Chicken thinking it'd be decent and we wanted there to be enough to go around but we had over one full container left because no one liked it. It was all mostly mushy breading with lots of pieces with no chicken inside. One guest even asked if it really was chicken because she swore it was fish because the inside was mushy in texture and fishy in flavor. The honey scallops were a joke...people laughed because there were like a total of 7 tiny gum-drop sized scallops swimming in soy sauce. The dish was like $12. Mongolian beef was crazy salty with thinly sliced green peppers that were so wilted from being drenched in soy sauce. Seafood clay pot had so many broken pieces of bean curd, it looked unappetizing and was overall not tasty...just seemed not freshly made compared to other restaurants. Had other unmemorable dishes like bok choy. Normally when we order Chinese takeout we have very little leftover but this time people didn't eat much. Won't be ordering again from here. Don't know what happened given the high reviews!", "author": "Elizabeth D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-01", "description": "The food I just had delivered is not ettable.  every dish tasted only of salt and had no other flavors.  I don't knoe how this recieved a 3 star or above, they must all be white (I am white but know good Chinese food).  The only good thing I can say about Makil is the delivery was fast but the food was disgusting.  People with taste must not leave Yelp reviews.", "author": "Sally Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-15", "description": "Ordered delivery for the 2nd time and I think this will become my go-to Chinese delivery place. Friendly delivery and the food is spot on. Items I liked:\nFried Radish Cake \nSeafood Combo with Fried Egg Noodle\nChicken with Orange Sauce\nFried Green Beans\n\nWasn't a big fan of the red bean dessert nor the hot & sour soup, but that seems to be really popular amongst Yelp reviewers.", "author": "cassy f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-13", "description": "Situation\n- Delivery on a Sunday night\n- Ordered General Tso's Chicken and Sweet & Sour Pork\n- Ordered a couple sides of rice\n\nPros\n- Quick delivery\n- Both the Chicken and Pork were cooked well and tasted nice\n\nCons\n- The rice was okay", "author": "Dipesh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "Totally fine. Prompt, efficient take out. \nTastes quite home-made. The rice is somewhat bland though.", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "This review is for delivery only. I have not dined in at the restaurant, yet.\n\nLet me start by saying I'm Chinese and don't particularly like Chinese food, but I do have some staples I occasionally crave. Please, no judgments. =) This place has changed my mind. Delicious, on time, cooked very well. They have also paid attention to all my picky special instructions and have made it happen. I definitely recommend the Seafood Combo with Fried Flat Noodle and Egg Bean Curd with Tender Greens. The sauce for the egg bean curd can be a bit salty though, but good with rice. This is definitely my go-to spot for Chinese food.", "author": "Evelyn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-06", "description": "Normal Chinese cuisine, not bad but not fantastic. The broccoli and mixed mushroom is good. Eggplant with garlic sauce is too sour.", "author": "Shuo Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-08", "description": "I was enthusiastic after reading the positive statements like \"best in Castro\" etc. \n\nThe Good\nOnline delivery worked really well. They have a wide range of vegetarian options.\n\nVeg. Fried rice was ok and I'd order that again. The veg. Chow Mein was pretty good. (veggies were over cooked)\n\nThe Bad\nFood descriptions were pretty bad. People want mushrooms not black fungus. Subtle, but for a lot of westerners, black fungus sounds like black mold or something.\n\nThe Ugly\nI ordered hot and sour soup and it was easily the worst I've ever had. It might have been the main chef's night off, I don't know how to explain it. It looked right, but tasted awful. It was very spicy, which I love, but it tasted like I was eating a bowl of thickened white vinegar. I tried to get into it, but got about through have a cup and tossed the rest in the trash.\n\nEven worse were the veggie potstickers. I don't really know what what these were, but they tasted like over microwaved, dried out rubber balls. The flavors were bland. I literally could only eat one and tossed the rest out.\n\nI threw out half this food because it was inedible. Do yourself a favor and get your chinese delivered from elsewhere.\n\nMessage to Makli - you've really got to up your quality and make sure that you take more care in preparing your food. I'm angry that I threw out $20 worth of food.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "Makli gets the stars from this girl! The mooshu pork is the bomb. The bomb.com. \n\nThe service is fast once ordered, but other than that, meh. And you could stand to vacuum. \n\nBut the food is legit when you order saki.", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "Finally a Chinese delivery that is flavorful! Tried the orange chicken and General tsaos chicken and both were flavorful and the breaking was crispy under all the sauce.  The only thing is the pieces were a bit large if you like that. We also had the sweet and sour pork which was good and the vegetable jalapeño fried rice which was flavorful but not really spicy- it had very few veggies- some small carrots, peas, cabbage (and onion I think) and small pieces of jalapeños. They got our order wrong and omitted the white rice and we got charged $1 otherwise I thought it was very good", "author": "Piper W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-11", "description": "this place sucks. Portions are minuscule and so barely basic in terms of quality.  I didn't recognize most of the food, it was so processed, freeze dried and reconstituted.  What a rip off. (Ordered home delivery: hot and sour soup, veg pot stickers, tofu/broccoli \"special\", General Tso chicken, salt and pepper calamari.)\n\nNot kidding. Even the tofu only was half cooked.  How do you DO that and still pretend to be in the restaurant business?", "author": "Lavinia F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-06", "description": "The atmosphere can be a bit loud at times and unfortunately some of the waitresses do not understand or able to communicate in English.\nHowever the food is great and the portions are large.\nAnd the pricing is reasonable for what you get.", "author": "DJ S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "Usually when I crave Chinese food, I just want something salty. Makli has an ENTIRE section of their menu dedicated to \"Salt & Pepper\" foods. Major applause from me.\n\nMy friend and I came here together, and our experience started off with hot tea... served in a beer mug. It was the blooming tea kind, so that was pretty amusing before our food came. That and the giant TV with the sports channel on. Even more win.\n\nWe ordered the Shanghai Soup Dumplings ($6) which comes with four dumplings, but they were ALL super disappointing because there was no soup inside! The dumplings were poorly made and it just felt like I was eating soggy potstickers. The Salt & Pepper Fried Cod Fillets ($9) made up for it, though. YUM! It's topped with jalapeno slices and goes well with the white rice ($1) which by the way is a good amount for 1 or 2 people.\n\nOur main entree was the Singapore Style Chow Fun with prawns, barbecued pork, and vegetables. The flavors of this dish were super on-point, and I would definitely get this again. When our check game, it was accompanied by fortune cookies and green tea ice cream. What a delightful end to any meal. Great experience, and I'm glad my friend introduced me to this place!\n\nEDIT: Their hot & sour soup is really good... so is their Beef Chow Fun!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-11", "description": "This place has an incredible lunch menu. I stop by often as I live only a block or so away, and I must say that it is great food at a very reasonable price. \n\nFor lunch, they have $8 plates -- and $10.50 combo specials. The combo special I ordered included hot & sour soup, 2 vegetarian spring rolls, and a hearty serving of General Tso's Chicken with two scoops of white rice. \n\nThe soup is incredible - just what you expect from Hot & Sour soup. Definitely on the hotter side, but I enjoy a good kick. The spring rolls were forgettable and are the same kind that are offered across various Chinese restaurants across the city. Nothing special there. \n\nThe General Tso's was great. Good sauce, crispy, and not too much breading. \n\nOverall, highly recommend this place for a nice, quiet lunch!", "author": "Mike D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-30", "description": "Delivery took forever... Food was cold and egg rolls were soggy.", "author": "Vaneesa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "The noodles here are amazingly good -- this is not your average corner Chinese lunch place. I had beef chow mein, potstickers, and seaweed salad and loved everything. \n\nLife is too short to eat bad Chinese. This place makes me happy.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "My wife and I have visited here several times for lunch and my wife enjoys carry out during the week. This rating is based on value money. This is a very understated place with a large television. The staff are always friendly and I always leave with with a satisfied feeling. We tend to gravitate towards the orange chicken and cashew chicken. Probably the best test of a restaurant for me is my willingness to return. I'm glad this place is in my neighborhood.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "I have ordered delivery from here many times. Compared to other options for Chinese food this place is a little bit more expensive but the quality is higher and IMO worth the price. For example the potstickers, compared to offerings from other Chinese restaurants, is not heavy on the dough and is instead lighter but still crispy.", "author": "Henry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-09", "description": "Service was great. Was sat immediately. The lunch special is great anyone on a budget. Roughly 12$. includes entree, rice, pot stickers and hot n sour soup. Food was great. Not the best in the world. But nothing to complain about. I'll be back forsure", "author": "Tj P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-06", "description": "I really want to give this place  4 stars, because when they're good, they're 5-star good. Their restaurant staff is very nice, and they always deliver on time. \n\nThe problem is with their consistency. It doesn't vary from night tonight, or delivery to delivery; it varies among their menu items. Their lamb dumplings are so amazingly good. They are The one thing I order every single time, regardless of whether I'm dining in or ordering out. I enjoy their kung pao, and their chicken with cashews. And I love that when I order of wonton soup, it comes with deliciously crunchy snap peas, instead of some of the mushy, wilted vegetables you get at other restaurants.\n\nOn the other hand, there are some things that are just so disappointing. The pork and cabbage buns were not steamed enough, so the dough was very very dry. They tasted like your run of the mill mass-produced bao you'd find in the 99 Ranch Market freezer section. General Tso's chicken was also disappointing. The batter was more tempura style then the crunchy chicken coating I enjoy at other restaurants.\n\nI will still return to try other things with the hope that I will want to order them again instead of mentally filing them away with the lackluster stuff.", "author": "Michele W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "Any and all dumplings or pot stickers are a must have. The pork pot stickers were crispy but not oily, and the pork was delicious. The house made sauce for dipping added a great flavor. We also had the veggie fried rice - so simple but more flavorful than any Chinese I've had. \n\nThe atmosphere was casual but nice, I went when there was only one other person and so it was very quiet. The service was fast and efficient, he made sure we had everything we needed but was never a bother. \n\nAs an aside, the bathroom was very clean. I've been to quite a few restaurants in this area and cleanliness isn't always the case.", "author": "Kelly N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-03", "description": "This place so bomb! Food always arrive early or on time, The driver greets you very politely upon delivery.  I have order mostly there fried dishes and dim sum since its the only spot that does dim sum delivery. Only problem is that the quality and quantity of the dim sum dishes you can get at china town for cheaper at the same quality but more quantity. \n\nOverall great experience and will order again! Love how they give you chopsticks instead of spoon and fork!!", "author": "Tri N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-20", "description": "OK, so I took a chance since I didn't feel like cooking. Dim sum sounds good, close to home, quick delivery. Decent prices. 4.5 star rating on Yelp. Cool, I'll give it a try. Ummmm....bad idea!\n\nTheir pot stickers are frozen and overcooked & steamed shanghai dumplings were undercooked...like , RAW PORK. I'll probably be sick tomorrow. The general's chicken was like chicken doughnuts in spicy maple syrup. I think I'm gonna go try to purge the disgusting food I just ingested, but I wanted to get this review up first so that nobody else makes the mistake of eating at this place.\n\nYUUUUUUUCK.", "author": "Teo C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-08", "description": "Ordered delivery based on the other 4star reviews. \n\nI think the best tasting dish we had was the steamed white rice. \nOrdered green onion pancakes. Decent but not memorable. \nHot and sour soup - I think was made with ketchup! Literally. It's reddish orange in color and has that very familiar ketchup flavor. \nMushu pork was ok. Not much flavor. \nBeef and broccoli - disappointing. Very poor quality ingredients in my opinion. \n\nHad high hopes. Wish it had been a different story.", "author": "Ed P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-09", "description": "Great neighborhood spot for Chinese food. The food is very authentic style, but very fresh as well. We ordered broccoli beef, general tso's chicken, combination fried rice and used the Yelp check in for free pot stickers. All of the dishes were delicious. The fried rice was delicious and very flavorful with big beautiful shrimp. My favorite dish was probably the broccoli beef. The sauce was delicious and the broccoli was perfectly cooked (still slightly crunchy). \n\nThis is now our new go to spot for take out. It was easy to get a table, and they also have a great online order system on their website. They also have beer, wine and sake. Hopefully they are able to get a good customer base going and build their business. They have a great menu and all of the food is delicious.", "author": "Juliet S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "My neighborhood go to. Great and authentic Chinese food. Not too oily for Chinese food either. The staff is really friendly and the prices are affordable. My favs are the soup dumplings, general sao and the BBQ pork fried rice. Haven't had a bad thing here! Must give it a try!", "author": "Anne P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "Great. Exactly what I want when I order Chinese delivery. Excellent hot and sour soup. Yummy pot stickers and BBQ pork fried rice. Ordered Kung pao chicken \"spicy\" and Mongolian beef \"medium\" and they were both about the same amount of not very spicy so you don't have to worry too much about too spicy being a problem.  Maybe try \"very spicy\" option if you must have it hot?  Loved the veggie options as sides (mushroom & broccoli, green beans) Food arrived on time and still fresh and hot.", "author": "wendy m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-08", "description": "Non greasy,  mostly authentic Chinese food. The portions are kind of small but I appreciate a good non orange chicken Chinese restaurant.", "author": "Grace C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-17", "description": "I am at a loss as to how they received so many great reviews. \n\nI had delivery, so I anticipate a degradation of quality, so no knocks there. \n\nBut even the rice was inedible. \n\nThe hot and sour was awful. \n\nMongolian beef was boiled like beef substance with some scallions. Mildly acceptable. \n\nThe cod was tasteless. \n\nThe chow mien was vile. \n\nI can only assume they purchased their rave reviews. Because the difference between what I received and what everyone else said was just too extreme.", "author": "Tom T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "Went to Makli randomly (originally were planning to find a Japanese place), but we were very pleasantly surprised at what we found.\n\nThe menu is rather extensive but we ordered our usual Chinese favorites: Mongolian beef, chicken chow mein, shrimp fried rice, and wonton soup....we also scored some free pot stickers because of my Yelp check in :).  It came to about $40 with plenty of leftovers.  Everything was delicious and tasted authentic and light, not greasy like so many other Chinese restaurants.  \n\nThe restaurant is nice, cute, and clean but only a couple other diners inside on a Sat evening (seemed a lot of people were ordering to go).\n\nThe service was impeccable as our server was friendly, and continuously attentive to our needs---we felt very welcome almost like we were in someone's home.  \n\nI will definitely be returning and will also be suggesting this gem to all of my friends.", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Some of the best Chinese food I've encountered in SF. Everything was on point from the perfectly crispy general tso's chicken to the amazing house combo fried rice with tender chicken. I will be back here!!", "author": "Todd B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "The people here is real nice, the seafood pot is delicious! If you want good service, come here!", "author": "Jing Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-31", "description": "Don't expect a positive review when the quote for delivery is 45 minutes and the actual delivery time is still unknown ... 1.5 hours and counting.   This is for my Mother's birthday and they have basically ruined it.   I would love to review their food but right now I can only close my eyes and imagine it.   If I can give a 0 star review I would.\n\nAmended to a three star review.  4.5 to 5 stars for the food to offset the delivery fiasco.   The spare ribs are excellent!", "author": "Aceman C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-15", "description": "I had the Kung Pao chicken and it was out of this world. Lightly breaded and quickly fried making it nice and crispy. \n\nAt first I wasn't sure of this place after I found it and then walked in. I am a picky eater and especially picky about chicken at Chinese restaurants. However, this place left me wanting to come back for more. If I were in San Francisco longer, I would be back here!!!\n\nYou have to try this place if in the mood for Chinese in San Francisco!", "author": "Kirby D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-19", "description": "We ordered delivery.  Potstickers (pork) and wor wonton soup were fine and more or less what we expected.  The sautéed green beans in garlic just okay.  The Mongolian beef wasn't good.  There wasn't much flavor in the sauce and the beef was too tender.  I know that sounds weird because tender beef is usually a good thing but the tenderness with this beef seemed low quality and artificial.  All in all the food was fine but I will try takeout from several other places before calling back.", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-11", "description": "Service very attentive. \n\nHot and sour soup thick and spicy and delicious.\nEggplant lunch special excellent. Ma Po tofu was fine. Not stellar.\nPot Stickers were really Gyoza, but they were good Gyoza so I was alright with that.\nXLB very good ( 4 for 6 dollars) and we got spoons/sauce for those without having to ask.\n\nOh yeah, and the waiter brought us a complimentary salad just to be nice. That was cool.  Formula 1 racing on TV which I secretly love, so that was fun. People waiting in line at Ike's across the street still hadn't ordered by the time we got our food....just saying. And I'll bet my lunch was cheaper too. Ha. \n\nI'll be back.", "author": "El B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-04", "description": "The positives: Ordering was smooth and delivery within 40 minutes. Easy to read computer printed receipt. Plastic lid packaging of food. Food orders were not bad. Tomato Beef Chow Mein was best dish.\n\nThe rest: Won Ton Soup was a bit salty and the preparation is different than options I'm used to in other places. Typically I usually order Pork Wonton soup where pork is separate from beef dumplings. Mongolian beef not very spicy and beef was not very good. \n\nTo summarize not a horrible experience but mediocre and for the expense of this kind of food these days I will not order twice from a place that is average at best.", "author": "Dale M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-22", "description": "The atmostphere was amazing. Great service andnthe food was perfectly cooked.", "author": "Mark-Anthony R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-14", "description": "Excellent Cantonese food! Hard to find in SF in general and even harder to find in the Mission/Castro! \n\nWe ordered the Clay Pot Bean Curd, Prawns with Walnuts and BBQ Pork Fried Rice.  The fried rice had really good \"wok hei\" (wok fire or char from the wok), their Clay Pot Bean Curd should perhaps be better described as Sizzling Hot Plate Bean Curd - it was nice and perfectly crisped on the outside and silky smooth on the inside.  Prawns with Walnuts - loved the candied walnuts and the well-executed deep-fried prawns coated with mayo.  (We were ordering to entice our 3-year old toddler to eat!) \n\nEverything was made fresh and was delicious!  Clearly an accomplished and experienced chef!", "author": "Nik T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-16", "description": "The Mongolian beef with veggie fried rice was actually quite nice. I ordered to go and it was pretty fast service.", "author": "Ayse D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Love that their delivery time was so accurate! Good food and they even threw in some extra potstickers. Appreciate that extra measure. Will definitely order again!", "author": "Adele T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "This place is a neighborhood gem.  The food is super savory.  Try the chicken with curry sauce or the Mongolian beef or general tsos chicken.  You won't go wrong.  The flowering jasmine tea is an amusement ride in its own.  The jasmine flowering in your the hot water is gorgeous.  If be remiss if I didn't mention the amazing sincere service.  The staff is so friendly and accommodating it's refreshing.  I left my coat at the table and the super sweet server chased me down the street to give it to me.", "author": "Tom F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "Very good and cheap chinese food (for lunch). We chose to come here over the place across the street. I can make good (enough) egg dishes at home for brunch, but not chinese food this good!", "author": "Tim V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "family own kitchen.\n\nBoth waiters and waitress are very nice here.\n\nFoods are good too.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-05", "description": "Food is good. I've only ordered for delivery and I can say the portions are a little small.", "author": "Arman M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "General chicken was delicious, try it.\n\nSautéed prawns with XO sauce which came with some veggies stir-fried in and peanuts on top, pretty good. Their deep fried walnut shrimp is tastier.\n\nThey have great Chinese food and need more business (location is historically bad), come support this local guy! Owner is super nice and great service.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-07", "description": "Came here after reading several positive reviews on Yelp. Severely disappointing, please stay away from this place.\n\nFirst ordered the Hot & Sour soup which can be best described as vinegar overload. The soup came right away which basically means it had been on the stove all day. And so much vinegar - couldn't taste anything else. \n\nThe veggie pot stickers were very average. Not worth the $6 definitely.\n\nFor mains, had the veggie chow mein, which tasted okay but was quite oily.\n\nThe vinegar soaked soup at the start ruined my taste buds, and didn't allow me to enjoy rest of the food which was average in any case.\n\nIn short, stay away.", "author": "Sumit S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-30", "description": "Solid option for affordable ($10-$12 per entrée) Chinese food. I haven't been blown away by the flavors but also never too disappointed. Best dishes I've had are beef and broccoli, chicken curry, and beef chow fun. The appetizer sampler and green bean side are also good. I had a better experience eating in the restaurant than getting takeout.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "Does anyone actually come here? I think they should, but they never seem to do so. I almost exclusively get the Singapore Street noodles.  They have never failed me.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "Went to Makli last night for a late dinner because I was craving soup dumplings. I found this place on Yelp and I'm glad I did. I ordered a cup of hot & sour soup, which was flavored perfectly IMO, and the soup dumplings whiz came 4 to an order. I also used the Yelp check-in reward of free order of pork potstickers. The service was prompt and attentive without being bothersome. The prices were very reasonable and I can only be disappointed that I did not eat more. The total meal, including the free order of potstickers, was only $10.88. Not bad at all. I will be looking forward to eating here again soon.", "author": "Scot S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "Excellent prawns with bok choy and the fried rice was superb.  Nice amounts of pork, egg and scallion without being oily at all.  If anything the portions could have been a little larger.", "author": "Aaron D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-03", "description": "Here's the situation: \n\nA Thursday night and I'm exhausted. I ordered food just as I walked out the door from work on my way home and exactly 45 minutes later, my food arrived at my door! My EAT24 app was solid. That's where the impressiveness ends.\n\nI ordered the Veggie Chow Fun, Walnut Prawns, and a side of rice (just to meet the $20 minimum). I didn't give it much thought when I ordered the Veggie Chow Fun because at every other place I've gone to (and from growing up eating home cooked Chinese food), chow fun entails thick cut flat rice noodles. However, at Makli, chow fun means thin rice noodles. Granted, they do have a description on their menu, but please rethink this and maybe change it to match the actual meaning of chow fun -- it might save some of your customers a bit of disappointment. The Veggie \"Chow Fun\" was average. Nothing special, with an assortment of water chestnuts, broccoli, and baby corn. The Walnut Prawns was also just okay. Nothing bad, but nothing impressive either. A solid serving of sweetened walnuts accompanied 10 lightly fried shrimp coated in a sweet mayo based sauce. The side of rice was a side of rice, as expected.\n\nWould I return? Probably not because when I'm craving chow fun, I expect the traditional thick cut flat rice noodles I'm used to.", "author": "Leana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-01", "description": "We ordered a delivery of chicken egg fried rice, orange chicken and green onion pancakes. The delivery time said 45 mins but the food arrived promptly probably in less than 30 minutes. The food was delicious! Some of the best Chinese we have had! It wasn't oily, the orange chicken was crispy and perfect, fried rice tasty and not oily. Best chinese delivery.", "author": "Subhadra D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-19", "description": "I absolutely love Chinese food. What's not to love right? Then why is it so hard to find decent (and here I mean edible) Chinese food in the United States. Most of the time despite my best efforts the food just fails. It's either overcooked, undercooked, or swimming in a greasy mess that is supposed to be called a sauce.\n\nIn comes, Makli in the Castro neighborhood. It's an unassuming place, and frankly you might walk right by this place without thinking twice. Pay attention people! This place is a gem for anyone who is craving a great Chinese meal. Best of all, this place gives you vegetarian options like you would not believe, including, vegetarian hot and sour soup. Yes, you read that correctly.\n\nOn my most recent trip to San Francisco, I was staying at a bed and breakfast just down the street from Makli. Hot and sour soup is a must no matter where I'm at and I have to say, Makli has the best. It's spicy hot and tantalizingly tart all at the same time. You won't find any better. The vegetarian lo-mein is just the opposite. It's warm with that faint smokiness you can only get with properly prepared lo-mein. The vegetables are seared and slightly charred and cooked to a tender-crisp perfection.\n\nThe next time you're in the mood for Chinese, get over to Makli. You won't regret it and you can bet my first meal back in the city will be here too. \n\nMy rating...4 Paws\n\nWith love from my dog bowl to yours....Happy eating.\nShatasdogbowl.", "author": "DJ S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "I had friends in from Florida this past weekend (Columbus Day); after an evening of drinks at Hi-Tops, we were starving and NOT looking at the (admittedly excellent) pub food at that bar.  Plus we wanted a quieter place to convo after the noisefest of the NY Giants/49ers game (GO GIANTS!).  I mentioned a craving for Chinese, and as we traveled just around the corner from Hi-Tops, the Makli sign popped up in our faces.  I'd never been.  WHAT A FIND!!!\n\nFirst off, the young wait staff was very pleasant and attentive.  We ordered pork & chive pot stickers -- they were quite good, and not *HEAVY*.  For entrees we ordered a staple, House fried rice (the quality of which I use as the benchmark to all Chinese restaurants).  We also ordered orange chicken, and beef with green beans.  The fried rice was phenomenal:  fresh, FLUFFY, and with just enough of all the requisite meats, NOT sopping in soy sauce and NOT greasy; it was practically perfect.  The orange chicken was delightful: crispy with a LIGHT batter crust (NOT a dough ball), decidedly chicken-dominent, and NOT soaked deep in the sweet and sour sauce and certainly not greasy; in fact, the sauce had a nice, spicy hot kick to it.  The beef dish was also very good; the generous amount of meat was fresh and tender, as were the accompanying greenbeans; the dish was prepared with a fish sauce, which while not a personal preference of mine, met with the approval of my friends.  For drinks, my friends had beers while I had a hot tea that came with a lovely blossom in the glass -- flavorful.\n\nFinally, a word about the staff:  we arrived for dinner late in the evening, and notwithstanding that, they were very kind and in no rush to close and pressure us out.  Adding to that, the cook staff prepared our meals with the care that could have easily come at the middle of the day, again not rushed and sloppy.\n\nI will DEFINITELY be back, and I know when my friends come back to SF, Makli will be a regular part of our routine enjoyment!", "author": "Gabe K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-12", "description": "Fairly good. Chicken wasn't what I hoped but the Mongolian beef was great. Good delivery and it was much faster than I expected.", "author": "Zac B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-10", "description": "Why is no one raving on the chicken wings?????? I don't think they're on the menu, but the fried chicken wings are SOOOOOOO GOOOOOOOD. You might as well ask for two orders, if you are going to share. So crispy and tender inside. Smothered in fresh crispy jalapeno peppers.\nI notice they recently finished the outside of the building. This should definitely attract more business, but I would love to keep it secret . Very clean looking and simple charming decor.\nThe staff is super nice.", "author": "Miz E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-07", "description": "Great find hidden in the neighborhood. We had the won ton flat (rice) noodle soup, pot stickers, and some egg tarts. All of which was tasty, but I'll definitely be craving the won ton soup again! Delicious noodle goodness. :) Thanks!", "author": "Ken K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "I love this place. They're located just up the block from my apartment so my roommate and I order from them quite frequently. Some of our go-to's include:\nChicken with Orange Sauce\nGeneral Tso's\nHouse Combo with Fried Rice\nNapa Cabbage and Pork Dumpling\nChicken with Lettuce Cup\nEgg Custard Buns\n\nMy only request would be that they get some better lettuce for the lettuce wraps - sometimes it is hard to actually make a wrap with it. Other than that, everything has always been great! Definitely the best Chinese delivery in the neighborhood!", "author": "Sig S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "This was my first time ordering from here and I got delivery via Eat24.  I ordered Green Onion Pancakes, Veggie Dumplings, Eggplant in Garlic Sauce, Deep Fried Tofu, and Taiwan style Sweet Red Bean Cakes.  \n\nTo describe the food in one word: Unique.  The green onion pancakes are dense and spongy with great flavor.  The veggie dumplings manage to be firm yet delicate at the same time.  The Eggplant came with delicious vegetables including black fungus which, as someone who cares about understanding the food I eat *cough*, was enjoyable.  The Deep Fried Tofu had the perfect balance of a crispy outside with a tender, spongy inside.  The Taiwan-style red bean cakes were nice and warm with plenty of red bean filling!  \n\nThe delivery was prompt and the gentleman who delivered was extremely polite and happy which also put a smile on my face. :)\n\nLong story short, this is my new Chinese delivery spot.  I'd love to see a tofu/wood ear fungus dish someday!", "author": "Navi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "I have really enjoyed this restaurant.  I've had delivery twice over the past 5 days. The quality of the food is good and the delivery was fast.", "author": "Mary Ann J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Makli is a real gem. My wife and I try to come here at least once a week, and it's delicious every time. The Hot And Sour Soup here is the best I've had in my life and it's worth coming just for that. The General Tsao's Chicken and the Chicken With Orange Sauce are both excellent; not overly sweet like a lot of places, but tasty and with the perfect spice level. I'm also a big fan of the Mongolian Beef and the Kung Pow Chicken. Or really anything else on their menu, I've never had a bad dish here. My only complaint is their pot stickers are the same small little things you find at a lot of places, though Makli does have their own unique sauce that helps. But they also have plenty of other appetizer options, including dim sum dumplings that are pretty good. And of course you can always skip the appetizer in favor of more hot and sour soup :)", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "Yummy place. Quick and nice service. Good prices. Phone number on yelp and on printed take out menu is wrong so I had to walk in. I was just provided with the new one by the nice cashier lady : 415.728.2872 ( hope it's the right one this time - haven't tried it yet )", "author": "Zita M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-12", "description": "Order took close to 2 hours. Delivery guy was lost, came by foot and couldnt understand directions. Food arrived cold and some of the order was wrong! I called to try sorting it out because obviously we got part of someones order and vice-versa however, there was no one at the restaurant I could speak to that understood what I was saying.\nNightmare order.", "author": "Alexandra O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-12", "description": "I ordered delivery from this place and it was a nightmare! I ordered and it took more than an hour and a half for the food to be delivered. I called and tried to ask about where my order was and got hung up on multiple times. Once my order FINALLY arrived, it was wrong. I was missing an appetizer and they gave me a random fish dish that I did not order. Overall, terrible customer service, and mediocre food.", "author": "Carolina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-26", "description": "Tasty fresh Chinese food at a very reasonable price. We were surprised how quiet the restaurant was but couldn't complain! A great find.", "author": "Tony P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-11", "description": "I really wanted to like this place, because they have egg tofu (a popular dish in Beijing known as 日本豆腐) -- I've yet to see this at any other Chinese restaurant in SF. I ordered that, the shrimp dumplings, fried rice, and the veggie noodles (with an explicit callout to use a veggie broth, not meat). The egg tofu was good -- and if I'm craving it, I know where to get it now, but the rest was medicore at best. The shrimp dumplings were really tiny and not as flavorful as some other delivery dim sum I've had. The fried rice was cooked in consistently, and I got a chunk of something that I'm pretty sure was MSG. And the veggie noodle soup started off fine (albeit not amazing), but then I found a piece of meat!!! :-( That's unacceptable when ordering a veggie soup with a note to use veggie broth. If it wasn't possible, they should have called me or just taken it out of the order and adjusted the total.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-06", "description": "I really didn't care for my delivery for Makli. \n\nThe Kung Bow chicken was too slimy, too heavy on water chestnuts (maybe that's just a matter of personal preference, but we're talking 1:1 chicken/chestnut ratio), and over-salted. \n\nThe Combination Fried rice was short on flavor, and seemed like something I could have whipped up at home. I had to fish through the bits of pork to find good ones...there were lots of fatty bits. \n\nFinally, the chive-pork dumplings were pretty slimy and the dipping sauce was over-vinegary and clashed with the dumplings.\n\nI am being generous with stars because the delivery was prompt and friendly and the price was reasonable, but I won't be returning soon.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "I can't say enough about this place. I almost don't want to leave a review because I like to keep it my neighborhood secret, but I also want to make sure they succeed so here I go.\n\nI'll keep it short:\n\n- Soup Dumplings are a must\n- Mongolian Beef rocks\n- Chicken and Chive Dumplings are amazing\n- General Tso's is not too fried and high-quality chicken\n- Service is fast and fantastic\n\nIf you're looking for chinese and live nearby, there is no other option.", "author": "Pete W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-30", "description": "Awesome little gem, my husband and I inevitably get food from here at least once a week.\n\nThe owners are super friendly and always accommodating - even for our post-wedding brunch that I didn't have a count for (\"I don't know how many people it will be...\" = \"sure!\"). The space is always clean and nice. The food is reasonably priced for the area. Lunch specials are pretty cheap for the amount of food you end up getting. The fresh dim sum is a welcome addition to their menu since they first opened. Hands down the best hot and sour soup I've ever had in my life.\n\nI'm gonna cry with Matt S. if this place goes out of business because it's perpetually empty. Red Jade and others nearby are just okay, and there's no way they compete on the same level with the soups and half the dim sum menu to start with. Plus it's so nice to interact with friendly people! Totally worth the visit.", "author": "Jane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "Great hot and spicy soup. The spring rolls were fresh and crunchy great flavor. Pork pot stickers were very tasteful too. Kun pow chicken and Mongolian chicken fried rice were delicious. Will definitely come back. Service was excellent and friendly.", "author": "Xousaen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-19", "description": "This place is fine, with friendly, run of the mill Chinese food. We ordered through Eat24 and had a pleasant experience: the delivery came within the window specified (perhaps because we live in the Mission and it should be a general rule of thumb to never order outside a 2 mile radius) and the food was hot.\n\nGeneral Tsao's chicken: sweet, almost like orange chicken but tasty if you are into that sort of thing. \nMongolian Beef: lots of cornstarch (hey- thats what Chinese food is generally like!) but tasty. \nSteamed pork bun: dry, but probably because it is made early in the day (dim sum is traditionally a breakfast/lunch thing) but flavored normally.\nSingapore chow fun: delicious, with dry curry (not a curry sauce) that was a perfect vehicle to the other dishes.\n\nOh- and their spicy sauce is great! I believe its what most places serve as sides including R&G Lounge. \n\nI will check out other places before ordering here again but overall, its fine and probably worth going in and experiencing it at the restaurant.", "author": "Ashley F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-25", "description": "I had the lunch special. It included house combination fried rice, potstickers, and hot & sour soup. It was plenty food for only one person. I was able to take the rest to go. The only downfall was that the combination rice had like only 3 shrimp. But otherwise the service I received from the young lady there was good. I was able to have a fulfilling lunch and catch highlights on ESPN on their big screen tv. I would go back.", "author": "Theresa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-03", "description": "I've been here twice to eat in and had good experiences both times. I love dumplings and the dough has a good consistency and  sufficient filling. The fish clay plot had good flavor. I have also tried the salt and pepper fried tofu, which had good consistency and enough scallions and hot peppers to make it a bit interesting. I haven't seen many dishes with black bean sauce in SF, so I tried the cod in black bean sauce. I was pleasantly surprised by the kick in the flavor, which was offset by the sweet bell peppers. It was totally unexpected and quite delightful. \n\nThe service is pleasant and they seem to get a fair amount of take out business. It's very nice to have access to good Chinese food in the Mission Dolores/Castro area.", "author": "Ellen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "Welp, I've gotta say that this might be the best chinese delivery we can get in the Castro.  Food arrived about 20 minutes after I called it in, the person on the phone understood me for the most part.  He had troubles hearing my address, but heard my order perfectly fine.  I'd say the promptness in the delivery plus having someone understand my order gave it an extra star.  Food is cheap and tasty, can't really ask for more than that.\n\nThe salt and pepper fried dishes were great.  Very tasty and although salty, wasn't unbearably salty.  This might be a regular delivery order for us when we are too lazy to cook.  Pretty rare in this town to get good food delivered in less than half an hour.", "author": "Quang N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "Came here twice. Both times got dumplings since they have a good selection. The pork and chives dumplings are pretty good. As are the pork and cabbage ones. The lamb one was less satisfying since the cilantro did not stand out. Hot and sour soup was spot on. Will definitely come back for more dumplings here.", "author": "C C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-10", "description": "Very convenient ordering with quick delivery. Very lean meat, lots of fresh veggies, and not greasy at all! They are a bit pricey, but you get what you pay for.", "author": "Jessica J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "I ordered Eat24 delivery and thought it was good! The food ended up arriving 10 minutes early and was perfectly warm. I have been wanting to try this place for a few weeks now and I'm glad I did. I would order here again or go in person too.", "author": "Elaine C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-22", "description": "\"Thick broth cooked with shredded pork dumpling and vegetables. Served in a bowl.\"\n\nTo my surprise, the dumplings had massive chunks of shrimp... And I'm allergic. FANTASTIC.", "author": "Simon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "I've been here at least a dozen times since it opened, and while it's nothing to write home about, I am always happily full when I leave. The best things here, in my opinion, are the dumplings, the scallion pancake, and the chicken/corn soup. I've tried some of their meat/veggie + rice dishes, and they were kind of greasy-yet-bland, as well as overpriced. But I find that the dumplings keep me coming back, and the service is friendly and pleasant despite significant language barriers. I'm glad this place has survived this long.", "author": "Maryam M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "So gooooooood. Had veggie chow mien and cashew chicken. So yummy. Really appreciate the jug of water after a long day of pride. I would say go here and give them more reviews. They deserve it. And they deliver.", "author": "Taylor T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-11", "description": "Got general tsos chicken. Not particularly good. Was not crispy on delivery at all. Sauce not much flavor and there was not any that war not in chicken. Chicken not colored red from tso sauce. Hot and sour soup was very sour and a good amount of heat though. Pot stickers were ok.", "author": "Silver T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "Delicious Chinese and exceptionally friendly staff! I recommend the black bean cod, really tasty!", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "The lunch special is great! It's cheap, plentiful and reasonably tasty. But it's been empty a lot. People seem to want to go to Ike's or Kitchen Story across the road. \n\nYou guys should really support this place! The people are nice and the food is good. Share the love y'all!", "author": "Shankhayan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "Better Chinese food than most places in Chinatown, and great prices but surprisingly few customers", "author": "Michael D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "It's all good, ladies and gentlemen. Real good.\n\nComfortable space, spot-on service, clean, very reasonable. And the food! Well, the food is good plus. The dim sum collection is tasty and not greasy. The corn chowder is excellent. The entrees are good.\n\nSupport this gem in the Castro.", "author": "Richard B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "We ordered this place for dinner last night and it was really really good. The best Chinese delivery I have had so far! Here is what we ordered.\n\nHot & Sour Soup: Really good and onion-y. I enjoyed it, but you want it to eat this first if you have sweeter dishes. The flavor turned on me after 10 minutes or so. \n\nSpring rolls: the reason i did not give 5 stars. They were the frozen ones and not the good frozen. They were mushy inside. \n\nOrange Chicken and General Tso's Chicken: Both similar but really good. I asked for extra spicy orange chicken and they gave me a side of this really spicy sauce which i loved. \n\nAll in all, I will probably only order this place from now on because it was very tasty and all of the other places in my area (mid market) suckkkkkkk", "author": "Jazmyn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-16", "description": "Wow!!!  It was so delicious!  We ordered the Maggi sauce prawns and X.O sauce beef. The prawns were very fresh and crisped and the slice beef marinated with chef's special sauce was quite wonderful and tasty.\nA very excellent place for anyone who would like some Chinese food. We are sure to return again.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "This place is great after two fantastic delivery experiences. The food tastes great and my roommates and I all enjoyed it. Portion sizes are pretty average and the ingredients are fresh. The delivery is FAST. One time I ordered off of Eat24 and my doorbell rang 25 minutes later. How did that even happen?! We will definitely be ordering from here again!", "author": "Louise Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-10", "description": "I'm a huge fan of the menu here. The mixed drinks however were just so so. If you are going to eat here I would advise booking ahead of time as to not have to wait. This place is always very busy. Good stuff!", "author": "Joshua B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-25", "description": "We had never been it's new how bad could it be ?\nWe ordered 6 items yes 6.\n3 old friends....None of us can cook.....we are nice to each other..... and to strangers.\nBUT not so nice to restaurants.\nNot a complaint from the bunch HIGH PRAISE.", "author": "Roxanne Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "Wow, this place is great. Just had an amazing lunch. \n\nI was considering a sandwich at Ike's and the line was so long that I went elsewhere. For almost the same price as an Ike's sandwich I got a super fresh, hot, healthy, and delicious 3 course lunch. In a prompt, spacious, and unrushed atmosphere. \n\nThe neighborhood had better support this place! I've walked by a bunch in the past and it's often empty. Daimaru was here and went out of business. I'm now a supporter and evangelist.", "author": "Adam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "Found this place online and placed an order for pickup.\n\nLunch combination comes with a couple potstickers, a soup, and a main course - I got the house special fried noodles.\n\nThe hot and sour soup was excellent - tangy and a slight bit of kick to it. Potstickers were fairly dry and did not impress. The fried noodles hit the spot without feeling too oily or heavy.\n\nEverything is priced very reasonably on their lunch menu, I'd order from here again.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "Probably the best Chinese food I've had in a while. Ordered chow mein, fried rice, Mongolian beef, and orange chicken. Freshly cooked and delicious.", "author": "J N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "Best Chinese delivery in the Castro. Their House Special Combination Chow Mein is the best Chow Mein I've had. The fried rice is fresh and not too greasy. The Veggie Combo egg noodle soup has Ramen sized noodles, great broth and fresh veggies. Could not recommend more to have delivered to your door.", "author": "James V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "My favorite Chinese restaurant to get delivery. I can always be 100% sure the food will be on time and delicious.", "author": "Samantha K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "You guys need to eat here. The food and service are great but I've never seen it crowded so you better start picking up the slack. Some of the dishes are a little strange (the lemon chicken kinda tasted like funnel cake) but these have all been authentic and tasty:\n\n* all the dumplings and pancakes\n* cod in black bean sauce\n* eggplant in clay pot\n* chicken corn soup\n* pork fried rice", "author": "Matt S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "I've been to Makli several times and it was a great experience every time . Service and food were both 5/5. So many dishes to recommend but my favorites are the Mongolian beef and salted fish/diced chicken tofu in clay pot. You can't go wrong with either those, and you'll be back for more!", "author": "Ethan Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "I live down the street from Makli and it took me awhile to check it out.   Finally gave it a try and I am hooked.  It's my go to place for Chinese food in the neighborhood.   Tasty food, authentic dishes and the folks at Makli are really nice.   Oh, their pork fried rice is to die for!", "author": "G A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-06", "description": "really, so unassuming...kinda like that.\n\ntoo tired to fix food, too tired to walk to get it, and my handy (nod to German) is handy, and via seamless.com and a desire for comfort food, just not from this Continent...\n\nergo, Makli.\n\nI can walk the back alleys of Shanghai, I know Cantonese chow, and this place rocks\nsocks off!\n\nThe XO sauced beef is my new 'must have' favorite. So deep in flavors, so very, very good.\n\nPick any dumpling, we chose 4 and everyone was excellent, and we're talking Delivered Food here. Must be a knock-out live.\n\nso, genug, enough, stop reading, go eat here. 'nuff.\n\nEnjoy!", "author": "William M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-04", "description": "Solid Chinese food.  Great potstickers and Mu Shu.  The cod dish was bland, but overall, it was pretty good.  I'd eat there again", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-15", "description": "Really good lunch special you get a lot of food everything we had was flavorful and of high quality. Mongolian beef with spicy but good and the eggplant veggie dish was good but a little saucy maybe.\n\nLooking forward to using these guys for delivery since there isn't a lot of good delivery in this area.", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-21", "description": "I was compelled to write a review for Makli because their Lemon Chicken was the STRANGEST dish I've EVER tasted in a Chinese restaurant. The plain chicken breast is battered and deep-fried, then smothered in an intensely sweet, candy-like, bright yellow sauce. Sauce that seemed better suited atop ice cream, not meat. It didn't taste bad, per se, but it was certainly in no way typical Chinese cuisine.\n\nI think this dish can only be properly described as \"carnival fare.\" It's something I would expect to see served up next to some funnel cake, deep-fried Twinkies, and chocolate-covered bacon. Not with a side of rice in a Chinese restaurant! My friends and I were so confused (and intrigued) by this dish that we purposefully packed some of it up to take home and give to other people to try.\n\nEverything else we ordered was standard.\n\nOur party of three entered the empty restaurant around noon Sunday because Kitchen Story across the street was packed (as was probably every other brunch-serving establishment in the Castro). Our egg drop soup, pork dumplings, spring rolls, Yangzhou/House Special fried rice, and shrimp chow mein were all fine, though consistently underseasoned. Whether this reflects the chef's personal taste, or our fitness-conscious neighborhood's, I do not know.\n\nI give them three stars, because Yelp says that equates to \"A-OK,\" which describes my feelings perfectly. I was satisfied, and I got my money's worth ($8.95 lunch special).\n\nFINAL TIP: Be sure to laugh at the menu, which misspells \"Dumpling\" as \"Dumping,\" in every instance of the word. It's a tradition at this restaurant now: The couple that came in after us laughed at \"steamed dumping,\" too.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Didn't want to give this place a review because it is a hidden secret in the Castro.  I am picky with Chinese food and yes, this is not the best Chinese food around in SF but it is above average and better than decent in the Castro.  The dishes are authentic, but they can definitely do better with the potstickers.  I tried their Mae Po Tofu, eggplants with shredded pork, walnut shrimp, broccoli beef, minced beef and egg soup and other dishes.  The price is decent comparing to other Asian restaurants in the same area.  It is nothing fancy but comfortable. The lady server always tries to do her best to serve.  I've been there three times and will go back.", "author": "Sfscubaman T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "It's a very nice and neat Chinese restaurant. The food is amazing. I've been there many times. Salty chicken with tofu, Mapo Tofu, green bean, Scallop with sweet and sour source are my favorites.", "author": "Miya Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-05", "description": "Stopped in on a Wed at 5:30pm and it was dead. Got the codfish in black bean sauce and was very pleasantly surprised by the sweet red onion, the bell peppers and the slight peppery kick of the delicious black bean sauce. Their sauce is their strong point.\nI was also told that they use NO MSG!\n\nVery nice and simple. I added some ginger to it once I got home, on the side. \nI did ask the gal there what is their specialty and she said the spicy Ma Po tofu, so heads up, tofu lovers.\n\nPROS: Great pan technique and spicy kick; Freshly made and good sincere customer service. Much better ambience than Red Jade since it is far less busy and the food tastes much fresher. \n\nCONS: To-Go ware is the clear plastic kind that I always worry about, not the cardboard to-go Chinese food take out boxes that Red Jade uses.", "author": "Nan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-31", "description": "Haven't reviewed in a long time but this neighborhood, family-run business is worthwhile to do so!\n\nThe most authentic Chinese cuisine in the MIssion / Castro area.\n\nOrdered delivery twice and dined in once - service overall is always great (hot, quality food and great staff .. super hospitable). The restaurant itself is very welcoming with homey / quirky decor. The menu is extensive (dim sum, soups, usual entrees, etc.) so lots to try. Random note - their pre-packaged fortune cookies are always the freshest.\n\nDefinitely recommended for both delivery and dine in.", "author": "Ems K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "Best Chinese food in the Castro. They have really good General Tso's chicken. The decor is not great however. It could use some improvements, but the food is good quality. I've eaten there around six times. They have lunch specials also. Not a place I'd take people to because of the decor.", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-12", "description": "Great neighborhood option. Never busy, but the food is some of the most reliable Chinese I've had in the Castro. \nExcellent sauces have made every dish I've had here delicious. \nWill be going back often to work through more of the menu.", "author": "Q C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "I have ended my search for a great Chinese restaurant in the Castro.  Makli is my place now.\n\nI ordered Mongolian beef.  Superb.  It's literally all tender and deep flavored beef.  The flavor and heat level were perfect.  And just enough bell pepper and onion for some crunch.  But the dish is primarily large pieces of tender beef.", "author": "Mary H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "Good is fresh and staff is always friendly and serve with a smile. Lunch special is great value and I highly recommend.", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-22", "description": "Best Chinese Food In SF Bay Area!!! Awesome Service & Amazing Everything! Full Of Deliciousness On Every Plate!!! My Favorites Are Endless But I Can Not Resist Their Mouth Savoring Walnut Prawns & BlackBean Sauce CatFish!!! Don't Believe Me?!?! Try It For Your Self!!! You Can Thank Me Afterwards!!! :)", "author": "Lee A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-03", "description": "Shocked how gross this is! Just ordered delivery -- soggy eggrolls, mu shu crepes crumbled in my fingers, general's chicken is soggy fried fry with basically no chicken. There were exploded sauces all over the bag. The nastiest. There is still not a Chinese delivery option in SF unless you use Postmates. Just so gross you can't even believe it. We had one bite of everything and just threw away over $40 of food. How are they in business?", "author": "Laura W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-18", "description": "General Tso's chicken. Shrimp chow mein. Pot stickers.green onion pancake. This place smells wonderful when you walk in the door. Wonderful friendly service. Yummy fresh food.", "author": "Jane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "Makli is the authentic Chinese restaurant I've been looking for since I moved to San Francisco!\n\nThey have a wide variety of dumplings, their deep fried chicken wings are out of this world, their kung bow chicken is a great dish to take out, and their mushu pork is always made perfectly.\n\nThe owner Sam is simply wonderful.  He is attentive to every patron, and so helpful.\n\nThis is also a great place for takeout.  The food is ready in less than 10 minutes most of the time and it's such a nice, calm atmosphere, you wouldn't even mind if it took longer.", "author": "Samantha K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-29", "description": "We came here because we were looking for soup dumplings, but we left very disappointed. The soup dumplings were dry and had almost no soup in them. The Singapore noodles were also very dry with clumps of sauce and over cooked meat. The  fried green beans were over cooked and a bit too salty for my taste. We wouldn't have minded if it was a cheap hole in the wall but it was pretty expensive compared to similar restaurants.\n\nOn the plus side the server was nice and they have good blossoming flower tea. Maybe it was on off night as it currently has very good reviews but I would suggest trying somewhere else.", "author": "Danny O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-12", "description": "Ordered delivery. The cod was quite good. I'd say everything else was exactly average for Chinese delivery.", "author": "01001101 01100001 01110010 01101 0."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-17", "description": "Ordered delivery,  had I been in the restaurant I would have sent the food back.  The spring rolls were undercooked and gross. The chow mein was sticky and bland. Not appetizing or tasty.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-02", "description": "Better than mission chinese. Most authentic chinese restaurant in the mission. Absolutely fantastic service too.", "author": "Alex P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "Absolutely try the hot and sour soup. Best I've ever had. Also the fried rice was fantastic.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "I ordered the veg fried rice,crispy cod and the chicken corn soup. It was very light and tasty. Surprised with the negative reviews. Someone said that they use frozen veges. Mine was fresh and you can tell by the crunch. The server was nice and very attentive. Thanks Makli and don't let the negative reviews keep you from doing a good job. I recommend.", "author": "Ronald S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "Consistently good, fast and convenient take-out or delivery. Have enjoyed every dish I've tried - favorites include dumplings, peking duck buns and general's chicken. Best delivery option in the neighborhood.", "author": "John C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-11", "description": "$35 included 1. wonton soup - wontons had little meat and no taste. 2. Sweet and sour pork - not bad flavor wise, but the job has only half full; terrible portions here for eveything! Like 6 small peices of meat in the whole carton with a bunch of finely chopped vegetable slop. 3.Chow mein - bland. 4. Egg rolls - soft undercooked center; not even crispy.  The only redeeming quality is the weirdly awesome sweet and sour sauce. But not worth it. Never coming back. There are just too many great Chinese food places in the city. I'd recommend skipping it.", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "Fantastic food, quick and hot delivery!  Don't miss the Shanghai soup dumplings and the spareribs with coffee sauce....amazing!", "author": "Rex M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-07", "description": "Attentive service. Food was well balanced: honey walnut prawns were light on the mayo and properly cooked.  Honey seared scallops were really tasty, although the sauce was a bit too thick. Wonton soup (good chicken broth) were very light and the filling was delicate and with good texture. The green onion pancake was nice. Love their flower tea. Instead of the usual fortune cookie, they brought us a nicely served half orange. We left happy.", "author": "Ollim E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-19", "description": "So tasty! We ordered four things for two people and it was perfect. The duck buns were outstanding, and our favorite dish was the BBQ pork fried rice. These guys really need to market themselves better, as you'd have no idea this place is fantastic by their outside appearance. They don't even have a real sign! I can't wait to try it again. Legit Cantonese food in a neighborhood severely lacking in it.", "author": "Adam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "We've come here a couple of times - staff is friendly, and while the restaurant might seem unassuming, the food is great. The veggies are fresh, the flavors are strong and spot on. Overall a solid chinese place to have right around the corner!", "author": "Olivier L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "For a neighborhood Chinese restaurant this place is different and reliable. The staff is friendly and efficient. The XO BEEF IS A MUST-ORDER. It is super delicious and unlike anything I've seen in other restaurants. Order it extra spicy. The potstickers are like most others but come with a dipping sauce that is fantastic. Singapore noodles are delicious, and something as boring-sounding as curry chicken is also different than you'd expect and delicious.", "author": "Bill C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-10", "description": "Delivered food: greasy. The roast chicken was good but everything else was close to inedible. Worst: pot stickers. I have a dream that someday there will be authentic good Chinese food available through Seamless. That dream does not appear to be coming true.", "author": "Jane M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "Awesome restaurant. The first Chinese restaurant I've been to where the food is realllly close to being authentic. Not too Americanized at all (except for the Chinese-American dishes of course). The menu is very varied, lots of kinds to choose from. Not pricey either. The reatuarant itself is very clean. Cute decoration. Very friendly, courteous, and attentive waitress. Don't let the construction outside deter you away from entering Makli!", "author": "Lissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "This place is amazing! Everything we've tried had been perfection. Just experienced the Hot & Sour Soup and it was the best I've ever head. The device is always impeccable and delivery arrives HOT.", "author": "Travis S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-04", "description": "Ordered takeout mu Shu Pork generals chicken.  The food was by far the best I've found in the Castro.  Prices are great!  I'll be back.  Looking forward to trying the lunch specials.", "author": "Bill B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "I've only experienced lunch at Makli, but it's always been very good.  I've eaten in and stopped in for carry out. The food is always fresh. The staff is very nice.    It is not a place I would suggest for a special date night, but for a good Chinese meal I would highly recommend.", "author": "t m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-16", "description": "There are so few decent Chinese place in the Castro that I really wanted to give this a five star just to help keep them in business, but I really couldn't in good conscience. The four stars given is still a little bit score inflated.\n\nI have ordered take-out here a number of times and the food alway arrived quickly and hot. The quality has always been decent but I typically stuck with take out items that travelled well and are more common. Solid 3-4 stars for take-out\n\nTonight I dined in for the first time. Definitely more of a neighborhood hole-in-the-wall but super kid-friendly. It helps that the place was practically empty. We ordered 5 things and three of them were pretty good (fried rice, vegetable in broth and lemon chicken). The sweet and sour pork was not great, just a lot of friend dough and the veggies were not complemented well and unevenly cooked. The last item were steamed pork and veggie buns and this was the big disappointment, they were well steamed but have already gone bad and smelled sour. I know that sounds pretty bad but I would like to cut them some slack and hope that the freshness of all ingredients will improve as their popularity improves. Probably a 2-3 star dinner experience.\n\nReally hope this place lasts!", "author": "Sharon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "Delicious food and great service. Staff is nice and welcoming. I definitely recommend trying this spot!", "author": "Manuel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "Amazing food and clean place! First of all they have a giant tv which is nice, good music not too loud and they bring you chilled glasses and a chilled, glass  bottle of water for refills. We ordered the hot & sour soup and general tso's chicken. The soup was so good and different, vegetarian too! The chicken was lightly breaded to perfection, all white meat, and not greasy at all. The chili sauce was amazing and overall a wonderful find in the castro. Definitely coming back:)", "author": "April C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-10", "description": "Our order arrived late. We ordered 3 things and all failed: The veggie noodle soup had barely any broth, the noodles were overcooked, and it had no flavor. The braised tofu in a pot entree was also bland, the tofu was very greasy and gross, and even though I did check the box to order rice, we received none, I guess it does not matter since the entree had no sauce. The green onion pancakes were shoved into a tiny box so they were all broken up and also pretty much tasteless. The worst Chinese food I have had in SF.", "author": "elle s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-05", "description": "Not really spectacular food wise. But what do you expect? It's Castro adjacent. Server was very attentive, so that's a big plus. Prices are reasonable, nice lunch special. But if I want better food, I'd rather go to Red Jade on Church Street. But I was happy to see an Asian restaurant in this neighborhood. Hope this place gets better and lasts awhile. I may be back.", "author": "Jesse B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-27", "description": "This is a great neighborhood spot! Pretty cheap and really hits the spot when you get that craving for some Chinese takeout.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-03", "description": "Went there for lunch today. Decent prices for lunch.  $9.95 for Singapore street noodles, hot n sour soup and eggrolls. Very good soup, was little spicy - which I liked. The street noodles had a very good curry taste, was spicy and dry - the way I like it. Didn't like the spring rolls though. Too bready. My husband liked his kung pao chicken. He said it wasn't too sweet, which was good. He got the pot stickers, which were very tasty, and the same soup, which he thought was a bit too sour.  The service was spectacular.  She was very nice. It was a hot day though, so I don't recommend eating all the spicy food on a hot day as the doors were open and there wasn't any AC. If I lived here, I'd be a regular though.", "author": "K G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-07", "description": "You should go here. There aren't enough solid chinese places in the area and this one is great AND cheap. I've been here 3-4 times already... your turn!", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-04", "description": "We ordered orange chicken and she brought out lemon. She took it back and just poured orange sauce over the lemon like we couldn't tell the difference", "author": "Demonte J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "This is our favorite Chinese in the Castro area.  Everything is really fresh and the Peking Duck rolls are fabulous. The serving people are delightful.  Very bright, pleasant restaurant for a simple meal.", "author": "Carol S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-26", "description": "just OK. Food was tasty but a bit salty. Portions were on the smaller side compared to other Chinese places", "author": "Asher B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "Ok. Had to update my review. Alas, the restaurant is not perfect after all. The hot and sour soup is not great--too much vinegar. It's very tart and tangy with no savory and hot flavors to balance it. Skip it. A few other items have been inconsistent and one time we got a not so fresh seaweed salad--blech! But, it's delicious when it is fresh.\n\nMakli is a new hidden treasure in the neighborhood and definitely worth trying regardless of where you live in San Francisco. \n\nThe walnut prawns are delicate and fresh and the beef broccoli is tender with perfectly cooked vegetables. The cuisine seems more Shanghainese and Cantonese influenced, offering for example, a delicious seaweed salad as an appetizer, yet the spicy dishes have more than adequate heat, which makes it perfect all around.\n\nThe delivery service is exceptional. The food arrives quickly, piping hot, and well prepared.", "author": "Stephen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-09", "description": "I love across the street and enjoy eating here. They have a great lunch special and it's a lot of food. For $9 you get soup, appetizer, and a rice or noodle plate. It's a lot for the price. When I have dinner I enjoy the Honey Beef but for lunch it's the Mongolian Beef.", "author": "Ryan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-23", "description": "Went there for lunch take-out (house chow mein). This place is very good.  GIve them a try, it's a much-needed breath of fresh air in the neighborhood.\n\nMonths later . . . I've been back now many times, including with family for dinner. Kids are hard to please but even they love the food here.  Food is always excellent; service is always friendly and inviting.  Great Chinese food.    Try it!", "author": "A. M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-21", "description": "DISASTER ONLINE EXPERIENCE!!!!  Looked at all of the Yelp reviews and thought we should give it a try.  We got online and saw the menu and tried their online ordering.  We ordered at 4:00 p.m. this evening.  The confirmation said that we would expect that we would get the order at 5:09 p.m..  We called 5 times (two times were to some 3rd party that we were told to call-who were they??) and finally we received a call from the restaurant at 7:50 (seriously!!!) asking if we had a question!!!  At this point we thought they were kidding.  They had no record of our order, but we had saved our order confirmation as a PDF, if there was need for it for follow up.  So we are calling Red Jade, our tried and true for dinned tonight.  BUYER BEWARE ON THIS PLACE!!!!!!!!!!!!!", "author": "Chuck A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-25", "description": "We were pleasantly surprised by Makli. We went there twice and enjoyed their vegetarian dishes. Highlights - Great food, not busy, and friendly staff! Will certainly be back.", "author": "Srini S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "I'm Chinese n I  live nearby. My partner n I will come to visit at least once a week. The food here is really authentic compare to other restaurants which always have Chinese American Food!", "author": "Justin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-18", "description": "40 minutes late with the delivery and after 20 minutes i was throwing up. horrible nasty food. a trash can is a better source of nutrition", "author": "Ken C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-22", "description": "The Chinese food here is really authentic.  I particularly like the Spareribs with coffee sauce.  The rest of the stir fry is tasty. It's definitely a place I'd return to.", "author": "Baldwin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-16", "description": "I live a block away and have eaten at Makli a bunch of times at this point.  Best Chinese food in the neighborhood.  The veggies are cooked just right.  Still slightly crunchy and not overcooked like the other place that's close by.  The sauces are subtle and very tasty.  Everything seems fresh and tastes like the cook and ingredient buyer actually care about the quality.", "author": "J s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-25", "description": "Poor quality; overcooked veggies; gave wrong noodle dish, not fresh, fried rice bland. Came on time.", "author": "Harvey S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-06", "description": "Yuck.  Just went here for lunch.   My friend sniffed the hot and sour soup and wouldn't eat it.  He thought it smelled of \"old dog.\"  The pot stickers I had were deep fried all around, rather than just on the bottom.  The kung pao chicken was pretty gross.  This is far from an exceptional restaurant.  It's so bad that they had a TV going as a way to distract you from how bad the food is.  A must miss.", "author": "chad H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "Charming, comfortable restaurant with a really fine lunch menu. The food is fresh and well-prepared, and the hot & sour soup is some of the best I can ever remember having. Since they're on a quiet corner, it may take a while for people to find it -- but I hope people do. Makli Restaurant (that's its official name) is new to the neighborhood, and I wish it all the best. (I'll be helping out by eating there regularly.)", "author": "Scott F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "The young man and young woman working at the counter during the pride parade (closing shift) were wonderful. Exceptional customer service.", "author": "Tea F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-21", "description": "i was here with a big group of people and we all agreed that makli's portion sizes were generous and the food tastes pretty good. compared to all the gazillion chinese restaurants in the city, the food is pretty standard but what you won't see is the place crawling with loud chinese families. what i liked about this place is that makli has a smaller, more intimate feel. it is a place where you can enjoy affordable chinese food and a conversation without having to scream over the table. all in all, makli isn't terribly memorable and i wouldn't go out of my way to eat here but if i was in the area, i would definitely consider stopping by to pick up some of their yummy salt and pepper fish.", "author": "The Hangry Chef O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-20", "description": "Lost my online order, when I called after an hour and 45 minutes of waiting, they asked for my address five or six times and then told me it was already out with the driver and it'd be here in 15 minutes. That was 20 minutes ago. Terrible experience.", "author": "Christopher M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "Went last night, cuz of a restaurant.com certificate and proximity to castro theater. AMAZED. food was fresh, service was fast friendly, cute.  Sauces made the difference in tired old standbys like sweet/sour pork; ,chicken w cashews. wonton soup with noodles was HAPPENING. beautiful room, lovely family seems to run it. Low prices; appears there are even lower lunch specials.  we had to hurry, because of movie start time; everything came out fast, fresh.  I had out of town guest, who was thrilled. I, as an old, jaded, seen everything resident, was very pleasantly surprised. dumpling wontons in soup were amazing. hope this place doesn't get TOO much publicity.wont be able to get a seat.  Kicks ass over anything in the Castro or Mission IMHO.", "author": "William S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-25", "description": "Our night started out promising.  Our food and drink order was taken quickly and our drinks arrived in no time.  The five of us ordered two appetizers, four shared plates and one entree.  The spring rolls arrived almost immediately and were delicious.  That's when the good parts ended.  The one entree arrived quite a bit later, along with the rice and one shared dish.  It was another 15 minutes before we received two more shared dishes.  And another 10 minutes before the last one arrived.  That was the house special chow fun.  The noodles were thin rice noodles, nothing like chow fun.  We finally had to ask where the second appetizer was.  It was ready and delivered very quickly which showed that our server forgot it.  After we were finished eating it still took a good 20 minutes to get the check.   And wouldn't have gotten it then had we not asked for it.  There are lots of other options for Chinese food in the neighborhood.  Any one of them is better than this.  I won't go back.", "author": "Douglas A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-23", "description": "I really wanted to not like the place because I miss my regular sushi bar, but the food is too delicious. Makli has won me over! You've got to try it. Everything I've ordered either on-site, or to-go has been awesome, fresh and tasty. Hope the neighborhood supports this little gem.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-11", "description": "mmm...yummy, soupy dumplings...I think I'm going to get even fatter being so close to this establishment.", "author": "Philip C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-03", "description": "Much better than Red Jade. I'm Chinese American, and it was pretty good.", "author": "alicia w."}
