{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Best Chinese offering in and around the Mission/Bernal Heights. Food is delicious and delivery was fast. \n\nTry the General Tsao's chicken. You won't be disappointed.", "author": "Mike U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-14", "description": "I called the restaurant to check on my delivery status, as it has been 1 hour and 15 min since I placed my order through Yelp/Eat24/Grubhub/whatever it is now.  The woman who answered frantically said my order was on the way.  But didn't ask for my name.  Or phone number.  Or anything else about my order.  I'm not hopeful I'll get my food.  Reserving full judgment until I get my food.  Full review to follow. . .\n\nUPDATE\nGot my food 30 minutes later than expected.  Two items missing.  Not sure if this was a restaurant issue or an Eat24. Regardless, Eat24 credited us for the missing items.   Food quality was fine.  Nothing spectacular, nothing awful.  Can't say I will order from this place again.", "author": "Danielle B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-21", "description": "You gotta be kidding me.   A city known for the best Asian food in the country and this is the kinda thing that you get.  Sheesh..  \n\nIm sure nobody in the back of the house went to culinary school, so maybe they'll read this and get something from it. \n\nThe walnut prawns are soggy and the batter is not cooked through.  Thats right - RAW DOUGH.  That means your batter is too think.  You can only fry a large shrimp for 3-5 minutes so you have to think the batter down and you're using too much cornstarch.  \n\nDumplings in spicy sauce - after you make the dumpling filling you're freezing them.  When you are steaming them, they're getting over cooked because they're boiling from the inside out. \n\nCrab puffs:  They're soggy because you're togo container is sealed and they are steaming inside the container until they get to the customer.  STOP DOING THAT. \n\nChicken wings -  same story.  cooked once,  frozen,  refried before sent to customer.   \n\nThis place is a total joke.  Leave it to nutless, brainless, yet enterprising restaurant owner to find a way to save $3 on an order and turn away a customer for life.", "author": "Ajay R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-07", "description": "It seemed like this was a good place to go to after seeing that food deliveries were fast based off the Yelp reviews!\n\nUnfortunately the dine in service was not the fastest. \n\nNow we were seated and attended to promptly but the kitchen was slow. My friend and I ordered the lunch specials. One of us the curry chicken, the other orange chicken. \n\nSadly the food took about 20+ minutes to come out for basic lunch specials and for Chinese food that is a little too slow. \n\nThe curry chicken was solid however my friend's orange chicken was just too overloaded on the sweetness and was mostly really hard crunchy flour. \n\nIf you don't have time during lunch don't dine n here and if you do I'd recommend you spend your money elsewhere", "author": "Sean S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-09", "description": "I ordered two lunch specials today. Received one and an entree size, even though I called and verified everything once I placed the order. I called the restaurant to let them know and they felt like I should be grateful to get the entree size even though I didn't get the rice I paid extra for or the soups. Bland food.", "author": "Thomika K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-04", "description": "I keep coming back here for their lunch menu. The meals are filling and for a great price. Can't go wrong with their chicken dishes, I've tried all of them and they're pretty good (except for the lemon chicken, not a fan.) For dining in I'd highly recommend their clay pot dish, it is delicious!", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "This place was amazing. Good customer service. Food was amazing. We come here every other Sunday and every time we come here the owner knows our order. \n\nWe came back this Sunday, we haven't been here for almost a month. When we're about to tell our order first thing he said WELCOME BACK. I was amazed he remember us and our original orders every time we visit. We always get SALT AND PEPPER FISH AND PORK CHOPS. So delicious. Their fried rice so yummy. \n\nI highly recommend this place.", "author": "Miguel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "Great service and food, would definitely come here again.  Our waiter was very nice and caring.  Our waiter was constantly checking on us making sure we were enjoying our meal.", "author": "Jeremiah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "If a Man answers for take out, make sure it's Robert!! When he answers and takes ur order, food always gets to you fast sometimes under the 30 min mark, food is still piping hot and delish!! You tell Him exactly what NOT to add and it's done correctly. When someone other than him, sorry but the women NEVER get ur order right! \n\nFoods delish and tasty!", "author": "Robertta M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "Food and service was great! First time here and I would definitely come back! Orange chicken was super delicious and the salt and pepper shrimp! Shirley was great I hope you get her!", "author": "Crystal B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "I got delivery on a Wednesday around 12, the food came hot and exactly as I ordered it, and 10 minutes sooner than the original estimate.", "author": "Yana P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-05", "description": "UPDATE: Very sad to report the meatless General Tso's chicken contains milk and eggs. I am so unhappy about this. I had called when I ordered from Mandarin months ago, but apparently the person I spoke to either misunderstood or didn't know. Knocking off two stars since this was the item I had liked so much.\n\n\nNot my typical format since I ordered delivery.\n\nFood: Extensive vegan option and great tasting vegan Chinese food. I came home from a jog and was super hungry, so I ordered A LOT of food... I had salt and pepper tofu, meatless Kung Pao chicken, and meatless General Tso's chicken. If this food were a person, we'd be best friends. The salt and pepper tofu was super spice (I ordered it spicy) and delicious. They use large chunks of peppers and onions, and tiny pieces of garlic. The fried tofu cubes were tender and tasty. The Kung Pao meatless chicken was super yummy, though I wasn't a fan of the meatless meat. The mouthfeel was a little off. The sauce was amazing though, and the peanuts were delicious. My favorite was the General Tso's chicken. It was absolutely fantastic. Mouthfeel was so disturbingly similar to chicken that I cut a piece open and inspected it. Nope, it was definitely a mixture of batter and no meat. But wow - the sauce and texture was perfect. I also had an order of veggie spring rolls and a side of white rice. Next time, I'll pass on the spring rolls entirely - they weren't all that tasty compared to the mains and the other appetizer.\n\nService: Super friendly and helpful. Since I've had bad experiences with other places, I called ahead to ask about the delivery service. They use Eat24 delivery service. The delivery was on time and super easy.\n\nOverall, 5 stars. I know this will be my go-to Chinese place. I'm happy to have found an excellent place to order vegan Chinese food, and have it delivered!!", "author": "Shannon H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-18", "description": "I ordered pot stickers, sweet and sour soup, and chicken chow mein. \n\nThe pot stickers filling was good, but the dough was too thick and was a bit chewy. The dipping sauce was too salty. \n\nThe chicken chow mein was decent. It wasn't the best I've had, but it was satisfactory. \n\nThe sweet and sour soup was delicious and had just the right amount of everything.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "I ordered chowmein and onion pancakes last night. Noodles were okay but wtf was up with the pancakes? It was all dough and there were not even any single onion. How is it an onion pancakes when there are no onions? Stupid.", "author": "Kushal G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Super humble restaurant. It's your typical 90s movie Chinese restaurant. Reminded me of my childhood. Love it, it's very special. Service was excellent. Food was good! My table ordered the steamed buns, hot and sour soup, lamb and HK noodles. I think I would be a regular there if I wasn't just visiting SF.", "author": "Jamie Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "For a delivery service, especially Chinese food, is rare to find 4 stars. Shockingly found mandarin house and decided to give it a go. On a Sunday afternoon, I ordered my food for delivery on 2:11pm. I received my fresh and piping hot (emphasis on FRESH & PIPING HOT) food after 37 minutes, which is really not a bad wait time at all.\n\nSeafood tofu soup: \nIt's only for two people max. There was a good ratio of soup to seafood and tofu. Tons a little tofu pieces yummm.  \n\nBbq pork fried rice: \nI like to base how good fried rice is the color of the rice (white rice means there's not much flavor) and the flavor profile in all. There was tons of flavor with the BBQ pork fried rice. Big plus bc it was still hella hot when I got my food. \n\nGeneral tsao chicken: \nAt first glance, I thought my general tsao chicken was burnt lol. But don't be fooled. It's actually the dark delicious tangy sauce that they mix the moist, well cooked chicken. It's really easy to over cook chicken but they did a really good job at making sure the chicken was cooked properly. \n\nThis place doesn't give shitty service at all so that's a huge plus. The food is a bit overpriced compared to other Chinese restaurants but you are paying for quality. This is probably my go to Chinese food delivery now. Yay.", "author": "AJ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Food was great and portions were large. The waitress whom I believe part owner was super friendly and very attentive.", "author": "William H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "This place can be easily underestimated. When walking in, there was a lot of boxes near the bar and there was no one there to attend to us. As my family and I waited, I started to wonder if we should even eat here. We were then greeted and sat quickly by the hostess. She was sweet, and answered all the questions we had about the menu. I ordered the String Bean tofu and my family ordered the sweet and sour shrimp and the Korean soup. All were very delicious! It is family style dining, so keep that in mind when ordering! After our meal, the host offered us FREE mango ice cream! Everything was delicious and I will definitely be coming here again when I come to SF!", "author": "Silvia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "My boyfriend and I walked in here on a quiet Sunday afternoon to grab a late lunch. We ordered pork potstickers, pork fried rice, orange chicken, and Mongolian beef. The lady who took out order was super friendly and actually gave us free sodas, soup AND egg rolls! The food was super delicious and the service was even better. Their fried rice had really yummy flavor and their potstickers came with a delicious dipping sauce that made them hard to put down. The winner was the orange chicken, super crispy and fresh and the sauce was sweet and spicy at the same time. Overall such a great dining experience, and also inexpensive. This will be our new place for takeout. Thank you!", "author": "Isabel O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "For delivery, we ordered the General Tsao Chicken and Sweet and Sour Pork. Both were delicious with great flavor, though maybe a bit on the sweet side. They were huge portions, but didn't come with rice, so be sure to order rice on the side.\n\nDelivery wise, they delivered it in a bit less than an hour, which is pretty normal for SF delivery and service was perfectly fine! Would order again when I'm in the mood for Chinese!", "author": "Jacqueline H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-03", "description": "My food is over an hour and a half late.  As in I ordered it for delivery TWO HOURS AGO. \nWho cares if the food is good if it doesn't ever come. \nThey gave me a ten dollar credit on a $50 bill. Lame. Like I want to order from them again.", "author": "Klite A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "Ordered delivery from Grub Hub.  I ordered General Tsao chicken,  Vegetable Fried Rice,  Beef and Broccoli and Honey Walnut prawns.  Everything was delicious.  I asked that the General Tsao chicken be extra crispy because usually when you order crispy chicken delivery it gets soggy by the time it's delivered but the chicken was still crunchy  just how I like it.  The honey walnut prawns is also battered and it was deliciously crunchy as well.  I'd definitely order from here again.", "author": "Lennie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-10", "description": "o how I hate to downgrade reviews, but I have used their delivery service several times and each time they either forget something or peave out chopsticks, soy sauce, other utensils. Not to mention I wrote it in the requests before ordering, but kind of common sense. havent\nll", "author": "Christina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "My go-to Chinese food spot! Love their honey walnut shrimp. Delivery is always very quick and the dine-in experience was great as well. Will definitely be ordering here again soon!", "author": "Shiela D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-07", "description": "We ordered Hong Kong Crispy Noodles with assorted meat. (pork, beef, chicken and some kind of fish).  It was not good--there was a strange taste and odor and unfortunately, we decided not to eat it.\nI also ordered Chicken with Mixed Vegetables and that was just ok.  It didn't have the greatest flavors either but it was edible nonetheless.  The Chicken Fried Rice that we added was tasteless and not very appealing.  Uninspired and lumpy.\nThe on-line ordering process was very easy and the delivery was prompt which resulted in hot food.  That's a good thing.\nI don't think I will order again though.  I miss Shiso!  That's what this space used to occupy.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-13", "description": "Good pick-up experience. They brought the good to the car as I could not find parking. \n\nOur Chinese - Win Garden - was closed Wednesday so I had to find a different place - 4* looked decent. \nOrange Chicken was hard. Probably reheated onetime too often.  Sweet and Sour Shrimp was way too overcooked - too soft.  White rice was ok. Soup - not memorable.  \nNote to self: no Chinese takeout on Wednesday. \n\nWhy 2*? On Yelp 4* means \"safe bet\" 3 means it's ok. This is ok but no way safe bet.  So rating gets adjusted.", "author": "Flo B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "Got take out and it was as great an experience as you could hope for. Food was still hot (fried things were still crispy!!!!) and mad flavorful. Delivery time was super quick too and faster than the estimate. \n\nFood was pretty good. Standard Chinese fare, but the best version of regular and just short of exceptional. I got the salt and pepper pork chops and chow fun with prawns. The chops were flavorful and crispy. Some might think salty, by I'm into that. Chow fun was fun; adequate number of prawns.", "author": "Ray N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-13", "description": "Very disappointing! I ordered; combination fried rice, shumi, and potstickers. The food was bland, I could not distinguish any flavor from these 3 items. Just blah! With different textures and shapes. I had to whip out an array of my handy dandy condiments , to bring out some kind of palatable incentive to chew up this biological matter! For what it's worth, my dog was a fan of the potstickers. I am left un satisfied and $30 poorer, on the flip side! I am motivated to learn how to make all of my favorite comfort foods.", "author": "Herbert L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-22", "description": "The worst Chinese meal that I have had since moving to SF from Singapore - pretty much the whole meal was fed to the rubbish bin!!!   Tasteless and unimaginative food across the board.   The sweet and sour pork was surrounded with soggy and stodgy batter and there was nothing sweet or sour about this dish!! \n\nHelp - where can I go for quality spicy and authentic Chinese food?", "author": "Michael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "Well packaged (quality containers that stay closed, but open easily. Generous food portions. Food was well prepared and looked good!\nHave ordered several times from this restaurant and the food has been consistently tasty.", "author": "Robert B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-16", "description": "They have good lunch specials and I like it better than Jasmine Tea House. Their honey walnut shrimp lunch special is very yummy. The salad is just salad from Safeway with some dressing. The soup is always egg soup, which is probably the cheapest soup you could make... I don't remember if they gave us free fortune cookies or not. Tea cost extra and not included in the lunch special.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-03", "description": "Ordered from here as I was sick, it had good reviews, and it was close to the house. The order arrived before the scheduled time, which was good. Upon opening the bag, I found my meatless sweet sour chicken very unappealing. The pieces of \"meat\" were white as if they had not been fried. The fried rice I ordered was ok. Next time I'll stick with Jasmine Tea House.", "author": "Kristopher D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-18", "description": "This review is not based on food but customer service. I as many other people in San Francisco am a Renter to where I live. I went over many times with the Lady who took my order to \"NOT RING MY BELL\" because my landlords would be disturbed and upset. I even went as far to leave a taped note on my gate to please call and do not ring the bell. Then as much of an unwanted surprise they rang the bell non stop and when I called to speak to the manager they Lady, whom I spoke with said he was not in how convenient... the food is Okay but to be lied to by the resturant and them to tear off my do not ring note can not be over looked.", "author": "Rudy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "Very good food fast delivery...5 stars\nTry the chow mein with prawns...deliiiciooooous", "author": "Daniel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-13", "description": "I like the food here but I feel like there are not enough vegetables on anything I have ordered. I get the food here pretty regularly so this obviously has not stopped me from ordering from here.\n\nThe dim sum is good, not the best I have but that happens when you work next to Chinatown.", "author": "Max W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-08", "description": "Nothing amazing here. The shrimp with mix vegetables was a kinda of bland and the general chicken was tough. All the other dishes were pretty basic.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "the food was soo delicious and perfect, salt & pepper pork chops and everything was fried perfectly 5 STARS, great service", "author": "James D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "Only done take out, and each time the food has been pretty good. We are partial to the dry wings (nice and spicy), the fried rice and chow mein. Delivery time is standard for Bernal Heights area and usually on weekends (45min).", "author": "Jon O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-23", "description": "Really gross/bland. Way overpriced. \n\nThe General Tsao's chicken managed to be both soggy and burnt. Same situation with the Salt and Pepper Pork. The combination fried rice barely had any protein and was completely devoid of flavor. \n\nThe portions were medium/large. Unlike other disgusting chinese food which I threw away, I finished this, but it was a huge disappointment. I do not recommend ordering from here, if you are reading reviews trying to find the right chinese place, this is not it, keep looking.", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "Can only speak for lunch takeout. Had fish with snow pea leaves, which I love but don't see often. It was delicious and delivered quickly.", "author": "Cathy O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-05", "description": "In an inspired mood, I decided to forgo my usual Chinese delivery joint, Henry's, in lieu of this new place in the hood.\n\nLive & learn.\n\nI was partly seduced by the fact that it's Mandarin.  Many moons ago, there was a restaurant I loved called First Mandarin, out in the valley.  First Mandarin made the best sesame chicken I've ever had in my life, to this very day.  They've long been long gone, but the memory is still wicked strong.  Could this new spot be anywhere nearly as good?  I had to find out.  \n\nWhy am I so sentimental?  \n\nWell, unsurprisingly, it was not nearly as good.  At least 3/4 of the meal wasn't.\n\nThe bbq pork fried rice was bland & disappointing.  The Mongolian beef, which is one of their \"specialties,\" was not only unremarkable, but had a curious flavor to the sauce.  And the sesame chicken, while not overcooked & over sauced, was not more than decent.  \n\nBut, if a restaurant could be judged on potstickers alone, these guys would easily get 5 stars.\n\nThe pork potstickers were outstanding.  The dumplings were soft & crisp in the right places, without being at all gummy.  The filling was superb...no blind mystery meat acceptance necessary for the sake of convenience & laziness.  Fresh & clean flavors.  I've never said that about a potsticker before.\n\nThey delivered on time, & they remembered the usual condiments & the fortune cookies, too. \n\nBut the potstickers were the only thing worth ordering again.\n\n2 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "Very tasty vegetarian dishes! \nThe only problem is the delivery time. It takes more than an hour. :-( \nI also wish the free-delivery would require $15 spending instead of $20. \nHowever, the food is more than worth it, so the dish sizes. Well served dishes and tasty! :-)", "author": "Janet V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "Good fresh food, after trying some other local restaurants recommended to us on our trip here in SF this restaurant was a better choice than other Chinese restaurants we ate at.", "author": "Josh M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-13", "description": "This place is decent, especially if you can't leave the house and need to order delivery. \nI got the general tso chicken. It had a really good flavor to it and the fried rice was alright but the onion pancake is HORRIBLE. Do not order it. It's hard as a rock and not edible.", "author": "Brooke F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-20", "description": "Got take out from here. The fried rice and the sesame chicken. It was aight, but nothing I would go out of my way for again. With that being said, they were really fast to deliver, showed up about a half hour early. I guess I have high standards when it comes to Chinese food, but it wasn't anything too special too me.", "author": "Ross S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "Very delicious quiet little place to enjoy. Clean. Reasonable prices with a variety of options. Near 280. Loved the fried rice here and the chow mein and the wings and EVERYTHING lol. Will definetly come back. Favorite item: Fried rice and Salt and Pepper Rock cod which has jalapenos dressed on top and is deep fried", "author": "Travis E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "I like going here bc it's close by and the food is good to me. It's good enough takeout. I usually get general tsos and chow mein and like the crab Rangoon's. That's all my go to if you're indecisive also the eggplant is delicious.", "author": "Cecilia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "Salt and pepper pork chops are pretty good. For some reason even though the inside is bright and clean they mostly seem to do takeout business for dinner", "author": "Stewart K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "We ordered to go from Eat24 and found this restaurant fresh and delicious. Loved their string bean tofu.", "author": "Kurty W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-20", "description": "this place has some poppin fried rice!!!! i ordered fried rice with spicy cashew chicken.. well the 3 stars is really for the rice and the prices + also the free delivery.. but the chicken cashew wasn't spicy at all and i asked for extra spicey.. i would go she's in n maybe try a different kind of chicken..", "author": "Jackie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "I ordered the special c and it was great!\nI even asked to change the appetizer to something else and add a sauce to my order ..... And they paid attention to my special request orders without giving me any problem \nThe food came to me fast and still hot .\nI would definitely order from here again !", "author": "Jennifer G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-17", "description": "Veggie potstickers were good but Mongolian beef was pretty nasty.  Whatever cut of meat that was in it wasn't discernable and it was chewy. The quest for decent Chinese in SF continues. I just don't get how this city has such atrocious chinese food. Makes no sense to me. Would not order again", "author": "Brad B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-24", "description": "I didn't hate it. I ate most of it. I won't order from here again. In a city with a wide variety of extraordinarily prepared Asian cuisine, this was totally phoned in.", "author": "Erik W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "A newly opened Chinese restaurant in Mission street. Nice decorations (a mix of Chinese and Japanese?), clean toilet. More importantly, you don't smell any cooking fumes leaking from the kitchen.\n\nNow about the food, I must say this is probably one of the more authentic Chinese restaurant I have been to. The flavors and spices in each dish are on point!  My friends and I only had a few dishes for lunch but I definitely wanna come back again and try out more of the menu.\n\nThings we ordered:\nPopcorn with anchovies: interesting appetizer, everyone at the table could not keep their hands away from the basket.\n\nMandarin Claypot: tender beef and chicken in a nice stew. \n\nDry Braised chicken wings: fried chicken wings in an amazing savory sauce (slightly spicy but just right!). I will recommend this dish to anyone who visits this restaurant \n\nEggplant with spicy garlic sauce: the chef is generous with the garlic sauce, eggplant is just the right texture, not over done.\n\nOrange Spare ribs: fried spare ribs with a slight orange tangy aroma served with a side of sweet dark sauce. \n\nMost of these dishes are on the chef's special menu. If you are craving for Chinese food (or even takeouts), this is the place to go.", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Saturday evening order was fast less than 40 minutes. Food tasted like \"comfort-style\" Chinese not too salty and overflavored with msg. Good go-to Chinese  in the mission.", "author": "Hong L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "This is good delivery Chinese food. They started with a bang--best fried chicken (ok, ok, general Tso's) that I've had for delivery. Each subsequent time it was not as good as the first... Then They get a low health score.\n\nMaybe the main cook changed? I dunno hoping they get their act together, but the food is tasty.", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-20", "description": "Yangtz Pot Ribs is the best!!!\nFried rice too!\nChow fun ok.\n\nPretty standard Chinese food! But close to my house, always order from there. Very fast!", "author": "Shijia L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-15", "description": "We ordered food from this disgusting \"restaurant\" and it is absolutely inedible and the chicken smells awful and looks fake. My husband immediately felt sick to his stomach after two bites. He literally wanted to vomit it out. The sweet and sour soup is gross with no flavor but pure salt water and the dim sum taste super hard and stale-like microwaveable frozen food or food left out for days. I spit it out immediately!!! We cannot eat nor touch this food. The delivery guy was also super aggressive when demanding (not asking) for a cash tip upon delivery. Honestly, this is the last time I order delivery. If can't see the establishment or see how they operate in person, I won't bother ordering from them. This was a terrible experience. Save yourself a lot of money and go somewhere else where the food, service and prices are fair and worth it!", "author": "Bridgette P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-02", "description": "Be warned. Waited over an hour and a half for our delivery. When we called the second time the call went directly to voice mail. When the food arrived it was barely room temperature and underwhelming.", "author": "elizabeth m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "Love ordering delivery from mandarin house SF! They're quick and the food is always good!", "author": "Lupe A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "just got the Kung Pao Chicken and Hot and Sour Soup delivered to share with my mother.  Chicken was great, with a bit of char flavour.  Mom complained soup had a funky aftertaste, but I think it was just packaged bamboo shoots.\nThey use jicama instead of water chestnuts... a nifty trick!  But I wish they cut the jicama a little smaller to imitate water chestnuts better.  Still a cool hack.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "Lunch menu is a bargain! Food enough for two people to share! I ordered the sesame chicken and it was lunch, dinner and next day's lunch at work. Food delivered was early and piping hot!", "author": "Neni E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "It's definitely hard to find decent asian food on this side of SF.  I've tried many around for lazy delivery days, and Mandarin House is the one that delivers hot, non-greasy, not over-salted clean-ish food.  Ingredients seem fresh and veggies not overcooked.\nI order gluten free and MSG-free versions, and despite that, it is STILL tasty.  I'm not sure what other reviewers are talking about...bland fried rice, etc.  Maybe people are used to the over-americanised over greasy over MSG over seasoned Chinese food.\nThis place seems to provide cleaner plates.\n\nAnyway, I approve of this neighborhood place.", "author": "Avi S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-21", "description": "Ordered food 2 hours ago and food never came!!! Kids hungry and Eat24 said they'll give us a 2 coupon for our next order!!!!! Lol\n\nFood never came!!! How do you do business like this!!!!\n\n#hangry", "author": "X-Level L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-18", "description": "This time around we ordered:\n\nVegetarian Spring Roll 3 Pcs(X1 $4.95)\nHot and Sour SoupSmall(X1 $4.25)\nCombination Wonton SoupSmall(X1 $4.95)\nMu Shu Pork(X1 $9.50)\nLemon Chicken(X1 $9.50)\nSingapore Style Rice Noodle(X1 $8.25)\nMongolian Beef(X1 $10.50)\n\nNone of it was as good as the first time around. In fact, we ended up tossing out the Hot and Sour soup -- very strange flavors in there. The spring rolls were standard -- looked like the ones you get at Costco. The Wonton soup was OK. The Mu Shu pork had a very small spattering of pork -- it was almost entirely shredded cabbage and egg. Lemon chicken had only the slightest hint of lemon -- it was really just fried bits of chicken. Singapore Style Rice noodle was, again, OK but nothing great. Mongolian beef was pretty gross -- the beef was fatty and stringy and the flavor was pretty bad. My son literally spit it out on his plate.\n\nNot sure we'll order from Mandarin House again. Pretty disappointing since we were so pleased the first time we ordered!", "author": "Paul L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-06", "description": "So I got delivery and it was a disaster! The chicken was rubbery and it did not taste good. General Tso chicken is my go to Chinese dish and this was by far the worst in ever gotten. And my Thai tea was completely poor out in the bag it was delivered in. So upsetting...", "author": "Brandon F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-15", "description": "Really cheap quality food.   I don't know how they have 4 stars.   We could barely eat our food.", "author": "Parastoo E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-28", "description": "General Tso chicken had good flavor but was a little dry/overcooked. Chicken chow mein had very little chicken or vegetables. Hunan shrimp \"medium\" spicy wasn't spicy at all. Crab wontons were good. Overall not impressed.", "author": "Tish M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-28", "description": "Chinese food for white people. Like seriously I've never heard of meatless chicken before. However, I ordered beef chow mein which was pretty decent and the waiter was friendly. The pot stickers were not that good and they also offer some dim sum as well, which I would not recommend. Overall an okay place for Chinese food.", "author": "Jack T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-17", "description": "Maybe decent compared to what else is in the area, but honestly the food was almost inedible.\nThe dim sum was poorly reheated. The shrimp was not fresh.  While I'm not usually squeamish about Chinese food, it's got to be edible at least.  Food aside the interior was okay and clean.  Bad enough that I would eat some other kind of food if I'm in the area.\n\nStick with things that everyone orders and you'll probably be ok.", "author": "Yohdaddy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "FYI It's under new ownership, despite some negative reviews on Yelp. We gave this place a try, and I'm glad Me and my family did. We absolutely  loved it! Food tasted fresh perfect flavor. We had chow mein, fried rice, sesame chicken, wonton soup and beef broccoli. This will definitely be our new Chinese restaurant, whether it's dine in or take out. They also have great customer service. I would definitely recommend this place. Thank you Jack!", "author": "Diana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "Omg. I'm not even done eating. I got the meatless salt n pepper chikn and it's AMAZING. This is the best Chinese delivery I've had in sooooo long. And the pot stickers too. There's veggie ones that are with the thin wrapper not super thick.  Subtle but flavorful. OK I can't make a long review because I just want to get back to eating.", "author": "Astrid V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "So happy I found this gem! My friend and I went crazy after seeing their meatless chicken menu! Everything was so good I'm so excited to come back! Our waitress was so friendly and attentive. I ordered the meatless general tsao with vegetarian fried rice and it was to die for! My friend got the vegetarian bento box & the fried chicken wings. We have zero complaints! The restaurant was so clean with a nice atmosphere. Even the hot tea they served us when we sat was delicious!", "author": "Kristen D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-28", "description": "Just ho hum typical Chinese fare. Ordered delivery via eat24 which took a long time - 1.5 hours.\n\nChicken corn soup: too much corn starch, cheap thickening agent often used in Chinese cuisine. \n\nSalt and pepper chicken wings: tasty and nice touch with string beans and onions but came soggy - not friend and crunchy - in ventilated box. \n\nBeets cucumber salad: Only interesting dish. First time I've ever seen beets served at a Chinese restaurant. interesting concept but the beets was running red juice dyeing the peeled cucumbers all red. Could've been executed better and using a better dressing other than vinegar. I added soy sauce mixed with chili sauce and poured over it to give it more flavor.", "author": "p f."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-01", "description": "I can't for the life of me figure out how they got a single review above maybe 2-3 stars. The one star that I'm giving them here is because they were VERY clean. Probably the cleanest Chinese restaurant I've ever been in.\n\nThere was an endless stream of takeout when I went there tonight, so there must be *something* worth eating here. I can't figure out what that might be though.\n\nWe were a party of two, and neither of us enjoyed any of what we had. The service was S-L-O-W. Everything was completely lacking in any sort of flavor - the \"spicy\" garlic eggplant was way overcooked, incredibly mushy, and didn't taste like garlic or have any sort of spice to it whatsoever - it was mild as mild gets. The Singapore noodles tasted like onion and something that I couldn't quite put my finger on - neither my dining partner nor I could stomach more than a bite or two of it - and we had to force down those bites. \n\nThe pork bun was probably the most edible; but the filling was completely lacking in any flavor. The General Tsao's chicken had the most flavor, but it all seemed a bit like mystery meat.\n\nI guess I should have figured that this place wouldn't be very good, simply because it was mostly American Chinese staples, but even compared to other American Chinese places, it was pretty terrible. Definitely wouldn't return back here again.", "author": "Kyle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-15", "description": "We ordered delivery. It was great! Food arrived piping hot within an hour.\n\nCRAB CHEESE PUFFS - B+ \nWe love these but have had better.\n\nVEGGIE POT STICKERS - A+ \nNot part of our typical Chinese take-out order, but we just wanted some pot stickers. These had great veggies and were really flavorful. While crab cheese puffs are our normal go-to app, we'd just get the veggie pot stickers next time.\n\nGREEN BEANS - A+ \nWould order again. Great flavor.\n\nORANGE CHICKEN - A\nCrunchy, saucy, flavorful.\n\nWALNUT PRAWNS - B\nLarge portion. Tempura-style batter. Next time would order sauce on side. It soaked into batter there wasn't any by the time it got to our house. Probs would be an A in the restaurant.", "author": "Lani N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "I've now eaten in the restaurant three times and am very satisfied with the quality, presentation and taste of my three lunches. The decor is several degrees above the usual Chinese restaurant in this class, down to the soy sauce container and serving dishes. Service is quick and pleasant.\n\nI've not ordered take out, but my rule in doing so is to order and pick up. I doubt this restaurant or others like it can keep a staff of delivery people to whisk my dinner to me in 15  minutes at dinner rush hour. When I go and pick up, my food is much hotter and arrives at my house much quicker.", "author": "Laura A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "Favorite place to order for delivery. Chicken fried rice, seafood tofu soup, chow mein, garlic pea shoots. Good quality.", "author": "Johnson H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-26", "description": "Good food at good prices. Linch is served until 5! Lunch also comes with soup AND salad.", "author": "Ira S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-04", "description": "We waited over an hour and a half for delivery and had to call them to see where they were. We live less than a mile away from the restaurant 0.7 miles to be exact. They wanted us to walk 5-6 blocks from our home to a busy intersection to meet them to pick up our food. We even gave him exact directions over the phone. It's not hard to get to our place what so ever. When the guy finally showed up he was following some random car because those people had gps and were helping the delivery person out. I am just baffled by the whole ordeal! I don't think I have ever had such a terrible experience with food delivery! \nAnd the appetizers were completely cold, the main dishes were luke warm at best. Just terrible all around.", "author": "Mon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "Arived quicker than expected, and the food was still hot and crispy. I had the salt and pepper pork chop and the 4pcs shrimp dumplings. The dumplings were good and the pork chop was good. Delivery person was great too.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "This is now my go-to Chinese take-out/delivery place. If you want real, fresh and authentic Chinese food, this is where you want to go. \n\nI ordered: Seafood Fried Rice ($8.25), Dry Sauteed String Bean ($8.75), Dry Braised Chicken Wings ($11.95).\n\n-My little sister always has to order fried rice, so I assume she's a pretty good barometer to the fried rice standards of SF restaurants. She liked the fact that it was actually very sea foody in taste. Plenty of squid, prawn and scallops in the mix of rice and carefully patted eggs.\n\n-I'm always a sucker for string beans. They're crunchy and delectable. I wished I ordered it a little spicier. The dish also had delicious peppers, onions and a tasteful layer of vinegar sauce.\n\n-Dry braised chicken wings are bomb. Crunchy and juicy, like how a cannibal would describe eating your ears. Hmmm, not a good comparison. But you can't really get anything wrong with wings. They also added jalapenos and onions to it, giving it another brand of flavor. \n\nWhat sucks is that because this is a new restaurant, you don't really know what's hot and what's not. But this is still the place to go for Chinese food in the Mission.", "author": "Liping H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "We ordered broccoli beef and basil fried rice all came very good quality and perfectly on time considering that dinner doesn't start till 5pm and lots of places are closed not only for delivery but walking in. Very pleased with the food quality, service and the delivery time!", "author": "LOVEMYKIDS L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "Ordered for delivery here and it was fast. We ordered their orange chicken and salt and pepper pork. They weren't greasy at all.   We also pressed steamed veggies with tofu it was not cover d in tons of seasoning.  It's just steamed and perfectly blend veggies. The  shu mai was good too. It tasted fresh.  Definitely our go to Chinese take out. \n\nUpdate:\n\nStill the best Chinese food.", "author": "Marie Erika E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "This is one of the best Chinese restaurants in SF, and they just opened up last week! Check it out~ The place looks very nice and classy, service is excellent! \nTry the Kung Pao Chicken, it's very flavorful and the way they prepare it gave this authentic classic Chinese dish a new life; Walnut Shrimp is super refreshing and healthy; Order Mandarin Combo Clay Pot if you can't make up your mind what's to order. They nicely mixed with everything in your mind. The presentation of it is also one of the best!\nOh, did I mention the King Salmon Fillet, which it has asparagus on the side. Yum Yum Yum. \nGosh, there are just so many of them you have to try. If I were you, I would come by everyday and never get tire of it. \nDid I mention they do delivery too? Double thumbs up!!", "author": "Flora F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "They're OK ... a solid option. I knew to check them out because they'd left menus on my doorstep two days out of three (the thirst is real!) ... I found meats to be a bit fatty for my taste, but tihs could be a one-off problem. Delivery was within an hour--OK for a busy Friday night. \n\nWIll definitely try again ...", "author": "Henry M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-23", "description": "I went in with a group of friends and ordered a bunch of food then shared and potluck-style.\n\nFor the price, the food was collectively good. My personal favorite is the duck which comes with broccoli... YUM!\n\nOn a side note, I the Mandarin Orange Chicken one of my friends ordered was good. I was expecting less, but was caught off guard by the Chicken... it tasted GREAT and was definitely EDIBLE.\n\nToo bad I forgot to take photos, the food looked really good, but I was motivated to eat it right away before I could snap a photo since I was hungry lol.", "author": "Nicu L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-14", "description": "Pretty fast delivery. I ordered General Tsao's chicken, mild spiciness, it was delicious! I also ordered the chow mein,was good but didn't have a lot of flavor.", "author": "Crystal R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "I've ordered take out here through Eat24 a handful of times and have not been let down once. They always deliver before the estimated time and the food is always nice and hot. I've tried their general tso chicken, Chinese broccoli, pork fried rice, vegetarian spring rolls, hot and sour soup, pork buns, pot stickers--literally everything is great quality and very flavorful! This is my go-to for awesome Chinese take out. The hot and sour soup is perfect when you're sick! I always get a large which makes about 2 big full bowls.", "author": "Mandy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Fresh Fresh Fresh\nBig portions, every dish was yummy. My favorite is the Salt and Pepper pork chops. The general tsao chicken was cooked to perfection. The steamed veggies were perfectly cooked. Definitely will order from here always.", "author": "Theresa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "This Little Gem not too far from my casa was pretty amazing. Service was impeccable. Jack was super friendly and explained how he only uses the best quality meats and produce for his dishes and trust me u can tell. Damn good quality. Highly recommended. Jack Seemed like a great dude and I hope his Restaurant is a huge success. Hopefully not too soon tho. Wanna take advantage of the peaceful dining while it lasts lol. \n\nWe had the Sampler appetizer dish, Mandarin Claypot, Walnut prawns, Beef chowmein, Pot stickers, combo wonton soup & fried rice. All excellent. Grammas picky and she tore it up. Thank u.", "author": "Ramon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "My girlfriend and I stumbled across this place randomly only to discover that they opened two days ago, and we decided to take a chance.  It's a solid American Chinese place with standard fare, but every dish was excellently prepared. Probably the best crab rangoons I've had! The General Tsao's chicken was super crunchy and delicious, BBQ pork chow mein was very flavorful and not too greasy, and the spicy garlic eggplant took the cake as our favorite dish.  Attentive staff, cute cozy interior with a slightly upscale feel and modern interior make it good for a date night.  Would definitely come back to try more of their dishes!", "author": "Alex L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "Tried it for the first time last night.  They've been open about six months now.  We sent our order in via Yelp and went to pick it up.  (First experience with this EAT24 UI - it was pretty well done.)  It took them about 40 minutes to prepare this.  They gave us some hot tea while we waited.\n\nVEGGIE POT STICKERS - $5.95 - B+\nSix of 'em.  Some places make 'em bigger, but usually those are pretty bland.  These had a nice flavor to them I could not name.\n\nLEMON CHICKEN - $9.50 - C\nI thought this was pretty dry and not that lemony, but my 8 year old daughter would give it an A.  No skin, no batter, but a seared surface.  I think that's fine as an approach, but again I think it was overcooked.\n\nBEEF CHOW FUN - $7.25 - B+/A-\nI think this is a dish that's generally good at most places.  Usually the sin is too greasy or doesn't have that scalding wok burn, but this was fine.\n\nEGGPLANT SPICY GARLIC SAUCE - $8.75 - B\nGood flavor, maybe a little on the too sweet side and not very spicy for \"medium.\"  Eggplant cooked on the less firm side.\n\nSEAFOOD COMBO CLAY POT -- $11.95 - A-\nMy favorite of the night, even without the clay pot.  The seafood was all fresh, solid, and cooked just right.  The veggies and the sauce were also just right.\n\nGARLIC PEA SPROUT - $9.50 - B/B+\nThese were the thicker kind, almost like spinach or Italian broccoli.  A classic Cantonese taste, great on first bite, but maybe a little salty.\n\nI'll definitely order from them again.  Restaurants like this need support to stay in business and this is a tough stretch of Mission for restaurants.", "author": "G M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-04", "description": "Worst Mandarin Orange Chicken in San Francisco \n\nToday, I ordered the most horrible Chinese Food EVER!  So I emailed a complaint:\n\nTony: \nHello XXX Representative,\nI just received my order. \nThe Orange Chicken is OVERCOOKED / DEEP FRIED. \nIt taste HORRIBLE and is UNEATABLE.\nIt taste as if it has been cocked twice & then burned [definitely can't taste the chicken]. \n\nAlso, it came without RICE! \n\nA very very disappointing experience. \nAnd if you don't believe me; you are more than welcome to come have a taste before I throw it IN THE TRASH!  #wtf\n\nXXX Representative:\nThank you for contacting us. We definitely want to apologize about the experience you have receieved. Can you please forward us a picture of the chicken? In addition, would you like us to contact the restaurant for a possible redelivery? We want you to have fresh food. Let us know what we could do to make this up to you. =)\n\nTony:\nI hope the afternoon is treating you well.\n\nAbsolutely no redelivery.\nPhotos is attached to this email.\nTotal credit card refund plus compensation for time loss would be acceptable (cause i still haven't had my lunch).\n\nThank you for a timely response,\n\nXXX Representative:\nThank you for getting back to us with those pictures. We went ahead and refunded you for the deep fried orange chicken. We definitely do not want this to happen to you again so we will follow this up with the restaurant to make sure they are sending out the correct items. In addition, I can give you future coupon codes for your next orders. I hope this helps. Have a great evening!! \n\nConclusion:\nSometimes you just have to OPEN YOUR MOUTH! [laugh] ...\n\n#food #chinesefood #recipe #bad #review #justsaying", "author": "Tony E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "Omg I thought I would never find an excellent chinese food place here! I must say that the food is really delicious and fresh. \nI ordered: Crab Puffs, Special B Bento Box, and Meatless Sweet and Sour! \nI can taste how fresh the food is and it's perfect. Not too sweet nor salty. \nI am already thinking about placing another order because it's that good. \nI ordered off of the yelp app and the delivery person was very nice. \nThis is my own opinion on this restaurant as I just got a flyer on the door. \nAlso, I love the ziplock bag with the spoons and forks, never seen an other restaurant do that.", "author": "Star S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-18", "description": "Only ordered delivery from here about 4 times. It's been consistently good food and I usually get chow mein, generals chicken, pork chops and the dim sum. All are really good for delivery.", "author": "Ron P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "The food here is really great! Definitely try their Mandarin Combo Clay Pot, it goes super well with rice. Also get their dry braised chicken wings, its comes super hot and crispy and taste really delicious.\n\nI would highly recommend visiting mandarin house if you're in SF, its one of the to go places for Chinese food if you're in SF.", "author": "Wai Khit L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "Some of the best takeout/delivery Chinese I've had in the city. Usually have it every other wee. Quick delivery, food was perfect temperature when it arrived and is good for leftovers. Highly recommended.", "author": "Don S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "Ordered right upon arrival at our AirBnb and they did not disappoint. Ordering was a breeze, delivery was quick, food was great!  Loved that freebies come with cash payment. The General Tsao chicken, honey walnut shrimp and fried rice are must haves.", "author": "Candy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "Ordered The dry braised chicken wings for a party. They were a big hit, should have ordered another tray.", "author": "Jenn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-10", "description": "Very good Chinese take out. Everything was delicious especially the fried tofu string bean with salt pepper. However, I am slightly weary about the poor food safety score.", "author": "Ting Ting C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "I found Mandarin House on Eat 24 and I have to say it's the best Chinese food I've ever had. Everything I've eaten is delicious. I could eat their food every day!!!", "author": "Monica B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-01", "description": "the food tasted bland and boring.Tastes like expensive panda express, but like their throw out food.", "author": "Spanishderp .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "This place is great! The service is fast and all of the dishes I've tried have been good. I especially like the Peking duck.", "author": "Diana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "A friend introduced me to this restaurant.  He has been here numerous times so he can  vouch for the wonderful flavor which comes out of this establishment.  First off, we allowed the waiter to order for us since he knows what is good here.  The waiter ordered wonton soup, grilled salmon with asparagus, and sauteed lamb.  My friend ordered their popular appetizer; anchovy popcorn from their appetizer listing.  The popcorn was tossed with hot stir fried anchovies and sprinkles of furikake; very addictive! The wonton was filled with lots of tasty meat goodness; and the segments of lamb was tender, and savory.  Service was impeccable!", "author": "Nanette L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-20", "description": "This was my favorite Chinese restaurant to order take out from until today. I ordered through Eat24 as I always do and requested a specific time and left specific directions which door to come to since my apartment community has several lobbies. The delivery man called me at 3:32pm and I explained I had already sent my husband down an apologized for missing his last call because I have a newborn baby that was crying and was still crying at this point. After 10 minutes my fiancé couldn't find him so I went down with the baby in the stroller. As I was making my way downstairs the delivery man called again, this time raising his voice telling me how confusing my apartment building is and I explained that's why I left specific directions. He began yelling louder over me so I told him to just leave if he was going to be disrespectful. I still went downstairs to where he claimed to be and no one was there. I went back home upset and called Eat24 whom provided a full refund and were just as appalled as I was. I later got an email from Eat24 stating that the delivery man was the OWNER and claimed my food was delivered and wanted me to be charged. Well I don't know who you delivered to pal because I never got my food. Luckily Eat24 took my side. The owner mentioned he will never serve me again, which is fine by me. No paying customer deserves to be spoken in such a degrading manner like he did to me today. I will GLADLY never order or eat from here again.", "author": "Lydia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "Oh Mandarin House SF I know it's new in our relationship but I'm in love with your food. Have you ever had left overs, someone ate them, so you ordered more food from the same place? That just happened. I've prefer from here twice in two days. They also deliver to Hunters Point which would earn them 3 stars alone. I haven't had anything I didn't like. I've order the garlic broccoli, combo fried rice, combo chow mein, salt and pepper pork chops, BBQ pork buns, general tsao chicken, basil chicken, pot stickers, spicy house fried rice, and the double mushrooms w/ baby bok choy. Everything as been hot when delivered in 45 minutes (I've only done delivery), nothing is greasy, and everything has independent and great flavor. Seriously some I the best Chinese food I've ever had!", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-23", "description": "Ate roasted pork, duck, dumpling, iced Thai tea. The people in my group had other varieties.\n\nI would recommend eating here. It's one the better places in SF.\n\nSeriously, just come try it out.", "author": "Bryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-03", "description": "We've ordered a few more times, and this place continues to impress. Delivery is fast, food is still piping hot and tastes very fresh. So delighted to have this place within delivery range!", "author": "Caroline P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "it's great to have this kind of family restaurants were you can have good food.\nthe menu has lots of delicious dishes\ntheir food and service is really good,\nwe love the roasted duck and vegetarians spring rolls,\njust talking about it, my stomach craves it,\nI highly recommend the pot stickers..", "author": "Ben G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-10", "description": "Newly opened and was on Eat24 for delivery to my home, so why not?  It should be a NOT. I placed 1 order of combo won ton soup and chicken chow fun. I agreed to pay tip in cash, but when the driver came, I forgot...and the driver did not let me forget about his tip. Before he stepped out the car, he looked at my hands and saw me not reachin for cash. His automatic response was, \" it says you tip cash\" after he heard me say,\" oh no i forgot, is there any way to add onto it through my phone? \"He looked at me and gave me one of the meanest stares ever. HE SAID, \"NO, NOT POSSIBLE!\" I asked him to check and he went back to the car with the food and brought out the paper and pen. Told me to add tip here and sign. I said i was sorry about the cash and he did not reply back to me...no words. He just went back into his prius and left! I totally get that you are mad about me not having cash on hand. But it was easily fixable. ( which was after I got the email confirmation). I am usually very turned off by people who EXPECT A TIP, in this case, i was at fault so i obliged with a decent amount for him.\n\nOnto  what was wrong with the food- \n\nMy chow fun was half spilled into the bag. I guess the person packing didnt clasp the plastics well enough while it was en route to my home. It was bland and greasy! Yes, chow fun in itself is greasy, but this was an additional amount.  I could taste the oil.more than the salt amount! They did give a good amount, but again, no flavor. \n\nI asked for a spoon and chopsticks and chili sauce. \n\nNo spoon, no chopstick..no chili sauce....but 2 forks... how do I eat soup with no spoon? \n\nSoup- bland, greasy, and you can totally taste the msg in this soup. Msg will ruin your food and bones!\n\nI will never order from this restaurant ever again! \n\nBLAND, CARELESS PACKAGING, NO CONDIMENTS, WRONG UTENSILS, MSG. DRIVER WAS SCARY AND RUDE. ALL BAD.", "author": "Teeds K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "Great, quick service, good food, great for delivery in the Glen Park / Bernal Heights area!", "author": "Garrett S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-16", "description": "This place is legit. I've ordered twice since transitioning from another go-to spot in SF.", "author": "Gabriel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "I have received delivery from them over a dozen times. love their chef special eggplant, Mongolian need, and string beans. I always get their stuff delivered. It's very tasty and big portions. Their dim sum is OK.", "author": "A L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "Great food and fast service. We love the spicy eggplant it was perfect. The crispy noodle was also very tasty too. We highly recommend this restaurant.", "author": "Veaz Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "This place never disappoints me. Great food, reasonable price. College life is lazy so I get a lot of delivery from here. Sometimes they are early, sometimes they are on time. Overall a good place to eat in and out.", "author": "Ashib R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "What a deal! Lunch specials all under $9 that are accompanied by free soup, salad and rice. Top quality produce and meats, not too greasy but still with that familiar take-out Americanized Chinese food we all love. Will definitely be back when the craving strikes.", "author": "emma l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-08", "description": "It doesn't take much to make me happy... hot rice, flavorful food, not too greasy...\n\nThe only point Mandarin Chinese got was \"not to greasy.\"\n\nThe rice came cold.  The Mongolian Beef had a very weird texture, had an odd, and unpleasant, flavor - and was not spicy at all (even though I choose spicy instead of mild or medium). The Green Onion Pancake wasn't bad, but had almost NO onion in it.  The Hot and Sour soup as a bitter after taste.\n\nThe only thing that was really edible was the pancakes and the sesame chicken (and the rice after it was in the microwave).\n\nStay away.", "author": "P K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-14", "description": "Great meal. Chow mein was off the hook. Would highly recommend.  Chicken wing a little under cooked but no biggie. Fast delivery", "author": "Manuel A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-17", "description": "11:07am: Normally I'd wake up impossibly hungover on a Sunday and place my order immediately. This morning I got distracted by this new Future mixtape and didn't place my order right away. They just opened though so how busy could they be?\n\n11:15am: I'd give this hangover 3/5 stars. I've definitely felt worse. \n\n11:29am: WHOA. My food has arrived. How is that even possible? Very impressed. Let me switch the music up and settle in for this meal.\n\n11:32am: The \"Chef's special pea sprouts with fish filet\" is really good. The fish is a rock cod, I believe, and it's perfectly cooked. The pea sprouts are fresh, tender and delicious.\n\nThis other thing...what is this thing...the \"Sahd pepper meatless chicken\" is so fucking disrespectful. It's just fried meatless chicken with no sauce tossed in a plastic box with a few jalapeño slices and a little (very little) bit of chopped peppers & onion. It's flavorless af. Like, imagine Mitt Romney trying to dance. No flavor. How is this even a recipe? Did they forget a step? I'm desperately seeking out the jalapeño slices just so my tastebuds can experience *something*. I could give this zero stars and still feel the urge for petty revenge.\n\n11:38am: Pea sprouts are underrated; I wish I saw them on menus more often.\n\n11:54am: Really mixed feelings about this meal. Delivery time was 5/5 but my two dishes were 4/5 and 1/5. Even if I assume that \"Sahd pepper\" is some extraordinary typo and this was supposed to be \"salt and pepper\" meatless chicken it was still complete trash and would rank in my Top 1 worst salt and pepper dishes ever.\n\nI'll give them a shot again next time and see if the food is better. For now, 3 stars.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-10", "description": "Ordered for delivery...ordered two things and both were terrible ...do not get the red oil wontons. The sauce is ok but the actual wontons are disgusting. I don't normally write reviews unless the place is exceptionally good or exceptionally bad. Guess which this falls under! And what Chinese food place doesn't give you white rice? I didn't even think I needed to specifically order this but I guess I do. :( Ordered this off of EAT24 as they rated it 4 stars. What a joke!", "author": "Luis R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "I have ordered twice now - BBQ pork fried rice and Mongolian beef. Both times my delivery was received in a timely matter and the food was still hot. The packaging was also pretty chic, considering it was takeout. Considering I ordered again from this place, I enjoyed both dishes. Probably my go-to from here on out when I'm craving delivery Chinese.", "author": "Stacy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "The health warning is a result of miscommunication! This restaurant has really tasty offerings (I love the orange chicken and roast duck lunch specials), a friendly staff, and a very clean dining room and kitchen. In fact, since I've been a customer (past 6 months), I've always been impressed by the cleanliness of this place (and by the quality and quantity of the yummy menu selections). I will continue to eat here weekly and hope others will discover this little Bernal gem.", "author": "Alan P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-07", "description": "Ordered from Eat24 hour so not sure if the in person experience would be any different but the food was not good.  Sweet and Sour Pork as well as Sesame Chicken were both hard and had a ton of gristle meat.  Fried rice had no flavor at all.  Would pass over this no matter how bad my hunger was.", "author": "Jon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "I like the foods and delivery service here. I'm very impressed when they followed through their promises. Definitely gotta try out their Pea Sprout with fish fillet...the Pea Sprout is so freshly green and tender, fish fillet taste fresh as well. Definitely I'll continue to order to go from them.", "author": "Son T V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-06", "description": "I agree with others who say the food is very clean, but unfortunately, it was also tasteless. I didn't finish my meal and didn't even want to save it for leftovers.", "author": "Eater S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "Solid chinese food options with ample mu shu (although extra pancakes + plum sauce ideal), potstickers, and traditional well-done chicken dishes (Kung Pao et al) that I've tried.", "author": "Conor M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "I had my spot for go-to Chinese food when I lived in Outer Richmond many moons ago. Nothing has quite compared to it until I stumbled upon Mandarin House. OMG everything was SO good! I was really craving some egg rolls and these hit the spot. Not greasy at all and very crispy. I placed a to-go order and it was ready super fast (I was there around 5:30 on a Thursday) and took the bus home- which was another 30 mins until I got to eat all my delicious things. You would think that a 30 min bus ride would have my food be cold...wrong! My food was as hot as if I was eating at the restaurant. I ordered the orange chicken and vegetable fried rice along with my dreamy egg rolls. Highly recommended! Will be back :)", "author": "Marissa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-22", "description": "I have just ordered from this place for the first and last time. Only one of the three dishes I ordered was correct. I ordered chicken with mixed veggies and got no chicken, the vegetables were not good, bland over, cooked and lots of squash. I also ordered sesame beef, but honestly I don't know what meat I ate it was certainly not beef or chicken. They did manage to get the green beans delivered but as my dining companion said \"they didn't treat them with respect, way over cooked\"", "author": "Samuel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "Good restaurant for meals, definitely will come back! The salmon with asparagus is good to try! The restaurant is very clean and nice!", "author": "Sue H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "We discovered Mandarin House about a month after it's opening. It is a cozy welcoming place with very friendly staff. Our meal was very well prepared with fresh quality ingredients and nicely seasoned entries. The new co-owner came to our table to make sure we were pleased, and indeed we were satisfied. This new restaurant definitely deserves a visit.", "author": "Linda K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-21", "description": "We've ordered delivery 3 times in the past 2 months. The first time was pretty good but only ordered veggies. Second time not so good. Tonight whole dishes were rejected by all 4 members of our family. Just gross.", "author": "Maria G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-27", "description": "Ordered delivery....veggie spring rolls and meatless general tso's chicken. Really not great. Sauce was spilled all over the bag, food had a terrible aftertaste, vegetables were either very overcooked (limp broccoli) or very undercooked (crunchy sweet potato - I think). Won't order again.", "author": "Lyndsey S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-10", "description": "We ordered delivery.\n\n- food: unusual, undesirable flavors in egg rolls and sweat and sour pork\n- staff: n/a\n- atmosphere: n/a\n- price: normal for Chinese food restaurants\n\nadditional info:\n- braised chicken wings were the standout item", "author": "J. B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-02", "description": "Sorry to throw down a neg review, but the food we had delivered from here was flavorless and greasy. Pretty sub par, you can do better on Mission for chinese.", "author": "Joel W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "I just ordered dinner from Mandarin House and it was very very delicious.  I ordered Cashew chicken and it was full of white meat chicken and vegetables and cashews.  Yum.  I also had hot and sour soup with pork and that also was delicious.  Mandarin House is now my go to Chinese restaurant.  Delivery was swift.  Food delicious.  What more do you want?", "author": "susan k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-19", "description": "I chose home delivery through the Yelp app. Service was quick and the delivery person was courteous. The spicy eggplant was good, with a medium kick and an aromatic sauce. Unfortunately, the other food wasn't anything special. The mushu vegetables weren't flavorful or fresh, the accompanying plum sauce was bland and the rice wraps fell apart. The vegetarian spring rolls had no flavor at all, and no dipping sauces were included with the order. Other traditional dishes may be better choices...", "author": "Lara K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "Super delicious and really friendly! They had really good fake meat options, you have to try the Mango Fake Chicken, and equally tasty chicken and seafood. The portions are substantial and not overly expensive. I will definitely come back!", "author": "Allegra M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "Great Chinese food. Totally in love with this place, my favorite take-out I've had since moving to SF. I hope they get a neon sign out on Mission so they get even more business! I am such a fan. delicious, delicious food. I especially like their Egg Flower soup and pork fried rice. They have plenty of healthy and veggie (steamed or sauteed) options, as well as a bunch of great appetizers.", "author": "Presley P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "Such a great new spot. The owner is very passionate about his food, and only uses high quality, fresh ingredients. I've only come in once and tried the duck which was amazing, but the owner tells me that the Salmon is one of his most special dishes. Definitely will be coming back.", "author": "Aljosha N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "There orange chicken & BBQ pork fried rice is so good!!!! It's a must try.", "author": "Andrea C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "absolutely love this place. have only gotten delivery so far, and the sesame chicken never disappoints. delicious fried rice and chow main and fun as well. lots of veggies if you order the veggie version. bok choi FTW!", "author": "ana f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "Best Chinese Delivery Around. Have ordered 6+ times and has been totally consistent and delish!", "author": "dave g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "My girlfriend and I are vegetarians, and we've often been a bit underwhelmed when we order Chinese (it usually just lacks in flavor - I'm guessing the meat dishes are where it's at). We were SO pleasantly surprised when we ordered meatless kung pao chicken, fried rice, and veggie chow mein from Mandarin House. All of it was DELICIOUS. This is definitely our go-to Chinese restaurant from now on.", "author": "Jocelyn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "Tonight was my first time eating their food and it was unbelievably delicious. We got the Mongolian beef, chicken fried rice, 2 meatless chicken dishes (general tsao and salt and pepper meatless chicken) and veggie chow mein. The meat was tender and flavorful (heck, even the meatless meat was tender and flavorful) and the rice was fluffy, golden, fresh and delicious. The meatless offerings are as good as (if not better than) the meatless menu at Wonderland in the Haight and I think it is way better than Win Garden in Glen Park. I echo everyone else in the neighborhood who has been super stoked to find this gem. I was very surprised to see it pop up on Yelp because I have tried for so long to find good Chinese food nearby and have had many overpriced, mediocre experiences. Here, the portion sizes are generous and prices are reasonable. We got takeout this time, but the joint looks clean and pleasant and the wait staff was so polite and sweet when we picked up the food that we may eat there next time. This place is fantastic and I look forward to trying more of their food- I hope they survive! Everyone, quick go and order something. :)", "author": "Zika R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "Nice ambient, reasonable price, yummy foods. Ordered the house spicy fried rice and cumin lamb today. Both taste pretty good!", "author": "Cuina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-23", "description": "Freakin' best Chinese food I've had in my life. I disagree with some reviewers saying that the food was bad//overcooked. I tried the dumpings, the chowmein, the duck, and a whole lot of other foods and found the food to be perfect. I would recommend people to go here at least once in their lifetime, you will not regret it!", "author": "David C."}
