{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-26", "description": "A modest place with a friendly, attentive waitress. \n\nWe ordered:\nCarmen's Special (tasty but a bit greasy)\nChicken Pad-Ke-Meo (tasty but a bit greasy)\nRock Cod with String Beans (tasty and cod was fresh)\nSeafood Basil (tasty and seafood was fresh)\n\nSo the verdict was the food was good, ingredients fresh, but some of the dishes are slightly on the greasy side.", "author": "Sherry H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-08", "description": "Decent Thai restaurant in my neighborhood. Pretty generic, but they do have cheap prices and aren't super busy so you can count on not having to wait!\n\nTHE WAIT: None for 2 at 7pm on a Thursday night. They weren't empty and had customers, but no one had to wait for a table. \n\nTHE COST: $35 total for dinner for 2. Very reasonable! \n\nTHE FOOD: \n\nAPPETIZERS\n4. Roti w/ yellow curry $5.95 - 3.5 stars. Nice crisp, but could have more layers/be more crispy. Curry has chicken!\n\nSAUTEED DISHES\n21. Fresh Ginger w/ Mushrooms, chicken added ($9.75) - 3 stars. Strong ginger flavor, but the chicken was dry.\n\nFRIED RICE & NOODLES\n69. Pad Sa-Ew ($9.95) - 3 stars. Underflavored, & could use more beef (thought it was rather tender), egg, & broccoli.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Very reasonable prices! The pad Thai was a little too greasy for me but the portion was enough and customer service was nice.", "author": "Rose C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Nice, clean, quiet restaurant. The food tasted good and plate sizes were perfect. I'll be coming here more often as my neighborhood Thai stop.", "author": "Jorge P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-13", "description": "Food is great and the quality is excellent.  Portions are very good. The taste is incredible and the ambiance is transforming. The decor is authentic and very clean. Service is fast and friendly. You'll enjoy this spot. Highly recommend their Pad Thai or Chefs Combo. Delightful", "author": "Salvador G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "I've been here 20 times because it's a pretty decent thai food right next to work!\n\nPad Thai- I got this every single time, and it had NEVER failed! Delicious!!\nDuck Curry- Lacking in the meat, but the curry was delicious\nPad Sa-Ew- A bit overly salty \nPrawns and Scallop with coconut milk-this one is not worth it, the flavor was a bit plain, and I think there were only two prawns and TWO scallops!\n\nThai ice tea- So good!\n\nOverall, this place is some place I will frequent when I crave for thai because of the location and their pad thai is pretty darn good! However, if you want a more unique thai food selection, walk to Farmhouse Thai!", "author": "Josie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "I love this place!  However, I know this says Thai food, but my mom makes dishes just like these at home and we are Lao.  My bf suggested this place on a Friday night and with a name like Manivanh how were we to go wrong?\n\nWhen we stepped in I wasn't too impressed, wasn't super clean but wasn't disgusting either, and I know it sounds like a bad review but I promise it isn't!\n\nWe ordered the fried pork rolls, BBQ pork, and red chicken curry with rice to share.  The fried rolls were ok, they came piping hot so be careful!  The sauce that came with it tasted like something I could get at the local Chinese market, so nothing fantastic.\n\nHowever the BBQ pork and the curry?? To die for!  Both dishes taste just like how my mom makes it at home.  There's a dipping sauce that I'm sure the base is a mixture of soy and fish sauce that goes perfect with the pork.  And the red curry... excellent!  The chicken was so tender and the curry was do flavorful and service with bamboo and bell peppers.  The only thing that was missing were Thai eggplant and potatoes.  Definitely reminds me of my moms home cooking.  And the rice came in a silver metallic container, very legit.  \n\nI'm definitely coming back and definitely recommending this place for everyone!", "author": "Nyla K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Neighborhood Thai place with reliably great Thai. Won an award for \"Best Thai Food Where You'd Least Expect It\"\n\nFOOD: \n* Outstanding item here is the tom kha gai (spicy coconut soup... ask for it a little spicier)! I have yet to find one with a better flavor balance in the Bay Area\n- Noodle dishes (pad thai, pad ki mao) well flavored, but can run a little greasy (compared to Farmhouse or Lers Ros)\n- Curries are heavy on the coconut milk--they definitely use the good stuff and I always leave very full :)\n- Thai iced tea is solid\n\nSERVICE:\nIncredibly friendly. This is a neighborhood place with the same servers and they are very patient with my equivocation pre-order!\n\nAMBIANCE: \nCasual family place that can fit quite a few groups, once you take the second room (connected through a passageway) into account. I appreciate that the second room is walled off, as it keeps the feeling of the restaurant intimate for all diners. It can get a little warm in the summer (no AC last time I was there), though a Thai Iced Tea or Vietnamese Iced Coffee can certainly help with the heat :)", "author": "Helen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "Whenever I'm in the mood for Thai food and I'm in the neighborhood, Manivanh is my go-to place.  There's a real homey vibe to the restaurant, and I've never had an issue getting a table during lunch or dinner hours.  Most recently, I've been a fan of their garlic fried rice, which is so simple yet tasty!  They also have a new roti appetizer with a curry dipping sauce (with a variety of flavor options to choose from)- I tried it with the yellow curry sauce and thought it was amazing!   I'm also a fan of their sautéed dishes, and a recent favorite was their cashews with crispy chili.  I tried their roast duck with basil during my last visit, and while I thought the flavors were on point, I wished that the duck had a crispier texture.  \n\nManivanh is definitely a solid option for Thai food, especially if you are near San Francisco General Hospital!", "author": "Keith H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Always always always have to stop here for pad Thai when I'm in the city. It never disappoints. It has the balance that you look for in pad Thai. Their yellow curry and fish cakes are tasty too. One thing is they're closed from 2-5 (?) which is a bummer bc it wasn't listed on yelp, but definitely worth a trip if you're around the area.", "author": "Kristine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-14", "description": "Great place for Thai food. The staff is very friendly and the preparation times for food are really quick. I made a reservation, but it wasn't really necessary--despite the great food, the restaurant never filled up between 6 and 8pm. \n\nI got the Red Duck Curry with jasmine rice on the side, and it was delicious! The duck was very succulent and the curry sauce had enough spices to give it flavor, but not more than was needed. Additionally, my friend got the Pad Thai and she said that it was \"a good mix of spices, not dominated by peanut sauce.\"\n\nMy only complaint was that the portions were pretty small. We had a vietnamese-thai place back in college that had substantially larger portions for a cheaper price, so I can't give this place 5-stars. But, it's definitely worth the visit!", "author": "Vasiliy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "This restaurant is pretty small, so beware of that when planning on eating here. It has a nice ambience, but the service isn't the best they aren't super polite or very patient.\n\nThey have a good selection of dishes and the food is quite good. We got the chicken pad thai, chicken green curry and pad see ew. My favorite dish was the pad see ew, but all the other dishes were pretty good. I like this place and I wouldn't mind coming back here in the future.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-11", "description": "This place is a fine staple when we don't want to cook and don't mind walking 4 blocks each way. The food is fairly good and reliable, but nothing has been a stand out dish. We probably would never take guests here.", "author": "Tracy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-10", "description": "Manivanh doesn't look like too much from the outside, and it can be easy to miss. The food is similar--it's your standard Thai, nothing remarkable.\n\nThe restaurant is split into two halves, and the family only keeps one half open unless it's incredibly busy, which I've never seen. They make decent pad thai and pad kee mao, although the tom yum is a bit watery. Chili Cha Cha 2, another Thai restaurant, is located just a few blocks west on 24th. If I'm in the area and craving Thai, I prefer CCC2 as it's a bit better and cheaper.", "author": "Tim X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-13", "description": "Mediocre food and even more disappointing customer service. small portions for the price Waitress was rude . Was not accommodating. Don't try to make substitutions.", "author": "Micmic W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-17", "description": "This was disappointing -- surprisingly expensive for bland pad see ew and bland papaya salad. Neither was remotely spicy.", "author": "Ted M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-01", "description": "This restaurant is NOT a great place for celiacs or those not eating gluten. I was told I could eat 2 dishes on the menu. The server did her best to accommodate me, but she was actually judgmental that I didn't know if I was allergic to fish sauce even though she couldn't tell me the ingredients used. Really??? All of their curries are pre-made and have gluten in them. My friends really liked their dishes though...", "author": "Rebecca F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-27", "description": "This place has a decent pad see ew, but its green curry is quite thin and a bit different from a typical thai restaurant, and I didn't like it very much.\n\nIt's also somewhat more expensive than Chili-Cha-Cha 2, at least for the dishes that I generally order. Not worth making a special trip to come eat here, but if it's on the way to home or close, then it's a passable place to grab some food.", "author": "Alexander L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "Great little find on 24th. \n\nFood & Service was excellent.  Loved every dish we ordered - cod, pad thai, chicken eggplant, and green curry - it was all so delicious.\n\nIt's further to go than my 'go to' neighborhood restaurant, but definitely worth the jaunt.", "author": "Gina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-06", "description": "Not your typical thai food.  Meaning it's bad. I barely finished my green curry with shrimp. I should have known that the layer of oil on top and light green color and the consistency of water wouldn't be a recipe for success.   Crossed this off of the local list.  Sticking with Pad Thai, Farmhouse, and Basil Thai.", "author": "A A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "Excellent homemade food. So tasty, great portions and very reasonably priced. Will definitely be back again!", "author": "Lissette I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "Staff are friendly and the food is just fine and well priced. I eat here regularly, both for sit down and takeaway. \n\nI took one star because they need to work on their fresh veggies, rather than use the use the frozen premix that came with one veggie entre I ordered. Every meat dish I've had has been great, and you can tell that the veggies they use most often actually are fresh (enough).\n\nThe roti is the best appetizer. Super oily but really delicious.", "author": "Nick K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "A good way to tell if a place is worth trying is by who frequents it the most. Manivanh Thai is always filled with staff from SFGH. It's one of my favorite places when I'm craving Thai food. I usually order their spinach in peanut sauce with chicken. They also have great Pad Thai and Pad Se Ew. There's a good amount of seating and you can order take out too.", "author": "Angela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "This has long since been one of my favorite thai places in the city, and now that Mai Thai closed (RIP), it's officially my favorite. \n\nThe important part is, the food is exceptional, and the prices are very good. I'm particularly fond of their pad thai - it's not quite what I'd call a traditional recipe, but I love the way they handle the vinegar and peanut flavors, it really makes for a flavor sensation I've not had anywhere else. SF seems to have a weirdly large number of good thai places that have medicore pad thai in particular, so this was truly a special find.\n\nEverything else I've had has been wonderful, too - I love their curries (panang and red being favorites), and their Chicken Basil (Gapow?)\n\nI get takeout a lot because I am a bit of a stickler about managing my time, but I have eaten in once, and it's a nice experience. There's a lot of tables inside, since they have two rooms next door to each other, so I've never seen there be a wait.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "I've lived around the corner from this place for many years and never tried it until the other day and i was surprised ! The food is really good and they give fair portions for the price- will def be coming here for my Thai food", "author": "Lupe G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-21", "description": "Great go-to spot in the mission for thai. Chef's clear broth soup is a yum.", "author": "Daco X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "Good stuff! The Pad Thai was a little bit too moist; but I also hate dry pad thai. It's a delicate balance that needs to be struck and this was just a near miss. Service was quick, and the food tasty!", "author": "Leo I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-14", "description": "Great to have thai instead of cafeteria food. Lunch is quick enough.  Have only ordered Yellow curry with brown rice.  Just hit the spot.   Their thai tea is way too sweet.  Great aervice.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Best Thai food in SF, in my opinion. They are traditional, authentic, flavorful, great service, and the prices aren't jacked up either! Thank u all for always satisfying my cravings", "author": "LoveAlways J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-21", "description": "Never coming here again. I had the BBQ pork and it was okay but service was absolutely horrendous. Rude waitress was too busy talking on the phone and declined to give me tap water when I asked. Disappointed.", "author": "Vishnu H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-21", "description": "My go to if I'm ever craving Asian during work. Short walk from SFGH. The service is friendly and the food is pretty good. Pad See Ew is my go to, but there are always noodles stuck together, so I'll have a block of noodle with no flavor. I wish they gave more protein; I always end up with too much noodle and bean sprouts and not enough chicken or tofu.\n\nPortion size is a little small. I usually can't eat more than half a meal at a Thai place, but I'm able to finish this one in one sitting.\n\nOne thing that bothers me is that I'll call in an order, and even if I add extra time before I go pick it up (if they say ready in 20, I'll get there in 30), I still have to wait another 5-10 minutes since they're not done with my order. Kind of a bummer.", "author": "Denise L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-07", "description": "Quiet, cozy little place in the Mission. The service is really warm and friendly. I had a simple dinner with a colleague on a Wednesday evening. \n\nI ordered the pad see ew. I've had far better in many Thai places, but this wasn't disappointing. Pretty good portions and decent Thai food.", "author": "Priti K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-09", "description": "What a terrible experience my friend and I had last Thursday June 7 at this Thai restaurant. As soon as we walked in, we didn't feel welcomed at all. There was only one more patron waiting for a take out order, and the rest of the restaurant was empty. Maybe that is why we got such poor service from the waitress. First, when I ordered my drink, a Heineken, she clearly lied about being out of it, and \"forced\" me to buy the imported beer that was more expensive. Then, after serving our meals, she never came back to see if we needed anything extra, and when I tried to get her attention to get an extra napkin, she ignored me and pretended she couldn't hear me; so I ended grabbing one from the next table. And after that, she just came to tell us that they were closing in 10 mins., which \"forced\" us to swallow the other half of the plate and drink very fast, giving me a slight stomach age. Lastly, she came with a bill that we had requested to split in half and which she hadn't split, and my friend had to pull out a calculator, and with taxes the cents amount came with a .2 followed by several digits that rounded up to .3 cents; but the waitress was rounding the amount up to the closest fifth cent, which my friend started to say it was incorrect. And he had a good point. A principle is broken because they steal cents from every single customer every day that in a year it adds up to hundreds. And that's the same case when they lie about being out of domestic beer; they want to make more money by not giving you a choice of buying domestic beer. Needless to say, my friend didn't want to leave a tip and neither did I; but my friend paid with a $20 dollars bill, and got his change, while I paid with a credit card, and I guess because of that the waitress was definitely expecting a tip from me. But because I didn't give her one, she started to confront me in such an aggressive manner that I thought she was going to spit on my face or something like that. So, my friend and I got up and started exiting, and the waitress was so furious that she wished me a bad digestion because I mentioned her rushing us to finish our meals, and in her lunacy she came to close and slam the door behind us three times telling us all along that \"American people were very nice.\" I still wonder what she was referring to as \"American people\", if white people exclusively (since my friend and I are not), or maybe she was being sarcastic. For their food, I wouldn't say much either since I was pretty disappointed with their chicken in garlic sauce that didn't smell or taste like garlic at all.", "author": "Lyon B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-08", "description": "I really wanted Manivanh to be good. The reviews were good. The food looked good online. But then. \n\nThe restaurant was so warm, and this is on a cool day. It was so humid that I felt like I was going to melt into a puddle. Our waiter was sweating so profusely that I thought he was going to sweat into my food.\n\nWhich was not great. The pad see eew wasn't fully cooked, so I had to eat pieces of cold, gummy noodle that had no sauce on it. My plate was also mostly all bean sprouts, which was interesting. Just think about eating cold, clumped together noodles and bean sprouts with a splash of sauce. Exactly.\n\nI really wanted to like this place. Perhaps they had a bad night. But it'll probably be a good long time before I come back to find out.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-23", "description": "The waiters were very nice and welcoming. Ordered the prawn fried rice with was very delicious. The Thai ice tea was a little bit too sweet but otherwise fantastic. \n\nThe food was prepared pretty fast and the decor of the restaurant is very good.", "author": "Ammar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "This is my absolute favorite Thai restaurant in San Francisco, truly a hidden gem. There is never a wait, wonderful service, and the best Thai food I have had outside of Thailand. It's hard to go wrong with your order here- try the red snapper tho.  The pad Thai, curries, and beef dishes are also all excellent.  Truly a neighborhood gem!", "author": "Katie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-03", "description": "Went here on a Saturday night and the place was mostly empty. I ordered the pad thai. It was in a thick brown sauce---which is not what I normally expect with this order. It was fine, I ate most of it. Feel like if you need to get take out and you just want something quick, this would be an ok choice.", "author": "Sophie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "You could easily overlook this place, walking down 24th street with all its grit and activity, but you shouldn't pass it over.  The food is best Thai/Lao that I've had outside of Southeast Asia, and the family that runs it is absolutely awesome.  In fact, I had my wedding rehearsal dinner there so all our out-of-towners could experience the best of what San Francisco has to offer. (it was an amazing feast) \n\nGo off the beaten path of noodles and curries (all great!) and don't miss:  garlic pepper scallops, bbq duck, chili basil chicken, peanut sauce and spinach, and chef's special soup (a traditional Thai soup).  This was our family dinner last night, and it was sublime.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "Good food and kind customers! We ordered to go at the end of the night. One of the customers waved us in. So glad he did. We enjoyed the experience.", "author": "Aaron H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-04", "description": "Soggy pad Thai, decent if you're starving with minimal Thai options. Hostess never looks happy and they never include utensils for to go orders.", "author": "Shelby L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-20", "description": "I stopped by here to get some food to go and the waiter here was just so nice (and cute and tall!) and considerate I had to write a review. He was super prompt and helpful when I ordered and even brought out an extra bag and put all my other stuff in it when he noticed I was already carrying a bunch of loose things and would have had trouble carrying those along with my food order. \n\nSo the service alone is enough to warrant a good rating, but with good food as well? 5 stars for sure. Definitely gonna stop by here again!", "author": "Aimee P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "I've been here a few times since I intern a few blocks away, and it never fails to satisfy my Asian food needs. With the abundance of Mexican food in this area, and my rare desire for it, I'm usually in the mood for anything with rice. The servers here are so nice, and the service is pretty quick. \n\nI usually get the Beef Curry for which the meat is seriously the softest I've ever eaten. And since I'm usually unable to eat spicy foods, the mild version is just the right amount of spice that I'm not looking to drink water after every bite. The Pad See Ew is also pretty bomb. Definitely coming back for my next lunch break.", "author": "Kristine N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-23", "description": "Out for a walk and quick dinner, stumbled in and was pleasantly surprised. Coming back for sure?", "author": "Rick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-17", "description": "We come here often because it's close by. It's usually empty but SOOO underrated, food is delicious and fast.\n\nAdvice: get the prawn and scallop dish from the seafood section, it comes with mushrooms and Zucchini, and then also get the beef curry, mild. And then get rice to go with it. The dishes are amazing together! I'm sure they're great separately, too, but I just like to mix the sauces together.", "author": "Rose L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-19", "description": "Rather disappointing. Minced duck salad was OK, other things passable.", "author": "Grzegorz J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "Some of the best food I ever had ever. I like to gripe that the Thai food in Austin doesn't compare to the Thai food in San Francisco, and this is what I'm squawking about. \n\nOutside it looks like a hole in the wall on a filthy street in the Mission. Inside it's warm and cozy and clean with perfect lighting and decor. No irritating music, just peace and quiet -- except for the three socially-oblivious self-inflated ninnies who walked in and sat next to us and announced to the whole place that they indeed had \"resting bitch face\" and the rest of their insipid conversation would screech over and above the existence of anyone else. The waiter was nice enough to serve them anyway. I would have thrown the twats out. \n\nLucky for us there was a separate room with equally nice tables and decor; we picked up our stuff and moved over there. The nice good-looking waiter took our orders quickly and got the food out just as fast. Everything was awesome. The spicy coconut soup with prawns and mushrooms had some frikkin amazing flavor and the shrimps were fresh and buttery. The rock cod with green beans was superfabyolicious too. We were stuffed but had to get coconut ice cream. It was a big five-dolla-worth coconut sundae with chewy chunks of coconut that made me go cross-eyed and drool a little. \n\nThis place is killer.", "author": "Brock S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "I must have walked by this place 1,000 times, and never really noticed it. \n\nwe had the idea to try the new place next door, but we got there and they said 45 min wait for a table of 3. \nNo way. \nSo, we start walking back, thinking about what else we might want. \n\nWe stopped, looked at the menu, looked at each other, said, \"Thai? Sure!\"\n\nMenu was good, prices very good, OK, we order. \n\nWe got some pad thai, which was super yummy, a seafood dish, and some rolls, and everything was spot on. \n\nprice was right, and the server told me they have been there for 30 years ? what ??!?!?! How have I not been here before ?\n\nWell, after that night, I will go there any time I eat Thai food. \n\nnice decor, cool servers, great food, very nice prices. \n\nthumbs up !", "author": "Adrian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-10", "description": "Visited this place a few times since it is so close to my job. This last time it wasn't the best experience. As I was eating my food, I noticed a hair in my food. A server said it was lint which is still not acceptable. They got me a new dish.. However, as I was eating it I found another hair in the new plate . I had high hopes for this place.. Since the service is good. However, can't say I'll return.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-06", "description": "Hands down our most frequented restaurant - two blocks from home it is great food, exceptional value and very friendly waitstaff.\n\nGreat for take out, too!", "author": "Ian T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "Wonderful service, delightful environment and tasty bites! Be warned of the heavy handed spicy plates!! They are GF and Vegan accommodating too!", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "You're in the Mission, why are you looking for Thai food? I don't know but you are, so here's the situtation:\n\nThis place is good. Went in a group and tried a few different things: the pad see ew was outstanding, the beef red curry was also strong. The pad thai was terrible, which is unfortunate because any respectable Thai joint needs a strong pad thai. Oh well, just take note and order the other stuff. Got a carafe of wine because why not, it wasn't any good but I'd do it again because wine. \n\nIts a nice, quiet place, nestled away from the hubbub of the Mission so you'll always be able to get a seat. Seems like a perfect spot for Mission residents when they get tired of burritos and need their Asian fix. I'll be back.", "author": "Bud P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-31", "description": "The food here was awesome. My friend and I went and had to duck spring rolls, and the Pad Thai with shrimp, and it was all awesome. The place is pretty warm though, so I would suggest dressing in a jacket you could easily take off. Another cool perk is the beer and wine is cheap and good.", "author": "Kathleen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "Hosted my husband's birthday dinner here last night. We live across the street from Manivanh, and LOVE the food and service at this restaurant. It was 14 of us, the bday dinner was perfect, the service was amazing. My husband said it was the best birthday dinner he had. \n\nI called 3 days ahead to book the back room. Came 1 day ahead to give them our food choices. I asked guests to pick between the satay or chicken coconut soup, pad thai or fried rice, roasted duck basil, snapper with garlic sauce, or duck curry. These are our favorite dishes. We wanted our friends to try them. \n\nI dropped the bday cake, flowers, decorations, and name places the day of the party. My hubby and I showed up earlier and set up our music station, he used his bose speaker and phone to play his playlist. \n\nDinner was served on time, servers knew who ordered what, drinks kept coming (beer or wine only), the servers were able to bring food in and out seamlessly, until finally the birthday cake showed up. \n\nEveryone had a great time and really loved the food. The ambiance was so relaxed and homey, we were so comfortable and pampered there. Big THANKS to Ann and Po (spelling?) who made this dinner so successful.", "author": "SS s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-20", "description": "This is my go to if I am craving mom's homemade Thai food. That is if my mom cooked Thai. But this is totally the spot. Two of my favorites are the fried rice with shrimp and the basil chicken. Great fresh and affordable Thai food!! \n\nAnd it doesn't hurt that the staff is super uber nice!", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "First experience: Long story short my night in the mission was getting late & most restaurants were very close to closing and I had just finished moving some stuff into my new room (had no time in the day to buy grocery). I hate being that \"guy\" to walk into establishments with less than 30 min to closing so I called around & Manivanh answered.. with little hope in my head that the kitchen may still be willing to take an order for pickup. They kindly took my order with 20-25 min to close. I arrived with about 7min to close and there they had my food bagged up ready to go. Took it back home and was very satisfied and grateful for this late meal. \n\nThe next following day I was planning on dinner with my aunt whom is local to the mission. She suggested Manivanh. (Ha ha I just had it yesterday but I was super happy with the previous service from the night prior I had to say yes.) Service extremely friendly 2nd time around. Food was great I believe we ordered an assortment of prawn, chicken, & eggplant curry dishes. The prawns are plump & sauces are on point.\n\nToday about 3 months later I am writing as I just returned from a work trip in Europe. Manivanh my go to place for great service & food first came to mind. I felt the need to hit this place being back in the city. My new favorite \"sea food basil\" side of rice & Thai iced tea. Really great textures with all the seafood/shellfish being cooked well with the sauce/each other. In my opinion this place has perfect portions to feel full, but not that food coma state full where it hurts to walk. The staff has a down to earth friendly vibe that is calm not pushy. Within 30 seconds of my water glass being emptied the waitress refills.\n\n\n\nTo be honest I'll probably be back this week/weekend", "author": "Robert G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "Came here for lunch with a co-worker since it was close to our training. We ordered the:\n\nCarmen's special-eggplant and fried tofu. Flavorful and delish\n\nShrimp red curry- Not spicy, light, and flavorful. \n\nI enjoyed the ambiance, quick service. Would love to come back with a larger party so I can try more dishes!", "author": "Rosanna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "This place is bomb.com! Went here tonight with the boyfriend and had the spicy sour prawn soup. He had the prawn soup in coconut milk. We shared the chicken skewers with a peanut dipping sauce and it was all on point. \n\nWe have been here plenty of times because it's so close to the house and they never disappoint. Normally don't eat in but it's quiet and somewhat dimly lit, love the ambiance. \n\nDefinitely check out Manivanh", "author": "Jill A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-28", "description": "Minivanh is one of the best Thai places in town.  Seriously. While it may eschew the canned \"sexy\" elements of Thai place on Valencia or 16th St., it has food that will keep you coming back.  Plus, the dining room, especially at night is really charming in an authentic way, and the service is friendly and attentive.  There is no pretentiousness and the prices and portions are excellent!\n\nSo what to eat?  Really you can't go wrong.  We teeter between veggie and meat dishes and both are great.  The chicken satay is a go-to appetizer, the salads are all really flavorful and classicly thai, and you can't go wrong with the curries, rice, or noodle dishes.  Really, I've only had one thing I didn't like there and that was a long time ago and I couldn't tell you what it way.  \n\nBut wait, what about the 1, 2, and 3 star reviews?  Read them yourself, they are rather ridiculous.  Try this neighborhood gem yourself and you like so many of us, will probably have a new local favorite!", "author": "Nicholas H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-11", "description": "Why the 4 star reviews?  I don't get it. \n\nThis is possibly the worst Thai food I've ever had. \n\nThe chicken salad was all watery liquid stuff. I couldn't tell what I was eating. \n\nThe prawns appetizer was just 2 stars. \n\nIt's too bad. I work nearby.", "author": "mario c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "I come here during my lunch hour. I always order pad Thai and It never disappoint me.  But If you personally like pad Thai on the dryer side than you might not like it here.", "author": "Aniko N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-05", "description": "Early hunger pangs.\nSomething \"noodlely\" I craved.\nPerhaps something Thai.\n\nLauched Yelp Mobile App.\nThis luncheon spot sprung up.\nOh, it's close to Dynamo Donuts too.\n\nWalked in.\nTurned right.\nSat down.\n\nOrdered the Pan Voon Sen.\nIt was a bit salty for my liking.\nHowever, it was flavorful.\n\nI noshed it down ASAP.\nI'm gonna try the other dishes \nto give this spot a fair comparison.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-24", "description": "Manivanh seems like a hidden gem nestled in the deep mission, complete with attentive staff nice decor and ambience.\n\nThe Crispy Red Snapper was a delicious and dynamic dish, with a unique blend of flavors and textures. The major letdown for me was the duck curry which had a thin and extremely flavorless red curry, and the other components do little to help carry the dish. Ultimately I'd recommend the snapper, but if curry is your jam you can certainly get far more satisfying food for less than 14$ elsewhere. All the best.", "author": "Tristam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-11", "description": "This place is really easy to miss. It's small and unnoticeable from the street. However, it is super authentic thai food! We ordered a yellow or green curry dish (cant remember) and the chicken was perfect!! Not chewy, not undercooked, just fall off the bone, and AMAZING! The noodles were a little stuck together and as a result some bites were not coated and tasted bland, but overall this place is a great spot in the mission if you want something authentic and asian.", "author": "Sia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-12", "description": "Carmen's dish. Tofu was slightly crispy and wonderful. Eggplant was super dank. \n\nSeafood with basil. Tons of fatty shrimp. Soup around dish was great with white rice. Bold, tangy from fish sauce and a good amount of acid. Yum!", "author": "Aaron O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-02", "description": "I did not like this place.\nWent there after my friends told me it was a good spot and really close to my place, so decided to check it out. Food is not as good as I was expecting.\nI love curry, all kinds of curry, and I tried 2 there and both were watery, not the delicious creammy curry I am used to.\nI am trying to understand why so many good reviews for such a bad food.\nService is ok, but I doubt I will be returning.", "author": "Paula C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-10", "description": "Possibly the only Thai restaurant heralded by a plain white and black sign out front. It's really a treat. This is a hidden Thai gem in the Mission.\n\nWe ordered the roast duck larb salad, pad Thai with prawns and fried tofu with basil and peppers. The larb is solid. It's loaded with onions which give it some bite.  The pad Thai is pretty excellent too and just spicy enough without needing to be doused with chili oil. The fried tofu was the only disappointment but let's face it: it's fried tofu. What was I expecting?\n\nNot slammed on a weekday night, and very reasonably priced to boot. I shall return.\n\nObligatory Title Pun: At first you don't succeed, THAI, THAI again.\n\nMenu Readability: High. Broken out by curries, noodles, etc., and veggie options are clearly marked.\n\nNeed to mention: They do not deliver.\n\nWhat this place teaches me about myself: My weakness is a stab wound in the chest, followed closely by Thai food.", "author": "Vivek S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "I'm a Tokyoite. And I say that like New Yorkers proudly call themselves that, but maybe I'm even snootier than them. I just believe Tokyoites are the most sophisticated foodies in the world. Sorry. Anyway, Thai food made to Japan in the 90's and they are authentic there. Straight from Bangkok quality. I've also been to Thailand and so... yep, I love the AUTHENTIC Thai foods. Note: authentic Thai food doesn't really appeal to people who think AMERICANISED \"Thai food\"- loaded with extra sugar and lacking fish sauce and dried shrimp, tamarind being replaced by cheap American tomato checkup - are the GOOD Thai food and if it's not super sweet like candy or doesn't taste like Heinz checkup or God forbid, is full of UMAMI from fish sauce and all other wonderful authentic ingredients, it's not the \"best Thai food\"? I've eaten all the top 10 \"best\" Thai restaurants in SF and learned that I need to avoid the popular ones because they are the unauthentic kinds. I searched far and long everywhere for my authentic Thai fix. I found it here. The only place I eat Thai street style foods and Pad Thai in SF. And price range is heaven. I love this place. Thank you, Manivanh. Please don't ever change your chef.", "author": "Mihoko S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-06", "description": "03-August, Saturday\nManivanh Thai is not quite tucked away, but is far enough from the more busy areas of 24th street in the Mission for me to have walked past this previously.  After having recently dined here for dinner, I've realize that this is probably the most authentic tasting Thai that I've experienced in San Francisco. It is rather not that difficult to prepare decent tasting Thai dishes (which many places are able to achieve), yet easier to screw up with too much added sodium, or not enough spices that results in an ill-attempt and pure blandness (which A LOT of places are successful in doing). \n\nSadly, It actually feels like a novelty to have a restaurant elevate a simple red curry dish of bamboo shoots, sautéed onions, and pork into something that is balanced and refined... because Thai in the Bay Area has recently become synonymous with such adjectives as quick, cheap, and easy.. yet unfortunately nothing else.  I didn't adjust the level of spice in the dish, because I always think that a good indicator of quality is how the spices actually work with the dish (which this does as it is perfectly infused), and I almost ALWAYS leave Thai places with leftovers but I literally licked my plate clean here because the quality was so spectacular.\n\nThe restaurant itself does not feel too crowded which I absolutely appreciate, is dimly lit, and is warmed up by the balsa wood panels on the walls, and the intricately carved teak reliefs.", "author": "Ty T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-19", "description": "Not sure what the great reviews are about.\nOrdered the Tom Yum soup which was good, the pad kee mao and eggplant and basil was a complete disaster.\nGood friendly service but will not return.", "author": "Nidhi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "This place is so consistently great it is hard to believe word has not gotten out about it. Went last night and had papaya salad and tofu salad as starters - (I am vegan, my friend - not so much) and both were perfectly spiced and delicious. I almost licked the plate it was that good. Then she had pad thai which she claimed was amazing (it did look and smell good but had shrimp so I did not try it) and I had the always amazing green curry with vegetables. Wow, LOVE this place and so happy to have a few short blocks from my home.", "author": "Tim H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "I've walked passed here a million times and never stepped foot in this joint. Till one day, I was fiending for Thai food in a Burritos kind of neighborhood. I decided it was time to test this place out. Got the Thai Fried Rice and it was sooo good I came back the next day to order some more, Very authentic, super delicious, clean ass restaurant. I mean what more can you ask for? I can honestly say its the best Thai restaurant in the mission.", "author": "Jackie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-15", "description": "Best thai food in FRISCO! I grew up across the street and ever since I was a young boy I remember loving this place. to this day I cant find a better authentic thai place in the bay area~ If you are in The Mission come by and try it!", "author": "Duke Of Frisco X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "Crispy red snapper really good. Carmens vegetables really good.  Coconut milk prawns really good. Duck curry not so good. Fatty and not much flavor.", "author": "Jacob A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-24", "description": "I certainly didn't expect to find a Thai restaurant nestled among the predominantly Hispanic businesses on this block in the Mission District, but there it was.  I immediately went to my cell phone and punched it up on the mobile Yelp page.  This restaurant has lots of positive reviews so I took a step inside and hesitated because the restaurant was completely empty.  The wait staff assured me they were open and asked me to take a seat anywhere.\n\nI decided to go somewhat vegetarian this afternoon and chose the Pad Thai Jae at Manivahn.  On the menu it's the same description as the regular Pad Thai except tofu replaces the chicken or shrimp.  The service was quick and friendly and the noodle dish (http://www.yelp.com/biz_photos/_fskSC0Z0k27FrLj2OGI9Q?select=Zk0J0Gs2wX-o6gjLpLPn5w) was superb.  Thin strands of firm rice noodles, lots of broccoli, bean sprouts, green onion, cubes of tofu and fried eggs all tossed about in a sweet, slightly tangy orange-colored sauce and finished off with a dusting of ground peanuts which gave the dish a nice toasty flavor.\n\nI chose to mix in the refreshing mound of fresh bean sprouts, slivered carrots and cilantro that had been served to the side of the noodle dish along with a lime wedge and an orange wedge.  Quite tasty it all was!", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-05", "description": "Didn't know this place was here for years despite living 2 blocks away. \n\nI honestly think the pad thai here is the best I've ever had. The location really does these folks a disservice, if it were over near Valencia or Mission it would be packed constantly. \n\nNot crowded, decent prices, great food.", "author": "Brian P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-11", "description": "Small portions of weird food. Not fresh marine products, be very careful. Nevertheless service stuff do their job good there", "author": "Iv S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-26", "description": "Very average Thai spot. Food wasn't that good, bit soggy, not very fresh. I've had much better.", "author": "Joe B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "This is a great Thai joint.  The food is fresh and yummy and the prices are absolutely reasonable.  Just about everything is good - noodles, rice, curries, and veggie dishes.  The meats are not outstanding but the sauces are really good and you will find some exotic and intriguing flavors in dishes that are predictable and boring at other places.  They also have some dishes you won't find at typical Thai joints.  A neighborhood standout.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "I grabbed the Chicken Red Curry with Rice for take-out from here. It was pretty tasty, although I felt it was a bit pricey (maybe I'm just not used to SF pricing yet). However, the staff was all extremely nice and helpful, so points for that!", "author": "Cole G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-06", "description": "It strikes me as a normal good ol' thai restaurant--nothing too spectacular and nothing too bad.  I will admit the sticky rice and mango was pretty stellar though.\n\nFood: 3.5 stars\nService: 4.5 stars--super friendly and attentive\nAmbience: 4 stars\nValue: 3 stars (~$10-12/main dish; the dessert was a little steep closer to $5)\n\nI'd put it in a solid 3.5 but since I can't, I had to round down just because it's just solid with no real spikes.  They do take reservations but it's pretty empty.\n\nHad the duck red curry and it was good--perhaps if it wasn't covered in random cucumber squares I'd have enjoyed it more.  It was quite tasty but I just didn't know what the cucumbers were doing in it.\n\nOverall I'd go back, but I'd also be open to trying new Thai places too.  So good.  Pretty great, but nothing out of this world.", "author": "Traci H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-03", "description": "One of the best dishes I've had in the city, and out the door with beer and tip for $20.  I got the #27 'Thai medium' with chicken.  It came in like two minutes and was not only acceptably spicy (which is a big deal for someone who enjoys some heat in this city), but also very delicious.  Bringing friends next time.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-29", "description": "Great service, first of all. Secondly, I have searched this city for a GOOD pad Thai. This is by far the best one I've had. Good quality ingredients and tastes amazing. Will never order from anywhere else.", "author": "Lilly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-07", "description": "The food here was solid and tasty. The chicken tasted quite fresh.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-07", "description": "Manivanh suffers in comparison not only to the stalwarts on 24th Street but also to the wealth of satisfying Thai restaurants in San Francisco.\n\nThe chef's combination plate that features pork, calamari, and other enticing ingredients is a letdown when revealed that it is actually an uninspired stir fry made soupy by the puddle of excess liquid that rendered the heap of rice helpless.  Each successive under-seasoned bite arouses further suspicions that the dish is composed of leftovers that even the staff has grown weary of.\n\nThe lone attraction at Manivanh is the iced coffee with condensed milk.  At a standard $3, the powerful coffee creates a rush of alertness before the overwhelming sugary condensed milk causes eyes to glaze over in bliss.  Will return only for the coffee!", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-15", "description": "I didn't like the duck curry plate. Perhaps it was the tomatoes that came with the duck because if there was much curry in the bowl it got washed out by the tomato juice. The dish was pretty watery and I couldnt taste the curry. My co-worker said her pad kee mao was pretty good, it looked good. So, I may come back and try something different.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-25", "description": "If you blink, you will miss this place! There were two entrances, one of which was closed, so naturally we thought they were closed. Luckily, we saw their other door, otherwise we would have just walked off. \n\nAnyway, my first impression was, \"Woah, no one is here and this place is tiny!\" It was a little before dinner, but business picked up once we got seated. Their menu consisted of the typical selection of Thai cuisine, so it wasn't difficult making up our minds.\n\nWe ordered the pad Thai (http://www.yelp.com/biz_photos/_fskSC0Z0k27FrLj2OGI9Q?select=zY1kvTNII-bMdMW6ABdHXw), papaya salad (http://www.yelp.com/biz_photos/_fskSC0Z0k27FrLj2OGI9Q?select=j-V_hz0MmSsUEKredAVh0Q), red curry (http://www.yelp.com/biz_photos/_fskSC0Z0k27FrLj2OGI9Q?select=v5f2o0Uk0ovhRUYUUbo4mg), and the garlic pepper sauteed beef (http://www.yelp.com/biz_photos/_fskSC0Z0k27FrLj2OGI9Q?select=M6KaSUHAd1_mNO8MpoLAXQ). I will admit, I didn't think the food was going to be as good as it was. I was really surprised! The pad Thai was saucier than what I am used to, but it was so good. It was flavorful and the noodles were the perfect consistency. The papaya salad was refreshing and spicy and I could really taste the shrimp flavor that they used in the dressing. The red curry was okay. I am used to eating panang curry, because I like the bamboo shoots that usually come in panang curry. Their panang curry did not come with bamboo though, so I had to order the red curry, which included bamboo. It was okay, nothing special. The garlic pepper was delicious! It came with plenty of onions, which I really liked! I also liked that it tasted very homemade too! \n\nThe customer service was excellent. Our waiter came to check on us very often and was very polite. Manivanh Thai isn't the newest restaurant, but it has a very warm and welcoming environment. I do recommend giving them a try--you cannot go wrong with good food and great service.", "author": "Lien T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "Yet to find Thai food I didn't like in SF... Maybe I'm just a sucker for Thai food! Manivanh was great. Service was friendly. Didn't order anything too adventurous this time; just a noodle dish and a curry dish. Both delicious.", "author": "Laurent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-30", "description": "Not a pretentious place but the food was excellent. Quiet, no fuss, nice people, good service and a very pleasant dinner. I would really like to go back.\nRecommended.", "author": "Luca R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-08", "description": "I actually think this place is kind of underrated - at least for the neighborhood. If you live here, you know a good non-Mexican place doesn't come along often - and after only one visit I consider this one of them.\n\nWhat I had: garlic broccoli & tom kha soup. The soup in particular was about as good as I've had - HIGHLY recommended. The broccoli was leaning toward bland (the recipe itself could have done with some more soul and zest imho), but the ingredients tasted fresh and it was ultimately satisfying. Also they have brown rice. Win. :)\n\nPrices were OK - about $10 for an entree.\n\nThis isn't the best Thai I've had, but it's definitely the best Thai that I've come across within walking distance of itself - and definitely worth a visit based on my one experience.", "author": "Sean C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-30", "description": "I came to Minivanh on the recommendation of a Yelp friend and kinda wish I didn't.  \n\nI've passed by the place frequently but never considered going in because the outside makes it look a bit run down.  Inside it's actually quite nice with beautiful wood carvings and a nice atmosphere.  A real surprise!\n\nOur appetizer, a fried tofu salad was actually really tasty.  However, the main dishes weren't much to our liking.  The vegetarian pad thai was the worst of American style pad thai - sticky, gloopy brown noodles covered in a cloying sweet sauce.  A shrimp and rice dish turned out to be pretty forgettable - Chinese takeout rice with pungent shrimp and a bunch of diced stewed tomato.\n\nAt the start of the dinner we were excited and thought we'd found a place to revisit.  By the end it was clear we wouldn't come back.", "author": "Ivan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-04", "description": "There are not many thai food places in the Mission, particularly close to San Francisco General Hospital. Manivanh does not taste very authentic, however, it is still unique in it's own way. I usually order the pad thai... It's very flavorful and has a rich sauce added to it. Normally at other thai places, pad thai is prepared on the dryer side. I also recommend the yellow curry! This place gets pretty packed around lunchtime--I'm not surprised as it is one of the better thai restaurants in the area.", "author": "Monica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "I called in for a Tofu Pad Thai and a Thai Iced Tea. My order was ready in 10 mins. The Pad Thai was still nice and hot when I got home... Good flavors! The iced tea was a tad sweet for my taste.", "author": "Juils C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "Good solid place. I have just ordered take out twice. Food + price is good for the area. They could improve the ambiance, maybe with some research on how the other places do it. But that's only for in-house diners. I've lived in Thailand, and know my Thai food. Again, it's not amazing, but it's good. And they aren't crazy on the prices like other joints in SF + the mission.", "author": "Nip B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-18", "description": "Ummm... YUM!!!! I definitely recommend the vegetgarian red curry. So happy that this place is in my neighborhood.", "author": "Daisy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "Great neighborhood location - delicious pad thai, green curry not that heavy, chicken with onion and zuchinni.  Chicken great quality.  Would give it 5 stars if they delivered.", "author": "Prakash R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-20", "description": "Came here with a big group and wasn't really sure what to expect. I ordered the vegetarian pad thai as spicy as they could make it (was I asking for trouble?). Came out pretty mild, oh Manivanh Thai, why don't you believe me? I can handle it!", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-18", "description": "Authentic Thai food in the mission district.  Nothing fancy but all very rich and flavorful.  We share a lot of dishes so I can't even remember their names.  But I do remember the shrimp and scallop in coconut sauce was one of my favorites.", "author": "Mary V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-03", "description": "This seems to be the only Thai place around here, so there isn't much choice for this cuisine. I ordered the yellow curry, spicy. When I took the first spoonful, something seemed different. The spiciness didn't have that potent, punch in the throat effect, but tasted like a spicy black bean sauce. There was also a ton of pepper seeds, leading me to believe they didn't use Thai chili's (that amount could kill an adult if it really were Thai chilis).\n\nI've also had a better FBI, but I mean how can I knock it..it's a bunch of deep fried bananas and coconut ice cream. mmmmm... (side note: no split checks)", "author": "Ray C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-22", "description": "This has now become one of my favorite Thai restaurants in the city.  For pick-up and/or for dining in.  The staff is super friendly and helpful in case you can't decide what to order.  And the restaurant itself is really nice and clean inside.  My favorite dish is the Pad See Ew..Yum!  \n\nThe only complaint I have is that they don't deliver.", "author": "Misty B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-15", "description": "I have been eating at this restaurant, on the average of once or twice a week for as long as it's been open ( for fifteen years ) There is nothing on the menu that I haven't tried and the Carmen's Special is my creation.  The food is outstanding.  It's no surprise that this special restaurant won a Bay Guardian award for Best Thai Restaurant in a Place You'd Least Expect To Find One!  Lunch time is crowded with hordes of San Francisco General Hospital staff descending so dinner is a better time to try it out for the first time.  \n\nManivanh is definitely a family affair, with Nang at the stove, Sam chopping and helping with food preparation and, at various times, the four daughters, and their partners lending a hand.  Their efforts results in a meal fit for a king...or queen....and every morsel is to be savored...Thai food at its best.\n\n2-21-08  UPDATE  This is still one of my favorite spots in the entire city - there are few other Thai restaurants I would even consider.  I saw someone said it had no ambiance - but I think it is a pretty nice, peaceful spot in the midst of the Mission hustle and bustle, with wooden carved Thai scenes, the shiny brass bowls, and the wood paneled walls.  \n   As for the staff, well, maybe because I've eaten there at least five hundred times ( maybe more ), they're like family to me - but I see them greet everyone warmly and, at least, half, by name.  They are a truly bright spot after a hard day at the General...just thinking of them now makes me feel all warm inside!\n\nApril 2012 - the \"Carmen's Special\" is officially on the new menus!", "author": "Carmen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-09", "description": "DE-LICIOUS!  My litmus test for good thai is the pad thai- it was great- about 20 of us went here last night for a friend's 40th birthday!  Everything I tried was good- We ordered like 10 appetizers, and everyone seemed to have ordered something different for an entree.  \n\nThey have a \"back room\" for larger parties.\n\nI will definitely go back here!", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-19", "description": "Really great thai food and awesome service.  I'll be going back for more soon!", "author": "Julie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-01", "description": "I wish they had a larger menu because they are so good! All the curries are great, I've gone through them all. Pad Thai is good, but I'm not a big pad-thai person. The flat noodles are great! Satay is of course yummy. Overall, great place for lunch/dinner in the Mission.", "author": "Monifa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-23", "description": "Service made this eating out experience quite fun; the owners daughter was our waitress and her boyfriend came out to our table too.\n\nWe had the duck larb, tom kha gai, green curry, some sort of special calamari and pad kee mao.\n\nStandouts were as follows:\n\nTom Kha Gai- extremely buttery and fresh tasting!\n\nGreen Curry- all the vegetables had been cooked (sauteed?) separately then added to the curry. I was shocked how tender and fresh the chicken was, yummy!\n\nCalamari- i think this calamari had a kind of salt and pepper thing with a very different consistency going on\n\nOverall, very clean flavors and it felt like a home-cooked meal!", "author": "Bibi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-04", "description": "Delicious!!!!\n\nSo good, so tasty, so friendly. Just lovely all around.", "author": "Miriam G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-05", "description": "Delicious food. I've literally never had anything bad there. First time I went we ordered the vegetarian soup as a starter to share (tons of it, sooo good). I tried to order the pad thai, but the waiter said, \"Are you sure you don't want to try some of the curries? They are very good.\" I can take a hint, and I'm all about getting the inside scoop at the restaurant. I had a curry and it was amazing. Next time I went, I got beef curry to-go, and it was also amazing. They are super fast (every dish always ready within 10 minutes) and very reasonably priced. Also, their carafes of wine are decent and cheap.", "author": "P U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-02", "description": "One of the local gems in SF. Some of the best authentic Thai food in SF. Does not deliver (thank god!), family owned, friendly and quick. We often call ahead and pick it up. Never been let down, been ordering there for years.", "author": "Konstantin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-14", "description": "Good Thai spot in the mission.  The menu might be a bit limited, but everything on there is solid.  Pricing and portions are reasonable.\n\nQuick tip: If you ask them to make your meal \"extra spicy\", be prepared for a generous amount of habanero chilis!", "author": "Aalok P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-14", "description": "My favorite neighborhood Thai place, lots of yummy things to choose from! my favorites: the duck salad and the panang curry..\nlots of fresh flavors and perfect mix of spices...\nstrongly advise!", "author": "V. B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-11", "description": "A solid thai resurant. We were there on a tuesday night, and were the only ones there. However I was bolstered by the regular stream of pick-up orders - which means that it is a good \"go-to\" spot for locals should they need good food, but aren't feeling up to cooking. \n\nAnother thing that could have explained for the general emptyness was the fact that it was a lovely day, most people were out enjoying the weather, and it was senior citizen hour (approx 6 pm.) That said I'd never been there before, and went based solely on Yelp Reviews. I'd say to date, they've not proven me wrong. If I find myself on 24th st again and in the mood for Thai, I'll mosey my way down here.", "author": "Kira G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-13", "description": "I've lived above this place for more than a year and finally decided to give it a try. The lady that helped me (and her little son) were very nice and gave me water while I waited for my food. I got the chicken red curry for $10-something. Not even close to any other curry I've had. It tasted more like spicy chicken soup. I like my curry with more coconut milk, I guess. Honestly, don't think I will be going back there even though it's only two doors down.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-28", "description": "OK, let me say up front that I might be the worst person to review Thai food you could come across. I lived in Thailand for a fair stretch (both north and south) and actually paid the owners of a guesthouse I lived in for a month to let me work in the kitchen. In the long run, since I ate with the cooks, I saved money on meals and fast-tracked my Thai language and cooking skills. Highly recommended if you can swing it and don't mind being the target of nigh constant ribbing, ridicule and burns from hot oil spatters. \n\nAnyway, I ordered a broad range of dishes for take out: \n\npad kee mao gai (drunken noodles with chicken) - greasy lumpy noodle blob, short on basil and veggies, chicken so-so \n\nTom Yum Kung (spicy soup with shrimp) - they gave me Tom Kha Kung (coconut milk soup with shrimp) instead and it was... hmm, over oily and over cooked with none of the fragrance one hopes for in Tom Kha. Strong notes from the lime lives, galanga (not ginger), and lemongrass were expected but not detected. \n\nGai Pad Med Ma-Muang (cashew chicken) - pretty tasty though the sauce was thin and watery and a little on the generically \"brown\" flavored side. \n\nNeua Pad Bai Horapha (beef with basil) - lite on basil flavor, sauce tasted just like the cashew chicken sauce with a little basil thrown in. beef was iffy. \n\nThey did serve everything pretty spicy though (as I requested). I'm not entirely sure what impedes the serving of good Thai food in this town. Maybe there needs to be a better Thai to Mexico connection? Since, as we should all well know, 90% of the restaurant food in San Francisco is cooked by central americans. \n\nSometimes, I think Thai restaurants have (like some Chinese and Italian ones) been conditioned to serve what their patrons expect; greasy, heavy on the meat, low on the heat, knock upside the head with flavor stereotypes (peanut sauce, coconut milk etc.). \n\nWhat's a snooty Thai food snob/bitch to do?", "author": "Milk N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-24", "description": "Great spot!\n\nWarm, welcoming, and peaceful interior.\n\nThe food is good!\n\nFamily owned:  Mom and dad are in the kitchen, daughter + her boyfriend are on the floor.\n\nSuper vegetarian friendly!\n\nMy favorite is the Larb Ta Hu - it is amazing!", "author": "Erica K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-02", "description": "I remember I actually went to Manivanh Thai years ago so when I was in the area and needed to grab something relatively quick to eat with my parents. Manivanh Thai was the place to go. Although I would have liked a burrito myself, my parents wanted something more rice based.\n\nThe service was good and the food came out fast. The portions were a little smaller than what I am used to seeing at Thai restaurants. But the veggie Pad Thai I had was good. Noodles were cooked just right. My parents really liked the chicken curry, but I tried the rice, and the rice was not good. I am a very picky person when it comes to rice. So when I saw the rice, it already didn't look good. I don't know if the quality of the rice was mediocre or if they didn't cook it well. But hopefully it was just an off day with the rice. My parents were fine with the rice, so I am just that picky when it comes to rice. \n\nWith the exception of the rice, the food at Manivanh is pretty good, prices a bit high for the portion size. There were no lunch deals.", "author": "Angela T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-02", "description": "In my opinion, this is one of the most authentic Thai restaurants in SF.  Price is great, service is friendly, portions are generous, but the best is the multi-layered and careful cooking that they do!\n\nI wish they delivered, but at least they will bring it out of the door is you ask in advance!", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-13", "description": "I called in my order of pad thai and thai iced tea and when I arrived 10 minutes later, it was ready for me. The restaurant wasn't packed when I got there, but I could see it filling up since it is a relatively small place.\n\nPad thai was decent. I like that it's not overly sweet or has a strong taste of fish sauce that I've had in some Thai restaurants. The flavors are also well-balanced, and you could taste the individual ingredients' flavors on their own. The portion size is also decent. I was worried when I saw pictures that it would be on the small side, but it was definitely enough for me. \n\nThai iced tea was pretty sweet, but I have a sweet tooth, so I don't mind that as much. at least it wasn't watered down.\n\nThis is my first time going here so I have yet to try the other dishes on their menu. Based on what I've had today, I would come back to try the rest.", "author": "Eli P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-03", "description": "Wow! Just discovered this place. I'm really picky about Thai restaurants but this one rocks. Best Pad Thai in northern CA.", "author": "Scott O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-22", "description": "Ever notice the lack of Thai food in the mission? I did. I was surprised to find this old place on 24th was pretty good. Apparently it won best of the bay way back in the nineties, as evidenced by the faded framed copy of the Guardian bearing images of pot smoking aliens abducting a body-modded tattooed rockabilly S&M dot-commer. But I digress.\n\nThis is one of those old world style thai places complete with tons of teak and tapestry, ornate serving bowls and obligatory photograph of the King. \n\nThe food was not too sugary, but alas, not too spicy either. I tried to eat here again just this week, but the roll down doors were locked and a sign bearing \"Closed due to family emergency\" was taped up. I hope yall are ok. Come back soon, i'm hungry!", "author": "Zac H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-02", "description": "this is my neighborhood go to thai spot.  and you wouldn't even know it was there without yelp, i think!  the front of the restaurant is very unassuming.  i had walked by it for over a year and never knew it was there until i looked on yelp for thai.\n\npad kee mao is my favorite.  and the red curry is so dang good.  the staff is super nice and they always give me water while i'm waiting for carry out.", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-30", "description": "If you live close by and don't always have the energy to cook after you get home from work, You definitely want to be seen as regular. Treat them right and they will treat you right.", "author": "Patrick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-09", "description": "I have eaten here literally hundreds of times.\nLove it.\nGreat food. \nReally nice staff.", "author": "M.E. T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-18", "description": "Why Manivanh Thai Restaurant is a hidden gem:\n\n1) The people who run the place are Thai. (e.g. Thai people use a fork and spoon to eat, not chopsticks like many other Asian cultures. Here, they provide customers with fork and spoons. \nAnother example - the owners and staff all speak Thai.\n\n2) Thai food has never tasted so good in S.F.\n\n3) I've been to Thailand. I thought I stepped into a real Thai restaurant in Thailand when I first came here.\n\n4) My obsession with BBQ chicken started here and Manivanh has never let me down. \nThe BBQ chicken is amazing. It comes with a sweet and sour dipping sauce. \n\n5) Thai Ice Tea/Thai Ice Coffee/beer - something for everyone.\n\n6) Great service. The servers are incredibly sweet.\n\n7) Great date place. You're surrounded by Mission bars and Humphry's Ice Cream is a couple blocks away. So is the hospital.", "author": "Vanessa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-11", "description": "I'm gonna go with a 5-er on this one, mostly because I feel at peace again after CLG shut down and we were at a loss for good Thai in the neighborhood. Why did it take so long to discover this gem? No clue. No excuse. We walked right in and sat down on a random weekday. Plenty of seating. Don't be fooled by the fake-out door, keep going until you hit the real one. Service was average and nothing out of the ordinary but the food definitely stood out. Pad thai at Pad Thai Restaurant in Bernal sucks. Manivanh's pad thai is probably the most delicious pad thai I've had in a long time. Full of flavor, not too dry, not too soggy. Spring rolls were hot out of the fryer and plenty crispy. The roasted duck could be over-looked (we wanted the roasted chicken but they were out). Panang curry was good but Pad Thai Restaurant may take the win on this dish. \n\nOnly fault is no delivery but for this quality food, I'm willing to get off my lazy ass and walk a few blocks.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-03", "description": "OVERALL: 3.1\n\nFOOD: 3\nAMBIANCE: 3.5\nSERVICE: 2\nVALUE: 4\n\nAfter a 2+ mile wild goose chase around Mission/Valencia for some hot, fast food, we finally found this quiet spot nestled between pawn shops, taquerias, and laundromats.\n\nLike most Thai restaus, menu is pretty extensive, but smaller than some (not nearly as many vegetarian options).  Since we were all voracious from the trek, we ordered immediately.\n\nFried Spring Rolls:\n4 for $7.95--lean meat, but too much porky flavor for my taste...only so-so.\n\nTom Kha Gai Soup (Chicken Coconut):\n$8.95 (enough for 4)--fragrant, sweeter than usual, full of lean meat (ligh & dark), mushrooms, cilantro.\n\nPan-Fried Rice Noodles w/Tamarind Sauce, Tofu, Egg, Peanut, Bean Sprouts, Broccoli:\n$9.95, went by some other name I can't recall, but pretty much Veggie Pad Thai....decent, but sauce was unevenly distributed and noodles were on the overcooked side.\n\nFriends ordered various curries and were happy (though by self-admission, they were Thai newbies).  Iced Thai Tea & Coffee ($2.50 ea) were standard and satisfying.  Rice is charged per bowl/serving ($1.50 ea)...no brown rice option (awwww).  Spice quotient is wide-ranging & very customizable, so gun-shy and zealots alike can eat happily....just tell your server how hot you like it.\n\nPrices are lower than average (i.e., most expensive item is $12.95 for seafood specialties; other items average $8.95) and partially makes up for otherwise forgettable food.\n\nPretty blah experience, which isn't so good given we were so hungry and easily pleased at that point....service was minimal (only 1 refill)...also wouldn't run multiple cards, though somewhat forgivable since profit margin is so low with their low prices. \n\nMost likely will not be back...too many other options out there.", "author": "Amy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-14", "description": "I'm in love... I think I could survive for quite a while on just the Yum-Plaa-Muk (calamari salad) and the Plaa-Gra-Tiam-Prig-Tai (red snapper sauteed with onions and green peppers in a garlic/black pepper sauce).  We ordered the snapper spicy and it had a great kick.  The duck in red curry was disappointing (mostly fat, very little meat, and the curry wasn't as flavorful as I expected), but the aforementioned seafood dishes were 5-star worthy, so I guess it balances out.\n\nService is wonderful - quick, attentive and friendly.  I agree with Carmine R, music would be nice, and they appear to have a sound system installed; some background music would greatly improve the ambience.\n\nLook forward to going back to try more dishes!", "author": "Julie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-13", "description": "I've had better...I think. I mean, at first, my pad thai or green curry was A-Ok. But after eating a full plate I was wondering what the odd taste was in my mouth; I wasn't full, but I wasn't excited about finishing.\n\nI think they might need to get new carpet--the place has a slight aroma that is not of thai food.\n\nI really want to like this place more. I'm sure I'll be back.\n\nOn a more-than-meh note: The waitstaff is wonderful.", "author": "John F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-23", "description": "EDIT:\ni forgot to mention the weirdest part of all...\n\nwhen we got our check, it came with 2 chocolates. that's not weird, but what is weird is that they were wrapped in gold foil that said, and i am dead serious, \"The Ritz-Carlton, Huntington\". we took a pic of it for proof - http://flickr.com/photos/superfantastic/3055292190/. \n\nthe waiter said that they buy them from the Ritz Carlton. now, i used to work at the rchmb, and let me tell you that they are not selling their chocolates. \n\nstrangest. thing. ever.\n\n/edit\n\n\n\ni went there last night for dinner and although the curry was good, i had an awful experience with the appetizer.\n\nwe ordered the vegetarian silver noodles and when i tasted it, it had a strong fish sauce flavor. hmm.\n\nme: excuse me, is there fish sauce in this?\n\nwaitress: yes.\n\nme: well, i don't think it should be in the vegetarian section then.\n\nher: rolls her eyes.\n\nnow, i'm pretty sure that it didn't say there was fish sauce in the description, but i could be wrong. so, if you go there and you are a vegetarian, best to ask if the dish really is. even if it's listed under \"vegetarian appetizers\".  \n\ni would expect this to happen in new york, not here.\n\nthe rolling of the eyes closed the door on manivanh for me for good.", "author": "Kenna T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-11", "description": "I'ts nice to have a thai place on 24th that isn't that bad. I've always walked past this place because its very dark out front and basically I never saw the thing. \n\nI walked in there and hoped for the best. You can tell its super family owned because a few times their kid ran through the hall screaming waving a somehwhat sharp looking power ranger toy yikes! They have a fairly extensive menu with duck as well and many dishes that I've never seen before at your typical thai place. I usually eat vegatarian when I eat thai food due to how heavy most meals sit so I glanced at what they had for veggie dishes. I was craving pad noodles and I saw a dish that was a variation on the pad thai noodle and tofu so I decided to go for it. It was the first item on the vegetarian list \"Pad something gah jing, mu ling, ga joh,\" something along those lines lol.\n\nIt was great and I ended up eating everything off the plate. I was putting some of the red pepper sauce on top and that seemed to be the way to go. I really liked it although the dishes seemed to be high priced for the service you get and everything else that comes with it. I ended up paying $15 for my pad dish w hot tea which seems a little steep. I've been here twice now and I haven't been let down however so I'm sure I'll be back to sample some duck or something diff than I usually get.\n\n-t", "author": "Tony G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-08", "description": "This place is good. Once again I ordered the Panang curry and the Green curry. Both were pretty good. In general, I expect Panang curry to be rich in flavor but this place makes theirs with a little less POW (not as creamy, not as spicy). Even though I could use a little more flavor, I'm rating this place highly because of how fresh the chicken and veggies were. Chicken was quality and prepared very well.", "author": "Jones E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-15", "description": "Just down the block from home this place always has some of the freshest Thai in the city.  Packed with flavor they make their Pad Thai just the way I like it, with the right balance of savory and sweet.  While other establishments drench their noodles in a syrupy mess Manivanh's Pad Thai is almost as good as what we had on the streets of Bangkok.  The Tom Ka Gai is delish and the their curries are TDF, with freshness of the ingredients bursting in a symphony of flavors!\n\nThis is a family owned and run hidden gem in the Mission!", "author": "A P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-26", "description": "All the good stuff that everyone says about this place seemed to be true today when I went for lunch.  Service was attentive and friendly.  Restaurant was clean and tastefully decorated.  The prices were reasonable and portions were generous.  The food was delicious (I had the Carmen special and it was worth eating again).  When I asked my friend what she thought about her dish, she said \"I think that may have been the best pad thai I've ever had.\"  My cousin got the Carmen special with calamari and noted that hers was a tad bit saucy for her.  \n\nI'll never wait in line again at the crappy Vietnamese place down the street on Potrero!!\n\n\nUPDATE:  \nI've been here another couple times since my original review.  It's CONSISTENTLY great!!  AND .. the pad thai was definitely the best that I've ever had, hands down.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-06", "description": "Ehhh. maybe 2.5 stars.\n\nCame here for lunch with colleagues after completing my last rotation at San Francisco General Hospital.  We were a party of 7.  I'm not really a big fan of Thai food because I always leave feeling hungry. That is to say I always find the portions to be small.\n\nI had the pad thai and a little bit of everyone dishes.  Nothing memorable. I would've given them 3 stars but what happened next was kind of ridiculous.\n\nThe place was empty.  We were a party of 7 but only 4 of us wanted to eat while the other 3 just wanted to drink.  Well, because we were all seated at the same table they charged us the standard gratuity fee.  No one saw this coming. This was after we told them only 4 of the 7 were eating.\n\nMoney wasn't the issue.  They get an additional 1/2 star for the attractive waitress. =D", "author": "Sun T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "Who knew that a Thai gem would be hidden n the Mission? I ordered appetizers while I was waiting for my friends. The chicken satay was cooked perfectly. It was grilled on the outside and juicy, moist on the inside. The flavor was great. I also tried the a shrimp and chicken egg roll. It was all very fresh and crispy. When my friends got there they raved about their dinners. The atmosphere is very relaxed. It is an easy location to bring kids and we were able to sit there and visit for a couple of hours without feeling rushed. They did a big \"To-Go\" business and numerous people came in and out for pick up all night. My hesitation for a 5 star review is two fold. The first thing is that the ambiance is a bit dingy and dirty. It's no big deal, just an observation and awareness depending on what you are looking for. I couldn't help but think about how successful this place would be on one of those restaurant makeover shows! It has a lot of potential. The other thing was that our server seemed to be the only one working the house. She was great, personable and did a good job, however she seemed stretched and it felt uncomfortable sometimes watching her. She was taking cash, running to-go orders out the door and attending to the tables.  While it wasn't crazy busy, it would have been helpful to have a cashier/bus person/manager/friend  there to help anchor the place. But don't let that stop you from gong there! Food is great and it may have just been an off night.", "author": "Robyn R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-31", "description": "Super good food, extremely nice people. Duck basil...pad thai....veg curry. All excellent!!!", "author": "Mark U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-27", "description": "I came here with my bf & labmate.  Perhaps it's inconsistent --\nbut the day I went, i thought everything was uninspired.\nPad Thai was .. not memorable.  Duck was ok but a bit too fatty.\nGreen Curry was.. murky & mysterious.  The service was abrupt\n& unfriendly.  The setting was old & sad.  The worst of it was that\nI kept thinking of the plenty of $5.99 lunch specials  (with\nfree Tom Ka soup or salad) in NY that taste better and are cheaper\nthan this place..", "author": "Shiba I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-30", "description": "This place should be added to the list of perks/benefits for SF General Hospital job applicants. I ordered the #4 with prawns from the lunch menu today and loved it. Lots of fresh ginger. I am a broccoli-lover and asked them to add some to my dish...they kindly obliged. \r\n\r\nThere is something about Thai food that I find totally comforting. I have a feeling Manivanh will provide lots and lots of comfort as I continue my nerve-wracking training at the hospital.  I think nurses with bellies full of delicious Thai food are more likely to provide superior patient care, don't you?  \r\n\r\nP.S. Don't come here for the ambiance. There isn't any.", "author": "Abby W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-19", "description": "Went on the overwhelming positive feedback from Yelpers.\n\nGood prices. Great Pad Thai. Friendly People.\n\nWhat more do u want ? This aint no McDonalds bitch!", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-25", "description": "Manivahn's is one of my favorite Thai restaurants. Besides being about 3 blocks away from me. And I've been to over a dozen+ different Thai restaurants in San Francisco and a couple on the Peninsula and East Bay.\n\nI really like their Pad Thai noodles. Although I wish they gave more than 3 prawns. They honor my request of extra raw bean sprouts on the side at no extra charge. Another one of my favorites is their Pram beef in peanut sauce and spinach, sprinkled with chopped peanuts. Great flavor. And I love the mild curry chicken with coconut milk. Wonderful mix of spicy and tropical sweet flavors. I always order that as an entre over Thai chicken fried rice. \n\nThai cuisine is so unique in it's blend of spices and variety of healthy dishes. Manivahn's has been around for years, has a wide selection to choose from on their menu, and very popular with the nearby SF General Hospital staff customers. And with me of course. And the owners and waiters/waitresses are always friendly, even remembering me after not seeing me for awhile.", "author": "Roger S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-22", "description": "I ordered the yellow curry with tofu. I was served a pile of fried tofu with about five potato chunks in a greasy, thin sauce. Some spices and vegetables could have saved it. \n\nI could have spent $7 less on an instant meal from Walgreens and had as decent an experience.", "author": "Jenna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-16", "description": "do yourself a favor, get the 49 Beef Curry with carrots.  No questions, just get it!", "author": "Peter v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-12", "description": "Update: prices have gone up. The lunch specials are now $7.95, and Pad Thai $8.50. This isn't enough to lower its rating, because the food is as good as ever, but it's kind of a bummer.\n\nMy wife and I eat lunch here once a week because it's close to her work. Everything you read is true, but people seem nonplussed by a what a great joint this is. The lunch specials are extensive and feature deliciously fresh veggies and meats, not to mention tofu stir-fried to crispy perfection. Their sauces are judiciously applied, and all have a distinct flavor. I enjoy the roasted curry paste and garlic & black pepper the most. As testified, the Pad Thai is excellent. Also very good is the Red Veggie Curry, which is a big ol' mess of stuff -- bamboo, peppers, broccoli, even seitan -- in a spicy coconut milk broth.\n\nMy wife and I keep coming back here because it's affordable, delicious, and laid-back.", "author": "Henry M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-17", "description": "It was dead the night we came in to get take out but the service was good and our food was fine.  I enjoyed my tom yum soup but it was more sweet  than I like.  I much prefer spicy versions so if you like milder soups, this one would be fine.  Tintin's yellow curry was tasty but also a little sweet for me.  Nothing about the food or the place stuck out enough to make it a destination spot but if you're leaving Mission Cliffs, it's not a bad option.", "author": "Seong P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-27", "description": "I'm coming back here agian. THe location is so-so (difficult to find parking) but the food was fantastic. Not very spicy, so we need to ask for more next time. Very flavorful though. The pad thai was tasty. The \"calumari salad\" appetizer was interesting and fun. But I'm also on a squid kick these days it seems. I'm coming back to try out some more. \n\nBeautiful art on the walls. Very cozy feeling.", "author": "Benjamin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-08", "description": "I just found a Manivanh receipt in my wallet and had to Yelp to remember what the hell a Manivanh was. Now I remember: really good Thai food that didn't cost a lot of money.\n\nAs I remember, which might be wrong, me and a friend each had an app, an entree, and a beverage. I think I had an iced coffee thing. She probably had beer. My receipt says $31, which ain't bad.\n\nI remember the food was surprisingly good, and we both really liked it. I drink a lot, so this is about as specific as 3-month-old memories get. \n\nRecommended.", "author": "That Was A Good Drum Break .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-23", "description": "I'm going to make it short and sweet. For the price, this restaurant is a good find. Very very veeeery good yellow curry dishes. I use to walk here every so often with my man, gorge myself, have  few beers, then end up with a bill for two under $40. Pretty darn good deal if you ask me!\n\nThe decor could use a little upgrade and they are not open on Sundays which is the best time to go out to eat, but other than that I say stop on by!", "author": "Ali K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-13", "description": "I love this place. I've been many times to eat in or take-out. Take-out portions are large and a great value for the price. Consistently above average thai food, and very vegetarian friendly.\n\nGood, friendly service, and family-run. They're open pretty late on weeknights too.\n\nComfortable, clean, quiet and stylish interior is fine for a quiet evening with my girlfriend, or a large group (they have a separate group dining room).\n\nUpdating with an additional star for their speedy service, too!", "author": "Raduga N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-12", "description": "I used to work around the corner from Manivanh and I was always happy when I could convince my co workers to spend a little more than the usual $6 or so for lunch. It's not a cheap lunch joint. The decor is so-so (carvings hung on the walls and a couple of other items, but generally it's just a room with some tables in it) but that's no the point. The point is that the food is very good. It's my favorite Thai restaurant in the city. Better than Thai House Express (except for the hours). Better than Khun Phoa, which is now gone. I love this place and I'm sad that it's so far from where I live now, cuz I hardly go there anymore, except as a treat.\nOnly 4 stars because the decor and service are decent but not great. This is not a schwanky date destination nor a place to have stylish wait staff falling all over you. It's all about the food!", "author": "Jamie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-01", "description": "came in here unplanned because we were just walking around the area.  the place is sort of dark and gave me that \"i'm not sure what's going on\" feeling.  the menu had a nice and but not crazy extensive selection.  i did notice my favorite pad see ew was not on the menu. :(  i can't remember what i ate, but it was a rice dish with pork, basil and some chili sauce.  honestly, it wasn't all that great.  the sauce was pretty much siracha/sambal mixed in, so more salty than spicy in my opinion.\n\nwill i ever come back? probably not.  there's better thai food out there.", "author": "Sally T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "The broccoli + tofu pad thai, ordered \"spicy,\" was served with an orange wedge and a lot of dark sauce. It had a complex smoky, charred flavor that was different than any other American pad I've tried. I liked it, even though the noodles were slightly al dente. The morsel of Belgian chocolate with the bill tips this spot into \"hidden gem\" status. Cozy and quiet dinner vibe.", "author": "Danny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-19", "description": "Wow wow wow! If you are a vegetarian and a tofu lover, this place is AMAZING.\n\nIt's an unassuming little shop in the Mission. I never would have gone in if my friend hadn't raved to me about it. We were a group of five, and were seated immediately (on a Saturday night!). Three of us were vegetarians, and the carnivores were kind enough to let us order an all-veggie meal.\n\nWe got pretty much everything with tofu... You can order your tofu steamed or fried. Order the fried! It was the most delicious tofu I have ever placed in my mouth. And I am not one for superlatives (especially when it comes to food). But wow. Lemony and crisp and juicy...\n\nThis place deserves much more buzz than it gets. Maybe it's the whole location thing. Move it to Valencia street and there would be lines out the door, no doubt.", "author": "Trey F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-12", "description": "mehhhh.. its OK.  My brother thought it would be good, but I didnt think it was that great.  I thought the pad thai was a little salty.  My silver noodles were also a little on the salty side.  Onions were also too raw.  \n\nthe only part I liked was the peanut sauce with the fried tofu.  They do give you a lot of fried tofu.", "author": "Janet S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-26", "description": "We were all pumped up to go try this place because it's really close and we thought \"This is going to be awesome to have a great Thai place close by!\"  But now I feel ethically bound to warn other so they won't go have a pretty much awful meal like we did tonight after reading and foolishly trusting the positive reviews here.  \n\nI'll say up front, that the people who work there are nice, the place is clean looking and the Thai Ice Tea was good, which is the only reason I gave it two stars instead of one. \n\nBut the food, eeack!  First, the vegetables with \"chef's special sauce\" was bland and the beef looked freezer burned.  The chicken Pad Thai was doused in an orange sugary sause.  Just gross.  My mate was still hungry, so she got the highly recommended (by the waiter, who was, again, very nice) beef salad.  She was so hungry she just ate most of it, but I had a bite of the beef and it was chewy and saturated in the lemon dressing and, ah, not good.  When it was all done, we both had a greasy taste in our mouths.  \n\nWhat a disappointment.  I'm sorry to say, it was so bad I'm not interested in giving it another chance, which I will normally do with places I'm not happy with on a first try.  I'm not a huge fan of Grand Pu Bah at the foot of Potrero because it's kind of wannabe hip, not to mention pricy, but it is hands down better than this place.", "author": "Justen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-05", "description": "So, this is my first review since moving to SF. \nBeing that I have travelled extensively to Southeast Asia, I am always a bit suspicious of such food back here in the states. How authentic or fresh or compromised for the American palate is this going to be?\n\nManivahn is actually in my neighborhood--24th Street, in the Mission. I promise to not be biased. In fact, I move around quite a bit in the city to find good Thai food and it is mostly at least good. Sometimes the flavors are a bit contrived and the different dishes muddle together after a few bites.\n\nNot so with Manivanh!  This is my fourth time dining there, so I have a more complete picture of both their menu and consistency. \nThis is the real deal. Love the Larb Ta Hu (a salad with Tofu, mint, orange slices, etc)---light and well-balanced and a great way to wake up the palate.\n\nAlso the Plaa pad ma kur (terrible Thai on that one)--basically a lightly breaded and sauteed rock cod in a light, yet flavorful sauce. Delicious and delicate and a crowd pleaser. \n\nBetween those and the eggplant & chiles in a special chef's sauce, the perfectly-executed sticky rice and the almond-oil tea, I am quite impressed each time.\n\nThe only gripe is the lack of music in the place. Now, I am very loquacious so I am not one to fear the awkward silence that can happen on dates and so forth, but I do enjoy some aural ambiance. Need to discuss that with staff on next visit.\n\nOh, almost forgot to mention the lovely wall art. Deep-carved scenes of the Ramayana and Floating Markets as well as Apsaras really lend to authenticity.\n\nJust get some music in there and it'll make this one a FIVE STAR!!!", "author": "Carmine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-08", "description": "the food here is delicious, and most importantly, cheap! (i never spend more than $10 for myself, and I always have food left over) \nI work about 2 blocks away and i order take out from manivanh on a regular basis. the people who work there are always friendly. everytime i have been there to get lunch take out the place has been surprisingly empty, considering its one of the only thai places in the neighborhood thats open for lunch. might have something to do with the fact that its in the Mission, surrounded by taquerias...", "author": "Maureen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-30", "description": "If you happen to end up in the SFGH emergency room, head on over to Manivanh during your 8 hour wait to see a doctor.\n\nThis place was so yummy and reasonable. I wish I lived closer so I could get take out every week.", "author": "Becks A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-11", "description": "MMMMmmmmmm pad thai.  Best I've had in the city and the take-out service was quick quick quick! \n\nI wasn't much a fan of the fried tofu app.  Bleh and bland.  Skip and order two pad thais.", "author": "Jill K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-19", "description": "I love working right down the street from these folks - their pad-ma-kur with tofu is the perfect antidote to a crappy day on the job.\n\nAnd I must admit that one of THE saddest moments I can remember was the day when I was craving said eggplant-and-tofu-laden dish only to arrive at their door and find that they were closed for a holiday.  Oh, the humanity.", "author": "Dani B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-07", "description": "I personally love thai food but getting my boyfriend to try or order any kind of asian food is super hard. I attribute this to my chinese neighbors who cook/boil turtle, chicken feet, and squid. Regularly, the smells of mystery meat woft into our house through cracks in the doors which is enough to make you lose your appetite.\n\nSo...when I suggested we try this place I was more than surprised to hear my boyfriend say \" Sure.\" The restaurant is small but cozy and the service was great. We ordered the Por-piah-pak, vegetarian spring rolls to start out with and they were really good with a good chili sweet sauce to dip them into. I ordered the pad thai with tofu which was tasty! The tofu was lightly fried not OVER fried like some places do and I loved the bed of fresh bean sprouts. The boyfriend ordered Pad-gra-prao which was tofu with chilis, mushrooms , fresh basil and a spicy sauce. Yum yum double yum! \nOverall, this place is very affordable and there is enough food for 2 if you order one dish. My only dissapointment is they didnt have sticky rice. I WILL go back again! Its the best thai food i've had in the city so far AND my picky boyfriend liked it which is saying a lot!", "author": "Amy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-16", "description": "Good Thai place with supposedly great Pad Thai.", "author": "Jim J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-01", "description": "Working at SFGH, there's only so many options for lunch. Manivanh Thai is definitely always at the top of my list!\nThe food is great, perfect portions and reasonably priced. You can't go wrong with the traditional Pad Thai, but you definitely have to try the green curry (I love eggplant and this is an awesome way to have it) that comes with rice. \nThe service is always great too! Even if you order out, they will serve you complimentary water while you wait, which is never too long.", "author": "Dee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-19", "description": "I agree that it is odd to get a spicy pad thai, but I will use this info to my advantage in the future. \n\nThis place is only 4 blocks away form me, so I am always ordering takeout on a whim. It's also a nice dine in for the evening, but then my boyfriend is bound to order way too much food (plus booze).\n\nI'm adding this review due to illness: relieved, not caused by this place. I've been ill all day and could not think of one thing I could stand to eat. Everything I could imagine made me nauseous just to think about.\n\nThen I remembered the gang-jae. I would recommend it to anyone, vegetarian, with general body malaise, or otherwise hungry. It has gluten and tofu, plus coconut and chili to heal your ills.\n\nThe pad thai is very good-well, I've never NOT liked anything there, but that gang-jae is the best!", "author": "dodie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-08", "description": "Calamari salad, any soup, shrimp pad thai, seafood. Its all good. \n\nCLG down the street has nothing on this paper dragon. \n\nRahhhhhh ! !!!", "author": "Joe G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-22", "description": "Visiting my gerl Alena at San Francisco General Hospital and she took me to Manivanh for lunch..\n\nHands down the best Pad Thai i've ever had.. Pure perfection..  Perfect combination of tartness, and sweetness.. You can only judge a Thai restaurant by its Pad Thai..\n\nA lil pricey for the Mission, but well worth it..", "author": "Carlo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-01", "description": "This is my favorite Thai restaurant in SF! I tried it because of the high reviews here on Yelp. Everyone is right, they are good and very reasonably priced. The portions are reasonably sized and perfectly seasoned. \n\nSpecifically, I like to go to Thai restaurants and try the Pad Thai. This restaurant had the best flavor pad Thai. My second favorite is Marnee Thai in the sunset. They also have a few creativ e\n\nGet off at the 24th Street BART and walk or catch the bus. It's a small place but the decoration is tasteful. I love this place!", "author": "David A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-27", "description": "This place is around the block from my house and I've been meaning to eat here for about 2-3 months. I have to say, they have quite the selection...I got tofu with lemongrass..it would have been nice if it was a little more saucy, but the taste was there. The pad thai I go to go for my pop-tart lovin' buddy - had a few bites it was delicious. Not dry and with great flavor. I had ordered with my meal, but asked for it 'to-go' and the waiter brought it out with our check - smart.\n\nreheat still tasted wonderful - red curry with coconut milk\n\nupdate:\n\nthis place gets 5 stars because their food is just always good. I crave it now. one of the best thai restaurants, period.", "author": "Anita C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-02", "description": "One more reason to never have to leave the 'hood.  Balanced flavors, great duck dish and suuuper tasty pad thai.\n\nMay be upgraded to five stars after a few more dinner selections.\n\nUntil then...falling in love with the 'hood yet again!", "author": "Sandy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-05", "description": "If you had told me, I lived within two blocks of this place yesterday morning I would not have believed you.\n\nLuckily you didn't, because I am pretty sure I would have made an ass of myself, telling you to shut up.\n\nThis place will probably be my new Thai Food go to, and not only for the location.\n\nThe Pad Thai wasn't greasy, and had a good amount of tofu/prawns/sprouts/peanut crumbs.  \n\nThe Tom Kah Gai soup was the best version of this soup that I have ever had.\n\nThe Prawn and Eggplant curry was probably my favorite though.\n\nWhen I went home and told my roommates, they didn't believe me.  \n\nAssholes.", "author": "Adam C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-07", "description": "This little family-owned restaurant is a gem in the Mission. It's consistently great, and the service is good, too. Food is fresh, authentic, and aromatic. Highly recommended.", "author": "elle s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-22", "description": "shrimp pad thai or shrimp green curry my fav,call ahead to place order if dinning in for lunch otherwise u will be late back from lunch break.Overall good food ,i come in atleast every other month.", "author": "Nina B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-26", "description": "Not good Thai food. Duck red curry was bland and had no curry flavor (tasted watered down); papaya salad was flavorless; pad Thai was bland and had very little beef. I don't recommend this restaurant.", "author": "Joseph Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-28", "description": "It's probably one of the few Thai food places in the Mission Dist. so I decided to give it a shot.  The place is normally not busy at all and the interior has a nice cozy feel to it.  I got the minced basil chicken, which the cashier recommended.  It's was okay, but too oily.  I've had lots of better Thai food in the bay area, but I guess it will do since it's in the Mission.", "author": "Ricky M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-19", "description": "I'll keep it simple:\n\nFood - Tasty, but nothing special. Portions were relatively small - 3 stars\n\nService - Very friendly and attentive - 4 stars\n\nPrice - On the small side for a $9 bowl of curry. There's a $12 minimum per person for dinner. I know that's not unreasonable, but when there's so many other good Thai restaurants for less, it's something to think about - 3 stars", "author": "Todd W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-08", "description": "I live in the neighborhood and love this place.  When you want a quick Thai fix, this place does the trick.  I believe it's family-owned and operated.  The pad thai is delish. \n\nAlso, if you have time to eat in, the decor is very traditional Thai and it super cozy.", "author": "Ames P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-11", "description": "This place needs a remodel for sure, but the food is pretty darn good for a Thai place at its price point. Yelp overall has it ranked lower than Chili Cha Cha but after eating the same thing (Tom Yum soup) at both places in a week, I can say there is absolutely no comparison. Manivanh's was fresh vegetables and flavorful broth with lots of spices, including fresh cilantro, floating around. Chili Cha Cha's was chili oil, tofu that had been fried hours ago and dumped in, and some sad looking vegetable-like things. So I'm giving it 4 stars, and telling you, if you're on 24th with a hankering for Thai, the choice is clear.", "author": "Cameron S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-25", "description": "We got take out here one night.  We got I think Panang Curry and Pad See-ew, if I remember correctly.  The curry was nothing special, but it was curry, so it was good in that respect.  The Pad See Ew was pretty middle of the road as well.  Not tons of flavor in either dish.  It's close by and reasonably priced, so it's good for a take-out fix, but I wasn't too impressed.  Pretty middle of the road.", "author": "Sean H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-16", "description": "...have been back several (many?) times since finding this place...always fresh and delicious...was in there again saturday 8-14...another great meal...and the stafff are friendly and don't hate their jobs...how refrshing is that?...will go back often as i can...", "author": "Bob L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-26", "description": "This is average Thai food...closest place to my house so I will definitely have it again.  When we ate there the service was horrible; we've only had it to go since then.  Food was average for thai, so I think 3 stars is just about right.", "author": "GranolaGorilla Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-07", "description": "Manivanh offers average to slightly above average Thai food.   The service is usually attentive, the ambiance is comforting, and the number of vegetarian options is definitely a plus.  The prices tend to run a little on the high side.  Sometimes I come here for the Thai ice tea alone - absolutely scrumptious.", "author": "Who Knows N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-10", "description": "The aroma of pungent garlic  coming from this restaurant caught my attention recently. My first sign of trouble here, however, came when asking for a to go menu last week. The girl working the counter was anything but friendly when handing one over and answering questions. Today, we arrived at the restaurant at 11AM and were kept waiting until the same rude young lady showed up. I joked that she was late, she insisted they were not (cook was opening gate), and asked us to wait a few more minutes for them to set up. No apology, no explanation. I wish I could tell you whether the food here is good or not, but we did not even get that far. My advice to the owners is to hire new staff immediately.", "author": "Kenny G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-04", "description": "I can't believe it took me so long to go to this place, which is possibly the closest Thai restaurant city to me. It was good, not remarkable. My vegetarian entree was pretty fish-saucy.", "author": "Amy E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-02", "description": "I really was hoping this would be my new favorite Thai restaurant, but unfortunately I can only give it two stars.  Went here for New Year's dinner.  Ordered the pad thai, pork praram, and a duck dish.  The pad thai was just mediocre. I've had better pad thai at little hole-in-the-wall thai places. Pork praram was alright, but not good enough to go back for.  The duck was mostly fat as I expected it might be and also had way too much diced ginger, perhaps to distract you from the lack of meat? \n\nBut I have to say the service was very good. They didn't smother us nor neglect us, so there was a nice balance there. We also stayed and lingered at our table while finishing our Sing-has after we paid and they didn't seem to mind at all.  No one was waiting for our table anyway. I probably won't go back unless I'm in the mission and not able to stomach yet another taco or burrito.", "author": "L. Renee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-11", "description": "Ode to Manivanh:\n(Zoolander style)\n\nYour thai iced tea was perfect.\nSo creamy and sweet\nlike a river of caramel\nbut not as gooey\nor thick\n\nYour vegetarian menu is copious.\nThe tofu was fried so crispy and soft\nhow could it be both\ni wondered?\nbut it was.\nand the dish was sprinkled with baby corns \nwith mushroom friends nearby.\n\nAnd the calamari and prawns were tantalizing.\nbathed with a spicy gingery sauce,\nmy taste buds were dancing\nhappily towards the calamari\nnot away, as many times they are.\n\nWhen we got the check\nwe were pleased\nSo inexpensive \nfor such nice food\nthat left our taste buds tantalized\nand our wallets half filled\nand our hearts content,\nat least with the meal.", "author": "bloopie s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-10", "description": "Their Pad Thai was good, but I've had better.  I'd patronize this place more if I were nearby.  Still, Manivanh's a definite asset to the area; I could see why it's such a big hit with the SFGH staff.  Worth the trek across town?  Probably not.  More than anything, I enjoyed the milk chocolate pieces that came at the end of our meal, as opposed to those mints that I never end up eating.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-29", "description": "this is a phenomenol place food is delicious pad thiaan yellow curry is my favorite here nice service as well really great place to go if ur near mission or petrero hands down best pad thai authentic taste i love it", "author": "DRASTIK P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-24", "description": "Read great reviews and finally checked this place out.... Best Thai food I've had in SF (or ever for that matter).... Fast service, fresh and flavorful.....Nice and spicy too.    I'll be back for sure.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-11", "description": "Best Pad Thai I've had in the Mission district by a long shot. This includes Pad Thai (which could be construed as Noe Valley), OLG and others. The decor is nice enough and the service was great (but I was one of two people, so it should have been).", "author": "Gabe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-21", "description": "everytime i'm having thai food, i find myself comparing it manivanh! unfortunately all the others never live up to that expectation and i'm rarely in the city anymore so i'll have to settle until then...\n\nevery dish i've tried thus far has been absolutely delicious. however, one word... duck salad! everytime i think of this dish i swear my mouth begins to water. it's definitely a favorite and everyone we've recommended it to seems to love it as well.\n\nthe atmosphere is cozy and quaint. the best part would have to be the service here which is always wonderful! consistently attentive and super sweet!", "author": "Julia C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-17", "description": "Some of their stuff here is okay but they are really annoying with the onions.  They put onions in everything!  Once I ordered something that didn't list onions in the ingredients and guess what... it came with onions!  Now I love onions but too much is just too much.  Also they seem to let junkies off the street come in to ask everyone for Methadone money... sigh.", "author": "Fredricko B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-19", "description": "Pad Thai Pad Thai Pad Thai Pad Thai Pad Thai . . . what's that?  Manivanh?  But I'm a Pad Thai loyalist!!  Pad Thai has earned my eternal undying trust and allegiance!  Pad Thai's delicious!  Pad Thai delivers!  Pad Thai . . . hey, that's some damn tasty yellow chicken curry.  What was I saying?  Oh yes . . . Pad Thai rocks!  Pad Thai . . . waitaminit, that tom yung goong is off the hook!  What was I . . . holy hell, get a load of this - prawns, scallops, zucchini and mushrooms sauteed in garlic-pepper sauce!  Move over!  Pad-gra-prao?  Don't mind if I do!", "author": "Jefferson C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-12", "description": "i get take out from here at least once a week and about once a month i dine in.  by now, the staff know my voice and name and, automatically know i will at least be ordering the #70 with rice.  i never get anything but the #70, with rice, for a main entree.  i have tried most of the veggie stuff and nothing beats the #70.  the tofu is fried perfectly and the sauce is filled with garlic and spice.  you won't get many veggies in this dish - just bamboo, lots of onions, and red/green peppers.\n\ni think the pad thai jae (#74), which geoffrey always gets, is also good.  and, when we dine in, we typically get an order of the fried veggie spring rolls.  they are standard but enjoyable. also, when you eat in they give you a few pieces of chocolate to end your meal.\n\nif you live near 24th and bryant and you haven't eaten here you are missing out.", "author": "Kristie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-05", "description": "Cheap, amazingly tasty and quite honestly the best pad thai my friends and I have ever had.  Also, they have gluten and lots of vegetarian/vegan options.  Service is awesome and HIGHly amusing.  Not to mention attentive.  Also, they'll substitute pretty much anything -- in my case, eggplant.  Mmm.\n\nManivanh is made of win.", "author": "Matthew H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-24", "description": "Close to home. Great food. Love that the guy treats me like an old drinking pal and I've only been going there for the past two months (granted I'm usually there once a week).\n\nMinus one star because....\n\n1. They manage to not be open when I really have a craving (aka Sunday nights). \n2. You can say no spice five times when you order and it'll usually come out spicy.", "author": "H.S. G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-23", "description": "If you're in this hood and craving the thai stuff, go here. The pad thai is excellent and yes, they charge for rice but the rice is so fluffy and perfectly cooked! The leftovers reheated really well. Everything tasted truly authentic and the thai iced tea was ever so delicious! Service was kind of slow, but friendly. Will definitely make this my go-to place for neighborhood thai treats.", "author": "Jeannie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-31", "description": "I think this is one of the best Thai restaurants in the city.  I've never had anything I didn't like, and most of the time I would say the food was simply superb.", "author": "Judy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-30", "description": "A quiet little restaurant in a corner of the Mission.  The hours are unexpectedly short, and they are occasionally randomly closed.  But the food is pretty good, and not too expensive.  The food is vegan friendly.  I recommend getting the dish with the seitan in it.", "author": "Douglas P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-26", "description": "Delicious food, fine service, comfortable atmosphere. Manivanh is a solid choice when you find yourself in the mission craving thai food. I've been here countless times -- but note it's a mere block from my house, I'd probably not go as much if I had to travel a distance. But as it stands, it's probably the place I eat most at right now because it's consistently satisfying (mmm, tom ka gai on a rainy day. Maybe I'll go there tonight.)", "author": "Mella P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-20", "description": "This was for dinner on a staurday night, lunch may be different. They got my order worng. I wanted Pad thai with no tofu.  The ditched the shrimp but ket the tofu. I did'nt send it back, whatever. There's like one waiter, so dont be in a rush. It's decent thai, but more traditional thai than fancypants new wave type of thai.", "author": "Greg H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-31", "description": "Very decent Thai food. A nice change of pace from all the taquerias if you're in the 24th Street area of the Mission. Curry vegetable and prawn dishes are delicious.  Place is pretty inexpensive, too.  If you're down by SFGH, it's a good place to eat. Clean and quiet.", "author": "Allyson V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-13", "description": "maybe it is an \"off-day\" for the chef today.  I ordered a red curry (with prawns) take-out.  they gave tons and tons and tons of rice and a tiny little carton of curry.  to my surprise though, there was like 4-5 prawns in there (it's not that i can't count, i was just not really paying attention).  the curry must have been watered down or something because it was super super bland.  i thought i was dousing my rice with water.  also, a tiny cup of curry & rice cost $9.75 (after tax).  For me, that's just a little too high.  Maybe if this place was only $6/$7 would i give this place another try, but as far now, i think i'll stay away.", "author": "H. L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-03", "description": "It is really hard to mess up vegetarian pad kee mao but this place managed it somehow. Worst Thai food i have had in a while, though actually a week ago i had even worse thai food on larkin and leavenworth somehow. Anyhow, i had been warned against this place before and i finally said i should try for myself and i wish i didnt.. \"pad thai\" on mission is so much better..", "author": "jake l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-16", "description": "This place is a good find in an area largely devoid of good Thai food.  The staff is very friendly.  The Tom Kah Gai soup is very good.  The pad thai is passable.  The spicy eggplant with chicken is good until you pay closer attention to the chicken - and that is my problem with this place.  The chicken is not recognizable as such.  It resembles no chicken I've ever eaten before.  I'd go back, but I'd stay vegetarian.  The meat seems sketchy to me.", "author": "Kiki V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-21", "description": "Kinda surprised at the high ratings here. We tried this place a while ago and it was solid but nothing special at all. I would go back if I found myself in the Mission with a jones for some Thai, but would not go out of my way to go here again. Good but very ordinary.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-02", "description": "update:  i'd like to add one more star for customer service.  there was confusion about my order tonight (hint: do NOT order takeout from the lunch menu during dinnertime; example: the curry karee is chicken and potatoes at lunch, but there is NO curry karee at dinnertime, but instead a curry karee goong which has NO chicken, but prawns instead).  i went back to the restaurant and they made me a replacement chicken/potato version free of charge, and even gave me a glass of iced water while i waited for it!  plus, there was no attitude, no \"well, it's your fault, you ordered stupid, now go eat your prawns!\"  it's great when people help you figure out what happened without making you feel like an idiot.\n\ni like their yellow chicken curry cuz it's just chicken and potatoes, but then again i like most yellow curries.  the chicken is kinda fatty and potatoes inconsistently cooked (some harder, some mushy).  don't get the panfried egg noodles- it's basically some broccoli and onions on top of a chunk of ramen noodles.  not very flavorful.", "author": "Zoe L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-26", "description": "Great service, tasty food, nice quiet environment, reasonable prices, yes this place is a little hidden treasure in the abundance of Mission eats. I had the eggplant/vegetable dish with rice and was very happy with it. I really like this place for the tranquility, very soothing and especially perfect if you're in the mood for a chill night and don't want to deal with a wait or noise. I can't wait to go back.", "author": "Swetha G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-09", "description": "Picked up takeout last night and was pretty disappointed. How can Thai food be bland?", "author": "Priya S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-14", "description": "I am quite surprised by the number of 4 and 5 star reviews of this place. I had dinner there last night, and it was borderline terrible. It was without a doubt one of the worst Thai dinners I've had in the city. Nothing was fresh, it tasted like a lot of sugar was added to the dishes, and everything was bland. There's just no reason to choose this place with so many other outstanding options in the city.", "author": "Eater S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-21", "description": "Delicious Thai food. When I'm in the Mission and have a need for eggplant, Manivanh is my goto joint. For some reason it's not all that crowded either whenever I go.", "author": "Donovan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-13", "description": "Not the best thai restaurant...but if you need a fix...definately a good place to go.  Their pad thai is good..chicken satay is ok...and their number 40 (rock cod with string beans) is yummy.", "author": "Maybelline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-18", "description": "Yeah, thats right, I'm throwin down 5 stars for my folks down at Manivahn. Nice intimate Mission spot. My family dines here regularly.\n\nThis is good Thai food. Fufu snobs may disagree, but what do they know. They can have their saffron, truffle oil version of Thai Food. From the Angel Wings to the Curry, you can't deny that this is good food. Family owned...  good folks.", "author": "Dan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-18", "description": "Go with the Larb Ped as a starter, it is minced duck salad with chili peppers, red onions, fresh mint, and lemon dressing with a touch of rice powder.  That's a bangin opening to a dinner, for follow-ups the standard thai stuff here is good, it's a solid place to eat, but yeah, larb ped all the way.", "author": "shawn g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-30", "description": "I go here all the time.  The wood carvings on the walls are enough to make this place magical.  The food is suburb, with rice served in ornate tin dishes, and your meal on a plate like it should be.  I've had spicier than their spiciest (ask for as spicy as you can make), but it was still intoxicating, which is what I go for.  Their food is very very good.  I would take business partners here, or visiting friends, or roommates.", "author": "Ben H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-24", "description": "Back in the early 70's, this place was the best of the first crop of Vietnamese restaurants that swept SF after the end of the war in Vietnam -and remained so for many years, until the mid- 80's, when it changed to its present Thai incarnation. The new place took a couple of years to catch up to its  predecessor and continued to be excellent, until 5 years ago, when their kitchen took a dive south - quality wise.  Service and atmosphere are both good, but they can't offset the mediocrity of the food.", "author": "Victor M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-12", "description": "This place really is a hidden little gem in the neighborhood, well, maybe not that hidden since everybody who works at the hospital eats here, and for good reason.  Everything I've tried is delicious, like the eggplant, duck, seafood, red curry chicken, and especially the pad thai.  They use the Vietnamese pho noodles which is chewy in texture the way I like it and the sauce is very good.  My coworkers and I always share a couple of dishes and it's just enough food without making us feel bloated or overly stuffed afterwards, leaving enough room for the delicious fried banana and ice cream dessert.  My only little complaint is that they charge an extra $1.95 for shrimp dishes and only give you like 3 shrimps, but overall this is a great little restaurant and I will keep coming back for the great food.", "author": "Stewie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-03", "description": "I've been walking in front of this place for one year and a half. I always got the impression of a low quality restaurant, suspicious. Well, good to know that I was wrong. The place is cheap, not so oily/greasy, passed the Pad Thai and Green curry test and on top of that, looks like a preferred lunch-shelter for SFGH people (I am one of those). Honestly, it's been a good surprise, one of those that makes you smile and say \"shame on me\" for judging places for the way they look.", "author": "Dario B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-02", "description": "One of the better Thai places I've had.  Their pad thai was good, but I can't say it was the best (although, I partially blame this on my sister.  She wanted pineapples in the dish, which throws everything off in my book).  I LOVED the yellow chicken curry.  I'd go back just for that.  Also, the tofu was reallly very good- crispy and yet soft on the inside, even my non-tofu-loving-cousin liked it.  The Thai Iced Tea was very sweet, which means I liked it.  Went on a Thursday at dinner time, and there was no crowd- a nice change...", "author": "Rohit G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-07", "description": "non greasy, totally decent thai food in the mish.  CLG is bad.  really really bad.  so it's nice to have another option close by.  i ordered chicken salad and that was yummy.  i also got their chicken red curry dish (#22) and that was not good.  also tried the ginger prawn and mushroom dish (#20) and that was nice.", "author": "Melissa Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "One of our 'finds' in the mission - food is some of the most flavorful Thai around.  The chicken in the curry is nicely marinated, tender and dee-licious.  Decor is not 'destination' quality, so we do take-out.  Frequently.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-23", "description": "This is the closest Thai place to my house and I feel quite lucky about that.  I love their shrimp with green curry.  Another delicious option is the Tom Ka Gai soup, but there are inedibles in that soup, so be careful while you eat.  I know that the inedibles make the soup yummier, but I always end up munching on some whole lemongrass and leaves.  The service, however, is excellent and quick.  I don't go here once a week for nothing.", "author": "Jody S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-16", "description": "So i decided to try this place because of the good reviews on here but stick to the foods that got those reviews. I was a bit disappointed  but the food was decent but not great. BBQ chicken looked and tasted more like it was fried but was OK. When I want Thai BBQ chicken i expect it to be BBQd  not fried but who knows right. Rice dish and soup was good. Chicken Satay was OK at best but the peanut sauce was good. I will probably eat here again and try the pad thai people seem to like that", "author": "Michael K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-01", "description": "The food was solid and the service was good. The duck salad was yummy, but the beef curry was only so-so.", "author": "Christy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-13", "description": "I've been here twice and I'm a fan of the food.  It's also reasonably priced (and close to me!).  The Pad Thai and Yellow Chicken Curry are very tasty.", "author": "Akshay S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-23", "description": "Had this for lunch one day because it's close to work.  Not remarkable in any way.  Had the pad thai, which was fine although for the price I can think of a zillion other places that would be much tastier.  Not awful, just not worth it.", "author": "Amber M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-04", "description": "A Thai restaurant in this part of the Mission and of this quality is a great surprise.   The food is good and consistent.   A plus is that it's usually queit and not crowded evenings when the bulk of the SF General crowd has gone home.  And where else in this neighborhood could you get a Singh beer to go with your calamari and snow peas?", "author": "Gregg B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-20", "description": "Really tasty tai food and relaxing atmosphere.  I really dig this place because sometimes it is nice to walk into a place that is quiet and peacful.  The food is great and goes well with a cold asian beer.  Good place for food and conversation.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-09", "description": "wow.  inexpensive, super tasty, well-cooked thai food.  great atmosphere, really laidback and friendly staff.  there are a lot of vegetarian and vegan options, such as gang jae (veggie curry with mock duck) and pad thai jae.  their pad thai is seriously the best i've ever had.  and they will adapt orders for you :)", "author": "emma d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-24", "description": "staff=nice\nambiance=out of place\nfood=mediocre\noverall=overrated", "author": "Jaakko P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-19", "description": "I went here 4 years ago when I first moved nearby but hadn't been back for some reason.  Now with friends in town we needed some take out and I took other Yelp reviews to heart and decided this was the place.  Everything we ordered was delicious, the Satay, Beef Salad, Pad Thai, Duck, Chicken with Ginger and Mushrooms, and a little more.  Only negative is the difficulty in parking and the fact that it often looks closed (though it isn't).", "author": "Matt C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "We had a good experience here.  The food was quite good although the service was a bit slow.  I especially appreciated that the vegetables weren't cooked to death.", "author": "W R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-02", "description": "we've eaten here a few times and really wanted to like it as it was recommended to us by someone whom had recently returned from thailand, and said this was the 'most authentic' thai food in the city....we've never been to thailand, but we thought it tasted like every other thai restaurant we had been to...mediocre at best...the pad thai was ok, and the green curry was ok too...very small portions and the people that work there are extremely rude.  they make you feel like you are putting them out for coming into eat.  there are TWO tvs in the restaurant, both for the people that work there...they watch TV the entire time..we are definitely not in a hurry to come back...", "author": "lc m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-18", "description": "omg the food is so delicious... i had to marry in the family... now i get to eat all food on the menu plus many more custom dishes in the kitchen for freeeeee! how great is that? hahaha too bad you guys cant get it for free like me... but hey its not like the food is expensive or anything... best thai food in northern cali for the cheapest price hands down!!!!!!!!!!!!!!!", "author": "Bao N."}
