{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Late night is when it gets poppin, but the cheese is real. Not bad. \n\nNot bad \n\nNot bad \n\nNot bad", "author": "Giordano C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-22", "description": "This is a Mom and Pops shop hole in the wall that does a decent job on pizza, pastas and sandwiches. \n\nI always get the chicken parmesan sandwich when I'm here and they actually give good meat sizes with great seasoning. They have indoor seating with some nice paintings on the wall but no outdoor seating. \n\nNever had an issue with the staff. Good for a late night munchie meal.", "author": "Angel M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-31", "description": "I would have gave minus but doesn't allowed me....\nAsk for the detailed receipt if u go after party.... i was charged over... even was charged for the box in which they put my food....\nWorst cheese....... and arrogant and cheater owner....", "author": "Jenish P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-11", "description": "Marina Pizza and Caffe:  a small little cafe on one of the major highways through The City where you're likely to get satisfying comfort food.\n\nNote to all you suburbanites:  This is a typical San Francisco experience.  Park far, far away, walk through a loud and busy neighborhood, and enter the small door on 6-lane US 101.  Don't even think about pulling into a parking place in the private lot and strolling in.\n\nThankfully, our party of four found a place only 1-1/2 blocks away.  I was surprised to walk by a country-western bar on Fillmore.  When we walked in, we were faced with a little dining room that seats 12, a menu that had everything handwritten, and a smiling cashier ready to take our order.\n\nWe had just watched \"Lady and the Tramp\" at the Disney museum, so what was on everyone's mind?  Spaghetti!  Three plates of spaghetti, one with meatballs, garlic bread added, and I had to be different and order an Italian Sausage sandwich.  You can also order pizza and calzones, and a large selection of sandwiches for around $10 each.  We all ate as much as we could;  only my wife and I finished our food.  Our family friend said at her first bite, \"Ooohhh, this is SO good!!!\"\n\nIt's the little things that count.  The little things at Marina Pizza & Caffe:  A spotless eating room.  Comfortable seats.  The spaghetti came on a fancy white plate.  The cashier brought out the food, and was making sure that we had a good experience.  Our friend couldn't finish her food, so asked for a to-go box, and got a high-quality container that's microwave safe;  you don't even get that from Tony's Pizza Napoletana in North Beach.\n\nMarina Pizza & Caffe does not have the best Italian food in The City.  But it does have very good food at a very good price.  It's a good place for a romantic night out, a comfortable lunch, or a good pizza for a small group on the way to a night on the town.  Have fun finding parking.", "author": "Ron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Great pizza and service! Be  patient and get what you want. Must try in the San Francisco area!", "author": "Romeo A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-20", "description": "Literally the only place around the Marina that's open past midnight. My boyfriend and I ordered the 9\" combo pizza for roughly $12. It's a bit steep for what we got - pepperoni, meatball, and mushrooms. \n\nIf you're going to name a pizza as \"combo\", please add more toppings!! Tbh we felt a bit jipped. It was good though but we don't know if it was our drunchies speaking or if it was actually really good. \n\nVerdict: This place will answer all your drunchies but don't expect anything spectacular. It's a bonus they're open so late.", "author": "Valerie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-04", "description": "The guy who took my order was working on a pizza. Came over took my money then went right back to work. Never washed his hands. He was also eating the toppings while making pizza. I couldn't freaking believe it.(not tipping off the pizza but off his work table) I was grossed out and left. I will not be back. This place shouldn't be in business if they are that blatant.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "This place can get very busy but it's very old school and has heart! It's not going to get high stars if you are some spoiled kid that thinks money is going to get your food faster. The owner works his but off and remembers you. He likes to make people happy and goes out of his way. I love that you can sit here and meet people and have conversations late at night with strangers. It's a very friendly environment. I'm a fan of the food and service.", "author": "Rachael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "This is a great place for late-night food. You can go in there and eat but you can get delivered. I had the meatball sub and it was yummy. It was delivered quickly and still hot. In addition,they have a full line of entrées available until closing.\nWhether you're out late having fun, working late, or just gorging on Netflix, this is a great place especially when late night hunger hits you.", "author": "James D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-31", "description": "Stay away from this place if I could've give it zero stars I would have this bald guy that works here is super racist me and a friend walked in there and was waiting to order some food so my friend walked up to the fridge  to grab a Snapple and just because he is black he called him the N-word and told him to put that down and he cannot touch that started yelling and told us to leave absolutely disrespectful and a disgrace of a establishment you do not treat people that way just because they are black if you are a colored man or woman and are hungry in the Marina district do not go here this is America everybody has a right to dine in somewhere", "author": "Robert S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "I don't understand why this place isn't full all the time. It is always delicious. I love their meat sauce and my husband is a huge fan of their calzones. The salads are fresh and they have a huge assortment of beverages. The service is great and we always leave with full stomachs. Prices are good, too!!", "author": "Alisa W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-12", "description": "Customer service is terrible. Was standing in line for half an hour, in a line with less than 10 people. My friend ordered first, got his order in. The guy at the counter clearly saw I was next but got distracted even after looking me in the eyes and asking who's next. Anyways, he gets distracted, a drunk idiot cuts in front of me literally pushing a shoulder into me so he can stand next to the counter. ones the guy at the counter comes back he takes his order instead of mine and leaves the counter again. You guys are awful. It was the bald guy with the glasses. Ended up not ordering and leaving. Idk if the pizza is good.\n\n\nOh my friend said pizza sucked, he threw most of it out later than night lol.", "author": "Eugene B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-12", "description": "If I could give this place no stars I would the owner or who ever it is that is a bald old dude with glasses is rude asf! Please do not do anything by going to this place and buying pizza literally the worst esp at night they are extra rude to everyone.", "author": "Melanie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-04", "description": "Wow.. We can't even believe how horrible we were treated. 1 Star is not deserved here. . My friend and I went in for an honest pierce of pizza and left with refunds after seeing the cook scratch his beard with blue gloves and then proceeded to touch the pizza .. after telling the man behind the counter he got very angry .. The Owner the Resturant was pissed and had to be held back by the register woman.. they started speaking in Arabic (or another foreign tongue) and We heard repulsive insults being said. Horrible service and all in front of CHILDREN.this place needs to be Shut down.", "author": "Mary D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-25", "description": "Nothing special.  Ordered cheese bread... sandwich rolls with cheese.  Totally could make the same at home.  Ordered extra pepperoni didn't get it.  Ordered light sauce... she insisted I order it the way it comes and promised I'd like it.  So i did... I wanted it a little more done she again insisted that I order it the way it comes so I did.  \n\nDon't think it would have mattered if I would have ordered it how it came or not.  I think you get what you get here.\n\nOverpriced but friendly and pretty fast.", "author": "Becky W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "Super good. Especially for take out! (-: I got spaghetti and a meatball sub, love love loved both! Sauce is on the sweeter side, if that's what you're into, btw.", "author": "Sierra R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-19", "description": "I just ordered from UberEats and they delivered the wrong order. Whoever is the manager there, yes you j*ck*ss, is unprofessional and doesn't know how to run a business. I tried to cancel the order within 1 minute after waiting 40 minutes for the first order and they said that they already made it, yeah right. They are dishonest. Stay away from this restaurant. Unbelievable.\n\nUpdate: Their food is terrible.", "author": "Kris R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-19", "description": "Haven't eaten here in awhile and just realized exactly why I won't be eating there again in the future! Ordered a pizza and wings well done for delivery, mind you I live two blocks away but yes I'm a lazy ass. Food comes about an hour later, wings are barely cooked all the way through and the pizza was blahhh...... almost seemed like it was reheated the way the toppings wouldn't stay on the slice and the dough tasted. If you are thinking of eating here think again.", "author": "Dmitriy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-26", "description": "Nothing special but for a dying hunger this lombard st pizzeria did the job. The pizzeria offers an italian cuisine with sandwiches and other treats as well.", "author": "Ian K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-01", "description": "Bald man who owns the place has the worst attitude in the world. I got yelled at by him and I had to deal with no pizza on top of it. Other patrons stared at him yelling at me, for asking him for simple questions like \"how many slices in a 10 inch pie\"or if we can add toppings to half the pie. He was unable to answer any question in a civil manner. He yelled at the female he was working with behind the counter and  that's  when I lost it! I can't respect an establishment that cant respect  women.  This man is unable to run this establishment in a proper manner, and  has the  worst temper I've ever seen. This business needs to be shut down ASAP", "author": "Anonymous T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "Very nice lady and good pizza...if your not some hipster wannabe and actually talk to people and not down to them you get good service and great pizza", "author": "Olga K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-24", "description": "This place is one of many that I've encountered in a busy area for example having a hard time to find parking. But let me tell the pizza here was stupendous made fresh I had the pesto chicken and cheese pizza the customer service was good nice gentleman at the register might be the owner of the place for what it seemed like to me. Too bad this place is in the city I'm from San Jose or else I would grab pizza from here very often. I told them I was going back for the tortellini that's another thing for being a small place the menu was bigger than what I thought a little place like this can have. I'll be seeing this place sooner than I think.", "author": "Ricco B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-05", "description": "Meh, weird tasting, slow, strange metallic flavor to the meat toppings, good thin crust. Just not for me.", "author": "Cody H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-29", "description": "Kicked me out of their restaurant based on \"principle.\" Was a cold night, needed to call a cab, and insisted I was not allowed to do it there, despite only wanting to stay warm for ~2 mins. Restaurant was empty otherwise and wasn't disturbing or requesting anything. Would have cost them nothing to be hospitable and friendly and human, decided not to be.", "author": "Jeffrey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "Amazing! I've been here a few times and every time they exceed my expectations. They only use the freshest highest quality ingredients, and it shows with the incredible flavors in the food. Not only is the best pizza place in the marina it's also the most affordable. I couldn't recommend this place more, I guarantee you won't be disappointed.\n\nBonus: The owner and his wife work very hands on and are extremely friendly people.", "author": "Michael P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "I come here usually when it's late at night and there are very few places open.\n\nI would rate the pizza a 3/5 compared to NYC pizza, which is what I am used to. However the staff is very friendly and they are open much later than most other places, even on holidays so I gave them a 4/5.", "author": "Neil P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Awesome service! I ordered my food online to pick up within 30 minutes; I got there within 20 minutes and it was ready, warm and everything. It was a wonderful late night snack. I'd definitely go back again, if I'm ever in the neighborhood.", "author": "Robyn R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-17", "description": "I'll preface this by saying my pizza standards are probably much higher than most, but this might be some of the most uninspired pizza in all of San Francisco. It's soulless. The cheese is probably my least favorite part as it tastes really processed and my advice would be to fire the vendor and up the cheese quality ASAP.  \n\nFor the most part, it's packed full of people trying to soak up their booze from the marina triangle, so it makes for some great people watching. In fact, I've watched people throw up on their tables in the middle of the restaurant numerous times, but it doesn't slow the ownership down at all from cranking out pizzas. I know they can't control that, but it's mind boggling. \n\nThe only reason they get another star is because they are open the latest in the Marina/Cow Hollow districts and in a city where it's impossible to find late night eats, at least these owners are staying late.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-10", "description": "We just moved here and are looking for a good pizza place. This is the first, and only one we've tried so far. It's okay. Nothing to write home about. Delivery was fairly fast, food came hot, and it wasn't bad. Just wasn't great either. The search continues", "author": "Monica F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "Great little mom and pop pizza place with great quality ingredients and food. I had the Greek salad and wings very delicious. My kids had the pizza by the slice and they loved it. They have a varieties of pizzas and toppings not found around here.", "author": "F. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "Great hole in the wall place! Djamel helped us with our pizza order, the pizza is fresh and delicious. Cheese literally melts with each bite. Another plus is that it is open on Christmas Eve :)\nWill be back!", "author": "Snow Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-12", "description": "This restaurant is clearly racist against African Americans. They kicked me out for standing and waiting for my pizza. I have never seen a more unwelcoming place in my life. Pizza is also ass.", "author": "Anthony H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-23", "description": "Got in super late from the airport, and this was the only place open. The man behind the counter was kind of rude - kept saying the restaurant was only open til 2 even though the website said 3 and he was still serving people at 2:15? Also very brusquely insisted there were no slices available and we could only order a whole pie. The pizza was ultimately fine and the garlic bread was good.", "author": "Julez G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Great place. Came here while staying in San Francisco on the recommendation of the front desk clerk at our hotel across the street. Glad he pointed it out. There are a ton of pizza places around the hotel but this place was great. Owner was very friendly and talkative and the pizza was delicious. Great place. Another guy in the place when we got here said he stops here every time he is passing through SF. I would too! Check it out.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Great service very good timing with delivery. I'm happy with this place so far driver very polite and quick good service. Food excellent", "author": "Bradley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "Very delicious pizza ,breadsticks ,potato wedges very fast delivery and the food was still fresh & hot", "author": "Miesha P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-05", "description": "Horrendous. Super unorganized, took 45 minutes to get two slices while people who ordered well after me were eating and leaving. Guy behind the counter was rude. Pizza was very average. Avoid at all costs.", "author": "John A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-11", "description": "This was by far some of the worst pizza I've ever had. I mentioned it to a friend today and she said the same thing. It actually tasted like barf. I think it's the sauce. Never again! Try at your own risk!", "author": "Randall F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-20", "description": "I ordered a pizza through this company to be delivered to me, ( a plain cheese pizza) not only was it over priced but the delivery was 32 minutes late, and my pizza wasn't even hot, instead it was warm to the touch. That is my first time eating with this company and it will most definitely be my last time eating with this company and I will also recommend my friends to never eat there or especially order food to go from them.", "author": "Matthew V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "I had a great experience with the guy running the front cashier. Very nice and cares about the customers. \n\nOpen til 3am it's what's you expect not a fine dining. 5 star for what it is\n\nPIZZANOS !", "author": "Dante D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-10", "description": "I went through work sick, I came home sick, and I browsed post-midnight hot soup delivery sick.\n\nI saw they were open till 3 am and ordered every brothy thing I saw: Minestrone, Lentil, Chicken Noodle, $4 each.\n\nI was chugging their soup menu in something like half an hour. Simple.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-09", "description": "So as you read any 5 star reviews here, keep in mind they have a sign posted that says if you leave a review on Yelp that says it's the best pizza, they will cut 10% off your bill.  Oh yea, you must leave the review  BEFORE you leave the store.\n\nReally, not very good pizza.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-13", "description": "Staff is very friendly and with the assortment of pizza they have available for you to order it's not a bad place to visit!\n\nPrices are cheap! If you're looking for a quick bite to eat. You can't go wrong with this place \n\nA place that's really worth your time visiting.", "author": "Maui U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "Late night pizza is a god send. The pizza is delicious. No lil Cesar's here. Polite staff and affordable menu. Slices at 3am perfectly located before the bridge for a pie on the way home.", "author": "David M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-23", "description": "Find an alternative. Your taste buds and happiness will thank you.?One of the worst experiences calling in my entire life. I explained my situation and the man hung up on me. Called back 4 times and the man did the exact same thing. I went in person finally to try the pizza and it really shitty. Please don't go.", "author": "Liam D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-21", "description": "I'm still waiting for my order!!! Takes forever for a salad and canned soup!!!! They don't answer the phone :(", "author": "teri s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "Great little place. Pizza takes a while but the people are nice. I usually sit and get a cold drink while I wait. Never been here late night but its usually empty vs going to eat on chestnut-- what a nightmare.", "author": "Linda J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-15", "description": "Hands down the absolute WORST tasting pizza I've ever tried. Dominos is 3 times better quality and a third of the price", "author": "Fernando M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-26", "description": "Best service we had this year. They charged our phones and they gave us 2 free pizzas. they are welcoming and very professional", "author": "Salim B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-01", "description": "I've been here a couple of times and the place is always blah. I only order from here when I dont want to cook. Chick parm, chicken wings, spaghetti/meatballs, salads and pizza are just OK. Don't come here if you are looking for quality food; you won't find it  at this place. Cheap and fast.", "author": "Noor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Great chicken parm. Excellently cooked. The ciabatta rolls were toasted perfectly with cheese that oozed out of the sandwich. They were also super friendly and accommodating to the point where you could care that they respected and appreciated every customer.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-08", "description": "My soup came in half full and the pizza was missing two key toppings.", "author": "Maria M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "This places has great pizza. The perfect amount of cheese with pesto. They toast it just a little more for a very nice toasty pizza. I love it.", "author": "Preston W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "the gentleman at the front counter was very nice as he grabbed our sodas for us.  He let me use  there restroom well we waited. When we got are pizzas he gave us napkins and got us a new parmesan because ours was running low. We ordered the all meat pizza its was great, plenty of toppings, thin crust and not too greasy. We both finished our slices and had to go back for seconds.", "author": "Teresa E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-11", "description": "Just grabbed lunch here since the only two options open nearby during the storm were this or the KFC/Taco Bell hybrid. Maybe other spots were open, but we didn't feel like walking far in the torrential downpour and we decided on Marina Pizza & Caffe over KFC/Taco Bell because I didn't feel like having diarrhea during a blackout.\n\nThis was LITRALLY (said like Chris Traeger from Parks & Rec) *the most* uncomfortable eating experience I've EVER had to endure. The long line of people ahead of us was totally understandable, but the fact that three groups of people who ordered after us received their orders before us...UNFORGIVABLE. All we ordered was two slices of pizza and a sandwich. The groups of people all ordered at least one box of pizza. What????? We got our food a whole hour after we ordered and the sandwich was cold ... My pizza wasn't piping hot or anything so it's not like they waited for everything to be done before serving it. The veggie pizza was yummy and fresh, while the cheese pizza was like cardboard. I can't comment on the chicken parm because my boyf scarfed it down from ravishing hunger from waiting so long before I got a chance to have a taste (hehe, jk?).\n\nAnyway, the worst part of it all? We had to sit through two customers and the lady running the place argue about money. The two guys were super patient & polite and just wanted a refund for not receiving the food they ordered last night. The lady would not budge and kept saying there was nothing she could do; they had to take it up with her manager. I even overheard her telling her manager on the phone that the guys wanted their money back \"after falling asleep.\" Liar! Really? They paid for something they didn't receive and wasted their time driving to your restaurant and waiting around. She could've easily offered them a comped meal and assured them that their money would be refunded to their credit card. Instead, she ended up threatening to call the police... Are you kidding me?\n\nTo be fair, she was clearly stressed out from the neverending line of hungry customers and relentless ringing of the phone. By the time they were having their tiff, no one else was there.\n\nAll in all, I've had better and absolutely wouldn't recommend this place for late night drunken munchie delivery.", "author": "Michele P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-02", "description": "super shady business! I placed an order through grubhub, the restaurant confirmed the order and gave me a delivery wait time of an hour. after waiting an hour and a half, I finally called to see where my food was, and they told me they were closed, yet they still took the money out of my account! \n\nyou don't confirm an order you can't actually fulfill! they were probably hoping I'd be drunk enough to forget about it or something since it was late at night.", "author": "Bree W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "The pizza here is good at a reasonable price. Even better than the pizza are the people who work here. They genuinely want you to enjoy your experience eating at their restaurant. \n\nI'm totally surprised when I read the other reviews about their customer service! The only thing I can imagine is if the customers are obnoxious drunks demanding pizza! If that's the case, come before midnight.", "author": "Aleysha H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "The best pizza I ever had  so dope  home slice. Go here when ur having fun w friends. Best pizza in SF hands down. Don't wanna miss it. Been here at least 10x", "author": "Lindsay Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "Or flight cam in late so we where looking for a late night restaurant in the cow hollow area. Ran across Marina pizza and had a great experience.pizza was good and man behind the counter helpful and checking on all customers to make sure they were happy with their food (they were)", "author": "Doug H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-12", "description": "These guys must not regard detail as a high priority in their customer service. After placing a delivery order online, I was told after waiting 60 minutes that the delivery was on the way and should be at my apartment \"soon.\" It was half an hour later that I found out that they \"misplaced\" my order. I placed my order at 2:30am... And at 4am they told me they lost it and can have the food at my place if I waited another 20 minutes...\n\nIncompetent... \n\nI've been ordering food here for years but after this... They just lost a loyal customer.", "author": "Robin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-03", "description": "I worked at this place few years, when it was considered one of the best pizza places in town, known for its good service and fast delivery. I stopped by to eat and say hi. The service was awful, not to get into details. No manners at all. I was shocked. \nHonestly, very sad.", "author": "Mahfoudh B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-26", "description": "Holy shit did I just have some of the best New York style pizza in San Francisco?  Yes I did.  Big flat floppy slices with the perfect balance of dough, unobtrusive red sauce, and cheese.  With my toppings I usually like to go big (think fig and goat cheese and arugula with balsamic redux), but in this case, the simplicity is perfection. \n\nTry to catch a slice piping hot fresh out the oven.", "author": "Harrison W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-25", "description": "Cheese whiz.\n\nIt's not that cheese isn't enjoyed. In fact like it quite a bit, just in moderation. Pizza is one of those things where with the right toppings you don't need cheese.\n\nAny chance to build a slice from scratch means going without. From the looks of the menu that seemed to be the case here. Eggplant, tomatoes, lots of sauce, no cheese. \n\nNo sooner had the order been placed that the extremely friendly and accommodating staff member informed me there is a cheese base. Then he offered to take it off.\n\nSlice was delicious and $3.50 with those two toppings is a deal. As was a very good and filling $6.50 grilled chicken sandwich. House red sauce added at no charge.\n\nVery strong four stars for the food. Final star earned by the attentive and generous staff. Whomever was working the afternoon of 5/25 is a customer service whiz.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-16", "description": "Well that answers my questions about this place. I just noticed this place has three stars. The service is EXTREMELY slow! I mean snail getting across the street slow. There are also some loud people here at 1AM. They need to shut up. The food, eh.", "author": "Vinson H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-13", "description": "Went to place once only cause I missed the bus home and I had another 30mins for the next trip. And let me tell you, it was an amazing experience. The pizza was cheap, you can get it by the slice for an instant meal. It's New York style too, which by the way, one of my favorite pizza styles. Big, floppy, and so so good! Only drawback that I'd say is it's so tiny so they're probably very busy during lunch hours. Still - a great place to have great pizza!", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "Very good food. I order from them a couple times a week. The Marinara mixed with Alfredo sauce is excellent. Great pizza too", "author": "Steve L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-14", "description": "Worst Pizza place in sf.\nAre you drunk in the marina at 3am, Saturday?\n Ok it will do the job. \nTry to go there in a week day. There's nobody!!\nWhy??? This place sucks!!!!!\nOh it's also dirty, they'll treat you like shit and the poor employees have to deal with the biggest asshole ever.\nI'd rather eat at taco bell next door.", "author": "I. L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-24", "description": "called them at 1230am they took my $27 dollar pizza order and told me I had to come in there and pay first ( I was gonna pay cash) and hanged up the phone\nrude unprofessional costumer service", "author": "Alex U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-25", "description": "I only came here because it was open late and I was starving and in the neighborhood. I will not be back. Pizza is nasty and horrible customer service. Don't go here.", "author": "Olivia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "This spot has the pizza on lock. by the slice or you can get a pie. Five star pizza. And the chicken parmigiana sandwich was great too. Small restaurant but great place to pickup food from or if you want a small quiet lowkey restaurant, it's great to bring the fam.", "author": "Palmer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-21", "description": "Good pizza, great prices, excellent service. We had pizza during our visit, but they have an extensive Italian menu to choose from too, and dessert.", "author": "Kate T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "I LOVE this pizza spot! \n\nThe boys and I come here after a night of bar hopping because they are open so late! Normally, the line is out the door, but can you blame them? They serve quality pizza at 2 in the morning. This small shop is operated by literally three people! the owner takes orders, an older guy in the back makes them and there's a middle lady holding the whole place down! When we go, I order the Chicken Pesto and Hawaiian AND I get the garlic bread! It's made to order and perfectly topped with cheese-y goodness and a side of marinara sauce. You just HAVE to get this! The pizza is thin but covered in sauce and cheese, which is exactly how I like it! Super flavorful and I always leave full! \n\nI'm only docking a star because the food does take awhile and there's only like, three tables in the entire place. But it's still my go too at the end of the night!", "author": "Kathleen N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "Eaten here 4 times and the pizza is always great . Open late and great service ! Would recommend to locals or visitors who need a quick bite late at night", "author": "Lena M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "Get something called the \"Paolo B.\"- a cheese pizza topped with hamburger meat and rosemary. \n\nCHRIST its good!\n\nAnd they deliver all the way over to divisadero corridor!", "author": "Emily D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "Love that this place is open late and has such a variety. I recommend anyone in the area come catch a whole assortment of Italian meals (pasta, pizza, panini, etc) when they need a late night meal.", "author": "Gabriel J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-28", "description": "Guy at the counter was extremely rude and non appreciative of our service on top of that the pizza was not good at all. It's not hard to be mildly nice to people who are providing your business a service, do better.", "author": "Bill L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "I ordered regular cheese pizza 18\" + peperoni and it was the best pizza I've ate in SF. Awesome pizza!!", "author": "Luis Felipe P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-28", "description": "If I could give this place negative 5 stars I would just because of the guy that owns/runs it. I have been here multiple times over several years, and he has always been extremely rude and stingy. On top of it all he lies with a straight face. One minute he tells us he doesn't have olive oil for our garlic bread and then when we say we don't want cheese on our garlic bread he suddenly has olive oil.", "author": "Shawn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "For an early morning pizzeria, this place is great!   You won't find many other places open til 3 am.    When in SF, I usually stay within a quick walk of this place, so it has become one of my traditions to have a meal here.    The food is not spectacular, but I've always had excellent service.   (Actually the pizza slices are really good.)\nIf you're bring a kid or two on the weekend, you may get some drunk kids (young adults) from one of the bazillion drinking spots in the area.    (Day drinking seems to be popular here.).  Not a big deal to me as I have no problem telling someone to watch their language if I'm with kids.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-11", "description": "Ordered from here because it was the only place open. \nDelivery was half an hour late and by the time the food got here it was cold. \nThe fries were burnt and the Caesar salad was a couple of leaves and three croutons.", "author": "Mariana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "Decent pizza and delivery for late night ordering and did a custom pizza for me and it arrived promptly. A bit expensive and it's not NYC pizza but good enough", "author": "Claire V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "This is a great place.  It is a small pizza place with a nice decoration.  I ordered the vegetarian pizza and the ingredients were so fresh and cooked to perfection.  And the service was excellent too.  I would come back next time that I visit San Francisco.", "author": "Nancy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "A long overdue review of this joint. I have been going here for a few years now. I accidentally happen upon it when some friends of mine were crabbing. \n\nOf course we didn't get any good crabs, so I just decided to find something to eat. It was around 1 am. and Mels Diner was the only option I was thinking, but then I saw this was still open. \n\nFrom then on, I just keep coming back here. Not often as I like to be. I have introduced this place to a few friends already. \n\nI just love the crust. It's just too tasty. I'm a ad scientist when it comes to toppings, so I just add whatever it is I think would work, flavor combination/profile wise. \n\nI was just there the other night after service (yes, I'm a cook), and dragged a friend with me to relax. Definitely coming back again and taking my nieces and nephews with me. \n\nFun place, tasty pizza. Eat here!!!!", "author": "Bryan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "This place is awesome!!!! Open till 3 am what more could you ask for?!!! Made two new friends who are amazing and the pizza is delicious!", "author": "Asseret V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-02", "description": "This place doesn't pretend to be anything other than what it is. It was kind of to the point where my cousin from Paraguay said that the restaurant reminded him of restaurants in Argentina/Paraguay. Very humble.\n\nWe came there around 3PM and the only person there was the chef. He made the food and he waited on us. That was pretty interesting. \n\nPrices are pretty good, less than $10 for a plate of pasta. My cousin got spaghetti and meatballs, my boyfriend tortellini with pesto, and I got a meatball sandwich. Everything was pretty average and the portions were average. The wait time was extraordinarily long, but I guess I forgot how long it takes for one person to make three different dishes. \n\nOverall, I think this is a decent place for a bite to eat. I would come here for the sandwich since it was pretty filling and good. The pasta seems pretty ordinary, but if you're looking for comfort food this will hit the spot just fine.", "author": "Hayne P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-01", "description": "Drunk on NYE, these guys came in solid. Nom nom pepperoni. My boyfriend won't touch me because he's in a food coma. WADDUP 2014", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-21", "description": "Worst service I've ever had. Messed up the order and rude.\n\nThis place is the worst. The only reason it's still in business is because it's the only pizza place in the area.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-11", "description": "Man. What a horrible business. Honestly, the pizza was average. The owner was a complete asshole. Threatened to call the cops on me because I was upset because he didn't offer any of his items.", "author": "Alexander J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-03", "description": "Pizza is ok but the attitude of the staff late at night is really strange. The cashier was really interested in long conversations with other customers I assume he knew and all but ignored us.", "author": "Chat N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-01", "description": "I had frozen pizza that tasted better than this.  I wanted to try a different pizzeria so I went on Eat24 and found this place.  I live in the North Beach so I'm surrounded with great pizza joints, Tony's, Golden boy, etc.     Everything about this pizza was wrong. I remember I had to make pizza In high school when we had to raise money for our band.  Instead of selling  candies we made and sold frozen pizzas.  We used premade frozen dough, prepackaged sauce, meats, and cheese.  It looked and tasted like that pizza we made in high school.\n\nI guess it's OK if you were inebriated and there were no other options.", "author": "jason g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "Italian until 3 am?! Wonderful! The vegetarian and Greco pizza slices were delicious, the vegetarian lasagna was worth every penny, the chocolate mousse pie was perfect, and they have sugar (not HFCS) bottled sodas from Mexico. I love this place! The service was very nice and the food came out pretty quickly. They also deliver!", "author": "Christy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-13", "description": "Late-night pizza after a night of clubbing will never be bad, but is it always worth it?\n\nAfter a night at Circa some friends and I decided it was the perfect time for a late night snack. We walked a few blocks over to this small pizza joint and there was already a line waiting for us. The combined ordering and waiting time was around 35 minutes. I got a slice of the pepperoni, sausage, and mushroom pizza. It was not cheap at $4 a slice. The good: the pizza was freshly baked. The Bad: my slice had no mushrooms. It was too late in the night for me to try and fix my order. Late-night pizza will usually hit the spot, but Marina's cost too much, took too long, and got my order wrong. I will probably go try another place after my next outing at Circa.", "author": "Augusto T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-01", "description": "3 stars for pretty darned good pizza (not the best, not the worst, better than decent). 1 SOLID STAR for staying open later - much later than their local, more famous competitors. Smart business practice: especially on Halloween eves that fall on a Sunday.\n\nThey saved our hungry stomachs last night!", "author": "Meredith R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "Decided to come here after reading several Yelp reviews. We ordered a pizza with sausage, pepperoni, mushrooms, and onions. The pizza was tasty. We also ordered spaghetti with marinara sauce and hot wings which were also good. I would come back again. Prices are reasonable. Seating area is small but comfortable and clean.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-13", "description": "Be-Warned that despite the fair prices and comments of fast delivery, their service has changed DRAMATICALLY in recent months, and even though I live 1 mile away, the delivery is consistently being set to nearly 2 hours... ridiculous.\n\nAlso, very thin pizza.", "author": "Lotan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "What a great place! The food is awesome and there is such friendly staff willing to help at a moments notice. 10/10 would eat here again.", "author": "Brady G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-02", "description": "The good:\nIf you are hungry, this place will be open.\nGreat veggie options - it's the plain cheese pizza with a bunch of toppings thrown on.\nReasonably priced.\n\nThe bad:\nAvoid at all costs on a Friday or Saturday night. Unless you enjoy the belligerent drunk marina scene. \n\nIn short - it gets the job done. You will not be disappointed. You will not be blown away. You will be satisfied. But you will Not be pampered.", "author": "Jacqueline S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "Best wings in SF, the pizza is really good too. Good pricing and good quality. I always come back. I recommend this to anyone looking for a new pizza place!", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "The crust of the pizza is deliciuous even the rest of it. Take care for the veggi's , and a friendly owner and fair prices", "author": "Evets S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-16", "description": "This joint is always there, open REALLY late and premakes the pizza slices as Cheese Pizza, then tops the slices with more fresh cheese and your other toppings and re-bakes it to a nice flavor, always the best place to get something fast after a SF Concert or Ballgame, everything else is closed, however, Marina is there late and ready to serve its late night guests!  I'm happy to be one of those as often as possible.\n\nIt wouldn't be achieving a perfect rating because the Bathroom in this old building is best put that its not up to par, it's old and not necessarily their fault, but it keeps us from perfection here, thankfully the food has been good every time for over 10 years+", "author": "Scott M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-10", "description": "This place truly is the definition of \"Meh. I've experienced better\". I found myself in a quandary last night, it was 11pm on a Tuesday and I wanted to order delivery. Of course, almost nowhere was still open that would deliver late-night on a Tuesday besides pizza. Marina Pizza & Caffe seemed the best of the 10 or so pizza places that would deliver to me. The order took about an hour to get to me. Because I ordered from eat24 it came with a free cesar salad, which was o.k.  \n\nAs for the pizza itself... Well, the crust was thin and had the flavor and consistency of cardboard. The sauce was spread very thin and was relatively flavorless, making it a real non-factor in the taste of the pizza. The cheese was rubbery and very greasy, falling off the pizza in large topping laden globs when I attempted to lift up a piece. The cheese sliding off revealed a bare and nearly sauceless slice. The pepperoni, salame, and mushroom toppings were o.k but nothing special. The pizza did not seem worth the price at all. Ended up paying around $28.00 including tax and tip for one poor quality large pizza and a few sodas. Considering I could have had Pizza Orgasmica or Giorgio's for around that price it seemed like quite a rip off. I would not recommend ordering from here unless you do not have any other choices.", "author": "Tomas K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-31", "description": "So I went with my girlfriend at 10pm on a Thursday. .. And the entire location smells like throw up. No, not bathroom smell... But actual throw up. Shoot me... Yesterday.", "author": "Blake F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-21", "description": "We picked up a medium pizza with onions, bbq chicken, cheese, and tomato sauce along with a Chef's salad and a one or two serving of tiramisu.\n\nFirst, the pizza was delicious. The entire establishment smelled like it does back home in those Italian delis - full of simmering tomato broths, spices, and that little thing that keeps your nose elevated and pointed toward the kitchen. The proprietor was busy getting orders at the counter but managed to notice us and give us a chance. \n\nThe chef's salad was great! Salty, full enough of cheese and meats, and a delicious balsamic vinaigrette that greatly added to the flavors. The tiramisu was frozen almost but really quite decadent and light; a perfect dessert to our starving stomachs.\n\nBecause this is not Dominos, no Papa Johns, no fast-food delivery pizza - prices are going to be a bit pricier and the cooking time is going to take a little longer. In general, this is how EVERY food related price works when they are not in it to make a quick buck. Take a bite, close your eyes, and enjoy every steaming second made with the energy and the heat of a person who cooks to cook.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-29", "description": "I ordered for myself and a few friends through Eat24. The whole order was awful. It was an after a long happy hour type of last minute decision and we wanted pizza. It was all awful - barely any toppings on the pizza and rubbery cheese. The wings were burnt - literally black skin on them. Raviolis were hard and undercooked and get this - the cheesecake was FROZEN. Ok so you used frozen cheese cake fine whatever, but UNTHAW IT before you deliver it. \n\nSo eat24 connects me with the restaurant and the woman is demanding I send the food back for a refund of any sorts. We actually went out for food elsewhere because this was so bad and then proceeded out on a Friday night - no I am not coming home on a Friday night to return the shit food we threw in the trash. The woman also admitted their cheesecake is frozen because \"it gets runny when we deliver it\" - um no that is NOT what happens to cheesecake. \n\nShe continued to talk over me and argue with me - like I had insulted her first born or something and says \"No, you people, you order my food and you eat my food and then you call for your money back so no, you return my food\"\n\nTerrible experience, never again, not even drunk at 3am anymore.", "author": "CC S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-11", "description": "Beware of the crazy owner here!!!  I walked in here to order pizza after 2am sober as a judge.  This guy starts yelling at all his customers in line like a complete asshole.  The way he was acting was just insane and not warranted at all... It felt like I was on another planet.  He must have been dealing with some belligerent drunk people that night, but it's no excuse.  \n\nAlthough it was funny and entertaining, it's unacceptable.  He even gave me attitude when asking me what I wanted.  I don't need to deal with that bs.  I shrugged it off and ordered anyway.  Watched some more events unfold and then the owner almost got beat up because he grabbed someones arms.  HAHA\n\nAnyway, I finally got the pizza and cracked the box open to eat.  It literally smelled like someone vomited in my pizza box.  Kinda lost my appetite, but I ate it anyway because I'm a fat pile of sh*t.  It was costco quality at best.  Weak.\n\nI'd rather take my chances with the bacon wrapped hot-dog lady and avoid this waste of space.", "author": "Brad K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-09", "description": "I really hope the bald guy that serves pizza dies. He is a total cockblock who likes to talk with cute girls for 30 mins instead of serving pizza. He is a burden on society", "author": "R T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-15", "description": "Their  pesto pizza is my favorite! (And open until 3am, that is awesome.) This place rocks.", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-09", "description": "The owner or manager. Idk. The bald headed middle eastern guy who is always there is a rude and miserable person. The pizza is passable. But considering that most of their business is from drunk people after the bars close, itll work.  Miserable people working there. If you go. Get your food to go. Or get a table away from the register.    Pizza isn't supposed to fold like a wet paper towel by the way.  People watching is redeeming", "author": "Joe G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-01", "description": "Crappy pizza... Stopped by there to get a slice after going out... what a crappy pizza. It tasted like it was sitting there for hours and then they threw some stuff on it when i ordered it, warmed it up and served it. Oh, and it took them about 15 minutes to prepare that slice, and i was the only person there!\n\nEat anything else anywhere but don't come here... even Costco pizza takes better after sitting in a fridge for days.", "author": "Serge U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-20", "description": "This restaurant just lost a customer. \n\nWe put in a pizza order online through Eat24.com, it was delivered on time, but was incorrect. We called Marina Pizza and they said \"No problem, we'll get the correct pizza out to you.\" Fast forward 2 hours later - no word from them! \n\nWe called them to see what the problem was, and a new guy, \"Jamel\" proceeded to be very rude, and tried to blame the situation on the driver! He made excuses, and had such poor customer service -he wouldn't even give me his name! We finally said, if you haven't made a new pizza for us by now, cancel the order. \n\nHe said they will give us a refund, but we knew better and called Eat24. They issued a refund right away, AND, they said that the restaurant cannot issue refunds anyway b/c it is done through Eat24! So that employee was lying as well. \n\nNever getting pizza from them AGAIN. Go somewhere else if you want a correct order!", "author": "S F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-04", "description": "The pizza literally tastes like toasted bread and cheese that you would find in a garbage can outside a bad pizza restaurant. So, if you're reading this DON'T GO THERE OR ORDER FROM THERE! When you read \"marina pizza\" read \"HOT GARBAGE.\"", "author": "g g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-07", "description": "I came here at 2am after Matrix Fillmore Lounge which was around the corner. It was the closest pizza place that was still open.\n\nThey sell pizza here by the slice for roughly $4. I believe there were about 7 choices and vegetarian options. The pizza is reallllly thin and average quality...\n\nI'm giving only 2 stars because my slice of pizza took about 15 minutes to cook. WHY ARE THEY SO SLOW?! If you're open late, you're obviously open for clubbers/drunks, so you should definitely speed up the process....\n\nThe bathroom is gross.", "author": "Kristina N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-07", "description": "If you like rats, come to this place. Rodents are prevalent and the main pizza chef is no exception.", "author": "Adam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-07", "description": "The food is sooo good here. Had the Caesarsalad, pesto pizza, and penne marinara with the best cheesy garlic bread I've ever had. I highly recommend for a quick stop in!!", "author": "Heather F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-25", "description": "Eh - it gets a star for free delivery and another star for being (relatively) cheap. I would pay the extra though for something better.", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "Came here after a night of drinking, late night, and had a GREAT slice of cheese pizza. The guy working there was also really friendly too.  Good neighborhood spot for some good slices :)", "author": "Alexandra W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-28", "description": "Organic minestrone soup= FOOD POISONING!!!!!!\nAfter doing the right thing and calling this place and letting them know that the minestrone soup that we had ordered gave my husband food poisoning the man on the phone gave me \"knowledge\" on food poisoning and was questioning my integrity of the call. \nDO THE RIGHT THING AND APPRECIATE THE PHONE CALL SO NONE OF YOUR FUTURE CUSTOMERS GET SICK! WEIRDO!", "author": "Honest Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-06", "description": "so I grub hub from this place probably 90% of the time i get delivery.I don't know what crack they are putting in the pasta but this shiz is real freakin tasty. The cheese tortellini with half alfredo half marina --BOMB.... spaghetti with meat sauce melts in your mouth.... mmmm just thinking about it makes me excited. \n\nBut wait...there's more. The sandwiches are freaking bomb.com too. I'm not kidding some of the best hot sandies ever and I'm not even high when i eat them. meatball, FAV. chicken marina...DOUBLE FAV... and of course italian sausage when mario's working \n\nPizza: It's pizza, wahts not to like? Grease, fat, and all the other shiz you wanna put on top. Pizza reviews are pointless....your obvii trying to compensate for something if you complain about crust thickness on here....just sayin. Its PIZZA...EAT IT. \n\nCalizones are amaze. again...its hard to fu*k up a calizone. Always hot when delivered. Just how i like it!\n\nThe best part---lots of beverage options! Like everyone living here in the marina, i get delivery primarily when im hungover as shiz. The delivery guys here never ask questions when i add 15 vitamin waters to my order.  Sometimes they even sneak one or two in free...\n\n\nSo, whats not to love?", "author": "natalie n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "Love this place! Best pizza in SF! I always stop for a slice of the Greco after a night out in the city!", "author": "Elise A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-20", "description": "Bad pizza, cold, no flavor, terrible toppings.  I don't yelp often and I don't yelp too much, but this was worth saying not to go to.  Employee's are rude too.  DM if you have any questions.  It's a rip off.", "author": "Shea T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-27", "description": "I've ordered lunch here via Grub Hub three or four times now, and I've been really happy with the food and the delivery service. My colleague and I order pasta rather than pizza, and I must say, it's really good. The servings are generous, the pasta tastes fresh, and it comes with a slice and a half of garlic yummy garlic bread. Not bad for a meal that costs just little more than $10 with tax and tip. Oh, and the delivery time and service has never disappointed. I'd definitely order from them again next time I have a hankering for some pasta.", "author": "Mary D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-11", "description": "Exactly what I want out of pizza. Melts gooey mozzarella, flavorful tomato sauce, yummy crust. Best plain cheese pie in the city.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-21", "description": "Watch out for what they charge you for.  Very stingy,  they will try to steer to you to the more expensive option and 'give you a deal'.  Okay food but the service and attitude kills it.", "author": "TJ T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-07", "description": "Pretty bad pizza at 2 am, it's sort of satisfying if extremely drunk, but I would not go there sober.", "author": "Ryan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-25", "description": "Absolutely wonderful.  The food is so fresh and delicious.  I picked up my order (eggplant parmesan and potato wedges) and the guy had me try everything before i took it home.  Fresh and thick potato wedges, really good smothered in parmesan:) and one of the tastiest eggplant parmesan sandwiches.  Awesome customer service and great food with a great price!!!", "author": "Caitlin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "Good tasting pizza and very fresh :)\nStaff was friendly, place really clean and had lots of toppings to choose from. Slices are made when ordered, not reheated like on many places.\n\n$4 per slice and did not have pesto sauce", "author": "Joel H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-02-08", "description": "Food sado-masochism.\r\nCrust is overly crispy - tastes like cardboard. I never say this.\r\nSalad is watery.\r\nFake cheese over the top saddens me.\r\nLike the meatballs and the price, so I return.\r\nBut, I always regret it.\r\nKind of like taco bell in that way, except sans the stomach ache.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-22", "description": "The pros to this place is that you can order online,  it is opened super late and they deliver. Basically, great conveniences after a night out.\n\nHowever, their pizza is very mediocre even if you're hammered and craving pizza. I probably would not be able to tell their pizza from DiGiornos out of a freezer.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-03", "description": "i really like this place. Whether we eat in your have it delivered, this is our got to pizza place. The only times I have eaten in the restaurant are usually right after going out. They are open pretty late so it was always nice to go in and grab a pizza and salad rather than go to a fast food place. The owner there is always super friendly and ready to serve. It's on the smaller side but the place is always clean.\nThe delivery is great. They have a deal where if you order a large pizza, you get a free garden or ceaser salad. Not super pricey and they have tons of options for topping. I usually like just cheese but the the thin sliced potatoes on the pizza is also awesome! I'm a vegetarian so I can't speak from experience but I hear the chicken wings are super yummy.\nbottom line: good pizza, good service, great delivery, good price", "author": "Whitney S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-21", "description": "Before heading to a Yelp event, D and I decided to grab a quick bite to eat, so we decided to stop by here.\n\nOrdered a small 12\" pizza for the two of us (meat lovers) and ended up coasting about 16 and 18 after tax and tip. Pizza overall was alright, nothing special, no wow factor, but not bad. It did however, fulfill my need for thin-crust pizza, so I was happy.\n\nService was definitely on the slower end, given this place was pretty much empty. (There was a married couple at another table, but that was it.) The guy at the cashier seemed preoccupied with the internet, and phone calls. Super slow.\n\n3 stars. It was alright. Not my favorite, but not horrible. Definitely not worth the trip across town.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-24", "description": "this is a review of an order placed for delivery\n\npizza margherita\nthis was actually a good pizza. the crust was thin but had enough structure to still have a bit of bite. the more subtle ingredients (tomato and basil) were placed under the cheese to protect them from the cooking process.\n\ngrilled chicken sandwich\ndescribed as:  \"Grilled chicken breast, fresh greens, tomatoes, red onions, mustard and mayonnaise\"\n\ni requested no onions. when the sandwich was delivered, it had only chicken and cheese on it. there were no other toppings and no mustard or mayo. needless to say, that made for a very bland sandwich. even the nice soft but crusty bun couldn't make up for it.\n\nas with other places, the pizza was better than other things. i may try them again and see if it turns out better. the pizza was worth second try.\n\nordered from them again - whatever you do, do not order the potato wedges.  they were overcooked and had an overwhelming flavor that i could not make out but it wasn't good.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-25", "description": "Solid pizza when you need it late night!", "author": "Jay H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-31", "description": "There is nothing wrong with ordering a pizza on the cheap and then deciding to pair it with a good bottle of wine!\n\nOn a near Spring day, when the sun is supposed to be shining and the delivery guy pretty much drops off the pie under a shower of rain, you gotta give these guys kudos for being quick. I'm not saying that Friday night, you will get the same service tho. This place has been our solid go-to delivery pizza for the last couple of years. However, not even in my Marina beer guzzling days, have I ever set foot in their restaurant.\n\nI like that I don't have to get out a wad of paper towels and soak up some big puddle of grease that other places like to add on top. This isn't exactly your gourmet variety pizza. But, their crust is on the thin side (not crispy), which means less dough and more slices for me to eat! Our favorite which goes well with a nice glass of your favorite red wine: half pepperoni, half zucchini slices and feta. It satisfies the meat eaters and somewhat makes you feel like you ate a healthy vegetable too. \n\nThe best part? Spend over $18 and they throw in a free garden salad big enough for 2 people. Then add your own dressing on top or save it for the next day since its yer basic salad, sans dressing. (It's free, remember?) Ok, and the best, best part? I can increase my level of do nothingness and not even move my lazy butt from the couch. Opening up a window on my laptop to eat24hours.com, I'm done in less than 2 minutes with pizza on its way.\n\nThis Fatty is happily full with a nice buzz and no pots and pans to clean. 3.5 star Yum.", "author": "Kira R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-26", "description": "I was going to order from Bruno's, but they were closing early and had to cancel my order. Of course I didn't get their voicemail until after midnight, so everywhere was closed by then.\n\nMaybe it was the fact that I was starving, but this place was delicious. The lasagne had just the right amount of sauce and the pesto ravioli was almost creamy. A little bit too much oil, but it was really good.\n\nMy only real complaint is that the portions were on the small side. Other than that it was good and I'm looking forward to my next order.", "author": "Russ R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-15", "description": "My favorite Chicken Wings in SF!  They deliver in Russian Hill and Marina district till 3am.  Wings are not drenched in spicy sauce.  They are seasoned with spices on the outside, and amazingly tender, juicy and soft on the inside. \n\nThey do a magic trick by baking each wing individually on a single layer. \n\nIn my quest to find awesome chicken wings, I probably gained 10 extra lbs.  Happy to be saving you all the extra calories...order away!!!", "author": "HY L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-24", "description": "If you like Alfredo, like I do, then you must try their Alfredo pizza! I've been ordering for at least a year now by delivery and it taste delicious every time! The taramisu isn't bad either... Yumm. Great staff too.", "author": "Ashley L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-22", "description": "I'm a fan. It's not the best pizza I've ever had but they stay open late all week long and I can get my favorite pizza, pineapple, by the slice.  The slices here come out fast, fresh and hot, unlike the other pizzas joints in the area, where the pizzas are displayed cold and then put into the oven upon order.  The slices are a good size and the crust is on the thinner, crispy side.  Prices are reasonable.\n\nMarina pizza is my favorite spot to grab a late night slice of pizza.", "author": "danielle l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-07", "description": "I'm torn. On the one hand, they patiently took my phone order, over the bitchscreams and sounds of tomfoolery emanating from my apartment, and didn't screw it up. Then they fearlessly delivered it in under 25 minutes for less than the cost of the bottle of diet pills I'll be downing today. Two medium, two topping pizzas were around $25 with tax. That's cheap. Like me.\n\nUnfortunately, the pizza wasn't great. Since this didn't stop 4 girls and 2 boys from devouring it in under 20 minutes, I feel bad deducting stars. The sauce was on the tinny side and they're a little stingy with cheese. This is actually a good thing if you're on a diet. The crust is very thin. So if you are what you eat, I should look like Linda Evangalista circa 1995 right now. Sadly, \"you are what you eat\" is an old wives' tale. I wish someone had told me that sooner. \n\nBottom line: it's decent drunk food that won't leave you wishing you'd hurled when you wake up. And the people running the place seem really nice. And it'll get to your door before you have a chance to forget you ordered food and pass out in a drunk stupor (what, Starla?!?). I think they're on to something.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-21", "description": "3.5 Stars\nFood - 3 Stars\nService - 4 Stars\n\nOne of the things I slightly miss about working in the city is ordering lunch or dinner from this place. Super cheap and pretty delicious.\nThe Chef Salad and Greek Salad were always popular orders for me and a few others within the office. The Margherita and Lombard pizzas were always pretty popular as well. Every once in a while someone would order chicken wings from here and they always looked and smelled delicious! I still regret not trying them, but have you ever tried to eat hot wings for lunch in the middle of the work day while trying to still get work done? It's just not going to be pretty. \nAnyway, decent food for the price, and bonus - Free Delivery!\n\nFriendly to deal with over the phone, and prompt, polite, and professional delivery service.\nGreat for if you're ordering for the whole office.", "author": "Claire L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-07", "description": "Marina Pizza is located across the street from the motel I was staying at. It was late at night, I was tired and hungry after a long day of sightseeing and a lot of walking. Hubby decided to pop across the street and grab a large cheese pizza for our late night dinner. I mean you can't go wrong with a cheese pizza, right? Well, if we had to do it over again we would have ordered the Xtra-large pizza and grabbed a few wings to go with. \nI love thin crust pizza and this one hit the spot. It was good. I wanted more. Maybe a little more sauce and it would have been even better. It was also cheap. Would I eat here again? Absolutely.", "author": "jeanette d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-25", "description": "Unlike other people, I thought the pizza was ok, not good by any means, but I've had worse.  So, why the one star? They will rip you off.\n\nWe've all heard the stories about checking your receipts when you pay with credit card to make sure they actually punched in the amount you owed.  Well, those stories come from places like this.  Let me tell you a tale...\n\nMy friend was in line ahead of me.  He ordered a slice of pepperoni.  I heard the man say it cost $3.50, which sounded expensive.  I checked the board and saw that it was $3, before tax.  Fifty cents tax on $3 sounded high to me, but I thought I may have misheard.  I paid attention when I ordered a slice of cheese, which the board said was $2.50.  I paid and he rang me up for $3.  When I asked him how he got from $2.50 to $3, which would have been a 20% sales tax, his excuse was that \"they have higher prices at night but that they haven't repainted the board to reflect that yet\".  Logic prevaled within seconds and he paid me back the 25 cents he had overcharged me.\n\nDo I care about losing a quarter here and there? No.  Do I care when a business systematically rips off its customers? Yes.  He did it to me, right after he did it to my friend, just as I am sure he did it to every single customer that came before me that night, and probably the ones after me.  If they care so little for their customers, I hate to think of how little they care for the quality of their food.  I will not be revisiting and I would encourage everyone else to stay away.", "author": "Ethan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-13", "description": "Went dancing and drinking on nearby Fillmore St but decided before we left to sober up and fill our tummies with some food. My group and I ordered a large pepperoni pizza to go with a couple of sprites. It was crazy packed after the bar scene let out so there wasn't anymore tables for us to sit at. The service was prompt or rather rushed and the pizza was fresh (took forever to get it). Pepperonis had a weird herby after taste but overall the pizza fit the bill for a late night out.", "author": "Trishia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "I am shocked by the negative reviews on here... Usually don't get service like this place in MA at a pizza place!\nMy boyfriend and myself got pizza here twice when we were staying just down the street. The first night we ate there-the woman behind the counter was extremely nice. We ordered pizza and their fresh cut fries, the man who I believe the owner came over before hand and gave us plates, napkins, and utensils, he was also extremely nice. He also came back while we were eating to check on everything and was very pleased that we loved it. The pizza was so good and the fries were delicious- so delicious we went back another day for lunch! That time we just called ahead and took it home. The younger guy working was very busy but very polite as well. He made sure we had everything we needed to take it back to the hotel to eat. \nHonestly, I wish this place was in MA! Delicious and very polite staff.", "author": "Rachel A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-03", "description": "Glad they're open late.  The pizza is good, not great.  Probably wouldn't go there any time other than late-night.  It's kinda overpriced too.", "author": "David P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-13", "description": "I stopped by this place on a late night walk through the Marina. I had been eating pizza non-stop for quite a while so I opted for the veggie lasagna. Service was quick and kind.\n\nFirst arrived the garlic bread- meh, way too much garlic.\nThen came my lasagna- this was decent, although I feel like I could have managed the same from a Stoffer's box getting thrown into my oven at home.\n\nOverall I was full and happy when I left, but there are definitely better Italian joints just up the street in North Beach. As for their pizza, I can't speak on it personally but my friend insists if your in this 2 block radius...go for Patxi's.\n\nThey do stay open late, which is worth some extra points!", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-31", "description": "I have been a loyal patron of Marina Pizza since moving to the Marina. While there pizza is alright at best, their service is HORRIBLE. \n\nI walked in a few days ago for some late night pizza. A man standing in line said an extremely rude comment to my friend and I. The owner of Marina Pizza asked what the scuffle was about and my friend and I told him what the man had said to us. The man in line then admitted to calling us the derogatory word. Instead of saying something to the man or asking him to leave, he forced us out of the restaurant. The fact that a business owner would side with a drunk man saying extremely offensive things inside his place of business versus two loyal patrons is inexcusable. I will NEVER go back to this pizza place again.", "author": "Alexis L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-04", "description": "After a night of getting sauced.. stop here for a snippet of thin crusted, piping hot, just the right amount of cheese/sauce to get you standing up straight again.", "author": "Sara F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-26", "description": "Great pizza & wings were the bomb! So glad we found this place on yelp. Friendly, fast service too. Highly Recommend!", "author": "Lisa G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-22", "description": "After having long drive and a day of sightseeing my husband and I didn't fee like going out to dinner and the guy at the front desk suggested Marina Pizza. We ordered over  the phone got some pasta a pepperoni pizza garlic cheese bread and salad. Honestly it was decent nothing stands out nothing to complain about. I think that it would be a two star if it wasn't for the fact that they have a wide delivery range and are open til after 2 am so I'm giving it three stars.", "author": "Darin Christi F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-04", "description": "My bf and I ordered delivery-- it took over an hour, and it was not worth the wait.\n\nWe had ordered two salads and a half and half pizza.  One of the salads was the wrong salad and we had ordered ranch dressing but  got a tubs of SOLIDIFIED... something.  It might have been ranch dip, but after trying to scoop it onto the salad, I just gave up all together seeing as how the salad was gross anyway.  \n\nSo I moved on to the pizza, both of our toppings were burnt-- literally, half black.  Certainly they must have looked at the pizza before sending it out, so.... ew.  Way to go with quality control.  And for the record, the pizza tasted... old to say the least.", "author": "Jen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-21", "description": "The good: Open late, pizza by-the-slice, Greco is great, big slices, seating if you want to eat there instead of on the walk back home (or to the hotel).\n\nThe bad: $3.50 for one slice is a bit much for what you're getting. The meat slice isn't anything special.\n\nVerdict: Considering there aren't really many other options within walking distance late at night, this is a great spot to grab some great, hot post-bar food. After buying drinks all night, dropping an extra $7.50 for a couple of big slices for you and that girl you're going home with is a small price to pay.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-24", "description": "An exerpt from my 37 glasses of champagne deep taxi ride home:\n\nMe:               I want pizza orgasm!\nFriend:         Huh\nMe:               Pizza orgasm!  I'm starving!!!!\nFriend:          mmmmmmmmmmm\nTaxi Driver:   On Fillmore?\nMe:                 yesssssssssssssssss\nFriend:          Is it open? It's almost 2 a.m. on a Tuesday\nMe:               of course its open!\nFriend:         I thought you hated pizza orgasmica\nMe:               i do!  I hate it!  But i want it!!!!!!!!!\nFriend:        ok\nMe:               I'm going to text that boy\nFriend:        Don't do it, you'll lose the power\nTEXT:          GOING TO PIZZA ORGASM, I'M GOING TO ORGASM ON YOUR FACE\nMe:               (showing friend text)\nFriend:         (hysterical laughter)\n\nShortly thereafter we arrived at Pizza Orgasmica to find that it was closed.  We then proceeded towards Mel's Diner on sketchy sketchy lombard street to find Marina Pizza, which is open until 3 a.m. EVERY NIGHT.\n\nI don't care what you're serving me, if you're open at 3 a.m. every night in San Francisco, you get 5 stars.  But you're on Lombard.  4 stars.\n\n3 Hours later\n\nText from Boy:       No pizza delivery\nMe:                          How about that orgasm?", "author": "JERK STORE .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-29", "description": "In my (very) drunken state Friday night at Jade I was calling this the best pizza EVER!  In reality, it wasn't great but did the trick, soaking up the booze so I could continue the drinking at the longest happy hour ever.\n\nSpecial thanks to smoking hot Jay H for ordering.", "author": "phil h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-28", "description": "The first thing I became aware of this morning was that my eyeballs hurt. The second was that I had a blister on the roof of my mouth, just behind my incisors. I quickly deduced that I had consumed tequila and pizza last night, and definitely in that order. \n\nI lay there staring at the ceiling, piecing the previous night back together. It took me some time, but I realized that getting my slices at the Marina Pizza & Whatnot  was probably the high point of my evening. In fact I became reasonably certain it was the only building I went inside all night that wasn't packed to the rafters with insufferable douche-monkeys. +1 star for that.\n\nThe pizza? Meh. At that point I would've gnawed on a slice of still-frozen DiGiorno I found lying in the gutter, so I was reasonably grateful for the food, but I don't remember swooning after my first bite. In fact, not that I think about it, I think I cursed loudly about acquiring that blister. If I'm ever 'housed and in the neighborhood again I may go back. But seeing as one Friday out in the Marina was enough for a lifetime, I don't really expect to find myself here again.", "author": "Jonathan A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-14", "description": "My pizza was a half hour late and it was the wrong order. I called when it was 20 mins past the delivery time it was supposed to come and the guy said \"theres probably traffic it usually takes 45 mins\" I told him that I had ordered the pizza 1 hr 10 mins ago. The guy was very rude, and kept trying to get me off the phone. I have tried to call 3 times to talk to them about a resolution, and I now just keep getting the voicemail. If you are looking for rude telephone service, the wrong pizza, and for it to come 1 hour 40 mins after you order it then this is the place for you. I cannot imagine what kind of service they would give late night. Thankfully there are many pizza places open till late, Galaxcy Pizza, Piccolo Pizza to name a couple. Never will I order from this place again. I had an appointment that I was almost late to because of them being so late. Not worth it.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-28", "description": "This food completely appeases my (drunken) hunger at 2:30 in the morning. In fact I give it rave reviews.\n\nThe pizza, however, does not always sit well with my (sober) tummy the next day at 2:30 in the afternoon when I decide to eat a left over slice. \n\nBut, bless them for being open late and having someone who can speak drunken-ese answer the phone for deliveries.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-26", "description": "Okay - it's obvious they cater to the drunk crowds, but still..\r\n\r\nFor the love of humanity - make it good because you have the opportunity to do so!! :(", "author": "Yelper A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-02", "description": "My first experience with Marina Pizza was when I was 1.) in a hurry, 2.) on lombard, and 3.) hungry. Normally this is a 7-10 split but this unassuming pizza parlor was right there. \n\nI walk in and order a plain cheese slice, and almost immediately the people in the back begin to argue in a semetic or perhaps turkic language that I couldn't identify; all I knew at the time was that I had stirred some family drama up inadvertently and I was going to feel guilty about it for the rest of the day. I did get a satisfactory slice of pizza for under two bucks though.\n\nNow last Saturday I watched as Ed to the M struggled valiantly to place a phone order with these guys. The first person to answer didn't speak English, and the second didn't know how to use the point of sale terminal. But he soldiered on and third time being a charm he was able to order two pizzas which turned out to be pretty good. Especially the one with feta on it.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-03-25", "description": "I have never eaten in this establishment...have only had deliveries.  Many.  And everytime I think to myself  \"Why on Earth did I order from them AGAIN?\"  Then I remember the 30-some odd flyers wallpapering my front entrance and spilling into the foyer. \r\n\r\nThe cheese pizza is crap.  The olive and red onion is decent. (but that's just b/c olives and red onions are good.) Lasagna is good if you dig garlic.  The fries: delicious. (Available through the Downtown location only.) They deliver late and bring you the right order fairly quickly, after they have screwed it up the first time. \r\n\r\nHopefully sans bodily fluids.  But that's all part of the risks involved in the \"demanding-what-you-ordered\" game.\r\n\r\nOh also...it's not kind on my digestive track, if you know what I mean.\r\n\r\nUPDATE: 06/09/06 -  Ate at the California Street Restaurant.  The fries were horrible...how do you mess up fries?!  Well they did.  The dinner ended with my roommate and I grumbling out of the front door and me exclaiming, \"Let's never go there again!\"\r\n\r\nThey get one star because I have to award them something.  [Flawed scoring system, if you ask me.]", "author": "Beth G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-19", "description": "I am such a sloth...or is it glutton? We can talk about the other deadly sins later...lets focus on these two for now.\n\nI always tend to give delivery places more stars than the food merits, just because they will bring it to me. It is sad, I know, but I feel a compelling need to factor in the fact that I get to sit on my couch, or my friends couch (as in this case), and sloth around while someone else runs my food errand for me. \n\nI LOVE DELIVERY!!! There, I said it.\n\nThis place is not fooling anyone by changing their name from Pizza Pino to Marina Pizza and Cafe. Some of the menu items are a bit different, some of the items have gone up in price but the menu is nearly identical and the phone number is the same! Do these people think that because we are sloths that we are also morons???? Apparently.\n\nThis does not detract from the fact that they bring food to me, and that it is okay. Advice - dont order the pizza! Stick to the sandwiches or pasta and you will be gluttonously full when you are done. The food is definitely not out of this world, but you will still be happy because you merely had to travel from couch to front door to get your grub on!", "author": "Drue C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-25", "description": "It's one of two pizza by the slice places within a block of the California & Polk intersection.  Neither of them are great, but this is definitely he worse of the two.\n\nBut really, the pizza tasted fine and it hit the spot, it's just doesn't have any character to it.  It's on par with a DiGiornio pizza from the supermarket.\n\nGo down to Victor's instead, their staff might not be as friendly, but the pizza is much better.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-29", "description": "Dude...this place delivered to Jade Bar when a select few yelpers and I were stupid drunk.  By stupid I mean charmingly witty,sassy and composed.  \n\nI don't know how long it took cuz I forgot five minutes after I called them that I had ordered pizza.  \n\nIt arrived hot and right up to the bar door.  It was soon thereafter inhaled by our crew.   I don't think we even tasted it we were THAT starving.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-22", "description": "Maybe it was because I got delivery on a rainy day. Not quite sure. 2 stars giving them the benefit of the doubt. \nThe pizza was cold when it finally got to my house. And the box was wet when it arrived almost 2 hours after I ordered. \n\nThe pizza was tasteless and was an overall disappointment. Save your money.", "author": "Holly O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-02", "description": "Had a pretty good experience with this place last night and they definitely had the speediest delivery times I've experienced in the city. Compared to Pizza Orgasmica (which didn't show up the last time I ordered from there), Marina Pizza was very prompt and got my order exactly right.\n\nThe pizza itself was \"good\" for delivery pizza, I've definitely had better but when I'm in an emergency situation and need pizza delivered I'll be calling them again.", "author": "Bryan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-22", "description": "Meh. I've had a lot better, but whatever. I'm not really complaining about food. You could provide me with a plate of cat poop, that I would have to turn down. Yep, as for this establishment, you need to be aware that they have Mexican Coke by the classic glass bottle!", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-17", "description": "I am a fan of this place, especially after a night out in the Marina.\n\nFresh pizza straight out of the oven?  Bomb.", "author": "Jules G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-09", "description": "1 Start for their delivery service.\n\nOrdered  online for lunch. An hour later they called and said they were sorry for the delay, it would be here in 10 minutes with a $5 discount. Great I thought!\n\nAnother hour later the driver is calling me saying is across town and is lost. He was yelling at me like it was my fault!\n\n2.5 hours after order time the guy calls me and tells me to come outside. So I do. Without getting out of the car he hands me a cold pizza in a soggy box and a hot snapple. Then he asks for the money- without the $5 discount!!", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-05", "description": "NARRATIVE\nAfter having a wine at Mas Sake on Dec. 28 I needed to get my head out of the clouds and get some carbs in my body before it was safe to drive to the East Bay. My friend Kimani (fine @$$ d.j.) and the staff directed me to Marina Pizza...and my New Yorker taste buds sang and danced.\n\n\nCONTACT INFORMATION\n2139 Lombard St\nSan Francisco, CA 94123\nph (415) 931-3333\n\n\nPRICE RANGE\nInexpensive - Moderate\n\nSUMMARY\nIn the showcase were thin slices of dough with sauce and cheese that looked l like the slices of my youth. I told the gentleman behind the counter who was sporting a soul patch and a cool hat that it reminded me of New York pizza...and he said he had moved here from Brooklyn.\n\nInstant connection...oh and two slices, please.\n\nWithin 10 minutes I was feasting on freshly warmed slices. Foldable slices that made for excellent eating as I craned my neck up to see the days reviews on ESPN.\n\nSERVICE\nAwesome. Quick and friendly, especially since I was asking for service at 12:30 in the morning. AND he was a fellow New Yorker!\n\nRESTROOMS\nI did not use the rest room. I just wanted carbs. Yummy Carbs.\n\nSUGGESTION\nThe place was a little drafty, so perhaps a better door or some interior heat.", "author": "Eriqua P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-24", "description": "Update: I did throw the pizza in the oven the next day to see if I could cook the crust.  Still bad.  I ended up eating just the toppings only off of two slices, then the last two slices went in the garbage.  \n\nWill not order pizza from here again.  Will give other stuff a shot when time comes.\n\n***\nThe pizza was not delicious because like another Yelper said, the crust is soggy.  It was soggy and didn't taste like it was cooked thoroughly, dough-y like.  \n\nI got a flyer from here so thought would try it as opposed to my usual Nizario's.  \n\nThey have a special now for $14 you get a large two topping pie and a 2-litre pop.  With tax and delivery it was $20, so I really didn't save any money.\n\nI would not buy pizza from here again, as I agree the crust tastes uncooked.  I might try other items, but not in any rush.  I will try to throw the leftover slices in the oven to see if it really is a matter of undercooked crust.\n\n2 stars for food.  However, the phone manner was nice, and delivered in less than the 40 minutes they said.  Too bad no half stars.", "author": "Mrs F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-31", "description": "How can people hate this pizza so much?  Is it the grease?  Does that freak people out?  Come on ... that's where all the flavor is!!\n\nIf you're a fan of east coast pizza, you'll be very happy with Marina Pizza.  I feel like I'm back in college again ... :P", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-15", "description": "Ordered delivery twice. Prices are basically the same as Pronto's.  Marina sorta has better pizza.  The crust is fluffier. But I have a sneaking suspicion they are one in the same because everything from Marina tasted oddly familiar.  Although the menu was different and they offerred more combo choices, the pizza (except the fluffy crust), the shady amount of toppings they give, and the wings had me thinking we caught Pronto on a really good day. \n\nIts 4 stars for now, but let's see if they keep it up.", "author": "Dorothy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-13", "description": "Good for a quick and inexpensive bite. My wife enjoyed the marinara sauce. Italian sausage sandwich was quite good also.", "author": "M H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-26", "description": "This place delivers until 3 in the morning! I wouldn't order anything on their menu, except for pizza. I've gotten good pizza from them on a couple occasions. I've tried to order from them for lunch and gotten some pretty bad sandwiches, but my 2 late night pizzas were pretty tasty. \n\nSo if you're in the mood for some late night pizza goodness, give them a call but in the middle of the day call someone else.", "author": "Troy R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-21", "description": "Pizza - Zero Stars\nDelivery Service - Three Stars\n\nOrdered from here on the recommendation of the Hyatt concierge.  HUGE mistake.   We have never had such tasteless, rubbery-cheese, charred crumbly pepperoni.   The cheese pizza was cardboard with non-descript sauce topped with the awful rubbery cheese that came off in one peeled layer with the first bite.  A total disappointment.", "author": "Dorothy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-15", "description": "Oh Marina pizza...You've won again. Why must you be strategically placed on the walk to my friend's house at 2am? I try to resist you with all my might but you are a black hole for my indulgences. Why is your pesto pizza with chicken so alluring? You're like riding a moped: Lot's of fun as long as no one knows you're doing it.\n\nOne day I'll have the strength to avoid my walk of shame with you in hand...One day...", "author": "D R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-02", "description": "Not much to say, just a decent food spot when everything else is closed in the Marina. I have a terrible habit of occasional 1am food binges (which should make for some great Elvis style before and after shots once that metabolism gives up on me) , so chicken wings reallyyy hit the spot after a late night out and were delicious (although that may be the opinion of a particularly grumbling stomach)...pizza, however, was just OK...", "author": "Mahsa K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-31", "description": "Haiku review:\n\nThey sent me coupons\nI was enticed by pricing\npizza was awful", "author": "Eric X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-22", "description": "Not the best slice, but it is close to the homeshed so I go there now and again. The cheese slices are good when fresh, but not recommended reheated.  \r\n\r\nThis one time after bandcamp, I went there and got a slice, it was reheated and came with an extra \"new\" layer of melted mozzarella to hide its rubbery underside and the edges were charred. I wasn't happy.", "author": "I. O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-11", "description": "I would give this no stars if I could.  Granted, I have not had their pizza, but based on my experience today I would not eat there on principle alone.  I get home and see a menu with some yummy-looking pizza.  I live in the Outer Richmond near Sutro Heights Park.  I check the back of the menu which has a map of the delivery area - yay!  I'm in the designated zone.  I call to order a pizza, tummy rumbling.  The gentleman who took the call automatically said, \"that's way too far\".  I explained that I was calling because I had received the menu on my door today, and that the map said my area was included.  He asked the driver and called back to tell me that it was indeed too far.  Well, then why the hell did you leave a menu on my door?!  Please revise your delivery map and stop distributing junk mail if you won't honor your advertisements.", "author": "Jennifer J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-27", "description": "This food is utter crap.  You better be drunk as hell when you eat this...and if you are...just go wait in line at Pizza Orgasmica...the line there isn't worth it, but this isn't worth eating.\n\nSeriously, if you quit dragging your drunk ass here to eat this crap you won't have to run so far the next day and one day someone will open a 'good' pizza place instead...or another f@#%@g korean wine bar :o(\n\nQuit eating here!  Also quit giving this place 3 stars because you feel guilty.  You KNOW this food is craaaaaaaaaaaaaaap!", "author": "Shawn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-07", "description": "I like this pizza place. I dont know how others seem to dislike it. Maybe they were going there at the wrong time. I usually order their chicken pesto, meat lovers, four cheese, philly steak sandwich and their strawberry cheesecake (or any other dessert - is also good). My fave is mushroom pizza with cheese. Really taste good. You should also try their Greek/mediterranean salad. Parking is off street, and the price is affordable. \nI would recommend people to eat here.", "author": "Rokayah S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-13", "description": "Time and time again I am pretty pleased with the pizza from here. Marina Pizza definitely needs to do something about their garlic cheesy bread though. There is DEFINITELY better garlic bread out there.\n\nFor someone who has never been a fan of thin crust pizza, this is the only restaurant I'll order it from. The pizza is pretty darn good and is a place I can confidently order from knowing I won't be disappointed.\n\nBut people please, fix your garlic bread! Minus one star for the bread.\n\nGive it a try..", "author": "Alissa K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-04", "description": "Nice place.  The pesto and garlic slice was certainly very tasty.  The pizza is doughy and not thin.", "author": "Jeff J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-31", "description": "The cashier might not be the sharpest tool in the shed, but good lord can this place make a slice.  \n\nGiven, it may not include the gourmet toppings of Orgasmica, the amenities of Unos, nor the niceties of Pizza my Heart, but they sure make the pies fresh and hot.\n\nIt is fair to say that most times I have eaten here may have been in a drunken stupor where salted cardboard may have suppressed the appetite, but I have ordered from them on sober nights and they are just as good.\n\nI'd recommend the pesto slice, the combo slice, and my personal favorite, the hawaiian with large chunks of pineapple, ham, and rich tangy tomato sauce - the way a hawaiian should be made.\n\nsave the high class stuff for the ritz.", "author": "Isaac L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-13", "description": "SF Food Inspection Score: 88\n\nreally not a fan of the pizza though i shouldn't base a review on one slice. but there was barely any cheese, the bread was doughy, and i did not like the veggie assortment. \n\nthough i didn't get completely turned off because the guy working there was so nice and fabulous. \n\ni'll come back for one more go.", "author": "Kristina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-24", "description": "terrible pizza, tastes like cardboard and came 1.5 hours after they said it would.", "author": "Peter G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-14", "description": "We frequently (once or twice a week)  order from this restaurant, but tonight will make me reconsider ever ordering there again.\nI ordered a veggie sandwich with no cheese, butter or mayo (vegan, so can't eat it). The sandwich arrived at my house with cheese and mayo. , When I called to rectify and hopefully get a replacement  (this was supposed to be sinner),, the man on the other end argued with me, and tried to tell me what I ordered. I have a receipt that shows EXACTLY what I ordered. He was rude, and apparently isn't going to replace my dinner. Deeply disappointed.", "author": "crystal e."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-03", "description": "THEIR PIZZA?-- not bad after a drunken night.  MARINA CROWD?--- BOOOO!!!  All you see are striped shirt, good looking guys who act like idiots when they're drunk.  You guys wanna know something?! Dressing well DOES NOT make you a gentleman!  You have to act like one too.  So if there are women waiting for their pizzas, maybe you should just sit there quietly and wait for your pizzas as well instead of throwing parmesan cheese at everyone.  IDIOTS!  And how old are you?  And what did your momma teach you?  Sad....you look so hot, but your lack of manners make you such idiots.\n\nSorry...there's other pizza places in the city with nicer drunk people...with manners too!!", "author": "Abby E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-28", "description": "I ordered a Hawaiian slice on the go the other week and was pleasantly surprised at the quality of pizza here. I'd definitely classify it as thin crust although for those of you that like a thicker crust, it's not as thin as some of the real NY style pizza's.  The crust was crispy and ingredients tasted fresh. My only complaint would be that there was a tad too much cheese on it. I'm seeing some delivery in my near future.", "author": "Julia N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-16", "description": "blah. I am not hard to impress in the pizza category, but this place didnt do it for me. The delivery was very quick, specially for a saturday night so thats a good thing. They have good deals too, we got something like a xlarge, a bunch of wings, and cola for under $20. The pizza, totaly blah. The crust is extra extra thin and not very flavorful. The garlic bread was dry and boring. The wings were ok. Wont be ordering from them again.", "author": "Audrey V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-09", "description": "I'm giving Marina Pizza three stars for now, as my pizza from here was OK but definitely not great.  I should really go ahead and ding the star for spelling Cafe Caffe, and I might just do that if I show up here and find out that it's really not a cafe at all--which I'm 99.77 percent sure it isn't--but do I really want to go to the Marina to do Yelp research?", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-27", "description": "fell in love with their sandwiches. and they are a good size and good price. The staff is very friendly.", "author": "Courtney H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-07", "description": "Yuck.  Eww.  Yuck yuck.  The cheese on the flavorless and meager sauce was that kind that ends up being impossible to chew so you have to swallow a huge bite that you can feel balling-up in your stomach.  Worst pizza I've had in San Fran.", "author": "Stephanie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-18", "description": "They are horrible. They don't even deserve any stars at all. Right now \nI have a bag next to me because I have been throwing up ever since I ate their ravioli and lasagna. They fricking gave me food poisoning. And not just me, my boyfriend, and his mom. \n\nUghh.. I'm so tired.. it's 1:05 AM , and I can't sleep because my stomach hurts like crazy, because of the stupid poison food they delivered. I'm hecka pissed off..... \n\nTHIS RESTAURANT IS DEFINITELY NOOT RECOMMENDED AT ALL EVER!!", "author": "Silver T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-11-06", "description": "Meager toppings on a crust so thin that a burnt bottom is inevitable. That it's open late is insufficient reason to give it more stars.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-22", "description": "Decent cheap Italian-American food.  Nothing special but you get your money's worth.", "author": "Mahogany G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-17", "description": "this is where drunk people go when the line at pizza orgasmica is too long.\n\nthe cheese is a bit rubbery, the toppings a little sparse. . . but just like chewing spearmint gum whilst drinking jameson. . . i kinda like it.", "author": "Huey K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-29", "description": "So Marina Pizza may not be my favorite pizza, but it's damn good at 1:00 in the morning!  After a night of hitting up most of the bars in my hood, marina pizza always hits the spot. Don't let the long line scare you. The line moves fast and you will feel so much better in the morning if you go to bed with a full stomach!", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-31", "description": "The chicken wings are really good. Juicy, meaty and hot (but not spicy).  Pizza is no good.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-26", "description": "i ordered pizza at 3:00 AM on a wed and it was there in 15 min.\nthese guys are miracle workers", "author": "Scott K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-05-28", "description": "One of the worst I've had to date.  Still bad even if you've had a couple of drinks.  Do yourself a favor and \"walk on by\"", "author": "Tom C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-28", "description": "Good mom and pop place on Lombard St. I had a slice of Hawiiaan pizza, and it was overflowing with pineapple and ham (YUM!). They have a pretty good selection of pastas, lasagnas and different pizzas. The full pizzas weren't as cheap as I hoped, but still relatively reasonable.", "author": "Chynna Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-30", "description": "Ordered from them again. Again, the ravioli was bomb and the chicken wings were soooooooooooooooooooooooooooooooooooooooooooooo good.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-15", "description": "My purse was stolen off the back of my chair here and the staff didnt care. I hate this place!!!", "author": "Dee C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-04", "description": "Decent pizza considering we ordered it at like midnight on a Thursday night.  We ordered the Hawaiian pizza (med) with Caesar salad and sodas.  The pizza looked decent.  Skimpy with the cheese and the cheese was rubbery and slid off when you took a bite or pulled apart the pieces.  The pizza was a bit SOGGY in the middle and very limp.   No texture to the crust.  The meat & pineapple toppings were generous and the pizza delivery time was super fast.  The salad was fresh and good though.  I really think this place needs to par bake the pizza dough before adding the toppings to give the pizza crust more stability and less leakage.  I am a baker so take it from me.  Anyways if its late and your hungry I guess give it a chance otherwise if its early in the night I would move on and try someplace else.", "author": "angella c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-16", "description": "one day on my way from one job to my other job I was looking for some quick lunch and hoping to find a good slice of pizza.  This place looked pretty quick, convenient, and not too bad.  I went in and they had a lunch special...2 slices of pizza and a soda for I think $6 (can't remember for sure this was a few months ago) so I ordered it.  It was ready in about 10 minutes so I was pleased with that and the employees had pretty good service however the pizza....did not taste that great.  It wasnt absolutely horrible but I probably wouldn't come back here.", "author": "Shea M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-20", "description": "This place is amazing!  It was so good and was not expensive. Their thin crust is freakin' amazing.  I love their cheese and they have every topping you could want.  Seriously.  I felt at home.  The owner took our order and made sure we were taken care of.  I will look for this place again.", "author": "Rick G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-26", "description": "Great slices! Super friendly staff. LIke $5 for a couple of slices and a coke for lunch. Stark contrast to other Marina eats despite the name. Was a random pigeon cruising around inside... so only 3 stars for letting a pigeon in... :)", "author": "Robert A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-02", "description": "Not the best pizza in town, but the best for large orders.  You can feed 10 people for 6 bucks a pop, including delivery.  I also like their large salad.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-06-17", "description": "I recently ate here after going to the Lumiere because my friend said she really liked the pizza. Well, I was very disappointed. The friend I went with got a slice with a little undercooked mozzarella on top -maybe a redone old slice, perhaps? Mine was just normal, thin crust, barely any cheese, very small slice. Crisp, but in that old piece of toast way. The salad was awful too. When you get a Greek salad and they say \"what kind of dressing would you like?\" you know you're in trouble.", "author": "Liss C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-25", "description": "So you went out boozin in the marina on a weeknight and now you need to get your late night pizza fill.  The only problem is that it is after midnight and since it isn't thu-sat pizza o is closed....  Pizza Pino is your place.  It is no substitute, but in a pinch they have a satisfying slice.  The staff there is used to putting up with the drunks (they are less than a block from about 5 bars) so fear not, you will not go hungry.", "author": "Robert R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-31", "description": "What's a girl to do when she's jonesing post-drinking grub after last call in the Marina and doesn't want to cab it all the way to Grubstake? Mel's on Lombard, my friends, closes before 2 am on weeknights. But lovely Pizza Pino just a few doors down from Mel's is open past 2 am and serves pizza by the slice.", "author": "shoba d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-11", "description": "Rubbery cheese, tasteless crust, even more tasteless toppings (what was supposed to be pepperoni and tomato), and somehow it ended up being one of the most salty pieces of food I've ever tried to eat.  The delivery was on time, but I took two bites and threw it into the compost.  Unfortunately, a complete waste of money, time, and appetite.", "author": "Chip B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-17", "description": "For a city with pretty poor pizza, this is pretty good.  Try the Pino special.  Calzone is also a winner.  Free delivery.  Great (relative) prices and there's always a coupon.", "author": "Cully W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-02", "description": "Indeed I ate here.  I ate here and it was ok.  Parking was found directly outside.  Indeed it was.  The cashier threw water cups at us, but maybe that was just an accidental wrist flick.  Is there a party happening somewhere yet? I'm bored.", "author": "Dana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-20", "description": "I've been going here for years, we have now rediscovered Marina Pizza. \n \nTo judge any pizza you must order the \"cheese\" pizza and eat it immediately.  Marina Pizza passes this test with a \"A\" rating.  \n\nTheir cheese pizza has the melt-in-your-mouth crust with a buttery cheese flavor that let's you know That's amore\"!!  After this test, you can order any of their delicious combinations with confidence.  Try their new burgers, too!!!  Try to find that at other pizza delivery places.", "author": "Harlow P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-06", "description": "A great alternative to Pizza Orgasmica!  Is Orgasmica really worth the 45 minute wait to get a single f'ing slice of pizza??  Granted, it's pretty decent pizza, but let's face it, I could be selling dog doo on a stick, but if you put me right in the Fillmore/Greenwich corridor with Balboa Cafe, Matrix, City Tavern, and Eastside West...at 2am, everyone is going to be in line to get a bite of dog doo.   Skip the wait, go 2 blocks down to Marina Pizza for a semi-decent slice of pizza.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-28", "description": "Great pizza.  Much better than chain stores!!!  You can always order by the slice or by the pie.  They are even open late, like till 3 AM.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "Had three large pizzas delivered for a birthday party.  The Combo was a little pricey, but tasted great.  The Cheese and Pepperoni were alright - good value for the price - not great tasting, but not bad either.   Delivery was on time.", "author": "Boomer D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-22", "description": "Not much to say beside it's a decent slice (thin) late at night\n\nI do have to point out that you get the Frankenstein slice here where you can clearly see the base (old) vs the toppings just sprinkled on (solid: combo, greco) which is a big turn off.. oh well this is the only game in town (in the area) when Orgasmica is closed\n\nBonus: plenty of space so you can sprawl over a table in your your drunkeness", "author": "xo x."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-26", "description": "We live in the Richmond and have been ordering pizza from them in a year, and we love it. They offer great deals (Marina Deal x-large 2 topping pizza/2liter soda) for under 20 bucks. Pizza is tasty, but I have to say the best thing about them is their prompt delivery and the fact that they deliver until 3am. They are so fast, and always arrive earlier than stated time!", "author": "Camille B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-09", "description": "This is the only place I know of that really comes close to an east coast pizzeria.  The pizza here is great.  Nothing fancy, just basic, tasty, this pizza.  I often get the chicken parm sandwich, but it's only average.  The ham and cheese is rather tasty, but not nearly as substantial.  The wings taste fantastic.  Sometimes they come overcooked, but such is life.  This place is open late so you can hit up the late night eats after the bars close.", "author": "Nate B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-23", "description": "The pizza is good, not going to lie. And it is open late. The prices are reasonable. The big, big, big negative which is the only reason I would stay away is the service and the owner/cashier. The cooks are quick, but this one guy is rude, nickle-and-dimes his customers, and is not respectful. You want a to-go box or a glass of water from their sink? Good luck. You have to convince him for that, because he says that he does not want to give it to you. Truly a disgusting way to treat your customers. It is sad.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-22", "description": "average pizza\n\nbut my friend from NJ swears it's the most authentic she's ever had...", "author": "Joy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-10", "description": "I love this place! ive been there a few times already, the hawaiian pizza and cheese pizza are awesome! people are friendly and its cozzy, nice place to sit down, have something yummy!, and hang out with friends..great prices..im coming back", "author": "Maria E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-31", "description": "As far as late night delivery goes, i'd recommend this marina pizza & cafe over any other place.  They have THE best chicken wings you can get at 3am. The ravioli is great, chicken parm sandwich is solid.  Pizza is ok but I'm a new york pizza snob so nothing really gets me excited outside of arinelle's.  Food arrives hot and close to the time they quote.", "author": "michael r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-12", "description": "solid 3\ni got pizza at 5pm on weeknight\nwas getting an estimate across the street at peters auto radio for good-ole-boy CB install in an audi\nthere was an old lady in the store asking them (radio installers) a million questions for a frikin $200 system\nI could tell she wasnt going anytime soon\nI remembered in one of my drunken nights there was a cool pizza store close bye ( pizza orgasmica ) + plus I was hungry and didnt want to wait for the simpsons-lady-with-cats to stop asking questions\nI decided to play frogger and attempt to cross Lombard during rush hour\nMade it across and walked 2 more blocks but PO was closed so I walked back and lowered my standards\nRounded the KFC and had two street people laying on the ground ask me for food, i didnt give in\nWent into MP\nI wanted to actually see the pizza before ordering a slice or two, but they didnt have any\n4 minutes he said\nwell i could see across the street that the lady had left the shop\nso i had to make a decision\ni chose pizza, sight unseen\ni got it not too hot and a snapple\npizza was eh... snapple was warm, i got fed\naggro level down a small percentage\nI jaywalked thru the middle of Lobmard's barrier bushes cuz I didnt want to prance past the laying-in-the-gutter couple on the way back to the closest corner whilst enjoying pizza\nthey place seems like it caters more to all the drunk marina douchebags late at night\nI think PO up the street even has a bouncer in the drunk hours", "author": "G K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-06", "description": "I had written and rates this place with one star because if the cutomer service and food. But the owner contacted me and apologized and it made me want to change my review.  He was very friendly and offered me a the credit they owed me! This place is now highly recommned!", "author": "Veronica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-03", "description": "If you ever crave organic lental soup, this is the place to go. It's a wonderful alternative if you don't feel like eating fast food after the bars close.", "author": "Marina Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-27", "description": "Ya know I really like the pizza this place has but for a while I wasnt ordering due to two upsetting expeiences. I ordered once and the guy on the phone messed up the order even after I had him repeat the order back to me. I got a broccoli and green olive pizza delivered to me instead of a ricotta and green olive that I had orderd and I have to say that was a NASTY mix of toppings. The second time I called I made sure he had it right but after an HOUR AND A HALF of waiting for the delivery I finally called only to find out that they had attempted to deliver but called the wrong phone number when they got to my house. I even used the correct number so they could access my account for the order. When I called about this they didnt apologize and said they would redeliver and they brought me a wilted salad and cold pizza. They should have atleast given me a fresh salad for their mistake. However,  its truly tasty pizza and affordable with late night delivery so after a 2 month boycott I gave it another chance and have been happy ever since making sure I speak clearly and loudly and check that they have the correct #. I DO RECCOMMEND this place sometimes you have to forgive and forget.", "author": "M K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-06", "description": "What a pleasant surprise.  I hadn't been here in years and it was pretty good tonight.  Thin crust medium veggie pizza and two sodas for $21.  We ordered around 8:30p and it only took about 15 minutes.  Lots of veggies, light cheese, light on the tomato sauce.  If you are starving, get the large.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-26", "description": "This pizza always seems to hit the spot for me. Be it 2 in the morning after a drunken night out......or even at a reasonable dinner time. Prices are pretty inexpensive but delivery sometimes takes a while. I wouldn't know how to comment about the next day leftovers - because it usually all gets gobbled up right away.", "author": "Aline W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-08", "description": "A great local place to pick up a plain slice on the run. Fast, cheap, and yummy.  They have a wide variety of other food on their menu -- it's all decent, but the slices are where it's at!", "author": "Cheeky C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-28", "description": "This pizza is my favorite!  In addition to great pizza, I called for delivery for the first time tonight and it was the most pleasant delivery ordering experience ever!  What a fantastic place - you guys are awesome!", "author": "Joanna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-07", "description": "mmmmmmmm.  pizza.  mmmmmmmmmmm.  really crispy (or should i say well done) crusts and cheese that sort of melts in your mouth.  ok, who am i kidding, it's totally open late, which is why i love it!", "author": "Anjali K."}
