{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Man, this is just a great sandwich. I don't think the place as been touched since 1976 and it's immediately noticeable. But the man making the sandwiches does his job extremely well and service is friendly.\n\nI've gotten the turkey/avocado/cheese toasted sub in different sizes at least 5-6 times now. It's just an excellent sandwich and even the small size will fill you up (the large size will require another meal to knock off).\n\nThis place has the ratings it has for a reason, don't miss it.", "author": "W N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "I believe that sandwiches, at their highest level, are an art form - and I think that the owner or Marina Subs is a true sandwich artist. So much thought and care goes into each and every sandwich, this spot is the polar opposite of chain restaurant like subway. \n\nThe only aspect I would change is the quality of meats and cheeses (also, why no cheddar cheese?). The ingredients don't hold up to the quality of the rest of the sandwich...let alone the sandwich maker. I would pay a few dollars more if that's what it took to enact this change. \n\nThis spot is truly an SF institution and I can't recommend it more highly. I just wish some of the sand which ingredients where shored up.", "author": "Tom G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Soooooo good. Classic subs with great ingredients and bread. AND zero skimping on meat.", "author": "Stebbin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Quite literally the best subs in SF.  Used to be sandwich spot down the street but they changed management. Theses guys have been consistent and the price point is much better. Recommend the Italian sub, no mayo.  Get only a couple of jalopenos for a little edge", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "This is one of our favorite places for a freshly made sandwich - we don't go anywhere else if we are close to the Marina. There is only one gentleman behind the counter who makes all the sandwiches so there is consistency in the quality of the sandwiches. He uses fresh ingredients (the avocados are my favorite) and takes great care to make delicious sandwiches. You'll need a good appetite because the sandwiches are generous- and remember to bring cash (this place takes only cash).", "author": "Nina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Incredible sandwiches in a local neighborhood spot. The ingredients are fresh and high quality and the portions of everything are so generous and a great value for the price! The Italiano was amazing, can't wait to come back and try the others!", "author": "Kim P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-14", "description": "We don't get the good ratings and comments here...? 4 stars? Is this a joke? Do people have any clue about what decent food is supposed to be?\nThe turkey breast tasted like nothing close to natural food and it actually looked like engineered gelo for astronauts.\nThe place looks as bad as the food is.\nWe trusted the ratings and were deeply disappointed. Could not even finish our subs.\nSo avoid the place if you are actually looking for real sandwiches, there are many good options on Union and Chestnut that will spare you\na disgusting experience", "author": "Thibault L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "Perhaps the best spot in the marina for subs to die for . They always exceed my expectations with my sub. As I am typing this, I'm enjoying a delicious cheese stake sub with roast beef and all the fixings. \nThanks marina Submarine", "author": "Joseph Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "Best submarine shop in the bay. Huge subs, fresh toppings, delicious sandwiches. Highly recommend stopping by this amazing sub shop.", "author": "Brendan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "If you want a delicious sandwich made with the utmost precision and excellence, do yourself a favor grab a seat here. Muah! Buonissimo!", "author": "Zach B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Marina Sub is my favorite sandwich in the neighborhood. Been going here for years. My favorite is the meatball sub but they're all good to be honest. Wish they had a bike share station nearby so we could go here more often.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "Sandwich delicious. I ordered the avocado and lettuce and he does not skimp on the avocado! The best part is watching this man work. He has such a beautiful style making these subs. It is like Benihana or watching a sushi chef. He makes it into an art.", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "The most underrated sandwich spot in the city. \n\nThe bread, meats,and the sauce are phenomenal. The owner/ cook 'Q\" is also entertaining to watch as he dominates the knife from cutting avocados to assembling huge sandwiches. \n\nMust try!", "author": "Ankit S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "I've been going to this place since I was a little girl (let's just say it's been a few decades, ok?). The sandwiches are delicious, the bread is fresh every day and the service is outstanding. There's no glitz and glam but if you want a delicious, finger licking (special sauce) sandwich I'd come here. I suggest getting your sandwich toasted because it melts the provolone on your Italian sub and gives the bread that perfect crispy crunch. Man, it's making me hungry just typing this review.", "author": "Shell B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "This place is the closest thing you'll get in the Bay Area to a good east coast hoagie place. I'm a tough critic, and been coming here for years. The bread is good, the meats and veggies fresh, and it's run efficiently. All the ingredients are here for a great sandwich shop. I even like that's it's cash only, that's the way it should be for the good places.", "author": "Pat H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "I lived a few blocks away from this place for almost a year before I found this hidden gem. The owner without fail is building the sandwiches daily and takes so much pride in his business. Every single time my sandwich is made to perfection. Perfectly toasted, balanced, delicious. \n\nI always get the turkey sandwich with everything on including avocado and hot banana peppers. This place hands down makes the best submarine sandwich I have ever had. \n\nFriendly staff, delicious food, quick and easy. I live in Austin now and still crave these subs. Looking for a replacement in my new home.", "author": "Emily K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "My favorite place for a delicious, classic sub! Don't expect free range chicken breast and organic mixed greens; there are plenty of other places for that. At Marina Sub, you can expect a toasty sub loaf, plenty of creamy cheese and avocado, and zingy special sauce (Italian dressing). \n\nI grew up going here, so my favorites have ranged from turkey & cheese to the Italiano, and even the occasional meatball sub. I'm currently into the vegetarian/avocado...sounds weird, but it's basically like an Olive Garden salad in a sandwich. Can't get enough of it!\n\nReminder: cash only. There's a corner store with an ATM a block away on Fillmore and Union.", "author": "Natalie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-26", "description": "CASH ONLY\n\nProbably the best deal you can find in the Marina! It's a simple place with nice people and good sandwiches. There's some indoor seating perfect for people watching.\n\nI saw the reviews that the sandwiches here were huge and they weren't kidding. My boyfriend and I shared one medium turkey with avocado sandwich ($8) and it actually filled us both up for lunch. It was PACKED with turkey, cheese, tomatoes, lettuce, and large slices of avocado on warm crunchy bread. You definitely get your money's worth!", "author": "Linda X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "Unreal, get the italiano!! Cash only makes it 4 stars....otherwise would be 5 stars for sure based on the food.", "author": "Dustin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Absolutely delicious submarine sandwich.   Old school San Francisco.  Q is a master.  It's meditative to watch him slice up the avocado and assemble the sandwich.  The special sauce is essential.", "author": "Anne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "This place is tight.  They use that thin shredded lettuce.  I don't know what you call it but I know it makes sandwiches better.  Get a medium, it's huge.  I don't think there is a sandwich in the city that makes me happier than an italiano from this place.", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Happened to come across this place while on my way to the mrs doubtfire house and I am glad I did. At the time, it was only one guy doing the sandwiches so it took a bit but it was ok. You can tell the man doing the sandwiches enjoys what he does. He had my 3 sandwiches on display and once he added the final touches he pretty much did the voila with his hands to show his work. I was amazed by his craft and the taste. Would come back for sure. Here is the magician.", "author": "Gabriel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "Not typically a sandwich person, but came here 2 weeks ago, got the large pastrami with everything, and have been craving it ever since.  Portions were HUGE- I ate half, was satisfied, and saved the other half for my mid-afternoon snack! I eat a lot, and this place does sandwiches right.\n\nGood enough to warrant my first Yelp review! I have been daydreaming about this spot all day! GET SOME.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "I've been on a sandwich kick lately and so far, Marina Sub is on top of the list of multiple places in the city I've tried in the past month.Totally unassuming 'almost' hole-in-the-wall. Not much to say about ambiance, decor, or even staff, as every time I've been stopped in, it's just the owner manning the station. But man oh man, those sandwiches...\n\n3 sizes available but \"Small\" is anything but. I struggle to finish even 1/2 of that. There's something about the combination of ingredients and the way they're prepared in the sandwich that just gels into heaven. The bread is amazing and bookends everything perfectly. I've tried the Submarine, Italiano, and even just basic turkey, and it's simply eyes-roll-to-the-back-of-your-head delicious.\n\nAt first I did catch a bit of a soup nazi vibe but now that's part of the appeal (last visit when I asked for the Italian, he corrected me: \"You mean ITALIANO?\" Nodded yes sir). I see a lot of regular locals in there and as I caught a glimpse of him slicing this beautiful avocado and cheese sandwich for a woman in front of me, she glanced back at me and cooed, \"He's such an artist.\" Indeed, he is.", "author": "Jen E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "This is my favorite spot to get sandwiches in the city, he doesn't put too much random things on your sandwich. Just simple easy coast style subs. Melted cheese and fresh produce, he slices the meat and cheese every morning so everything is super fresh. Line is long sometimes and because it is only one guy who makes the sandwiches don't expect it to be a super fast experience. Worth the wait for sure, if your in a rush order ahead on the phone. Fresh, simple, subs made by someone who obviously cares about the quality, which is why he's the only one making the sandwiches. Also if you get  avocado, he literally puts an entire avocado on your sandwich.", "author": "Kay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "Yes. Just do it. It's the best sandwich in San Francisco. You will wait, which gives you ample time to choose a variety of lays potato chips. It's worth it. Even my girl from the \"east coast\" says it's legit....I mean it's a damn good sandwich but didn't know it conquered the continental divide. Crush it Q!!!'", "author": "Matt H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "Sometimes you just want a big ass sandwich. Not just any sandwich, you want a big ass good sandwich, aka not Subway. This place is awesome, for some reason, these sandwiches are just heavenly. I think what really takes it over the top  is the avocado. I've never gotten a sandwich here without avocado, and so long as avocados exist I will never have a sandwich here without one. In fact I love how they incorporate the avocado so much that if one day they didn't have avocados, I would walk my ass all the way to Safeway and bring one back. Basically, make sure you get avocado in your sandwich and you will understand why. \n\nNext, my sandwich of choice is the turkey avocado. I have never had anything but the turkey avocado, and it satisfies without compromise. Big as **** and just toasted to perfection. Has everything I need: special sauce, lettuce, tomatoes, onions, and pickles. No one else is going to do it better.\n\nThere really is no substitute for Marina Submarine. I've tried other places, but nope, this is the SPOT!", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "First time, but my dad works construction in the city and recommended this place. \n\nWhat I had:\nOrdered the hot pastrami no tomatoes or lettuce, added jalapeños and honestly one of the best Deli sandwiches I've ever had. \n\nService:\nThe guy who go makes the sandwiches has been there for decades and takes his time to personally make every sandwich himself. While the wait is long the food ended up being really worth it. \n\nPrice: \nWorth it- ~$10\n\nMost sandwiches were under 10 bucks but the portions are gigantic. Medium is pretty big and was able to save half the sandwich for later. \n\nVerdict: \nTBH I don't even like deli Sandwiches all that much and i enjoyed this spot ALOT. If you love classic deli sandwiches or if ur not big on sandwiches and want to be wow'd by a classic sandwich I'd recommend this spot. \n\nDefinitely coming back if I'm hungry af in the marina/divisidero area", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "Super sweet family owned deli. I came in 5 mins before closing and boss welcomed me in. I only had $10 in cash, luckily that was just enough for a Medium long sando. I ordered a turkey & avo sandwich, prlly didn't have enough money for cheese which is fine cuz the sandwich was dang good. It was simple and hit the spot. He gave me extra jalapeños and avocado was fresh! The sandwich was huge! I heart toasted subs. \n\nAdouche came in to buy a Twix bar while boss was making my sandwich. Boss said he'll get to him in a minute. But of course Adouche cannot wait patiently and who goes into a deli just to buy a candy bar? I felt bad for boss but it didn't phase him. It just reminds me of the douches that feel entitled to act foolish in this area. Leave your douchiness at the door and don't forget o bring cash. \n\nI can't wait to come back, nice boss!", "author": "Margherita S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "The hot pastrami is my new love. Only one guy makes the sandwiches and we will call him the sandwich whisperer because they are amazing! Stuff full, a special sauce, and good prices for the area it's hard to beat\n\nOnly downside cash only", "author": "Leslie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-22", "description": "The sandwich was what i expected....Not that real quality meats or cheeses....But when you need to have that quick sub sandwich in the marina..THIS IS THE PLACE FOR A QUICK FIX", "author": "Kev V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-13", "description": "Want a giant sub that can feed 2 people for around $10? This is the place to go.\n\nOutside the place looks a bit rundown, inside you would probably think the same thing. Normally there will be a big line waiting for the master sub maker to work his magic. The wait can be a little long so if you plan ahead, call up and put through an order, the phone orders will sneak a few places up the line. Also bring cash.\n\nI have tried the atomic, turkey and Italian combo. The atomic is awesome but massive and expensive. The turkey (with everything) is my usual and I really like it. I got the Italian combo once to try something new but I have gone back to turkey. If you get avocado make sure to watch as the slicing of the avocado is great.\n\nI would probably give 5 stars if I could order straight away and sit down. The dude at the cash register stands there doing nothing most of the time (apart from taking cash slowly and answering the phone orders), not sure why he can't take an order in person (I tried, he couldn't do it).", "author": "Tristan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-23", "description": "Weekday, 1 PM - 3 people\n\nI've had this type of sandwich before - it reminded me of East Coast delis where they really pile on the meat and extras, smush the bread on top, and wrap it up tightly until it's about to explode from the pressure.  Everyone gives rave reviews about this place, but I wasn't impressed.  With all the innovation going on right now in the SF sandwich scene, Marina Sub is an old-fashioned place with basic sandwiches.  This is probably enjoyable for some people, but I'd rather have more flavors incorporated into my food - take some risks and go for something that makes you stand out.  \n\nYes, the guy making the sandwiches is really good at cutting up avocados, and will give you as many pickles as you want.  The price point for what you get is not as good of a value proposition when you're comparing with Lou's or Sandwich Spot.\n\nWe ended up waiting about 20-25 minutes for our sandwich, and it wasn't THAT busy inside.  The reason?  There's 2 people 'working', but only 1 is actually working.  The guy making the sandwiches is a maestro, it's true.  Great at doing what he does, you can tell that his hands have crafted thousands of sandwiches and peeled thousands of avocados before.  The other guy, standing near the cash register, was just standing around doing nothing.  Literally, 25 minutes went by and these are the things he did while we were there:\n\n1. Collected money\n2. Gave back change\n3. Stared at the wall\n4. Put his hands in his pockets\n\nIt was infuriating to be waiting so long for sandwiches when only one person was actively contributing to the process.  The interior was pretty bare as well and there were very few distractions to pique my interest.  I'm not trying to wait a long time for a mediocre sandwich.", "author": "Ben K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "Q is an ASSASSIN when it comes to avocados. When the world avocado cutting championships happen, I'm betting the house on Q. Now, as for the food...DELICIOUS deli sandwich really couldn't ask  for more!", "author": "Nickon R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "My favorite subs in sf. \n\nThe owner, Q, is great. \n\nMy go to is the italiano. The sauce they use on it is amazing. Huge sandwich. Full of meat, cheese, veggies, and toasted, for 9 bucks for a medium (which is actually pretty large). I add a few jalapeños for some kick.", "author": "Sam B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-26", "description": "Horrible quality. High sodium, mass produced meats and cheeses. They don't hide this. I should've walked. The reality is; a LOT OF PEOPLE don't care. If you're one of those, this place is 5 stars. For the rest, it's rot gut quality. Sorry to be blunt. But again they don't hide it. It's in the deli case. \n\nIt's my fault for going against my better judgement, I will not, ever, be back. \n\nThe fact they are hanging solid in the marina instead, tells you quantity is revered when it comes to even wealthy hoods. Quality.. Take a back seat, B.", "author": "Nik D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Got the submarine on a Friday afternoon going up to Tahoe. Inexpensive and great food. Nice owner, just need to have some cash on you", "author": "Colin O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "Love this sandwich spot, he understands the love for avocado on a sandwichwish he had a secret spicy sauce", "author": "Nicki N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "I came in my pants after a single bite. My shoes, soggy with jizz, left a trail to where I sat in a dizzying state of ecstasy, covered in flaky bread crumbs.", "author": "Naters H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "I have been coming here for years and the quality, taste and ambiance still the same! Great service, great sandwiches, great price!! Italiano and Turkey and avocado can't be beat. Don't let the line scare you. It moves fast.", "author": "E H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "Ok I get it. The place doesn't look good. But the Chinese man who owns and lives it is adorable. And he really did make the best sub in the area. Best sandwich in San Francisco for sure!! If you have time, eat there cause it gets soggy after an hour. Order the Italiano and get some chips.", "author": "Jimmy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-24", "description": "I get it, the guy knows how to cut an avocado.  Put that aside and you realize it's slow, cash only, the menu is too limited, and the sandwiches are pretty bland.  The shop is run down and the owner treats his cashier like garbage.  I've been here a half dozen times because I live nearby and every time I leave I have a worse impression.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "Q makes this place special. His commitment to subs is commendable and he works his tail off every single day to personally make subs as an art. His scoops of avocado are perfect and I love the turkey. No better spot to get a sandwich in the marina and to support local businesses.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Love the humongous subs at Marina Subs! Cash only. Call in your order in and pick up will save you time. The subs are made one at a time by the owner.", "author": "Kim M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "Good prices for the huge portions. \"Small\" feeds two people. No frills place and owner...all business!\n\nTurkey avocado is my go to. Bread's amazing (think Jimmy John's but better)", "author": "Darius D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "What more could you ask for? Same guy (one guy) has been making sandwiches there since before any of us on this thread were even born. If nothing else just go and watch him chop up avocados! If you like avo he finely slices it up and puts a whole one on ur sandwich, with sushi chef precision. I eat my own weight in food daily and I can barely put down a large! Glorious prices too", "author": "James A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "I usually don't give 5 stars, but this place deserves it!\nI've been devouring  these sandwiches since the 80's....the original was on California and Masonic st. What's mind blowing is that the sandwiches taste exactly how they did back when I was growing up!!! I talked to the owner and he said and I quote \"I have not changed a single thing as far as ingredients and preparations goes\" end of quote!\nHowever, he does add avocado, if you like and I like:) \n\nNote: you will never find a place that puts this much avocado on your sandwich period!!!", "author": "Al T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "It's all in the secret sauce...\n\nThe sandwiches are way bigger than they need to be and always delicious.  The service can be pretty slow, and the sandwich maestro apparently refuses to hire an apprentice.   Great for a leisurely Saturday lunch, but not a Monday if you're looking for something quick.", "author": "Malachi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "My husband and I used to live in this neighborhood 20yrs ago when we were singles. This place was our favorite lunch spot. We've moved around the world since then for our jobs, but always come back here whenever we are in SF. So happy to see him still making the best sub in town and people still lining up for it. God bless!", "author": "Sam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "Went here to get sandwiches 2 weekends in a row. Quick service and especially like how sub maker kept washing his hands a lot! Highly recommend this place for weekend lunch :)", "author": "Soran R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "i love their sandwiches! consistently delicious and fresh. never been unsatisfied. the smallest one is so filling, he makes a MEAN SANDWICH", "author": "Mallory V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "I work in sf every day and I eat out everyday when I get to work in this area I surely come here best sandwiches ever. Unbelievable I'm a big guy and the small etomic sandwich is plenty for 2 meals lol", "author": "Mario R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-07", "description": "Made to order sandwiches that are huge!  I live on the same block as Marina Subs and am here about once a month because of how conveniently close it is.  I usually end up getting a small and saving 1/2 for later.  High-quality ingredients, delicious \"secret sauce\", and fresh avocado that is impressively sliced to order by the owner.  \nMy only gripes: there is always an extremely long wait and they accept cash only.  I recommend calling ahead and then adding an additional 5-10 mins onto the 20 mins they usually quote.  Not sure why they don't just hire a second person to help with making the sandwiches...?\nThe pricing is also a little steep, Luccas is 4 blocks away with more variety in meats /cheeses and lower pricing (comparable wait time for walk-ins).  That being said, the quick walk across the street for me is worth paying a little extra.", "author": "Leah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-16", "description": "I am not a sandwich or sub girl but damn... He makes the best subs ever. \n\nIf you go during lunch time I would recommend calling in to order then picking it up. We went without calling and had to wait a good 30 mins just to get our sandwiches since there were so many phone orders coming in and a few people in front of us. But it is so worth the wait if you have the time! \n\nHe is very generous with his ingredients. Lots of meat, cheese, and if you opt for avocado he adds in an entire avocado! There are 2 sizes, small and large. I can eat a 6\" subway and be full. I got full after about half of a small due to the bountiful of ingredients in each bite! Although, if I really wanted to, I could have finished a small and been disgustingly full. My fiance is a hefty eater and always orders a large so that he can save the other half for another meal. \n\nDo try this spot if you're in the area or need to satisfy a sub craving, you won't be disappointed!", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-09", "description": "Cash only is a little frustrating. Great sandwiches but it takes such a long time! The owner / main guy is nice but won't let his co worker assist besides handling the money which could help speed it up. Slow speed and cash only combine to remove a star.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-01", "description": "Decent neighborhood sandwiches, great value for the price. I go the Italian and wasn't overly impressed and the bread gets pretty soggy quickly from the secret sauce so don't get this hoping to have leftovers.  Overall since its close to me I'll be back when I want a good sandwich, but definitely didn't LOVE it and if I find something I love, they may not see me again!", "author": "Gieselle A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "Great sandwiches, that sauce really makes a difference!  It gets pretty crowded at lunch time, call in your order so you don't have to wait.  Sandwich maker and staff member may not be the warmest people, but I don't really go there for the sunny demeanor.\n\nThey raised their prices!  I've updated the menu to the best of my ability; I'm pretty sure the prices are accurate in the picture, but don't hold me accountable if you find something is off.", "author": "Rita H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "This place is an icon for anyone who grew up and/or went to school in the north side of the city. I don't live in the bay area anymore and only come about once a year on average now, and yet Q still knows my order. It can get very crowded at peak hours (I've seen people call in phone orders while waiting in line), but I go there to have a sandwich made by Q; I am 100% am okay with other people not making the sandwiches. Authentic San Francisco. One place I always go when I return to my home city, and I am sure that's the case for many others.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-27", "description": "Best pastrami sandwich I've ever had. He asked if I wanted jalapeños and I said yes and he gave me like two handful worth of jalapeños.  Which I loved.  Ton of thick cut meat,  lot of sprouts,  definitely got my money worth.  Not sure if it was just me but after he wrapped up my sandwich because it was for to go.  He did this thing like a little prayer to it.  I don't come around here often but this place will always be on my mind if I'm craving for a sub.", "author": "Stanley L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-12", "description": "Not a gourmet or nice sandwich shop. Cheap quality meats and produce. \n\nThere was only one guy making sandwiches and it took forever. Saw a few people walk in, wait in line then leave.\n\nAnother downside was that it was cash only", "author": "Ulrich C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "Not only does this place make the best sandwiches in the city but they are the most awesome people around. With a great attitude honest and dependable trustworthy consistent amazing service and sandwiches. Thank you!", "author": "justin r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "This is quite a modest shop on the inside when you consider the outside advertising. The fellow making the subs is not very jolly but the bloke taking the money is up for a chat. We had a large Italiano cut into two. It was still too big. For $10.55 you could cut it into thirds to feed three.", "author": "Sue L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "Been coming here 20 years plus. Best sandwiches in SF. If you're not from the city and want to complain about how long Q takes, then honestly please never come here, and frankly, just leave. The sandwiches are delicious and it really isn't debatable, this is a factual statement. \n\nExtra sauce. Add avocado and jalapeños. Call your order in ahead and bring cash. The kid working the register is always what's his name's little brother. Don't be a dick, tip him a buck or two, and quit whining about the wait. Q has never let anyone else make the sandwiches. Not even his kids. The place is an institution. Subs is what SF is really about. The city grew up around places like Marina Sub.", "author": "Whitney B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "Q is the best. My go tos are 1) turkey avo or 2) meatball sub with provolone and jalapeños", "author": "Stacie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "Great sandwiches.  Try the avocado and sprouts but they are all good.  Right out of the 1970's and a real city insitution.", "author": "Bill S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "They have such a good tasty sandwiches ! I am working around there neighbors and get them often! But it's really big even order size small!", "author": "Yuki K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "Marina Sub is a hidden gem! This place has been around for the longest time and never fails to disappoint (even on busy days because it's worth the wait). The Asian sandwich maker stacks each and every sandwich making it \"the best bang for your buck\". Make sure to bring CASH ONLY.", "author": "Julian T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "Q has been in the business of making GREAT sandwiches for 29 years!!! Period.", "author": "Vivian E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-16", "description": "I called today to place an order for one small sandwich to pick up on my lunch. I had a feeling it would be busy so I made sure to call ahead of time since I was on my lunch break (I work down the street). \n\nI called and placed my order and they told me it would be 20 minutes. 20 minutes for one sandwich?? I figured it was probably really busy so I tried to be understanding.\n\n20 minutes later I walk to the shop and tell them I placed my order over the phone and paid. When I got there there was a crowd of people waiting to order their sandwich. Those people were walk-ins so they were waiting for their sandwich to be made.\n\nTo my surprise when I came in to tell I placed the order I see that my sandwich has not even been made yet. There's only one person making all the sandwiches. I get it, it's busy so I give him the benefit of the doubt and wait a little longer for my sandwich to be made.\n\n20 more minutes pass and my sandwich has not even been made yet and I start getting really angry because the owner is taking everyone's orders and even making orders of walk ins that came in AFTER me and I'm still waiting for my sandwich. I remind the cashier that I placed an order and waited another 10 minutes.\n\nAt this point I'm extremely upset because I only get an hour lunch and now I've wasted 50 minutes waiting for a sandwich that I called to order ahead of time to avoid this exact thing. Obviously they forget about my order. Now I spent my entire lunch waiting for a sandwich and won't even be able to eat it. \n\nI won't ever be returning here. Thanks for wasting my time and money.", "author": "Annie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "Italiano con todo!\n\nEveryone orders the turkey cheese avocado which is great, however, I've seen him making some other stuff that looks amazing like the Italian Beef and Atomic sub...\n\nI, personally, get the Italiano with everything and it's one of my go-to spots in the neighborhood.", "author": "max m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "this place is da shit! I've been coming here since i was a kid and its still the same old asian dude making these bomb ass subs. its a one man band with him so be patient bc your tastebud will be thanking you later. watch the way he cuts the avocados is precision and magic. someone needs to record that so i can watch that on loop like 100 times.\n\ni always get a small turkey with avo toasted with extra Italian magic sauce, no cheese. it tasted amazing back then and its still the exact same today!\n\n\n\n\n@devour_sf \n#devourthat", "author": "Lia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-01", "description": "The level of expertise required to produce submarines of such perfection surely comes with decades of experience and dedication to the craft.\n\nThe owner/deli master has clearly spent a lifetime perfecting the art of the submarine sandwich.  Not only is his technique flawless (you watch him make the sandwiches behind the counter) his rapport with customers is effortless and relaxed.\n\nThe ingredients they use are always fresh and the bread is delicious.  Also, they'll happily split a sub for you and a friend if you ask (they're big).\n\nDon't be intimidated by the sandwich maker's samurai sub skills.  He is simply the best at what he does anywhere in the world.", "author": "Foodie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "I always love grabbing a sub from this place. Top notch deli with some great options. Very hearty meals that keep you full for hours. Pastrami is my favorite. Great pricing as well.", "author": "Cameron N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "Classic subs without the corporate bs. These subs are straight up delicious. Cash only, and like anywhere in the Marina, good luck finding parking.\n\nPRO TIP: call in your order, they make those before walk-ins.", "author": "Aly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "We've been coming here since it moved here. We feed our entire sailboat crew on Marina Subs. There has NEVER been a complaint and because we have a lot of guests who've never had a Marina Sub, they end up as customers. I see a lot of my crew there now!\n\nThis is a small family business. If you want fast mass produced food - go someplace else. This is old school, do it right, best possible stuff inside, sort of sandwich place. The iPhone order, in and out in 3 minutes group should wander back to SoMa. \n\nGreat food and great people.", "author": "Beau V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-30", "description": "This is a no frills sub shop. You get a great big sandwich for a very fair price. The operation is just a deli board, a register, and that's about it. They pile the sandwiches high with comically large slices of pickle and avocado. One guy said \"extra, extra pickles\" and he received two whole 4\" long dill pickles, sliced thin, and smushed between the bread. You definitely get your money's worth.\n\nMy boyfriend and I shared a medium Italian sub and it was just the right amount to share. A large would have been too much. (The sandwiches really are huge.) Overall, I was pleased with it. I did try the Special Sauce - it made for a really drippy sandwich.\n\nIf it seems like I am taking my sandwiches too seriously, I have to admit that I am desperately looking for equivalent to a Boston style Italian sub that I could get at any corner deli in any town back home. So while the Marina Sub shop filled a certain gritty hole in my sandwich-loving heart, it didn't hit the spot. I'd come back for another sandwich but not on purpose!", "author": "Halley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-12", "description": "I called my boyfriends roommates pussies for splitting a large.\n\nI retract that statement completely.\n\nThese sandwiches are GIGANTIC and packed with goodness. I didn't think it was possible to OD on avocado, but I kind of did. Not complaining. They claim a large is 10'', but it is the biggest 10'' sandwich I've ever seen.\n\nPros:\n- Toppings are fresh and they have sprouts! They give huge portions of avocado! And they have peppers. Mmm....\n- Call an order in, and your sandwich will be waiting for you 15 minutes later.\n\nCons:\n- None? I've been fortunate to never have experienced a long wait here. I heard it grows up to 1 hour long because theres only one sandwich dude.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "I have been coming here for nearly 18 years.\n\nSandwiches are fantastic, but the line takes forever.", "author": "Lloyed C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-13", "description": "Marina Submarine definitely has quirky old school charm, with beer signs and a Korean sandwich maker. The secret sauce is a tangy Italian dressing. Sandwiches come in three sizes - 5 inch, 7 inch & 10 inch. Sandwiches include chicken salad, atomic, Italian cold cut, tuna salad, meatballs. \n\n* Medium pastrami sandwich ($6.25): The toasted narrow roll was decent but burnt on top. The pastrami was quite flavorful. The sandwich had the usual fixings - shredded lettuce, tomato, mustard, onions, mayo, jalapeno and special sauce. It was a hefty sandwich and tasty but with construction and toasting issues. It was too wet so it did get soggy fast.\n\nCash only.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-01", "description": "Cannot beat the quality of the sub! Medium sandwiches that is really for 2 people or ONE VERY HUNGRY person. Generous with their onions, tomatoes and order the avocado with it, you should get ONE whole cut to perfection! This is my place to go for a sandwiches. Btw, you can call ahead. Last of the family submarine sandwiches shop! Order the Italiano.", "author": "LL Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "One of the most deliciously frustrating sins you will ever have. The owner makes each sub meticulously himself, and the product is one of the best in the city, but be prepared to wait.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "Perfect sub. Perfectly toasted bread, love the special sauce (dressing), and the way the owner scoops and cuts the avocado is a show in itself. Consistently good because the owner makes every sandwich to perfection - employees only work drinks and register. I always get turkey.", "author": "Ruth C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-19", "description": "These are wonderful subs. My neighbor friend loves the corned beef with extra mayo and I like the turkey and avocado. Cute owner as well", "author": "Tina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-05", "description": "OLD SKOOL GOODNESS!\n\nGood sandwiches at incredibly cheap prices compared with other options nearby.  You want avocado on that sandwich- you will get a ton of avocado!  Generous portions and nice team working there.\n\nThe place is in desperate need of an update.  Looks like maintenance isn't a priority at all- holes in the wall, flies circling and a menu board that must be at least 30 years old.  \n\nThat said- some damn fine sandwiches!", "author": "Jory S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "Awesome subs!!! I live in LI, NY and this shop can go toe to toe with the best deli's in NY. Great spot!! Everything is good and worth the wait. Highly Recommend!!", "author": "Brian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-28", "description": "I was doing some counseling work in the Marina District. The appointment took longer than expected, thus my somewhat empty stomach has landed me at this corner deli on Union Street. \n\nThis deli is owned and operated by a Korean man, who is also the sandwich-maker. The cashier is a young guy who is probably a Harry Potter aficionado or a devotee to comic books. They both are nice and assisted my needs. \n\nAs a high-volume eater, I ordered one of the deli's featured sandwich: the \"Atomic Submarine\" Sandwich. The $9.95 \"unhealthy\" sandwich has slices of Corned Beef, Turkey, Ham, Melted Provolone, the usual condiment in a sandwich and a special sauce that the owner won't reveal in a toasted 7-inch roll. The heated sandwich is indeed big and can be an health-weapon for nuclear clog in your artery. \n\nI also bought a bottle of Orangina to complete my meal. This deli also serves Gelatos. \n\nAs I was enjoying my hefty sandwich, many of the people were enjoying the Meatball sandwich. I might try that sandwich when I come back very soon.\n\nCash only!", "author": "Matt G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-07", "description": "Sandwiches  are amazing - but beware - people come in with orders for 5 people and they put all call in orders ahead of patrons in the store - coupled with only one person making sandwiches it's never worth coming here when it's busy - look for a stack of papers in the prep area - that means your order won't get started for 20 minutes even though you are second in line -", "author": "Tamas G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-08", "description": "Wayyy understaffed\n\nNoon on a Saturday and it took 30 minutes", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-29", "description": "I was happy with our sandwiches here. It's true that the sandwiches seem to get an entire avocado, which is pretty astonishing for $1. The turkey meat is a little subpar but not bad - kind of like the bread. The meatball sandwich is pretty solid. literally and figuratively - better than many I've had in the city, but not coming close to Tony's or Morty's. The pastrami is in a similar realm - not the tops, but pretty decent. The toppings/condiments were similarly \"A-OK\" - I was glad they offered jalapenos, but there wasn't anything too fancy going on over all.\nI had good luck calling in an order around 1:45 on a Sunday - I still had to wait 5-10 minutes once I showed up, but I found the two employees to be pretty friendly.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-15", "description": "You will not leave this place hungry.  The sandwiches are very good.  I normally order the Italiano and pickles.\n\nTip:  Call in your order if you are in a hurry.  However, be careful as the Italian dressing will eat through the bag.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-08", "description": "I used to live down the street from Marina Sub and was a regular patron.  I have to say that Marina Sub is hands down my favorite sub, which is curious, because if I were analyze the sandwich objectively, without question it has its shortcomings.   \n\nThe ingredients, such as the bread, meats, cheese, mustard, etc. are nothing special.  In fact, some would say they're pedestrian.  Stroll down to Ultra Lucca and they've got some great bread and meats, but something has kept bringing me back to Marina Sub for years.\n\nSomething magical happens when the owner (who makes ALL the sandwiches) throws everything together.   It tastes like a thing of beauty!  After the once lackluster bread is toasted and stacked high with mediocre meats, veggies, bland American mustard & mayo, with a little italian sauce splashed on and more Avocado than you thought you could consume in a week, the sub transformation is complete, and it is AMAZING!  I can't tell you exactly why, because it defies logic.  How could assembling mediocre ingredients result in something so delicious, but it does?!  Trust me on that!\n\nTip:  Hands down, my favorite sandwich is Turkey & Avocado.  The owner slices full avocados just right...finely sliced and very generous, and the result is the best T&A you'll ever get!  Make sure to add peppers as well! \n\nTip 2:  Avoid to-go orders if you can help it or be very careful with the sandwich during transport.  They add italian dressing, and if you're not careful, you'll end up with a soggy sandwich, which totally defeats the purpose.", "author": "Jeremy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "Many years ago when I was 18, I obtained a job in this area and managed to discover Marina Submarine.  I ended up coming here nearly every lunch shift while I was working because it was way more filling and cheaper than the other lunch options in the Marina.  \n\nWhat I love most about these sandwiches is that Q, the amazing owner of many years now, uses an entire avocado for your sandwich.  I have never been to another place that uses more than half of an avocado (and they're usually small too).  He's extremely kind and loves what he does which is another reason I always went back.\n\nIt's cash only, but I have no qualms with that as this is a local business trying to sustain itself.  Be sure to always phone in your order or you'll get a headache and extremely frustrated.\n\nUnfortunately I live on the other side of the city and have a different job now but I always try to stop by whenever I happen to be in the Marina by chance.  :)", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-03", "description": "I like their subs, but they only accept cash which is a super bummer because if I don't have cash on me, I can't eat there (and the bank is too far away to get cash and walk back.)  For a sandwich shop, I recommend it and will return.", "author": "Shaun W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-14", "description": "3.5 stars.\n\nA failed attempt to go to That Takes the Cake (they need to update their website and Yelp page with their new business hours, hmph) led me to getting a sub here.  I've seen Marina Submarine many times but never really bothered to go in.  Today I was grumpy and hungry and I could smell the bread being baked or toasted as I walked by.  I ordered a sammie to go.\n\nI ordered hot pastrami with no mayo or mustard..yeah..I like my sandwiches dry.  I don't need the extra calories from the mayo!  The lettuce and tomatoes in the sandwich tasted really fresh.  Tomatoes and onions were both sliced nice and thin which I loved!  The bread was soft and a little flaky on the outside.  \n\nNow the pastrami...I don't know if its been a long time since I've had pastrami or if its always been really salty but I thought I was licking a salt block!  The  pastrami was a little fatty, which I didn't mind...but it was oh so salty!  All the salt made my throat felt funny as the day went on.\n\nI would be back again to try other sandwiches, but I think I'll pass on the pastrami.", "author": "Steph D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-11", "description": "I love this place. The guy who owns the joint has an amazing memory. I'm here maybe one a year and he remembers my order. What?!\n\nPlus the portions are big, which is good because, you know, I'm a major fatty. Case in point: I just ate here even though I already had lunch because I was in the neighborhood and had time to kill.\n\nSo worth it. Yum.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "Been wanting to review this local spot for sometime...Best. Subs.Ever. The same guy makes every sub, and has for years. There is a consistency here you will never find anywhere else. I get the turkey avocado sub which is toasted and has a complete avocado on it. Incredible sandwich.  Anytime I'm looking for a quick meal, this is the go to. Secret sauce is amazing.  Bread, amazing (I'm guessing Acme?)\nHighly recommended!!!!!!", "author": "Dan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-29", "description": "Straightforward sub sandwiches in a no-frills environment. I had the Italiano but was jealous of the turkey avocado I saw afterward. Literally so much avocado for the price - super deal.", "author": "DJ W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "I love this place! Although it's always busy, you know you're going to get a great sandwich every time and it's ALWAYS worth the wait. Give the sandwich guy some credit, he's the only person making sandwiches!!!!!", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "Before you come to Marina Subs, please bring cash and make sure you're starving.  These sandwiches are PACKED with goodness. I got the large Italian combo which is filled with beef and sausages. I then proceeded to add lettuce, tomatoes, cheese, and jalapenos. I'm a big eater and I could only eat half of it. The sub itself was pretty darn good. Definitely a bang for your buck!", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-12", "description": "If it's your first time here, do yourself a favor and get the Italiano with avocado. Marvel at how much meat goes on there and then think about Subway... and those 3 little slabs they give you. Marina Sub is the real deal. Also, the \"small,\" \"medium,\" and \"large\" sizes are pretty much a joke. I'm about 179 on a good day, 185 on a bad day, and a small is just fine for me. These are some serious sandwiches. \n\nThe sandwich maker here is really more of an artist than anything else. Waiting in line for a sandwich has been likened to waiting for the soup nazi. You might be in the front of the line, but he might have four phone orders that he feels like filling first. So in that case, you wait. Deal with it. The sandwiches are awesome.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "Go with a small (still massive) turkey avocado and add jalapeños.  Call ahead, and call back to check because sometimes it takes a bit, but definitely worth it and a great meal for 10 bucks.  Q is the man!", "author": "Jake T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-06", "description": "BEST SUBS IN SAN FRAN!\nBut seriously these are super tasty sandwiches. The fillings are quite simple: choice of meat, cheese, veggies (avocado, tomato, sprouts, lettuce, onion) and spread.  The bread is toasted, the cheese is melted and everything is so stuffed into the sub that some of the fillings tend to fall out while you're devouring it; but hey isn't that half the fun of eating a sandwich anyways? \nThe shop is kinda small, with only a few tables around to eat on location. Also the line for a sandwich can get long because the guy who owns Marina Submarine is the ONLY person who makes the sandwiches. This is why I believe they are so consistently tasty.", "author": "Molly R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-30", "description": "I give this place 3 stars for the food (and 1 star for the proprietor and his skills). I know I know...how DARE I?!?!?\n\nBut I work near some awesome places for sammiches (like Luccas) so I am baised but I have to admit I was curious about Marina Sub as I had heard good things from friends. So one day while working from home, I decided to meander down the hill to try it out. There was no line (woah right?) and the sub-nazi was primed with his knife. He truly is gruff but took my order without hesitation and even cracked a steely smile at the end when I batted my eyes at him and said thank you.\n\nI had my sammich in 5 minutes and the awkward kid behind the counter rang me up.\n\nI went home and have to admit I liked what I saw. Lots of meet, good bread. Not enough veggies but I am a fan of lettuce and tomatoes and onions etc. But a solid sammich nonetheless and will warrant a repeat trip with the bf as he is a sammich  snob and will want to try the Italiano like I did.", "author": "Kathy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-24", "description": "Eh...it's no Ike's Place or Little Lucca's but it's pretty decent.  A little on the expensive side, too, if you ask me...", "author": "Rose A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-16", "description": "I hate waiting in lines. However, today was different.\n\nI kept watching the sandwich guy slice up avocado. It was the combination of his trusty knife, his speed and accuracy of slicing it into thin pieces of avocado that made me stare in awesome wonder.\n\nWatching him was like watching a master at his craft and I felt like a captivated audience, I wasn't antsy at all to order, I was just in awe of his knife skills.\n\nOh the food? Sorry, I was drooling over dude's knife skills.\n\nI ordered a salami and cheese sandwich with all the fixins, except onions and avocado. I kept mine classic with a jalepeno twist. Mmm, sweat formed just biting into my sandwich.\n\nIt was damn good.", "author": "Sharon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "Q has done an awesome job for years. The subs are simple and always good. \n\nGet the dressing on the side if you get a takeout order.", "author": "David M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-29", "description": "Seriously people? Seriously? There is no reason that the line should be so long and the service should be so awful. There are people in SF who can get away with running there own show and you wait because they are nice and apologetic and have a personality. After waiting for AN HOUR today we FINALLY got to the front of the line...only to sit there for another 20 minutes while the guy made all the to-go sandwich orders...?? Uh what? Dude dont have a store front if you are going to focus on the phone orders. I should have just ordered from my cell in line and it would have been faster. \n\nSeriously save your time and your money....there are plenty of places in SF that will toast your bread and throw on some creamy Italian dressing on your sandwich.", "author": "Lovin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Probably the best sandwiches you can get within a few miles.  The owner is a little odd in that the closing time is variable, so don't plan on getting a late lunch here.", "author": "Morgan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-28", "description": "Marina Submarine is one of my favorite sandwich spots in San Francisco. I don't get to make it out there often, but when I do, it's a big deal.\n\nSandwiches are personally made by the owner, one-by-one, so you're guaranteed to get an end-product that has been fully attended to. If you see a line, don't be discouraged, he works incredibly fast. You should see the guy prepare an avocado - his movements are so fluid and effortless, it's clear he's been doing this for years. Aside from that, the owner is a stand-up guy. He's really friendly, and tries his best to accommodate you and your requests. He's always been pleasant.\n\nI always order the Roast Beef on Dutch Crunch, and I've never been disappointed. Sandwiches are flavorful and dressed with his house sauce - perfection. \n\nBe sure to bring cash. If not, then it's a pretty far trek to the next Bank of America. If that's the case for you, rest assured that if you need to make that extra trip, it is very much worth it.", "author": "Nicole I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "Amazing sandwiches!  Hardest working sandwich artist I have ever witnessed.  The precision of a sushi chef.  I had the Pastrami and loved it.  Uses two whole avocados in the small avocado sandwich.  Very nice people. Great value!", "author": "Mark A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-26", "description": "I will never go there again! \nI don't care how good the food is... If I order for pick up, you tell me it'll be ready in 10-15 minutes... And I stand there for an extra 10 with no sorry for waiting or no thank you and you THROW my sandwich on the counter!!!!! Yeah... Thanks, but no thanks. I will be spending my money elsewhere!!!!!!!!!!! \n\nSO RUDE!!!!!!!!!!!!!!", "author": "Mary J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-24", "description": "Sub Center (Ulloa) of the Marina. Same menu, same setup.\n\nI thought the guy was Japanese due to his knife skills and perfectionist technique (Korean per the reviews). The lettuce and onions are sliced super thin, lending to a crisp fresh texture in your sandwich. Bread toasting might be slightly better at the Ulloa location, but the assembly is way better here. \n\nThe bread isn't sliced all the way through (butterflied), so the sandwich doesn't fall apart. Same secret sauce, and pickled jalapenos thrown in after I agreed.\n\nBigger sandwiches to boot.", "author": "Derrick V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-27", "description": "I feel bad writing this review because the owner seems really nice, but I really didn't like my sub - not even a little bit. \n\nI eat a lot of sandwiches - whenever I'm in a new place I try and find a sub shop that's how much like sandwiches. I always order the same thing - turkey, light on the mayo, swiss cheese. No secret sauce, nothing else. \n\nSadly, my sandwich just wasn't good. The bread was super tasty, but the meat was slimy and I'm pretty sure that I either didn't get swiss cheese or the cheese had gone bad. It actually tasted nasty. \n\nThere's just one guy making all of the sandwiches, so give him a break! He's busting his ass to make you food. I think it adds to the authenticity of the place. \n\nI understand that my food preferences may be different than yours, so the only other con this place has (I didn't hold it against Marina Sub in my review) is the surroundings. Normally, I don't mind the Marina douches as I used to live there, but the ones outside at the moment that I was there particularly pissed me off. Marina Sub is an open door place, which means that if you are loud, obnoxious, and smoking, it affects everyone inside. After 5 minutes of listening to 6 dumbasses recount all of the slutty things they did the night before I was already irritated when they all started smoking. I actually went outside and asked them to move. One of them rolled her eyes at me like it was the most outlandish request ever. I don't hold this against Marina Sub, but if your tolerance for doucheyness is less than mine, go somewhere else.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-06", "description": "Sometimes you just crave a simple, well crafted, no frills sandwich, right? Good bread, quality meats with a heavy hand, classic veggies, this is my kind of place. Italian subs, pastrami, meatball subs are some of my favs. The turkey advocado is making its way onto my rotation, too. These sandwiches are huge and not for the faint of heart", "author": "Ross I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-08", "description": "The line here is ridiculous! Why? Because there's only one person making sandwiches. I'm no efficiency expert, but I know that a popular place needs more than that!  It excruciatingly frustrating to watch.  I don't care how good they are. At least get one more person to wrap a sandwich or replace the ingredients!  \n\nJust had the sandwich, it's good.  I feel bad for the guy running the place.  He seems really nice.  But honestly, there's no way I can wait for an hour to get a sandwich when the line is only 5 people deep.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-29", "description": "Eerily similar to Submarine Center on Ulloa out in West Portal. Who came first? Are they the same? Doesn't matter to me because they both use their special sauce that they add to every sandwich. \n\nWe ordered a large turkey avocado sandwich. This thing is not only large, it can feed two large people. And they're not skimpy with the avocado. Some places, you're luck to get a few slices, but here they cut out half of avocado before spreading it out and adding more to make sure every bite is covered. Sadly, this sandwich we ordered to go was missing the one thing that made coming here worth it - the special sauce. Without, it was just an ordinary turkey avocado sandwich. Wah wah wah...\n\nIt was orderly chaotic inside, with the wait times for sandwiches ranging from 15-30 minutes. With only the same poor old guy making sandwiches and his relative as the cashier, he couldn't quite keep up with the pace of the orders. Hopefully they can get another body in there to help out. \n\nIt's a hefty sandwich and decent if you're out in the Marina, but if I were given a choice, I'd easily and every time choose Submarine Center. \n\n____\n\nJan '12 Health score - 86\nGood luck finding parking on the weekends!", "author": "Dennis L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-25", "description": "Not the friendliest of services, but the sandwich was very yummy. Prices were fairly reasonable. There are three different sizes and the small is around $6.45 and it goes up from there for the next size. There are a few tables to eat at inside. It's all self-service.", "author": "Sharon G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "Small avocado and cheese with mustard, lettuce, tomato and special sauce. Same sandwich every time, can't go wrong. The owner/sandwich-maker knows what he is doing with avocados. I have heard him referenced as the \"avocado nazi\", for you Seinfeld fanatics, he is right up there with the Soup Nazi, I get a little nervous when talking to him. No lie, he puts TWO full avocados, on my small sandwich, it should not be allowed, but I keep telling myself that avocados are the good kind of fat so it's ok :)\n\nI can't vouch for much more on the menu, since I only get the one type of sandwich. But do be aware that at lunch time, the line tends to be out the door, oh and it's CASH ONLY, which in today's world still seems crazy to me, but the guy has a good business going so I guess why change it.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-08", "description": "I think I made a mistake by ordering the tuna sub. The tuna salad is made with olives, which I don't like, so that pretty much ruined the sandwich for me. The pickles, however, are enormous, juicy, and delicious.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-09", "description": "Easily the best sandwich in the neighborhood if not the city. I eat here a lot..", "author": "Philip D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "Great sub, lots of fresh veggies. I always call ahead, never wait in the line! \n\nAs everyone else is saying, he includes a WHOLE avocado, if not two. It's great and always fresh, easy if you work around there like I do. \n\nService is so, so, be nice to the kid, as for the old man...just keep your order short and to the point!", "author": "Molly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Pining for an authentic Philly style Italian sandwich over xmas, I found this place on Yelp and was not disappointed. Great grinders/sandwiches at a very reasonable price. Next time I will take the advice and call ahead.   We had the Submarine and the Avocado sandwiches and they were both great!", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-11", "description": "If ever I am a death row inmate, Marina Sub will be my choice for last meal. Hopefully the warden will also honor my request that Kyu (\"Q\"), the owner and sandwich maker, be allowed to come to the prison to make the sandwich. There are many things I love about Marina Sub. Let me enumerate a few:\n\n1) The sandwiches are just really damn good. My faves are the turkey and meatball. I go medium. The bread is always perfectly toasted. The special sauce on the turkey is downright dreamy. And on a cold day the meatball really hits the spot. \n\n2) I do not personally love avocado but having said that I could watch Q cut avocados all day long. If there was some kind of avocado slicing competition, Q would win. He is stunningly fast and unwaveringly accurate. And his style points would also be off the charts given that he insists on looking off into the distance while slicing the avocado, just daring the knife to slice his finger. It does not dare.\n\n3) It took about a year of coming here consistently for Q to recognize and acknowledge me, often with a silent nod. About 2 years after that, I walked in and Q called out to me by name. I dropped to my knees and wept. I had worked hard and consumed many sandwiches just waiting for the day that Q would call me by name. When that day came, I was overcome. Now we chat a bit every time I go in. It goes like this:\n\nMe: \"Hey Q, how's it going?\"\nQ: \"Hey Matt, you know, same old.\"\n\nIndeed.\n\n4) I love the fact that the cashiers are not allowed to interact with the sandwiches in any way. I have friends that complain about the wait times / lack of efficiency here. Sure, Marina Sub isn't winning any operational excellence awards but if you want a crappy, fast sandwich there are many places for that. Q is all about quality.\n\nAll in all, this place is the best. \n\nAlso, I'm not currently on death row or even in prison.", "author": "matt c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-22", "description": "I would give this place a higher rating because I think everything is expensive in this neighborhood and the Korean owner is like an artist with sub making. But recently i found out he was Korean. I just spent the year in Korea so I was so excited to tell him. When I asked him if he was from there he simply gave me a blank stare and said \"yes\" and then rolled his eyes. I thought he would be so excited. I guess my expectations may have been too high but really this guy is kind of a jerk. \n\nAnyways, the subs are pretty good and it's nice that you can order before hand. I don't find them particularly stingy like people complain about. On the contrary, I think they might put a little too much cheese on their subs and they are sooo generous with the avocado. \n\nA better attitude from the owner would have gotten them 4 stars.", "author": "Jaqueline M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "Had a meatball sub and italiano from this place.  I was impressed, pretty good sub!  I like the bread they use.  I'll probably be ordering from here again!", "author": "christopher h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-09", "description": "Marina Subs is by far the best sandwich shop in existence. Seriously.\n\nI have been going here for about 20 years after being introduced to it by my best friend in childhood. Q is exactly the same as he has always been - a machine. I don't think I have ever ordered avocado on my sandwich but watching him slice them is like art. I don't know anyone else that has a special avocado scooping spoon. He is always friendly no matter how busy the shop is.\n\nMy sister and I would frequent Marina Subs a lot during high school and he always recognized us. I haven't lived in SF for almost 8 years now, but come back to visit a few times a year. Marina Subs is always on my list of places that I have to eat when I am in town. The nice part is that when I go with my sister Q still recognizes us. (Doesn't work if I go by myself though, unfortunately.)\n\nThe shop hasn't changed much as you can tell when you go in. But it is CONSISTENT!\n\nIf you want to have the sandwich that makes Marina Sub the best I would recommend the Submarine with the special sauce. There is no better sandwich, just eat it quickly before it gets soggy! Oh and don't forget the Orangina.", "author": "Ben B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-18", "description": "Good quality sandwich, and nice owner. Unfortunately the meat on the Italian classic is rather flavorless. The salami, cappicola and mortadella lack flavor. Otherwise the sandwich was quite good, with a perfect amount of nicely toasted bread, and good quality veggies and sauces. \n\nI'll probably try it now more time with a different kind of meat and hope that is better.", "author": "Jacqueline A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "So I've heard abut this place but never been and on a nice sunny Sunday we wanted to grab a quick lunch before heading to the park.  We get there and it's a line out the door, my boyfriend told me this is not a gourmet sandwich but it's an experience.  So we get a large roast beef with avocado and no cheese.  \n\nI can't say the ingredients were all that great, they really weren't and the fact that the sandwich was toasted saved the bread.  He did stuff it with tons of avocado so for the extra $1 I felt we totally got our moneys worth and for $10 total we had lunch, which is not easy to do in the Marina and get a decently healthy lunch.  Not sure I'm going to be rushing back anytime soon but it will be on my radar.", "author": "Inga W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-24", "description": "Date & Time:  Tuesday March 24, 2009 @ 11am for Sandwiches To Go\nCompany:  Michael\nCrowd:  Neighborhood Individuals(Mostly Guys) & Small Groups in College Sweatshirts,  Lululemon or Rock n' Republic Jeans\nVibe:  Chill\nDecor:  Very Casual w/ Half Dozen Tightly-Packed Tables for Deux & Quatre \nService:  Asian Sub Nazi\nDevour:  Large(10 Inch) Hot Pastrami Sandwich w/ Provolone, Jalapenos & Special Sauce.  \nTotal:  $17.75 for Deux of The Above", "author": "Genevieve Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-06", "description": "Great basic sandwich.  I was told to go prepared and with cash only.  The bread was toasted just a little too toasty for me but the flavor was great.  It's a messy sammich so definitely plan on it being drippy with lots of napkins.  But if you're looking for a basic toasted sub, this is the place.", "author": "Susan Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-16", "description": "I have been a faithful customer for over 35 years, however the service has become so poor that I don't think I will come back.  I have been waiting for over 30 minutes since I placed my order and there is still no sign of my order.  Most of the subs are coming out burnt as well.  Extremely disappointing.", "author": "Heather M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-12", "description": "Get any sandwhich.... add avo, and voila--- one of the better subs in sf....\n\neeasy beezy... done and done.", "author": "ilya g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-20", "description": "I have been coming here for 20 years! My parents used to go on lunch dates at Marina submarine so our family has loved this place for two generations! When ever we are in the area we make a Submarine stop because they are delicious!!\n\nThe owner is NOT shy about filling his sandwiches with fresh ingredients! Our family favorite is the SUBMARINE sandwich toasted!!!! DELICIOUS!!!!!! And his secret sauce...So worth the wait!!!  \n\nThere is usually a wait because its just the owner slapping sandwiches together and the cashier ringing people up and answering the phone. IF YOU ARE IN THE MOOD FOR A FRESH DELICIOUS SANDWICH...Go to Marina Submarine. \n\nCASH ONLY!!!!", "author": "Gina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "Probably the best sandwich I had while living in San Francisco.  Yup, better than Ikes Place.  Although the line is SLOW here, it doesn't compare to Ike's wait time.\n\nMarina Sub is a one man (the owner) operation.  The hired help is always a teenage kid, and I can't help but chuckle at the situation after the 15th minute of standing in line.  Here you have the owner chopping avocados into 40 slices, like Martin Yan from Martin Yan Can Cook (http://www.youtube.com/watch?v=qT9lKA5_bPI), and you have the hired help working the register never knowing what price to enter.\n\nIf the line is 5 deep, prepare to wait 20-25 minutes.\n\nOutside of the long line, the sandwich is the bomb.  All the ingredients are fresh and you order by size.  I believe a large is 10 inches from what I can remember from the menu.  It's kind of weird, because the bread is maybe barely just longer than 10 inches, but he always cuts a slight edge off of the bread to make it 10 inches.  \n\nWhat separates the sandwich is an addictive sauce he puts on the sandwich.  Make sure you do get the sandwich with the sauce.\n\nHours are kind of at the whim of the owner.  On Saturdays he usually closes up shop around 2:30/3pm.  Call that sucker in if you can or make it right before 12 on the weekends to avoid the lines.", "author": "Kyle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-09", "description": "I have been going here since I was a kid, and my Mom has been going here since she was my age. This place is the best in San Francisco, hands down. The first thing I thought of eating when I came back to visit family was getting a hot sub here. I brought my boyfriend here, and he absolutely loved it--comparing it with his local turkey hero in Richmond, Virginia. \n\nThe guy who owns this place makes my day. Growing up, I used to love watching him cut avocado. Strangely, to this day he never looks like he's aged a bit. \n\nIn terms of particularity, I've tried every sub here (seriously, I have), and everything is incredible. You won't be disappointed. Add avocado and cheese, and tell him to not cut your sandwich in half if you get a small.", "author": "Alex V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-26", "description": "Being in Asia for half a year, I've truly truly missed sub sandwiches.  \n\nI got a small hot pastrami sandwich, which was stuffed to the brim with pastrami and veggies.  I swear most places charge an arm and a leg for sandwiches, but this place is cheap cheap.  $5.69ish for a small, which is comparable in length to a 6 inch from Subway, but wayy wayy bigger.  I think you might have to pay a little extra for cheese, but it makes the sandwich.  \n\nNot the best pastrami I've had.  I think the best hot pastrami sandwich is sitll from Subcenter, but I bump it up from 3.5 stars because of the nice proprietor.  He was kind enough to put mustard on only half of my friends' sandwiches because they were splitting two sandwiches and one of them didn't want mustard.  \n\nDefinitely going back here whenever I'm in that part of town!", "author": "Anna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-19", "description": "1. Definitely call in your order\n2. The guy will tell you it will take 10 minutes\n3. Don't go until 14 minutes - at that time the sandwich will have JUST been made so it's still warm and delicious but you won't have to wait and experience the death glare that those patrons in line will most definitely be giving you. NOTE: Be careful with the timing! If you wait too long the sandwich will no longer be toasty and hot and the whole calling ahead business will have been in vain b/c it will not be as delicious as it has been hyped up to be!\n\nI've tried the pastrami, Italian and cheesesteak but my favorite, by far is the pastrami + provolone + avocado. Another tip: AVOCADO IS A MUST. Don't be cheap and skimp on this - it's like buying a brand new car and not splurging the extra bit for a navigation system (which is what I did and I still regret to this day).\n\nHopefully these tips will make your Marina Submarine experience a great one. One more thing, don't talk on the phone and carry 2 large sandwiches in the other b/c by the time you get to your destination you will have one nasty arm cramp.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "Good subs and great atmosphere.  This place is a welcome throwback.  Great hot subs with very nice hot bread.  I strongly suggest giving this place a try when you have a few minutes at lunch and are in the mood for a nice sub.  The man at the counter who assume owns the establishment is pleasant and we really enjoyed our experience.", "author": "Brendan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-12", "description": "BEST sandwiches in the city for sure. I used to go to St. Vincent de Paul and it's literally right next to Marina Subs, and since I grew up with it, it holds a special place in my heart :] hahaha. But really, get the turkey sub with everything because it's amazing. The way the guy toasts the bread with the cheese... OMFG, it's perfection. I don't know how he does it but he toasts it JUST right. He's also INSANE with his avocados - if you're a fan, then definitely come here because he puts hella avocado in your sandwich. He's definitely THE master of avocado-slicing - he does it so quick and clean.  \n\nI guess it's sort of pricey for a sandwich (around $7) but it's SOO frickin' good and filling, it's toootally worth it.", "author": "Christine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "I love me a sandwich. Like I get made fun of by my family because I love a deli sandwich and will go out of my way to get one (Anderson Valley grocery, I see you). So when a shop says they're the best sub in San Francisco, I say, prove it. You walk in and I'll be honest, it's not much to look at. There's paper covering up menu items they no longer serve, like salads. However, there's a certain beauty to a limited selection of items. Plus, they more than make up for any lack of items with what can only be viewed as a show by a sandwich master. As I watched Q deftly disengage several avocados from their skins and then finely slice each half without a glance before sliding a full avocado onto another patron's large sub, I was transfixed by the man's skill and attention to each sandwich. I ordered a small but it was what I would describe as huge. All sandwiches are toasted which just adds to the overall flavor. Even though I let my sandwich sit (I had just had brunch, however I am sandwich crazy) and the special sauce (most likely an Italian dressing) had soaked the end of the bread, the thing was like biting into heaven. Seriously, this is one of the best things I've ever had in sandwich form. Anyone who rates this place under four stars is bunk and wouldn't know a great sandwich if a grilled cheese slapped them across the face. No frills (Thank God is arugula free) but awesome to the extreme. Yum!", "author": "aimee g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "This place is close to work and it's great when your starving! Plus the owner has great memories! I was amazed that he remembered my order and literally read my mind. The portions are huge but delicious! It does get very busy but it's totally worth the wait ;)", "author": "Pam Ela Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-20", "description": "i was a little worried about my encounter with the so called \"sub nazi\"...i didn't know what to expect as i entered marina submarine for the first time.  wifey said, \"hm, i bet he's asian.\"  i said, \"no way...i highly doubt that.\"  we both walk in and ta-daaaaa...it's a dude that could possibly be my uncle.  haha.  i know how to handle grumpy korean men...but this guy wasn't grumpy at all.  maybe cause we were probably his first customers of the day?  and there wasn't a line?  who knows...in any case, he was chill...no small talk...but in and out in no time.  \n\ni listened to the other yelpers and ordered the large...wifey had no clue what she was getting into.  she saw him bust out with bread probably as long as the length from my wrist to my shoulder.  no joke.  and then wifey asked me, \"are both of those just for us???\"  hahaha.  but for around 8 bucks each...it was well worth it.  eat one half now...eat the other half for dinner.  it's called budgeting, folks!  \n\nwe ordered the italian beef with jalapenos and the italiano with avocado.  the italian beef was ok...but the winner winner was the italiano!  the sub nazi threw in an entire avocado...it was like buttaaaaaaaaaaa.  yum.  the combo of meats were super tasty...and the bread was nicely toasted.  the dood is not cheap with his toppings!!!  both sandwiches had to weigh over 5 lbs...it was like carrying my cat.  \n\ncash only.  come when they open and beat the rush.  order the italiano.", "author": "Jen W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-29", "description": "What ever happened to sourdough hard-rolls? Not recommended unless you are hungry and want something right away.", "author": "Mag N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "Super tastayyyy! Turkey + Avo + Special Sauce = Perfection. Order in if you're in a rush or else you might wait an extra few minutes than you thought (worth it though). Super generous with everything, including the avocado. In my opinion, you get more than you pay for. It's such a great little shop and the man makin' the sandwiches is one hard worker! \n\n- Keep in mind, it's cash only! There are ATMs nearby though.", "author": "Chelsea L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-14", "description": "Discovered another great sandwich shop thanks to my friend :)\n\nThe sandwiches here are very fresh. It's their special italian dressing tasting sauce they use.\n-They toast the bread perfectly. \n-Are not stingy with ingredients.\n-When you order avocado they put A LOT and not just 2 or 3 slices (I REALLY appreciate this because I love avocado).\n\nIt's a bit more expensive than how much I usually pay for sandwiches, but these sandwiches are worth it. MMMmmmm, my mouth is watering as i type :9\n\nParking is hard in this area. Depends on what time you go though. Also, very limited seating. But I still totally recommend it. It's awesome :)\n\nThe old asian guy that works there is cool too.. I think he owns it. If you order avocado with your sandwich, make sure to watch his fast avocado slicing skills and how he lays that think layer of it over your sandwich. It's pretty exciting.... or I may be the only one that thinks this.", "author": "Sachiko K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-03", "description": "Being sick of all the crappy sandwiches from nearby liquor stores..I decided to take a longer walk down to Marina Subs and try something new. I ordered a Turkey Sub with Sprouts...two minutes later I was out the door with a Sub and a bag of Funyuns. \nI ate my sub as soon as I got back to work..and I think I ate the entire thing in less than two minutes. It was truly the most killer sub that I've EVER had. The bread was toasted and slightly cripy. They didn't skimp on the meat and the condiments were just the right amount. \nI am just happy that I found a new place to go for lunch!", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-20", "description": "Was visiting and came across this place. My friend and I split the large Atomic Sub and it was delicious and filled us both up. We made sure that we stopped in on our way out of SF to have another Atomic.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-08", "description": "I thought I hated subs, but then I tried one from Marina Submarine and my life has never been the same!  My husband and his family have been regulars for years (brother-in-law even worked here as a kid).  It's a unique, local shop.  No atmosphere to speak of; just a sandwich shop.  We usually get ours and head outside for a picnic.  It's true that the lines are long, but that's because the owner insists on making the sandwiches himself.  The sandwiches are soooo worth the wait, though. \n\nIf you are the type who is going to get royally bent out of shape by a long line, then complain because you weren't treated like a prince/princess, then you should definitely NOT visit this place.  You'll just make the line longer and more unpleasant for the rest of us.\n\nIf you're an average person who likes good food enough to wait for it, and you realize that the world does not revolve around you, then you MUST give this place a shot.  I don't think you'll be disappointed.", "author": "Areena M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "Fresh bread and great french dip sando!", "author": "Lyndsey M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-01", "description": "Yup, this is one of my regular sandwich haunts. I've been hesitant to write something about it for fear that it'll be a zoo when gettin' my fix. Well, way too late. But by reading through most of the reviews and stumbling onto my ramblings, you might be pretty much \"in the know\". If not, be warned. This is a two person operation, sandwich maker/owner and some teenage kid working the register. Be prepared that when you go there for lunch...100's of other people have the same idea. I usually do late lunches (2p/3p) and have been lucky everytime with the wait time. I even have it for there with a table for myself. I KNOW!\n\nYes, the guy is skilled with the knife. I personally think he also moonlights as a sushi chef. I'm usually getting a medium Italian combo or Turkey w/swiss (toasted)...and I need to know that right then and there. He is known as the sub-nazi. Know what you want, know what it comes with, and know what you want or don't want on it...if not, he will be slightly irritated. I hadn't seen him do it yet - and I heard he has - but I'm waiting for him to bypass someone who didn't know what they wanted. Trust me, the place has it's regulars and he DOESN'T really need your business (or a lame 1-star rating on Yelp because you pulled an Elaine a la \"Seinfeld\"). And that's my kinda place!", "author": "Ted P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-19", "description": "Been going here since I was in high school and love the place. Q (the owner) is a great guy, but his respect doesn't come easy... don't go in there expecting this guy to give you Grade-A customer service, but once you start going more regularly (as you certainly will) he starts to warm up once he remembers your face.\n\nBest hot-sub's I have found in SF, blows their main competitor (Viking Sub) out of the water... \n\nBe warned though.... YOU MUST CALL IN YOUR ORDER IF YOU ARE IN ANY SORT OF RUSH.... Q takes his time and is no master of efficiency, the food is worth the wait, but unless you feel like waiting 30-40 minutes I would call in ahead of time....", "author": "Sam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-19", "description": "The best classic subshop in the city. A 6-inch avocado sandwich will have TWO AND A HALF avocados on it - seriously, the only legitimate avocado sandwich in my eyes. In addition to being simply delicious, the owner is a great character - super nice, stern, and definitely never lets anyone else handle the food at all. Watching him slice avocados is amazing. Such style. Warning: can be quite the wait so call in your order ahead of time.", "author": "Rita C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-08", "description": "It's good, fresh just not great.  Oh I won't lie, I still order it because its close by and a decent alternative to other local subs in the area.  Prices are fair. Line is always long so do yourself a favor before you go down there and queue: call ahead and give them a good 15-20 minutes before you roll in.\n\nI'm a fan of the hot italian beef with all the goodies on it.  The meat is stewed for a few seconds in that delicious brown sauce before its tossed into a soft roll and given a makeover with all the trimmings.  Get the 10\", it will feed you tomorrow and a fair value at $8 bucks.  Jalapenoes are free as an addition so slap em in if you like it spicy like me.  I have had their Atomic sub; its good but at $15 I just dont see the value.  Its a blend of beef and pastrami with all the other stuff you like.  I'd rather just stick with the beef or go pastrami if thats your thing...hell get both seperate and blend them at home!  It will be the same price and double the food!  Other than that, pretty standard, chip rack, range of sodas and I believe beer, but dont quote me, I never eat in, always to go...speaking of which, time to go pick mine up.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-01", "description": "Best sandwich in Northern California.  Done.  \n\nThe submarine is wonderful.  The meatball sandwich is gorgeous.  And if you want avocado on your sandwich, you'll get tons of it.  \n\nYeah, don't wait in the line for 5 minutes only to get to the front to decide what you want, he's got sandwiches to make and he shouldn't have to wait on you when you get to the counter because you wanted to talk about your Walk of Shame to your vapid friend.  (Talking to you, Marina Girls).", "author": "Rick D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-15", "description": "Cash only was really a drag as we had to buy the cheapest sandwich (with bologna and ham).  Meh.  The place was cramped and not very clean.  You also pay a lot for not much sandwich.  The owner was super nice and accommodating though.  Perhaps we'll try again, but for now we're fans of The Sandwich Spot nearby.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-25", "description": "Let's table the fact that I can only stand being in Cow Hollow for about an hour max before I start to feel punchy with the annoying white chicks with the \"omgs!!\" and ugly gucci purses and talk about a sandwich. \n\nNow I enjoy a good sandwich but I can be kinda picky. I want to see where my meat is being sliced, freshly ripped pieces of lettuce and huge rounds of cheese. This place is not that but the avacado hook-up, toasty bread and secret sauce kinda make-up for that.\n\n Like other folks said I would order ahead or be patient and wait but beware those damn prepsters.", "author": "Jade W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-06", "description": "On a short weekend trip to SF and staying in The Marina, so decided to find me a good local sandwich shop.  You really get any more local than this place.  Old man owner making the sammiches while his young teenage employee rings you up and takes phone orders.  \n\nI ordered the Italiano and it was exactly what I had imagined it would be.  Plus it was TOASTED!!! It's cold here in SF and the toasty bread hits the right spot.  \n\nSince the owner takes a lot of pride, he makes all the sandwiches it seems.  While this ensures high quality, it makes waiting there unbearable.  I read in an earlier review to call in the order, but since I had never been there I decided not to.  Well I'm glad I didn't call in the order, because there were 7 call-ins and they seem to make the in-store sandwiches first, so less waiting for me.  Not sure if this is the case everyday, but on a Saturday at noon, that's the law of the land it seemed.  \n\nI'm now going to enjoy my food coma :)\n\nThanks Marina Submarine!", "author": "Eric N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-20", "description": "toasted sub sandwiches.  it was delicious and the medium size is huge!  i don't know what they put in the sauce but it makes a yummy sandwich.", "author": "Animal K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-31", "description": "Checked out Marina Submarine at 1PM on a Saturday.  I'd heard gripes about the line, and had my to-go order ready in 20 minutes.  Yes, longer than your average sub shop, but worth the wait (I had the signature: The Submarine).\n\nThe owner / sandwich-builder, Kyu, is very efficient at his craft, and puts on a knife skills clinic with his mound of California's freshest avocados.  Top marks for freshness of ingredients, bread quality, portion bang for your buck (tough to find in Cow Hollow), and the pickle!\n\nI'll definitely be back to try some of Kyu's other creations, namely the Italiano, the Cheesesteak, and the Meatball sub.", "author": "Nicolas T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-04", "description": "The bar was set pretty high for this place as I had heard nothing but good things and I am a sandwich lover but my expectations were met.  I got a large and thought I could finish it but no way.  The Italiano was great and the \"secret sauce\" was awesome.\n\nI love how the owner is the only one that can make or even wrap the sandwiches though.  Kinda felt bad for the cashier.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-13", "description": "Pros:\nGreat tasting subs..\nI've never seen anyone slice an avocado so fast....\n\nCons:\n4 people in front of you = long line/long wait\nSubs tend to be stuffed so they fall apart.\n1 guy making the subs", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "Good ol' fashioned sub. I got the turkey with avocado and it was great. They don't skimp on the avocado at all. I ended up getting a medium and it lasted me 2 meals so I can only imagine how big a large is.", "author": "yoni s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-23", "description": "Yes the hours are limited and it's cash only, but Q is nice and he makes great subs.  I usually get the meatball, Italian, or turkey/avocado - all are great!", "author": "Bud L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-04", "description": "On the north side of town Marina Submarine is the best! Not fancy and only open for lunch but just delish! I love the sub with everything... wish I had one right now! It's cash only so come prepared...", "author": "SF G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-04", "description": "Walking by this shop, the distinct aroma of toasted sandwiches flows out the door and into your nostrils. That's a good sign already. \n\nSo we walk in, and there's this girl behind the counter with glasses who looks like she just woke up. We tell her we want a small Atomic and she stops me and points at the man behind some curtains rearranging some boxes. I'm confused as to what's going on. The man comes out a bit later, Korean male, average late 40s to early 50s and he asks what I want. I was kind of expecting the girl to tell him what I wanted since I just gave her my order but she just stood there and stared off into blank space. So I repeated to the gentleman what my order was: a Small Atomic sub. He goes up to the girl behind the counter and tells her \"Small Atomic Sub.\" Mind you, this is the third time she has heard it. And she stands there almost as if her brain was running on 64MHz and then it's like \"ding---Process complete\" and then she slowly punches in the price on the register. It was pretty amusing. \n\nThe sandwich itself was good. The bread is a bit thinner than those found at Gene's Liquor or Submarine Center and didn't hold up to the moisture too well. The pastrami was excellent. There was a generous amount of meat and the \"special sauce\" was standard to the previous mentioned stores. \n\nHowever, one major gripe is just the cost itself. A small Atomic with tax rang up to be about $9.35. That's crack prices! A LARGE with Avocado at Gene's is less than that from what I recall. It's heinous that a large here without avocado runs about $14 and change and with tax probably closer to $16. Even at Submarine Center, their largest SUPER is only $8.70. Maybe it's because I'm on Union Street, but nonetheless. Expensive sandwich with borderline retarded staff is enough for me to consider the tantalizing aroma as a stench.", "author": "Derrick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-15", "description": "Stop whining these sandwiches are so good. Service is slow because he doesn't need to hire anyone else because no one else could make the sandwiches so good. He really loads on the avocado and all the veggies are delicious. A little pricey if you add the avocado but so good, my favorite sandwich in the city.", "author": "Kenny J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-10", "description": "This is my favorite sandwich spot in San Francisco. The guy who makes the sandwhiches is so nice. I always get the cheesesteak sandwhich and it's amazing. The line can take a while most of the time", "author": "Paul B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-06", "description": "I arrived at 1:49 PM with the hopes of trying this place out. I had heard great things about their sandwiches. I waited in line for what seemed like forever. I finally got my food at 2:34 PM. Yes, that's a 45-minute wait in line! I'm a patient guy, but waiting for 45 minutes is only tolerable when the employees are working hard. One employee just stood and watched while the other did all of the work.\n\nThe food was great. The turkey sandwich was delicious, and loaded with avocado, but honestly... no sandwich is good enough to wait in that line again.", "author": "Greg B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-04", "description": "I can distinctly remember my first bite of an M. Sub, as my family has taken to call the place. Heaven. Easily the best submarine in SF. My first bite was in 1991 so I know what I am talking about.\n\nNote for first timers: If you have seen the Soup Nazi ep of Seinfeld, that is kind of what Kyu (the owner) is like. Only answer when spoken to. He doesn't care if you don't like mayo when he is asking you if you want it toasted. Tell him about the meat and cheese and he will take it from there in the order that suits him best. Trust him, he's an artist.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-12", "description": "For a hole in the wall deli that only accepts cash, this place is amazing. I had a double meat - roast beef and turkey - medium sandwich and it was delish. Even though they were out of sprouts the bread was perfectly toasted, and all the ingredients were very fresh. They scoop the avocado right in front of you. There are also homemade meatball subs and lot's of salami, ect. For a heavy, fully loaded sandwich of this caliber I'll pay $9 anyday.", "author": "Nate S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-18", "description": "I think I probably ate 2 avocados today. I think that crazy workout/climb I had earlier was probably a good thing. \nMy friend turned me on to this place and suggested calling ahead to the order the sandwich so that there would be no long line waiting. She was right. \nThe line was long but our sandwich had just been made. I was kinda sad to miss the avocado show and see exactly how much was on my sandwich....\nThe sandwich (avocado and cheese) was toasted and melted  to perfection. The special sauce really was that special and made the sandwich. It was a messy, gooey sandwich; just what I like. \nMy \"new\" fav sandwich spot but I don't think I need anymore avocado for awhile...", "author": "Kelley D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-11", "description": "Convenient sub shop in the Marina, but if you don't have a lot of time, you might need to consider going somewhere else. When I went in, there were 3-4 people in line in front of me, and I was easily standing there for 10-15 minutes before my order was taken. That being said, the sandwich was delicious, and you definitely get your money's worth in terms of portion.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-25", "description": "This place for some reason makes a really good sandwich. \n\nI feel like the person who made it took extra care with the sandwich. He placed each filling so carefully and didn't cheap out on adding the avocados.\n\nOverall it was a good experience and the setting is great. If I want to hang out at the Marina my ritual would probably be to grab a sandwich here and then walk to Crissy Fields and munch on the sandwich as I look at the Golden Gate Bridge/People watch =)", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-04", "description": "BOMB!!!\n\nI love sandwiches, could eat them for every meal.\n\nMake sure to try the Italian. And don't be a weenie, get the LARGE. If you can't finish it, which is a hard thing to do unless you're starving, take half home and save it for later. Add avocado too and watch him dice it up. But don't get too chatty.\n\nAND THEY HAVE ANCHOR STEAM!", "author": "Mike B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-15", "description": "Tried this place out because of all the good reviews. I ordered the Italiano. The people who work there are very nice. The subs come with fresh ingredients and the roll is toasted. I ordered a medium and it was big enough to make me wonder what the large looks like. It was really very good and the price reasonable ($6.95). I asked for jalapenos, and, boy, i got them, aplenty. Luckily I didn't mind, but be warned.,\n\nThe only dig I'd give on the place is that the wait was long. I only had 4 people ahead of me and I waited 15 minutes before I was able to order.  There was only 1 person making the sandwiches. Nice guy, and a good multi-tasker, but...\n\nAlso, I wouldn't say its the best sub place in S.F. I would give Lucca's that nod. Especially if you like your subs more Italian than \"American\".", "author": "Rich M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-25", "description": "Rude people, dude makes sandwich without gloves on. And way too pricey for a sandwich!!", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-16", "description": "We stumbled upon this place after having ran the Lyon Street Steps. We walked in just to see what's up and what this place serves, and we were WOW-ed. The sandwiches the man (goes by \"Q\") was making looked extremely delish!! The set up is kinda like Submarine Center but Marina Submarine is a 2 man operation: one man (Q) makes the sandwiches and another man rings people up. \n\nThe sandwiches here are delicious but let me warn you about their size. If you're familar with Sub Center's sizes, let me do a quick comparsion:\n\nMarina Sub's SMALL = Sub Center's CENTER/SUPER\nMarina Sub's MEDIUM = Sub Center's SUPER (if not bigger)\nMarina Sub's LARGE = Can feed a family!!\n\nNo joke. The deli meat is the same, toppings, etc, but Marina submarine loads on the avocados and their bread is slightly chewier. I ordered a MEDIUM and quickly regretted it after Q started to pile on the meat & toppings.\n\nCome here hungry & leave rolling out the door...", "author": "Heidi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-26", "description": "I recently moved to San Francisco, and shortly found Marina submarine.  The sandwiches are the best, but the preparation is entertainment to the max.  I love this place and highly recommend it.", "author": "Dave H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-30", "description": "It's difficult to argue with a humongous sammie loaded up with fresh veggies, topped with sauce and toasted for only $6.50. \n\nThere are three sizes of subs, all of which seem to be ample. Traditional turkey, pastrami, roast beef, avocado or just cheese subs will keep things simple, while satisfying your hunger. The line can be a bit cumbersome, but tolerable. \n\nNo frills. Just large toasted subs, coke products and chips. Veggies were super fresh and I love that they have sliced jalapenos for a little kick. Take away is perfectly acceptable, and (personally) preferred since their chairs and floors look a little grungy.", "author": "Theresa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-19", "description": "After a few hours of climbing at Planet Granite, everyone was craving something good and quick.  While not the fastest service at a sandwich shop, this place certainly was goooood.\n\nWalked into a simple store with a couple of tables, put our things down and got straight into the line that was starting to build up.  Sadly, they ran out of hot pistrami, so I went with a Turkey Avocado sandwich.  I think they threw in a whole avocado which was pretty awesome!  I went with the large and got a few lookers wondering what I was thinking.  They've never seen me eat before.  That 10\" sando was pretty hefty, but I put it down now problem.  A good amount of it spilled onto the tray, but I made sure to eat it up.\n\nNice place to stop by when you're in the area.", "author": "Tom Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "One of my favorite sandwiches in San Francisco.  Everything about it is yum, yum, yum.  \n\n2 key points to note: 1) they come really large, so be prepared 2) there is only one guy who has the honor of making these sandwiches is SLOOOOOW, so be prepared to wait... or order ahead....", "author": "Addie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-30", "description": "sandwich nazi? hardly.\n\nthe sandwiches here are simple and with high quality ingredients. both the sandwiches i bought to split with a friend were toasted. probably the best sandwich on union street.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-14", "description": "I finally found ONE reason why I love working on Union st! Two words : Marina Submarine\n\nSuch a small sandwich joint that's so popular around here! I can't believe after 6 months of working here, I finally just made it here. AND I work right across the street! It's not the cleanest looking place but the hole in the wall places are the best places to eat and has the best food with a cheap price next to it. There's three different sizes. The small is about $5 and the largest is about $7-8? Don't really remember since I only paid less then $6 for a sandwich here.\n\nWhile I walked in with just one person in front of me, 2 minutes later, a line was formed behind me, and as I left, it was fully crowded! Poor man (owner), he's the only one working the sandwich line and there were way too many orders for him plus so much phone orders! One person ordered 9 sandwiches along side 5 other phone order tickets and 20 people in line! Poor guy, as long as he doesn't drip sweat into my sandwich, I'm good.. \n\nThe turkey avocado and cheese sandwich was toasted on a soft roll with plenty of their special spread, lots of whatever condiments you liked, PLENTY of turkey slices, and unlike a lot of other deli spots, LOTS AND LOTS of avocado. I swear, he sliced his avocado so precise and perfect, he just placed probably more then half of an avocado on the baby. I had chunks of fresh avocado all through my sandwich. And for around $6, I had two meals!!!\n\nBad thing, they take cash only and I usually only have credit cards so when I DO have cash and is working here, I go grab myself a big scrumptious sandwich! Just remember to come early before the lunch rush!!", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-02", "description": "BOO-YAH.  This place rocks. The unemotional sandwich artist/owner is a controlling genius. He cares about getting your order EXACTLY right, and the only way to do that is for him to do it himself, I could watch him make sandwiches all day long.  (the teenager who works there is only allowed to fill drink orders, answer the phone, and ring up purchases. The wait can sometimes be long, but ALWAYS well worth it. Go for the Italiano, heated, with everything. MMMMMMMMM-MMMMMMMMMMM-GREAT.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "Love this place! For value and an amazing sandwich, this is your place. As stated by the other reviewers, if you are a fan of avocado's it doesn't get better than Marina Sub's! You literally get an entire avocado on your sandwich. The bread is toasted to perfection and everything is super fresh.\n\nIf this is your first time, it can be a bit confusing with their random sign that doesn't really provide any indication what sandwiches are available. There is also an awkward silence exchange with the cashier, because she doesn't take the orders, the owner does. Its actually kind of entertaining to watch people stumble in not realizing this place has a reputation of deliciousness and turn around and walk out because of confusion.\n\nCalling ahead is probably the best if you don't want to wait in line.", "author": "Wendy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-12", "description": "This place was once part of a local chain of sub shops, until the owner sold them off 25 years ago.  Of those, only Marina Subs and Submarine Center still use the original menu, and of those two, Marina Subs gets the edge, for softer and flakier bread, and for truly masterful construction. No one, not even you, will ever care about your sandwich more than this man.  I once asked him if he ever let anyone else make the sandwiches and he said, \"There was someone ten years ago. Customers complained. Never again.\"\n\nHe is not the Soup Nazi.  He is the Sandwich Ninja.  \n\nOrder the Italian Combo with avocado and cheese, you'll see why.\n\nCash-only, obviously.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-03", "description": "Fact: Came to San Francisco for 5 days and ate at Marina's 2-3 of those days. \n\nBring a book, a knitting project and throw in a Gameboy for good measure because boy, you are in for a longggg wait. Everyone has the sandwich pangs at the same time of the day. Also bad timing for us, someone had just ordered a HUNDRED sandwiches right before we arrived and since the owner is the only one to touch the sandwiches, it took ages before the line budged. \n\nHe remembered my friend's order from 3 years ago when she visited every day after high school which is freaking astounding. Boar's Head meats, the freshest ingredients and a god-given sammich artist who could put SubwayQuizno's out of business if we could manage to plant a clone of him in every major city. \n\nOne commandment when inhaling one of this man's subs: thou shalt not waste the special dressing. When consuming the first half, open up the face of the second half below it so it can \"catch\" all the dressing from the piece you're currently eating. Then everyone is happy!", "author": "Faith Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-18", "description": "This place is probably one of the best sandwich places I've been to. It's one guy making all the sandwiches which I gotta give him props because it does get pretty busy. I'd give this place 5 stars if they didn't only accept cash but really that's not a big deal, also it is a bit pricey but you get what you pay for... a good sandwich.  I always order a turkey sandwich and what I love most is that avocado is only an extra dollar more and he is NOT stingy with it!!!!!", "author": "Sam G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-11", "description": "pretty darn good. not the best ive ever had though.\nspecial sauce wasnt 'out of this world' \nthe workers were very friendly \nthe place is really cute. \n\n(only had a sandwich but id like to come back and try some soup..)", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-07", "description": "I will fully admit that I get annoyed easily by rude people. You don't want to be that guy that stands too close to me on the bus or the girl who takes the elevator up one floor and causes the rest of us to be late. \n\nBut get this! Even after the Marina Sub Nazi barked at me to move over because I was apparently standing one inch too far to the left at the counter, I am STILL giving the place four stars. \n\nIt's also ridiculously slow and not all that clean - both very important things to me, but I still obsess over this place. Trust me, that is saying a LOT.\n\nMy go-to sub: A small, turkey with swiss, avocado, lettuce, tomato and special sauce.", "author": "Carolyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-12", "description": "I don't always give five stars, but when I do, it's incredible.\n\nGet the avocado.  At no other place will they give you a full avocado on a sandwich for $1.  \nMy staple is the pastrami with avocado.  Try it, you'll be glad you did.\nOh and call in before so you don't have to wait in line.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-28", "description": "The subs are awesome. If you like Avocado on your sandwich be sure to add it on here. They will put at least 1 while avocado on your sandwich more than I've received from any other sandwich place. The secrete sauce is great too. Bottom line give it a shot.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-01", "description": "I tried Marina Submarine for the very first time and was sorely disappointed. The prices are reasonable but sadly I likely wont ever return here at will any time soon.\nI ordered my usual  favorite: (simple) Turkey Breast sandwich and was so bummed out. The sandwiched lacked flavor and personality. The bread was nicely toasted but the ingredients, although (somewhat) fresh didn't really bring anything to the table. I felt like I could have made this sandwich myself had I just hauled my ass to the grocery store & picked up lettuce, tomato & onions. In fact I KNOW I could have made a MUCH better sandwich and I'll even add in an even BETTER secret sauce(!!)\nI didn't order cheese or extra toppings because I was hoping their \"secret special sauce\" would be enough to satisfy my submarine craving. It totally FAILED. The sauce was too watery and was more or less just salty water, w/ olive oil, vinegar and some random Italian spices thrown in. The sauce was so watery it basically soaked the toasty bread and made it super soggy which just made me turn into Oscar the Grouch w/ a long faced ugly pout... \n\nI SO wasn't prepared to eat a crappy sandwich on such a beautiful sunny day... \n:(\n\nI will NOT be coming back...!\n\nOh & FYI, \nThe Sandwich Spot \nwww.sandwichspotsf.com\n        & \nIke's Place @ 3489 16th St. IS SOOO MUCH BETTER!!", "author": "Karen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-08", "description": "Best Submarine Sandwiches in San Francisco, in my opinion.  Great quantity and quality for the price. Parking is terrible, though. You'll be lucky if you park within a 6 block radius.", "author": "Josh J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "Last night I dreamed I was eating one of their perfectly toasted sandwiches (pastrami and swiss, everything but mayo).  This time though, there were avocados.\n\np.s. Cash only.  \np.p.s. there is hardly a wait if you go on weekday before 12:15pm.  After that, you might wait anywhere from 5 minutes to thirty minutes (i've never eaten here on a weekend so I don't know how long the wait is then.)", "author": "Tangerine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-08", "description": "Four 1/2 stars due to small selection.\n\nI never heard of this place until today.  I was walking around the Marina today and wanted to pass by my dearly departed Great Aunt's flat on Pierce Street.  It's yellow shingle, versus the dark brown I remember.  I wonder if the house still has her \"lazy Buick\" installed?  As I was crossing Union Street, I saw this line out of a corner store with \"Submarine\" on the awning.  I couldn't pass this up, as the line was out the door.\n\nWhile waiting in line, I could not decide from anything on the menu, even though there's only about 8 sandwiches to choose from.  I chose to get 2 of the Italiano, which has three kinds of meat.  (mortadella, salami, capicola maybe, and provolone).  While the menu does not say the subs come with mustard, everybody who ordered one did.  It was actually pretty good, and give it a good spice.  I would never think to have mustard on an Italian sub, but this might change my mind.\n\nAl subs come with tomato, onion, lettuce, \"secret sauce\", mayo and mustard.\n\nAnyway, it rivals any sandwich I've ever had.  Maybe a list is in the making?  The subs are toasted in a Bakers Pride oven.  The large is 10\" long, but I wonder what they do with the left over two inches that's cut off?  Who's going to order a 2 inch sandwich?  \n\nThe guy is the fastest I've ever seen pitting and slicing an avocado, and laying it neatly in even slices on some sandwiches.  Less than 10 seconds, and it's all done.  Perhaps he worked at Benihana in a previous life?\n\nCash only, and vegetarians will have only one option.  A Sprout and Avocado sandwich, with all the trimmings.  I honestly felt some kind of euphoria after eating one half.  The other half is in the fridge right now, and NO, you cannot have it.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-21", "description": "Best Subs/Sandwiches of any kind in town! The man behind the counter is about as high quality as you get in life. I have been eating at \"the sub shop\" for over 15 years of my 23 year life and I have yet to be let down. Good selection, quality ingredients, perfectly toasted bread, and the secret sauce have kept me coming back for years. Just order avocado and watch a master at work. I take all of my friends here and I have never had a friend make a negative remark. Enjoy.\n\nYou know a place is good when people come on Yelp for the express purpose of tearing a place down and complaining about how \"they've had better.\" The service is slower because you have an artist making a sandwich. Don't go to Danko or Turtle Tower and bitch about the wait.\n\nIf you come here on a sunny weekend day at lunch time you are going to have to wait. It sucks, but it's just how it is. The guy is a legend.", "author": "Sven S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-18", "description": "Actually, it is NOT worth the wait!  The OWNER/SERVER makes his sandwiches after counting cash and operating the register without WASHING his hands.   While customers wait, he lambastes the 14 year old clerk for \"not charging for cheese\".\n\nThe reason the wait is so long is because this prick is too cheap to pay for more minimum-wage help.  Ever heard of \"Marketing Myopia\"?  This guy can't find anyone to work for him.\n\nAfter completing this review, I am filing a complaint with the San Francisco Health Department!", "author": "Hank S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-06", "description": "Just moved to the neighborhood.  The apartment?  Windows don't open, rats in the walls, and no closet space.  The selling point?  Two blocks from Marina Submarine!\n\nThese are the best damn sandwiches I have ever had!  Although I have tried about 2/3 of the menu, I cannot seem to convince myself that there is anything better than a regular, Turkey, Swiss, Avocado, with lettuce, tomato and sauce.  \n\nThe amount of avocado that goes on a sandwich is incredible.  My GF gets an Avocado Sandwich, which is the only all veggie sandwich.  A small gets two whole avocados!  \n\nYes, on certain days there can be a wait.  Big Deal!  If you are in a hurry, plan ahead and call it in.  No Place Better!", "author": "Hugh B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-04", "description": "Being from Philly, I knew I would have to forfeit some things when I moved to the west coast: great pizza, Pat's cheese whiz cheesesteaks, and of course, good italian hoagies...or so I thought.  \n\nWhat? You don't know what an italian hoagie is?  If you want to get some idea, go to Marina Submarine and get the italiano sub sans mustard. (Mustard on an italian?  What's up with that? -1star)  Whenever I get homesick, that's what I do.\n\nTheir rolls are the best in the city and the guy that makes the sandwiches has it down to a science! Pickles are great too!", "author": "Erin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "This is a fantastic place to get a sub if you ever find yourself in the yuppiest part of the city.  It's a total hole in the wall, but with a solid selection of sandwiches and a freezer full of gelato.  There are only two choices of bread (white or wheat), but each sandwich comes in 3 different sizes ranging from 5\" to 10\" (maybe it should be Castro Subs, hmm?).  The ingredients are all fresh and your sandwich comes absolutely STUFFED with them.  In fact, if I have one complaint it's that they slightly overstuff your sub, making it somewhat difficult to eat.  But that's tough to bitch about when you're eating a nicely toasted sub stuffed with meat, veggies, and a whole (!!!!) avocado.  Yes, he slices up an entire avocado and puts it on the large sandwiches, which are plenty big for two people to split.  \n\nTo sum up:  Big, tasty, toasted subs and gelato.  Oh, and they serve beer.  Keeper.", "author": "matt c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-03", "description": "So this owner dude does it all.  Yeah, the lines can be long.  The wait can run a clock to dead batteries.  But still, the sandwiches are always fantastic.\n\nWhat trips me out is owner-dude has like 2 or 3 helpers but nobody ever, EVER, gets involved in the sandwich making process.  The help answers phones, or rings up customers, or just watches the samurai warrior at work.  Seriously...he weilds his knife like a sword, he cuts his avocado's with precision.\n\nMy fav is the \"cooked\" pastrami with avo & jalepenos.  I'm not talking about Louis Rich pastrami.  This guy cooks it daily and it usually runs out by Noon.\n\nThey are pricy but if ever a sandwich was worth the dollars, this is it.  Keep swinging your deli-knife you bad ass sandwich making warlock!", "author": "Pete M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-02", "description": "Do you like sandwiches?  Do you like them so much you will wait 25 minutes in line for a soggy Hoagie not even that loaded w/ Turkey Roll, Avo and some squirted on special sauce that ain't so special?\n\nBullcorn.  No one should like sandwiches THAT much.  \n\nOoooh, I gave the beloved Marina Subs a 3 star.  Oooooh....  Watch me get blacklisted.  Ooooh... I am so afraid.", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-02", "description": "I've been known to get in a car and drive all the way over here from the Financial District during lunch just to get one of these subs.\n\nIt's a testament both to the yummy goodness of Marina Sumarine as well as the total shitfest that is the Financial District as far as great subs go.\n\nEither way, It's f'ing good.", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-15", "description": "In a city where great sandwiches are not among the finest foods San Francisco has to offer, Marina Subs brings the game to a whole new level, putting the City by the Bay on the sandwich map.\nI've been coming here for 24 years. It's hard to say what makes Marina Subs sandwiches so good-- the meat is great consistently, tomatoes are among the freshest in the entire city, melted cheese is heavenly, and the not-so-secret sauce rounds out these gems-- but all I know is that when I meet people from outside San Francisco who once resided in SF, I ask them \"do you like Marina Subs?\" Their answer determines how cool they are. \nPlus, I generally see people with whom I went to high school when I go here, which is both a bonus and a drawback.\nIn short, freakin' amazing.", "author": "Ross S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-16", "description": "After reading about all the hype and only trying the gelato floats here..I decided to try their subs!\nLuckily Sunday during lunch, there was not a huge line and we only had to wait just a few minutes for the \"master sandwich  maker\" to take our order and make our subs. \nI tried a small Atomic sub that had massive amounts of meat along with mayo, lettuce, and onions (I declined peppers). The Atomic was very good, my boyfriend commented on the good quality of meat which I could also taste. Sub had alot of great flavors and was definitely fulfilling even for a small size!\nA small Atomic cost $7.95, but was well worth it for the size and quality. \nIt was funny coming here since I told my boyfriend to just order and not try to make small talk with the sandwich maker so he could focus on what he was doing. When he tried to the guy nearly ignored him and continued only making sandwiches, haha.\nWouldn't mind returning if I was in the area", "author": "Miss H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-21", "description": "This place is great, the man behind the counter has got the whole scene dialed.  The consistency is so good b/c only Mr. Marina Sub makes these beauties.  What you get is:\n\na.  A lunchtime line ranging from 'bearable' to 'i need to start thinking of excuses to tell my boss b/c i've been in line here for 45 minutes'\nb.  The most avocado I've ever seen on a sandwich in my life if you dare to order it.  (I saw someone get a veggie sandwich, including 2 1/2  whole sliced avos on a single sandwich - sheesh)  Just know what you're getting into, that's all.\nc.  One of the best sandwiches I've had in the city.\n\nSome comparisons to the soup nazi are inevitable as there is a fairly specific routine and the sandwich artist can come off as gruff, but it's all part of the experience.  Occasionally I see people rehearsing what they are going to order before they step up, not a bad idea if you get stage fright.\n\nGreat prices, helpful brodies running the cash register, this place can't be beat!", "author": "Mike B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-02", "description": "So I have been to Marina Submarine a few times now, and I have enjoyed it. I have been very lucky, in the fact that when I have been here it has not been too busy. Place is pretty simple and seating is pretty tight, so I usually like to just grab my sandwich and  take it home.  \nFYI, Cash Only!", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-15", "description": "I usually prefer not to eat sandwiches on the weekends because I eat them pretty much every damn weekday; however the bf had a craving and wanted to try this place out. I refused to order a sandwich and decided to get a cup of yogurt nearby instead. When we got home, the medium sized italiano sandwich he bought was massive...whoever made it stuffed the living crap out of that sandwich.\n\nI went on to take a bite since the yogurt wasnt too satisfying..that one bite ended up being half the sandwich..I would have eaten the other half if he hadnt finished his yet..it was LITERALLY the BEST sandwich I have ever eaten in my life...no joke...", "author": "M W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-12", "description": "I grew up in Philly, so I have higher expectations than most, but the logo \"the best subs in the city\" was a draw.  Unfortunately, these guys just throw meat on bread...  Horrible.", "author": "C F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-15", "description": "I've been going to Marina Subs since I was about 10, maybe even younger; I just can't remember. I absolutely adore this place - the sandwiches are simple, tasty, fresh and never change! Maybe I'm just nostalgic for those days we used to creep away from Hamlin and get a sub. Either way, it's not to be missed if you are looking for a good toasted sandwich. \n\nJust one little issue - the lines can be terrible. If you don't want to wait for 40 minutes for a sandwich you either have to eat lunch at 3pm or you'll have to find another spot.", "author": "Zoe K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-16", "description": "It's tough to score a decent sando in this city, and especially difficult to find a sub place that knows how to make a great hot turkey with melted swiss. \n\nSee, I like my turkey subs with all the fixins', particularly with some oil and vinegar on top. However, if the bread is too toasted, it can't absorb enough of the oil and vinegar, so it ends up getting all over you and your clothes. Oil is a steely bitch to get out of clothes. In fact, I don't think it's possible. \n\nMarina Submarine does a quality, top-notch job of balancing toast action with proper O&V dispensation.  Solid. \n\nBe warned, however, this is THE stop off point for a number of middle to high schoolers after they get let out back onto the streets. You can expect a good, long line if you get the timing wrong in the afternoons. \n\nMy only complaint / suggestion is that they should post their phone number on their shop sign so, if you happen to be driving by looking for a parking space, you can call in your order to save time (see above paragraph re: those krazy kids).", "author": "Hannah Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "So so so good. My two sons have lived in the area for a few years and every time in in town, they want to go here for lunch. If you love avocado, this is your spot!", "author": "Tami G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-27", "description": "Ate here today. My friend who's been coming here for over a decade brought me. Long line but worth the wait! An exercise in patience is not the worst thing. Watching the guy make a sandwich is like watching art-mesmerizing. And they are not stingy with the avocados! My turkey avocado was delicious and it's just what I needed. Have definitely added it to my list of go-to food spots in the city!", "author": "Jilleen l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-07", "description": "THE BEST SANDWICHES ANYWHERE!\n\nI used to live catty-corner to Marina Sub and can honestly say these are the best subs I've ever had.  My favorite was the cheese steak (not traditional, but roast beef and cheese).  The owner is truly a sandwich artist!  I now live in Southern California, but I make a point to hit Marina Sub anytime I'm back in SF.", "author": "Jason F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-04", "description": "There is nothing (and I mean nothing) better than a sunny Sunday afternoon at the Palace of Fine Arts, watching brides decked out in design travesties taking wedding photos, while munching a sub from here and telling yourself over and over again that you will never, EVER, make your bridesmaids wear lavender.  Seriously.\n\nI could watch Q cut avocados all day long.  He doesn't even look down at the avo when he's cutting it.  EVER.  its mesmerizing.", "author": "Erika C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-28", "description": "I must pay homage to the Sub Nazi! He is a perfectionist. His sandwiches encompass the perfect ratio of veggies to meat to cheese all hugged together with crusty bread that's crisp, but doesn't tare your mouth apart. \n\nI see this guy every morning setting up his store with meticulous care of all the produce and meats. Say what you want about his repremending. If you want perfection, then get with the programe.  Everything is consistent and strategical placed. I think the only thing that changes is the register guy. I can't imagine they last very long.", "author": "Erin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-29", "description": "My guy went to grammar school at a Catholic church up the street and swore this place was heaven.  \n\nWe strolled past his old school-yard as he recalled his boyhood days of mischief.  When we reached the door of Marina Submarine, the line was about 3 deep.  We also realized a sign that said \"cash only\" so we wandered down the street to an ATM.  By the time we got back, the same 3 people were there--along with another 2 or 3.  One of us should have just waited there!\n\nYea, the wait was long.  But the guy who put together the sandwiches was great.  Not personable, maybe, but really attentive.  There's just the one guy doing the sandwich and a kid running the register.  Most of the time, people are just waiting for the sandwich guy and the kid looks like an ass milling around on the side doing nothing.  Not his fault, I guess.\n\nMy turkey sandwich was good.  The special sauce, while not super special, does seem to make the sandwich.  One note though:  the roll gets VERY toasted.  So toasted, in fact, that the roof of my mouth was ripped for a week.  I need to remember to make a special note of that the next time I go (I've forgotten the past few times).  \n\nI think it's good.  I don't think it's great.  Don't try to park nearby.  Definitely stop by though.", "author": "Melissa Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-30", "description": "This is definitely the most non-marina joint in the marina. What? No black puff vests in line? Well it was raining, guess they needed the protection of sleeves. \n\nMaybe I give this place a 5 star rating because I was really hungry like a new born for the milk of a teat. Maybe I was caught up in the moment while sinking a sub in the rigors of battle. Wait, the sub was last night's dream and I had my teat milk earlier that morning, made from powder of course. \n\nYeah, now I remember... It was the scrumptious river of homemade tomato sauce flowing down the sides of the mountainous meatball sandwich like molten lava spewing from the Sicilian volcano Mt Etna. The tasty sandwich roared. Tangy tomato sauce poured down the  slopes of the soft sweet roll and threatened the safety and crispiness of my chips below that were bracing for the worst like the villagers of Nicolosi, but my cheddar sun chips did not run as they wanted to bask in that explosive goodness too.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-26", "description": "Here is the deal.\n\nI would give this place 10 stars if I could. This is definitely a place where you will come hungry and leave very VERY happy.\n\nAtmosphere:\nYour typical look sub shop except these guys serve beer. Bonus. The Sub Master behind the counter is always there slinging subs- he works at his own pace so you have to just go with it. \n\nSuggestions:\nCome here at least twice. 1st time, you have to experience the pace of the Sub Master and be a witness to his expertise. The wait is long, so be prepared. You will be satisfied.\n\nFor the 2nd time- CALL AHEAD. You get the great taste without the long wait. Give it about thirty minutes before you pick up.\n\nParking:\nThere is none. Bus 45 takes you there or drive with a partner so they can jump out and pick up while you circle.\n\nTIPS:\nGo next door and get a cupcake for dessert.\n\nDon't pay attention to anyone who gives this place less than 5 stars. \nYelperific!", "author": "Aaron A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-24", "description": "Been coming here forever. Great food at an even better price. Portions are huge, fresh food, tasty and fulfilling! Best deal in the marina. Worth a visit. \n\nCheck your attitude at the door. If you are too important to wait that long for a sando, then just call ahead and it'll be ready when you get there. Don't expect anything fancy. It is what it is, a good plain deal on good plain food.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-10", "description": "Delicious! I especially enjoy the Italian Combo, which is a perfect blend of   meats, including salami, plus your choice of cheese, lots of sauce (Italian?), all of which is toasted to perfection.\n\nI believe there is ONE and only ONE guy who makes the sandwiches here. (To ensure taste and quality?)\n\nBetter to phone ahead, or you might cry.", "author": "Tina J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "Best subs in Marina.. Don't miss it! Beat the lunch HR lines ..", "author": "Avi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "I came here today around noontime after hearing that this was THE best sandwich shop EVER. It was definitely very delicious and very hearty. \nAs others mentioned, there was a line but it moved along efficiently. They use quality ingredients and are incredibly generous with the portions. \nSize references:\nSmall - 5\"\nMed - 7\"\nLarge - 10\"\nbut to me the large seemed even bigger. I think it may have been the biggest sandwich I've ever had.\nThree things that makes Marina Submarine stand out FAR beyond their competition:\n-the man behind the counter making the sandwiches is like a ninja swordsman artist all wrapped into one. He uses 1 knife for everything (watch him slice up avocados, you'll find yourself staring in awe) and is truly the sandwich master.\n-avocado! I saw him slice, scoop, and set an ENTIRE avocado plus some on my sandwich. fantastico, i tell you!\n-bread was not soggy even after dressing. Over saturating the sandwich in dressing making it soggy is one of my pet peeves. The italian dressing here is addictingly  good and the best thing is that enough of it is used for sufficient flavor, but it doesn't feel doused leaving a perfectly crispy (soggy-less) bun!\nNom nom nom.", "author": "Patricia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-29", "description": "Please go right now!  People have recommended this place to me for so long, and I am mad  that it took me this long to try it out.  Definitely add avocado and cheese, it is so worth it.  The bread is so soft and warm and fresh.  The italian dressing they put on it is divine.  Go now!  I promise you'll enjoy it.", "author": "Caitlin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-05", "description": "If you want to wait a million years in line then this is the place to go. There is only ONE sandwich maker and I swear he never smiles. Even if there is only one other person in line in front of you, be prepared to wait at least 10-15 min. Granted, the sandwiches are good but I'm not one to wait especially when I'm hungry. Sandwich maker NEVER smiles but the cashier person is really friendly.", "author": "A W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-10", "description": "I eat here 3 times a week MINIMUM with my homie Nick Bea.\n\nHere's all you need to know:  Italiano. BOMB. tuna. BOMB Meatball. BOMB. Roast Beef. BOMB. Turkey. BOMB MOTHER ******.COM\n\nHands down addictive. stop complaining about the wait and call ahead trolls. This is the best damn sandwich you've ever had.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-21", "description": "good stuff.  cash only though.  no printed menu, but i uploaded the pics.", "author": "Isabella F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-23", "description": "Holy Underwear!\n\nFinally a good sandwich shop in SF that doesn't cost $10 or more.  And I mean you get more for what you pay.  Get anything with avocado in it, the sandwich maestro will throw in a whole friggin avocado across your sangwich.  In my book, that means love, my friend. \n\nI can't give this place a 5th star though, cuz the line is ridiculous, anyone who orders by phone gets priority, and they didn't have any chicken salad.  You're lucky your sandwiches are good, damnit!", "author": "Zo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-07", "description": "Walking down Union St. to Steiner, you can smell a mix of meats and sandwiches roasting. Right there on the corner is a small shop covered with primary red and yellow paint. (It looks more like a hot dog stand or Ronald Mc Donald's house on the inside.)  On one side of the counter is where the sandwich magic happens and the other is where you pay. \nYes, the girl at the counter is half out of it, but overall genuinely friendly. They need those signs that say \"order here\", \"pay here\" because I had no idea I was supposed to tell the guy what to make instead of the girl at the register. \n\nMy order: A medium(7\")  Italiano sandwich with peppers and everything else. This was by far one of the best subs I've had in a lonnnnng time. They are most generous with the meat and the sandwich tastes fresh, unlike some places where I think I'm eating ingredients that have been in a freezer for half a year. \n\nBeware: The sandwiches can be a bit messy, so don't wear white or take a date here.", "author": "Sherese E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-09", "description": "Full disclosure: I've been coming here for over 20 years so this review is possibly subject to extreme bias colored by nostalgia. Here's what you should know. This place makes fantastic, no nonsense, non-gourmet, traditional deli subs. I've read peoples' gripes about the ambience. It's a deli. It's not Bouchon Bakery. I've read their gripes about the service. Don't go for the service. Go for the awesome sandwiches. I've seen their posts about the soggy bread. It's a sub. They put dressing on subs. Dressing is comprised of 97% oil and vinegar. Here the other 3% is comprised of pure, delicious magic. Dressing makes bread soggy if you attempt to take it to the Marina Green to have a picnic. Don't take toasted subs with dressing very far away to enjoy. But DO get yourself over to Marina Submarine for some tasy, tasty toasted subs. And don't forget to add the avocado!", "author": "Sebastian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-06", "description": "Marina is a good place for subs.  my friend Dan calls sandwiches sarnies-- so i will call them that too.  he is British and of course everything is different on the other side of the pond.  i must say i love the sarnies in England--nicer than the sarnies in the US.  but Marina Subs is a good place for a custom made sarnie. \n\nBuen Provecho!", "author": "Jaime Patricio M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-05", "description": "More of an icon than a great eating place.  When the line gets out the door you can be in for a 30 minute wait.  You can't rush the master though.  Just watching him cut the avocado can be worth the trip.\n\nI'd warn against the atomic sub for anyone on the fence.  you have to be seriously prepared to down that thing.", "author": "jeremy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-30", "description": "I was pleasantly surprised when I rolled into Marina Submarine and realized it had the exact same menu as Submarine Center in West Portal! Woo woo!\n\nBut I do have to admit, I was a bit disappointed. Fairly predictably, I ordered the hot pastrami sub. But this pastrami had SO much fat on it - at a certain point, I just began stripping the fat off. Ew. My friend informed me that some people like the fat...I suppose I'm not one of those people.\n\nWhatever that special sauce is that they use - keep it up! I'll still be going back, but maybe I'll opt for the turkey sub next time. \n\nOh yeah - they're incredibly generous with the avocado!", "author": "Dalia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-22", "description": "This place is what Quizno's goes to bed and dreams about becoming when it grows up.......if it's lucky.\n\nThe bread is top notch, they don't skimp on the meat, and the sandwich is toasted to perfection.  I refer to the guy who makes the sandwiches as the \"Sandwich Ninja\".  If you've ever been there, you know exactly what I'm talking about.  He wields his ginsu knives and slices, dices, and juliennes.  And don't even get me started on his precise ninja abilities with avocados.......it's a thing of beauty.\n\nThe only complaint I've got is since it's only one guy making ALL of the sandwiches, there can be quite the wait, which can be a pain in the ass when I'm in a rush.  But otherwise, this place rocks.", "author": "Norm U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-19", "description": "You can't beat large traditional subs at cheaper prices than anything else you will find in the area, fresh ingredients (though, simple-- just the basics but they give you a ton of it)-- no fancy ingredients like different bread choices or specialty cheeses/meats, but what they do have works fine.\n\nIt seems like the owner/sandwich maker won't let anyone make sandwiches so the line gets really long and moves incredibly slowly during lunchtime.   Cash only.\n\nGreat value and taste!!", "author": "James B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-22", "description": "Every time I come in here I see nothing has changed except for the skinny high schooler behind the register relegated to that area. That is comforting for sure. Q is not only an artist but a friend. He remembers my order (and makes fun of me for not getting condiments, etc.)  and asks how my family is. I had never tried coming here prime-time on a weekend but recently I forced myself to put the number in my phone because the wait was excrutiating. No problem. It's worth it to me. \nI think I've had the same sandwich here for 16 years or so. I think I can now move to a different one. I've heard the meatball and hot pastrami are money.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-09", "description": "Ridiculous knife skills, get in line and watch this guy cut avocados and pickles.\n\nExpect to wait 1 hour plus for a sandwich, but it was worth the experience.", "author": "Chris A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-25", "description": "Best Avocado Sub in the City.  Hands (drenched in special sauce) down.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-22", "description": "I am a Marina Subs convert...\n\nI never liked this place...thought the sando's were soggy and plain...the trick is to forego the sauce (or get it on the side) and put on your own mustard when you get home...unless you like the plain yellow kind.  \n\nNow Im a huge fan...great sandwiches and theyre reasonably priced...but dont expect to get any exotic combos...its pretty much a turkey, ham or salami kind of place...", "author": "Ken S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-12", "description": "Go-to sandwich: small turkey sub with provolone, avocado, jalapenos, and everything except mayo (everything = lettuce, tomato, onion, mayo, mustard, italian dressing).\n\nCost: $6.94\n\nPros: \n- Toasted!\n- Avocado madness - he puts an entire avocado in your sandwich\n- Loads of lettuce, tomato, onions. It's like getting a side salad.\n- Big and filling\n- They have a bunch of copies of The Onion\n\nCons:\n- Bread is nothing special\n- Overstuffed; sandwich often falls apart\n- Whenever I ask for \"a little bit\" of jalapenos, I always get a ton of them, so I stopped asking for \"a little bit\" and end up picking a bunch out before eating my sandwich.\n- The wait can be heinous if it's busy. I suggest calling ahead.", "author": "Ranjit S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-08", "description": "Five Stars for the FOOD....but 3 Stars for the LINE. Here's the deal with this place. I've been going here for 16 years. It's one of the best sandwich places in the City. BUT....there is NO help for the owner, just him cutting avocados about as slowly as one can possibly cut an avocado. Typically just one stony high school kid, who runs the cash register, helping this guy out. He is SO nice, but so damn slow, it's painful. What this means to you is that you will wait 20 minutes for a sandwich, but it's a damn good sandwich...all of them. Toasted bread, home made meatballs etc.", "author": "Dan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-28", "description": "These sandwiches are awesome. My wife brought me here after telling me for a long time how great this place was. She was not lying. The owner makes every single sandwich himself and it shows how much he cares. The food is awesome, prices are cheap and the portions are huge. I always get a sandwich from marina subs when go up to San Francisco", "author": "Adam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-04", "description": "The only reason they don't get 5 stars is because of the customer service. The older Asian man pretty much threw my sandwich at me, but it was still an amazing tasting sandwich. \n\nI ordered ham and cheese. It was very good. The pickles were .50 cents extra, but once you realize how many pickles you get you'll understand. They are amazing. If you're a wheat fan like myself you're going to have to settle for sliced bread, but not to worry it's fresh. For $8 you can enjoy a small sandwich, bottled drink, and chips... very affordable for the Marina district. \n\nSo don't expect the best customer service, but do know that you'll leave happy. \n\nCash only! \n\nps. if the young guy that works the cash register reads this please note that you were very nice. I'm talking about the \"master\" sandwich maker. Poor guy.", "author": "Shel Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-16", "description": "Best Sandwich I have ever had.  Use the bathroom before you go, because they have none.  I had to duckwalk over to Rosies across the street and use their restroom.\n\nWhen I cam back my Italiano was ready.  I'm more of a turkey guy...but this concoction of salamis and Italian cheeses was delish.  I saw ridiculous amounts of meat, avocado, etc...going onto other sandos being made.  This place is epic, and very cheap considering the amount of product that is going on the sandwiches.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-26", "description": "I'm a big fan of italian subs so when I saw this place, I thought ...oh yeah! This is going to be great! I go in and I saw the lay out of cheeses and meats and thought to myself, I'm going to probably have a tummy ache after I leave here and it's going to \"hurt so good\"...well first the attendant just stared at me for about 4 minutes, didn't acknowledge me, just stared as if he didn't want me there, well too bad buddy I want a sandwich, so finally he decided to take my order and I told him what I usually liked, he said I should try the Italian Combo, so despite the subpar service that I received up to that point, I  decided to listen to the guy. He gave me a sandwich with beef and sausages that was just YUCK~\n\nJust a couple bites and I didn't even want to stay, I needed to buy some chips to eat and get the sandwiches taste out of my mouth. I'm usually known for giving a restaurant several chances but the subpar service and sandwich has sunk any chance of me going to this submarine shop again.", "author": "Troy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-18", "description": "Hands down best subs I ever had. Yeah the wait is long if you just drop by, but I personally dont mind waiting for a 5 star sub at all.\n\nSubs are fresh and delicious.\n\nGirl behind the counter is such a sweetheart and is relly helpful.\n\nThe guy who makes the sandwiches is wicked with a knife but also really friendly.\n\ntip: call in order- it helps.", "author": "Jynni T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-08", "description": "This quite possibly could be the tastiest sandwich i've had outside of Potbelly's in Chicago.  Why are there no potbelly's out in SF?  Ok, I digress.  The meatball or turkey and avocado are delicious. \nFood - 4 Stars\nService - 3 Stars.  Today I placed an order and was told 10 minutes; showed up 15 mins later and the sub was still not ready.   Only one guy in the place is allowed to do anything...and they close at 4!  I certainly be here 2-3 times a week at night if they stayed open.  I guess it helps I live across the street.   If you have a few mins to wait and you are shopping on Union, I would certainly add this shop to your destination list.", "author": "Ben R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-15", "description": "HUGE fan.  this place makes the best sandwiches, and they're massive.  The line is long, the wait is long, owner isn't the nicest bloke, but who cares?  It's just that tasty.\n\nAs for Eric S with, like, the only bad review....time to change your tampon, dude.", "author": "david s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-19", "description": "I came here on a Sunday at 11:30 am and there was no line. Probably because everyone else was waiting for a table at Rose's Cafe across the street for brunch. In any case, I was in the mood for a sub and this place delivered it. I had the turkey breast with the \"special sauce\" (is that just italian dressing??) on a warm, toasted sub and it was delicious!", "author": "Helen Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-22", "description": "I love the way this guy abuses his teenage labor.  He won't let them make sandwiches, and he barks orders at them like they were lesser forms of life.  Quite humorous.\n\nRiddle me this:  How can the sandwich guy work so fast, yet provide the slowest sandwich making experience in the city (with the exception of Rutily's)?\n\nI think he needs to hire me as an ops consultant.  A little que theory and work flow maximization, and he could turn those sando's OUT!", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-23", "description": "Best sandwiches EVER. Every time I get a tuna sandwich with avocado, lettuce, tomato, mayo and mustard -- toasted, of course. I don't know what Q does, but it is like a magic explosion in my mouth. So tasty, and completely worth the insanely long lunch line. I try to go during off times though, as to avoid the line. \n\nI have a habit of arriving just after he closes, and I am consistently heartbroken.", "author": "Elly F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-24", "description": "Best East Coast or West, \nFinest submarine hands down, \nAvocado slicer.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-05", "description": "Love their meatball sandwich!!!  A must try.\n\nThe service is not the best BUT i can deal with it since the sandwiches are too die for.", "author": "Unique t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-03", "description": "This place is delicious! Perfect little hole-in-the-wall sub shop in Cow Hollow.  I only give it 4 stars because the table area was a tad messy and only takes cash. But I highly recommend and can't wait to go back!", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-08", "description": "Maybe it's because I'm a vegetarian, or maybe its because I really wanted a Freddie's sandwich, but they were closed for the holidays, but my avocado sandwich was better than what I'd find in LA, but SO NOT FREDDIES!!!  \n\nWhere are the hard sourdough SF rolls Marina Sub?  Not even dutch crunch?!?!", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-03", "description": "Fantastic subs, as great to eat as they are to watch being prepared.  The toasted bread, sauce and avocados make it special, but every sandwich stands on its own.  The wait can be long, but it is worth it.", "author": "Rich C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-16", "description": "I've been eating Q's subs since I was a youngin'. He slices avocado like a ninja.  Best subs ever.", "author": "George P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-17", "description": "Decided to give this place a try after a friend of mine told me he visited it on a regular basis while growing up. I stopped by on my lunch break and watched the owner prepare my roast beef sandwich by adding all my ingredients as if there were no tomorrow and toasting my sub bread w/ care. I was surprised at how generous he was with the toppings, as most places can be a bit stingey.\n\nOnce I was back at the office and had the chance to sink my teeth into that beast of a sandwich, I was in pure heaven. The bread was nice & toasty while still being soft in the middle and didn't include that stanky smell that Subway's subs tend to have. Also, the meat wasn't excessive like Togo's, but was juuust the right amount, balancing out the sandwich toppings.\n\nThe only cause for lack of a 5th star is because I tried their chicken salad sandwich the other day and wasn't much of a fan of the chicken since it tasted pretty spongey. I think I'll just stick to their sliced meat sandwiches and will be giving their meatball sandwich a try since it looked mighty tasty.\n\nThe ambiance is a bit depressing w/ bad lighting and an old skool menu that has poorly concealed menu items & prices (it looks as though they used random pieces of paper to do their cover-up work). However, I doubt many come here for the ambiance.\n\nThis place knows how to get the job done in terms of serving up some dee-licious sammiches! It looks like I'll soon become a regular!", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-12", "description": "If you go here, you've got to say hi to Tony, the owner who's been there pretty much my whole life.  Another SF quiz question based here -- what's on the ceiling of Marina Sub?  (Answer at the bottom of this review).  Years ago (like 20+) this was a Mr. Sub, and the sandwich board is, I believe, a relic from that time.\n\nThe best things about this place: more avocado than you can shake a stick at (and Tony's the best avocado slicer I've ever personally borne witness to -- watch and learn!).  They've had a toaster oven for their sandwiches since the beginning, before those other el cheapo sub chains even existed, and they use it to good effect.  The cheese is high-qual.  They've got ice cream and a wide assortment of chips including Funyuns.  The classic Sub is a favorite; for a long time in my childhood I also ate Italian Beef regularly.  My girlfriend is partial to the Turkey Avocado.  Oh, did I mention the excellent oil and vinegar dressing they put on the sandwiches?  Drippy and messy but worth it.\n\nIf you come in the afternoons on a weekday be prepared to see a horde of local kids from Hamlin, Town, UHS, and Sacred Heart in line, and let me tell you, they don't leave hungry.\n\nLast time I was there, I was eating a huge Atomic Sub in the window and a couple walked by and the guy did a stop-and-stare, head-turn as he walked around the corner, infatuated with my sandwich in a manner usually only seen when a guy is reading an article on Jessica Alba in a bikini on The Superficial.  I almost blushed, I was so embarrassed.  But it doesn't stop there!  He grabbed his girlfriend and popped in and asked me what I was eating, if it was good, and then got in line.\n\nWhen I think about going to eat in the Marina/Cow Hollow area, this place is right at the top of the list.\n\nAnswer to the question at the top: a playing card, I think it's a 10 of clubs but come to think of it now I can't quite remember.  Tony said there used to be another but it fell down, and they were there when he bought the place and he doesn't know much more than that.  I guess I'll have to go back soon and figure out the specifics again!  Lucky me.", "author": "Walter K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-09", "description": "I'm in awe of the sprouts and avocado.  Not because of any sprouts (the sandwich maker will often forget them), but because of the unreal quantity of avocado they manage to spoon into a sub.\n\nThe lines are long and service slow because the owner refuses to let anyone other than himself make the sandwiches.  This leads to high quality and slow speeds.  When it comes to sandwiches this good, I'm willing to wait.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-11", "description": "this is the one place in the city where you get a really really good sub. The bread is toasty, and the lettuce and onions are so thinly sliced the taste fuses itself with the meat and explodes when you take a bite.\n\nThis place is like... sacred sandwich making. There's always someone else helping out at the store but they NEVER touch a sandwich, not even wrap it up. I mean, there must be some rule here where the owner is the ONLY person who ever makes the sandwiches. He's amazing tho, with the ' i can chop avocado with my eyes closed' technique, he deserves the dedicated fans like myself who will stand in a line that's out the door for a...sandwich.\n\nit's really messy to eat, grab a table and sit down. unless you live around the corner, it's hard to resist busting the sandwich out immediately and many times, I've had the overloaded sandwich half on my dress by the time I'm home.", "author": "Scarlet S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-23", "description": "I'm a closet Marina/Cow Hollow fan, been in denial for a few years now, but I gotta confess to not understanding the hype here.  I grabbed a turkey sandwich the other day and it simply reminded me of a Blimpie sandwich.    Blimpie is an East coast sandwich chain ala Subway, Quizno's, known for it's basic ingredients/sandwich offerings.\n\nThe sandwich was perfectly suitable, and I enjoyed the excess of avocado, but the ingredients really were subpar...so, I'm just giving this joint 3-stars as I can't say I'll be rushing to get back there.", "author": "John R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-29", "description": "The sub I got was pretty good!  Happy with the food.", "author": "Cristina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-27", "description": "What can I say, I love this place.  I make it a ritual to come here at least once a week.  The prices for Union Street are fantastic.  It's a bit away from all the action but well worth the walk.  The small is enough to fill me up and the large is enough for 2 meals (and I'm a big eater).  Don't be misles by the little diagram he has of a small, medium and large on the wall.  He adds about 2 inches to that length.  The sandwiches are a great deal.  It comes with lettuce, tomatoes, white onions, mayo, mustard and special sauce.  You can also add a few things like jalapenos and of course the avocado.  He puts almost a whole avocado into your sandwich (small) for just a buck!  If you end up getting a large, he puts in like 1 1/2 avocados for the same price.  The special sauce is like a mix of oil, vinegar and some spices.  It's delicious.  If you are taking it to go, I would suggest getting the sauce to go.  Since he toasts his bread, it keeps the bread all nice and toasted when you are finally ready to eat.  \n\nMy favorite subs are a turkey avocado, straight salami sandwich no avocado or the philly cheese (which comes with roast beef, onion and cheese).\n\nSome days can get really busy so call ahead if you are in a lunch rush.", "author": "Ken W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-05", "description": "The toasting of the subs is the key that makes them very good. Don't have them put too much oil and vinegar one or you'll end up with one wet sandwich.\n\nWatch out for the long lines around lunch.  Also watch out for the \"sub nazi\".  You can't miss him, he must make all of the subs, and make them his way. Keep in line!", "author": "Dave L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-21", "description": "I really wanted to like this place, but the poor customer service here was a deal breaker for me.  I ordered the avocado and sprout sandwich because I had a craving for sprouts.  At the time I ordered the sandwich, the sandwich-maker didn't say anything about not having any sprouts.  I paid the full price for the sandwich and then proceeded to a table.  It wasn't until after I started eating that I realized there weren't any sprouts on my sandwich.  I got back in line and told the sandwich-maker that there weren't any sprouts on my avocado and SPROUT sandwich.  Did he forget, or were there no more sprouts?  He said very reluctantly that he does have sprouts but not at the present time.  Umm...right that means that you don't have sprouts.  I would've expected him to tell me that he didn't have any to put on my sandwich at the time I ordered so that I could have at least gotten something else.  I didn't like the dishonesty and that I was charged full price for a sandwich for which one of the main ingredients was missing.  It's like ordering a turkey sandwich and then not getting any turkey.  Not cool.  As I was leaving, he said that he would put sprouts on next time.  Well, my friend, there won't be a next time.  The sandwich was really good, but honestly I can get just as good of a sandwich at my regular sub place in the Inner Sunset with much better customer service.", "author": "Julie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-02", "description": "If Sub Center and Marina Sub had a duel Marina Sub would seriously kick some Sunset N Judah riding ass.  \n\nProps to Q for making the sweetest turkey provolone no tomatoes sub ever.  \n\nSometimes i see a group of middle schoolers here and it brings a tear to my eye thinking about all the make-out parties that we planned when we were at Marina Sub back in the day.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-30", "description": "3 for the avocado slicer man. \n-2 for the 45 minute wait...and the sketchy kid behind the register who I cant decide if I realllly liked or was reallllly annoyed by. He was the only thing to stare at for 45 minutes besides cold-cuts and cheese chunks.", "author": "Dandy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-24", "description": "Fantastic subs!  Fresh bread, great ingredients. Loved it!", "author": "Rob D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-24", "description": "This place was the only really good submarine place near my school and my school firneds and I would make the trek as many times as we could to get here, taking two transfers. Within a 45 minute lunch break it was impossible.  1.5 hours though, it was the perfect time to get there, get the subs, and eat the way home. It was worth it though.  \n\nMy only gripe is that the people are some of the meanest I've had. Not realyl sure what they're pissed about.", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-08", "description": "Just an expensive sandwich place with a very long line.  Hard to compare to the amazing true deli's in NY or even on the Hayes.\n\nNothing exciting or even that good.  Whatever.\n\nI live a half a block from this place and have gone twice in three years.....  Boring for sure....   I can make this at home better.", "author": "Cristof E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-21", "description": "Delicious, but for your own sanity, call ahead on a weekend.\n\nOh, and mayo and mustard are on everything, as well as a \"secret\" italian sauce.  I love the Italian, no mayo or mustard, extra sauce.", "author": "Rachel W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-30", "description": "You need to go here just to watch the guy slice an avocado.  He is an artist.  \n\nThe sandwiches are okay, not amazing, but definitely good.  Oh, and a large is indeed a large.  No skimping on size here.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-09", "description": "Okay so I'm totally not a sandwich person (booring!) but these are so freakin good I'll sometimes drive from Fremont and back just for these morsels of heaven.  The bread is perfectly toasted -- not too much not too little -- the cheese melted just right, the salami (or other cold cut) delicious.  Oh and don't forget the special (vinaigrette-type) sauce.  It's taken me a long time to Yelp Marina Subs cuz I don't really want this Bay Area secret to get out.  I don't want to have to wait behind long lines getting teased by the divine aroma.  So don't go.  Please.", "author": "Ann H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-27", "description": "How many avocados do you think Q has sliced in his lifetime? 10 million? This guy is ridiculous - pretty much the best sandwich in town. I will drive all of the way across town to eat there. Tip to the wise - always call in your order (EVEN IF YOU ARE STANDING IN LINE). He alternates making sandwiches between one phone and one in-person order. \n\nAlso - I don't think I have ever seen the same stoner work the register twice (and I have been there over 40 times) .", "author": "Angie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-04", "description": "ooookkkkkkk....... so, i work in the neighborhood and have been here several times. the sandwiches are good, but nothing spectacular. he uses good ingredients, and will toast your sandwich if you like, but my main complaint about this place is about the customer service. \n\nfirstly, there's usually a huge line, so calling ahead is always a good idea. but if you do decide to just walk in and order, you must know EXACTLY what you want because the owner, the one that actually makes the sandwiches, has 0% patience. it's like your being in the business is a major imposition on him. i was in there today for a sandwich and gave my order specifically and to the point, and he was still rude. \n\ni don't care how mad your avocado cutting skills are. be nice! -_- \n\ndefinitely had my last sub sandwich from Marina Subs today. guess i'll just stick to the new Irish Bakery in the neighborhood. at least they smile when you walk in...", "author": "Sherah M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-25", "description": "My first visit here convinced me that this was one of the best sandwich places in SF. I loved the soft toasted bread, meat, and LOADS of AVOCADOS. The man sure knows how to make his sandwich. The sauce, Italian dressing, gives the sandwich a little UMPH but shouldn't be the reason this place is getting anymore than four stars. After a few more visits, i start realizing how my sandwich easily gets soggy fast and begin to think about what exactly i like about the sandwich. it's a great place to get a sandwich, but its not something we can't all make at home.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "Great local spot. Menu is simple. The servings are generous and fairly priced!!", "author": "Bill H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-15", "description": "This place is a classic deli spot with sandwiches that are greater than the sum of its parts. For some reason, if I were to have the same exact items (meats, cheese etc.) at my disposal, I could not come close to producing a sandwich as delicous as the ones served.\n\nMinus a star for the absurdly long waits, but the phone-in order is a blessing.\n\nWhile normal sandwiches are definately 4 star at least, don't be shy go for the meatball sub or atomic sub which is a 5 star party.\n\nHave to stress the call in again.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-22", "description": "Great, totally enormous sandwhich's prepared by a man with some of the best knife skills I have ever seen.  Total avocado slicing magic, I watched in amazement for like 20 minutes.  Takes forever though, so call ahead!\n\nThe owner won't let anyone else make sandwhiches,  and he has been doing it for years,  so you know the bar is high.  The guy manning the counter is not super helpful,  but who cares, food rocks,  just call ahead, and enjoy the avocado slicing entertainment.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-25", "description": "Amazing, warm with avocado and turkey...couldn't ask for anything better", "author": "Jenny I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-17", "description": "Yum yum yum! SO MUCH avocado! best sandwich place in the marina.  \nvery (very) long line and cash only.", "author": "She-ra Princess of power M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-25", "description": "I've been going to Marina Submarine for over twenty years (I think), and not one single thing has changed. That is definitely a good thing. I'm biased, since I grew up only a few blocks away, but I can not think of a place at which I'd rather eat lunch. I know other people have mentioned it, but you must get avocado on your (hot pastrami) sandwich, if only to watch Q dispatch two entire avos onto your sandwich in about five seconds. \nIt's pretty funny how he always has a new kid at the register, struggling to keep up. \nI really can't use enough superlatives to describe Q's sandwich making ability, so I will say only that Q is the undisputed sandwich master, his supremacy unquestionable!\nIf the line is long, wait. It's worth it. And don't complain. He's doing it all himself!", "author": "CM C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-09", "description": "is it me, or is the Asian guy kind of off? he smiles and looks around but doesn't say much and his response time seems a bit slow. people say his knife skills are amazing however if you've ever worked in a restaurant then i'm sure you've seen those same knife skills time and time again. i remain unimpressed.\n\nit's a plus that the sandwiches are heavy and heated, however there is nothing special there. the \"secret sauce\" is italian dressing, i'm quite sure. and what's with no bread options? i only saw the french bread and sliced wheat....whaddup??", "author": "Regina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-07", "description": "If you're craving a heart attack on a Colombo roll, this is the place to be (and an atomic sub the sandwich to order). To be honest, I haven't been here in a few years, but my high school was nearby and these sandwiches went well with cheap beer. \n\nThe sandwiches are good, but that's about it. I wouldn't call them the best in the city, but I'll always hold a soft spot for the place because of the sheer volume of sandwiches I've had there and the good times we had trying to scarf down an atomic sub during lunch break. Plus, I always loved the fact that the often grumpy owner would smile and make my order automatically. Makes you feel special. Also makes you think he'd call 911 for you when your artery clogs. That's a full service sandwich shop right there.\n\ncheck it out if you're in the area, but only die-hard regulars and old fans need drive across town for it. If you're not nearby, check out Captain Sub, or Submarine Center. Good eatin'", "author": "Mitchell L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-20", "description": "Good times, and not the 'good times' that you say in awkward silences, but the kind that adam corolla would say right before girls jumpping on trampolines, GOOD TIMES. \n\nyou better bring chash cuz they dont take the plastic. (said face)", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-29", "description": "Get the turkey, avocado, and cheese sandwich with EVERYTHING.  Honestly.  You are going to be waiting in a long line for what will feel like forever because it probably will be forever considering there is only one guy who makes the sandwiches. Granted he is a master at  it (take a look when he is cutting the avocado up...) so i don't blame him.  But as I was saying.. you will be waiting in a line forever and you will be staring at the menu changing your mind a million times. If it is your first time then take it the safe way and just do the turkey.  Don't forget to get a pickle... sooo good.  And then, once you have taken the plunge then start to venture out into the amazing menu.  Or have it your way and start with the italiano or even the atomic.  you will be back.. I know I will", "author": "Kylie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-16", "description": "I could for real watch this guy cut  avocados all day long.  I am shocked that he has all 10 fingers!!!  Moving on, the subs are incredible as well.  Unfortunately, a lot of people know that, so there is often a wait.  I would suggest trying to come at an off hour (i.e. not during lunch), or call ahead (if you can get through- I have tried this and failed).  But the subs are definitely worth the wait.", "author": "Nora S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-05", "description": "Best of neighborhood by far.  It just takes too damn long.  Not because I'm impatient, but anyone can see how inefficiently the place is run.  You must ask yourself honestly, is it worth spending 15 minutes of my lunch break in line for the reward of delicious flavor?  Sometimes yes, sometimes no.  When yes, I never regret the decision.", "author": "Ian S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-12", "description": "Seriously Q....get some help back there.  I waited 30+ minutes for a mediocre meatball sub (that he burnt)...\n\nCurrently on my blacklist.", "author": "Joseph A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-21", "description": "BEST subs in the city. if you go during lunch hours you can for sure expect a line. sometimes a bit more expensive than usual but the way they toast the sub is incredible. if im EVER in the area, i have to stop by this spot. they also have a small gelato ice cream happening too. never had it but i guess its a nice perk to the place. i highly suggest going out of your way to give this spot a try. i been going here for 15 or so years and it only gets better as the time goes on...", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-01", "description": "Let me start by saying the sub is good.  I'll actually say pretty damn good.  However, it is not at all worth the 25 minute wait.  Honestly, people will exaggerate and say 45 minutes, an hour - whatever.  But 25 minutes is a real, honest estimate of how long it will take to get your sandwich.  15 people in line?  25 minutes.  Only person in the store?  25 minute wait.  Call ahead an hour before you arrive?  25 minute wait.\n\nI have been to places that are outstanding and I'd wait all day for what they've got.  But this ain't it.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-17", "description": "This is hands down one of my favorite sub-sandwich shops in the city.", "author": "Michael A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-08", "description": "I was attracted to this sandwich shop by the smell ... it smelled like heaven ! I thought the sandwiches would taste like a piece of heaven too but boy was I disappointed ! I got the submarine sandwich ... it was too salty ! But other than that , it tasted ok but nothing special about it .", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-30", "description": "this is strictly a pickle review...you heard it right, a review about a pickle.  i love me a good, vinegary, whole dill pickle...so to my delight, this place sells them for a dollar.  now, i know i'm just noshing on a cucumber, but whoever created the first pickle is a genius and i can't thank you enough.  it was just the best thing to walk into a sandwich shop, so my friend could buy herself a sandwich, and find that i could get a beautiful, green treat myself.\n\nonly one star off for building the anticipation on getting my pickle, as my purchase was not communicated from the cashier to the sandwich maker.", "author": "Marjie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-11", "description": "Even my hipster friends who avoid the Marina like it's the plague (the kind that's hidden under the designer jeans of the typical Marina Bro) are willing to make the trek to Marina Submarine for a sando conjured up by the Wizard of the Delimeat. Yeah, you're gonna wait longer than you'd like. Sure, you may pay a little more you think is reasonable. But once you hone your snake-like ability to unhinge your jaw and take that first massive bite, you're gonna forget about your qualms and find yourself in Tasty'n'Toastyland, and you'll never want to leave.", "author": "Anna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-02", "description": "Possibly the best toasted subs in the City. Call ahead to avoid the wait.", "author": "Patrick B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-01", "description": "Ok, so I did not know the \"call ahead\" rule and waited in anguish for over AN HOUR for this sub. I kept wanting to ditch to go somewhere else, but the other half of me kept saying- no no, this will be worth it- check out those avocado skills. \n\nI think the worst part of the stand still line in the dinky shop was watching his assistant just stand there not making subs. Let the guy help make a sandwich!! I seriosuly was half laughing and half crying watching the painful process. \n\nSo, an hour and about $40 later (chips, waters) we took our 3 turkey-avocado subs to Muir Woods. Little did I also know that you have to order your sauce on the side. We were left with soggy, sloppy processed turkey sandwiches and had no choice but to take 2 bites and toss them in the compost, as they were already 3/4 disengrated with sauce and avocado mush. \n\nI will stick with my real italian subs at Lucca's Deli thank you very much.", "author": "Rena Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-14", "description": "Always great, never dissapointed unless they run  out of pastrami", "author": "Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-20", "description": "THis is really the only true east coast sub I have found in the city. Honestly. I'm sure there are others, but when you are craving that shredded lettuce-thinly sliced onion-italian dressing and mayo taste, there's just no beating this place. Call ahead (but not too far ahead or your sandwich will be soggy when you get it) because the lines are long. But this place is sooooooooo worth it.", "author": "Sbicy Meatball J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "I tried Marina Submarine for the first time and it was awesome!  Kyu was super friendly and gave my puppy some snacks.  It was indeed amazing to watch him slice avocados up -- if you love avocado, this is your place.  The sandwiches don't seem to be anything special, but they are surprisingly delicious.  I wish I knew what the ingredients/allergens were in the sandwiches were.", "author": "Tony G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-21", "description": "Although it can take 15 minutes to get a sandwich at times, it is well worth the wait.  The sandwiches are simple but delicious.  It is worth ordering avocado on your sandwich just to watch the guy cut it up so quickly.  If you are going around lunchtime, i would call the order in.", "author": "Robert R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-08", "description": "If anyone remember the Seinfeld episode with the soup Nazi you will only appreciate this place more. Hands down the Sub Nazi resides at this restaurant. The man is an animal. No one touches the sammy's besides him. There is always a line, a line worth waiting in. If you have the courage to call ahead of time go for it, but I sense the Sub Nazi is not a huge fan of those who call in. The turkey avocado is superb. Get the bread toasted, you can't go wrong with this sammy. If you are starving you can always grab a bag of chips to snack on as you wait. I give props to the young kid who rings you up. I bet he is scared to death of the Sub Nazi but he comes back everyday for more.", "author": "Jen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-09", "description": "Overall pretty good. Subs take a really long to make (20+ minutes), the rolls end up pretty soggy but the meats are really good. My bf is from New York and he is all about \"the perfect sandwich\" and he says we need to try this place one more time in order to give it a fair review. So, more to follow.", "author": "Megan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-03", "description": "goodness, this torpedo of a sandwich was HUGE. but lucky for them, i had a manly appetite after rock climbing.\n\ntheir \"small\" may look small in length but the chef really packs it in. to fold it in half, he has to jam his knife blade in to fold it. i would recommend ordering avocados just to watch the chef slice and dice it. he'll also put an avocado and a half or something into your sandwich, so if you're not a fan of heavy amts, dont do it. \n\nunfortunately for me, my friends ordered the last of the roast beef, so i asked the chef for suggestions. he started building my sandwich and handed me a fatty vegetarian sandwich with avocados. it was good, but avocado overload! There was a lot of juice from the veggies spewing out everywhere, causing a huge mess on my hands and on the table. i have yet to learn how to master handling my torpedos.\n\ni still finished it though. A+ for me!\n\nI'd come here for if you're in the area and  looking for a nice hefty sandwich.", "author": "Rena Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-03", "description": "My husband is from Sausalito and went to school in San Francisco up the street from Marina Subs.  I think he spent every after school day here getting the Submarine sandwich.  So he has been going here for 25ish years and when we go to visit we end up here everytime.\nI think this place is great for the type of sandwich they serve.  Dont expect something gourmet.  It is a sub sandwich and I wouldnt say the meats are the best quality and in fact I have heard the owner actually say that the Pastrami might be a little fatty to a girl ordering it in front of me this past trip.\nYou will wait in line\nIt does take the guy a long time because he does make every sandwich, but I have NEVER seen him go from taking money to making a sandwich and I have been there many times.  He has a dedicated cashier/drink getter.\nThis is just one of those places where either you get it or you dont.  But you have to try to find out.", "author": "C W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-20", "description": "I used to eat here a fair amount as a kid. While I'm not as crazy about this place as my brother is, it's still a really good sub.", "author": "Erik S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-04", "description": "Maybe the subs are good, I don't know.  We waited in line for literally 35 minutes before leaving because we hadn't moved and there were still four people in front of us.  Guys kept taking phone orders ahead of the people in the shop which is bunk.", "author": "Michael N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-12", "description": "Let's see...you wait forever, the prices are a little high for a sandwich, parking sucks, decor is dreary.  What does this all add up to?  A wonderful, tasty place -- maybe the best -- to grab a hot sandwich in SF.  The reason why one can overlook all the negatives is the owner, a real character with an insane memory (he remembers his customers, including their orders) and a crazy ability to chop avocados.  He serves up enormous subs with loads of toppings, all toasted to perfection.  I love the cheese sub (medium) plus avocado.  Don't get the avocado sandwich, however, b/c you'll end up with no fewer than two full avocados on your bread -- which I find to be a little too much.  The Italiano is a favorite among the carnivores.\n\nBottom Line: bring a magazine to read while in line and prepare to eat a sandwich so great, you won't need to eat for the rest of the day!", "author": "L G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-26", "description": "I have been going here for 24 years and have been known to drive across the bridge just to a cheese sub(became an ovo-lacto veg along the way- I used to get Turkey and cheese).  If you are not going for cheese and the special sauce you are not getting the whole experience - I suspect those who score this place lower did not.  \n\nPlease note - they are best eaten hot - within minutes is the best.  Do not forget the extra napkins and be prepared to wait if it is lunch time.", "author": "J M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-28", "description": "I don't come here often cause the wait/line is redonkulous, at all hours. But today I had patience and all kinds of time and I wanted a great sando.  The toasted turkey, provolone, tons of lettuce lots of fresh tomato, onion, little jalapeno, little sauce made my afternoon, and eased me into my unanticipated \"break\" from the workforce. The owner does runs a tight ship and doesn't take attitude, he is the only one who makes the sandos, a master, he is!", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-05", "description": "Good size mated to great flavor and a very apparent focus on perfection on the part of the sandwich maker.  He's the only one making sandwiches so be patient and you'll be rewarded with a solid sub that will stick to your ribs.  Hit him up off peak hours and you'll have far faster service (of course).  And for those who are wondering... this place and that other place in West Portal have been around for years.  I love this place.", "author": "A D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-30", "description": "Good teriyaki sub, but calling ahead is a must or just having really good timing.  Guy cuts an avocado like nobody's business.", "author": "Will A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-15", "description": "I'm biased here as I have been going to this place for about 15 years now but this is the best sandwich shop in the city. You can tell where natives grew up in the city if they are sub fans because most of them either side with Marina subs or that other unspeakable (yet delicious) place in Portola. My bro went to SI and we have arguments about this all the time. \n\nNo you cannot eat off the floor and no you cannot get a sandwich on dutch crunch. This isn't a deli. It's a sub shop that's incredibly busy and a great value in an expensive area.\n\nThe rumored, and likely, reason there is \"only one guy\" who makes the sandwiches is that he had guys who worked for him and then they ripped off the recipes, setup and suppliers and started their own place in competition with him. I have no idea if this is true, but it appears to be. You'd be gun shy too.\n\nFrankly, I like the wait and the cash only. It keeps those who don't really appreciate the sandwiches out. The place is too popular to bother with those who don't get it. \n\nIf you're in a hurry there's a taco bell/kfc 4 blocks away just for you. Please, partake!", "author": "SF P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-01", "description": "Marina Submarine makes a FAT sandwich.   \n\nSo I ordered a sub with avocado and sprouts and Tony proceeded to slice 3 whole avocados for my sandwich.\n\nThat is pure generosity.  The toasted roll tasted great too.  \n\nI like to get avocado with sprouts and tomato.  Delicious.  Based on this sandwich alone I'd vote Marina Sub the best vegetarian restaurant within a 10 minute walk of Union street.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-08", "description": "Pretend you know  Q, yeah, you think you know him, but you dont.. well not as long as me and the other REAL city kids do. Dont ask for \"special sauce\" youre a punk, AND not a local. My bro who is damn near 15 years older than me went here after school as a kid, and I damn well followed in his footsteps. best damn meatball in town, plus I get my personal favorite, turkey, swiss, let, tom, avacado and sauce. toasted. beat that bitches", "author": "Liz C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "What can I say that hasn't been said yet?\nI've been coming here since 2000.\nMedium turkey, avocado, and provolone. Orangina.\nI've strayed away from \"the usual\" a few times over the years, but I always go back.\nAlso, few things are better than watching Q slice an avocado.", "author": "Enrique S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-19", "description": "I could eat one of these sandwich's everyday!!! I love them! turkey, provelone, lettuce, tomato, onion and SAUCE! Be sure and call it in if you can. It goes so much faster than waiting there, especially on the weekends. Don't upset the sandwich nazi. NO SANDWICH FOR YOU!", "author": "michelle k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-10", "description": "Best Sandwich Ever.  Well at least in the city.  Yes, you'll have to wait but come on... I just said it's the best sandwich in the city.  It's totally worth the wait.   Turkey, cheese, avocado is my thing but I also dabble in the teriyaki chicken.  Having this place a block away from my apartment was pretty much why I chose to live in that apartment.   SO  good, you guys.", "author": "Jacquie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-30", "description": "I must start this off telling you that I am a frequent buyer...or would I say eater....at Roxie's Sandwiches...YUM!  However, my boyfriend and I were in the Marina earlier today and starvation was on the brink!  After hearing about the rival sandwich shop for so long, we decided to try it out.  It was about 11:00am when we got there, so it was empty, except for the gentleman behind the counter, whom I'm going to assume was the owner.  He was very polite and friendly.  I ordered the meatball sub (I was hung over and a healthy sandwich was NOT gonna do it), my BF ordered the roast beef.  They were both delicious.  Lots of meatballs and a ton of cheese...just how I like it...I can't stand when places skimp you on the cheese.  The Roast Beef sandwich was also great...The best part of the roast beef sandwich was the fact that he put an entire avocado on there!  My bf was sold!!  He's kind of obsessed with Avocado's, I think he's actually on the verge of turning green, LOL.  Either way, we ordered 2 sandwiches, 3 bags of chips, 2 orangina's and 2 Stella's all of which came out to $32.60.  Not bad...not bad at all.  My only complaint would that there wasn't bread options available, I think the Roast Beef would have been better on Dutch Crunch bread...like Roxie's does :)  Oh...and FYI, they're cash only", "author": "Ashley J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-26", "description": "Sandwich Ninja Rocks. Call in your order to avoid line if you going between 1145 and 1245. Everything is good, pastrami is best pastrami I ever tasted, thick and lean. Meatballs are good too.", "author": "auclair k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-04", "description": "I guess I didn't exercise my face off or wait in a long line to reach the same level of complacency of a lot of these yelpers.\n\nI had the special sauce (italian dressing) and italian sub. It was your regular mass produced salami meats and provolone cheese atop Subway-style pink tomatoes and shredded iceberg lettuce. \n\nIt's a decent sandwich. To be fair, it's a lot better than Subway. But for those who say it's the best sub in the city, there must be a bunch of shitty subs out there. \n\nIf you want a good sandwich, I recommend La Spiaggia Delicatessen.", "author": "ascheras g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-26", "description": "This is by far my favorite sandwich place, EVER! A friend introduced it to me a few years ago and I am hooked! I love that the only person who makes your sandwich is this old Asian guy who really doesn't say much. If you like HUGE portions than this is the place for you! The sandwiches are so full of toppings and oozing with the sauce...its to die for, really I'm drooling now! If you like avocado, get it, you won't be disappointed, they are always the best avos and he puts an entire one on each sandwich, even the littlest ones! I could talk about this place for days...only downside is with one guy working the line can get a bit long, but its worth it...you can also put in phone orders FYI! PS. they only take cash!", "author": "Katie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-22", "description": "Good sandwiches, the bread is all toasty and warm, plus its the cheapest place to get lunch on union (that I have found). I didn't like the kid behind the counter, he rushed me, and i was spaced out b/c I had to take lunch 3 hours late, and then he kept making assumptions about what I wanted, like I wanted a small, or I wouldn't like the sandwich with a whole sausage in it. So i got a large and ate the whole thing. I also like how they just slam your sandwich on some paper instead of wrapping it up, what's the point of wrapping it anyway? they have beer too, for those not on lunch break, or those who like to live on the edge! -1 star for the kid who didnt think I could eat.", "author": "Natalie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-17", "description": "Good taste &amp; value; you get an entire avacado, sliced, for $1.  Not the fanciest digs, but good enough. And the Benni-Hanna-like knife skills are always entertaining.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-03", "description": "Been going here since I was a little girl... if you grew up in SF, chances are, you used to hang out here all the time too.  Sandwiches are great... hot crispy bread dripping with secret sauce.  Get ready to wait in line for a while though...", "author": "Mary S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-01", "description": "Great sandos although they're staff could use a little \"DSL\" because they have a severe case of the \"slowsky's\"...man they move slow there.  Step it up - I'm definitely not that patient.", "author": "Danielle V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-14", "description": "This is my favorite sandwich shop in all of San Francisco.  Q gives you an amazing amount of high quality food for the price.  Be sure to call in your order during rush hour.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-01", "description": "I love this place. Yes, the line is long, but it's worth it. \n\nGet a sub with special sauce.", "author": "j c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-06", "description": "The italino is the best sanwich I have had in a while.  I cannot speak for any other sandwich, because I loved that one and have not tried any others.", "author": "Tim J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-24", "description": "Best subs in the City bar none. Wait time is a big problem but easily solved by calling 15 minutes in advance with your order. Portions are way too big for me so the wife and I normally share a medium Italiano, but if you plan your demand timeline you can't get a better sandwich in the City.", "author": "David J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-02", "description": "I used to love these subs. And I figured out how to bypass the ridiculous lines by phoning in my order to the pimple-faced kid about 20 minutes before going to the shop.\n\nAnd then I got violently ill after snarfing one. I asked my friends who also dine there and two of them copped to booting up a grinder. Not sure if it's the meat or the mayo... but it's definitely Marina Sub. \n\nAnyone else have an unexplained purge after downing one of these beauties?", "author": "Bill K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-05", "description": "Q, or Tony as he is known to his American compatriots, has spent nearly 30 years as a Sandwich Artist. And I don't mean the employees in green polos at Subway, this guy is a master of his craft. I practically grew up in this hoagie haven, skating down after class at 3 to grab a turkey sub before B-Ball practice. Tony's probably made over 1 million sandwiches, but I dare someone to actually try and calculate. Try the Cheesesteak with jalapenos or the Italiano. Or you can always go for the good old Turkey, Swiss and Avo. Whats in the secret sauce you may ask? He's not telling.", "author": "Sam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-23", "description": "Oh. my. god.  HUGEST and TASTIEST subs ever.  Tons of all the good stuff- (pickles, tomatoes, meat cheese and ooh the sub vinaigrette.  Awesome) not to mention watching the guy making them is very entertaining.  He moves faster than most people working in the ER.  Pretty cheap but it gets busy - don't go in right at 12 or it'll be a minute. Cash only (duh).", "author": "Allison C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-17", "description": "I have been going to this place since freshman year of high school and it possibly has the best subs. Everything is fresh and tastes wonderful. Whenever my friends come to visit I always take them to this place and they adore it. It is a cute neighborhood spot to pick up a nice lunch. I would recommend calling ahead of time if you know what you want and you go at a busy hour so that you don't have to wait in such a long line. Fantastic!", "author": "Elizabeth A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-23", "description": "Turkey and avacado on toasted bread? Yes please! Everything is so fresh!", "author": "Carson H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-04", "description": "I've lived in the area for 5 years and I just discovered this place.  Where have I been?  The wait can get to you but there are a few  ways you can entertain yourself while you wait.  1) watch the sandwich master chop avocados at the speed of light, and 2) comtemplate why the sidekick can't do more than ring up your order.", "author": "Kumar D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-24", "description": "This is one of my favorite sandwich places in the city. I love the marina sub. The owner is always present , and he whips out sandwiches like no tommorow. I like to secretly call him the \" sub nazi\". There is always a line, but worth the wait!!", "author": "Amy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-20", "description": "Oh Marina Sub! How do I love thee?  After over 30 years of coming here and ordering the same thing, I cannot count the ways. When I am away from you, I dream about you: the delicious tang of your \"special\" sauce, the chomp of your freshly Ginsu-ed pickle, the crunch of your freshly toasted bread, all mixing with the oooey gooey deliciousness of your oven melted cheese. (Excuse me for a moment while I change panties!) \n   As a San Francisco native I cut my teeth on these beautiful masterpieces and I feel very fortunate to have had the privilege.  I'm 36 now and I had my first ham and cheese at 2 1/2...you do the shameful math! \n   Sure, sometimes you'll get there and the line will be out the door, and yeah maybe it takes 20 minutes to get a sandwich on a really busy day, but it is all worth it just to watch a master at work.  Q is the uncontested master samurai of submarines. His knife skill are better than those of master chefs!  Order a pickle, even if you don't like them, just to watch him slice and you'll know what I'm talking about. As the self proclaimed ambassador of my hometown I have brought every visitor I have ever had from every corner imaginable of the world to Marina Sub, and they all proclaim through greedy mouthfuls that Marina Sub is the proverbial s**t.  Thank you, Q, for bringing this wonderful gift in the form of a sub into my life.  My heavenly constant, you always guide me to satisfaction!\nTips: You can order ahead over the phone, but I don't like to do this as timing is everything with a sub.  Leave it 5 minutes too long on the counter and the bread won't have the warmth and crunch that is so satisfying. Do yourself a favor and grab the two seater in the window, watch the yuppies go by while you wait, and strap yourself in to be transported to the heavenly ninth wonder that is Marina Sub.\nThe only con: It doesn't stay open later!  I need my fix!", "author": "PieTheSwingCat T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-22", "description": "Best place a 12 years old kids ever introduced me to.Serious size sandwich and I swear that I wouldn't strayed from Yellow sub and Ted's market but LORD HAVE MERCY!!! I have my weakness and I know that sandwich god will forgive me for this.Their sandwiches will be the end of me.SIGH.......", "author": "S F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-28", "description": "Great sandwiches, walking distance...jesus I want one right now.", "author": "Mike T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-06", "description": "best sandwich i've had in san francisco. normally i get a medium pastrami or original sub. with everything and avocado! doesn't matter if you eat it there or take it to go the sandwich will not get soggy w/ the special sauce! Best way to order is if you call in your order!", "author": "Bruce L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-08", "description": "I am addicted to these subs!  I love them.  The avocado on any sando  is out of this world.  FYI...it may be slow, but art takes TIME!  The chef is a true master.  It's fun to watch him create these masterpieces!!   Yum yum yum my mouth is watering just thinking about a medium turkey avo w/ jalepenos.  I think I am going to get one NOW!", "author": "Chris P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-12", "description": "I love the subs at this place!!!!anything you get will be sooooo good. you do have to wait a while. they are VERY $$$$$ its like $8.00 for a small sub and small drink! you have to really save up for this.lol but its almost worth it I have to say..besides the fact the asian guy who makes the subs I dont think he likes women very much so watch out.", "author": "LoLa L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-01", "description": "Maybe I just ordered wrong, but the turkey and swiss sandwich I got here was served on a soggy hoagie roll that had no taste.  In fact, the only taste there was was the mustard.  The deli meats looked and tasted like they came out of one of those watery packages like you'd get a cheap deli.  Like I said, maybe I ordered wrong, but I don't understand all the hype about this place.", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-07", "description": "Quirky, quick, and delicous.  I often worry that the poor kids running the register are being abused- the sandwich guy won't let them even come NEAR a sandwich or even the sandwich-making area!!  They seem happy enough, probably because they are plied regularly with sandwiches...", "author": "Alison R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-27", "description": "SO GOOD! Quick service, you can call ahead and have a hot, grilled sub sandwich ready for pick-up in 10 minutes. Comes in small and large (small is pretty big, large is truly ambitious). My boyfriend introduced me to this place a couple years ago, but he and his friends have been going since high school.", "author": "Christy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-29", "description": "These are great simple subs. The servings are large. By far my favorite is the turkey & avocado. It comes with a whole fresh cut avocado...delicious. The line can be a bit long at lunch on the weekdays so call ahead your order.", "author": "Tyler S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-03", "description": "Although the wait is kinda painful when you are hungry, and your food can take a long time to get to you it is worth the wait.  Although they put an entire avocado on my cheese sandwich which was a little too much, the combo of the melted cheese, fresh avocado, \"special dressing\" and perfectly toasted roll was really really really good.  I would definetly recommend it, but not if you are in a hurry.", "author": "Jennie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-19", "description": "I have not found a better submarine.  I don't really like rating 5 stars, but I love this place.  The old guy making sandwiches is not very social, but he makes great stuff.  I have been to Roxy, Yellow submarine, Sub Station...still, not a better sub yet.  Get the small unless you eat a lot.  I am 6 ft, 190, and eat for two most of the time.  A small sandwich is perfect for lunch.", "author": "Kapeli M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-07", "description": "I just saw a man put five avocado halves on one sandwich. I'm pretty simple. There's a positive linear correlation between the amount of cheese/avocado on something and my rating. But yes, the wait does suck, which led us to tear into chips while waiting in line. A good solution if you're a compulsive eater like me. Don't even think about going if you have anywhere to be in the next hour or two. Worth the price because you probably won't finish it.", "author": "Katie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-02", "description": "This is one of the best places in the city to get an amazing sandwich.   They are huge and you have to get the sauce.  So good.  Anytime I'm working in the Marina I make sure that I stop here.  The owner is always nice and takes great care in your sandwich.  But you have to be careful later in the afternoon because sometimes its just suddenly closed.  Also it's cash only!", "author": "Julia E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-02", "description": "You're kidding, right? You must be kidding. \n\nSo I used to live in the Marina years ago and I would come here from time to time. I remembered it being good. So when my boyfriend had a hunkering for a sub, I suggested this place. Mind you I was kind of starving, as in I could eat my own arm after running 6 miles that morning. So I figured a sub place is perfect, fast and quick. Right??? WRONG!\nWe find a parking space right out front (amazing!) Then we see a line. I mean nothing crazy but maybe 6 people, so I figure, \"Crap. I'm not gonna get my freakin' sandwich for like 15 minutes. And I want to eat NOW!\" Boy was I wrong. I stood in line for exactly 1 hour. Yes 60 minutes, count them!!! By the time 20 minutes passed, I was too invested to leave. \nI proceeded to sigh loudly, look around, shift from foot to foot, clench my fists, utter obscenities under my breath, and then contemplate what my arm would really taste like. Then I proceeded to be a bitch to my boyfriend taking out my frustrations on him. An hour and 30 minutes later, I finally put this sandwich in mouth thinking by now anything would taste good. And it wasn't even all that. Kinda bland.  WTF?!?\nBasically this place wasted two of my hours on a nice sunny day, made my stomach eat itself out of desperation, made my boyfriend and I cross with each other, and ultimately made my boyfriend sick with a stomache (stomach + ache= stomache). I hate this place. It ruined my day. \nAnd don't even get me started on the two 13 year olds standing behind the counter doing absolutely nothing while the old asian man was ready to have a heart attack making 76 sandwiches. Don't get me wrong, I don't hate that poor old asian man for ruining my day, just for the poor management of the place and the line. Not even an apology was uttered.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-13", "description": "gigantic subamarine sandwiches.\n\ngigantic.\nsandwiches.\n\nthe sandwich artist is very generous with the slices of meat, cheese, avocado, etc. \n\nspeaking of avocado, i would like to go back and watch his slicing technique. it usually takes me a good 8 minutes to slice these babies.", "author": "Rosalee C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-10", "description": "It's worth the wait.  Fresh ingredients, HUGE portions, toasted perfectly!  Definitely get the avocado, and definitely call it in if you can.  If you are starving and have to wait a half hour, have some chips in line while you watch the owner kick some serious sandwich ass.  Never disappoints.", "author": "Em S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-03", "description": "I was debating whether it's a four or three star.  Gave it a four because I just tried Lucca Delicatessen and think the sandwich here is slightly better.  We had a company lunch and I had half turky and half chicken.  The chicken sandwich is totally not what I expected.  I was expecting a whole piece 100% chicken breast, instead was some chopped up processed, frozen ,Tyson brand type of chicken.  I mean it's not terrible but just totally unexpected.  The turkey on the other hand was much better.  Very juicy sandwich on some soft roll with the usual sandwich fixings.  This place is worth a try if you happen to be in the area and craving for sandwiches.  By the way, the sandwich is huge and cost about $6.00.", "author": "Heidi F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-25", "description": "This place is extremely overrated. The sandwiches are decent, but do not justify the price at all. Okay, yeah, they give you a lot of avocado, but guess what, so do a lot of places. The wait time here is ridiculous. I'm willing to wait for a quality meal, but 40 minutes is beyond excessive. I don't really understand why the owner can't hire someone to help him make the sandwiches, instead of just having a cashier. Also, charging 45 cents for cheese is bullshit when the sandwich itself already costs $6.50. Overall, a big disappointment and not worth it in any respect.", "author": "Aly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-20", "description": "This place is pretty good. I used to get really excited about going here like 6 years ago. The sandwitchs are all heated and have an italian kinda dressing on them in which was kinda tart. I had to wait like 20 minutes though! Geez. Great sandwitch place. If you like Submarine Center in west portal this is place is its snobbier sister.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-13", "description": "I have one thing to say- I went in to grab a quick sandwich with a few buddies. There were four people in front of us, no biggie, that's what anyone normal would think. AND THEN, 45 minutes later we are just about to order our sandwich. The most horrible service I have ever experienced. I will never go there again. They put the phone orders ahead of humans and they dont even look at you when you are ordering your sub. And lastly, there is only one person working. Did i mention it took 45 minutes to get a sandwich....which was just, okay.", "author": "Nedda T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-15", "description": "May look like a dive, but this place has the best subs in town.  They toast the rolls and use fresh meat and veggies.  There is usually a line, so don't go if you're in a huge rush.  The owner makes all of the subs himself (hence the long line) and usually has some high school kid helping wrap the subs and work the register.  Certainly say YES when asked if you want the \"special sauce\"...it's what makes these subs so good.", "author": "Kala H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-15", "description": "Marina Subs is great if you call ahead and order your sandwich.  The best thing is that they put a whole avocado on your sandwich.  \n\nThey have a huge line if you don't call in, so I highly recommend it becuase the 1 guy who makes them takes call in orders before the line in the shop.", "author": "vikki a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-18", "description": "The special sauce is good, the bread is nice, and the avocado is always fresh. Only one person (Tony I think) is allowed to make the sandwiches, so the line can get ridiculous. The trick is to order over the phone and pickup.", "author": "Hurston P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-02", "description": "Really good quality sandwich shoppe. They're a touch on the greasy side because of all of the deliciousness they lay on your sando, but the bread is always perfectly toasted, the meat is boar's head brand, so you're not eating filler, and the price is dead on. Oh, and the guy that runs the place has a freakishly good memory...after only going a handful of times he already knew what I liked, and started making my sandwich before I even told him what I wanted.", "author": "Gary S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-18", "description": "I used to go to catholic school right around the corner from this place and this was actually my first job out of high school so I've literally eaten hundreds of these sandwiches. I can honestly say these are the best subs in the city. It's mostly because of the Columbo bread and the \"special sauce\". I'll never divulge the secret of the special sauce. Alright, it's italian dressing. Since I'm outing special sauces, Mc Donald's special sauce is thousand island dressing and the secret ingredient is salt. I feel as if a great weight has been lifted off my shoulders. Anyway, the place is run and owned by a Korean guy named Tony. Everyday Tony would go downstairs and take a nap in the afternoon for a few hours during which time I took the opportunity to smoke weed, do the crossword puzzle and invite my friends over to give away food. Best-job-EVER! I gained like 20 pounds while working there. Being high and alone in a sub shop is both good and bad. The only thing I don't like about the place is the Marina crowd but if you're really high you won't mind so much.", "author": "Josua P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-15", "description": "Ever since I was 5 years old, Marina Submarine has been my favorite sandwich joint in SF. I am pretty sure the same man owns the place and makes the sandwiches. Don't forget the special sauce. And, always get it toasted.", "author": "Alexis K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-16", "description": "My first trip to this place will certainly be my last.  This was the MOST inefficient restaurant I have ever been to.  There is 1 man making subs while another man works the register.  The problem is the man cannot make the subs fast enough to get people to the register, so the man at the register sits there doing nothing while the line piles out the door.  Not only that, but the sub maker has to make subs for phone in orders so people in front of his face have to sit and wait.  After waiting in like for 35 minutes at 2 pm on Sunday to get a sandwich I was able to get my sub.  I ordered to go.  I had turkey which was pedestrian and looked like it was bough pre sliced at Costco.  The secret sauce is no more than Italian dressing and the onions were gross and numerous.  I live only 4 blocks away, and when I got home to eat my sandwich was soaking wet and disgusting.  I agree with people that the sub maker does know how to work an avocado but everything else was awful.  I appreciate the loyal people who frequent this place, but I would never go back and you should not either.", "author": "Ross D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-21", "description": "amazing. these sandwiches are simply amazing. i was a little peeved that the long line moved so slowly and i was so hungry, but it was well worth the wait.  i guess its the guy who owns the place that makes the sandwiches, and well, he knows what he's doing. i think i had half an avocado on my small sub. so good! and the \"secret sauce\" that actually tastes just like italian dressing is really delicious and adds tons of flavor to the sandwich. the fact that they serve beer is also a big pluss.", "author": "Meredith B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-06", "description": "Addictive.  Meatball sub and Turkey, Cheese, Avocado (TCA) earn Olympic Gold.  Add 'hand-sliced' dill and Jalapeño to your TCA for a very nice compliment to a all-star sando.  It will get all over your face, extra napkins are a must. The mess is well worth it.  Having been all around the Bay area, its not even competitive. Chef / owner Q is in a class all his own. Be patient in line on weekends. The wait is justified.", "author": "Tom B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-12", "description": "Great Sandwiches, but definitely call your order in.  The line is always long and the owner is the only one that makes the sandwiches.  Kinda like the San Francisco version of Seinfelds soup nazi.  Its worth the wait too.", "author": "Dan V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-21", "description": "long wait. okay sandwich. feeling sick later.", "author": "selma s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-30", "description": "I love Marina Sub.   It's true, you should call ahead or risk waiting in line for at least 20 minutes during peak hours.  It's all worth it though.  Sandwiches are hot and tasty!!!  If you like avocado, this is your spot--there is no skimping on the delicious green fruit.  How can you not love this one man (and teenage helper) enterprise!", "author": "Laura D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-07", "description": "get the turkey sub with everything and add avocado. once he toasts that sucker up.... yummmy! large sandwiches but still cant beat Freddies.", "author": "Gordon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-18", "description": "This guy is like the Seinfeld soup nazi of submarine sandwiches and that is why I like him.  Always the same dude making sandwiches, he moves at his own consistant pace and he is very matter of fact but oh-the sandwiches.  Toasted bread, meat and cheese, tons of veggies (if you order avacado be prepared to eat at least 1/2 of one) and that sauce - AMAZING!", "author": "Robert A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-10", "description": "I go here at least once a week. The line is often long, but the guy making the sandwiches is an absolute machine and the sandwiches are unbeatable. The portions are very generous -- a large sandwich is easily enough for two meals -- and the price is reasonable.", "author": "Gregory G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-02", "description": "Yes, it may be in the Marina. Yes, it may be a bit pricey. Yes, the parking is shit. And yes, you may have good reason to be about to click to the next sandwich joint on this website... But STOP! right there! if you want to taste the most mouth watering, juicy, completely goddamn ridiculous sandwich ever made. To quote Robert R. \"It is worth ordering avocado on your sandwich just to watch the guy cut it up so quickly.\" Astute observation, but the \"guy\" you speak of is really no guy at all--he is a magical sorcerer from a parallel universe of spicy meats and secret sauces, who only works here on this planet because he lost a bet with his evil counterpart and interstellar rival (who can be found making sandwiches at Viking Submarine on Lombard in this small blink of time in the history of the universe)--so he is doomed to toil among the mortals on Earth for all eternity instead of riding around on hovercrafts and partaking in time-travel. And a nickel to the person who can tell me what the suit and number of the card stuck to the ceiling are.", "author": "Nicholas E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-18", "description": "Anyone who has grown up in Pac Heights or the Marina knows that this sandwich shop tops them all! Although Q might not say much behind that counter as he chops avocado faster than a western cowboy can sling a gun, but the sandwiches are truly glorious once you take your first bite. I would recommend the turkey with provolone, lettus, tomato, avocado, mustard, and extra sauce. mmmm OR the meatball. :)", "author": "Blair H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-04", "description": "If toasted fresh bread with melted cheese, stuffed full of avocado, sprouts, lettuce, tomato, cheese & mayo sounds good to you, then you will love this place. The sizes are really generous = 2.5 whole avocados in my medium sub!!! Will be going back regularly.", "author": "pb .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-17", "description": "This is seriously the best sandwhich - and I don't even dig sandwhiches that much usually.  Whatever dressing he uses is amazing - also you have to add the pickled peppers for a kick.  We had a hard time moving away because we miss this place and go back every trip!!!  The owner is so nice!  He comes out to greet my dogs and gives them little snacks...", "author": "Erin G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-03", "description": "I've got some respect for marina sub. Eaten there for YEARS, but mostly out of convenience. It's really just a knock off of the submarine center #1 and #2 (which are and were way better). The menus are exactly the same. The dude who runs the place closes WAY too early and the helpers he hires are not very efficient so the line tends to get out the door and around the corner. If you are looking for a good sandwich in this area I suggest going up the hill to Mayflower Market on Fillmore. They have money deli sandwiches with little to no wait and at an unbeatable price.", "author": "Victor H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-17", "description": "Q is awesome. He taught me all about selecting avocados and what months to buy Haas versus Chilean... If you want to really have fun at this place, be nice to Q. I like his philosophy on life - he likes making sandwiches when he wants to make sandwiches. When he doesn't, the place is closed!  This place is a labor of love.", "author": "Senor R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-15", "description": "first off let me say i have been going here since high school, that is more than 15 years. in that time the place has not changed and that is everything from decor to sandwiches. the only real differences are the young kid checking people out and the depth of the knife induced dent in the owner's cutting board. overall though the food is consistently good, especially if you like avocados. the guy who makes the sandwiches is generally no nonsense but sorta friendly. he cuts avocados like a machine and never lets anyone else make sandwiches. because of that the quality is consistent. this place is in my regular sandwich rotation.", "author": "A G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-28", "description": "most of the people who gave m.subs less than the five stars it deserves, don't understand the process of and history behind the shop. i, the help behind the counter many have deemed either incompetent or absolutely useless, will help clarify and enlighten.  call me incompetent, but it is the customers who don't know the workings of the shop and are wandering the place wide-eyed and lost who really prove themselves to be so.  obviously, there is only one person who actually makes the sandwiches, kiyu (not \"q\").  he makes them alone because another pair of hands would be unable to keep up or produce half as good of a sandwich. therefore, out of practicality and time constraints, he works alone. providing a more than sufficient amount of help, the other person behind the counter takes phone orders, pours drinks, works the cash register and has to deal with the bullshit the marina and hungry, irrational people have to offer.   the line gets so long because of the people who have yet to comprehend the concept of phone orders and that orders of six or more sandwiches holds it up and should be given in advance (at least half an hour in advance).  and to the complaints in regards to the phone orders not being ready and presented on a silver platter the minute they step into the store, we don't have the sandwich made at the exact time we say we will because most people come ten minutes after we tell them to and complain about a soggy sandwich. maybe had the first person who came in fifteen minutes late and complained about their soggy sandwich not been such an ass, we'd have everyone's sandwiches ready on time. if you're one of those people who know they're going to be in later than told, say it with me, \"sauce on the side\".  no where else will you find such a beautiful sandwich made with such simple ingredients - no need for bacon, spicy mustard, pepporcinis, grilled chicken or whatever else you spoiled people are putting on sandwiches these days. why did I choose to work at m.subs? because I love avocado, the sandwiches are borderline orgasmic and kiyu's company surpasses anyone else's. he's considered a little rough on the edges because he doesn't get on all fours for  every customer, but he loves what he does more than anyone else i know and loves his customers even more. he'll remember your face after seeing you once, and your exact sandwich after you order it twice. count your lucky stars that there's a place as great as this.", "author": "mai n."}
