{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "My friends and I had a blast here last night! We were planning on bar hopping and exploring the city but wound up spending the whole night here thanks to Jake and Jess! They were so great! The place was pretty busy and the music was on point! We're planning on making this our spot while we're in town! I would highly recommend visiting Jake and Jess and making this a must on your vacation! You won't be disappointed!", "author": "Lala M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-01", "description": "We were on a wait list for the Delarosa Pizzeria and they told us to go across the street for a drink while we waited. Perfect suggestion. It seemed like all locals were in the bar all created by the bar tender.   We sat in the front part of the bar which is a funky spot that is 5 inches higher than the rest of the floor.  We had a quick beer and then was called for our reservation across the street.\n\nWe will return!", "author": "Wendy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Jake was amazing very friendly bartender excellent atmosphere love the table by the window can't wait to come back and have another beer", "author": "Anita V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "You would have to be a complete idiot or at least have no experience in dive bars in San Francisco to get kicked out of here, complain it was cash only or say the crowd is too old. In this case the one star ratings make the place appealing to anyone looking for a good bar. This is one of the last bastions of San Francisco's culture. Happy to have this place around.", "author": "Jared R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-01", "description": "I'm more of a fancy cocktails type of person myself, but sometimes, a cheap dive bar just hits the spot, and this \"lounge\" definitely hit the spot. \n\nBartenders were friendly, drinks were stiff, and prices were cheap. Great place to just relax and hang out with friends. Plus, and older jukebox with older songs, but hey, I'll play Clash and Sublime songs all day, not a problem for me! \n\nThey also had a pool table and Ms. Pacman if you were so inclined. \n\nMinus one star though for having Wild Turkey 81 vs. Wild Turkey 101 though.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Awesome service. We know nothing about sf and the bartender just gave us so much amazing info!!", "author": "Mandy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "Stumbled into this bar in the mid afternoon, and boy were we happy. The drinks are strong, the decor is dusty. It's absolutely how a bar should be. Peter the bartender was great. The patrons inside were good company.\nThere's tvs, pool table and games in the back.", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Favorite neighborhood bar for watching Giants game on a Sunday afternoon ****** \nEddie's dancing behind the bar always makes the day.", "author": "Stacey C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-28", "description": "From the looks of it you would think it's a chill dive bar with plenty of seats and a table near the window in the front. However, the bartenders are terrible - snobby and judgmental.\n\nI came with 2 other people on a Saturday night . The moment we entered the lady bartender asked for our ID's and stared at mine for the longest time. Lady, it's me. I was 16 when I took that picture...\n\nMy boyfriend asked what beers they had on tap (I forgot what she said) but when he asked for Stella she gave him one that was already poured for the girls next to us (they ended up canceling the order). He stared at her and gave her a \"where did this come from\" look since he didn't know and she told him with an attitude \"I JUST poured it. It's what you wanted.\" Okay.. I gave her the benefit of the doubt cause maybe she was having a rough night. BUT!! When my boyfriend pulled out his debit card she scoffed and said \"cash only. You can use the ATM at the end.\" Did everything coming out of her mouth need have attitude with it\n\nHe went to the Bank of America down the street and paid. I was people watching while he went to get cash and noticed the bartender would whisper to what seemed to be regulars at this bar (late 50s males) and they would stare at a specific group (mainly younger girls) then laugh with her. Kind of regret leaving her a tip for the service she gave us and for the potential shit talking she must've done to her customers. At least be discreet about it..", "author": "Cathy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-22", "description": "Marina Lounge is less of a lounge and more of a divey sports bar. The bar's long with some TV's to watch the MLB post-season.\n\nThe average age of the bar patrons are probably around 45-70.. Tons of grey hairs with at least half of them drinking Coors Light out of a bottle.\n\nThere's only 4 beers on tap: Sierra, Fort Point, PBR and one more I can't remember at the moment. I had 4 beers which came out to around $24 including tip which is the right price for the Marina but expensive for a dive. \n\n- Cash only\n- Pool table, juke box, arcade games\n- Close to tons of good restaurants\n- Limited beer selection\n- Limited booze selection\n- Probably a place to bring friends or a date you don't like that much\n\nI'd say I would come back here but there's tons of other bars on Chestnut. I'll probably go to one of the other ones next time.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "Friendly neighborhood bar with fair prices , MRS lPAC man and pool tables. Cheers. UPDATE :  I come to my favorite city San Francisco every few months and I can't wait to get to the marina lounge and just relax and take it easy . always a good crowd, always with a great attitude, it's the neighborhood bar you always wished you had", "author": "Paul G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-30", "description": "Lounge is inaccurate, but this is still a great dive. Pool table, cd jukebox that is 3 songs for a buck, and the bartender was exceedingly friendly and awesome. I had a good time here on a Thursday night... Maybe you will too?\n\nOne star off for the weak beer selection.", "author": "Josh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Sully is a great bartender! Super friendly and welcoming environment, Always a good time  cheers!", "author": "Mikela B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "It's the local non douchey dive bar.  Scully (old white hair gent) is an excellent host and will mix you whatever you want.  \n\nGood place to unwind....don't expect disco lights and DJs.  But don't be surprised to see your CEO sitting next to you having a drink....It's happened to me.  LOL", "author": "Edward M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "Some hate dive bars, others (like myself) will actively seek them out wherever I find myself. I was super lucky via my Yelp search and found Marina lounge. San Francisco was burning a massive hole in my wallet so I was ready for a place that didn't cave in to the ever so abundant 8$ beer. Marina had an awesome vibe, full of die hard locals that coveted their city sports teams and didn't scoff at the non-familiar faces walking in. My warm welcome may have been due to the fact that I exude a warmth towards the dive scene and telepathically projected my allegiance to this type of atmosphere. The walls were littered with photos of old, giving you plenty to look at in between conversation. The wall facing the street had a massive window allowing you to people watch as well. I may go so far as to say that Marina was one of my all time favorite bars in the city, and one that I will make a point to go to whenever I'm back in town and in need of a drink.....which is always.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "Why are they playing Frank Sinatra songs in this place? This dive doesn't strike me Asa Sinatra playing Irish bar. Cool dive with friendly staff though.", "author": "Leo U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "In a neighborhood full of trendy brunch spots, this classic sports bar is an oasis. Strong cocktails and friendly bartenders, this spot is great.", "author": "darin s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "Please say hi to Sully from Sue Swiatowy.\nwanted to let him know we are having a high school 40th reunion. mid July....\nvisit Facebook\nwe set up a reunion group.\nHi Kevin!!!!\nMiss you!", "author": "Susan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "This is the perfect bar for unwinding, and Sully is the perfect bartender.  I spent a number of nights in the Marina during my husband's recent surgeries, and this bar was my first stop after getting \"home\" from the hospital each evening.  It's the perfect combination of action and comfort, friendliness and just-right drinks.  Thanks, Sully, and Marina Lounge!!!", "author": "Susan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "So glad we found this place. Right when we walked in we were greeted by a very friendly bartender, Sully. We got our drinks right away and he even charged my cellphone for me. It was a quaint little hole in the wall with great customer service. Will be back for sure!!", "author": "Lindsay S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-16", "description": "Surprisingly snobby service for a seemingly cool dive bar. Lady bartender made fun of my friend to other customers for asking if they had Blue Moon. Then we overheard same bartender laughing at girls wearing Lululemon (news flash: your bar is on Chestnut Street in the Marina).\n\nOverall, the front table is great for people watching but the service was downright rude to us and other customers. For a standard dive bar, I'd rather go to the hundreds of other bars in SF. I'll pass on marina lounge.", "author": "Geoff R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "Sully the bartender is really friendly and makes this place great. The prices are great also. Marina has a dive feel to it but many tourists come in which adds to a flare. I recommend coming to Marina lounge.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-04", "description": "I'm fairly new in town - thank goodness I've found my favorite local dive bar.\n\nMarina Lounge is the perfect spot when you just want a no nonsense drink.  I've always been able to find a spot at the bar, day or night (and I've been here at all hours of the day...).  Bartenders are not just friendly, but the kind of men you want sit and chat with for hours.\n\nFYI cash only", "author": "Lindsey G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-08", "description": "As everyone has reported, the bar is cash only. I don't mind because I think it makes for quicker service and more elbow room. \n\nI was here on a Saturday night and the ratio was horrible. Literally 5 girls to 40 guys. \n\nOne perk is they did have dice to borrow to play 1-4-24.", "author": "Marty J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-27", "description": "Yay !! Food is now at the bar. I posted the menu but do not feel limited. I was feeling breakfast one day and the chef asked me what I was feeling. I said grits she says ok have some. I'm like ok and a cute egg dish she said ok what don't you like in your omelette. I told her and within minutes I had the most amazing breakfast that was NOT even on the Menu. Point being she will work with you. And the prices are very reasonable.\n\n5 stars as I felt so special also a group came in once after she shut the kitchen down and sensing they needed food to soak up their alcohol they had before they arrived she reopened.", "author": "Vicky P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-18", "description": "Where has this place been all my life?! Actually...I walked by it for years but never actually went in until recently.\n\nWish I could come here all the time!\n\nWarning for others, this is not your typical marina bar. It sounds like it would be this chic modern lounge-y place but it is not. If you like sports (particularly Giants/Red Sox) talking to 'regulars' and the Sully the older bartender, small low lit probably won't get a seat places, you should def check it out!\n\nGot some drinks with my Dad here after work on a Friday and being the talkative people we are, made a few friends and having some great laughs with Sully. The drinks are also not too expensive yet good. I got a few jack and cokes and my Dad had some Anchor Steams. \n\nI will def be back!", "author": "Belem R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-08", "description": "We come every year just to come see Ed! He's San Francisco's best bartender. We don't go anywhere else!", "author": "Katie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "Great little dive.  It is basically the antithesis of Tipsy Pig.  \nGreat decor - LOVE the Flutie Flakes on the wall.", "author": "Alex A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "Great dive bar! The bar back was a great dude, very helpful for an out of towner. Talked baseball with ease. I had the Fort Point Villager IPA and it was perfect. I'd suggest this for anyone but especially guys with families or wives - go order a sandwich at Lucca's Deli and wait at the bar.", "author": "Trey O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "Sully is the best bartender in the city.  He is a delightful gentleman who will always remember your name. It does get busy, and fairly packed, at times but the crowd is nice and I always have good conversations. This is my favorite bar in the Marina.", "author": "Wayne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Warm welcome! My sister and I came in here on a whim (she's from Dallas) we immediately disregarded the small-bar feel because we were so kindly welcomed by Sully! We ended up coming back later in the week with our family bc the vibes were so positive! Great establishment! Touché", "author": "Julie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "Small but amazing bar. Great service. Sully is the friendliest bartender I have ever met. 1 pool table, fast drinks, and a great atmosphere. A hole in the wall you won't want to pass up for a couple hours of drinking.", "author": "Jacob S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "What a little hidden gem! This was the most pleasant bar experience that I've had in a long time! The bartender Sully is such a nice guy that I would go back just because of how welcome he made us feel.", "author": "Jackie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-12", "description": "I rarely use the race card but the moment we walked in the old bartender guy looked us up n down. My friend pull out his card he barked \"CASH only\" ok then I noticed a white couple by the window with two dogs I thought oh cool pet friendly. When the couple left I walked outside to get my puppy, the bartender yet barked at me again \"NO dog!!\" I though ok maybe the white couple's dog was a service dog... But the bartender kept looking our way... I couldn't even relax and enjoy my drink...I just had an uneasy feeling like we weren't welcome there so I downed my drink n left... I gave it two star because my Bloody Mary was ok.. But service could use some updating... It's unfortunate to feel like this in 2014 especially in SF...", "author": "Spoon P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-14", "description": "There's soooo many gassy people up in this joint... toxic gas alert!", "author": "Dani S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-07", "description": "I would give 3 stars for this mediocre establishment populated by the nearly dead.  But I got tossed once merely because a grumpy old off duty bartender didn't like what I was saying.  Nothing racist, homophobic, or otherwise offensive, she just didn't like what I was saying.  Ironically I was merely repeating something I heard from two Marina Lounge bartenders.  FU Marina Lousy", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "Nice little dive bar in the Marina. (I say that with absolute love.) We stopped in on a Sunday to have a drink while we waited for brunch and I ordered an Irish Coffee. The lovely bar keep made it nice and strong with fresh whipping cream to boot. Definitely stop in if you get a chance.", "author": "Jane F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-24", "description": "Went here for a drink before dinner. Told bartender I wanted to wait to order until my friend got there. I was told to go someplace else. So I did.\nNeed I say more? Never going back.", "author": "Stuart N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-31", "description": "The worst place in San Francisco! Rude bartender and weak drinks.  Horrible service! Saturday night and no crowd!", "author": "Kimberly R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-14", "description": "It's convenient, bloody mary was good. I mean thats as good as it is for me. Not gonna ask for a lot especially when I'm just in need of a quick drink. Oh yeah, and cash only.", "author": "Vanessa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "Our favorite bar when we are in town. Just a fun place to sit, drink and relax. Dave is the best!", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-19", "description": "Marina Lounge is everything you hoped for in a dive bar.\n\nGreat bartender who knows his stuff! Few beers on tap and a big selection of whiskeys.\nOld school rock playing in the background.\nFew arcade games (including old school style pac-man machine) and 1 pool table.\n\nI recommend coming during the day just to hang out and have a beer. The crowd is mellower...slightly older, but oh so much better.\n\n*Yep its cash only!*", "author": "Paula L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-09", "description": "This was the first stop to one crazy night in the Marina. The lovie knew a former classmate who works here, so we stopped in and said hi. \n\nThis place is TINY. 2 bartenders, one on each end of the bar, so pick a side. Good luck worming your way to the back as this place felt like a can of sardines. You get a sense of relief once you see the bit of open area in the back with the pool table. Bathrooms are also in the back with a few spots to sit down. \n\nCool stuff I saw: old arcade games, pool table, sweet juke box, and a couple of flat screens. Not much else besides that. Definitely a place where you can get a quick drink, but not a place I would spend the whole night at.", "author": "Grace L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-31", "description": "Great bar, kind bartender, bring cash and you'll have a grand ol time", "author": "Yunia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-17", "description": "My cousin and I were lucky enough to randomly stumble on this place when we were umbrella-less and seeking shelter from the cold, peltering rain.\n\nGreat little neighborhood spot right on Chestnut. Nothing fancy...just a low-key place where you can chill out, grab some Stella on tap & shoot pool @ $1/game...Nice.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-30", "description": "The bar is a little strange to me, especially in this neighborhood. To be honest, I am not quite sure what to make of the Marina district, expecially when this bar is in this neighborhood. \n\nI like the bar, it's small and the place seems like something from a bygone era. The bartender seems to know everyone there-except of course, for me and my friend. Even though we were new faces, and younger than the regulars by about 15 years. \n\nThe beer was surprisingly cheap for San Francisco and the neighborhood in general I think. Between the 3 beers that we drank-I had 1 my friend had 2 we didn't split one. Came out to a shade over six dollars. Color me impressed, obviously a place like this is quiet and I guess it's okay but it was a little too quiet.", "author": "Ted C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-17", "description": "Dive bar, fun, nice bar-tenders.  But small and no food.  And not a lot of room to sit.  If you can score a seat at the bar take it!  But don't expect any \"special\" service.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "Out for a walk with my wife, saw an open table at the open window an decided to have a beer. Friendly place, looks like a good neighborhood bar.", "author": "Ed N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-29", "description": "I'm really late in writing my review of the Marina Lounge, but it's better late than never. This is one of my absolute favorite bars in the country ... yes, country. I've visited a lot of bars, but Marina Lounge has it all. Pool table, friendly bartenders (Gary was the best ... RIP), great bloody mary's and even better patrons. I was a transplant in SF a few years ago and spent most of my Saturday's watching football or baseball games with the old guys who'd been coming to the bar for years. It's a friendly, relaxed atmosphere with reasonably priced beer and interesting characters. Plus, the little table that sits by the window which opens to the street is the BEST people watching spot. Every time I go back to SF, I visit the Marina Lounge.", "author": "KM Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-10", "description": "Rare of me to give 5 stars but they did it! I always think there is room for improvement but these guys have it down! The place is clean well kept with nice staff!  Old school video games which are alway drunken fun plus a small area for a pool table. Anything even slightly annoying is made up but the vibe, cool people and great service. I'll make sure I stop in every time I'm in San Fransisco! :) Thank You!", "author": "Raven R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-30", "description": "So you find yourself in the Marina, and you're thirsty, but you don't really feel like wedging yourself in between a couple slabs of meat who just finished their co-ed softball game and can't stop talking about how \"I Hope They Serve Beer in Hell\" has changed their whole approach to nailing sluts.  Where do you go?\n\nThe Marina Lounge.  The $$ only policy chases away all the first-year, fresh out of college sacks of Jager-bombs.  This is a relaxed, friendly place to savor a PBR and watch the various USC sweatshirts roam up and down Chestnut.  There is no better spot on planet Earth to sit and drink than the one, coveted window table out front.  Add a game of dice (supplied by the bartender-just ask)  and this is what drinking in the city on a Saturday evening is supposed to be about.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-03", "description": "My boyrfriend and I got stranded in San Francisco on Memorial Day b/c my car broke down (look out for my review of the Clement Street Auto Garage), so we decided to see a movie to kill time at the Marina Movie Theater. The movie wasn't going to start for another 40 minutes, and the Marina Lounge is right across the street, so we decided to get a drink first. \n\nThe bar was slow, but not empty. Just....relaxed. The bartender was very friendly and suggested the Liberty Ale b/c they only had Guiness in cans. 2 pints were $9.50. Not bad. They have a pool table and a jukebox, and I'm pretty sure they have darts as well.\n\nOh, and a plus: they had hockey playing on the tube.\n\nThis is one of a bagillion San Francisco Birthday 2010 Trip reviews that I will be posting. Check 'em out.", "author": "Kate C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-26", "description": "Marina Lounge is kind of small and somewhat annoyingly long and skinny (harder to enter and leave without making a big scene ;) ). But, it does boast a pool table and video games machine. For $1 you can play 4 games of nudey search (was is the real name of this game?!) and be entertained for a long time... The Marina Lounge was a fun stop on our bar crawl but would not be a great place to spend the whole evening...", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-05", "description": "we stopped in here for a post brunch libation. \n\nnice little spot - ususal suspects on the drink offerin's .... \n\nfriendly tender at the bar. \n\ngreat joint to swing into to whett your whistle.", "author": "Nik N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-18", "description": "I like the vibe at this place.  Pretty laid-back and there are tv's so you don't miss the games.", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-15", "description": "Jed York spotting.  Nuff said.\n\nCash bar only, bartender is really cool.  Pool tables in the rear.  It's a little cramped on the walkway, but one could argue that the place is intimate.  Low ceilings make this place feel even more sensually claustrophobic.  But the drinks are cheap and the patrons are usually pretty chill.\n\nGreat place to grab a drink with an old friend or even solo to catch the last few minutes of a game.  They got nice flat screen HD TVs and a non-abrasive vibe.  \n\nThe place won't woo you with bells and whistles or a scene crowd, but you can count on a good time.", "author": "Isaac L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-18", "description": "This is the closest thing you will find to a dive bar in the marina.  It is small with great bar tenders and a pool table in the back.  Only a couple tables with a great deal of regulars.  It is the kind of place you can sit in with friends for hours and just talk.\nDrinks are well prices (especially for the area).  I generally consider the Mariana to be full of \"bros\" however this place is totally off the beat and path from that mentality.", "author": "Red R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-16", "description": "Wonderful local bar. Great place to hang on a Sunday afternoon, or grab a drink before heading to one of the many tasty restaurant options nearby!", "author": "Steve F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-26", "description": "I don't understand the attraction to this want to be dive bar. It really has no personality at all,  crummy TV placement, and no draft beer. Why come here when you could go to a real bar and pay identical prices????", "author": "Jim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-05", "description": "Had a nice, early (Thursday) evening interlude at the Marina Lounge while waiting for my Marina eating destination to open.\n\nI only stayed for one beer, but it was a very enjoyable experience. The place is a comfortable sports bar -- not quite a dive bar, but casual, and populated by a cast of local regulars. The bartender, Gary, is jokey and good-natured, and very welcoming in a way you seldom see these days in hip SF. It probably didnt hurt that I was there at 5pm & the place was quiet and relaxed -- clearly, it has the feel of a place that livens up considerably as the night wears on...\n\nNevertheless, a good find, for me. I'll be back for a more extended visit very soon. (I'm sure there's some upcoming sporting event that'll serve as a useful excuse...!)", "author": "donal c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "Always a breath of fresh air amid the post-frat boy scene dominating the Marina. The crowd is about 20 years older than the rest of the Marina. It's rarely crowded, has a pool table, a great jukebox, and a solid bar. I always get anchor steam here, and would be hard pressed to name any other beer on tap, but I'm sure they are good too. \n\nIt's not always my scene, but I like supporting a real neighborhood almost-dive bar. Let's be honest peeps, if it's in the Marina, it's not really a dive bar.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-10", "description": "Something to not hate about the Marina. \n\nIf you ever find yourself inescapably stranded in this neighborhood (it happens to the best of us, we've all got that semi-douche friend or two who'll guilt you into it) just grab a shot and a beer from Sully and hole up here until the horrors have passed, a la Will Smith's evenings in \"I Am Legend\". Marina District cougars kinda look like those scary zombie dog-monsters anyway.\n\nPool table and jukebox.", "author": "Trav W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-25", "description": "Absolutely love Sully, the bartender. We visited from San Diego and couldn't have asked for a better experience. He's incredibly friendly and personable. Can't wait to go back!", "author": "Alexis K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-29", "description": "A few months ago, I had some relatives fly in from Toronto.  Even though they were here for a big family event in Oakland, they stayed in the city.  The night they got off the plane we planned to meet in the city for a few drinks.  The text message exchange went something like this.\n\nRelative: My cousins recommended that we go to the Marina Lounge, it's in this place called the Marina.\n\nMe: Sigh, I guess I'll have to wear my striped shirt.\n\nR: What?\n\nMe: Never mind, see you in 45 minutes.\n\nLook, we all have BlackBerries so we can text with perfect grammar and punctuation, okay?\n\nAfter donning a striped shirt, I arrived to the Marina Lounge from Oakland in around 45 minutes.  I proceeded to wait because my Canadian relatives got lost on the way to the Marina.\n\nStill, being alone wasn't bad at all.  I was able to soak in the bar.  This place is about as un-Marina as any place in the Marina can get.  Sure, most of the men there were wearing striped shirts, it is the Marina after all, but the vibe was very un-pretentious.  It's not unlike Bar None, except that it's more low key with an older clientele and the un-Marina vibe won't get shattered when a person that embodies all of the Marina stereotypes walk in, because they won't come in. \n\nI can enjoy being here.  But how come there's all this Red Sox stuff on the walls?  Since when did the Marina become West Boston?", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-19", "description": "There are many yelpers who hate the Marina, and probably would not review most places in this neighborhood, for fear people might find out they actually hang out here on occasion. \n\nThere are reviewers that love the Marina, and apparently they primarily hang out at MatrixFillmore so they don't review this place.\n\nSo, I guess it is up to me and the other few who go \"slumming\" in the Marina from time to time to give this place credit where credit is due. \n\nThe bartenders here are some of the nicest you will find, with the exception of that one who looks like Freddy Krueger would have in his living years (who still visits me in my nightmares and makes me afraid to go to sleep), but he may be gone by now, so don't discount this place just because of him.\n\nMarina Lounge is a drinking mans place for sure. Darkish interior, long skinny bar area, pool table in back, patrons who are so regular they are probably here for all hours the bar is open, jukebox where classic rock and 80s tunes outnumber the newer music choices by a long shot, and drinks that are poured heavy.\n\nIf only they could transport it to a different area of town because the douche bags still seem to find their way in!", "author": "Drue C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-20", "description": "Gets an extra star for the friendly and patient bar staff....The place is comfy if a little cramped.  Golden Tee for the Gents, Ms. Pac Man for the ladies...and Pool for all of your \"let me show you how it's done\" molester friends.  On this particular day, there were a fair amount of hexagenarians  who staked out the front...a bunch of skeevy Yelpers dressed as super heroes in the back, and a smattering of Elvii in full sequined regalia.  Perhaps this isn't the typical mix of folks....but hey, all went without incident.\n\nA little odd though....as I sat at the bar to enjoy my beer, I received a lecture cum public service announcement on the dangers of liver damage and drinking to excess\n\n....from a blue haired gentlewoman knocking back her 4th post lunch greyhound.  Thanks for the words of wisdom!", "author": "A J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-12", "description": "First off, any bar where the bartender takes a moment to ask you your name and introduce himself scores points in my book...\n\nI'm not a huge fan of several of the Marina bars (mainly because I'm nowhere near their target demographic), but I definitely dig cool dive bars or even regular bars that feel kinda dive-y...I'd put the Marina Lounge in the latter category.\n\nThe bartender (Sully) was great, the beers on tap were decent and I liked the layout of the bar. You have the Chestnut Street viewing window in the front, the bar in the middle and the pool table in the back...nice separation depending on what your ambitions are.\n\nCheck it out next time you find yourself in the Marina looking for a chill place to enjoy a cold one served up by a cool bartender.", "author": "Art D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-16", "description": "Everyone needs to have a favorite bar - you just do.  Make a decision and stick to your guns.  For me, it's the Marina Lounge, undoubtedly.  I'd like to think that it's the \"best\" bar in the city too, but that's just my opinion, man.\nThe small front table by the window may be the single most valuable piece of property in the city on certain nights.  Great spot for drinking, people watching and the occassion dice.\nSully bartends during the week and he is the best.  He remembers your name, shakes your hand, offers up great stories and sage advice - and will have a Fernet or two with you.  What more could you want?", "author": "Murray H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-01", "description": "I don't usually hang out in the Marina. This needs no explanation.\n\nI found myself at this \"Lounge\" last night.\n\nI'd rather drink a Jamba Juice at the mall.  The neighborhood feels a bit like a mall anyway.", "author": "Patrick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-11", "description": "Love it.\n\nTable in front with the window is great for hanging out ... chatting with your friends... or playing a round of dice...\n\nBar is great to just sit and have drink after drink after drink at happy hour...\n\nPool table is great to just play and play and play on a night when you don't really feel like meeting your friends at the really crowded bars down the street, but you don't want to stay at home on the couch.\n\nSee ya there this weekend!", "author": "Angela T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-17", "description": "This is a good bar to grab a drink with the locals.  It's not your typical Marina bar.  There's no hooting ex frat boys.  Likely, you'll find guys your Dad's age or higher here.  Want a quiet place to have a beer?  Play some pool?  Watch a game?  Here's where you go.  Nothing more, nothing less!", "author": "Andy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-16", "description": "I'm not the Marina type. I shiver when I hear the word. But I'm not about to boycott. So when some friends came up from the south bay yesterday to get an early start on St Patty's day celebrations, I went along.\n\nFirst place we went, Horseshoe, was just ugh. So packed with--let's face it--Marina types that we couldn't even make eye contact with the bartender, much less order a drink. Or move.\n\nSo we went down the block to this... this... wonderful unpretentious oasis. Ahhhhh.\n\nThe bartender was great. People seemed genuine. The place wasn't overly packed but the bar stools were accounted for with folks watching whatever game was on TV, so we headed to the back. My vodka sevens were strong and I was kicking ass in pool. Well, at least in one game. I didn't want to leave.\n\nMy only complaint: The juke box, though containing music appropriate to the establishment I guess, is a bit lacking.", "author": "Tara B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-23", "description": "This is a bar... not a lounge... not a destination... a bar. Thank god because the Marina just doesn't have much in the way of true watering holes. \n\nSully (who is there a few nights a week) is the man! Make sure you buy him a shot.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-23", "description": "Best Juke Box in the city and they have Pac Man - those two things alone make it an excellent spot!\n\nSully is always a \"charmer\" and I always have a great time!", "author": "jen v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-15", "description": "Plus:  The Bloody Mary's here are crazy good, with just the right amount of kick to them.\n\nMinus:  Some of the regulars in here make me want to kill myself.  \n\nPlus:  There is a great table with a big window that looks out onto Chestnut, so even if you decide to drink your Sunday (and your hangover) away, you can sit here and still feel like you're a part of civilization.\n\nMinus:  There is a great table with a big window that looks out onto Chestnut, so if you decide to drink your Sunday (and your hangover) away, you can sit here and feel like you're not at all a part of civiliazation.  \n\nPlus:  The bartender is very sweet, and nurtured us back to health after our fateful night at the Tunnel Top left us completely helpless and in agonizing pain the next morning.\n\nMinus:  Everyone in there has a grayish, doesn't-exist-in-reality hue to their skin.  It could be the bar's dungeon-like lighting scheme, or the fact that no patron has seen the light of day for a scarily significant chunk of time.  I feel like I'm drinking with the zombies from Thriller.\n\nHad a great day there, though.  It's old school.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-20", "description": "They should have a sign up that says CASH ONLY to warn customers ahead of time, or at a minimum the bartender should let his customers know BEFORE they order their drink(s).  \n\nI'm not one to carry cash very often, so I had to run out to grab cash from an ATM since he had already served us our drinks when he told us he only accepted cash.  When I returned, the bartender was really rude and said that I didn't have to accept the drinks.  It would've been nice if the bartender told me that it was cash only and/or that I had the option of returning my drinks BEFORE I ran out to the ATM machine.\n\nOverall, tiny and cramped, cash only, and the bartender ought to take a class on customer service skills.  With so many great bars to choose from in the City, this is not one I would ever go back to or recommend to any of my friends.", "author": "Kathy V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-22", "description": "My friends and I randomly wandered into here after our walk to the Golden Gate bridge. We were looking for a place to grab a beer and certainly found one. This place is almost a hidden gem. There were a bunch of regulars hanging out at the bar watching the Giants game when we walked in. \n\nWe found ourselves seated at the bar and even though there weren't many draft beers (hence my 3 instead of 4 star rating), we managed to find some Anchor Steam. Anyway, the bartender was super friendly and treated us just like we were regulars. Cool place to hang out.", "author": "Cathy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-04", "description": "A couple of us from a long-ago softball team would meet here before games for a couple quick drinks.....\n\n...flash forward 3 years and Sully STILL remembered my name (and what I drank). That scores points for any bartender and I don't care if it's in the Marina or not.\n\nThis is a great little bar where the purpose is to drink and talk. The staff is great and sitting in the front window on a Friday afternoon watching ze ladies is but one pillar that this great country stands on.", "author": "Steven M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-16", "description": "Love this bar. My Wife and I ran into this place and loved every minute. A true American bar.  Beats any Canadian substitute. We will be coming back soon.", "author": "Shane P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-16", "description": "Ow!  What is that pain in my chest and lower back?  Oh yes, it's the trauma from being smashed into a funny-car situation at The Horseshoe,  San Francisco's own personal attempt to simulate a drunken riot in New Dehli.  \n\nIf you tire of the sweat and immobility of some of the neighboring hangouts, the Marina Lounge might be your cup of tea.  Long Island Iced Tea.  You feel me?", "author": "Sam M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-31", "description": "A great neighborhood spot.  Belly up to the bar, listen to some good tunes - what more could you ask for?  Sully behind the bar! \n:)", "author": "Catherine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-30", "description": "My friends and I went to the Marina Lounge and we had a lot of fun the bartender can make a stiff drink and the people in here was just kicking it. If you dont have a good time you must be a sad person....................", "author": "Peter H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-04", "description": "Made me want to call this place \"my local\" when I lived nearby a few years back. Small but welcoming and there almost always is room at the bar.  Sully is a pretty cool guy - like a bartender from a bye-gone age.", "author": "D M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-26", "description": "Sully's the nicest guy ever.\nVery relaxed, great alternative to the Marina Lounge. A bit more relaxed.\nI'm going tonight...!", "author": "Scott K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-11", "description": "Forgot that I came here 6 months back, and I'm a big fan of it.  It's a bit crowded but a nice bar and friendly bartenders.  I'd come back here.", "author": "Ankur P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-16", "description": "After a yummy dinner at Ruth Chris steakhouse last night for Dine About Town, we ended up in the Marina for drinks and stopped in here for a pint of Stella and a Sapphire tonic. The bartender was friendly and I liked that it seemed like a place to just get a drink and actually relax without feeling like you have something to prove/flaunt/get noticed..then again, it was a little early in the night. The music on the jukebox was good too. No 'Single Ladies' to be found, just good old fashioned rock.", "author": "kristin e."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-27", "description": "Came here on my first stop of my grand marina happy hour tour.  Place was filled with middle age and older clientele.  Old guy bartender was REALLY nice and attentive.  Sadly there were only 4 beers on tap and a Librerty ale set me back $4.75 (during normal happy hour time).  The jukebox was full of great classic rock, and for you fellow Texans, it has two Stevie Ray Vaughn albums AND some Jerry Jeff Walker.  Sadly it also has four Jimmy Buffet albums.  All in all, not a bad little bar, but it could use some work.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-18", "description": "down-to-earth and fun. Sully the bartender is a sweetie who pours a mean-ass drink ! the owners are gentlemen in a town full of scoundrels -- I hope this bar is around for eternity and beyond", "author": "Prima D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-16", "description": "During my forays into Marinaland, I have often taken shelter in Donahue's Marina Lounge. During the day at least, there's a refreshing lack of image-consciousness and some regular old dudes at the bar. Cheap pool, cheap drinks, minus the prom queens. Score.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-22", "description": "Dear Sully, Gary, David, Peter, Eddy and Phoebe. Since I work across the street, I see you all five days a week, which means I collectively spend more time drinking Fernet and Jameson on the go at the Marina Lounge than anywhere else. I also wouldn't change it. Thanks for all being so uniquely charming and/or stoically resigned to your hangovers for                 the last five years, and here's to another five years of paying you all to   continue destroying my future slowly.  Thank you and love Brant.", "author": "brant f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-18", "description": "I have to second the last review. Bartenders are super friendly!! The place does get crowded on weekend, so I tend to go during the week. If you like it stiff, (DRINKS) this is the place!", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-20", "description": "The most unpretentious bar in the Marina, if you like that sort of thing.  It's not a dive but not fancy, not trendy, not quiet but not super-busy, there's really no way to describe it because it's not anything.  Just a friendly bar, barely big enough for a counter and a pool table in back.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-05", "description": "This is one of the best places to relax after work. All the bartenders are great, these guys are good for a conversation or just a drink and they actually remember their regulars. Their drink selection is also wide and the pool table/jukebox/old video games make this place as entertaining as you want it to be.", "author": "Natalie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-16", "description": "I went to this place for the first time last night and wow.  Who would of thought a real bar with a friendly bartender that's not expensive.  Dark wood, Pabst on tap and a flat screen with the game on.  I gotta tell ya the Marina just got a point in my book.  I'm definitely going back.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-21", "description": "Gary the bartender was wonderful...law school buddies and I went here Friday night to do something other than study...it's a hole in the wall that only takes cash but he made our evening fun!!  Aside from telling dirty jokes and keeping us entertained the drinks were reasonably priced and don't even bother ordering a purple hooter...apparently that's not a shot!!  I would consider coming back just for the bartender...BTW...an 80 something year old lady walked into the bar and Gary asked a couple of guys to move over because they were in her usual spot...he took care of her which I thought was very sweet!!", "author": "Karen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-17", "description": "Nice little hang-out. Kinda small, but really friendly neighborhood bar. My girlfriends and I come her quite a bit on weekday evenings. Drinks are affordable and the place is totally chill. Recommend!", "author": "Cathy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-17", "description": "Any West Coast drinking establishment that proudly displays Red Sox gear gets a check-plus in my book.", "author": "Felecia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-25", "description": "I stopped by with a date early in the week. A few regulars were at the bar sipping beers. I felt a little out of place, being a fair bit younger than the middle aged crowd. The owner was cool though. We shook hands and I got a beer. Not a whole lot of beers on tap, but there was Anchor Steam and something else that I recognized and liked. The back of the bar is fun, with a pool table, classic rock heavy jukebox, and a Pac Man machine! No one was putting money in the jukebox, so I had fun loading it up with some David Bowie and losing quarters to Pac Man. The place had a very Cheers vibe to it, \"where everybody knows your name.\" Would go back again to hang out with a date or friend on a weeknight.", "author": "Brandon N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-24", "description": "Marina Lounge is our favorite neighborhood bar.  Sully and David are the friendliest bartenders (Sully likes shots of Fernet if you want to buy him one) and are not shy about mixing strong drinks.  The pool table in back is fun too and not super crowded like at Mauna Loa or KT's, you can actually shoot pool without having to ask people to stop sitting on the table.", "author": "Shondra S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-16", "description": "Great place to settle down for a cold Bud and a game of Ms. Pac Man or pool.  Refreshingly unpretentious in a hotbed of pretentiousness.  Barflies mix with Marina types, providing for interesting conversation, people-watching, and a good way to pass the afternoon.", "author": "Lucas M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-28", "description": "The neon sign beckoned us to close out the night  at the Marina Lounge. We were already pretty toasted by the time we ducked into this little non-descript bar in the Marina District. It has the scent of a dive bar. This is about all I can remember. Fade to blackout.", "author": "Greg B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-09", "description": "I love this place.  One of the greatest parts is the regulars.  You gotta love a bar where everyone knows your name.  Friday afternoon cocktails with Gary, the bartender are a perfect way to kick off the weekend!", "author": "M B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-24", "description": "Like many have said, the bartenders here are some of the nicest you'll meet. They genuinely want to get to know you and want you to feel at home here (even if the Marina is the last place you'd want to call 'home'). \n\nWith all the new trendy lounges slash bars slash restaurants slash barber shops that keep popping up, it's hard to know what's good, what's overhyped, and what's lame. The Marina Lounge is a consistenly good spot to meet up with friends for a drink, or chat with one of the bartenders over a cocktail.", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-26", "description": "this place is great. i was going to monaghans and the horseshoe before i found it, but now im in love.\n\nits a divey bar with an awesome bartender. i love to sit in the front bay window and people watch.\n\nplus, its the best place to go after work and let off some steam.", "author": "Ameigh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-11", "description": "Small bar, great bartenders, dice games if youre up for it, cozy pool table, pacman, and some video golf game. No pressure and 100% less Marina Douchebags than all other Marina bars combined! Good times, anytime. PS Gary is your man on thursdays - saturdays until 630 pm! tell him lisa sent you. and then duck.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-21", "description": "Not going to 'bash' the Marina. We live here, we love it....We've been wanting to check out the bars so we started with this one. Gary is a witty, good humored, dice playin' kind of a bartender. Drinks are reasonalbly priced - Margarita is $6. It is clean, and kick back. We sat at the bar but the window seat would have been SWEET - next time! If you don't want any frills, but you want to wet your whistle, go to the Marina Lounge.", "author": "Barbara N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-30", "description": "marina lounge is a regular dive. nothing fancy, just a bar, pool table, jukebox, and pac man. good cheapish drinks. Bartenders are nice and its not a pretentious place at all. They have Pabst blue ribbon on tap, and that's what I really like about there. We started our night here on a Saturday night and there were mostly guys there. I didn't see any annoying marina chicks or ex-frat boy  types there, and that was a nice change. A bit of an older crowd at times. \n\nIn conclusion, its a pretty cool place", "author": "valeria b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-30", "description": "This bar is great - bartenders (Sully especially - unless you call him Scully) are the friendliest most down-to-earth guys around. No BS and yet they can certainly shoot the shit... They remember everybody which is amazing and they are generous in their pours... Unless they don't like you ;)", "author": "Raul L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-06", "description": "If you're looking for a tavern with a friendly bartender, this is it.  The husband and I were staying nearby with kids in tow, and bonus...  my parents.  My dad was happy to hang out while the kids were sleeping, and the husband and I charged outside into the cool night in search of a beverage.  \nHorseshoe looked to be our speed, but it was packed.  We wanted a place where we could just hang out and sit at the bar.  We happened upon Marina Lounge, and it was love at first sight, lol.  The empty barstools, Sully, the classic rock jukebox, the fratish type dudes playing pool in the back...  maybe it just reminded us of every Irish bar we've ever been in in Chicago.  Maybe it was the ice cold Miller Lite. Maybe we were just happy to be away from our kids, who took 2 hrs to settle down to sleep.  \nWe were in heaven - loved every minute of it - all 90 of 'em until reality set in and we hightailed it back to the hotel to our sleep-deprived kids and my awesome dad who was going on Eastern Standard time.", "author": "L T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-12", "description": "A totally chill bar that doesn't take itself too seriously.  I took a pass on nearby bars that were booked with style mavens.  I just wanted a drink and a place to sit.  The glow of a big screen tv lured me into this humble looking bar.  A jukebox was playing good music.  Sports on the tv.  Relatively cheap drinks.  Friendly patrons.  And a place at the bar to sit my ass down.  Score.", "author": "sarah k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-08", "description": "yeah, I used to be one of those people that hated the marina....my scene was the mission, or haight, anywhere but the marina.  well, I live in the marina now.  no, I don't care for all the strollers these days, but it does feel a llittle safer (for my car), etc. - perhaps I'm getting old.\n\nanyway, Marina Lounge - it ain't Wine Star, thank god.  it is thee best neighborhood bar.  period.  Sully, David, Eddie, Shannon, Phoebe - hell even Gary are great at what they do....get me loaded. \n\nCheers to Donahue's Marina Lounge!", "author": "david s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-28", "description": "Awesome and friendly bartender.  Pool table in the back.  Jukebox near the bar.  Awesome bartender once again.  And friendly patrons as well.  It felt like Cheers.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-17", "description": "biased 5 stars.\n\ni cannot believe i have not reviewed the marina lounge already?!\n\nsully is great. he used to card me, but then after a mild hiatus I finally started coming back regularly; he now knows my drink, and drops $5 in quarters on the bar for the table.\n\ni come to the marina lounge to do three things - drink, shoot pool and clear my head. i recommend grabbing a glass, shoot some pool and play dave matthews, the black crowes and frank sinatra on the jukebox.\n\nthis place stays packed on friday and saturday nights, and anytime there's a decent game on tv.\n\njust look for the neon sign on chestnut and a smile behind the bar.\n\noh, they have pacman!", "author": "Bruce A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-25", "description": "Great neighborhood bar.  If Patrick wants a Jamba Juice, there is one up the street.  But if you go to the Lounge, sit down, enjoy a good drink at a fair price.  The bartenders are great, the jukebox is second to none, the pool table is fine and I can even play the old style game of PacMan.\n\nPeople are friendly.  You can bring food if you like.  \n\nThe Marina Lounge is a great neighborhood bar.", "author": "Allan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-15", "description": "A great dive in the Marina where they love their Fernet Branca, pour stiff drinks, stock the jukebox with killer tunes, and create a very warm, fun, hard drinking atmosphere. I see a lot of bartenders here and that's always a fantastic sign, like seeing a chef constantly eating at another restaurant. Like the Page bar, they simply are what they are, which is an institution and the least pretentious place in the Marina by far. The bartenders are good ol' fashioned hard drinkin' bartenders like Sully (who loves his Fernet, so if you wanna get in good quick, buy him a shot), Gary and Ed who always have a pat on the back and will have a drink with you. I think the bald guys name is Dave, and he was cool too, but the one night I was here when he was, a really pretty girl was barbacking, which, was distracting and somewhat incongruous, but AOK. Great bar, so play some pool, play some Pac Man, shoot back some soldiers, and get drunk here as much as you can!!", "author": "Steve l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-26", "description": "I've never been inside, but my dog loves this place because Tony always has treats for him in the morning :-)", "author": "Peter J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-13", "description": "I have always had a great time coming here for a before dinner drink with friends.  The bartenders are friendly and we usually play a game or two of pool and rock the jukebox.  Good relaxing crowd.", "author": "Robert D."}
