{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-25", "description": "5 stars if they didn't mess up an order.\n\nLots of good coffee, tea and drink choices along with sweet and savory breakfast and lunch options.\n\nMy brother in-law tried the coconut milk iced coffee but it tasted off so asked for something different. When he asked for a latte they made it iced (but that wasn't what he ordered). Oy vey\n\nSome tables inside and several outside when the weather is good.\n\nWould definitely come back as the employees are nice and coffee (I had a cappuccino) is good", "author": "Jesse B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "One of the most local, humblest places you can go to for a small coffee. That's it. That's my yelp review. \n\nBut seriously, great staff members and customer service. Coffee drinks are unique (coconut milk latte with strong amount of coffee), quality is decent, pricing is budget friendly (which was the \nmost surprising of all).", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Convenient location and spacious place. I tried their iced coconut latte, and it was amazing. From the exterior, I did not expect much but I left with a happy tummy and satisfaction  :) \nTheir pastries and desserts looked fresh and delicious as well, I'd have to come in again and try. Thanks Martha for this nice experience!", "author": "Jina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "Apparently some places in Bernal Heights have the gall of closing shop in the afternoons when I'm starving and looking to load up for a picnic. \nEnter Yelp, its life saving recommendations, and Martha & Brothers. My crew loaded up on their prepared foods and I got the coconut cold brew because apparently being an adult means you're exhausted if you get to bed after 9pm. The coffee was incredible and unique. The coconut flavor cake through heroically; not overpowering the coffee but shining bright like a diamond. It was just sweet enough and gave me the kick in the pants I needed to hike up to Bernal Heights Park. We stopped right as wen entered and split one of the burritos because my husband was hungover and crumpling like ball of foil and I had no excuse. The burrito was fantastic: all the ingredients tasted fresh and even though it was pre-made it wasn't soggy. We hiked a bit more and hit up the two salads we bought, curried chicken salad and Greek. The ingredients were so fresh, the greens were super flavorful and fresh, they both were really filling with lots of protein, bright flavors, and various textures. I was really impressed and can't wait to go back to hit on some of those baked goods.", "author": "Marcy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "I'm obsessed with this place! It's a shame that as an SF born and raised individual, I never knew about this company. However, I am glad that I found it jus a week ago (better late than never). The employees are friendly, the food is tasty, and the coffee has always been fresh throughout my visits! \n\nWhat caught my attention were the PLENTY of glass cases containing various homemade goodies (crumb cake, almond chocolate cake, pumpkin cheesecake, etc.)  Although it was a tough decision I chose the almond chocolate. It was moist, fresh, and to my surprise had some cream cheese lining between the chocolate and almond bread! So good!\n\nMy usual here is the iced mocha with almond milk and whipped cream. It never disappoints. \n\nI'll definitely be coming back regularly. :)", "author": "Tiffany Rose F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Can't say it any better than this sage advice.  \"A picture is worth a thousand words!\"  Organic coconut milk latte.  So yummy!!", "author": "Jonathan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-11", "description": "short line in the afternoon...taking a coconut almond milk latte and a chocolate cheesecake cupcake...few minutes and ready...space is small and tables are cramp, but finding a place to sit...coconut almond milk latte was great...tasty latte with subtle coconut flavors....highly recommend getting it...the chocolate cheese cupcake was extremely sinful...delicious thick chocolate cheesecake inside...moist and good...", "author": "Hen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "Started going here recently after starting a job in the area, so I am here 2-3 times a week now.  I no longer go to the Starbucks nearby and come here instead for mainly two reasons: 1.  Starbucks does not carry sugar-free hazelnut syrup for coffees; I need to watch my sugar intake so I was super happy when I found out Martha's carries it.  2.  My Americano order comes to me steaming hot (how I like it!). Even after I add cream, I still have a hot cup of coffee, opposed to a warm cup like at Starbucks.  They must heat their water to a higher temperature or something.  They have an AWESOME selection of really great pastries and breads; I usually get the banana bread.  They have outside seating so you can go outside and enjoy your coffee in the sun.  Their staff is also wonderful.", "author": "Sofia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "What a great neighborhood coffee shop.  Stopped in on a Saturday morning at around 7 am, after my run with full intention of purchasing coffee but was lured towards the freshly squeezed orange juice - it was pricey at $3.50 for an 8 oz but man was it delicious!  They had all these lovely looking breakfast pastries, homemade protein bars and just an assortment of sweets and snacks.  They also had salads and sandwiches.  It looked like they had a good assortment of coffees too.  I'm definitely coming back.\n\nThe service was lovely - and they just seemed generally happy!  Good start to the day.\n\nI've passed by several times and it's always packed - even on a 7 am on a Saturday morning!  They had free wifi and clean restrooms.", "author": "Erika R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-01", "description": "By far the worst coffee in Noe Valley. No idea what is going on with the positive reviews. The neighborhood is  charming yes, but let's not give this shop credit for that. I've lived in the neighborhood for 10 years and I end up trying this spot a couple times a year thinking it can be as bad as I recall, but it is. The coffee always tastes burned and the staff, while pleasant, always seems a bit befuddled about how to go about their jobs.  Pastries are just okay at best--and are often stale or disappointing.", "author": "Kelly W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-31", "description": "Of all the Martha's locations in the city, this one is my favorite.\n\nThe employees are super friendly, and they make good coffee and food. \n\nI have had not so great experiences at their Cortland St location, but the employees here are always so nice, no matter how busy it is which I can't say the same for the other location.\n\nIf you stop by, get one of their bagels!! So good!", "author": "Stephanie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "If you need a serious pick me up, this is your place. The iced coffee is so strong and bold yet so delicious. I only came here for the iced coffee so I can't say what the food tastes like or how the other drinks are. \n\nBottom line: ICED COFFEE. No shots needed. \n\nPlus this neighborhood is super cute so you can walk around on a nice day or go to the small park across this place.", "author": "Cheri C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-24", "description": "I stopped by for a muffin and coffee but left without finishing either. My muffin was nearly frozen stuff and tasted like it came from Safeway, and the latte was scalded and just tasted bad.", "author": "Weston O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-23", "description": "Bought a cappuccino, and it was perhaps the worst gut-wrenching gutter slop excuse for a coffee drink I've ever had. I couldn't even sip it. The place is rather dirty as well, and there is a hanging smell of rancid coffee throughout the place, and coffee display bins are covered with yellow-black grime. It was nothing short of terrible. I do give one star because for one its the lowest option given I'm glad I didn't vomit, but the people were nice and they do have WiFi, so thats a step up from 0 stars. Honestly, from the quality of the coffee I will never step foot in there again.", "author": "Topher K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-17", "description": "The French roast I purchase by the pound, it. Is the BEST French roast ever.  The staff is cheerful, friendly and\nServe the coffee, tea and everything else with\nAttention and a smile.  The 24th Street store is quite small, and I keep wishing they would expand into the next door store.  But still the BEST!!!", "author": "D'oh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-16", "description": "Loved my time here! Came in on a Monday and stayed for a few hours to get some work done! Chill and quiet atmosphere perfect for some alone time. Iced coffee was also great as well, although it needed a bit of sugar.", "author": "Karima K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Best coffee on 24th St. Best bagel and cream cheese too. (Bagels are from next door but they put more cream cheese on it). Ask for Miguel. Very friendly.", "author": "Josh F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "Great staff. Seriously! Super yummy treats, too. Mediocre coffee, though, especially their cold brew. It's disgusting. My work will sometimes bring in coffee from different places in unmarked containers. Whenever it's from Martha's, I can tell immediately... and when I ask, sure enough, it's Martha's.", "author": "Amber M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "I'm with the other five star reviewers.  I've been coming here for 20 years, and no other coffee tastes as good to me.  It is NOT burnt tasting, folks!  I always get the Red Eye, packs a punch and delicious.  Lots of good food, and friendly & familiar staff with ultra low turnover.  A beloved Noe Valley institution.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-01", "description": "Thankfully I drink black Americano... The barista was actually clipping his finger nails behind the counter. Clippings went flying and he left them where they fell.. When I asked him what he was doing he shrugged and giggled ... And finished off his last 2 fingernails...\n\nI have seen a lot of things in my life but this is a first... \n\nSorry Martha but I doubt I will ever be back", "author": "David B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-16", "description": "I am bummed with Martha's today. \nI ordered a mocha with almond milk and the milk tastes so burnt. I use to love this place a lot in the past and my drink was perfect every time but today...it just tastes off and burnt. The burrito I bought was good and the staff was super friendly but the drinks have gone down hill. \nOh how I wish there was a Peets so I can get my ideal mocha drink instead of something burnt. This makes me so disappointed because I really was craving a mocha but now I have to find a new coffee shop. \nBuh-bye marthas!", "author": "Star S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-17", "description": "I've been a long-time Martha's customer. Love the strong (OK sometimes over roasted coffee).  This review is about the ambiance and lack of it.\n\nI guy comes in with his pet parrot, or whatever noisy bird it is, sits down at a table and let's the damn thing squawk and screech.  The baristas think this is cute!  Maybe if I was pouring coffee all day this would be a welcome distraction but SERIOUSLY this is a frickin cafe.  Do I bring my dog and let it bark?  Do I bring a small child and let it scream? Do I play my Spotify without headphones?\n\nI asked the dude to quiet the avian racket or leave.  He looked at me and said no one else was complaining.  So if it doesn't bother the majority it's OK? Rude, overwhelmingly clueless, or both.  Appealed to the baristas to no avail. See review of loud barista and finger nail clipping.\n\nIs decorum dead in SF?", "author": "John D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-07", "description": "After getting something for my furry babies down the block at Noe Valley Company, I've often -only if I don't have dogs with me- stopped in for one of their treats such as the blueberry coffee cake. There's a good selection and they all appear fresh. However, the coffee? Not the best. Tastes burnt even though they seem to take their time.", "author": "Kristina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "The perfect neighborhood coffee house-great coffee, good pastries-breakfast bagels. Wonderful service-Martha herself is an institution.", "author": "David K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-11", "description": "Standard coffee and pastry shop. Came here on a Sunday afternoon and wasn't packed at all. Nice and quiet.\n\nAll of the things I ordered were just meh. Ordered a mango iced tea, green chile breakfast burrito, and a vegan chocolate chip cookie. The mango iced tea didn't have much mango flavor, and the burrito was just popped into the microwave. The vegan cookie was standard for a vegan cookie. Everything was relatively cheap-ish.\n\nIf nothing else is on my mind, I'd probably just return for a standard coffee. People behind the bar were nice.", "author": "Shawn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Best coffee In Noe Valley! \n\nBut have to make one thing clear:\n\nMiguel is my man!!!!!! I alway have either a passion latte or caramel latte. And there is a world of difference between how Miguel makes them and the rest. \n\nActually I have started not wanting to be served by anyone else since he is that good! \n\nGo there and support the local! This is head and shoulders above Starbucks.", "author": "Kristoffer R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Stopped by for a quick coffee and parfait and now I know where my favorite coffee shop in noe valley is. Definitely coming back!", "author": "Ian E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-16", "description": "We went to this coffee place yesterday for the first time. We had a horrible experience in there. There were two guys working in there where one of them making espresso who didn't speak much English while the other one spoke English. The guy who spoke English was very loud to the point that my friends and I couldn't hear each other. I noticed a couple of people talked to him to keep down but he just didn't care. Then I went to him and told him to keep down or I'll report him to the owner. He said that he didn't care whether I reported him or not. Also he was just talking and laughing hard continuously and not even working at all. \nThis was one of the worst and rudest employees that we've ever seen in any coffee shop in San Francisco. Also their coffee is terrible. So stay away from this place as there are many other coffee shops where you can get much better coffee and customer service.", "author": "Jack M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-12", "description": "This rating is for the service, not the coffee.\n\nJust had a bad experience. The guy responsible for making our bagel began to multi-task. This resulted in the food to be cold and prepared improperly (wrapped messily).\n\n1. In the middle of making the food, he began preparing a large drink order.\n2. Walked away from the kitchen / food prep area to check a fuse box. WHAT?!\n3. Answered the phone--then proceeded to make my food WITHOUT washing his hands.\n\nHad to the nerve to say, \"sorry\".  Trust me, he was not sorry. \n\nHighly disappointed with his service.", "author": "Charlie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Love this coffee shop. There are typical dessert choices and a few premade salads, etc ( not made in house.) \nSo why do I love it? This is a great place to get work done, or meet a friend for coffee.\nThe music is good, the staff is uniformly lovely, and there's wifi.", "author": "El B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "My go to coffee place in SF. Really good cappuccino and the bakery products are excellent as well. Nice outdoor seating as well if you'd like to enjoy the sun", "author": "Rohit N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-13", "description": "I stopped by here for breakfast and it is a medium sized coffee shop with friendly staff and comfy vibe.\nThe coffee is great here and just the perfect temperature. I had the caramel latte with 2 percent milk. this coffee is very good.  A drink to start my day and it was in perfect temperature. After first sip there's shot sensation and a jolt of caffeine to wake your taste buds up and then slowly your body. Coffee is a 4.5.\nThe egg, tomato, onion with bacon on bagel is great. the egg is fluffy and hot and went great with tomato and onions then bacon. but after a few bites the bagel was semi crunchy and soft. Inside the bagel was excellent but the bagel was not. sandwich was 3.75.\nthe staff are great too. customer service is 5.\nVibe of this coffee shop is a 4.", "author": "Jade M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "Always happy with my coffee and food purchases. \nGood pesto veggie sandwich, good smoothies, and coffee. \n\nI'm not usually left disappointed with what I get at this location. Almond milk lattes are good and drip coffee are reasonably priced. They have a delicious assortment of pastries to choose from. This is usually my stop when I'm on my way to work when I do take Bart or Muni into work.", "author": "T. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-01", "description": "This is my favorite spot for coffee on 24th street in Noe Valley for a variety of reasons. \n\nFirst, the coffee is great and on top of that they have a wide selection of of coffees. \n\nSecond, they have a large, fresh, awesome selection of pastries (suck it Starbucks). \n\nThird, the people behind the counter are super friendly. \n\nFourth, the people watching here is solid. You get all sorts coming through, and Martha's feels like a mecca for the neighborhood. \n\nFifth, the outdoor patio is cozy and inviting and since the expansion into the street, there almost always is room. \n\nSo go for the coffee, but stay for the view/seating/food.", "author": "Ari L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "TOP!!!\nBest coffee so far in San Francisco! Had the Macciato, will go for a second one!!", "author": "Jonas C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "I work down the street and I'm there everyday. Lots of regulars and I love the famly feel of the shop. Everyone is friendly. They offer service with a smile and the food is great. I love that they recently started serving fresh salads.", "author": "Roshawn S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-16", "description": "After years of Noe Valley residence, I've noticed a few things about this place.  First, they are somewhat inconsistent on how much they'll charge you for coffee if you bring your own cup...once they insisted on charging me $2.25 to fill an 8 oz cup.  I argued that it should be $1.50 (the cost of an 8 oz coffee in their paper cup).  They said \"No\" and wouldn't budge.  \n\nThat said, once I came in and handed them my personal cup and asked for coffee.  They filled me up with decaf.  I corrected them. No problem.  She took my cup back and, where I thought she would dump the decaf in the sink, the woman poured the coffee back into the top of the brew machine.  I was horrified.  I don't know what shocked me more, the general hygiene violation or the pouring of coffee back through spent grounds.  Argh.  Either way, I've resolved to go elsewhere for my morning cup.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "Marthas is hands down the best coffee in this part of the city and possibly the best latte in San Francisco!  Martha herself (along with her mother, cousins, etc) has been seeing to this for many years!  Such an amazing women run business that has withstood the test of time in a city where small businesses come and go.  Pay a visit, have a great cup of coffee and support a San Francisco neighborhood icon.", "author": "Barbara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-30", "description": "People were nice. The bagel and cream cheese were good. Except maybe too much cream cheese. But my coffee was terrible. It tasted burnt. I got a mocha and it was unfortunately awful.", "author": "Beth E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "A cute little family owned coffee shop! That has a super chill atmosphere and close knotted vibe and it wasn't too busy! The music was a bit loud and the menu was a bit confusing! BUT, the service and food was great! They obviously had some really well known regulars and were warm and welcoming! Some great lattes were enjoyed on the lovely outdoor seating! Two thumbs up!", "author": "Elspeth L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-15", "description": "Good location and nice space to sit and talk/work. Th coffee is not great -- all of my cappuccinos here have had this burnt taste. Will probably skip this place whenever there is a choice.", "author": "Rajhans S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "Okay so coming here for nearly two years and close to 3-5 times a week I can safely call this home away from home. It feels like waking up in the morning and going into your own kitchen and having a favorite aunt or big brother make you breakfast. And the best cup of coffee you could possibly enjoy. Because of course, you can't make it that well yourself! Every single person is warm, kind, and works incredibly hard. I am blown away by how they remember every single persons name and order. I love the curtados, cubanos, bagels, the salad with beets and the caramelized pecans that Martha makes especially for me (thank you Martha!!!) The cucumber tea on ice is so wonderful and refreshing as well. Even if their coffee wasn't as good as it is, I would still go in their to get the best morning greeting from all of the wonderful people at Martha's!", "author": "Juliana O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "Pastries galore & free wifi!\n\nIt's hard for me NOT to give them 5 stars. Or maybe im being too easy on them. \n\nThey have plenty of fresh pastries!! gahhhh!! it's so hard to choose, especially when they have healthy vegan cookies and bars too.\n\nI randomly just found this coffee shop, because i really needed a place with internet. It's a small cute coffee shop next to ladybug ladybug shop and their staff was really friendly. Considering the fact that i was working and lost track of time,and they close at 8, yet they didnt even bother kicking me out or let me know that they were closing. \n\nSo i guess the 5 stars goes to their service, free wifi, variety of drinks, variety of FRESH pastries, and it wasn't freeezing cold in there!", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "I am rather fussy with coffee, I really miss Australian Coffee. This is the closest I've found. Staff are great and very friendly. I haven't had food from here, but double thumbs up on the coffee (not the drip variety) / latte. Mikhail is the best.", "author": "Jaye T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-13", "description": "Never been to this location until yesterday. I've visited the Martha's on Mission quite a lot back in high school and all I can recall are great memories with great company and random conversations with police officers on occasion. I would always stick to the typical mochas, caramel macchiato or vanilla latte.. you could never go wrong with that! \n\n4 years later, being the new foodie and still the same ol' coffee-goer, I was in the area with my sister and we were craving some sort of beverage after lunch. Since I haven't visited Martha's in SO long (I've had too much Starbucks in my life especially in college) and my sister has never been, I thought it was a great time to stop by and check out this one. It's a smaller location, but still plenty of seating. Saw lots of people with their laptops; guess this is still a great place to come to! After glancing at the menu, I decided to try their Mate Latte, small size. For those who don't know what Mate is, Mate is a type of infused beverage that comes from the Yerba Mate plant in South America mixed with many other herbs, veggies, whatever you want! I really liked the Mate blend they use because it was the right amount of sweet and the essence of the Yerba Mate plant was there. My sister got the Frappe Latte which is an iced blended white chocolate espresso drink. You could definitely taste the espresso; at least it wasn't all sugar and no caffeine! Total was $7 for our drinks. Not bad for good quality.\n\nAt least I know where to find Mate drinks! I don't see it very much in other cafes or coffee shops so that's a plus for here! Also check out their gorgeous pastries at the counter.. they look so pretty and delicious. Next time!", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-21", "description": "Martha & Brothers is a comfortable place to enjoy a mediocre cup of coffee.\n\nIf you're in Noe Valley and don't want to go to Starbuck's, Martha & Brothers is fine. It's nothing special, but it's fine. \n\nIf you love iced coffee and appreciate a good cold brew, don't expect to be impressed here. It didn't taste like cold brew, and if it was they probably didn't brew for more than 8 hours. \n\nMy wife ordered a latte that was also fine. Again, nothing special. \n\nThe atmosphere is great and the staff was really friendly. It seemed like a lot of neighborhood peeps were there to spend a relaxing Saturday morning.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-26", "description": "After what must be nearly 50 visits, I think it's safe to finally give Martha 5 stars.\n\nThis place excels at all three of the primary uses of a coffee shop in San Francisco -\n\nConversation:  Plenty of indoor seating that can be rearranged to accommodate groups of all sizes or the outdoor seating which tends to encourage conversation among strangers - often about the gradual \"decline\" of the area.  (I'm sure it's frustrating, until you discover that you can sell your tiny house for $3 million and move anywhere you want.)\n\nGetting work done:  Probably the fastest wifi in the city and one of the few places for a secure connection.  Lots of plugs too; they're hidden but most tables have them.\n\nFinding a clean restroom not already occupied by a vagabond of questionable sobriety:  It's also hidden but quite a tranquil place for a pit stop.\n\nThe drip coffee tends toward the industrial side of the spectrum, the sort of drink that can be taken in quantity on a daily basis, rather than a fancy pour-over to be analyzed and discussed.  The blend on tap daily is \"Martha's Blend\", which has a unique, strong flavor, and is available in a variety of dry forms for brewing at home.  It's pretty much the only coffee I drink anymore.  Addictive taste and fairly easy on the stomach.\n\nThe pastry selection is unusually diverse, sourced from many local bakers, both large and small.  The best selections are the dessert breads (lemon, pumpkin chocolate chip, chocolate almond).  There is also a basket of gluten-free options that tends to sell out very quickly.\n\nAnd, yes, Martha is a real person.  Even though this is now something of a coffee dynasty with four locations, Martha still works at least one shift most weeks, though you'd never know she was the boss unless you'd seen pictures.  Great to see her leading by example and staying close to her customers...\n\nOverall, this place is pretty much exactly what I'm looking for in a neighborhood coffee spot.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "Great coffee and excellent staff!! \n\nMiguel and Jasmine are wonderful and make my coffee just the way I like it each and every time!", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-14", "description": "This place is great. It's the perfect neighborhood coffee shop. They have all your typical espresso drinks and their brewed coffee isn't that bad. \n\nWhat's gets me to give 5 stars is the service. As soon as you walk in you get a warm greeting, no matter how busy it is. It feel like home even the first time you walk in. I've been here a few times now and it's like I never stopped going. \n\nThey also have a wide selection of pastries and merchandise. So if you want to hang out here, get to know people in the community, this is the place for you. I wasn't sure if they have wifi because I always just read a book or newspaper but I can't imagine them not having it. \n\nI wish they would put one of these in the financial district so I could go more often. But this place is a must try for anyone who loves neighborhood shops!", "author": "Josh F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-22", "description": "Had to go into Noe Valley for an appt....\n\nThis place is totally fine.  Good service, red tea was good.  This is generally a good place to just sit around and hang for a bit.\n\nThe pastries looked amazing but turns out that what I had was just good - nothing special. (I had the pumpkin, chocolate chip loaf.)\n\nFine, but likely wouldn't return.", "author": "Li J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-21", "description": "Martha's is my go-to tea fix. Above average prices for tea, but not outrageous. Very friendly service!  \n\nThere's usually a line during morning rush hours, but it moves quickly. \n\nI love their black teas, especially the Peach Blossom tea. The pastries are yummy too! I'm a fan of the banana bread and zucchini bread.\n\nTips: there's free 10 min parking directly across the street from Martha's (in the small parking lot)", "author": "Vivian N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-02", "description": "Question time.\n\nGovernment version: http://en.wikipedia.org/wiki/Question_time\n\nCaffeine version:\n\nDo you have WiFi?\n\nDo you have a bathroom?\n\nCan I use my credit card?\n\nDo you have sugar free vanilla syrup?\n\nIs there nonfat milk?\n\nAll were a yes from the very nice staff. Together they made for a very good, very well priced $3 Americano on a slightly chilled afternoon.\n\nNo question this is a four star spot.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-14", "description": "I live a few blocks away from the 24th St location and it has become my go-to coffee spot. \n\nWhy?\n\nSolid if unspectacular coffee. My standard order is a nonfat latte, and while it's no Ritual - I have no complaints. The flavor of the coffee is probably improved by the genuinely friendly service. The whole team knows my name (and the names of most other regulars), they start making my order the minute I walk in the door.\n\nWhile things can get a little crazy during prime Baby Hour on Saturdays and Sundays, the seating is generally ample, and the free wifi is consistently speedy.\n\nFinally, a decent selection of snacks and pastries if you have a hunger. None of this stuff is breaking new ground, but it's good to have a few options.", "author": "Christine B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-10", "description": "Fantastic morning attitudes, great food and fast service.\n\nFree wifi, and the best part is great prices.\n\nOutdoor seating, great staff...the list goes on.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-31", "description": "Not at all happy with the people who work there. They don't look you in the eye and ignore you when you need help with an order gone bad. \nI ordered a pumpkin muffin and discovered that not only was it the oiliest discussing mash of goo but it was also infected with walnuts, something I can't eat and something not advertised on the label. When I took it back in, the woman behind the counter couldn't care less and ignored me, wouldn't talk to me and went on to help other customers. What a rip off.\nFuck this place!!!", "author": "Guy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-18", "description": "Seriously top notch pumpkin spice latte! Wasn't expecting to like it as much as I did. I am a huge supporter of the PSL at Starbucks but even I can admit it tends to be a little too sweet and lacks a real true pumpkin flavor. The pumpkin latte they served me here had just the right amount of cinnamon, sweetness, and real pumpkin flavor! I really enjoyed it. They made my latte extra foamy just how I like it too! Super jealous of all the great independent coffee shops like this one that are scattered all over SF! We need more in San Diego!\n\nWon't give 5 stars only because I've tried a total of one thing on the menu and for the fact that there was very little in door seating inside the cafe.", "author": "Brandon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "The staff is genuinely friendly! They take care in making sure your order is exactly how you want it. They take pride in their work and they don't roll their eyes at special requests as I've encountered at other places. \n\nThey have great coffee and also a variety of food options. My new favorite is the quinoa salad. \n\nThey have indoor seating as well as benches and tables outside. For great coffee and great service, look no further!", "author": "rachel g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-04", "description": "I do not like leaving bad reviews especially since my first review of this place was awesome, this shop has gone downhill drastically in the last 6-7 months and does not seem to be getting any better. The baristas they have working really need to learn about customer service,  most of them cannot get an order right.....and that comes from someone who frequents this shop at least 4 times a week....always have to watch the baristas as they make your order as they do not listen and frequently get it wrong.....used to love their iced mocha....was the best,  now it tastes so different depending on who attempts on making it. Their selection of baked goodies is amazing but last few months many items are stale. Their bathroom is always out of paper towels and is dirty....walls and doors are smudged with dirt.....gross.....Definitely not worth spending money here when there are other options..............the Martha's on Church Street is AWESOME!  GO THERE INSTEAD!", "author": "Ken B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-06", "description": "They severely burned my wrist at this coffee shop.\nOn top of that, the barristers laughed at me when I screamed in pain.\nI would give negative stars to this place if I could, but I didn't even write a review for a year because the owner, when she finally arrived at the store, felt my pain and apologized so many times. I will post pictures as well and you will see how severe was my burn.\n\nDetails of story:\nIt was 2013 January, I went to this store after work hoping to get some tea. There was a young women at the counter and young man towards the back. I ordered my tea, the woman filled the cup and put on the counter. Everything seems normal until this point. \n\nI reached over to get the overfilled cup that was LACKING a sleeve and a cap, only touched my hand to the sides of the cup and hop, the overheated water spilled all over my hand. I was able to shake of some of the liquid but the area that remained under my cardigan got severely burnt. I screamed with pain. The rest of the story is even more disturbing. The woman at the counter started laughing, looked at the man and said something, and he started laughing as well. THEY OFFERED NO HELP WHATSOEVER, THEY LAUGHED AT ME AND HUMILIATED ME. I asked them to call the owner of the shop, they did not. I HAD TO LEAVE CRYING. By the time I got to the nearest pharmacy, the area had been severely hurting, the skin had bubbled, the bubble had lifted off and popped. I was crying at the pharmacy, and they gave me some first aid stuff. AGAIN, PEOPLE IN CHARGE OF THE SHOP DID NOTHING other than laugh at me. \n\nI returned to the coffee shop and asked for the owner's number, they gave me some number, I went out and called, it was the coffee shop itself and the nasty young man hung up on me. I returned once again, finally, the owner arrived. I told her the story. She was extremely sorry, offered me ice, told me I'll never see that guy again serving there (I have no idea what happened, because I never went back) She apologized over and over again. \n\nBut today I saw this story of the woman that got burnt at McDonald's, and remembered how nasty it was and how horrible and disgusting people's reaction was (making fun of me, not helping etc), so I decided to write here.\nhttp://ed.ted.com/featured/noVRnZ7N\n\nNobody deserves to be burnt by insanely hot liquids (it was served WAAAY hotter than I could even think of drinking) and nobody deserves to be humiliated because they're in pain. Those two losers did both of these things to me, and I was their customer. So I think this story deserves to be here. Like I said, I will also post pictures of the burn.\n\nA year later (and hundreds of dollars in burn and scar creams, my previously flawless wrist still has a scar and that area gets red every time I shower (thin skin- heat sensitivity problem). I hope you think once again before going to this place.", "author": "D T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-27", "description": "I moved here a few weeks ago and I am already in love w/ this place.\nFantastic coffee and tea and super-friendly employees. The ideal local coffee shop.", "author": "Steven G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-20", "description": "The vanilla latte (size small) is liquid gold.  The espresso shot has the sufficient kick to give you your daily hit of caffeine, the milk froth is just the right amount and the hint of vanilla completes the latte.  The wife recommended getting the small size so as not to dilute the slice of heaven.  \n\nEvery city needs a Martha and Brothers.", "author": "Daniel T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "Quality of service was not the best, but could have just been a one time thing. They forgot to make my drink and I had to remind them multiple times before it finally was made.  Once is understandable, but more than that shouldn't happen.  Was not even busy.    They were nice enough about it after the fact though.  All in all a fine place", "author": "Jack H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "I have shied away from being an avid Yelper due to the unjust and the terrible society inclination of coming and bashing every bad or unfortunate event that transpires between a consumer and a facility.  I have come to the realization that if I want change I must be the change and if I'm fed up of people rating and bashing companies unfairly, I must promote what I love vs. bashing what went wrong!\n\nI visit these wonderful people every morning!  With their beautiful auras and welcoming environment, it definitely helps start my mornings right!  I get my white mocha with ALMOND milk! Yes!!! They are fast, friendly and just plain AMAZING. Their music selection also always helps give me a boost  of energy!\n\nThank you Martha, Jazmin, Miguel and the rest of my favorites at Martha's!!", "author": "LoveAlways J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-11", "description": "I usually go for Iced Coffee, except when I come to Martha & Bros., then I go for a Mexican Mocha. It's just perfect, not too sweet, nice and hot and really damn good. \n\nSomeone got me hooked on these and now I crave them. :)", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-31", "description": "This is the happiest coffeeshop in San Francisco. The latina ladies & their one gentleman are so kind, sweet & genuine. The coffee & the snacks are the bomb too, but it's the attitude that makes this place. They know their customers names, don't roll their eyes when you order a mocha & I just witnessed one employee give the other one a big squeezey hug...I work here a lot & they are ALWAYS like that, even when the place is empty. No hipster bullshit here.\n\nBonuses: Free WiFi, clean bathrooms and they have mini-coffee cups, which I love cuz I can't handle too much caffeine in the afternoon.", "author": "Stephanie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "Good beans, and great outdoor seating parklet.", "author": "Kyle G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-04", "description": "They have an interesting outside area, and a weird rustic vibe and layout on the inside. Solid chai tea. They close at 8pm on the weekdays so unfortunately it's not a late night hangout for caffeine.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-08", "description": "We had a cold drink in the sunshine here today. The service was great. The inside is very pretty and outdoor seating is perfect. We also had a slice of lemon cake which was delicious. There were so many cakes to choose from and so cheap given the size if the slices! I'd go back here!", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "this has quickly become one of my favorite coffee places here in the city. Not only does the staff remember me after just a few visits, but they also remember my name and my drink. Make one of the best hazelnut lattes I have had, and I have a LOT. I can say I will continue to come here all the time for as long as I can. :) For me, I usually take my coffee to go so I can't say about sitting in the shop, however, when I have come to stay and chat with my boyfriend or meet up with a friend, there is always somewhere to sit. Space outside for nice weather, and inside for the chilly days.", "author": "Rosie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "This is a very well run coffee shop that makes excellent coffee drinks (hot and cold) and delicious hot and iced teas. I often get one of their bagel sandwiches. It's my favorite place to stop for a quick breakfast or togo order in Noe valley. There's plenty of space to sit inside and out, a long menu of drinks and eats, and experienced staff that can easily handle peak demand.", "author": "Meredith G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-13", "description": "This espresso is not for the weak-willed. Prepare to be woken up by the strength of the taste, not just the caffeine. This stuff has bite. I had a latte and it was so sharp-tasting I had to add some cinnamon just to soften it. It might be more authentic or local than some of the newer brews out there, but it just doesn't go down as smooth. If I ever feel wanting from a latte at another place though, this is where I'll go.\n\nOn the plus side, there is super-fast free Wi-Fi (I clocked it in the double digits Mbps-wise). Also worth checking out: the new parklet in front of the cafe. What this place may not have in desirability, it has in amenities.", "author": "Omar Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-22", "description": "Lovely local shop. Simple menu, decent coffee. Lots of seating and friendly crowd. Would recommend over Starbucks.", "author": "Steven P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-26", "description": "Coffee cake here was probably the wost coffee cake I have ever eaten. macchiato was not very good.", "author": "Mohammad A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "Love small coffee shops...and this little place is great. Got a machiatto with carmel and vanilla pumps along with soy. And still strong cup. The customer service is great as well as really quick for a muggy sunday afternoon. Ill definitely remeber this place when I'm back around this area.", "author": "Ty O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-02", "description": "Martha's Vienna Roast beans are so good that every month I have 2 pounds of them sent to me in North Carolina, where I am in exile plotting my triumphant return to SF.\nLove you Martha. Miss you. XOXOXOX", "author": "Christopher R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-26", "description": "Every once in a while you stumble across a place that is special in SF...This is one of them! \nMartha and her family have built up this establishment from as long as I remember starting with 24th street location...\nMartha and Brothers, is a vibrant, friendly oasis that serves as the areas town square each morning. Smiles meet you behind the counter with a huge assortment of delicious treats, and hearty breakfast bagels, scrumptious sandwiches and strong coffees, yummy chai, and fresh teas...\nThe assorted customers gather into different groups, some talk about local news and real estate ..(my group:)) some work on the computer, others have small business meetings, or just relax  and read the paper. \nI have met friends that I have known for over 20 years at the Martha hangouts...no kidding!\nMore than just having a Noe address... I know the value of meeting your neighbors, sharing your experiences,or just saying hi while sipping on a great latte. That is community, and THAT is what Martha's is all about!!", "author": "Christina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-29", "description": "Always pleasant staff.\n\nSolid free wifi, at least 10 Mbps down.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-17", "description": "I have done everything from meet friends, study for exams, and even do my skype spanish lessons from time to time here. Their wifi is reliable and the pastries are delicious! The staff is lovely. And the coffee is surprisingly reasonably priced when it given that it is located in a fancy SF neighborhood. What else could you want in a coffee house?", "author": "Teresa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-16", "description": "My preferred coffee place on 24th. Coffee might not be the best ... they tend to burn the mix, but the atmosphere and the people serving you are THE BEST (Hola chicas!!!)\n\nIt is just noice and pleasant to order your coffee and then sit and lounge (if you have time) outside the shop on the benches and chairs.\n\nThey have good sweet and savory snacks and any kind of coffee / team combination. \n\nMind that the small cup is REALLY small. I always go for the Jumbo coffee no room for cream :)", "author": "Gianguido G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-02", "description": "If I'm getting coffee, I'm probably not in the best of moods. Maybe I'm grumpy, but more likely I am in desperate need of a caffeine shock.\n\nSince moving to the neighborhood a few weeks ago, I have come to Martha and Brothers more than a handful of times. Every visit, I come shuffling in with my eyes at half mast and mumble out my order. I come to M&B over the other local coffee shops because the baristas are downright the happiest bunch of people I've been around in a long time. They are extremely perky and they are more than willing to help me make a selection from their delicious assortment of baked goods. \n\nCoffee is coffee, and I'm no connoisseur. It's the pastries that have secured my love of this place. They serve a mean bagel with cream cheese and avocado (heavy on the pepper). They offer dainty little madeleines for a quick treat. But the pièce de résistance is the pumpkin walnut chocolate chip cake. \n\nMe: That pumpkin cake looks awesome. Is it good?\n\nPerky Barista: It's so good, you'll feel bad about yourself after!\n\nGood sell, sir. And it is damn tasty. I love all things pumpkin, and that cake always hits the spot. \n\nAside from coffee, they also offer other options, like hot cocoa and Italian soda. Their Mandarin orange soda helped soothe my hungover stomach yesterday, and my boyfriend kept stealing sips when I wasn't looking.\n\nThe only complaint I really have about Martha and Brothers is that it is often overrun with kids. But after having a toddler come up to me and ask me if I was pregnant, and having to restrain myself from smacking the little girl around, I have even more respect for the wonderful attitudes of the people who work here.", "author": "Devon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-19", "description": "Another good Martha stop! The outdoor seating here is very pleasant and is better than the Cortland spot. However Cortland wins on indoor space.  Menus is much the same. As always, exceptional lattes!! The key is consistency and I have always enjoyed my lattes from Martha's!", "author": "Brad B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-20", "description": "Friendly coffee shop in a nice neighborhood. I like the outside seating and the staff were friendly! It being a warmer day I opted for the iced coffee.", "author": "Tommy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-05", "description": "This is a great spot and the service and food items are wonderful. I definitely want to return here, next time I am in Noe Valley.", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-25", "description": "I support local shops.  And this is my neighborhood, so when I had to make a quick housecall to a friends and had absolutely no idea as to what to give them, I bought a pound of their holiday roast and two slices of dark chocolate pound cake, decorated with slivers of almonds and powdered sugar.\n\nI had one slice later.  Could not resist ;)", "author": "Miika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-18", "description": "I agree with Step F review, the coffee is fantastic and snacks too but its the attitude that make the place work so well. The girls and guys are just lovely and sweet and genuine. Very well mannered and know their customers and treat everyone the same with courtesy and a smile. It makes the coffee taste better and the sweets sweeter. Sometimes I go out of my way to get my coffee here in the mornings. I wish other business in San Francisco would be as well mannered and courteous as the girls and lads are here.. Its a pleasure to go there. Thanks to all at Martha's on 24th St for a great start to the day:-)  Free Wifi\n\n07/05/2013\nMartha's opened a store on 5th and Irving and closer to my house..yeah!! Erica, is Martha's daughter and a joy to meet. She is a sweet and happy person and the other staff members are also very people friendly. Free Wifi", "author": "Noreen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-19", "description": "I come here for the drip-coffee, which is excellent.  Additional perks are that the staff is always friendly, there is seating both inside and outside, there is free wifi, and free 10 minute parking in the lot across the street.  :)", "author": "karen h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-06", "description": "This was my favorite spot in the sun when I lived in San Francisco around 2011-2012. Super friendly staff and good coffee. Above all: there is a sunshine guarantee due to the parking lot on the opposite side of the street. Sunniest place in SF!", "author": "Asmus O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-11", "description": "On a recent early Saturday morning I stopped by Martha & Brothers and walked to the counter and the 'barista' ignored me and talked to the cashier so I stood there confused since the place was empty.  After while he gave me an irritated look and said \"yes?\".  Duh!! I was courteous and asked for my coffee but I'm not going back!!!", "author": "Dora G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-06", "description": "Nice clean place, Friendly people, but just okay food. I tried the Pumpkin Bread and the White chocolate banana frappuccino. Was kinda disappointed.", "author": "B I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-23", "description": "Sometimes bad coffee can be overlooked if the service is stellar.\nLet me re-phrase, so-so coffee can be deemed acceptable if the service is rock-star and the cafe's got charm.\n\nThe ins & outs, ups & downs:\n*First visit, the barista carelessly swapped our drinks - I was given my friend's drink and vice versa and of course no one knew til we're already sipping away.\n\n*A cuppa joe is fine for the average coffee drinker and to wash down a pastry, of which they have many appealing options from Bay Area bakeries.\n\n*Cafe ambiance does not instill any kind of cozy, comfy, i-want-to-enjoy-my-coffee-here vibe. You're better off enjoying one of the benches out front, watching the dogs and strollers pass by.\n\n*Last week, I handed over $2.00 in exchange for the worst espresso I've ever tasted. Totally bitter.\n --- It was one of those rarities where we're fresh out of espresso in the house and I'm in a desperate hurry to caffeinate (Martha & Bro is on our block) --- not worth it. The paper cup didn't help the situation (no ceramic here) and not even some sugar could sweeten this guy to something palatable. Maybe some milk and mocha syrup, but let's get real, if you make espresso drinks, it should be something you can enjoy straight up. It was like the equivalent of buying the plastic handle jug of liquor - takes a lot of mixers to make it tolerable, otherwise it's just rough. Blech!", "author": "Alissa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-30", "description": "I have never had such delicious, perfectly brewed, perfectly roasted, (and non- clover brewed) coffee before Martha's! I recently visited my sister who lives around the corner from the shop in Noe Valley, and it became part of my morning routine for the week I was in San Francisco.  I loved their coffee so much, I went back for an afternoon cup on most days, too!\n\nI love their drip coffee, but I didn't find that their espresso drinks were anything special.  I tried an iced latte one time, and it was good- but not exceptional.  The coffee is exceptional.  My tip for y'all: stick with the coffee if you want something to drink that will blow your mind.\n\nI wish I could take Martha's back home with me to the Twin Cities!", "author": "Beverly L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-17", "description": "Not a fan.  Too small, overcrowded, rude staff, their coffee is bad and they gipped me. A large here, which is the size of a medium anywhere else, and they didn't even fill it up AND charged me more? Bleh.\n\nOh, and providing two hours of free wifi doesn't mean you offer free wifi.  I'm a student - free wifi means ALL day.", "author": "Adam T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-04", "description": "Martha & Bros, I love you - you are great. But please play better music. I don't want to listen to Michael Bolton and feel like I am having a mid-life crisis early at the tender age of 24. \n\nOther than that, the creme brulee latte is great, along with the free wi-fi and the options for food. The food ain't great, but if you're hungry, I'm sure you'll eat just about whatever they have here.", "author": "Michelle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-23", "description": "Very cheap and delicious bagel and lox sandwich! Cheaper than the other bagel places nearby, AND and a bigger bagel... Complete with onion, tomato and capers! They take their time and make it right. And man, the sunrise loaf cake! That was mighty tasty.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-27", "description": "This review is for their straight up, drip coffee. I haven't had their espresso drinks, their food, or their beans by the pound. I don't sit in their cafe or use their wifi. I just drink their coffee. All the time.\n\nWhen I want a cup of perfect drip coffee, I just keep coming back to Martha Bros. It's difficult for me to explain -- I'm no connoisseur by any means, but this is just delicious coffee. It tastes better than any other drip coffee I order around town. And it's consistently delicious. Now I'm a guy who's fine to get my $bux, my Peets, my whatever. The fancy pourovers can be good too, but they sometimes taste a little too strong, too varietal, too \"unique\".\n\nBut Martha is a real treat for me, and noticeably different and better in the style of regular filter-brewed coffee. If you like a conventionally-brewed cup of coffee, I suggest you try this place and enjoy what I believe is the best cup in town.", "author": "Al M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-03", "description": "I like the coffe, the people that work there are friendly and they don't over charge me. There's also seating inside and outside which is great when the weather is nice.", "author": "Rew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-11", "description": "I lived in Seattle for 5 years so I'm pretty particular when it comes to coffee, but I love Martha's! I prefer coffee that is on the strong side and Martha's coffee has the perfect amount of flavor.  if you are into more mild coffee, like Starbucks, this might not be the place for you. Their cafes are always really clean and service is quick. Oh ya, and great baked goods!", "author": "Antoinette O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-17", "description": "Why do people drink this coffee? Is it purely for the caffeine fix or do they actually like the flavor mud? \n\nI have given Martha's many chances and each time I take about 3 sips and I end up throwing it away. I am AMAZED at the groups of people I see in front of this establishment and have come to the conclusion that their tastebuds are fried and that's the only way they can tolerate this muck. \n\nGo to Bernies.", "author": "Miss Tina Sparkle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-27", "description": "Coffee, pastries, and good vibes.  \n\nOn a warm Friday afternoon we walked by, while confirming that Noe Valley doesn't really go down Noe Street.  It goes down 24th Street, which is perpendicular.  Further down 24th Street is the Mission District, so it's all a bit arbitrary.  There is a ridge between Noe Valley and the Castro, which is not Castro Valley -- that's another city somewhere.  \n\nOK.  The coffee shop was light and airy, and the clerks were friendly.  We noticed that among the tables and chairs was a children's setting underneath a staircase that ran up one side of the store.  Very cool.  I understand this neighborhood is very children-friendly.  \n\nA single latte, a cup of tea, a croissant and a scone cost us $8.20.  We sat at a window table and enjoyed the scenery for a while.  Then we continued our tour of the businesses in this roughly 4-block commercial zone.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "Excellent coffee, my favourite in SF. I also love that you're in and out ina couple of minutes. Perfect on the way to work. Love their latte, love the iced coffee, love the breakfast burrito. Quality, friendly and efficient. What more do you need?", "author": "Sian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "Yum! love it here coffee, good and pastries and delicious and the girls are super sweet :-)", "author": "Keepin' It R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-24", "description": "Really nice people who work here, they've always been quite patient when I've gotten \"deer in headlights\" during the morning rush. I generally order the small red eye because I fear the large size might give me a stroke. It's a powerful drink, but oh so good as a sleep replacement (legal too). The Mexican Hot Chocolate is another standout beverage if you're not going for caffeination. The pastries and bagels I've tried are also quite tasty, and definitely fresh. \n\nMinus one star for the sometimes inconsiderate patrons who sit out front for hours at a time and block the side walk. You definitely have to be careful when walking down 24th certain times a day or your apt to be tripped up by a dog leash or a Teva clad foot.\n\nOn a side note, I randomly came across a small Martha & Brothers outlet in Managua, Nicaragua a couple years a go. Not sure if it's still there, but it was a neat find nonetheless.", "author": "C P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-26", "description": "Real nice local coffee spot to chill in Noe Valley.  Coffee is good and a huge selection of pastries and cakes.", "author": "Dave B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "Given that I patronize this place every single day, I'm amazed I haven't reviewed it. I can't really say enough good things about this place. The coffee is excellent - super strong, yet great tasting. And the staff? They are uniformly pleasant, super efficient, and after a few trips will have your coffee made the second you walk in so you can get out quickly. Everything is always clean and well stocked. A nice alternative to the apathetic hipster service at most coffee shops. Love this place!", "author": "Anonymous F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-08", "description": "Great coffee.  Not quite as tasty as Bernie's coffee but still very good.  The pastries are excellent and there is a 10-minute parking spot in the lot across the street.  A good place to sit and study (although the chairs were a little hard for my all-day bar studying marathons).\n\nNormally I hate people I don't know calling me names like \"sweetie\" etc but the staff here is so friendly and cheerful somehow their habit puts me in a good mood.", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-18", "description": "Great coffee. Super friendly local feeling in this place.  The staff are wonderful and seem to know so many customers on a first name basis that it's almost unbelievable.  \n\nThe Martha's location on Church is also solid.", "author": "G O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-14", "description": "Coffee (mocha specifically) is tasty, and had a great balance of coffee & chocolate flavor.  And they clearly aren't using cheap chocolate either - it had a great, dark flavor that wasn't too sweet.  \nThe downside is that it's fairly small and cramped inside - not much room to sit and relax with your drink.  I think they have a total of perhaps 7 small tables.  The benches outside are great, though, especially if the weather's nice.", "author": "Don H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-11", "description": "The coffee is pretty good. The coffee is incredibly strong. There was one point in my life where I would go to the gym v. early in the morning before breakfast and my willpower/physical capacity for doing so was entirely dependent on a medium dark roast. The service is also eye-openingly efficient. The food/pastries are not universally very good, but I enjoy several (cranberry walnut scone, the square granola bar, the pecan slice). My husband eats a lox bagel there for lunch almost every day, so I suppose he rates it above the bagel place next door. I like the fact that they have chili sauce for the hard boiled eggs, and the recently constructed red-tabled urban park is a cheery place to sit and watch the world go by.", "author": "Hannah S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-14", "description": "When you walk by Martha & Brothers Coffee on 24th, you run the gauntlet past at least a dozen pairs of surly eyes.  They look you up and down.  They never get out of your way.  They never say excuse me.  They blow smoke in your face.  Just a bunch of thuggish kids chillin' on the block, scaring everyone.\n\nOh, wait a minute.  It's not a bunch of kids.  It's a bunch of loser middle-aged people with nothing better to do than sit around in front of a coffee shop from 5 am til well past dark.  And they do act like a bunch of dicks, blocking the sidewalk, giving everyone dirty looks and generally just making passersby wonder why they don't find something useful to do with their lives.\n\nI see cops hassling teenage kids and homeless people in Noe Valley for doing nothing more than standing in one place.  So why do a bunch of douchebag coffee drinkers get a free pass?", "author": "Gabriel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-26", "description": "I have to say that I've been popping in here almost twice a day for the past several months and always enjoy my coffee.\n\nPerhaps because I'm considered a regular they make sure to provide a quality drink; however, even when I take outsiders to this place they are always happy with the end product.  \n\nStick with a large Americano, little bit of brown sugar, and a drip of half and half you cannot go wrong.", "author": "Elliott J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-14", "description": "Seriously can someone just stick an IV into my arm and pump Martha & Bros. vanilla Soy latte right into my veins???   Puhhhhlease ....  Wait a second, then I wouldn't be able to savor the delicious nutty flavor...  \n\nOn second thought, I'll just take an XL vanilla Soy latte ... and keep 'em coming!", "author": "Nicole Rynee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-04", "description": "If you're a Patagonia-wearing, Bugaboo pushing, Labrador walking parental figure, this is your passport to the Promised Land.  Here, you may gather with others of your kind, simultaneously blocking the sidewalk with your $1,000 stroller and/or dog's leash while postulating the inherent evilness of a) Starbucks, b) Real Foods, and/or c) W and his cronies. That's not necessarily a bad thing --- unless you're trying to walk past Martha's on a sunny weekend morning.  \n\nSnarkiness aside, It's a rich, dark latte heaven where they really mean it when they add the espresso.  I haven't found a better one stop shop for good coffee AND good baked goods (oh, Hungarian Coffee Cake, why must you tempt me so?)  I also like the less commercial feel of the place --- for good or for bad, it's kind of like going to your family's coffee shop.", "author": "Alannah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-03", "description": "I love strong but good coffee and Martha's has my back!\n\nThere coffee is very good. The quality seems great to me and the variety is also very good. I am not a big Starbuck's guy and I know there are plenty of fan favorites for coffee around the city. Martha's is just a great place in Noe Valley to have a cup of coffee and just relax and enjoy the weather.", "author": "JR H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-04", "description": "Best (and strongest) regular drip coffee in Noe.  Great selection of pastries, including some good angel food cake if you're in the mood for something light.\n\nGreat sunny outside seating.  Only downside is that it's usually full and there are not many tables inside.  Coffee to go is the best option.", "author": "Jill P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-19", "description": "Okay, here's complete honestly for you.\n\nI want to rate martha's higher. I really do. The staff is awesome and friendly and I think the shop is a boon to the neighborhood.\n\nAnd when the drip coffee is made well, it is hard to beat -- dark, fresh, bold, not overextracted or anything, nice caffeine levels, etc etc. And I've never been a huge fan of their espresso, but some of my friends/family are.\n\nBUT -- lately, things have come off the cylinders. The recent price increase was too much; their incentive for bringing your own cup is now only 10 cents off, and, most important, the brewed coffee has become very inconsistant and is only good about a third of the time.. \n\nThis is coming from a guy that used to come here every day on my walk to BART. Every day. Now I've usually been holding off for when I get downtown to get drip at Specialty's -- they use a better bean (intelligencia); it's very consistent, and it's only a buck if you bring your own cup.", "author": "Jer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-14", "description": "Peet's may be my nation-wide coffee chain of choice, but Martha's is my San Fran chain (for now, anyway).  Coffee and Noe Valley go together like milk and cereal, so this is a great location to go to, especially if (like me) it's the closest to home.  Good bright places to sit here too.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-18", "description": "Great cup of Joe that even us decaf drinkers can say has a lot of flavor!", "author": "P G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-19", "description": "\"Banilla latte!!! Banilla latte!\" Oh, that's me!\n\nI much prefer banilla lattes to vanilla lattes. I am the banilla latte girl. I like that neighborhood-y feeling when I am not just a faceless drone in line (see Starbucks downtown). Shooting the shit with Martha is great. We talk muffins. \n\nMartha's 90yr old mom works here too. I think her job is to get in everybody's way. Its real cute. \n\nCoffee is strong and great, and doesn't have that manufactured taste. Also, nobody will make you buy teddy bears or Streisand CDs while you wait. \n\nCome get your banilla latte here.", "author": "Carrie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-11", "description": "The coffee is drinkable, not great, not terrible, the espresso drinks are better than average, at least its not Starbucks.  This place has some definite downfalls:\n\n1)The kids and the strollers.  For pete's sake...does every woman in Noe Valley have to procreate?  Are they giving away \"free Babies\" in the neighborhood welcome kit when you move into this 'hood?\n\n2)It gets really crowded at peak times and then its a jungle...the traffic moves awkwardly in this cafe.\n\nThe redeeming factor is the number of adorable dogs out front that are usually waiting for their \"moms\" or \"dads\"and are often very eager to be comforted by a stranger.", "author": "Nilu r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-16", "description": "Geat selection of teas...able to find seating to chill out alittle bit. Doesn't have that commercial feel to it.", "author": "Dan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-01", "description": "got a disappointing harsh cup of joe (l. 1.75) here. the pastries/cakes  on display here was awesome. over 20 choices, including red velvet cake from ultimate cookie. large premade sandwiches  (5.50)  many of which were being consumed onsite..\n\nvery friendly service. \nlarge  location, many seats inside and outside.\nassume free wifi available.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-09", "description": "I hate to be a downer, but I just am not a huge fan of this place.  maybe it's because i'm not a huge fan of noe valley. but anyways. about this place.\n\n It's ugly inside.  i am a huge coffee fan and the coffee never seems better than average.  and, did i mention... it's ugly inside. feels like the abandoned coffee-supply warehouse i never wanted to visit. a bunch of folks seem to really like chatting outside, but i am not those folks. so, more power to them, and for me.... off to the mission for my coffee.", "author": "Toby B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-20", "description": "The aroma itself could wake you up.  Everything from the wooden shelves to the banana bread must be infused with that intense coffee smell.  But it's a smell that should be acquired... like the taste of beer or the appreciation to oysters.  The smell ... is so potent.\n\nI test a coffee shop by my usual -- Nonfat White Chocolate Mocha .  Almost all places make it different.  Upon first sip I reacted strongly.  \"Whoo... that's... eh... that's... quite good!\"  My eyebrows perked up and I relished the smoothness of the drink.  My coffee must be more bitter than it is sweet and this cup was well balanced.  Great selection of pastries too.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-04", "description": "I wandered in here with a friend early on a Sunday morning. The line was almost out the door. I was surprised at how the staff handled the crowd with great patience and ease, all the while with broad smiles intact. \n\nMy eyes widened when I saw the many pastries lining the counter. Despite my pastry craving, the pastries looked so unappetizing upon closer inspection, that I could not bring myself to purchase one.\n\nThe coffee was a bit too strong for my tastes, but I can see how it could easily become a coffee-fan's Kryptonite.", "author": "Victoria D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-06", "description": "Yes, I love coffee and when I am in this part of the neighborhood (Noe Valley), I stop by for their cafe pequeño con much sabor! Staff are always pleasant and courtesy. I come here for my sip of coffee not bitter , just right with a Pow and no after taste yuck!", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-10", "description": "The coffee was really good.  Very very strong.  \n\nThe people behind the counter were very nice.\n\nPastries however, were not so good.  Perhaps, as always, we picked wrong, so just in case, don't get the oaty square thing (looks like a oatmeal brownie with jam inside, tastes like a fig newton), or the nonfat apricot oaty cake (not much taste at all, I was only able to eat two bites of it).", "author": "Kerrie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-15", "description": "The raiting was based on one thing and one thing only. Zucchini Bread!! It was fresh, moist and taste great.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-28", "description": "Coffee: Delicious. Aromatic, dark, strong. What more can you say. I love their nonfat lattes especially. They've definitely got more of a punch than the sbux lattes down the block. They also have a decent selection of beans by the pound.\n\nService is usually quite good, but I've been a couple times near closing time and they've been much more curt. During the day they're super nice. Since Martha's doesn't have free wifi, I prefer Bernie's down the street for chilling, but if you just want to grab a coffee to go, Martha's is the place.", "author": "Monica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-01", "description": "Disclaimer: I have only ever gotten drip coffee from here.  But let it be known, that no matter which Martha & Bro's location you are patronizing, they have the STRONGEST COFFEE EVER.  Seriously.  Just one sip and you can feel it race through your blood stream and right to your head for that lovely ever-so-needed **BUZZZZ**... which is basically the effect I'm looking for when I drink coffee... Isn't that the case for everyone?", "author": "Emma A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-16", "description": "You're spoilt for coffee shop choices on 24th Street - a Starbucks, a Tullys and a Martha & Bros all in the space of 3 blocks. Welcome to caffeine addict nirvana. My favourite has to Martha & Bros though. I'm a real fan of their Mocha's (I like chocolate) and their crumble cakes. In about every way it's a better place than Starbucks, except you can't buy espresso machines or CD's - \"I'll have a double pump latte, a barista and the new Bruce Springsteen, low-fat please.\" No great loss really.\n\nThey have seating inside and benches outside. The benches outside tend to be taken by members of the French philosophy spouting, beret-wearing, frustrated artiste set, and the seating inside is a little cramped, and the chairs a little rickety.\n\nThis is probably the only coffee shop in San Francisco that doesn't have wireless, so it isn't packed with people trying to build the next great Internet company (hello Ritual Roasters).", "author": "Chris K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-19", "description": "Agreed with Pirate T. about the sloppy vibe. Coffee was okay, but the atmosphere was not particularly inviting. It's a get-it-and-go place.\n\nIt's a shame about Noe -- I really like the neighborhood, but I have yet to find a great coffee joint. And what's up with the creepy guys (as noted by others) who hang out here? Weird.", "author": "Allison L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-16", "description": "Tough to rate this location, only because the java & foam quality (it's all about the foam) are four stars for sure, but this cafe is a bit cramped.  If you're looking for quick, in and out, though - it's perfect.  They run a tight ship and you never have to wait more than a minute, even when it's packed.\n\nFor sit-down cafe time however I'd head to the Church or Cortland Ave locations.", "author": "Jessie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-11", "description": "This coffee is not for everyone, but if you like strong drip, this is your place.  I love and was addicted to this coffee.  I went here every morning for my morning walk and the owner is always so sweet and nice and the firs hurried to move a huge line quickly.  Sadly, I've moved and miss the coffee so much.  Martha's please open in the Dog Patch!  Right now there is just pretentious, overpriced coffee at Piccino's.  We need a down to earth, owner owned and operated small business like yours.  I'm so tired of the pretentious coffee places.", "author": "SF L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-07", "description": "Excellent coffee.  Has a bench out front to sit on.  Friendly staff.  had coffee there about 20 times, usually when i get a bagel next door.  The coffee is always good.  That's about all I know.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-02", "description": "Martha's coffee is what I miss most about living in Noe Valley.  I used to commute every day to Cupertino.  Our carpool gang would meet her every morning, so we got to know them pretty well.  I miss having a purple cup of delicious coffee in my hands every morning.  I also miss the great staff - we knew each other by name.  Definitely a great neighborhood gem.  This is one local coffee shop truly deserving of your business!", "author": "Scott H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-30", "description": "MMMM...I had the most delicious vanilla latte here!\n\nThe inside is so cute and warm feeling. Friendly staff, nice smiles. \n\nI love to support  local coffee shops. It is in a great location, 24th street is so adorable.\n\nKind of weird that tons of people stand outside and look at you when you walk in, but hey, its a cool spot, so I guess I understand!\n\nCome here on a sunday and grab coffee and hit up all the cute noe valley shops on 24th!", "author": "Adrienne F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-27", "description": "I like Marthas drip coffee.  Nice staff, drinking coffee in the sun is nice.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-31", "description": "This is my spot for a morning cup of coffee.  It is strong and has a great flavor.  The crowd is a little yippy but tolerable.  In the AM there is plenty of parking around this spot.  I like to go to the bagel place next door and order my bagel, get a cup of coffee, add cream/sugar, and get my bagel.... takes about 3.5 minutes.  Not that I have timed it..... yeah right.\n\nSee you in the morning.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-18", "description": "I enjoyed the ginger latte special I had here - not too sweet, not too bitter/ spicy.\n\nI was VERY tempted to get a slice of angel food cake. Or a Russian tea cookie. Or a morning glory bread slice. Or banana bread slice. LOTS of snacks and sweets to choose from!", "author": "dj z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-06", "description": "How can anyone burn coffee this badly? \nEEEWWW!!! \nI have tried this place three times, and each time, i threw it out after a few sips. For the record, i drink espresso drinks. \nWhy does anyone frequent this place? it is beyond me and my husband. \n\nGROSS-GROSS-GROSS!!!\n\n*to be nice, they have nice baked goods.", "author": "SF U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-27", "description": "The aroma of the coffee lures you in and drinking it abso-friggin-lutely meets the expectations. The place has a weird set-up for ordering (the one on 24th st, that is), but its totally worth being a little confused for a sec.", "author": "annie c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-01", "description": "I guess what is special about Martha's is that it serves honest to goodness coffees, wonderful selections of teas and treats of all kinds (hard to name a favorite, but I love the Oat Jack, carrot cake, breakfast burritos, and their breakfast bagel, which by the way is way better than the bagelery next door).\n\nBut what makes Mart-ta's real special is the staff and their approach. I don't know their names, I don't feel a great sense of common customer recognition, but what I do feel is hospitality. Kindness to help whoever is ready with a smile and a general earnest. I think this process overwhelms many people. \n\nMost people are used to more ordely lines (why there is always a back up) and surly coffee-jockeys that are more interested in flipping their hair out of their eyes than making you a cup of coffee. Martha's has none of that. Not one I've been to. Martha's is family owened - I don't think there is any room for it.", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-19", "description": "Been going here since the day it opened. Martha and Patricia still tease me that they knew me when I was just a kid. Great coffee, quick service, friendly staff (for the most part.) The parklet in front helps alleviate the sidewalk traffic jam, especially on the weekends. It's not Martha's fault that Noe Valleyians have the worst sidewalk etiquette in the city (it's like driving, if you're going to stop then pull your ass to the side so the rest of us can get by without your dirty looks for brushing by you because we don't feel like walking face first into a telephone pole. Thank you.)", "author": "Tobias P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-09", "description": "This is a great little coffee shop which a very relaxed vibe and very friendly baristas. I highly enjoyed the latte I got from here; a very solid shot of espresso I could tell. A cup of coffee from this place complemented a nice walk through the neighborhood. I'll try again when I'm in the 'hood.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-29", "description": "The coffee here is the best, five stars worth, and I would give them all but... there's a few things that just aren't right. OK, I tend to go there at peak busy times, but the staff is pretty hopeless and I'd say I get what I ask for (not complicated, a latte) maybe, say, half the time. Rest of the time I have to remind them a couple of times before it appears. The seating at the back is very depressing - kinda tucked away under a low ceiling, but really, the biggest problem with the place is not the place but the bozo's who hang out outside. A bunch of old (well, OK, middle aged perhaps) guys, hanging out all day and never giving up the seating, pontificating endlessly and loudly on their non-too-orginal noe-valley-style opinions, and shooting evil glances at anyone who tries to, say, walk down the sidewalk.\n\nLove the church street and cortland street martha's.", "author": "emily c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-02", "description": "The last time I moved, I only looked at apartments within a 10 block radius of my old place,  One of the reasons being, so I would be able to keep getting my coffee here. That's how much I love this place! \n\nMy problem with most American coffee shops is, that their coffee is either too weak or tastes bitter. And yes Starbucks, that includes you too!  Well, this is definitely not a problem here. I get such a rush from the caffeine that I make plans to tackle all these projects I have - well that is until the caffeine wears off again, and then I put everything off till tomorrow, like I do everyday.\n\nAnd not just the coffee here is amazing, but also, the people who work in this place. Always friendly, fast, and somehow in complete control of the daily chaos in the mornings. BTW, the first cash register is for ordering coffee, if you want espresso drinks go to the register in the back of the shop. And don't be intimidated by the middle aged male peanut gallery which congregates on the benches in front of Martha's every day. It can be quite amusing to eavesdrop on their conversations, especially when they talk about the problems low-income families face. Like anyone who lives in Noe Valley and evidently is retired by age 45 would have a clue what it's like to support a family making minimum wage!\n\nAnyways, one time however to avoid this place would be on weekend mornings. Then it's swamped (both in and outside) with screaming kids and ginormous baby strollers. Apparently there must be a law in Noe Valley making it OK to completely block the sidewalk and force people to walk in the street as long as it's done with a stroller. \n\nBut such is life in Noe, and thanks to Martha's for making it better, one cup at a time!", "author": "Nucnuc M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-17", "description": "I enjoy the caffinated as well as non-caffinated drinks here.\nGreat selection of pastries\nWonderful fruit salad!\n\nHere's my only beef, and frankly it is one that I am perplexed and dismayed about:\n\nI am lactose intolerant, also I enjoy milk like substances in my hot drinks (or cold) to cut the acidity of them... I always request a tiny bit of soy milk for my and my significant others beverage (when I say tiny count to 2.5 while pouring one, two, . done) here's the inconsistency:\n\nI always get the soy milk, they don't deny me... however they do unevenly choose to react to my request.\n\nI have been charged anywhere from .50 to .15 cents for my 2.5 second pour of soy milk into my tea/espresso/coffee etc...\n\nI don't have a problem with this if it is the official policy of Martha's, however the problem lies in that it is not everyone who charges me and in fact have even had the same person charge me and then NOT charge me the next day (and they joke about it in Spanish as though I don't understand what they are saying). \n\nAll I ask is this:\nif it's .15 cents post it, or do it every time.\nif it's .25 cents post it, or do it every time.\nif it's .50 cents post it, or do it every time.\n\nIt's annoyed me enough on principal that I am fine continuing my 24Th street walk up to Starbucks where they don't charge me, or joke in Spanish about me asking for a splash of soy milk for my drink.\n\nThe reality is that Soy milk really isn't that much more expensive than regular milk, skim milk, 50/50 etc... \n\nHere is an interesting article on the subject I found by David Stephens:\n\nNow the only problem with their logic is Stocking and Preparation. Soy Milk is good for around 1,000 years (okay I'm exaggerating but it's not perishable like cow's milk). And last time I checked preparation is pretty much exactly the same (cow or soy) for your latte.\n\nSo Stocking costs less, not more, and Preparation is a wash. The question is how much more Soy Milk costs for Starbucks mega-corp to buy. For us individuals, the best pricing I could find is around $5.00 per gallon. For comparable milk, $3.50. Let's say the Stocking costs are around 50 cents less per gallon for Soy. So there's a net $1 additional cost per gallon, spread over approximately 40 servings per gallon, or 2.5 cents extra. Starbucks charges 40 cents, or almost 94% margin.\n\nSo how about some truth from Starbucks - \"We charge extra for soy milk because we can. Its an option that healthy, more affluent people prefer.\"\n\nIts value-based pricing & has nothing to do with costs. Come clean about what you're doing - and profit without a guilty corporate conscience. Don't blame it on Procurement.\n\n\nFinally:\n\ni stand by my assertion that overall costs are less for serving soy vs. milk & that Starbucks is pricing due to what the market will bear and enjoys large margins on this \"soy tax\". I prefer not to think of my post as whining, though... :) it's a simple request for Starbucks to be honest and not come up with fake reasons for the surcharge. let's just call a spade a spade...\n\nby your logic they should introduce different pricing schemes for non-fat, 2% and whole milk since each of these requires different containers and approaches.", "author": "A. E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-02", "description": "whatever. not starbucks. not cool. but it's coffee.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-23", "description": "The staff are all super friendly. I don't know how they remember so many customers' names. The coffee tends to be a little stronger here than at Starbucks. Lots of excellent pastry options. A great neighborhood coffee place.", "author": "Daniel N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-19", "description": "Yesterday, was my first time going into Martha and Bros and I had a fabulous experience. I wanted a smoothie and they recommended the PIna Colada. Andy made it for me, real nice guy, and was very conversational. I felt like I have been knowing him since FOREVER!  Overall I had a great experience, the cafe had a nice ambiance!", "author": "Rosa T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-23", "description": "a friend and i have come here twice, on the board tea is listed for $1.50 but after making the expensive tea they hand it to you and ask for more money. cause they say its the whole leaf tea. when asked why its not the price listed on the board they say its cause they used the whole leaf tea and insist you pay more. rude service.", "author": "Satoshi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-01", "description": "This is my favorite Martha's in the city.  Outstanding coffee, surprisingly good bagel with lox, nice benches outside to soak up a foggy morning in SF.", "author": "John W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-16", "description": "Love Martha Brothers Coffee! You often find yourself in a pretty large crowd when you come up to the shop but I'm always pleased with how quickly I have my coffee and am out the door. The staff is so warm and friendly- definitely no bad attitude coffee served here!\n\nThe coffee is great, lattes are done right every time and they have a lot of really great food! I am a serious addict of the pumpkin muffins (and so are other people since they are often sold out). Definitely a great choice for your go to coffee place.", "author": "Karyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-03", "description": "probably the best coffee house in noe valley...\n\ni'm not a big fan of noe valley. it's too clean. it's too sterile. it's too bland. it reminds me of that neighborhood in the northern part of frisco. so i like to slum it in the mission. however, my dog (hi elvis!) loves noe valley, especially 24th street. he thinks it's all urban and stuff with shops, bars, restaurants.......and toy dogs.\n\nso i often cave in to his wish and take him to 24th street for a lazy stroll. there he likes to terrorize other dogs and attack little babies and kids. attack, attack, attack!!! rrrrrrr!!! good boy!!! pound for pound, my boy is the toughest dog ever! i'm so proud of him.\n\nthen after the mayhem, we like to stop by martha's coffee and frighten away the customers in line. attack, attack, attack!!! rrrrrrr!!! good boy!!!.......oh, hi, one medium coffee please. thank you.\n\nthe coffee is pretty good here. not ritual coffee good, but certainly better than starbucks or tully's, which are a few blocks down the street. and the staff is friendly although i suspect they're just scared of my boy. i'm so proud of him.", "author": "frisco j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-12", "description": "Martha is the quintessential entrepreneur. She's a warm professional who understands and caters to the needs of her community. The products are homemade, fresh and organic.  The staff always remember my name and my order.  I can't live without my morning cup of Martha's.", "author": "Tak O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-04-30", "description": "I'm not  a big fan of Martha & Bros. in general.  I find their shops to be rundown, and the service apathetic.  The folks here are friendlier, but the place has a sloppy vibe.  I'm not likely to return.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-04", "description": "Though the ladies in this Noe Valley location do have great, helpful demeanors upon first experiencing the service, I have to say that I was hugely disappointed today.\n\nI went in and ordered \"the smallest size\"....My exact words, with an emphasis on \"smallest\".  When I went to receive my coffee I noticed that it surely was not the smallest size, it was in fact a size larger...This size being the standard smallest that you would find at other coffee shops.  When I asked if this was in fact the smallest size, the barista lady responded with \"we're phasing out the smallest size, this is the new small, so that's what I charged you for.\"  As she said this to me she showed me the smallest size cup that I was expecting...There were plenty of those cups to go around.  And did she apologize for her mistake and offer a reimbursement?  No, she didn't.  Great service would have been offering an apology for the mistake and a reimbursement for the size I did not want to pay for.  Great service would have been paying what I wanted to pay, but getting the cup she prepared.  And great service would have certainly been abiding by what was currently written on the menu of available sizes, not by what WILL be happening...If that was in fact true.\n\nNo apology, nothing...Just moving on.  I know it's a matter of dollars and cents, but it is a matter and one that matters to me.\n\nI was so excited to have found a cute coffee spot within walking distance of my new home...But now I'm just turned off.  I'll walk a little further for the service I'm accustomed to.  \n\nThey do have quite an assortment of pastries...But they are definitely nothing to chat about.  If you don't have the goods, you must have great service.  Fall short on that, and you don't have much of anything.\n\nThe second star is for the free wi-fi, hang-out-ability, and because I've had better experiences here before.", "author": "Susy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-21", "description": "I stop here on the way to work every day.  Excellent coffee and the barristas are fast and friendly.", "author": "Andrew E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-01", "description": "I always heard such amazing things about Martha Bros, and I don't understand it. I've tried quite a few lattes here and they always are wicked strong and they taste burnt. I keep trying it because it's local and I want to support local business, but if I'm going to do that, I'll hit up Ritual down on Valencia. Martha's just not all that.", "author": "Christy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-06", "description": "Okay, I'm really picky about my coffee and Martha Bros has BY FAR the most delicious cup of STRONG coffee I think I've ever had. Peets is a consistently good cup as well. The other thing I really like Martha's for is their espresso drinks. Having spent many a year being a barista back in the day when it was not such a glam job by any means, I feel as tho finding a well-made, properly frothed, unscalded latte is impossible anymore. Lattes these days seem to be a cup of scalded steamed milk and a shot of weak espresso. Awful. But Martha's lattes are half milk and half foam, NOT SCALDED, with really strong espresso shots. Mmmm.\nOne thing I did hear, however, from an ex-fan of Martha's, is that they are pouring whole milk into the half and half containers on the counter. She said she saw it happen consistently. That's pretty darn cheap and snakey if you ask me. However, still the best cup of coffee and latte you can find in the city.\nOh, and excellent staff. Fast and efficient. Very little turn-over which is a good sign.", "author": "amy b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-14", "description": "The Mexican Mocha here is damn good - not as good as my at home Ibarra version - but damn good. And a good place to get stroller advice, just like everywhere else in Noe Valley. The service can be spotty but it's generally nice enough. Get a pineapple bran muffin and you'll be glad.", "author": "Casey W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-21", "description": "I love the fact that Martha's is no more than 50 steps away from my flat. I love the fact that they serve up consistently good - and unabashedly strong - coffee and espresso drinks.  I love the friendly family business vibe. I love the fact that a small vanilla latte packs enough punch to keep me going nearly all day. I love the overwhelming assortment of baked goods they stock on a regular basis, even though I rarely stray far from my usual chocolate almond cream cheese bread.  I love that they know that I usually order a small vanilla latte and a slice of the chocolate almond cream cheese bread.  I think I also love whoever came up with the idea for chocolate almond cream cheese bread.", "author": "Becca V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-19", "description": "Seriously- buy the Cappuccino Blend, grind it fresh and have it every morning. Its the best coffee in SF, screw Peet's! (not to metion starbucks, gross-ness!)", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-18", "description": "After a disappointing lunch down the street, I was walking to my car feeling not-quite satisfied, and Martha & Bros had attracted quite the usual SF outdoor crowd.  I walked right past, catching the faint smell of coffee, and made it all of ten feet beyond the property line before my senses kicked in and turned me back around.  Inside wasn't crowded at all (in fact there was no line at all).  Staff was helpful in helping me figure out what I needed.\n\nI had their mochalatte with an extra shot (this is a blended drink with ice).  Unlike most places that just blend the extra shot in, they poured the extra shot in with the top 1/4 of the drink.  It also looks like the chocolate they're using is Ghiardelli, which is one step shy of crack cocaine for an addict like myself.\n\nThe result of this subtle difference over the green-aproned competition is remarkable: you get a drink that goes from bitter to sweet as you drink it (and as the dark espresso flows down through the frozen drink), literally good to the last drop and amazing for a drive out of the city on a hot day.\n\nSadly, as I live further down the bay in San Carlos, I probably won't get back here as often as I like -- but since my partner has a regular appointment in this area...it may mean one more good reason to take the drive in to \"be nice\".", "author": "Dan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-18", "description": "I've walked by here a million times and there are always local-types standing around with their dogs and friends, chatting and drinking coffee. There is a Tully's and Starbucks within a couple blocks, so I figured it must be pretty good coffee to have such a loyal crowd. I got my usual latte, and it was great, and the service was very good too. It doesn't have the best layout for hanging out inside, and the condiments area is annoyingly far from where you pay and hard to navigate with more than one person. And they have no splenda!! All coffee places should have splenda. I would definitely get coffee here again, but only if i didn't want to hang out, and was just walking through.", "author": "Cyrelle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-25", "description": "From Sunup to Sunset, Martha's represents chitchat central for the entire 24th Street corridor.  Show up at eight and you'll find a little slice of Noe Valley seated on  the outdoor benches facing 24th Street.  Some people read the paper, some chat, and some just smile and soak up the morning sun while gazing southbound towards the San Bruno Mountains as their eyes convey a state of of blissful trance. Around nine things get crowded, and the bench area gets log-jammed with cantankerous codgers, doting parents, rambunctious toddlers,  and bagel-stealing dogs. Patrons run from young to old, and political views range from that of old-guard Socialists to Rush-quoting Reaganites.  Diverse opinions coexist peacefully for the most part...but when arguments heat up, it's fun to sit back and watch the sparks fly.  After 10AM or so the morning crowd moves out, but lunchtime brings a crowd of retirees and the conversation rages anew...\r\n\r\nStandard issue pastries and muffins grace the indoor counter, and pre-made sandwiches make for a quick snack. Bagels and egg-based sandwiches are available just two doors down.  The coffee is a pleasant compromise between the watery blandness of Starbucks and the overpowering might of Peet's.  The creme-and-sugar stations is oddly located, but well stocked and rarely if ever runs out of half-and-half.  The staff is pleasant, quick, and remembers what you order if you're a regular.\r\n\r\nMartha's on 24th Street is my morning hang where I read the paper, chat up the locals, and waste many a sunny morning.  If you're in the hood, check it out.  It's got all the pleasant nuances of a neighborhood pub, but with a cup of coffee priced at a buck-and-change instead of several pints of ale at $4.25 each.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-28", "description": "I went in there on a Saturday morning and there was a line out the door, as usual. When it was finally my turn, I asked for a small coffee. The lady looked at me, then down to my belly (I'm 7 months pregnant) and said, \"Decaf?\" I said, \"No, regular.\" She looked at me, gasped, and put her hands up. I was LIVID. That's never happened to me before. I was totally stunned and said, \"It's for my husband (which it was) but that's none of your business.\" After I left, I was so pissed I didn't say more and cause a scene.", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-29", "description": "This is *the* place for coffee in Noe Valley.  Please, please, for the love of God, skip the Starbucks and check out what the lovely, friendly ladies at Martha's have in store for you.  I go here about 4 times a week for strong coffee, good pastries, always happy smiling faces.  Cruise by on a Saturday before noon to experience the parade of strollers and onslaught of pedigree pooches for what can only be described as the quintessential Noe Valley Experience.", "author": "Cat T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-19", "description": "I don't understand why this place is so popular.  There are no comfy seats, and the coffee is weirdly spicy.  Bad spicy.  The Last Laugh is a much better choice.", "author": "Des Esseintes I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-10", "description": "I grew up coming to Martha's, starting back before it was even called Martha's, and now I work next door, so I have spent a good deal of time and money here. Everyone who works here is really friendly, including Martha herself. It is a little bit dark, and often too crowded, but that's not about to deter me from supporting this spot. The drinks and pastries are good, and the prepared sandwiches are decent. Very nice.", "author": "Aly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-23", "description": "On Saturday mornings this is a congregation of locals chatting about friendships and children, flueling to cross the street for the farmer's market.  Service is very emotional - I've had an overly friendly with \"a beautiful coffee for a beautiful girl\" and \"where did you go?!! sign here!!\".  Must be all that strong coffee that brings out strong emotions.", "author": "Anya B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-10", "description": "MUCH stronger than Starbucks.  Really hits the spot.  Great biscottis too.", "author": "Rebecca E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-28", "description": "I live just around the corner from this place so I visit often, even on my way home from work just to spend a few minutes to snack on a pasty and read a magazine.\n\nCoffee is strong but tends to taste burned during the late afternoon hours. The pastries are okay and not overpriced. The seating is adequate and the front of the cafe gets a lot of light. Sometimes the music, when I'm sitting on a chair in the back of the cafe, is a bit loud but maybe the speakers are right over me...I never noticed where they are.\n\nSeems to me that this is a regular hangout for lots of people. I see many of the same faces. The servers are quite nice and friendly.", "author": "tom g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-21", "description": "Good place.  I don't especially love their coffee - I think it's better than most, but not my favorite.  Though to disclose, I am more of a Peet's person.\nI don't like how they shout at you and you can't tell if you are being asked or someone else.\nI don't like how sorta hectic it is in this place.\nI HATE with a passion the disgusting spoon after it's been dipped by someone in their coffee and then put back into the sugar.  Come on Martha - figure a better way or just replace the spoon every once in awhile.\nI don't like how there is never any seating and if so every table wobbles / etc.\n\nHowever, they get points for good coffee, friendly service, and a good place to take coffee and run.\nAnd I think they are way better than Starbucks and Tully's so kudo's to them.", "author": "Jonathan H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-08", "description": "The coffee was not bad. They burnt the milk for my au lait, and had the coffee minus milk sitting on the counter in the paper cup for awhile before bothering to ask the order taker \"what is this?\".  They also automatically put it in a paper cup, don't have wifi, and weren't friendly.  It does seem to be some sort of community center, but I am forced to say.... Martha Bros, Noe Valley is for old people - a different generation at least.", "author": "Heidi P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-20", "description": "The ladies who work at this location are so sweet.  They know all the regulars' names and drinks, work hard and are all smiles.  The coffee is better than average but not stellar.  My cappuccino the other day was quite delicious; you know how sometimes a cap can taste discordant (like espresso with a glug of milk) well this one was harmonious, topped with plenty of foamy goodness. And its 2 blocks from my place; the combo of quality service and convenient location is tough to beat.", "author": "Tina D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-01", "description": "Seriously, Martha's & Bros is not worth your energy.  By the time you finally manage to squeeze through the door that is blocked by strollers and dogs, the line is so slow moving that you forget why you came there in the first place.  Luckily, the menu on the wall clues you in but the wait just to get your favorite cup of coffee can be torture in itself.  Make your life easier and head down to Bernie's a few blocks away for your weekend morning coffee fix.  Unless you want to create more drama in your life why start your morning annoyed with the world.  I am sure that you have more important things to achieve.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-07", "description": "I live in the neighborhood so I frequent the place. The staff is always very friendly and welcoming, the coffee is pretty good and strong. Pastries are run of the mill, and if you're a Costco member you will recognize the products. \nRecently I noticed the \"small\" coffee  is sold now  in a cup as small as the spit cups you see next to sinks; price remained the same but the quantity is a joke; hate that kind of manipulation; did Martha and Brothers think their customers wouldn't notice? Also, this is an extremely popular and profitable business, free wi-fi would be the gracious thing to do since we all spend so much money there.", "author": "keiko s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-11", "description": "Excellent macchiatos and usually good beans. I usually get .5 lb of whatever they have on sale and grind and brew it at work so that I don't get tricked into going to our pricey coffee spot. The Cappucino roast is excellent, skip the Kona blend, which I thought was a little dry and flavorless. I can never make the espresso as good as they do, so I love stopping by there for a double macch on ice whenever I have an excuse.", "author": "Liboo K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-02", "description": "Ahh Marthas - you were responsible for many a sleepless night until i discovered you did decaf espresso drinks! HURRAH\nThe coffee here is dark, rich and super strong! It is quite the best coffee I have had and I normally favour a milder roast! I find myself craving a Marthas coffee and when I go back to the UK I spit out the crappy, milky sh*t they serve us as my taste buds have learned to appreciate the fierce coffee life can bring you!!\nThere is always a queue here, and lots of Noe valley-ans arguing the toss about something or other on the sunlit benches outside! I come here quite often and find the staff friendly and efficient though have read that other people find them rude. I suspect these people themselves don't practice smiling or making conversation first and therein may be the problem. These guys are so busy and see so many people every day that unless you make the effort they just get on with serving the hordes who come through their doors to be caffeinated!!\nAnyway, I think they are great and the coffee fantastic and the chocolate brownies are my nemesis! GOD THEY ARE GOOD!! And nut free which is great for one who is allergic to the damn things!!! YUM", "author": "Imogen d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-15", "description": "Coffee does not taste good, kinda like poo...Good thing they barely filled up my cup. Unfriendly staff, much rather spend my coffee money at Bernies!", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-05", "description": "love this place:  fantastic coffee, great selection of breakfast pastries, and probably the friendliest service you'll find in a coffee joint in the city.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-23", "description": "yes, martha does care about the coffee's quality that she didn't hire me cuz my milk was \"too cold\" or \"too hot\" even though it was my 4th day and didn't have much training. she said she was gonna think about it....and so far she hasn't call me. and i doubt she'll pay me for training, too. but whatever....their coffee's alright by the way. i've tasted better.", "author": "JK R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-11", "description": "Friendly staff, good eats, and strong coffee. Too many people, always crowded, and a little pricey.", "author": "Jessie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-26", "description": "I love this coffee shop, the coffee and espresso drinks have a great flavor unlike 'charbucks' - and when they recognize you day after day, they go out of their way to learn your name which makes all the difference.", "author": "J B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-22", "description": "A-OK, indeed. Nothing remarkable. A bunch of regulars sit on the benches outside, debating politics and the state of San Francisco. Apparently, things were all better in the old days. I don't enjoy the atmosphere much, lifeless inside, and the kid without friends outside. The coffee - acceptable.", "author": "Victoria A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-06", "description": "My birthday girl! (we have the same birthday) Despite that and being a sweetheart, she gets five stars. Any coffee that makes your fingernails sweat must be good. Right? Her signature blend is very good.", "author": "Jeff B."}
