{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "Before he got killed by a stampede, my dad told me that when we look up at night, the stars are the great Indian dinners of the past looking back at us.\n\nThey're not balls of gas billions of lightyears away; they're not fireflies.\n\nMy dad MUFASALA DOSA taught me most of what I know in life. Once each year I order out in his memory.\n\n(^_^) LAMB KORMA $16\nMost pieces were tender.\n0 spiciness, as requested. thx\n\n(^_^) CHICKEN MADRAS $15\nTender chicken w coconut & raisins.\nFinish w rum raisin ice cream. Or just rum jk.\n\n(-_^) GARLIC BASIL NAAN $4\nIt's naan.\n\nRich. Tasty. Creamy. #thatswhatshesaid #nobromo\n\nTill we find our plates, tablecloth unwinding, in the circleeeeeee the circle of naan...", "author": "Dan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-05", "description": "This is an overdue review but I decided to now post it seeing how I pass by the restaurant frequently on my way home.\n\nI ordered the chicken Tikka Masala with a side of rice to go. The Tikka Masala was terrible. Although the chicken was nice and tender, all of it was just way too salty. At one point, all I could taste was salt and had take sips of water in between bites. I'm not overly picky about food and would normally try to eat most of it but I couldn't stand eating any more. Due to my dissatisfaction, I decided to go back to the restaurant in hopes of exchanging it for something else. I went back to the restaurant and told the host/server my problem very politely. I never mentioned a refund. I just wanted to exchange. He seemed annoyed and called somebody else over for help. This new man must be a manager. I told him that I found the tikka masala way too salty and he was explaining how it's supposed to taste like that. I then asked if they taste test their food before serving and he said yes. I was shocked that they would approve of serving something so terribly salty. Anyways, he did let me exchange for something else and I choose the samosas because it seemed like a safe choice. The samosas were surprisingly good so I do recommend those.\n\nPros: Good portions, they let me exchange for something else, and the samosas were good\nCons: The tikka masala was terrible and I felt they were rude to me when I told them I was dissatisfied with my meal.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-25", "description": "Tried to order today via Grubhub. This has been my go to for the last few months because Idly Fries. But, alas, never again. Ordered for lunch today, two hours later, nothing. Called and was told, \"The driver was busy and stuff.\" Exact words. He then offered to deliver my already prepared and cooked food in another hour. That's it. No discount, no \"So sorry\" nothing. Canceled the order, needless to say. \n\nNever again, Masala. Never again.", "author": "Radha K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-16", "description": "Overpriced and underwhelming food. $12 for below average masala dosa is too much.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "This review is based on my experience through door dash, as I have not dined in here. The order came relatively quickly and as described. \n\nI order the chicken tikka masala, garlic nan and samosas. Really loved the samosas I had from here. Will definitely order again", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "My friend Jill recommended this delicious Indian restaurant in the Inner sunset district In San Francisco. The restaurant is a gem almost untouched by the hustling and bustling crowd, it's quiet, priced reasonably with a nice ambiance so you can have a conversation . The food, particularly the curries were so delectable and so much to choose from in the menu. I love the spinach dish too! The waiters are helpful and funny. It's BYOB and that's great because you can get wine that would go with your meal so I brought a bottle of Chardonnay to the restaurant.", "author": "DJ Nocturna R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-24", "description": "Masala Dosa seems like a solid Indian restaurant in the Sunset, serving both North and South Indian cuisine. I was yelping for a place my friends and I could go for lunch after running Bay to Breakers and came across Masala Dosa. \n\nWe arrived around before noon and the place was pretty much empty. We were seated right away in the front where the window was. I ordered the samosa and seek kebab dosa (spicy ground beef filling). The samosa appetizer came with two pieces. It had a nice crispy exterior but the filling was bland. The dosa was pretty good though.\n\nFor a party of 9, the food didn't take too long to come out. Service was pretty spotty. With an empty restaurant, I figured it would be easier to get our server's attention. Unfortunately, he was out in the back kitchen most of the time and was hard to flag down.\n\nWhen it was time to pay our bill, our server informed us he was having issues with his credit card reader that day and asked if we could pay cash. Luckily, we were able to and got an additional 10% off our bill.", "author": "Steph F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-12", "description": "I would definitely order take out from here. It's nice that the vegan options are so clearly labeled. My masala dosa was tasty and filling. \n\nThe restaurant itself was smoky. We were the only patrons for a bit at lunch, and it was smoky as soon as we walked in, although no food was cooking. Maybe it has poor ventilation in combination with a fireplace? The dosa gets four stars, the restaurant two.", "author": "Erin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Ordered through door dash and the order was quick and delicious and would not hesitate to repeat it again since it's near impossible to park around the 9th Avenue area nowadays.", "author": "Shelton F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-12", "description": "Extremely disappointed with this place. I called in an order for delivery and 3 minutes later called back to cancel because my friend and I had a miscommunication about who was going to order the food. Mind you they told me it was going to take one hour for delivery and I called back 3 minutes later to cancel. Three. They refused to cancel my order. If they really started cooking all of the food (he said they would only be able to cancel the rice), I really want to know what is going on with my order for the next 57 minutes as I live 5 blocks away from the restaurant. This is example of greed and bad customer service. I hope you guys enjoy the $37 you charged me, cuz it's the last time you will ever get any of my money.", "author": "Noah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-19", "description": "This place was recommended to my friend and me. The food here is great. We both liked the  hearty lentil soup, filling and full of flavor.  Since it was our first time the waiter suggested the Chicken Tikka Masala which was also great. Prices are reasonable and the dish was medium spicy. Rice is extra. \n\nThey have gluten free and vegetarian options. Their menu is extensive, with lots of curries - how do 8 kinds of lamb curry and 11 naan choices sound? Next time I want to try the goat cheese or spiced ground lamb naan! \n\nDarkish, unassuming interior with gentle, relaxing music. The unisex bathroom was clean. Delivery is free for a pretax minimum of $25. \n\nOne needed improvement though is service. When we walked in, after 2 pm on a Saturday, no one greeted us.  I had to get a kitchen staff member's attention to be seated. Still, that would not stop me from coming back again. I say come very hungry or with a group so you can order a range of tasty food.", "author": "Mia K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-15", "description": "I was craving for some Masala dosa so I ordered the Sambar Vada and Mysore Masala dosa from them. My food was delivered ahead of Yelp's ETA and unfortunately that was the only positive thing about that night's  experience.\n\nRight from the first bite I knew the vada was stale and the only reason it was bearable to eat was because it was soaked in sambar.\n\nWho makes Masala dosa without coconut chutney ? Apparently these guys do. The green chutney (pudina/mint ?) was also not fresh. The only saving grace was the red chutney. After eating like half of the dosa i threw away the rest of the masala/potatoes and just ate the dosa part.\n\nTL;DR: As someone who grew up in South India this was one of the worst   Masala dosas I ever had.", "author": "Ruben M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Gluten free dosa, say absolutely no more. I'm thrilled to find this place. I'll be trying each dosa!", "author": "Arthur D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-14", "description": "The place has a combination of south and north indian menu. Although the name suggests it might be primarily a south indian place, it looked more of north indian. I tried mostly south indian food and the quality of food was below average. Neither it was fresh nor made skillfully. \nThe service was ok.", "author": "Vish B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-26", "description": "It was an average food place, not great for vegetarians. I was kind of disappointed with the food. Service was fast but the taste was same in all dishes!", "author": "Twinkle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "This is becoming my new go to Indian restaurant in the Sunset. \n\nThe food is great and I get great service.\n\nI ordered delivery through the Eat24 app and my phone never rang when the driver called... instead he waited for a neighbor to let him into my apartment building and he delivered it to the door!", "author": "Dan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "This place is amazing ! I dream about this place . The customer service was amazing and quick. I highly recommend this place.", "author": "Charday H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-25", "description": "Price is high as expected but food is not upto the mark. \nDon't try lamb curry it has no taste", "author": "Gyanadeep S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-19", "description": "I went here for dinner a few nights ago. The Dosas, as others have mentioned, are not very good (despite the restaurant name). The staff was rude and took too long, and there were flies everywhere. \nAlso, it's much more expensive than other restaurants like it. Save your money and have a better meal at Gorkha kitchen, Tikka Masala, or Naan and Curry, all in the neighborhood.", "author": "Will T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "This is a cozy restaurant that we just loved! We were looking for a different restaurant that was closed and decided on this one since we love Indian food and they had gluten free offerings. We came in from a chilly SF night and the hostess greeted us with a huge smile. She also pitched in and made sure we were well taken care of.  We ordered pakora for an appetizer and it was amazing. Light and airy, but super flavorful. We moved on to Chicken Tikka and Vegetable Biryani. The Biryani was indeed the ultimate rice dish. The aroma from the spices floated up in the steam. The Chicken Tikka was delicious too. We also treated ourselves to a pea and tomato crispy crepe (I don't remember the Indian name) that came with delicious chutneys. This was amazing!  We finished dinner with a rice pudding flavored with cardamom that we relished every bite.", "author": "Elizabeth F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-22", "description": "Still thinking about the goat cheese naan. Would totally go back just for that. Everything else was basic and I think they were skimpy on the meat. \n\nStopped by late on a Friday night because we were craving Indian food. Craving was fulfilled and the food was good. We ordered samosas, lamb vindaloo, chicken tikka masala, vegetable biryani, naan, and goat cheese naan. Don't judge me, but the goat cheese naan reminded me of a really really yummy herby crispy grilled cheese sandwich. Probably explains why I enjoyed it so much. I've never tried dosa before so perhaps I'll go back to try theirs.\n\nThey weren't too attentive. We had to ask for water refills and the check.", "author": "Mary O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "We had Dinner here Sunday evening on Mother's Day Amazing!!! The food is delicious and perfect portions to share family style. The service is impeccable and personal. We had Chana Masala Delicious, Eggplant pakora, chicken tikka masala, palak paneer, Masala Dosa , garlic basil naan , rice! Im thinking of when will I eat here again and what will I have As I'm writing this review!  Today Lunch maybe Dinner!!! Sorry I didn't take any pictures. Thank you for a great meal!!!", "author": "Rosemarie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "We love to go here when we have Indian food in the Sunset. Tasty vegan options! Great environment and great and friendly service. Parking can be tricky of course", "author": "Carmen O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "We ordered the samosa, naan, garlic naan, rice, chicken curry and aloo palak. They were all amazing and tasty. The restaurant is clean and nice and they had nice service.", "author": "Hye Lin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-11", "description": "Misleading name. Not a good place for dosas\n\nThis place does not has good Dosa's, horrible chutney. Worst south Indian food that I have ever eaten.", "author": "Savinay D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-27", "description": "I ordered some samosa and took a first bite it was raw. It was not cooked properly. I told waiter about it and he brought another one which was also uncooked. Very bad experience.", "author": "Mahan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "It's not a Dosa place, let the name not mislead you. They have got a good menu of both north indian and south indian dishes. We ended up here looking for a snack place after a tiring day in San Francisco. We order the Mysore masala dosa, Pakora, Vada Sambar and Tea. All of them tasted really great. Most of the places serves the masala of the Masala dosa with major portion of potato, but experienced something different here. The masala tasted really great even though it was made with potato. Vada was tasty, so as sambar. Chutneys were not that great, tomato chutney was the best among them. Pakora had a good flavor and tasty. the best among all was the Tea. It wasn't the typical masala tea served in India restaurants. It tasted like the homemade tea. A lot of nice people and smiling faces around too.", "author": "Jay T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-26", "description": "Hey Girl!\nNo, it's not Ryan Gosling.\n\nIt was just dorky me calling out to my friend who I haven't seen in 8 months as we came here to celebrate her birthday dinner since she spent her real birthday in Switzerland.\n\nYeah, I was jealous of the Switzerland part too.\n\nMy friend really likes the chicken tikka masala here. Think creamy peppercorn sauce and curry and I think you'll have an idea as to why a lot of people like this dish here. I heard somewhere it was rated the best tikka masala in 2014. But, don't quote me on that.\n\nGreat with their garlic nan though. Which doesn't have as much butter or is as oily as other places. Their chicken palak (spinach) is lean too with not a lot of heavy cream. Good flavors overall and the meat wasn't dry which is always a good thing.\n\nThe chai is $2 and the cup is small, so prepare to get some refills.\n\nSo as I was dipping the nan into the mixture of  sauce and chicken on my plate, I handed her her birthday gift.\n\nI'm always stumped as to what to get a girl who isn't your girlfriend. I mean if it's a girlfriend jewelry is so easy to buy, but for the average girl, I'm lost.\n\nSo behold the Bath and Body Pumpkin Waffle candle! Because nothing says friendship like the smell of waffles right?!?!\n\nShe laughed. \n\nThankfully I know she likes candles since her house is filled with them.\n\nI told her I braved Bath and Body works just for her since the scent is so overpowering in that store. Smells like weird vanilla, food, plants, and fresh laundry all blended together.\n\nAlmost got a nosebleed spending time in that shop for her gift.\n\nThe food here is a bit pricey for the portion, so this is more of a 3.5 rounded up for the service since they are on point with water, boxes, and the check.\n\nDon't worry folks, I picked up the tab of course.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "This is our favorite Indian food in SF! They are always so sweet when they deliver and also in the restaurant. Food is always delicious and consistent! Spices are perfectly balanced and their paneer is quality.", "author": "staci H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "We thought the navratam korma (even though on the sweet side), masala dosa, sambar, onion naan, and chutney were all excellent.", "author": "Veg V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Pay no attention to the philistines and halfwits that give this gem less than its 5 star due. Masala Dosa serves up top quality dishes, consistently. It is easily the best Indian in the Inner Sunset. Their sauces are big, layered curries with depths to plumb for the thoughtful diner. Their ingredients are very good quality and the results reliably very satisfying. The service is friendly and competent. Try the palak paneer and the mixed tandoori. gd delicious.", "author": "Striddy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-21", "description": "I don't normally write yelp reviews but I feel the need to here. I ordered through Uber eats and while the delivery was very timely, I feel completely ripped off by the food. The naan tasted like it had been reheated from the day before because it was incredibly chewy and stale. It was difficult for me to tear off a piece. The bottom was also burned. I think this could only be because it was cooked twice. I also didn't taste any basil like advertised. The chicken tikka masala was also overly salted, the amount of salt they used burned my mouth and throat. The yogurt had also begun to curdle, I think that's why they used so much salt, to cover up the spoiling yogurt. My stomach is also beginning to hurt while writing this. They are also skimpy on the chicken, only 6 pieces to be exact. There should be more for the hefty price of $15. After spending a total of $40.39, I feel completely ripped off. The only redeeming item was the mango lassi. This is my second time ordering from here and it will be my last.", "author": "Christine S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-22", "description": "I'd give four stars for the food, but I have to take away two stars for the service.\n\nThe food was very tasty. I ordered a dosa, and the side sauces were delicious. My friend ordered a curry dish, and it was pretty good, too. \n\nFor a place that was not that busy, the servers are not attentive at all. You have to flag them down for anything you need or want - water, utensils, the check...", "author": "Rachelle M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-30", "description": "I ordered through Yelp. The food took 1 hour 15 minutes to reach even though it's just only 3 blocks away from my place but I couldn't cancel the order once it was placed. \nThe food was average at best. Ordered chicken tikka masala and chicken korma which were apparently their most popular choices so i thought it would be safe as it was my first time ordering from them. I felt the chicken was slightly undercooked and the portions were not good considering the price. Since it's one of the few indian places around, I wouldn't whole heatedly recommend it to anyone craving indian food but I would personally avoid it.", "author": "Shashank G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-02", "description": "Terrible, terrible food. Complete rubbish. The fish Masala Dosa was nothing but Dosa stuffed with plain stir fry fish and potatoes. The sambar was liquidy and the chutney was nothing special. \n\nAs a South Indian, I can say with authority this food is disgusting. \n\nThe service was equally terrible. The waiters are rude.", "author": "Bindiya T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "I've been several times and have loved all of the dishes I've tried. The Dal is my go to with some naan. Their samosas are fantastic, too. Definitely recommend.", "author": "Mitchell R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-27", "description": "Came here with 3 other people and there was only one other group of people in the restaurant. Really great service here. We got two dosas, which were actually HUGE! Like as big as the table... haha. So if your in a group it's fine to just split one. Got the eggplant curry which was very flavorful, garlic nan bread, and chicken tikka masala. Everything was very tasty and we would for sure come back for more. So much on the menu I wanted to try!", "author": "Hayley D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-05", "description": "I'm a fan of the southern Indian foods like dosa, sambar, idly, pakora, etc.  I like Masala Dosa where I can get all of my southern and more common Indian favorites (with more curry).  I ordered the Mysore Masala dosa and the palak paneer.  The dosa was crispy.  Potatoes were perfectly cooked.  The flavor of the dosa filling was delicate compared with the palak paneer which was explosion of flavor.  Great tomato/garlic/ginger chutney and sambar with the dosa.  Restaurant would benefit from a lunch menu.", "author": "Catherine W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "My favorite Indian spot. Fast delivery and an adorable restaurant with sweet staff. I even had my rehearsal dinner here.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-17", "description": "Too expensive small portion of food and the naan or rice is not included with the entree and like other Pakistani/Indian restaurant. Better hit up shalimar instead", "author": "Mario L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "I am a frequent customer here and often find myself craving their food! Ive tried just about everything on the menu and highly recommend the dosas, goat cheese stuffed nan, Baigan Bharta, Fish Masala, Fish Vindloo, and Mango Lassi.I have never been disappointed or gone home hungry! \nThe customer service is great and you can bring your own bottle and they have no problem with it(:", "author": "Emma G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-29", "description": "It hurts me to give this place only 3 stars because the food was AMAZING. It was exactly what we were looking for and more than enjoyable. We decided to come here for a birthday dinner and made reservations for 9pm; the guy on the phone said a reservation wouldn't be necessary since they were very busy during that time anyway. The restaurant itself is very pretty and a good place to go for a special meal. \n\nThe only thing that was off about this place was the service. The same guy that seated us was also our waiter. He didn't tend to us very much and we had to call him over to us a couple of times to get his attention. We also didn't get very much water which was an issue only because the food was mildly spicy. At the end of the meal, we were ready to pay with a card and he told us that only that night they were doing cash only. He asked if the guy in the front of the restaurant told us it was cash only which was strange because he was the guy at the front of the restaurant. Anyway, the only one at the table who had cash on him was the birthday boy, so he ended up having to pay for the entire meal! Of course we paid him back, but it was just an awkward and uncomfortable experience which could have easily been avoided with some kind of warning. Regardless of the strange service, I would still go back to this place because it was that delicious.", "author": "Ren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "This is the best Indian food my husband and I have found in all of San Francisco. We have only gotten pickup and delivery orders, so I can't speak for inside the restaurant, but I've been super happy with everything so far.\n\nI recommend the palak paneer and the chicken tikka masala. Both are delicious!", "author": "Daphne W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-19", "description": "Is this supposed to be Indian food?\n\nI spent years working all across India and this resembles nothing I ever tasted or seen.\n\nWe ordered delivery food. It was highly reviewed on GrubHub and so we decided to go for it although we ended up spending over $61 for 3 veggi sides (palak paneer, aloo gobi and vegetable Jalfrezi), 1 order of somosas, 2 types of Nan and mango lassi (or so it said)\n\n1) palak paneer = ok\n\n2) aloo gobi = below average and drowning in a tomatoish sauce\n\n3) vegetable (looked more like a pasta tomato sauce) = untouched\n\n4) somosas = it looked and tasted like the Frozen somosas at Trader Joes... Actually those would have been a better choice! What am I saying, potatoes chips from a convenient store would have been a better choice!\n\n5) nan: aloo nan ok - kabuli nan uneatable \n\nHonestly it was such a disappointment. \nDON'T MAKE OUR SAME MISTAKE!", "author": "Erica S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-28", "description": "Well, I decided to give it a shot today mainly for a comparison with Moodees an other Indian restaurant which just opened in the same street :). The menu is pretty interesting, you have a large choice of plates. Unfortunately, it's maybe too expensive. I ordered a Chicken Tandoori + rice + a Goat nan (my favorite) = $20. Priceyyy... OK DEAL, that's monday, new week, new things to try, let's taste it. \n\nThe waiter told me that I had to wait 15 min. OK Fine, I was in my neighborhood so I could just walk around. I came back 10 min after. The waiter told me that I had to wait 10 more min.. Ok cool, but I was a bit worried because I was alone in the restaurant. \n\nFinally I got my plate 30 min after ordering even though I was alone in the restaurant.The server apologized for the delay, I appreciate it, but the conditions to have high prices  are \n\n1- having a tasty food\n2- great place\n3- good/fast service . \n\nThe first point is valid, the food was good, not amazing but good. The second too, that's a nice place. Concerning the third one, the server was kind, and apologized but it takes too many time... \n\nThey should change their menu with cheaper prices because since Moodees opened just near (only 50 feet away...), they'd lose a lot of clients.", "author": "Lino M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "This place is frequented by my friend her family so she took a group of friends here when we visited last week. \n\nWe basically ordered various versions of tikka masala: lamb, chicken, and paneer (my choice). We asked for 4 servings of rice but the waiter quickly recommended we only get 3. We thought he would know best but as it turns out, 4 was definitely the better number and he gave that extra order of rice to us for free!\n\nWe also ordered the goat cheese naan and the basil garlic naan. I don't like goat cheese, so I didn't partake but my friends loved it. My basil garlic naan was more basil than garlic but it was a perfect addition to wiping up all that extra curry.\n\nThe chicken tikka masala tasted very smoky, in a good way. I don't like lamb so I won't go there. The paneer tikka masala was perfect. \n\nI would recommend this place to anyone visiting the Golden Gate Park area craving Indian food!", "author": "Hannah R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-10", "description": "Decent Indian food for a reasonable price. The best part is that the food doesn't take that long once you've ordered but name is misleading, sells more Punjabi food than South Indian entrees.", "author": "Jhankhana J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "Haven't been here in a while but it's still very good! \n\nWe had the samosa, masala dosa, chicken tikka masala, and lamb vindaloo. We also realized about halfway though that maybe we ordered too much food!\n\nVindaloo was delicious--wish it had more heat though. When I see \"spicy\" at an Indian restaurant, I expect my mouth to be tingling at the end of the meal. The level of spicy was mild at best but I'll forgive them since their clientele in the inner sunset might not be okay with the real heat.\n\nService was kind and efficient. We were able to get a table on a Friday night around 930 very easily. \n\nAll in all a great option for dinner in the area. They also stay open fairly late (11pm) for the area.", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-08", "description": "Really solid neighborhood Indian cuisine. Big fan of the garlic naan and somosas. Nice staff, we normally order pick up and it's always on time!", "author": "Chris C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-19", "description": "I don't see Yelp messages through my mobile app and was able to check my messages on the website interface for the first time today in years. Been getting a lot of random and nasty messages from business owners and other reviewers who have nothing to do with me, which makes my faith in humanity die a little.\n\nAnyway.\n\nSomeone who I think is affiliated with Masala Dosa sent me the following message:\n\n\"we don't use MSG.Don't speculate about our restaurant. Get yourself checked from a doctor before eat out.\"\n\nSo I'm updating my review to get the story straight: Masala Dosa does NOT use MSG so that should never be a reason why you don't go there. Some good reasons not to go: their people send me rude messages, their service is slow, their food made me (and my husband!) feel terrible after eating. Guess we both need to see a doctor even though we both eat out plenty and the only shared variable here is eating at Masala Dosa? Hmmm.\n\nI absolutely agree that I shouldn't speculate about the restaurant and should only report what I experienced, which is now described above. However, I don't appreciate whoever messaged me to speculate about my health. There are much better ways to communicate with reviewers who you disagree with and this is not one of them.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-08", "description": "I had the worst experience at this place.Service was terrible and moreover they write tip for them selves.Stay away from this place.", "author": "Venkatesh R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-11", "description": "I rather come here than Naan and Curry down the block.\n\nThat said, the Tandoori platter and aloo naan had to be my favorite dishes.  I'm not quite sure what authentic Indian food is b/c I've only been to 3-4 places...  However, this place is good.  It's a bit more expensive than what I'm used to paying for indian,  but I'll still come back.", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-15", "description": "Meh is my reaction here. \n\nCame in on a Friday afternoon after getting my nails done. Since mom was craving Indian food (like we don't get enough). \n\nSaw this place on yelp with good reviews, and dropped in on a completely dead restaurant.\n\nUsually Indian places close during the middle of the day for this reason. \n\nOrder masala dosa, chicken tikka masala, and garlic naan. Staples that I expect to be super yummy and delish.\n\nMasala dosa was alright. No one has been able to beat Vik's masala dosa in my books.\n\nCTM was okay as well. Could have been better. \n\nGarlic naan needed more garlic. Ugh.\n\nService should have been impeccable, but it wasn't. disappeared after handing us our food. \n\nIndian restaurants have sooooooooooooo much potential, but when your lazy and your menu is priced above average, please do us all a favor and ask why your'e open in the first place.", "author": "Nika K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-10", "description": "Delicious well seasoned chicken tandoori breast , well done masala sauce (hence the name of the restaurant lol) and soft tasty naan.. this place is pretty legit , and the mango lassi is a smooth cool drink to wash down the spicy meal.. oh yes it's cash only because the man says credit machine doesn't always work which is fishy because I had him run it and it worked! Coincidence ? Or they are just trying to save money on the transaction ?", "author": "cristina s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-31", "description": "Possibly our favorite Indian in the city. Definitely our favorite Indian delivery. \n\nI prefer the chicken makhni over the chicken tikka masala. That makhni is downright addictive! I really enjoy the tikka masala sauce, but don't like the slices of chicken as much as the chunks in the makhni. I should try it with a different protein. I love their paneer and always get either the korma or the matter. The lamb palak is a no brainer; we get it every time. I love the lamb stuffed naan and miss it when we don't get it. Always get extra raita (theirs is the BEST, the one I try to emulate when I make it at home) and pappadum. \n\nNote: the \"Spicy\" is good and spicy. \"Very Spicy\" would probably be great for a few bites, but too much for me for a whole meal. The \"Medium\" is nothing. Same as the \"Mild.\" Big leap between \"Medium\" and \"Spicy,\" so they probably switch to a completely different pepper.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "The servers were very friendly and attentive. The food was also very good and they serve large portions so two people could easily share a bowl of curry. Just note that they charge $2 for a side of rice per person and an order of naan was $2 as well. I will be coming back here again if I am ever craving Indian food!", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-10", "description": "Tried their potato stuffed dosa, a ok. chicken tikka masala is not bad, probably my favorite of the whole meal. And the famous goat cheese naan- I think I prefer the normal naan..there is a thick layer of goat cheese and probably is meant for real goat cheese lovers", "author": "Sophia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "There food was tasty and authentic. Spices were just right. Had a great time with friends, we were allowed to bring in our 6 pack of beer which was awesome. Service couldn't of been better. Would recommend to anyone", "author": "Kevin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-17", "description": "Authentic albiet simple cuisine, very empty on a weekday at lunch time.  Dishes cost about $12-17, even at lunch.  They should consider doing a lunch special to get people in the door!", "author": "M S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-20", "description": "Ordered food to go from this place. The chicken tikka masala didn't taste right...the sauce was bland and looked diluted, and the chicken was dry. The naan didn't taste fresh and was not crunchy at all. The food here is over priced and the wait is way too long for what you get. Customer service was slow and the estimated wait for the food ended up being almost double the time. Not worth it. If you're near this restaurant and want Indian food then go to Naan and Curry a few blocks away.\n\nFYI...health score here is 86 out of 100...\n\nViolations\n\n    Moderate risk food holding temperature\n    Unapproved or unmaintained equipment or utensils\n    Low risk vermin infestation\n    Inadequately cleaned or sanitized food contact surfaces\n    Unclean or degraded floors walls or ceilings", "author": "Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Always a fan of Indian food and this place could not be more authentic and well represented of Indian food. The restaurant is located in area with many other food choices so I come to this area quite often. Parking can be difficult at times since it is mainly meter close by and is a very busy area, especially at nights and during the weekends.\n\nFood is of decent portion for the price. Their curries are spot on! Seasoning is on point and is not overly salted with just the right amount of flavorings that represent Indian cuisine. My favorites include tikka masala and the aloo matar, so yummy! Usually my boyfriend and I get two curried and one nan but the tandoori chicken is also awesome! I highly recommend trying those dishes. One nan is served in four pieces so the portion is good to share between two people. Highly recommend the garlic and basil nan, our favorite :)", "author": "Wendy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "This place is an excellent option for those with gluten free needs. The food is really, really good, and gluten free options --which is *most* of the menu-- are very clearly marked. \n\nWe had the chicken biryani and the sheek kebab uthappam. The chicken was super tender and juicy, and the rice was fragrant and delicious. The uthappam was super good. We can't wait to have leftovers tomorrow :)\n\n5 stars, keep it up!", "author": "Brent S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-11", "description": "I ordered Masala dosa, my friend ordered Chicken Tika masala, my food came 10 minutes before his food was served, my dosa was ok, but Sambar was cold, they heated up in the microwave & when I tasted it, i could tell it was cooked several days ago not fresh at all, it didn't taste anything like Sambar or even look like Sambar, I told the waiter to tell the chef if he is going to work in a restaurant called Masala Dosa, may be he or she should learn how to cook Sambar. Needless to say the worst Sambar I ever had. Waiter was real nice though. I would never go in there again, not for Masala Dosa anyway.", "author": "Angie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "This is a solid 4 star Indian restaurant! \n\nIf you are okay with shedding out a couple of more dollars for quality than Masala Dosa is the place for you! This is not your ordinary cafeteria style/buffet restaurant. I love those types of Indian restaurants for the sake of affordable prices and a full stomach. However, sometimes you just wanna treat yourself! At about $20 a person, my boyfriend and I had a delicious meal that included: Tandoori Chicken, Prawn Tikka Masala, Naan, Basmati Rice, and Chai Tea. Not to mention, a bottle of CAB SAV free of corkage fee! Yes, you heard it right! No corkage fee! (A rarity in San Francisco restaurants.) \n\nThe Tandoori Chicken is served on a piping hot plate with green peppers and onions sizzling away. It's gotta be one of the best Tandoori Chicken dishes I've ever had! This is a must try for all you chicken lovers out there! \n\nPrawn Tikka Masala was flavorful and was not overbearingly spicy. Smother that curry sauce over the rice and you got yourself, heaven in your mouth. (Shout out to Stephen Curry! Go Warriors! #WeBelieveChampionship2015. I'm going off tangent, but the Bay Area is just on this Warriors high that there are so many Indian curry references to Steph Curry. I just had to say it!) \n\nNaan was where I took one star off. I ordered the Garlic Naan and was expecting a fluffy, doughy, and flavorfully (hehehe -__-) side of bread. However, I barely tasted the garlic, the bottom had a burnt hue, and it was crisp thin. It's a bit surprising, because the last time I ordered their special, Naan filled with goat cheese and cranberry sauce which by the way was amazing, was fluffy, doughy, and flavorfully. It wasn't a deal breaker, but I think I'll pass on ordering the Garlic Naan next time. \n\nMoving on, I just wanted to point out that the promotional video on their Yelp page was personal and heartfelt. (Click play if you haven't already!) I definitely sensed the family oriented aura that filled the room. The customer service is spot and they really care that you have the best experience when dining at their restaurant. Going along with their value of family, the women's bathroom has a baby changing table! Not that many restaurants offer this! It's the little things that count and Masala Dosa does a great job in accommodating their customers' needs.", "author": "Briana H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-14", "description": "My cousin loves Indian food but he's never had a dosa before, so this was the obvious place to eat after a visit to the DeYoung.\n\nWe wanted to start with the Bombay (squid) Pakora, but they were out. Automatic one star deduction. So we went with the regular (spinach and onion) Pakora instead. Then we ordered the Chicken Masala Dosa and Lamb Korma.  Rice and naan were not included, so we had to order that too.\n\nThe Pakora was excellent.  It arrived hot and crispy. The tamarind sauce made it taste even better.  I wanted to eat another piece because it tasted so good, but I was afraid of ruining my lunch.  \n\nNext came the Chicken Masala Dosa. It was light, crispy, with an ample amount of small bits of chicken inside. My cousin liked it. I liked it a lot, but I think I like the Mushroom Masala Dosa better.  \n\nThe Lamb Korma was excellent.  Nice meaty, boneless hunks of lamb in a creamy sauce. The sauce paired perfectly with the garlic basil naan.\n\nPrices are about what you would expect for San Francisco. Service was good, my water glass was refilled as quickly as I emptied it.", "author": "The Bottomless Pi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "THE Best Indian food I've had in a long time. I've ordered a few different dishes from this place that were great,  but I recently ordered the lamb korma and it was so tasty ! Definitely recommend this place.", "author": "Eoin O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "This is my favorite Indian food place in all of SF. It's a small-medium quaint restaurant with really nice people working there. There is a seating section of the restaurant that is elevated by the window. It's very cozy and has pillows for you to put behind your back.\n\nThe food is AMAZING. My boyfriend and I have been coming here for 5 years. I didn't even like Indian food before. \n\nThe menu and especially the appetizers are very unique...thing like lentil \"donuts\" and onion fritter dipped in chickpea batter (everything labeled gluten free)....LOVE the salmon tandori and also all the veggie curries with paneer especially paneer-cashew one!\n\nIt's really very good and so underrated. I can't believe this place doesn't have a following!!! Most underrated restaurant in SF by far.", "author": "Larissa M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-19", "description": "Health inspection:  85 out of 100 points ?  Yikes !  No wonder my stomach did the tango after a dosa last week.   Any scores below 92 - avoid!   A few minor infractions are ok, but below 92 we are talking about critters and crud that's too gross to discuss . . . .\n\nThe dosa had good flavor, but I'll not go back.", "author": "Cinnamon Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-07", "description": "Food taste was below average and it is not very authentic. Tried briyani which, was not that great, tasted like tamarind rice. Idly was also not up to the level. Chutneys were not fresh. As the other place \"curry village\" has been closed people are left out with only two options now in inner sunset. One of them is this place. Fall of Curry Village has became a boon for masala dosa. People who come looking for curry village end up going here after learning that the other one has been closed a while ago.", "author": "Devan K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-21", "description": "Ambiance is fine, sat in the window table. They dont have a beer/liquor license so they recommend you to pop next door to the grocery to grab a six pack. They did nicely store the beer in the fridge for us. Appreciated. Papadums were stale. Masala sauce was watery, not spicy AT ALL and too sweet for my preference. My friend got one of the spinach lamb curries and liked his. His was the only \"thick\" curry on the table, probably because of the spinach. Naan was less than average. Had much better indian, so lackluster that I wouldn't return.", "author": "Anna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "Addictin' chicken. Frickin' addictin' chicken korma.\n\nI won't deny that the prices are a bit steep. But, the steep prices are validated: Masala Dosa is staged as a higher-end Indian restaurant than Curry Village or Naan N' Curry, so, adjust your expectations accordingly.\n\n(PASS ON THE) $6 EGGPLANT PAKORA: fresh eggplant dipped in chick pea batter and fried (http://www.yelp.com/biz_photos/masala-dosa-san-francisco?select=DJUKjAUgUbAZnjxp6gxe-A#DJUKjAUgUbAZnjxp6gxe-A)\n- This dish ain't my piece o' cake. It's like the Indian version of tempura, except the chick pea batter isn't fried to a crisp, which leaves the pakora somewhat soggy. Add that to the flavorless nature of eggplant, and you're left with something mushily tasteless. Albeit, the mint chutney and sweet tamarind sauces are delicious and are meant to deliver a large component of flavor, but then I might as well just lap up those bowls of sauce. As if I don't already do that, haaaa. Shhhhhh.\n\n(OMG YOU BETTER GET THE) $13 CHICKEN KORMA: tandoori chicken cooked in a clay oven stewed in a cashew cream sauce (http://www.yelp.com/biz_photos/masala-dosa-san-francisco?select=3cMzA8dlGFoRpmONh_ymOQ#3cMzA8dlGFoRpmONh_ymOQ)\n- Ridic delish. You should order this. And then, you should order this again. Yes, $13 is a bit of moolah for a dish that's usually less than $10, but just play some mind games and tell yourself it's $12.99 instead.\n- The bowl is small. Well, that's probably a mind game too. I bet it's actually the same size since the food is served in a normal bowl rather than those typical flat saucer dishes. Despite the small bowl, there's a heckuva lot of tandoori chicken chunks--I would say 8 or 9. And that beautifully moist chicken is what makes this dish addictive. This is most definitely the moistest chicken I've ever had in an Indian dish. And it doesn't help that the cashew cream sauce is liquid crack.\n\n(IF YOU WANNA, GET THE) $12 CHICKEN MASALA DOSA (dosas not available through online ordering): thin crepe with potatoes and chicken (http://www.yelp.com/biz_photos/masala-dosa-san-francisco?select=jYk3XRjZMohJGoKUUav3kg#T4Wfxp2FcovJNI19V75K7g)\n- The crepe is huge--3/4 the length of my entire arm huge--with a thin layer of chicken masala spread on it. It's served with sambar (a comforting chickpea soup spiced with tamarind) and chutneys (the cilantro-cucumber one was intriguing), as well as a small dish of tikka masala sauce (tomatoes, garlic, and Indian spices). Geez, that tikka masala sauce is bomb, so much so that I asked for a second serving (the server recommended it a bit warmed for more impactful flavor). Slurpity slurp slurp.\n- I can't quite figure out why the chicken in the dosa isn't as juicy as the chicken in the korma, since both use tandoori chicken. My guess is that the chicken in the korma is stewed in the cream sauce, which maintains moisture better.\n\n(PROBS SHOULD HAVE SOME) $3 GARLIC BASIL NAAN: baked bread with garlic and basil (http://www.yelp.com/biz_photos/masala-dosa-san-francisco?select=3cMzA8dlGFoRpmONh_ymOQ#pi0Mr3dLe0k3kh52SDwP3w)\n- The naan here is thin crust pizza-esque rather than fluffy, which lends more of a crunch. Enjoyed the generous seasoning.\n\nMy recommendation: skip everything else on their menu and hone in on just the chicken korma. That frickin' addictin' chicken korma.", "author": "Adele F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-17", "description": "There are so many Indian Restaurants in town to compare... I would say this one in top 10% for Sunset District. Price range is definitely appealing, service is fast enough, quality of food is average to good.  Overall , given the convenient location I'm giving solid 4 stars", "author": "Leo S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-02", "description": "I never write reviews. I just think this is needed for anyone who uses Postmates. \n\nPostmates doesn't give a rating system through their app. I wish they would have. \n\nI honestly have had better Indian food after the bars close in the marina (really, there is a good Indian street vendor on Filmore). The chicken tikka masala I got was the worst I've had in my life. The chicken looked/tasted like something you'd find in a Lunchable box or a elementary school frozen lunch box. The chicken wasn't natural, it definitely was processed (not being a snob, I just mean that it didn't come directly from the bird. Additional processing has been done to form it into something that looks like chicken). \n\nI won't order again, but if you are completely drunk, out of food and they are the only restaurant open, or you don't have taste buds, I highly recommend this place.", "author": "Daniel O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-01", "description": "I gave it one star just so I can write a review. Also, the waiters were pleasant.\n\nBut, the food. Gee...\n\nWe went here because of the reviews. The food tasted like someone made the meal from scratch using inedible ingredients- the Dosas and vadas and sambar were the worst I've ever had in my six decades of life- bar none.\n\nCan't speak to their North Indian menu- I didn't try it.\n\nBut, please, no South Indian food. I'd hate for a first time patron to leave disappointed with the cuisine. \n\nThe owners ought to rename this restaurant. Calling it masala dosa is an insult.\n\nIf you are looking for decent South Indian food , pl  look elsewhere.", "author": "thaila r."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-22", "description": "real bad indian food. This is not south Indian food and bad food. I am south Indian and i know this is not a good food. They take cash. I suspect that too... they dont split bills, WATCH OUT FOR THIS PLACE. Stale food, this place doesn't know Indian food. We were 3 and asked for split bills and waiter said he gives only one. Something fishy.\nThey microwave food. I doubt id they report their earnings.\n\nTHEY ARE DISGRACE FOR GREAT INDIAN FOOD.", "author": "Bhargava G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-10", "description": "Wanted Indian for dinner. Since we never order Indian delivery, my roommate did some yelping and decided on Masala Dosa. It's on the expensive side for Indian food, but we had a 20% off living social code, so we went for it.\n\nI loved the Tandoori chicken! I had been turned off by the last couple of tandoori dishes I had since they were super dry and almost inedible unless massive amounts if curry topped the meat. But this one was supermoist and had that nice charred taste to it. I would order this again in a heartbeat!\n\nNow for the lowlight of the meal. The dosa. So I've never had a dosa, but the restaurant has dosa in the name, so I thought I'd try it. It should be good right? Huge mistake! I'm not sure if they're supposed to be eaten right away, so delivery probably did the dish an injustice, but it was a floppy mushy mess. The crepe got steamed in the packaging so it was really mushy. Plus the crepe to filling ratio was off. I just didn't enjoy this dish at all.\n\nThe rest of the dishes were okay. Good and bad points to all. I guess my main complaint was flavor and spice. I liked the two vindaloos we had, but they both could have benefited from a little more spice. The biryani and tikka masala were both kind of bland and lacking in the extra punch of flavor to make them great!\n\nAll in all an okay meal. But I'm definitely going to have to try a dosa again. They can't actually be what I got for delivery last night. But thank you Masala Dosa for making me love Tandoori chicken again!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-26", "description": "The food was tasty and delivery was rather quick. However, I was disappointed to find out that my lamb with bell peppers dish had 5 tiny pieces of lamb and the rest was a huge load of onions in the sauce. I didn't see a single bell pepper, unless they were all blended in the sauce, then it was unclear from the description. Again, the flavor was good, but lackluster on the meat amount.", "author": "Tanya T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-05", "description": "This is a private message written to my by the owner:\n\"your message is as stupid as it can be. Everything we serve to a customer has a cost. In your case you asked for a chicken tikka masala sauce and the waiter charge you $6. I don't understand whats the big deal about it. you paid $6 not $6000. We don't even serve chicken tika masala sauce alone.If you are that cheap why you go to a restaurant. This is San Francisco everything is expensive here, this is not some cheap small town.\"", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "Really enjoyed our takeout meal here. We ordered naan, bhindi masala (okra), and lamb seekh kabob. The okra was SO GOOD! Not sticky at all and very fresh. It was a bit on the greasy side but easily remedied by pouring off the oil. The naan was fresh and perfectly textured. The kabobs were my favorite. Yes they were a bit pricey but you could see where the kabob skewers went through the formed kabobs, indicating authenticity in terms of cooking methods. The lamb tasted fresh and was well spiced. I wish it came with raw rather than cooked onions but it didn't deter from the experience. We'll definitely be back to try some of the South Indian specialties!", "author": "Veda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "Wow, wow, wow! And that doesn't begin to describe how much I enjoyed tonight's dinner delivery. I've eaten Indian food from LA to SF and I have to say hands down this has to be the best Tandoori Chicken I've ever had!!!! \n\nI ordered delivery from Grubhub and everything arrived well packed. I've eaten a lot of dried out Tandoori Chicken in my day but this chicken was moist and so flavorful. The rice was tasty and I even tried their tomato soup which was just absolutely divine with the naan bread. I'm definitely a fan\n\nThe delivery guy was very friendly too. Only problem I had was there were no utensils in the bag or condiments. Luckily I had some with me while traveling. I'll definitely have to visit again soon and so should you!", "author": "Melonie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "This was my first time ordering, but everything was delicious. I had the chicken tikka masala and the palak paneer with rice and regular naan. Delivery was fast and the driver was very nice. I will definitely order from here again!", "author": "Sheri B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-25", "description": "Ordered online from their website link in google search. Masala dosa refused to honor the order saying that I had to cancel with the online service and pay them directly. I now have to dispute the charge via my bank. Nightmare.", "author": "Kate B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "Clean bathrooms, cool window seating and fire place decor. Great service and enjoyed the cardamom rice pudding !\n\nFriend said that he had had everything he ordered before at different places; and slightly better then--Nothing to complain about it", "author": "Alexander T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-25", "description": "I ordered a Chicken Masala dosa for takeout.  Once I opened it, it smelled and tasted burnt.  This was an obvious candidate for a do-over!\n\nChicken was dry and the overall flavor was just meh.  The accompaniments barely improved the taste.  Sad mouth.  Meh.\n\nToo bad because I've been wanting to try this place for a while.\n\nNext time I'll just trek to Dosa in the Mission.", "author": "Timan G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-26", "description": "Worst food ever! My mom came to San francisco for first time and we planned to have lunch around and found out this restaurant on the way! We ordered panner tikka masala and malai kofta and both had same gravy colors! Both taste same just that paneer and kofta were an add on!\nOn complaining about it, we got a negative reply and the owner was not friendly at all! In fact he made a racist comment on customers. Owner should know the value of its customers! He also threatened to call cops and remove us out for just complaining about their food..\nTotally non deserving!\nI suggest all of them to never go this place! Even if this is the last restaurant on earth and you are dying! I will prefer dying!", "author": "Mohit G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-06", "description": "I so wanted to like Masala Dosa, and have it be our Sunset go-to for Indian. But everything we had last night was pretty bland, the chicken in the tikka masala wasn't melt in your mouth like at Golden Gate Indian Cuisine & Pizza out on Judah. \n\nThe garlic naan certainly needed more garlic, as others have noted. Will keep looking around for the PERFECT Indian spot in the hood....and most likely keep heading to Udupi Palace on Valencia for dosas par excellence and Golden Gate for proximity...", "author": "Gwynnie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-12", "description": "The food is below average. The Garlic Naan for some reason were doused in turmeric and chewy. The curries too hot and spicy when we had specifically requested for mild spice and less oil. The service was snail pace even though the restaurant had only two other guests. People who arrived way after us were served before. \n\nWe requested for a few slices of onion and lemon and were promptly told it'll be $3 extra ( it's complimentary in all other Indian restaurants in the city). Curiously enough though the server hustled back after sometime and places a plate of lemon/ onion with a wink (yes we tipped well). \n\nStrange sleepy restaurant. Don't go if you have other options.", "author": "Nutcrackin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "I ordered delivery and was surprised given some of the negative reviews here. \nDelivery was when they said it would be and the order was correct.\nSamosas -  crispy and not oily/tough\nChana Masala - very flavorful and just right amount of spice\nDal Soup - good and came piping hot\nNaan - a little heavy, but better than average for delivery\n\nOverall - solid 4 stars", "author": "Layne M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-26", "description": "3 hungry friends after a long walk in Golden Gate park found ourselves in this restaurant around 3:45 PM. We ordered lamb rogan josh, chicken tikka masala and vegetable biryani. Chicken tikka masala was pieces of chicken (not thoroughly cooked) floating in a very thin masala. Very flavorless. The lamb dish was not impressive at all. The biryani was the highlight of the orders and thank god the portion was enough for 3 of us. Service was inattentive. He forgot a spoon and put a tea spoon in the rice dish! (How am i supposed to serve rice with a teaspoon? Maybe a good tool to control your carb intake). We had to ask for water each time and even though there were 2 tables filled at the time- he got us a doggies bag (which was actually for the table next to us).", "author": "Megan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "This is my go-to spot for take-out Indian. The dishes are generously spiced and flavorful without feeling too heavy. Delivery has been prompt and friendly. I dined in one time, and the service was excellent, too! It's not super fancy, but it has been consistently good.", "author": "Patricia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "The customer service was very friendly. The food was very tasty especially nom veg items", "author": "Salman K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-21", "description": "How many places in San Francisco can you BYOB?! This is a rare find. You can bring in your own wine (no corkage) or beer. And there's a nice corner store down the street with a very good selection, very convenient. \n\nThe food is great! Everything we ordered was flavorful, but the dosas shouldn't be missed-savory crepes with delicious flavors-think a refined version of a Curry Up Now. Add to that, a classy ambience-tastefully decorated with nice touches. Menu items are reasonably priced. And it's away from the main stretch on ninth, a bit out of the way, so you don't have to fight for a table.", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-24", "description": "Extremely disappointed, given how high all the other reviews of this restaurant are. I ordered the chicken korma medium spicy and it tasted like thick flavorless gravy. The consistency and color were like pale orange baby food, and the chicken was tough. It was so unappetizing that my friend and I couldn't finish our meal. I'm not sure if something happened to the menu between when we ordered and when the rest of these reviews were written, or if we came on an off night, but this was truly awful. I never write yelp reviews, but this warranted it.", "author": "Maddy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "Great service and very clean and friendly! We ordered paneer tikka masala and a palak (spinach) dish with rice and naan: excellent food!", "author": "Allyson G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "The tandoori chicken was the best I've ever had. Big and juicy, so fresh! The service was great and the decor was nicely done, very cozy. \nI'm not usually a chai person but I thought there's was very nice. The samosas were stuffed full. Very generous portion.", "author": "Tara Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-23", "description": "I was never a big fan of Indian cuisine after experiencing Naan & Curry (on Irving St) and House of Curries (in Berkeley). I reluctantly came to Masala Dosa with my sister, believnig that I would never like Indian food. \n\nHere comes my epiphany! Masala Dosa was a gem! I was feeling adventurous, so I ordered a chai tea. It looked very creamy, and I added a pack of sugar. The chai was A-MAZING. It was light and smooth, with a hint of chai, but not too sweet and sugary -- not like those chai lattes you get from Starbucks. All chai teas should taste like the ones from Masala.\n\nMy sister was set on ordering the Chicken Tikka Masala and garlic naan, so I decided to be adventurous again and we ordered the Baigan Bharta -- fresh mesquite eggplant with ginger, garlic and spices. The eggplant went well with the naan, and I could taste the ginger and garlic, but it wasn't overwhelming either. The chicken in the tikka masala was so tender, a stark contrast from the tough chicken I had to chew and swallow from the chicken tikka masala at House of Curries. \n\nThough the portions looked small, three items was filling for three people. If you are eating with someone else, I recommend ordering 3 items if you are very hungry, and 2 items if you're not as hungry. The chai tea is a must!\n\nOverall, I was impressed with Masala, so this place will be my new favorite for now.", "author": "Joanne K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-20", "description": "I could probably make better dosas if i tried hard enough.\neverything we got was either overcooked or burnt.\nand the chunteys weren't even fresh.\nbig disappointment!", "author": "Namrata J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-02", "description": "Poor service, I had to request for water thrice until I got one.\nWe had 2 vegetarian entrees and it was just ok. Garlic Naan was not good enough.", "author": "Sahil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-28", "description": "Prices are little expensive for this restaurant, but understandable since Indian food is one of the most complex cuisines to make (trust me I've slaved away making it). Their Tikka masala, Gobi Aloo, and chana masala does not disappoint. The only flaw is that they make you order through an online service, not even accepting phone orders. This is of the most inconvenience, and should be remedied.", "author": "Lynn E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-29", "description": "Pros: Decor is nice.\n\nCons: Service, food, and atmosphere well below standard.  Food was overcooked, drastically underspiced and overpriced.  Service untrained and unresponsive. \n\nDespite the name 'Masala,' there was little spice, almost no salt, and conspicuously absent chilis in the flavoring of the dishes. Portion sizes very small, though with such poor-quality preparation, it was just as well.  We arrived hungry and left much of what we'd ordered on the table. \n\nThis seems to be a delivery service with a nearly-empty restaurant. There were intermittent long waits for food because the kitchen was doing a busy delivery business.\n\nWe joined a party in progress - two of us had arrived 30 minutes early, so they had ordered some appetizers - and then waited 15 minutes after arrival to get menus, and then waited about 20 more minutes for the 'waiter' to take our order.  'Waiter' because the young man waiting on us seemed completely inexperienced at serving, delivering dishes, answering questions, etc.  Once he arrived with a dish, he'd disappear into the back, or lounge at the hostess stand.\n\nOnion naan was dry to the point of being less edible than the cardboard that it resembled. I've never had bad naan in a restaurant, and this seemed stale, as if it had been sitting out overnight rather than cooked to order. It was essentially snapping-stale flatbread painted with turmeric, no oil, and apparently dried scallions.  Hungry as I was, I couldn't eat more than a few bites.\n\nThe 'Maysore' (not 'Mysore') dosa was drastically overcooked, with the outer 4\" of the wrapper the color of burnt toast.  Though I'd ordered it extra spicy, a two-year-old could have eaten the sparse potato filling without a whimper.\n\nBhindi (okra) curry was underseasoned, with sparse, stale spices and no fire whatsoever.The bhindi themselves were al dente, and dripping with ghee.\n\nSalmon curry was OK, though like everything, completely devoid of heat, but I doubt very much that at that price point it was really wild salmon, as listed on the menu. Tasted and looked like decent farmed salmon.\n\nSambar was so underspiced that it indeed seemed, as noted by another reviewer, to be more dhal than sambar.\n\nPickles and chutneys were fine. \n\nOur hapless waiter had to be nudged for any attention that we needed - more chai, menus, etc.  Between our arrival  and the appearance of our food, they ran out of chai and we had to remind him after 30 minutes that we still had not received the requested refill.", "author": "Shoshi D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-07", "description": "I go here for the Chicken Madras. It's mild but flavorful and the chicken is super tender.  Also tried the Lamb Vindaloo. The meat is tender, not stringy or fatty. I've dined in and had delivery. Service is good, staff is extremely attentive.", "author": "Kristen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-05", "description": "This turned out to be a surprisingly great place to bring toddler twin boys. We were having a late lunch and the only other people initially were families with young kids, too. We were in the window bench seat, and one twin wandered on it while the other played with the centerpiece, a tray of sand and zen rocks.  Every time a muni train went by on 9th Avenue, they shouted \"choo-choo\"  (they haven't quite mastered \"light rail\" yet)  The food too is great --  they gave us the kebab dosa by accident but it was delicious, as was the lamb tikka masala.  Pakora a bit greasy, but I suppose you know what you're getting into when you order it.  The goat cheese, cranberry and cinnamon naan seemed doughy to me but the boys loved it. Which is who ordered it for, anyway.\n\nKids or no kids, give it a try!", "author": "Vanessa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-30", "description": "Pros: fried idly was average and tasted like it should have. Their chutney (green coconut) was tasty and so was the red chutney. Sambhar was bearable (had all the salt that the cook missed in the dosas). Friendly service.\n\nCons: Mysore masala dosa - tasteless. Though crispy, this was perhaps the worst dosa I've ever had. Egg masala dosa, same deal - tasteless and at the bottom of my list. Ghee idly dipped in Sambhar had me almost puke. Pricey indeed.\n\nAny Dosa or Idly cannot have me complain, but this just beat that record.", "author": "Rishi P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Masala Dosa is consistently delicious.  Their Chicken Korma is creamy, flavorful. I love both their tomato and lentil soups, and can also recommend the Palak Paneer (spinach and cheese), garlic Nan (flatbread), and many other dishes.  I've never had a bad item from their wide menu.  Delivery is timely and gracious and the restaurant is friendly.  Absolutely yummy.", "author": "Betty K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-15", "description": "The initial smell when you come in is a smokey burnt something. Slightly off putting when it looks like people are avoiding this place. I ordered the masala dosa, chicken korma, basil garlic naan and garlic naan. \n\nThe service was very nice. We were one of the 2 couples that were eating lunch there. \n\nI liked that they had a variety of South Indian options and wanted to try them all, however my friend wasn't familiar with South Indian eats. Yelp said the chicken korma and garlic basil naan was the thing to order. I'd say the soda is the thing to order. There is just enough potato filling for the entire crepe. The sauces were good and sambur is really good. I'd come back for a dosa fix. Of course it's not as good as Pune's Vaishali, still good enough. \n\nIf you are looking for a great naan place, I wouldnt say this should be your destination.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "My husband and I have gone here several times when we're in San Francisco and absolutely love it!! Great service and very authentic Indian food. We really love the naan and lentil donuts!! Yum!!", "author": "MaryAnne P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-22", "description": "You know when you walk into a restaurant and all the people dining there are Indian...you have made a good call.\n\nDon't get me wrong Dosa on fillmore is my number one Indian restaurant...but Masala Dosa puts up a tough fight and is really good.\n\nI love their chicken vindaloo, masala dosa, basil garlic naan, and their curries. Yes portions are not large....but they are good and moderately priced. Also their rice is lovely: Flavorful and delicate.\n\nAll dishes are authentic and full of flavor...only downside was that the masala Dosa was served cold...it must have sat there before they served it.\n\nAmbiance is okay. Location is okay....parking off of 9th in the inner sunset is basically a travesty...but not impossible.\n\n3.5 stars for this nice little restaurant.", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "3.5 stars, rounding up. We had a pretty good meal here... The restaurant itself is small but nicely decorated. We had reservations and were seated after a few minutes wait, but it wasn't a busy day. We enjoyed the pumpkin dosa, idly, chicken korma, tandoori chicken, and the vegetable jalfrezi. The naan wasn't our favorite and truth be told we're still kinda feeling the meal a day later (it was quite heavy), but all-in-all a good experience. We'd go back if we were in the neighborhood.", "author": "Art C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-13", "description": "We were craving some good Indian food. Both my roommate and I have spent time in India and been to Dosa on Fillmore. Figured a 4 star review on Yelp was worth trying out. We ordered:\n- Chicken Tikka Masala\n- Jheenga Masala\n- Garlic naan\n- Poori\n- Onion and chili uthapam\n\nWe waited 1 hour 15 minutes for it to be delivered (live 1 mile away). The bill was $48 and the delivery guy gave me the smallest bag of food imaginable for the bill. I even asked him if they missed anything and he reassured me that everything was delivered. Of course, the Naan and Poori were missing once we opened the bag. We called them and was told to wait another hour for the naan to be delivered. Then we tasted the chicken tikka masala which tastes NOTHING like chicken tikka masala, more like a sweet barbecue sauce satay. Finally, the onion and chili uthapam turned out to be their Paneer and Pea uthapam.\n\nWe called again and they told us thats the way chicken tikka masala is supposed to taste, and that onion and chili uthapam is SUPPOSED to have paneer and pea and not onion and chili. \n\nNo discount on total bill, overall food quality D-, customer service F, one of the most frustrating experiences I have ever had.", "author": "Bowen J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-10", "description": "I have eaten at Masala Doaa twice and ordered take out once. My partner who lived in India for five years loved the food the first time, finding it authentic and well balanced. The second time, however, we received food with exactly the same sauce for a different menu item. Items were also too salty. \nWhen I ordered for delivery which is listed as a service online, the people on the phone were grumpy and said \"only if you really need it.\"\nThe atmosphere and decor is nice, and the food tastes good, but it's not really worth more than one visit.", "author": "Allxie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-12", "description": "Listen carefully. This is my first post EVER on yelp. it takes a lot for me to waste my time doing this. But I can't let this go.\n\nWorst indian food EVER. Period.", "author": "Leo D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-01", "description": "I found several strands of hair in their food! WHAT?!  So disgusting.  I really loved this place and the server and manager denied that it was from their kitchen staff.  WHAT again?!  it was very sad because I have been going to this place for many years, and to have that thrown into our faces was shocking!  \n\nOn another occasion, I was extremely disappointed in the delivery service (or lack thereof) the last time I was at Masala Dosa.  I tried to order delivery and the person stated that it was too far.  Now, I have ordered more than two dozen times and have had no issues with deliveries.  What changed? The server taking orders on the phone tried to blame the \"new\" guy for making the mistakes.  A person is not so new if they've been there for over 6 months.  What is going on with this restaurant?\n\nI am very sad to see the decline in service.  I did really enjoy this restaurant.  Hopefully, they errors will be corrected.  Bye bye, Masala Dosa.\n\nUntil then I will have to find a more clean and honest Indian restaurant.  \n\nAny suggestions???", "author": "Mac D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-12", "description": "A horrible horrible place. I would give it -ve stars if there was an option.\n\nWe were 2 Indians who came here and we were greeted fine. When we asked for straws, he gave just one.\nThen, they went on to ask", "author": "Maya A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-16", "description": "The place was empty except one other couple, and the more time we spent here--and we spent a long time--the more obvious the reason for the emptiness. First, incredbily poor service. We waited 30 min for a platter of fried calamari, and after asking, the guy came over and said they were still frozen. We said, there is no need to bring out the calamari, please bring the main dishes. 15 more minutes and one entree came out, 15 min later the unfrozen calamari, and 15 min after that the second entree came out. The taste was Americanized Indian food, to give it a better description than it deserves. If you are not particular about Indian food, take out seems the way to go, but with so many choices really why waste your money. And your time.", "author": "Chou K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "Very flavorful goat cheese naan & chicken tikka masala!! They are open late until 11 and the portions are just the right amount. This is a good place to have some hearty Indian cooking with plenty of flavor.", "author": "Jackie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-03", "description": "Place was pricey for what was delivered and the food was extremely salty. Everything was made with seemingly old ingredients that were over cooked. I wanted to like it, I love indian food but unfortunately would not order from them again.", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-11", "description": "I get my Indian fix here!  Food is great, interior is clean but the service can be hit or miss.\n\nI've had most of their dishes and it's all great.  There are a few dishes I repeat time and time over:  Chicken Tikka Masala, Lamb Vindaloo and Baigan Bharta.  I usually ask for the lamb vindaloo extra spicy!\n\nThey don't have their drink license so we usually walk up the block and pick up some beer to enjoy with our dinner.", "author": "Susan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-13", "description": "Got the lamb and chicken curry. Sauce was thin and runny, the curry flavor was pretty basic. Nothing earth shattering. Will not be ordering from here again.", "author": "Daisy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-18", "description": "Bumping up this restaurant with an extra star after my recent visit.\n\nWe decided to give this restaurant another try because we were craving South Indian food in the sunset. We tried the Masala Dosas again, and something just wasn't right. Authentic dosas (the kinds they serve elsewhere) are nearly fried in oil. Thats how they are crispy, golden brown and so tasty. The ones in this restaurant were really low on the grease. So the taste and texture was different. \n\nWe spoke to owners to figure it out the discrepancy. The owner said, that the restaurant was geared towards non-Indians who prefer the low-oil, low-spice version. So if you want the unhealthy real deal, this may not be a big hit.", "author": "Maneesh S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-27", "description": "This was for a take our order, Visiting from NY where things are just as expensive as SF, however, you can find a reasonably priced Indian joint all over Manhattan. This wasn't super overpriced but the food is mediocre at best. The Chicken tiki masala was mostly sauce, the shag was okay (Lamb, they said they had no beef...really) \nMy fault for ordering Poori bread out, I usually don't order Indian food out, the poori was flat...my fault. Some of the other dishes were okay, the rice was so-so, all in all it was fine, nobody got sick that's a plus. I think the rating is a 3-.", "author": "Bill F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-30", "description": "Tasteless food. Tiny portions. Expensive. At least the music isn't loud. Really, this is the worst Indian food either of us had ever had. Sad! We had wanted it to be a special night", "author": "Lang N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-23", "description": "Definitely have had ALOT better. Ordered Sunday delivery dinner, order took about an hour and was completely COLD. \n\nThe cold factor is not a big deal as we can easily heat things up. But the food was not good at all. We ordered the tandoori mix, saag paneer, chicken tiki masala, rice and a plain and garlic naan. The saag paneer was the only decent dish in the order. The tiki masala was incredibly salty. Everything else was so bland. Plain and garlic naan both tasted the same, flat. All the meats were dry and overcooked. \n\nTotal miss. Bf and I each had a plate of food and tossed the rest. Wasn't even worth saving it for leftovers. Will go back to Great India for the usual delivery order as their service is ridiculously fast and food very tasty", "author": "Pauline T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-17", "description": "Please. Do yourself a favor and go to Dosa or Udupi instead for your dosa needs.\n\nIt makes me angry this restaurant has such a high rating, considering the dosa is just so, so awful. I have fairly low standards when it comes to dosa, since I love it in any form, but this is just terrible. Don't do this to yourself.", "author": "Suchitha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "Super good food, very friendly staff, and an easy location to walk to from my friend's apartment.  \n\nI had the pakora, pappadums, tandoori chicken, and rice with a side of raita.  SO good.  My friend ordered the paratha, chicken korma, and rice.  We both really enjoyed our food, the serving sizes were perfect, leaving me plenty for leftovers for dinner tonight.\n\nAs someone who is allergic to gluten, I also really appreciated the labeling of specific dishes as gluten free.  I tend to gravitate towards Indian food anyway, since it's mostly gluten free, and Masala Dosa was definitely worth it.", "author": "Ann-Marie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-10", "description": "Service is nothing great. You have to ask for water (which actually is a good water-saving tactic considering most places will unnecessarily continue to refill your glass whether you'd like water or not). We had the dahi vada to start which was very filling but a bit lukewarm. Taste was decent. Masala dosa was a tad dry. However, the chutneys were pretty good (even if there's only two that come with it) and they're quite mild. Sambar was surprisingly good, but there's not too many ways you can fuck up sambar.\nThe atmosphere is strangely modern, dark and up-scale. \n\nOverall, get ready for minimalist decor along with minimalist service. Food is decent but overpriced for the quality.", "author": "Liz R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-26", "description": "We visited here before & were pretty impressed, but last night was honestly a let down. We both grew up in the UK so have had our fair share of Indian food & this was - frankly - average at best. They had no veg pakoras, and yet the table next to us had chicken pakora which suggests to me things are pre-made which is a real shame. The food needs more spice and flavor and the portions were fairly small, though it's relatively inexpensive & BYOB so we didn't feel stung financially. All in all though, we'll probably get our curry fix elsewhere in future.", "author": "Fi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "Bite size samosas are delicious!. Great service and the waiter was really kind and friendly.\nQuiet and nice atmosphere to enjoy a meal.", "author": "Al a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-02", "description": "Great hidden gem! You can byob and it's never packed. The service and food are both outstanding and the price and environment are casual. Great place for a group too! I have been several times and each I am more thrilled", "author": "B S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-28", "description": "This time around the food was just as good. Chicken tikka masala was on point. BUT the service was deplorable. We could not figure out who our waiter was. It was a different person each time. No one knew our order and every one seemed so confused as to what to do. They were running around with their heads cut off. Granted it was much busier this time around. But there is no excuse. \n\nDont get me wrong. Best Indian food in the neighborhood. But they need to get service in order.", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-27", "description": "Why do people still ask if I'm in the mood for Indian?? The answer is #yes.\n\nHaving missed all manner of reasonable times to show up late to NightLife -- Fancyface, myself and 3 of our friends  went in search of some chow. Enter Masala Dosa.\n\nUnbeknownst to our group, Masala Dosa is a BringYourOwnBuzz kind of establishment, so  our server referred us to the uber convenient liquor store directly across the street. I queried whether the two businesses were owned by the same people.. which in my book means way more beverage variety and double the profit :)\n\nUp to bat : 1 order Tandoori Prawns, 1 Chicken Biryani, 3 Garlic K'naan's, side order of rice and 3 orders of an old standby, the Chicken Tikka Masala. \n\nThe Chicken Tikka was expectedly good. A little spicier than I tend to enjoy, but cut with the rice from the Chicken Biryani (yum!) , it was quality.  1 order was enough for 2 mildly hungry people to enjoy. \n\nNext up : Have I become a garlic k'naan snob? Too soon to tell, but, Masala Dosa's version left a little something to be desired. The bread was good, but maybe up the garlic ?\n\nThe Tandoori prawns turned out to be the underdog champ of the meal. A flavorful marinade on a hot piece of seafood with the perfect crunch. I tend to err on the side of chicken when it comes to the tandoori style of Indian cuisine, so the prawns were a pleasant surprise. (S/O to Fancyface and his *refined* palate.)\n\nWe had the cardamom, pistachio & rosewater ice cream, but I found the latter ingredient to be a little over powering. Im not much into anything rose flavored, unless Rosé counts..!\n\nOur server was attentive at all the right moments and super helpful when deciding what to eat. I would definitely come back to Masala Dosa to try some of the other menu items I was eyeing :)", "author": "Shirene N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-19", "description": "The dish I took was really good (Lamb Tikka Masala). It was spicy but not too hot, the meat was very tender and the amount of food was more than enough.\nPrice is good too.\nBut I was very disappointed in the naans and just ended up not eating it (which is almost half my treat when going to an Indian restaurant).\nService was ok.", "author": "Virginie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Delicious food, friendly staff. Their tikka masala dishes are fantastic (I usually get the paneer tikka masala), the rice cooked to perfection, and samosas are top-notch. Late-hours are a bonus.", "author": "Julie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "My review is based on delivery only. This place has the best nan that I have ever tasted. Their other dishes do not disappoint. Excellent kormas and tandoori. However, it is VERY expensive (the reason for 4 instead of 5 stars). Delivery guys are also very sweet. For a treat it is excellent, but hard to justify a weekly order.", "author": "roz A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-16", "description": "Really a 4.5 I would say... Masala Dosa turned my husband into a lover of Indian food so I will forever be a fan because of that! \n\nWe have dined in (BYOB!) and have always had attentive service. We have also gotten take out a few times, I am a big fan of the chicken chana and the goat cheese naan and also like their tikka masala.  Will be back for sure!", "author": "Kim U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-08", "description": "Take-out review: okay more than often enough I want naan and tikka masala, I don't know why I crave it but I just do! After my fiasco with Naan-n-Curry (got food poisoning), I needed to find another place that would fulfill my craving and stumbled upon Masala Does - the reason why we did take out was because I am pretty sure there was a football game at the time and plus parking is a ---- at night here!\n\nChicken tikka masala was delicious and naan was also deliciious , I ended up cooking some rice at home cause I kept dipping and dipping and bam no more naan left for the chicken tikka masala! Everything stayed warm until I got home and was still pipping hot as I ate. I thought the portions looked small but it filled me up! I thought it was a bit spicy but tolerable but I am sure you can tell them to make it less spicy!\n\nP.S chicken was nice and tender! Satisfied!", "author": "Mona L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "Love this place!  Best Indian food I've had in town.  We go back again and again.  Cheap!  Delicious!  Go there.", "author": "Kathy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-16", "description": "My husband and I stopped by the place on our first evening in San Francisco. We ordered samosas for an appetizer - very flavorful and crispy. For entrees, we got chicken tikka masala and paneer tikka korma - both were very good. The sauces were not \"watered down\" as in many places and portions were very generous. Naan was the usual quality and nicely complemented the meal. It's a nice little restaurant and if we are ever in the Inner Sunset again we'll definitely visit.", "author": "Darya C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "This place is good. I'm surprised the reviews are only mediocre.  The ambiance is clean and nice, food comes out quickly, and it's actually delicious and fresh.  The only issue is that it's far away.\n\nI've had the Chicken Tikka Masala which is good-- a bit more on the tomato-y side which is better than the cream laden things I\"ve had elsewhere.  I get the lamb palek everytime.  It's super spinachy and the beef is usually moist, never dry.\n\nDelivery sorta sucks.  I've called for delivery and the time will vary depending on how busy they are (sometimes they won't even deliver).  However, they partner with a third party food delivery service on their site, so I go through that now... asynchronous and impersonal communication ftw. \n\nAlso, this is a BYOB.", "author": "Katie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "Your standard Indian restaurant but fancier inside. I ordered the masala dosa - the sambar was a small portion, dosa was yummy but smaller than most dosas I've eaten. Not sure if it was just the weekday I went but there was only one person taking orders and taking delivery orders on the phone so it was pulling a tooth and nail to ask each time for simple things like water, chutneys, onions - which is a normal accompaniment to all Indian dishes. The prices are standard to Indian restaurants, but higher than their neighbor 'Naan and Curry' which is far cheaper but then again doesn't offer South Indian dosas or uttapum. I would only come back if I craved a dosa. Clean ambiance.", "author": "A K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-15", "description": "If you are in the mood for Indian food, look no further!  To start my friend and I had the Chicken Tikka Marsala, it was fanfreakingtastic. The chicken was cooked perfectly which is a rare find (usually it's over cooked or really dry with the Indian spices) and it was so damn tasty, my taste buds were tingling and overjoyed. For our entree we had the chicken curry with potatoes (forgot the name) again, really really good. It does warn you on the menu that it's spicy (you are chili-pepper warned!) but we thought it would be a kind of medium spicy, NO. IT'S VERY SPICY. Trust in that little chili-pepper. But I didn't mind. The rice is average as well as their naan. \n\nThis place is like brand spanking new, so I understand that they haven't quite gotten their rhythm down, however, it just adds to the welcoming, friendly atmosphere. Service is very excellent, the owners are super nice and friendly, and they want to know that you are satisfied. Like the other yelper said, it's kind of cold inside, and a curtain to the kitchen would be nice :) Oh and it's reasonably priced for the amount of food you get! Always a good thing.\n\nIn conclusion, This place is great! I'll return soon for some naams! \n(see what I did there?)", "author": "Bee S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "This is my go-to Indian spot in the Sunset if I don't feel like eating buffet-style across the street at Curry Village. I'm not an Indian food expert, but I think the food is really good here! I always get either chicken Tikka Masala or Palak Paneer and a side of naan. I've tried the garlic, garlic basil, plain, and wheat naan. I liked all except the garlic basil had too much going on imo.  The service is pretty quick for dinner probably because they are expecting more people, but I recommend NOT coming here with large groups at lunch. They take forever because there is only one guy waiting tables AND cooking. We made a joke about it, but we realized it was true; he even discouraged us from ordering appetizers that day. I still recommend this place though, for the food! Just try to go during dinner time.", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-04", "description": "3.5 Stars.\n\nI almost always get chicken tikka masala at every Indian restaurant I go to. I like to compare it to the usual places I go.\n\nSo when I came here with a friend we weren't as hungry, so we shared a plate of chicken tikka masala and samosas. I must say, I love the rice with the sauce. I asked the waiter what was in it and he mentioned that it had a bit of butter. No wonder it had a \"melt-in-your-mouth\" taste. Mmm. The dish itself was okay, it was a bit different then what I'm used to.\n\nThe serving size of a dish is a bit small, but it is slightly more upscale than Naan N Curry. Nice place for a date, nice ambiance.", "author": "Mandy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "Went there again and tried their veggie biryani. It was really good. Time I upgraded my review", "author": "Milana R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-25", "description": "I walked in on Sunday around 7 p.m. to place an in-person takeout order. I patiently sat right by the counter and waited for at least 10 minutes for my ~$30 order (chicken tikka, chicken tikka masala, garlic naan, and rice). I got home and discovered that they had given me an entirely incorrect order. I didn't have the option to get back in my car to drive to the restaurant for the correct order (it was bedtime for my two kids) so I ended up throwing it out and had cereal for dinner. I'm baffled as to how I got the wrong order being that the guy who took my order was the guy who later handed me the bag, and I was sitting there the whole time right in front of him. So disappointing.", "author": "Siobhan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-17", "description": "I am a fan of hot food.   The food is delicious here.    BUT....I ordered out from home the other night.    Delivery took almost 2 hours to arrive!!!!     So be careful if you order after 9 pm.   The driver waited until all the final orders were in before he left the store....then my food was the last drop off.    The delivery guy said \"how are you?\"   I said  \"HUNGRY!!\"", "author": "phaedra g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-27", "description": "I was really excited to try this place when I saw it had finally opened. It actually looked promising -- really nice interior and lovely people working there. Not to mention after reading the many positive yelp reviews I had to try this place for myself.\n\nSadly, by the time I left, I must say I was disappointed with my experience. Here's what I tried off the menu:\n\nSamosas (2) $4 - The serving size for these was much smaller than other Indian restaurants I've been too. That was just my first impression. The texture was really good, but I found them to be quite bland.\n\nChana Masala ($8), Aloo Gobi ($9), and Garlic Naan ($3): The chana masala and aloo gobi was just average and I felt like it lacked seasoning. Considering all of the great Indian restaurants in San Francisco, there was nothing that wowed me about these dishes. However, the garlic naan was pretty darn tasty. That was the good news.", "author": "Sara K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-19", "description": "Masala Dosa restaurant is a great place to have Indian food... Specially I like the masala dosa and Vedu vade with chutney.. It's delicious, if you are vegetarian masala dosa is the best..\nThey have other food chicken, prawns curry are so fantastic.. I could recommend all the foods served here are delicious.. Restaurant is so clean,manager/owner Jaffar and his staff are friendly, so attentive.\nPresentation is fabulous....\nI would recommend any one to come here try for the first time and you will come over and over I am confident...\nI happened to travel by N Muni train to sunset and found this place on my way back to down town, I got off from train and went in side the restaurant, tried the food for the first time.. Since then every week Once or twice i am here for dinner....", "author": "Lasantha R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-30", "description": "I started a way to judge restaurants that is quite accurate. Go once and ask the server for their best food. If it is good,  go for the second time and order other stuff and if they keep up with the quality, it's worth.\nAt my first visit I  was reccomended chicken tikka masala and lamb with cashew nuts sauce: awesome! both dishes were good, great flavor, and the service was prompt. \nSecond visit after a week, I ordered samosa, Chicken Tandoori, Lamb Curry and Chicken Biriyani. Tandoori was watery (frozen chicken) and bland. No seasoning whatsoever. Lamb was full of fat and the meat was not tender. It was as a f they had cooked it and just put in the microwave before serving. Chicken biriyani was a complete joke. The  rice itself had decent flavor, but the meat was really bland and dry. Samosa was ok... obviously not fresh made but would not expect it.\nThe second visit was a complete disaster. The service is inconsistent and so is the food. \nIt would be a 4 star on the first visit and 1 star on the second one giving an average of 2.5 but since I can't put half stars I am going with 2 flat stars.", "author": "Ashish N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-30", "description": "Ordered the chicken vindaloo, garlic naan and samosa and REALLY liked it all. The vindaloo is exactly what I've been looking for in, and expecting of, Indian food: spicy, but really flavorful.   Samosa and naan were both tasty, as well. I just wish there was a bit more vindaloo for the price but I will be ordering from here again.\n\nRegarding the overall price to meal ratio, I should say with the 3 items I ordered, there was enough for about two meals. I had it for dinner two nights in a row. If I wasn't such a pig the first night, and split it more evenly, it would've just enough both nights to satisfy without being full/not stuffed..", "author": "Jay P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "This is my first time here.  Nice ambience.  I had Chicken Tikka Masala, Garlic Naan, and Ginger Lemon Tea.  The Chicken Tikka Masala, was good & above average. The Garlic Naan was a little too dry for my taste.  The Ginger Lemon Tea had a good strong flavor, and served nice & hot. This was an above average dining experience, and I would come here again.", "author": "Robin A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-15", "description": "I was thrown off to see that the menu was a mix of North and South Indian food. In hindsight, that should have been my warning sign as restaurants should stick to one or the other type of cooking. I had just assumed that with the name, they'd be a south Indian restaurant.\n\nYou'd think that the dish that the restaurant is named after would be prepared well, but apparently not the case here... dosas came out somewhat soggy and lacking much flavor. Sambar was very watery and didn't have much depth of flavor.\n\nWe split an order of tandoori chicken and garlic naan as well, and those were actually quite good (but at the same time, hard to screw those things up). I've had much better dosas pretty much anywhere else.\n\nService was extremely slow as there was only one guy running the whole front of the restaurant on a Sunday afternoon, with probably 15 customers there in total.\n\nInner Sunset is not a neighborhood I goto regularly, and if in the area, I likely wouldn't venture back to this restaurant. Though I would be curious to try their other \"standard\" Indian dishes like tandoori items, meat curries, etc. \n\nIf you're looking for dosas, don't waste your time here.\n\nPS - for whatever reason, cell phone reception sucks in the restaurant", "author": "Farhad M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-05", "description": "I live in the Sunset, and this place has become my go-to Indian restaurant in the area.\n\nIn my experience, Indian restaurants tend to overcook the lamb. My work around for this is usually to get chicken. Here, they do the lamb curries very, very well. This is where they stand out. They do a perfectly decent chicken tikka masala, but lots of places can do that.\n\nIn terms of service, it has generally been positive, both dining in and delivery. We did have an experience where a delivery order was lost. Mistakes do happen - we all make them. The owner or manager was very apologetic and went out of his way to make things right.\n\nI appreciate that he took the care to do that. It demonstrates concern and respect and a desire to do things well. Overall, it's a good omen all around.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "Came here for a ladies night and it was perfect for our group. Not only are they BYOB, they encourage it! They send you off to the corner store and you can come back with whatever wine or beer you want. So solid.\n\nFood was good, hot, fresh. Our server (or maybe the guy that brought the food to us) seemed a bit new so that was a little awkward. However, everyone else who worked there were awesome. They were super friendly and funny too; made us feel very comfortable and we will definitely return.", "author": "Salina Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-17", "description": "This place sent me the wrong order, when I called back the guy tried to talk me in to picking it up; if I had the time to pick it up I wouldn't have ordered it for delivery. 40 minutes later after I thought we'd set things straight, the delivery guy calls to try to convince me to get my order the next day and that it will take him 30 minutes to drive thru the park (it takes 10 for the record) so over two hours after my original order I'm still waiting,... so much for an easy dinner after a long day. The food is standard if not below, definitely not worth this charade....", "author": "Alx N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-29", "description": "I visited this restaurant with a few friends for lunch around noon- we were the ONLY customers in the restaurant. It's definitely a NICER restaurant with respect to decor and table-setting, clean, and unlike the AYCE places around the area. \n\nFood: Not too impressive. Like any noob with indian food, I order the chicken tikka masala with basmati rice and an order of naan. My friend told me it's a south indian restaurant so maybe that's where I went wrong by not ordering the dosa. \n\nchicken tikka masala with basmati rice ($9.00): Average- a bit TOO creamy for my liking and not enough spice (OR chicken). It also came in a tiny cup-bowl so definitely not enough for sharing. Or me. BUT thanks to my love for carbs, the naan filled me up. \n\nnaan ($2.00): I love carbs and this was my favorite part of this meal. That's probably not a good sign. But hey- at least i got some delicious carby-love in my belly.\n\nPros- I didn't leave smelling like I came from an indian restaurant so that's definitely a bonus. The service was nice, the place was clean and cute. Would I return? Probably not by choice or if I was desperate for indian food in the sunset. I would definitely order something different if I visit again.", "author": "Patricia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-26", "description": "Wow, they really turned this place around.  Don't know if the owners are new.  Prices are very reasonable.\n\nDECOR:\nThe place is clean, new, modern, & tastefully decorated.  White table cloth napkins on top of black table top with silverware and white dishes.\n\nSorry - my spelling of some of the food words might be slightly wrong\n\nFOOD:\nWhat we ordered:\n1) Garlic Naan - $3\n2) Aloo Naan (one with potatoes) $3\nboth of the naan breads are very good and they can go with dipping sauce or eaten by itself.\n3) Tandoori Section: Chicken Tiki Kabobb ~$10\nArrived in a sizzling hot plate with onion and a slice of lemon.  Taste great, but I was expecting some thing with a sauce so that I can dip my naan in, but taste good by itself too.\n4) Curry Section: Lamb Vindaloo (spicy) comes with basmati rice ~$11\nThis dish had sauce and it taste great with both the rice & naan.  The rice serving was generous, almost two rice bowls worth and was delicious.\n\nAll this for 2 people.  We had a lot of left over and it will be enough for another meal.\n\nDRINKS:\nDidn't see booze of any type on the menu, but I did notice that someone had a bottle of wine on their table.  So they must allow you to bring your own...don't know if their is any cost to that\n\nSERVICE:\nOur waiter guy was super friendly and polite.  Might be the owner or associated with the owner.  Water filled promptly.  He asked how we liked the food.  They always said things like, take your time.\n\nWould definitely come back to this place.  Another place we want to try is Naan & Curry down the street, but I like that this place is not a chain.", "author": "Sandra L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-05", "description": "Food is delicious! Favourite is the korma, either lamb or chicken. Mango lassi is also excellent. \n\nThe staff is very nice and helpful. \n\nNo alcohol served here, but they mentioned that you could bring your own in.", "author": "Ellyn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-15", "description": "my masala dosa was awesome but my dining partner puked up his chicken korma, he thought the chicken might have been undercooked. \n\nalso they don't have any really spicy chutneys or if they did they were hiding them.", "author": "Viv R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-01", "description": "The chicken korma had chicken so dry it could suck the moisture right out for tongue.  The bland samosas were worse than the frozen one at Trader Joe's. \n\nThe flies flitting about the middle of the restaurant and the dirty dishes displayed on the floor as a token of their popularity was perhaps a bit too much for my humble self. \n  \nDon't get me wrong,  I have eaten at many a roadside shacks in India,  but finding something similar in terms of disarray but not the same level of amazing deliciousness titillating my senses was disappointing. \n\nDefinitely not for anyone looking to have delicious Indian food in a clean hygienic environment", "author": "Vilay K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-20", "description": "Received a private message from someone with vested interest in the restaurant's success:\n\"I guess you need to get yours eyes checked and than you will be able to see the difference bet. the two dishes. If the prices are too high why did you order the food? you should have walked out the restaurant. You should google a cheap place to eat before leaving home. And also, waiter was not sarcastic, as a matter of fact you are so cheap that you are blameing it upon food and waiters. I will give you a negative star being a stupid person.\"", "author": "Piyush K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-13", "description": "Every time I come here the place is empty and I don't understand why.\n\nFood is great. Service is awesome. Our waiter is always really attentive and checks in with us (maybe he's bored because it's only us idk)\n\nChicken tikka masala- delicious. Tender marinated chicken mmmmmm\nVegetable samosa- YUM CRISPY FRIED GOODNESS\nGarlic naan- more garlic por favor", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-19", "description": "It was fine.  Decent food (but not the best).  Okay ambiance (but not particularly memorable).  I brought my mom here and her dish was too spicy, so she ordered another one, which ended up being kind of awkward with the server.  (Personally I didn't think any dishes were too spicy, but it would have been nice if the server had been more attentive and accomodating). \n\nWill I be back?  Probably.  The food was good enough and nothing was objectionable.  But it's not the first place I think of when recommending a restaurant.", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-25", "description": "I was surprised to see our usual Indian place replaced by Masala Dosa. We went in and were pleasantly surprised by the ambiance. \nThe food was great. I had a lamb tikka masala and the lamb was tender, and the sauce was delicious and creamy. \nThe naan was also very good.\nService was a little bit slow, but it was fine because we ordered a lot of food. The chai was alright.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-14", "description": "This place delivers like nobody's business. GrubHub always tells me I'll have to wait more than an hour. (\"You'll be eating delicious things soon!\" -- riight.) These guys usually get to my door in 30 minutes with a smile.\n\nI'm not a picky Indian food eater, so I don't know what makes it good. Some of their naan has arrived burnt. Don't ever get their side salad -- it's like four pieces of lettuce and one mini tomato. My favorite naans are the goat cheese, and the one with lamb cooked all the way through it. The curries have always been winners. The total bill tends to be more than I'd wish, but the large portions match what you pay for.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "It's hard to find a good indian food place in the US and well I love food here!!! This is my third time ordering/eating at this restaurant and I really like it. I life spicy food, and I like that you can specify how spicy you want food when ordering from  here.", "author": "Sarai F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "Superb food for the price of a casual evening.  The meat dishes are tender and you can tell that they actually slow-cooked the lamb or chicken in the curry.  You know how a lot of moderate-priced Indian food tastes like they just dumped some pre-cooked chicken into some sauce until it heated through?  Not here.  And the sauce doesn't separate into oily components.  They use good stuff here.\n\nI think this place is usually so empty because they don't serve alcohol - but you can bring your own.  I've just moved out of the neighborhood, but I always meant to write them a yelp post - because I thought they deserved to be busy.", "author": "Thunersee V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-27", "description": "Yum!!! Great food and nice service!! Great for large parties. Also BYOB is actually a nice benefit.", "author": "Devin K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-23", "description": "Do you like it when the wait staff ignores you and like to receive rude service? Then you should go to Masala Dosa. If you like to be treated like a human being then you should avoid this place.\n\nI ordered a take out order from them thru Eat 24. When I arrived to the restaurant, there were three wait staff behind the host counter. I approached them and they were all organizing receipts and looking down. I told one to the wait staff that I have a take out order. He asked \" What is your name?\"  Then he looked down at the receipts and continue to organize. The guy next to him asked \" What's your name?\" . He then continued to organize receipts again. The third guy asked \" What's your name?\" . I had to give my name 3 times before getting a response or reply. He finally went to go check out my order in the kitchen. I waited near the counter. \n\nA bag of food arrived at the counter. The wait staff mumbled something. I said \"Oh I'm sorry, I cannot hear you.\"  He mumbled again. The restaurant was quite noisy. I said \" oh I'm sorry, what was that again?\" He rolled his eyes and said \" give me a minute.\" I was taken a back, because my food was paid for already and he was really rude.\n\nI gave him a minute. I saw my friends there finishing up their meal. I walked there to say hello. I was waiting for them to approach me to tell me that my take out order was ready. 5 minutes passed.... 10 minutes passed. It wasn't until my friend noticed a green bag sitting there on a chair next to the exit for 10 mins. I asked the wait staff if this was my meal, they were still shuffling thru credit card slips. They said yes with out looking up. I asked if it was chicken tikki masala because the last time I had order take out from them they gave me lamb tikki masala and we did not eat it. It was $12 down the drain. They did not reply. I had to ask for them to check if it was chiken tikki masala. The manager huffed and grabbed the bag and took it to the back. Within  seconds he cam back pushed the container towards me and said yes. Then proceeds to look down and shuffle around credit cards receipts. \n\nWhat an awful way to treat a returning customer!!! Not even a sorry or a smile. This place has horrible customer service. Do not eat here if you want to be treated as a human being. Very rude!", "author": "Loun P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-11", "description": "I'm still waiting for my food to be delivered for 1 1/2 hours!  I called and they told me it will be here in 10 minutes.  10 minutes go by, no food.  Called them.  It will be there in 10 minutes.   HAlf an hour later it's still not here.  Liars!", "author": "Celeste F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-16", "description": "Great place!  Really friendly wait staff - didn't rush out out even though we were there really late.  Ambiance is great - hard to find many Indian places where you can bring a date - this is one of them.  Delicious Indian food - loved every bite!  Especially loved the curries (yes, including the Chicken Tikka Masala), the Masala Dosa, and the Mango Lassi.  And prices are definitely reasonable.", "author": "Greg B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-02", "description": "Welllll.........\n\n- I ordered the food, went to pick it up, brought it back to Blackthorn. There were no utensils or plates for any of the dishes.\n- I went BACK to get plates and utensils and told them twice that I needed 3 sets of flatware/plates because the food was for 3 people. I asked to make sure they put everything in the bag, and one of the servers assured me they did. Once I walked out, I immediately looked into the bag to only find: 2 plates, 1 spoon and 2 knives. Seriously..... 2 knives? How the hell are we supposed to eat this with knives? On the way back to blackthorn I stopped at a nearby chinese restaurant and asked them for utensils. Common Dosa.......SOO annoying.\n+ Servers were friendly, and smiling.\n\nConclusion: The food was good, to-go service was annoying, and for the price?? Id rather go to Noori Pakistani & Indian Cuisine on Irving.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-23", "description": "I have come here on multiple occasions, the most notorious has been when I had a huge craving for Indian food and trekked across town for this mouth watering meal. I love indian food and this place is mainly jump started my love for it. It has one of the best tikka masala in the city and I love their garlic naan. The price range is about the same with other Indian food places ($12-$15) but it's well worth it. I usually have to have left overs which equates to my lunch or dinner for the next day. The parking is difficult to find on this street so I would suggest parking on a nearby residence parking and walking. Plus once you're done you can go to Holy Gelato , which is across the street (See My Holy Gelato Review). It's a pretty good date night place :).", "author": "Desiree C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "I have ordered (either via dining in or take out) from many Indian restaurants in my neighborhood (Sunset/Richmond areas) within the last year, and Masala Dosa is an example of why sometimes it is best to stick with what you know is good. I stumbled upon this place a couple years ago and have always been impressed. The service is attentive, the food delicious and reasonably priced. I think I'm most obsessed with their naan, with so many delicious options, with the Kabuli naan being a favorite. Yesterday after my latest dining visit, I ordered their special of the day naan to go: cinnamon cranberry goat cheese, and eating it now for breakfast reminded me that I must Yelp them. Chicken tikka masala, lamb korma, their samosas, etc. etc... all delicious...I could go on and on. Seriously, try this place. I am obsessed with Indian food, and so far I haven't found a place I enjoy more.", "author": "Jen D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-04", "description": "I've definitely had better.\nMasala Dosa is extremely expensive, for what it is. I mean it is a bit cleaner and more nicely decorated than other Indian restaurants; however, the prices are not justified especially not in the portion sizes or the quality of the food. \nI ordered the chicken tikka masala and it did not come with rice or naan, which is pretty rare, at most Indian places it comes with one or the other, OR BOTH!\nThe chicken in my tikka masala was extremely hard and the flavor of the masala was not in the chicken at all. It was like they cooked (over cooked, rather) some chicken and then poured some tikka masala sauce over the chicken. \nProbably won't be back. If you're in the area and are craving some Indian food, I would check on Curry Village, the ambiance is not as nice, but the food is much better and its buffet so you can eat as much as you want :).", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-28", "description": "I wanted to love it.\n\nDosas: nothing special - boring and lacking spice.\n\nParking was VERY difficult. Bus/cab here!\n\nAlternative: no brainer here. DOSA on Fillmore. Pay a little more and get a MUCH better food experience.\n\nNOTICE: No alcohol... a cold beer can really enhance a spicy meal but you're not going to get it here. FYI!", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-20", "description": "When you have over a billion people in a country, you're gonna find at least half a billion ways to cook the food.  This is a given.  Resistance is futile.\n\nI wanted to love MD.  I wanted to make it my one-stop-shop for desi food, but alas it is not meant to be.\n\nAmbiance: lovely\nFood: good\nPrice: moderate\nService: sweet and often oddly timed\nOverall: 3.5 stars\n\nThe bad:\nIronically, the south indian food ('dosas' and 'uttappam'), in my opinion, does not make the cut for the following reasons:\n- the 'dosas' are not thin and crispy - they're rough in texture & (truly sorry to say this) cardboard-like\n- the 'sambar' accompanying the 'dosas' is catered to the neighbourhood's spice level (ie, not authentically spicy), and tastes more like 'daal' and less like 'sambar'\n- the 'uttappam' (cauliflower one we got in particular) seriously lacked spice/flavour and the cauliflower seemed very raw and overly crunchy, which means it really didn't fuse well with the 'uttappam' it was being cooked into\n\n(If you're looking for good South Indian food, I have to say that the 'dosas' and 'uttappam' at 'Dosa-Valencia' & Dosa-Fillmore truly excel in taste, authenticity, and presentation)\n\nThe ok:\n- samosas (I prefer the crispy/fillo-dough based ones they serve at 'Rotee')\n- rice that comes with the curry entree\n- chutneys that accompany the 'dosas' + 'uttappam'\n\nThe good:\n- the chicken tikka masala\n- the naan (albeit a little too crispy, still tasted good)\n- the tandoori sampler platter\n- the 'bhindi'/okra curry\n\nIn comparison to the rest of the indo/pakistani food in the area?\nIt's good.  Check it out and form your own opinion.  It's better than Naan'n'Curry (isn't everything?!), not as forgettable at Curry Village across the street, and not as over-priced as 'Masala' down the street. Plus, the owners who are frequently there seem super sweet and nice, so go show some community support and love.\n\nWill I be back?\nSure, but will most likely stick to the North Indian side of the menu.\n\nAgain, over a billion and counting ya'll...and I'm just one of them!", "author": "Anjali V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-16", "description": "Masala Dosa is the best Indian restaurant I have ever been to!\n\nI remember when Masala Dosa first popped up, I was curious because I love Indian food so much, but I still hadn't found one place in particular that really stood out. The first time I went I was very impressed at the atmosphere and decor of the restaurant. There's are large windows facing 9th Street that really opens up the restaurant. Its the best restaurant in the Inner Sunset for taking in the beauty and charm of the neighborhood. \n\nWhen I finally tasted the food I was absolutely blown away. Everything on the menu tastes like a home cooked meal by a gourmet chef. The flavors really come through and are not covered up with cream and fat like a lot of other places. At Masala Dosa everything tastes so fresh and light which is amazing because you don't feel guilty about eating even more than usual. And after talking to the employees there they definitely make it a point to be healthier than other places, staying away from the cop out appeal of pure fat. \n\nThere are so many scrumptious options to choose from from northern and southern India making Masala Dosa much more diverse than your average Indian restaurant. My favorites range from the Palak (Lamb or Mushroom), Chicken Tikka Masala, Chana Masala, Pakora and Fish Vindaloo. Even the breads are phenomenal. The Bhatura, Onion Naan and Goat Cheese Naan are out of this world. I always end up ordering half a dozen items (it helps that their prices are affordable) when I go or pick up from here and they always accommodate me with fast and friendly service.  Also the entire staff is very knowledgeable about the food  which always enhances the experience, learning the history and heritage of the dishes you're enjoying.", "author": "Dexter H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-04", "description": "I've been here probably four times. None have been exceptional, and the most recent was quite disappointing. The onion nan was clearly not fresh, and lacking in flavor. The chicken tikka masala was a huge disappointment. The chicken was clearly added to the sauce at the end, and had little flavor. The tikka masala sauce was good, but the chicken within it was very bland, and tasted a little stale. The saag paneer and samosas were good. Also, the waiter didn't ask us how spicy we like it (we like it flaming)...kind of basic service for an Indian restaurant. Other times I have been here the food has clearly been better, but never great. I live in Inner Sunset and so this place is convenient for me. Wouldn't go out of way to come here.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-26", "description": "This place is probably my favorite Indian place in the city.  It's close to my work so I've been here for both lunch and dinner.  Their Dosa's are huge and amazing and come with lots of different fillings.  Many gluten free options.  All the curries I've had are top notch.  If you haven't been here and you like Indian food, something is wrong with you.", "author": "Kristina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "I went here for a late lunch. I must preface this review by saying that I don't have that much experience with Indian food, as there aren't any Indian restaurants where I come from. But I really enjoyed it -- spices so potent that they stick with you for hours after the meal. I ordered the chicken vindaloo ($9), garlic naan ($3) and basmati rice. The food was so flavorful that despite the portions being rather small, I didn't finish it all. \n\nThe service was a little slow. I don't know if it's normal in Indian restaurants, but the rice came out after the dishes. It was a little hard to eat until the rice came out. That being said, the food was delicious, and it was an enjoyable experience overall.", "author": "Heidi H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-21", "description": "Another amercanized indian restaurant. Not worth going if u r really.looking for indian food.", "author": "Suraj N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-10", "description": "The meats are tender, and the vegetables are always perfectly prepared.  Nothing is ever over or under.  The prices are fair and they now offer delivery which is fantastic.  \n\nI know this review doesn't say too much but I will say that this eatery is on a perch looking down on all of the other subpar Indian food in the Sunset.  I really hope that they last.  Definitely give it a shot.", "author": "e m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-28", "description": "Awesome Indian food! Seriously. We have tons of Indian friends and they love it.\n\nI love the Curry and Ill eat here at least once a week.", "author": "Mario A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "My husband and I really like Masala Dosa. We get delivery from them often, and normally the same thing. We love the chicken korma! They has quick delivery and you can order straight from Yelp app.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-23", "description": "This tiny restaurant is the first treasure I've found while exploring SF! The Indian food is rather great. And I will be the first to admit that finding good south Indian food is harder then hard. Being Indian I've had my fair share of Indian food within the states and out side of the states, yes I do mean in India, but also other countries, and they have their menu down to a science. \n\nMy favorite to get is always Masala Dosa but Ive been enough times to taste their curries, naans, appetizers and Uthapam. Their whole menu is made with a perfect balance of spices, oils, and meats/veggies. The biggest treat for me is not seeing a giant film of oil floating on top of any of their curries or sambars. Why? Because it lets me know that the cooks are in tune to their food and not just tossing everything in without a care. Another major plus is that everything doesn't taste the same... Curries should not have the same tastes, nor should the Dosa's, Uthapam or any other item on the menu. When I get two curries that are true to their taste I know Ive found an Indian restaurant I'll be addicted to. \n\nBesides the food though, the service is really friendly. Everytime I go in there is always someone ready to seat me and take my order. And when I go with friends who arent so Indian food saavy, the waiters take their time to explain what each dish is and what it will pair well with. On another note the area is great for a bit of mellow night life. BUT parking is impossible, dont bother driving, take the N train in or one of the many MUNI buses that stop through there. \n\nP.S. Typing this made me hungry ... I think I'll put in an order for pick up now. :P", "author": "Saumita P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-17", "description": "Ironically, we didn't try any of the dosas, but we had a fantastic meal.\n\nChicken palak - very tender chicken and spinach, not greasy, and just the right amount of spice\nChicken biryani - so much flavor and spices packed into this dish full of tender chicken, it can make a great meal on its own\nLamb filled naan - delicious\nGoat cheese, bell peppers, onion filled naan - very mild goat cheese, a little boring after the first few bites\nPeas and paneer uthapam - probably my least favorite because it was a tad bland, but not bad\n\nThe ambience is very minimalistic, modern, and calming, and the service is great (constant water refills, friendly wait staff, food came all at once and very quickly.)  This would make a very cute date restaurant, but also good for smaller family meals--probably not a great place to bring young children for dinner.\n\nI'm definitely coming back to try the other biryanis.", "author": "Audacity L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-31", "description": "The food here is fine--not amazing, not terrible, well-suited to a lazy weeknight when you don't want to make dinner. But, the delivery time has gotten ridiculous. It used to take about 30 minutes, but the last few times I ordered, it took over an hour. Last night, it was over an hour and a half. The food was cold and the nan was stale. I won't be ordering from them again.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-13", "description": "Worst food I ever had in any Indian restaurant. I think they have only 2-3 types on gravies / sauces - red sauce, green sauce and some other. They use same type of gravy with many dishes. I had ordered Malai Kofta (not on the menu, but it was daily special) and Paneer Tikka Masla. Both Malai Kofta and Paneer Tikka Masala came  with same type of gravy. When we asked server about it, he said, \"yes, the sauce is always same\". The gravy wasn't tasty as well. It was salty and had no other flavors. I think any preserved or frozen Indian food is better than Masala Dosa food.", "author": "Shan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "This is my new favorite Indian place to order from. I used to be a loyal fan of Tandoori on Haight as they had decent food and were close to me, but after they closed the place I was in a constant search for a replacement. Then I tried Masala Dosa. What a pleasant surprise. Very generous portions, loads of meat, very spicy as it should be. Naan is home made, huge and very delicious, probably the best one I've tried in San Francisco so far. So far we've tried the classic chicken curry and butter chicken - both were outstanding. I order food this place at least once every couple of week.s", "author": "Igor P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "Nice little place tucked between Irving and Judah. I ordered the spinach and onion pakora- very good fresh and crispy. Really good mint and tamarind condiments. The mint is a little creamier than I've had before, but that's a good thing!\n\nI ordered the masala dosa. The dosa was nice and crispy, and has that wonderful bean flour taste I love. The filling was nicely spiced with potatoes and peas. Just right. The sambar was very good and flavorful, perfect on a chilly day. I didn't care for the condiments that accompanied the dosa, but everything else was delicious.\n\nThe floor felt rather sticky though, the only minus. It is rather dark inside as well. It was daytime and no lights were on. I know we're all trying to save a buck here or there, but I should not be squinting to see my meal.", "author": "Kris K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-12", "description": "LUNCH\n\nI don't know enough about Indian food to go wildly selecting different things on the menu. The one thing I'm sure of is that I really enjoy chicken tikka masala. If I order this dish and some nan with satisfaction, you can expect my repeated patronage. \n\nI ordered the chicken tikka masala and was surprised to find a slightly think non-uniform consistency, sort of like the oils had separated from the curry sauce already. The chicken pieces were nice and generous in size and portions. The curry was served with basmati rice but I went ahead and ordered a garlic nan for $3 anyway. I enjoyed the nan but couldn't get over how I didn't fully enjoy dipping it in the curry. \n\nIf someone told me they really wanted to eat here, then I think I'd give them another try. But unprompted, I might  have to pass. \n\nReading other reviews, I think it's pretty cool of them to let you bring your own wine without corkage fees.", "author": "Dennis L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "The novratan korma is legit my favorite in the world, and the samosas are amazing. This place has great delivery. My husband and I get delivery from here way more than I'd like to admit! It's super good and always comes piping hot. I totally recommend this place!", "author": "Erin D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-30", "description": "Terrible, Dont go here. Its a disgrace that a place that serves such awful dosas is called \"Masala Dosa\".\n\nWe ordered 4 different kinds of masala dosa.\nFirst of all the Dosa dint look good, half baked, the batter wasnt right and it wasnt salted . The masala was burnt and flavorless. 2 of the 4 dosa orders arrived after 30 minutes . Then the waiter told us the dosa griddle had some problem!! after servng the terrible dosas!!. We then ended up ordering idlis, and the sambar had undercooked lentils and tasted awful! \n\n\nTha pakoras were alright but 2 of the 4 were half cooked on the inside.\n\n\nThe only good thing was the mango lassi which was very yummy.\n\nI had food from Dosa Bawarchi near San Jose the day before, it was wonderful and wanted to try this place in the city on our trip. Such a big mistake!!! \n\nAVOID!!", "author": "Ayeswarya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-11", "description": "I often find my gluten-free friendly spots with a simple yelp search. Though, sometimes it can be hard to tell how good the options will be. I found a review for Masala Dosa that referred to a gluten-free menu, so I thought there must be something good there for me. Sure enough, the dosa section of the menu noted that all dosas were gluten free except for one kind. Fun! I had options!\n\nOften times in restaurants where the owners and waitstaff do not speak English fluently, I have a hard time inquiring about whether the food is really gluten-free. With a lack of public knowledge of gluten-free issues, plus a language barrier, it can be hard to get the reassurance I need. I asked the waiter, a very nice guy with an accent, about whether any meats were prepared with flour, or if there was any flour added to the sauce. He said no, but he seemed to understand the importance of the questions, and said he would double check with the chef. He came back confirming that all the curries were gluten-free - no flour on the meat or in the sauce. Since I didn't get to talk to the chef, I have no idea if they really \"got it.\" I can only trust that the waiter conveyed the importance.\n\nMy friend and I shared a masala dosa with chutney and a spinach and chicken curry. While not the most amazing Indian food I've ever had, they were both very tasty! The flavors were fragrant and rich and the quality of the food was quite good.\n\nAs I don't seem to be having a gluten reaction, I think the food was free of gluten contamination. I will definitely be going back to my new gluten-free Indian hot spot!\n\nI can't eat dairy either, though I think it's easy to avoid the creme sauces and the paneer. I wonder about which items include butter that is not stated in the description. I'll have to ask about that next time.", "author": "Addie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-18", "description": "I've tried the Matter paneer (with basmati rice), which was decent but lacked any powerful spices I expected. The food is definitely on the heavier side and larger than most Indian restaurant portions.\n\nI've also had the Paneer Pea Uthappam which I highly recommend if your starved. Dipped in the sambar or chutneys, this Uthappam was great!\n\nOverall, Masala Doas has decent Indian food, but the service is a little slow.\n\n# vegetarian review", "author": "Eric H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "I wanted to share our experience at the restaurant \"Masala Dosa.\" We used to go to this restaurant years ago, when it was named, \"Masala.\" Unfortunately, we thought that they were gone, when in fact, they moved a block away to 9th Avenue in the Sunset district with a different name, not knowing that it was the restaurant we loved. We had wonderful Chicken Curry and Palak Paneer with rice, mango chutney, mango lasses, garlic bread, raita and the food and drink were wonderful, as was the atmosphere and the wait staff. So, we wil be going there again soon. Just had to let others know what a great experience we had!", "author": "Donna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-14", "description": "Just moved to Inner Sunset and tried this place out because of their awareness of gluten-free and making sure it's easy to figure out what you can eat there. \n\nSo far, everything I've had has been great (and I've tried a lot of Indian places in SF). The chicken korma is really well done. I've had the Uthappam as well and it was great. I haven't had their dosa yet, but judging by everything else, I'm sure it's quite good.\n\nI would recommend this place and plan on taking friends here.", "author": "Marc C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "Came in here for a snack. All I can say is yum. Paper Masala dosa.  Can only give it 4* bc I've only been here once on a random Saturday afternoon. There were 2 other tables finishing food and we ordered 1 item that  still took a bit to get out to us. But the dish was super tasty.", "author": "Sharra C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-18", "description": "I came here with a fairly large group of friends (since it is a somewhat small restaurant), and I'm not typically a fan of Indian food, but the food here was good.  We tried a couple chicken and lamb dishes, and I left satisfied.  The only downfall, for me, was the serving sizes were pretty small considering the prices.\nBut overall, if you're in the area, I definitely say this is a place to try at least once  =)", "author": "Angelica Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-24", "description": "The food was good but not rave-worthy, and the service was inexcusably terrible.\n\nWhile my party of 5 was there for lunch, there was only one other table. They left, and a party of 2 came in. They were done with their meal before we got our entrees! There were only 2 sets of silverware on our table, and our server walked away as we asked him for 3 more sets. Since he was pretty absent (despite only having to wait on 2 tables in the entire restaurant), we resorted to taking silverware and napkins from one of the many other empty tables. Because of the slow service, we were pressed for time and tried to flag him down for the check. He was too busy laying out lots of extra napkins and silverware (again, we were one of 2 groups in the whole restaurant and it was nearing the end of lunch hour... instead of focusing on his actual customers who didn't get napkins & silverware, he was preparing a bunch of unnecessary ones!).\n\nI normally don't care if service is not great as long as the food is delicious. But this experience was pretty frustrating, especially since we were paying a good amount of money and appeared to be 60% of their lunch business for the day.\n\nFood:\n- The dosas are HUGE.\n- The samosas are good, but nothing special.\n- The pakora appetizers were really interesting - not samosa-like as we were expecting, but veggie fritters. They were a tad spicy.\n- The vindaloo appetizer was just chunks of meat over a basic salad (lettuce, tomatoes, cucumber)... not what we were expecting.\n- The mango lassi was very watery and tasted fake-sweet.\n- The garlic naan was delicious, but smaller than I was expecting (especially considering the size of the dosas).\n\nIf the service had been decent, I would have given this place 3.5 stars. But my experience left me not very eager to come back.", "author": "Amy X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "We were happy with Masala Dosa.  The garlic naan was perfect, the portions were generous and the wait staff helpful.  My tikki masala was yummy (the chicken was very tender) and my bf's dish (can't remember the name) was great.  \n\nThey do NOT charge a corkage fee (they don't serve alcohol) so we enjoyed our food with a wine we brought.", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-06", "description": "Very nice Indian food, especially for the Inner Sunset, where previously Naan & Curry has been the only option.  Masala Dosa's main food is southern Indian, including excellent dosas, puri, bathura, etc.  \n\nBeen here twice.  Tonight we had the \"shrimp dosa\" which was a masala dosa with tandoori shrimp added to the potato and spice mixture, as well as a goat-cheese-stuffed naan, both dishes showing they can be creative while still being Indian.  Everything was well and extravagantly seasoned despite not being too spicy (in deference to my wife).  They also have Northern Indian standards on the menu and do them well.\n\nThe only thing they don't have down is the service, which is a bit uncoordinated.  However: $20/person, and we were stuffed.\n\nMasala Dosa doesn't have an alcohol license, but they allow you to bring your own beer or wine.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-01", "description": "Beautiful decor - a nice cozy date spot.\n\nNice waitstaff, although I could use a more frequent water refill!  *fans mouth*\n\nBut how is the food, you ask?  Fan-freaking-tastic.  While I didn't care for the dosa (it's not my preference), the curries are really delicious.  The chicken korma is, hands down, the best I have ever had.  The chicken mahkni was also amazing.  The +1 and I are slowly making our way through the curry menu, and loving every bite of it.  From the appetizer menu, I can attest that the pakora is also quite tasty.\n\nAlso, it's inexpensive.  $9 gets you a great portion of curry, with plenty of meat - and rice is included!  That's cheaper than when we order delivery from India Clay Oven.  \n\nI got a new love, and its name is Masala Dosa.  Welcome to the neighborhood!", "author": "Jennie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "The chicken korma and the tikka masala is good.  The garlic naan and the goat cheese naan is awesome.", "author": "Will L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-22", "description": "3.5 stars really.\n\nI waver.  I come here a lot and the servers are SO warm and welcoming.  The place is BYOB which creates a fun, down-to earth atmosphere.  The decor is very cozy and the food is delicious\n\nI would recommend trying the cranberry, goat cheese, cinnamon naan.  such a unique treat. The Lamb Kofta is another favorite.  The Chicken Tikka Masala is classic. \n\nMy only gripe is the price you pay for what you get.  The curries are small but rich so I usually leave full BUT each dish comes with only a few chunks of meat, so it's mostly the delicious fatty sauce that ends up filling you up.  If you try to split dishes among friends, each person gets literally one chunk of meat.  Also the palak paneer is on the blander side of the Indian places I've been to.  Each thing, naan, rice, chutney, curry, veggies, you must order separately so the bill ends up being way more than I expect each time.", "author": "Meg M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-15", "description": "We go to this restaurant frequently and my favourite dishes are tikka masala and biryani but we found whatever dish we order, they come out good. I have been to many indian restaurants but this one is better and I recommend this to my friends all the time", "author": "Keerti Sekhar S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-15", "description": "Every visit to Masala Dosa has been perfect. Fantastic food, good service, and lovely atmosphere. The dosas are tasty and very large. There's a wide selection of naans and breads. My favorite dish by far is the unbeatable Novratan Korma. Masala Dosa is a quiet place -- a well-kept secret of the Inner Sunset.", "author": "C. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-08", "description": "First and foremost, the food here is amazing. The tikka masala have the depth of flavor that you would hope everywhere would infuse. \n\nSecondly, the staff is great. Masheed(sp?), one of the cooks, took his time to talk to the guests , myself included, to tell us about other off-the-menu items that he thought were exceptional. I will definitely try them. \n\nLastly, the decor is gorgeous. The windows seats are my favorite.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-18", "description": "3.5 stars\n\nThis used to be the spot for Tasty Curry. New re-model and design look great! Not sure if its the same owners or new ones. But definitely an updated modern look with warm colors are easy on the eyes. \n\nWe came in for a weekday dinner.  Only one other couple was in the restaurant. I really liked the remodel (new owners too?). Very modern and clean. We tried to samosa, chicken tikka masala, lamb birayana and garlic naan.  We liked all except the lamb birayana. Definitely like the mint spicy sauce that they bring to your table! yum! \n\nService was a little slow considering there were only 2 parties in the restaurant while we were dining.", "author": "Julie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-07", "description": "The food here was disappointing. The portions were so small. The curries come in a little bowl and don't come with any rice or naan, so you have to order your own naan. The naans were delicious; I would recommend the garlic and cilantro naans. You get 4 triangles of naan which are more than enough for one person. \n\nI had the tandoori chicken which was flavorful, but I think paying $10 for two chicken thighs is a little overpriced. My chicken curry had no spicy kick to it and tasted pretty plain. The chicken curry that came with vegetables in it was even less flavorful probably due to the vegetables watering the curry down.", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-18", "description": "It was ok. The dosas & the uthappam were on the soggy versus crispy side. The maysore dosa wasn't that spicy. And the sambar was very watery. I wouldn't come back.", "author": "Khozema S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-05", "description": "Two things I feel people have not mentioned on their review for Masala Dosa, \n\n1. they do not serve alcohol, but you can bring your own bottle of wine and there is no corkage fee! \n2. they serve some gluten free food! \n\nThe food was very good, great price, and very friendly staff! For sure a place I will be going to again!", "author": "T C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-23", "description": "Having some northern indian food here in the states was a reminder from my trip in asia.\n\nFirst off, the people there are super kind, but since we had gone when they first started, their wait staff was still a litttttle under trained. \n\nThe food there is pretty good. Not the best, but it was good. I would definitely go back to get more. \n\nThe place is kind of set up weird. There's like an area that is a step up from the rest of the restaurant. They also have this weird peach colored cloth too. It's just a little weird.", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "Best for Indian food in the Sunset. Their Okra curry is good.", "author": "Ravi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "i tried samosa and myosre masala dosa here ,its very good and my friend ate lamb biryani , first we thought its just north indian style biryani but its same like hyderAbadi dum biryani ,nice service by front guy ,i will definitely recommend to my friends", "author": "Dhruva R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-06", "description": "In their defense, they said it was a busy night.  However, if ordering delivery from them on a busy night means it takes an hour and a half for rubbery samosas and watery paneer tikka masala to finally make it to my door, I'd rather not take the risk.", "author": "Lynne H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-14", "description": "2.5 Stars\n\nThe service was terrible, the food was decent but not worth the price.\n\nI ordered samosas for the table before I even sat down since we were hungry and I knew they'd most likely be good. These took forever to come out.\n\nYou get ONE piece of naan for $3+. The waiter actually laughed at me when I asked for an order of naan for the table (of three). Sorry, you don't laugh at your customers. Rude.\n\nThe Bhindi Masala (okra etc) I ordered came with stems still in it. I mean, I like fiber, but I also like to be able to chew and swallow it.\n\nThe chicken tikka masala and chicken Korma were plenty good.\n\nAll of the portions are medium-small. Not quite small, but definitely enough for one person. We split three dishes family-style.\n\nNow let's get back to the service..\nWhen we arrived there (2pm on a Tuesday) there was only one other couple seated inside. This is fine to me, it was after the lunch rush in the Inner Sunset. I don't expect it to be packed.\nShortly after we got there, the other table left.\nThis is when the waiter just plain ignored us. He was sitting in the front playing with his phone.\n\nWe had to get his attention when we needed water refills, and even when we needed the check.\n\nAfter he brought the check, without asking if we were finished with our food, he started clearing the table. My friend was clearly not finished, accentuated by the fact that he yanked the last piece of Naan off the plate as the waiter was picking it up. Then the waiter took the bowl of curry sauce right as my friend was about to dip the naan into it.\n\nWe were all shocked.\nI do not think I will ever go back.\n\nEdit:\nI forgot to mention that the waiter also \"forgot\" to add into the total the charge for 2-garlic naans, so he threw it in the \"tax\" field on the paper slip. He didn't even CHARGE us tax. \nThis waiter apparently had an issue with speaking to people, as well. Everything he said came out very quiet and mumbled. His English was perfectly fine, if only I could hear him when he was answering my questions about the bill.\n\n$38 EVEN for 3 dishes, 1 appetizer, 2 orders of naan. Oh wait, no it wasn't because the final total didn't include the additional $3.00 for that second order of naan. $41 even for all that.\nI'm just glad he was able to split the bill evenly.", "author": "Ash K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-26", "description": "The food was ok, but the portion sizes were half of what they should have been and twice as expensive. We also had to pay for rice, which seems a little silly when you order dishes that are supposed to be served with rice. The service was also terrible. We were the only table, but we had to wait for twenty minutes for water. My friend found a bone in her lamb, and they brought our bread nearly fifteen minutes after our entrees. I will never go back.", "author": "Kendall H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-29", "description": "Indian and married to a south Indian so know a bit about Dosas and such :)\n\nBland food. Sambar did not have salt. Dosas lacked taste. The chutneys were bland. My fish masala wasn't anything to write home about. Overall, seems like a mom-pop amateurish production.", "author": "TwinPeaker J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-16", "description": "Went here on a Thursday night around 9pm with my friend We made reservations although getting a seat was no problem. There were only a few other groups of people inside eating. Decor is nice, very modern, simple and CLEAN. \n\nOur waiter was very nice, helpful and not pushy at all. We both ordered curry dishes the Chicken Makhni and the Chicken Tikka Masala. we also added a side of garlic naan bread. Our waiter asked how spicy each of us wanted our entrees which I thought was nice.\n\nFood came out quickly and was all delicious. Serving sizes where large for the prices they charge. We are definitely coming back. The only negative thing I can say is that it was too warm and stuffy inside the restaurant. The windows were fogging.", "author": "Jimmy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-03", "description": "There are so many Indian restaurants in the area, but this at the top of the list and  will definitely be back.\nFood was fresh and yummy.  Service was extremely nice and the restaurant interior was clean and modern.\nWe ordered the matter paneer, chicken tikka masala, plain naan, masala dosa and mango lassi and I enjoyed every dish!", "author": "A R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "I had a really good meal here. The dosa was yummy.  The lamb was tender.  The waiters were very nice and attentive. Also it is BYOB without a corkage fee.  Great neighborhood restaurant.", "author": "Courtney C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-08", "description": "This is my new favorite Indian place!!! Yea-uh!\n\nI've come here twice but wanted to go back immediately after the first night. Each time I've come, it's been empty but fills up as it gets later. You know what they say, the night is young, but I am not.\n\nDecor: Dim. You can either take this as romantic or just dark. I like that the tables are dark wood and the stuff on it is simple and minimal.\n\nService: They seem to have one main guy who knows a lot and at most 2 other waiters. Since I go when the night is young, they have nothing else to do but wait on me.\n\nFood: \n- I CRAVED naan the first time so I had both the regular and garlic naan. Garlic lovers should definitely get the garlic naan. It is so powerful vampires would die. For me, I prefer the regular naan to dip with the curries. Mmmm naan.\n\n-Samosas: 2 big ones for each order. I like that there's a kick in it but it's not overly spicy. \n\n- I asked the main dude what he prefers and he went through the WHOLE menu section by section saying what he liked in each. It almost sounded like everything but I don't blame him b/c it's all pretty good. Overall, I love the paneer tikka masala. It's cheese only but they make it themselves, which is pretty impressive! There's a slightly sweet taste to it as well. I've also tried one of their chicken curries and a spinach one (which isn't as bad as you'd think), but I always go back to the cheese one. Cheeeeeeeeeeeese. All curries come with their special rice. The secret to their rice (besides the spices)? Butter. Thanks Paula Deen!\n\nPrice: Definitely affordable! For 1 order of naan, 1 order of samosas, and 2 curries, the total cost was about $26. Nom nom.\n\nOverall, I'd give it 5 stars but I know they're still working out some kinks in a new restaurant business. Thank you Masala Dosa. I will be back.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-11", "description": "Yes yes! As an Indian who knows about these things ( or at least am expected to) I give this place 5 stars. Let me explain: 1. It is unique because they offer south Indian food like dosas and north Indian like chicken tikka masala. 2. While there are many Indian restaurants in the sunset, none are south Indian. 3. Also unlike the other Indian restaurants in the neighborhood this one has a nice calm modern atmosphere-- does not make you feel like you are dining at a roadside truck stop in New Delhi. 4. The prices are so so reasonable compared to  trendy (and awesome) Dosa in the Mission. And 5. The food is very very good! \n\nPlease note: they don't serve alcohol but I saw some other tables had brought their own. \n\nAlso please note:The staff is new and the place is figuring out it's rhythm -- we had to wait a while for our chai refill and then had to just forget about it  because our baby was getting antsy. Also the guy forgot to give me my credit card back and then remembered as we were leaving.", "author": "SoSo O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-07", "description": "When you walk in, you'll notice the ethnic smell is really strong but after you sit there for ten minutes, you won't notice it anymore.\n\nMasala Dosa: I don't remember what was in this but it was tasty. I'd recommend it.\nGarlic Naan: They really overdid it on the garlic. It was so garlicky that it was spicy almost and all you could taste, was the garlic. This was the only thing my friend and I did not finish.\nChicken Tikka Masala: I thought the sauce was flavorful and the chicken was juicy. It wasn't the best food I've ever tasted but it was definitely good. My friend however noted that she's had better elsewhere. \nBasmati Rice: Is basmati rice supposed to have a crunchy texture? I wasn't sure but it felt like the rice was undercooked.\n\nPrice: My friend and I shared and it was only about $10 between the two of us. The portions were just enough to fill the both of us. I think the portions would be a little small for men or any bigger eaters.\nParking: IT LITERALLY TOOK ME 40 MINUTES on a WEDNESDAY NIGHT at 8:30PM to find parking. I wasn't aware this restaurant was in this area but if I had known, I would have never picked it. Once I got there, I figured it wouldn't be that bad seeing as it was past the busy time and a Wednesday night but boy was I wrong. Unless you're carpooling, driving a taxi or taking the bus, I wouldn't ever recommend anyone to come to eat in this area. They really need to figure something out.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-19", "description": "Mmm, this is such a good find. It feels like this is somewhat of a secret hideaway, because it's always pretty empty when I find myself here. But don't let that fool you--Masala Dosa serves up some great South Asian cuisine.\n\nAdmittedly, I've only tried two things here, mainly because of two reasons: I fear change. And I love paneer. \n\nI get the paneer tikka masala and garlic naan with a side of rice. The naan is incredibly fresh, and the garlic is roasted just right. Now, I really love garlic, so my idea of \"just right\" might be \"Hell no\" to someone else. Keep that in mind. Luckily, they have an assortment of breads to choose from--including onion, goat cheese, and aloo (potato-stuffed) naan. \n\nThe paneer is served with the most delicious, creamy, full-bodied sauce ever. I usually get it mild because I date a spicy-phobic person, but it's still got a great kick regardless. \n\nThe service is unbelievably attentive and quick, and it's very well-priced for a sit-down restaurant. Definitely an Inner Sunset favorite.", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-04", "description": "Lovely.  And huge portions of dosa.  The Mysore was just spicy enough, and when stuffed into the dosa, almost didn't fit onto the plate.\n\nWe had two different pakoras, which while satisfying, were just a bit lacklustre.\n\nThe service was friendly, and I'm sure we'll be back!", "author": "Ken B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-23", "description": "This was some of the best Indian food i have ever had. They have JUST opened so a few kinks - kitchen couldn't quite keep up with the full house; service a little spotty but working hard to improve. they have a cousin working weekend nights to try to help with the flow and i think they'll get it right soon. \nAnd the food - oh my! We had:\n\nchilli Pakora - think Indian bite size chjile relleno - awesome goodness, not TOO hot.\nTandoori appetizer - plate full of bite size chicken, seek and lamb tandoori all cooked to perfection. \n\nSpring Dosa - dosa lentil pancake filled with fresh vegetables, with accompanying lentil soup, hot sauce  and homemade raita that is delicious. \n\nChicken Tikka Masala - the best I have ever had, good sized portion, spicy but not overbearing. \n\nAs i said service is new and not really coping when it's super crowded but they are obviously working on it. We got there around 6:15 and by 7 it was jam packed. Had to wait a bit for our food so for the short term I wouldn't go there super hungry waiting to eat IMMEDIATELY. Flip side also is, they don;t rush you out, you are encouraged to take your time over a cup of chai. \n\nNow i eat Indian food a lot, not at Naan and Curry which I do not like at all but at places like Shalimar, Tikka Masala, Pakwan etc. Masala Dosa is a little pricier but the choices, the quality and portions are so  so much better than average that it is my new favorite place. it's also beautiful inside with  staff that really go out of their way to be helpful.", "author": "Roberta D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-05", "description": "I've been craving some naan for the past few days, so A and I decided we'd have some Indian food sometime this long weekend.  Well, last night was the night!  I did a Yelp search for Indian food and found Masala Dosa.\n\nNote:  The last time I had a craving for Indian food, we went to Naan n Curry and I had a grumbly stomach for DAYS afterward.  We decided we'd cool it on the extra spicy foods and see if I'd have a better experience this time.\n\nWe walked over to Masala Dosa and were greeted by the man at the front (I noticed each employee didn't really have one specific duty.  They could be the host/hostess, server, table clearer - basically, whatever was needed.)  We had the option of being seated at a table further in the restaurant or wait for them to clean one of the window seats.  I opted for waiting for the window seat.  It's bright & airy and under this canopy of curtains.  The rest of the restaurant was darker and had a more romantic feel to it.\n\nWe ordered the Garlic Naan, Chicken Vindaloo, and Lamb Tikka Masala.  I also had the Mango Lassi and A had the Lemon Ginger Tea.  Oh yes, and we decided to order a Dosa!  We'd never had a dosa before, so thought we'd give it a try.  I can't remember which one we ordered though.  It was a gigantasaur triangle filled with meat & veggies and came with three dipping sauces/soup.  Definitely yummy, but too big for us to finish with everything else we ordered.\n\nThe naan was tasty and comes with 4 pieces.  Good to dip in the dosa sauces or the sauces for the Vindaloo or Tikka Masala.  I liked the Lamb Tikka Masala.  Creamy sauce, very flavorful, and not too spicy.  The Chicken Vindaloo was really good, but too spicy for me.  I just had a couple pieces of the chicken and let A eat the rest of that.\n\nThe service was excellent.  They kept coming to check on us and make sure we were doing okay.  They packed up our dosa with the dipping sauces at the end of the meal so we could take it home to munch on.\n\nTotal cost for two people ~$45 plus tax/tip.", "author": "Kris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-20", "description": "This is by far the best Indian restaurant overall I've dined at in a long while.\nRight when we walked through the door we were greeted very courteously by the host.\n\nThe dishes we ordered: curry lamb, tandoori chicken, & a Bhindi dish took a while to come . . . but when we ate, it was apparent why : they took the time to prepare food just right;  and it was delicious -- so good that I over-ate.\n\nA waiter periodically asked if all was well.\nThe boss' wife Sima, also came to greet us personally.\n\nThumbs up! Yummy food!", "author": "Jason H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-08", "description": "Masala Dosa has quickly become our go-to place for Indian cuisine. I used to go to Naan N Curry down the block but after reading the recent reviews on Yelp, I decided to try this place (and it didn't disappoint). We've eaten here twice and both times they've given us window seats. I have this theory that they put their best looking customers near the windows. \n\nTheir paneer tikka masala is legit. We've also had the chicken tikka masala, which is good, but their homemade cheese is too awesome to pass up. Their garlic naan is fresh and fantastic but might be strong for some people, so if you're on a hot date I'd stick with the naan. Each curry comes with a huge bowl of rice. If you're in the mood for curry but aren't hungry enough for naan, I'd just use the complementary rice. \n\nThe staff has been friendly and has always taken the time to answer our questions. \n\nMy tummy gives Malasa Dosa...4 Stars!", "author": "Allan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-10", "description": "Very friendly staff and good service, but the food is mediocre. The chicken and lamb dishes always taste a little bit 'off' to me (like the meat is not that fresh), and the naan is consistently soggy and burnt tasting at the same time.", "author": "Heidi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "Great food, very clean and nice atmosphere and friendly service. Seems that the reviews here are a mixed bag but I would definitely recommend this place. The lamb biryani was fantastic and the servers were attentive and patient. I also love that it is BYOB! Serving sizes were decent and still had plenty of leftovers to take home between the two of us.", "author": "Lisette P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "The food was delicious, a feast. The service was great in dealing with our constant ordering and staying til closing.", "author": "Scott P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-04", "description": "Great food! And it's gluten free for most of the items on the menu. They do not have a liquor license but they do not have a corkage fee and there is a liquor store on the corner with a decent wine selection or simply bring your own. It's small and quiet perfect for date night or night out with friends.", "author": "Lawanna N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-10", "description": "Great service, check! Great food, double check! Take out, check! Delivery... needs to happen soon!\n\nThey are the better Indian place in the Sunset area, PERIOD!", "author": "Ms. Hala A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-03", "description": "I just ate my first paper dosa -- those things are huge and fun to split with the table. We also got the chicken vindaloo (it was _actually_ spicy, as advertised) and the pakora (wish the serving was bigger, but this is no buffet). I too saw other people with their own wine they brought in, but it would be better if you could order a glass off the menu since I don't carry alcohol on my person as a matter of course.\n\nWhat is special is that this is a nice place, atmosphere-wise and an improvement over what was there before in that regard. I will definitely go back (and preferentially over Naan n Curry). \n\nService is very good; I think we had the most ambitious water re-filler on the planet.", "author": "Catt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-12", "description": "It just opened today! It's right where Tasty Curry used to be. The chicken in the Chicken Tikka Masala was juicy, and spiced just right. I would give 5 stars just for that and nothing else. The rice, Mango Lassi and Panak Paneer (I hope I spelled that right) were pretty standard, but good, the Onion Nan was awesome.\n\nAs for atmosphere it was a tad drafty but pretty inside, and I wish they had at least a thin curtain on the archway separating the dining room from the kitchen, I felt like I should wave to the guys cooking or something. Though, being their first day open, they're probably working on those things.", "author": "Christina W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-24", "description": "Worst experience ever....waited for 30 mins...without anyone giving us water or asking for water. Looked around and it wasn't even busy...told the owner and he was incredibly rude, saying you have to ask for water...wtf...never going back and urge others not to go back!", "author": "Shane K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-23", "description": "LET'S KEEP THIS SIMPLE: I don't like to give people the eyesore of their epic experiences, word for word and about how we sat down and the waitress rolled her eyes and what not.\n\nSERVICE: Excellent!! extremely nice & welcoming! \n\nFOOD: Perfect portions, although I like to see a little more!\nAll they need is a bottomless refill of chai!!\n\nSANITATION: (most important to me) Clean! Didn't use the restroom, So If I do.. I will have to update this. haha\n\nWHAT I GOT: garlic naan (slightly burned), Already cut for you! Chicken masala, and Chicken tandoori! All was delish. & of course a cup of chai! \n\nSO WHATS THE BIG DEAL??\nAlmost fancy like! haha Food was amazing!! Everything tasted so healthy. Not thickening like other indian restaurants. Gotta say if you like indian food, you should try here!!\n\nOTHER NOTES:\nGot SUPER gassy.. but I lived to tell my story!", "author": "Steph L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-15", "description": "Basically, not worth the prices. Lamb in the lamb vindaloo was like jerky, chicken in the tikka masala was dry, and rice didn't have enough water.  They also kept forgetting my order of naan which I was looking forward to.  My friend also got their masala dosa and feels nauseous an hour after eating it.\n\nThe people working there are really nice though and apologized for forgetting my order. The waitress offered us rice pudding to make up for it, but we had to leave.  Granted  it's their first week, but I won't be going back for the food anytime soon.", "author": "Jenn K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-30", "description": "Growing up eating dosa my mom cooked every weekend, I'm always psyched when a new South Indian place opens up in the city.  With a name like \"Masala Dosa\", I want to come and eat the dosa - not all the other north indian dishes, no matter how tasty they might be.\n\nOverall, I was happy with the food at Masala Dosa but not enthralled.  The pakoras and vada we got for appetizers were really tasty.  Not the most authentic you'll find, but with an added sweetness that hit the spot.  Pretty impressive.  The Mysore Masala Dosa, however, was somewhat lacking in flavor.  Definitely not the best around - no competition for Udupi Palace.  Hence the three stars - dosa is the focus of this review.\n\nService and decor were both on the money.  Price point is right for a South Indian joint (i.e. dosas ~$8 or $9).  Right now big ups for being BYOB (though not sure how long that will last).", "author": "Arun W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "Food was good, interior was clean and modern, prices are very fair :)\n\nI liked all the food we got: samosas (use the sauces), garlic basil naan, \"roti\", spinach and cheese curry, and the masala dosa (for the sake of the restaurant being named after it). If bringing in out-of-towners, I recommend this place over Naan and Curry for its tidier interior.", "author": "Lana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-31", "description": "Aside from the price vs size issue, this place is pretty good.  The chicken madras is crazy good, and much tastier than the oh so boring tikka masala.  I think they deliver via EAT24, but want to say that their prices are much higher with the delivery service.", "author": "Joel M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-01", "description": "Service is very slow which spoils the mood ... 25 min for 1 dosa that to with not much ppl in here", "author": "Shaleen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-30", "description": "Good food! So happy to find another go-to Indian place close to home. Good mix of both North and  South Indian cuisine, so there should be something to make everyone happy.", "author": "Nichole F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-19", "description": "This is my new favorite place in the sunset!!!  There are plenty of Indian options near by, but none of them serve Southern Indian food.  Masala Dosa does both Southern Indian food as well as my favorite Northern dishes like tikka masala and palak paneer.  \nThe dosas are gigantic and perfectly crispy.  They are accompanied by the usual sanbar and chutneys which are both delicious.  The tikka masala sauce is maybe the best I've ever tasted.  \nMost importantly, the people are really nice here.  I saw one waiter run down the street to bring a customer his leftovers.  The first time we came they were packed and a bit understaffed for the rush.  On our next visit, all of our food came promptly.  \nIf you live in the sunset, you should eat at this restaurant.", "author": "Paul A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-03", "description": "You must try the baingan bharta, it is pretty good at this restaurant.", "author": "Cece L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-06", "description": "I had never tried dosas before and these were delicious.  It was a Friday night and I was with a group of 7 people of varying hunger levels.  We needed a relatively quick and reasonably priced place that could accommodate the group before catching a musical downtown at 8pm.  Masala Dosa was the makeshift solution.  The waiter pushed 2 tables together and we were served very efficiently.  Those of us who weren't very hungry were able to share a dosa and it was plenty filling.  It was surprisingly loud in the restaurant but we definitely contributed to the sound levels so this is not a complaint.  Very vegetarian friendly and the variety of dosas was excellent. I'm glad I tried this", "author": "Kryssi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-19", "description": "Solid presentation, clean ambiance, and tasty, but not heavy Indian cuisine. Not a stuffy or chaotic Indian restaurant at all. :-)\n\nThe lamb dishes are my fave; though I wish they had lamb chops.", "author": "Omar M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "I don't usually eat Indian food, so it's hard for me to compare quality and taste to other places I've eaten. That said, good food is good food? And I think Masala Dosa fits. \n\nThe four of us shared the bhindi (okra) vegetarian dish, chicken tikka masala, and chicken vindaloo (comes with potatoes). The bhindi was sweet and the okra was cut up into perfect bite sized pieces. The vindaloo was surprisingly spicy. We also ordered regular, garlic, and onion na'an to go with it. The garlic was extremely flavorful and the onion was exceptionally bland. \n\nIt felt like comfort food - the food came out fast, the waiter was really nice, and the place clean.", "author": "Kimya P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "Great food, comfortable dining atmosphere; a local favorite. Choose either your more typical curries, creamy & sweet or hot & spicy; or, try a \"dosa\" for a change of pace. Something for everyone, even that one member of your group who thinks they don't like Indian food because they tried it once years ago.", "author": "michl .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-24", "description": "Cute, new, cozy, tasty.  The paper dosa was big and crispy.  The uttapam was thick and hot.  Both came with coconut and tomato chutney, as well as the requisite sanbar soup.  The soup itself was a good, hot and spicy dip all by itself.  We also sampled the spinach potato curry, which came with rice.  The chai was okay.  Not as \"spiced\" as I'm used to, but hey, everyone has their own recipe.  They even offered me free refills.  \n\nService was just fine, though one server spoke too softly for me to hear.  The dining room looks freshly remodeled with a contemporary look.  The walls are still bare and in need of artwork of some kind.  \n\nAt these prices and quality, there's sure to be a crowd soon.  Plus, it's hard to find southern Indian dishes on this side of the City.", "author": "Stephen F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-14", "description": "The masala dosa here is nothing to scream and shout about but it wasn't bad. The sambar was sub-par though, which is a shame because sambar and dosa go hand in hand. Chicken biryani was pretty good but not spicy enough. Our appetizers (mix grill) came after our actual food came which was hilarious in a sad way. All in all it's a decent place with nicely decorated interiors, pretty good food, and okay service.", "author": "Idk A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-22", "description": "OK, first of all, they DO deliver.  Check out their website.  Somebody change their Yelp listing to reflect that!  I tried and I can't.\n\nThis was my first time ordering from Masala Dosa after having tried several other Indian restaurants in the neighborhood.  If I order again and it's as good as it was this time, I'll probably bump this review up to 5 stars.  Everything was delicious!  The chicken tikka masala was medium spicy just as ordered and very hearty, with nice big chunks of chicken.  The baigan bharta was amazing, with a wonderful smoky taste.  The garlic naan was big and flavorful.  \n\nThe only issue was that it took them nearly an hour to deliver our food.  The online ordering system said it would take 45-60 minutes, so it wasn't a surprise, I guess, but it seems like they could get the food here faster.  So don't wait until you're starving to order.  Otherwise, the food was totally worth it and I can't wait to try it again.", "author": "Lorelei S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-01", "description": "Pathetic food, very hard vada sambhar and a super rude service. Better try some other Indian place in the city", "author": "Mayank Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-30", "description": "What are people talking about? I love their food and I am picky. Very picky where I eat. Oh, it was so tasty. Yummm! :)", "author": "Jasmina T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-11", "description": "Ok food. Open late night. Not the best Indian food in the city that's for sure. Good service.", "author": "Pratima M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-06", "description": "Anytime we want to go to indian , close to home and is happy to have children, this is the place to go.. Food is good, service is good but can be slow sometimes .. Overall good experience..", "author": "Das M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-21", "description": "This place is as good as it gets.  You brought me in the door with your BYOB (with no corkage fee, as BYOB should be) policy, but you kept me with your delicious food and attractive interior.  The food here is top notch - the Chicken Tikka Massala was deliciously flavorful with a hint of spice, the Dosa had a great stuffing and interesting sauces.  The interior is well decorated and classy.", "author": "Peter H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "The food was delicious plus great service. My new go to place for Indian food!", "author": "Susie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-05", "description": "Delivery over 90 minutes multiple times. Drivers refuse to use GPS and always get lost.", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "The food is delicious. This place is clean and the waiters are super friendly. Been coming here for a few months as a regular. It's become my to-go place for Indian food in the sunset.\n\nThe chicken tandoori is insanely good when you're hungry!", "author": "arthur l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-19", "description": "Pretty solid Indian food I have to say.  I always order Tikka masala when gauging a new place and it was very good here.  The curry had the right consistency and was flavorful.  I've had a few better ones in the city but I would order it again here.  The garlic naan had a slightly doughier texture than I'm used to but it works.  \n\nI think this will be my go to Indian place in the Sunset from now on!  I also tried the vindaloo and was more than happy.  You really can't beat the price here either.  You can get curry, rice, and naan for less than $15.  I'll have to try some of the dosa next time around.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-21", "description": "Out of the handful of indian food restaurants in the area, this one is my favorite. Maybe it's because i'm a picky eater with somewhat high standards (sometimes - you can just blame living in New York for that), or my extreme phobia of buffets (yuck, gross. why are you people eating food that's been sitting out for who knows how long??), but this one seems the most authentic, genuine, and downright delicious. \n\nI've had the chicken pakora (like Indian style popcorn chicken), the cranberry and goat cheese nan (a little sweet, but still delicious if you dip it into whatever you're eating), and the chicken madras. The chicken was like butter and i didn't even need a knife to cut into it. \nThe place is not a smelly dump and you can order online! It's a little pricey but you really get what you pay for.", "author": "Catface G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-24", "description": "I've passed this place many times thinking it was probably just the same as any other Indian restaurant that i've been too.  \n\nWhen my sister was having a craving for Indian food, she was the one who decided to go eat here.  We had the Chicken Tikka Masala, Samosas, and matar paneer with rice and garlic naan.  It was very good (compared to other places I've been too)!  I will be back to try more of their dishes and their namesake \"dosas\".", "author": "JJAMZ C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-26", "description": "Awesome flavors\n\nNice decor, \nFriendly staff\n\nPricey for dosa $$, we had take out... would try this again for dinner, everything was really yummy", "author": "Coco J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-16", "description": "It just opened and we went for the first time last night. It was lively late. I like to eat after 10PM and much of San Francisco shuts down. It's a lovely space, the food was wonderful and the service friendly. They have a lot of vegetarian dishes, of course. The dosa was good and we had a version of aloo gobi that was unusual and delicious. I will be going back here.\nUpdate: I DID go back there. This time we ordered paratha (layered whole wheat bread) instead of chapati. It is a must. It was memorable, with layers texture, almost like a croissant. I would return for that alone. The rest of the dinner was good as before--once again, two vegetarian dishes, aloo gobi and an eggplant dish.", "author": "jessica d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-31", "description": "The food was excellent. We had chicken biryani and it was really delicious. Just like Indian biryani with the chicken cooked really well. The ambiance was good. The prices were reasonable. Will surely visit here again.", "author": "Paresh R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-26", "description": "There are now a bunch of Pakistani-Indian eateries in the neighborhood, several have even closed and gone away.  When Masala Dosa opened, a friend of mine was very happy because \"dosa\" is different from the standard Indian food places around here; I'd never heard of dosa(s?).  So we went and we had dosa, didn't bother ordering anything else.  I wasn't impressed with dosas.  I'll probably not go back since there are other Indian places within a block or 2 that I already get food from.", "author": "Kai T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-08", "description": "I ordered a masala dosa, bread, potato curry and lentil soup. Except the bread, every dish was subpar. Even the masala dosa was bad despite being the flagship dish. This restaurant does not get South Indian food. Disappointing.", "author": "Yelp A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-09", "description": "We had driven by the restaurant a few times and thought we would give it a try.  We ordered delivery, the items were: \nPakoras, \nMysore Masala Dosa,  \nChicken Tikka Kebab, \nOnion Uttapam, \nChanna Masala, \nChicken Tikka Masala, \nGarlic Naan \nTOTAL BILL = $70\nI get that we ordered quite a bit of food but really,  $70!!!!   I expect palatable food for that kind of money.  Instead, the pakoras were oily and soggy, the Uttapam was doughy and thick, the potatoes in the Masala Dosa were burnt, the sambar had celery in it (non-authentic) and resembled ditch water, and the garlic naan did not taste like it had garlic - it is almost pointless to add that salt was non-existent in their food.  I am not even going to bother with the chutneys!!!   Bad excuse for Indian food.", "author": "Natasha F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-28", "description": "Ordered delivery. Pulled over 5 individual hairs of varying length and texture out of my Chicken Tikka Kabob. Gross. Gross. Gross. Used to eat here kind of regularly. Not anymore. Gross.", "author": "Rebecca R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-27", "description": "Had an early dinner, good food and decent service.\nMy friends and I ordered quite a bit of items and I can't remember specific ones except maybe samusas and curry.\nWould definitely recommend this place for Indian food.", "author": "B M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-08", "description": "Amazing food. Slow, disorganized.\n\nNorth and South Indian to beats all the competition in the inner sunset. Would be 5 stars if not for the spotty service. Got our order wrong, charged us for things not there. Still we come back again and again because the tastes are great.", "author": "David Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-11", "description": "To start off this place is amazing!\n\nThe atmosphere is calming with the music and rich wall colors. The candles at the tables flicker lightly casting a soft glow across the room. \n\nThe food is excellent. The flavors are bold and just right. There isn't anything we have tried and didn't love. The tandoori chicken is perfect. There naans and dosas are also very good and they provide amazing dipping sauces and chutneys. Their curries are also very good. You can't go wrong there! Also they make an incredible mango lassi!\n\nThe food is also priced well. Sometimes Indian can be expensive, or cheap but not good. This place is good and priced well. \n\nThe staff there is friendly and knowledgeable about their menu. They are very helpful and attentive, but not too attentive. You don't ever feel rushed there either.  \n\nOverall, if you haven't been here yet and enjoy Indian cuisine this is a must for you and if you are looking to try Indian food for the first time, this is also the place for you. \n\nEnjoy! It is also right near Holy Gelatto!", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-08", "description": "Yummmmm! Went here with my Mom and her boyfriend and my boyfriend on his birthday the other night, and it was excellent! My man got Chicken Tikka Masala and loved it. I got Chicken Madras and loved it! My mom and her man got mesquite eggplant (amazing!). Also, the samosas, papadams, and chai and mango lassi were perfect. And they gave us free samosas! The server was awesome and was cracking us up all night. We loved it!", "author": "Lindsey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-01", "description": "How many Indian restaurants are in Inner Sunset?  And how many of them have the word Masala in their names?  I guess I don't mind having lots of Indian options in the neighborhood, but it does take some strategy and guts to open a restaurant that will compete with others that have established a steady cliente over the years.\n\nMasala Dosa got at least two things right: more upscale ambiance and trendy South Indian dishes like dosa.  The place looks way more roomier than the old Indian restaurant, with sleek dark interior and dim lighting.  The two tables near the window look so cozy and inviting.  \n\nBesides dosas and uttapams, they do have classic Indian dishes like tandoor chicken, naans, etc.  The four of us split a tandoor chicken, palak paneer, masala dosa, regular naan, and garlic naan.  Plenty of food, especially since we got the full order of chicken instead of half.\n\nDosa isn't as good as Dosa's, unfortunately, and palak paneer is slightly bland and too creamy in texture to tell that it's spinach.  Naans were good.  Tandoor chicken was pretty awesome!  Totally juicy, not dry at all, and has that nice tandoor aroma and wonderful flavors.  \n\nService is really friendly and warm.  A little slow, but I guess if I wanted fast food, I could have gone to Naan N' Curry.", "author": "Candice B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-23", "description": "Best Chicken Tikka Masala I've had in some time. Man it's good. Everything else we've had stacks up as well. I can't recommend this place highly enough if you're looking for Indian food.", "author": "Howie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-23", "description": "I was excited to see this place open up as competition to Curry Village across the street. Curry Village is decent, but I was hoping to see Masala Dosa really up the bar for Indian in the Inner Sunset.\n\nThe Good\n\nSadly, there are some major issues with the food. First the good, though. Excellent service. The waiter was super attentive but never overbearing, very helpful, there when I wanted him, not there when I didn't. That was great.\n\nThey cook carbs well. The rice was fluffy and wonderfully seasoned, and the onion naan was incredibly flavorful with a delicious wood-fire smell to it (although a touch on the dense side for naan). Maybe I should have got the dosas, since that's a carb and it's in the name of the place after all. But I didn't, I went with some my favorites.\n\nThe Bad\n\nThe Bhindi Masala (okra) and Lamb Vindaloo I ordered were poorly done on two levels: (1) cooked unevenly/carelessly, and (2) poorly seasoned.\n\n(1) Some of the okra was underdone and really tough, other bits nice and tender. Similarly with the lamb, some pieces were dry and tough and others were quite moist. The only way you screw that up is by not paying attention in the kitchen, or by combining uncooked food with pre-cooked food in the same frying pan.\n\n(2) Both spice mixes fell flat. They were obviously not fresh spices, which in this day and age is really inexcusable. No Indian restaurant in San Francisco should be using pre-ground spices, they should be making their mixes from scratch every morning. The vindaloo in particular had a flavor of stale paprika that was really unpleasant. And it wasn't spicy in the least, which was quite disappointing.\n\nSo anyway, Curry Village still wins on flavor, even though they put too much sugar into their food and they're too pushy about the buffet. I'll probably go back to Masala Dosa and try the Dosas or the Uthappams, but for straight-up chunks-of-food-in-sauce-style Indian, I'll go elsewhere.", "author": "Aaron G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-03", "description": "This place replaced tasty curry (which I very much enjoyed)\n\nFood ordered was\n\nChicken tikka masala : very delicious and the proportion is greater then tasty curry.\n\nAnd we got some spicy chicken dish which came with rice: another delicious dish.\n\nThe naan is very soft yet crispy. \n\nThe only downfall is that the naan had little black burn marks everywhere.\n\nThe ambiance of this place is very modern. Clean place but also very boring. I liked how tasty curry had murals on the wall which gave it a nIce home like feeling. \n\nwe were the only ones there so I can not comment about the environment.\n\nLooks like a expensive place but really isnt.", "author": "Wilson H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-13", "description": "I was told that Marsala Dosa was owned by the same owner(s) who owns Masala down the street near Lincoln Way, and I was curious to see what the differences between the two restaurants were.  \n\nAlthough I can't tell you whether the food had originated from northern or southern India, I have been a big fan of Masala because it was the only Indian restaurant in Sunset that served naan that didn't look it was used to wipe the counter top.  But more than that, Masala serves some of the freshest and tastiest Indian food I've had in SF.  \n\nSo naturally, I was excited to try MD.  I didn't have the dosa, as the other reviewers have suggested; instead, I had my usual dishes, the chicken vindaloo and palak paneer.  The palak paneer was creamier and actually tasted better than the one at Masala, and the vindaloo was definitely spicier but nevertheless good.  Then again, I found that most of the dishes at MD are spicier than at Masala.  \n\nAmbiance wise, MD is a much nicer and overall, the nicest Indian restaurant in Sunset.  The waiter was friendly, but the service was VERY slow, much like that of Masala ... actually, I think the waiters may rotate between the two restaurants.  \n\nAll in all, it's great to have the two restaurants in Sunset, as now, I have more choices.", "author": "S. I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-21", "description": "Came from Philly for a trip to SFO and delighted to see someone serving both south and north Indian food near we stayed. Idly was very authentic and fish masala was great! But vada and rava masala dosa was just fine with out flavor.\n\nJust for food I would have given four star. But service was disappointing. Slow to serve water and no body checked us after serving food. And one server looked worked up and little rude!\n\nBut would go back again for the food!", "author": "Virat K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-28", "description": "Went here for a dinner for two. It was alright but not memorable.  We shared two entrees and the waitress was very nice in explaining each dish and then checking in with us.  The dishes however, one of which was a Dal, was bland.  We wanted to ask for salt but didn't want to be rude. The portions were also smaller than expected.   I understand I'm also paying for the ambiance. \n\nWarning, you will smell like Indian food from head to toe after eating here.", "author": "S c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-02", "description": "The first time we came here, we were rather tipsy, and we ordered our palak paneer \"extra extra spicy...really, don't hold back.\" It was kind of painful to eat, just past our high tolerance for spiciness. But hey, we asked for it, we won't fault Masala for our hubris.\n\nThe second time we came here, we ordered the mattar paneer. We found that it actually wasn't spicy enough for us...hmm. We like this place alright but will continue to explore other Indian restaurants.\n\nFree delivery if the order is at least $20.", "author": "Dante and Alleliah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-03", "description": "I went here with my girlfriend, and we loved the food!  Never thought Indian food could taste this good.  My girlfriend is a chef herself and was surprised by how good this place is. Will definitely come back here.", "author": "PWais M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-16", "description": "Overall, pretty tasty food but service/atmosphere could be better.\n\nWe came here for a weekday lunch before a jaunt to GGP.  I ordered the navratan korma curry and my companion had a Rava Masala Dosa.  My curry was creamy and beautifully spiced.  I had a bite of the Rava dosa which was tasty, but could be crispier.  \n\nAtmosphere-wise it was pretty dark despite the sunny day.  I'd love a bit more light.  The waiter also didn't check on us for a really long time or refill water even though we were the only ones in the restaurant.\n\nI'm happy there's a nice Indian restaurant serving Dosa in the Sunset and hope it works out a few kinks.", "author": "Shila S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-19", "description": "I absolutely love this place for their chicken makhni (sic). It's absolutely delicious! I haven't tried much else other than their Garlic naan which I assume isn't hard to mess up if you know what you're doing. If chicken makhni is what you're after, this place definitely does not disappoint!", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "We have been here several times in the past two or three years and it's become a favorite of our family and friends. The place is moderate-sized, and the atmosphere is pretty casual. It can get kind of loud when there is a large party (not sure why large parties seem to get so voluble). The menu offers a great many choices of dosa, and a great many choices beyond those. The dal is particularly excellent. The nan is fresh (the chapati is wonderful). There is no alcohol, but you can bring it in at no charge. A particular feature here--the very helpful and amiable staff.", "author": "Henry S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-07", "description": "The only reasonable indian in the neighborhood. And absolutely delicious at that, great service, mild ambiance, simply pleasant. \n\nUnless you're looking for lunch buffet leftovers for dinner.\n\nBYOB, and enjoy curry, naan, samosas. \n\nThank you, Masala Dosa.", "author": "Bridge F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-30", "description": "Really excited when I learned of South Indian food in the inner sunset. So, went to check it out. Nice decor and fancier than the other Indian restaurants around the area, and spacious.\n\nMenu is a combination of both North and South Indian food, so the standard chicken tikka masala and lamb vindaloo, etc. are available, as well as masala dosa and uttapam. The dosa and uttapam are OK, but nothing as delicious as in South Bay vegetarian restaurants. \n\nPrices are higher than nearby restaurants - you are paying for the decor, but the made-to-order North Indian dishes at Tikka Masala (Judah) and Curry Village (across) are just MUCH better tasting!", "author": "MandS R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-17", "description": "We got takeout here, though the restaurant's interior seems stylish and inviting.  Our meal of salmon curry and chicken tikka masala was quite enjoyable despite having traveled a number of blocks before reaching the dinner table.  The curries were both nicely flavored, featuring a harmonious balance of spiciness and savoriness, but the chicken was well done and bordered on being overcooked.  One observation (though not a criticism):  rather than the spongy and fluffy naan I'm accustomed to having at Indian restaurants, Masala Dosa's naan is flatter, denser, and saltier.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-27", "description": "I love that they are byob and their masala dosas and the lamb tikka masala.", "author": "Axel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-27", "description": "Delicious food and good service. A \"recovering vegetarian\" as my brother says: I don't usually go for meat things... but he got the tandoori chicken and I've never tasted chicken that good. I got matter paneer which was perfect! Gluten Free friendly too!", "author": "K P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-18", "description": "Delivery is excellent, food arrives hot and delicious. Highly recommend the chicken makhni. Delivery man is always very friendly.", "author": "Osman D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-05", "description": "I eat a lot of Indian food. Masala Dosa is definitely the best Indian food in the Inner Sunset. Tons of options and they're all delicious!", "author": "Katie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-21", "description": "I was craving Indian and was close to this Masala Dosa so I decided to give it a shot. The decor is really nice compared to other Indian restaurants I have been to. I ordered the chicken tikka masala and it was ok. It wasn't very impressive but wasn't bad either. The garlic naan was absolutely amazing though. Crispy on the edges and doughy in the middle. The service was alright. The waiter rarely checked to make sure we had enough water or anything. Overall this place is alright.", "author": "Darius A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-06", "description": "Masala Dosa is the new Indian restaurant replacing the old Indian restaurant across the street from the newish Indian restaurant and down the street from the older Indian restaurant, but two block away from the Indian restaurant with the back patio and about the same away from the other Indian restaurant on 6th.\n\nMy neighborhood has a lot of Indian restaurants.\n\nThis, however, is the first restaurant that serves Southern Indian food, and  the best Indian place we have, hands down.  First of all, it's a fun place to be.  They really did a good job with the decor, which would be less remarkable if it weren't replacing Tasty Curry, which, while completely edible, was sometimes a sad place to be.  (Anybody ever go there for the lunch buffet on a weekday?  No?  That's what I thought.)  The same space looks absolutely beautiful now that Masala Dosa got their hands on it.  It's a very dark space, but very elegant.  It's not too cool for school, though - Masala Dosa is a great place to take a date, but I've also seen whole families, with babies in tow, chow down together.\n\nAnd chow down they should, because Masala Dosa's food is some of the tastiest around.  I will admit I had never had a dosa before, so my opinion of that might not be terribly useful to you all.  But I liked it!  We had the egg dosa, which was just the right amount of eggy and crepey.  We also had the idly, which are dense little suckers!  The texture is so homey and warm and filling - and they're served with delicious chutneys!  But what I really go for are the classics, which I've had many places and which are better here than those other places, for the most part.  Their shrimp vindaloo is a really great heat level.  I fear they may have been holding back because I'm small and female (but mighty!), but I really found the heat to be really well balanced.  I didn't need to take a break every bite, but it got my nose running, and that's good enough for me.  I've also had their okra and their baingan bhartha, which were out of this world.  The veggies were tender, the sauce was flavorful without being too salty, and the whole thing tasted pretty amazing with a big hunk of garlic naan.  (I smell lovely every time I eat there, by the way.)  Heck, even their rice is more delicious than average!\n\nThe service is also exceptionally friendly.  Perhaps it's because it's a new place, but Masala Dosa is just a cheery place to be, where everybody takes really good care of you.  If they keep this up, the other places around aren't even going to stand a chance!", "author": "Becca S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "This restaurant is amazing - not only is the food absolutely delicious, they are also incredibly accomodating to any food restrictions or allergies.  I took my parents here, who eat Jain food (which is a combination of vegetarian and no root vegetables (no onions, potatoes, garlic, ginger, carrots, beets, etc.)).  The cooks made a great sambar to go with the dosa and were suggesting many vegetable dishes they can do as well.  \n\nBeing a big fan of south indian food, I can compare them to the other south indian restaurants in the city and the peninsula/east bay, and they are easily in the top tier.  Their idlis, utthapam, and dosas are delicious.  Their sambar is perfectly spiced and their chutneys are mouth-watering...perfect complements to the main dishes.\n\nFinally, their service is top-notch.  This restaurant is great!", "author": "Nilesh B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-06", "description": "I love that there is finally a Southern Indian restaurant in our neighborhood! I like the dosas and the curries are good. It is more pricey than the other Indian fare in the neighborhood. It has great ambiance and very dim so kind of romantic nice for a date.  They have really good Naan bread and freshly made. I say its definitely a great place to try out.", "author": "Nadia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-06", "description": "New favorite Indian Place.  Not only  are all the members of the staff insanely sweet, but they have free corkage and amazing food!  We got 2 lamb plates.  Both rocked my socks off.", "author": "Audrey K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-01", "description": "Updating my review to give it 4 stars.  The curry dishes are really great and the service is excellent.", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-10", "description": "We used Gopago to order our food then picked it up. We had a huge to-go order and they gave us plates, forks and napkins upon request. The food tasted awesome and was very flavorful. The only downside was that we then walked to Golden Gate Park to enjoy our food in nature and by the time we got to the park, all of the lids on the to-go containers busted open and left a lot of leaked curry in my sister's nylon reusable bag. Don't get food to go here if you're walking very far with it.", "author": "Ashlie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-03", "description": "This is a nice place to enjoy good food with good ambience and quite atmosphere. No hurry, no worry, just good curry. I ate here rava masala dosa and tandoori sampler for appetizer. Appetizer was good. I was not so happy with the rava masala dosa though. I know good and authentic rava masala dosa is not easy to find. It was okay. Sambar and chutney was really good including the potato curry in the dosa. But I think the rava dosa could have been better. Chai was good. Overall this place is nice to enjoy good indian food.", "author": "Alien T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-05", "description": "Good food. Make sure to order rice in your delivery, because it won't come with it otherwise.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-17", "description": "yum yum yum yum yum!\n\nFinally we can get our South Indian fix in the Inner Sunset.  But if someone in your group wants the usual Indian fare, they've got that too.\n\nWe had the:\n- Masala Dosa: classic w/sambar and coconut chutney\n- Chana Bhatura: ordered the chana (chickpeas) and bhatura (fried bread) on the side\n- Moong dal halva: dessert - rich, satisfyingly sweet, yellow bean pudding, served warm\n\nNever had moong dal halva before, but now it's on my must-have list.\n\nHigh quality ingredients, right-sized portions, you'll leave satisfied but not feeling like a slob.  If you're looking for the all-you-can-eat and closed due to health inspectors, this is not the place for you. Owners are really friendly and accomodating.", "author": "c e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-04", "description": "We went to this restaurant for a quick lunch on a random Wednesday afternoon.  We had very limited time but the service was exemplary.  We let our waiter know of our time constraint and he expedited our orders so that we could make it to our muni train.\n\nAnd that was just the service.\n\nWe ordered a paper masala dosa and a chicken tikka masala.  We also got plain nan, a mango lassi, and rice.  The paper masala dosa was crispy without being oily.  The potatoes were well made, spicy, flavorful, and had just a hint of crispiness that gave a really nice flavor to the dish.  Both the sambhar and the coconut chutney were as good as any I've had (including Udipi Palace and Saravana Bhavan).  \n\nThe chicken tikka masala was also very good.  The sauce was creamy and flavorful, not overly peppery but still had appropriate amounts of heat.  The chicken pieces were chunks of breast meat, obviously of good quality, moist and tender, with no appreciable fat or gristle (a whole different world from the grade D swill they put in the CTM at Naan n Curry). \n\nAs for the atmosphere, the interior of the restaurant was nicely decorated.  I do agree that it was a bit dark, but I like that ambiance - it lends a romantic note which is rare at reasonably priced Indian restaurants.  \n\nAll in all, it was an excellent experience and we will be back...it's a short distance from UCSF where we both work.", "author": "Soraya R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-18", "description": "The best Aalu Palak west of Mumbai... The other stuff on the menu is pretty good too.", "author": "Amey B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-12", "description": "I am sad that my experience here wasn't better.  I went for dinner on a Saturday night.  The food was good, we had the Chicken Tikka Masala, Regular Naan, Garlic Naan, and Masala Dosa.  The inside of the restaurant is clean and modern.  The big disappointment was the service.  There were plenty of employees working, but they were just kind of standing around, we had to work hard to get them to bring us rice (which does NOT come with the entrees) and refill our water glasses.  The restaurant was only half full, so it wasn't that they were busy. The waiter wasn't friendly at all.  I think that if I eat here again I will get my food to go so I don't have to tip poor service.", "author": "Christy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-04", "description": "This new place was just the ticket as my daughter and I were on our own and craving curry to nullify our lingering colds.The tandoori chicken was spot-on;juicy and loaded with flavor in spite of the serving being on the small side.Lamb Seekh Kebab was outstanding,as was a deconstructed version of Mala Kofta.The only real disappointment was the onion Naan which was tough and chewy.The novelty here is the unusual combination of both Northern and Southern Indian food.The added bonus is that I can bring out of town vegetarian guests for a wide selection of choices. Masala Dosa is a welcome addition to the Inner Sunset restaurant scene.", "author": "Antoinette S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-03", "description": "Pretty good Indian food in my book. The friend I was with was a big fan. The naan was especially good. The portions aren't very big.", "author": "Olivia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-22", "description": "Nice spot. Good food, similar flavors across everything we ordered though. I wouldn't call this a TRUE southern Indian restaurant, as there was also a lot of Punjabi/Rajastani/British influence. I enjoyed it though for sure. Nice ambiance. More chic than true Indian.", "author": "Max M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-09", "description": "After having Naan-N-Curry as the benchmark for Indian food, this place blows it away, good food, good service and convenient location.", "author": "Roman I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-07", "description": "I love this place. Been there so many times!  The staff is very nice and will go the extra mile to make your visit enjoyable. The food is very tasty, more on the homemade side, which I like. The curries are delicious and you can have them prepared mild if you wish. Bring your own wine since they don't sell alcoholic beverages. The price is very, very competitive.", "author": "Mary R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-22", "description": "Loved the interior. The food was good, big portions and reasonable price. We will definitely be back.", "author": "Jackie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-16", "description": "Bummer. I wish I liked this place more. One of the two servers was a total jerk - super aloof. The space is really nice and relaxing. The food was painfully average. There's some incredible Indian/Pakistani food in this town but my chicken curry wasn't one of them.", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-10", "description": "Masala Dosa has great food and very sweet service! The place has cute decor, it was just sad that no one was in there, y'all should go check it out. The price was totally decent. I think they could probably make the music more mellow and calming, so that would be one upgrade i would suggest.", "author": "Emily P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-04", "description": "Ate there last Friday with friends who have traveled extensively in India and other parts of South Asia. As usual, the food was excellent. The choices are wide ranging. The dosas are delicious as are the various curry dishes--one was a fish. The lamb biryani quite tasty. Service excellent as well. We'll be back soon.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-02", "description": "Bad food and bad service- The busboys keep watching every bite you take(in a weird way), as soon as ur on your last bite they'll pounce to clear the plate/table. Also, brought the cheque while we were still eating. Did not also know some of the details on the menu.The specials are bad, never going again.", "author": "Anjali A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-07", "description": "The online time said an hour but obviously this is a restaurant unable to deliver food 5 blocks away within an hour, or they just don't care. An hour an a half for a smaller order to make it a 3 minute drive from the store is inexcusable. And when I called to speak to them in person I was told that the food went out 45 minutes ago and there was nothing else he could do. Food showed up cold and not that great anyway. A very sad experience, avoid this place.", "author": "Joshua S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-26", "description": "Nice food, I loved the chicken vindaloo and the ghee Idly was good too. the sambar could have used a little more tangy kick. The waiter was super nice, gave us complementary chai, which tasted great! I like the place. It would be great though if they put some lights inside to make it feel a little more vibrant. The music playing was very cool too.", "author": "ab a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-30", "description": "Very good Tandoori, curries and fish..the naan, especially the lamb naan, is well made..best Indian food in the inner sunset definitely.  This is my go-to place when ordering Indian food for delivery -- much better than nearby alternative Indian restaurants like Naan & Curry.\n\nI'd recommend you give this a try if you're in the sunset looking for Indian -- I think it's your best bet in the area.", "author": "Shamus S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-12", "description": "Really good. the tandoori chicken was tender & juicy. the chile pakora batter was just exactly perfect. excellent service, not pushy or overattentive, nice atmosphere...", "author": "James P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "One of the better Indian restaurants in the Sunset!  I sat in the window seat under this beautiful, romantic canopy ( the reason why I walked in.)  The food was excellent and prices were comparable to other decent Indian restaurants in the area. It's refreshing to be able to order both south and north indian food at once.  Definitely returning soon!", "author": "Nazneen A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-04", "description": "This place is terrible, especially for south Indian food. The doses uttapams and idlis are embarrassingly bad and way over priced. Tomato chutney is clearly made from canned puréed tomatoes and the coconut chutney was bland! The sambar had celery in it which gave it a very non Indian flavor. Three of us spent 50 bucks. What a waste!", "author": "snigdha v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-21", "description": "MmMmm so goOd, I ordered the masala salmon and goat cheese naan. So flavorful and delicious, amazing service! Try the mango juice it will definitely have you crazing anything mango for the rest of the day!", "author": "M B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-11", "description": "Always curious to walk in here after they opened. Finally did, and I was amazed by it. Nice relaxing setting to eat food in; nothing too flashy or over the top. Friendly service and prompt. Once the food came in I was overjoyed! Food was excellent and full of flavor. Only wished it was a little more spicy but you can taste the spices blend wonderfully. Had the prawn vindaloo and lamb korma. Prawns were cooked perfectly and lamb was tender and tasty. Best Indian restaurant in the Sunset!", "author": "Doug D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-18", "description": "Cute place with pretty good food. The masala dosa had a nice crisp pancake but the filling was bland. The coconut and tomato chutneys were really fresh and the sambar was nice and spicy. This place does not warrant 4 stars though. Call me crazy, but I think your namesake dish should be the best thing at the restaurant. Otherwise change the damn name! I suspect the high rating here is for the novelty of south indian food in the sunset. I would say check it out if you live in the area, but I wouldn't tell people to travel across the city for it.", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "A great little gem!  They have a very friendly staff and a beautiful interior.  I thought the Dosas were better than the curries.  I can't wait to go back.", "author": "She-Ra .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-15", "description": "This place does both North and South Indian food excellently.  I usually get standard stuff like Palak Paneer which is great.  But I also love getting dosas and they are all amazing.  The naan is very good I often get the garlic naan.", "author": "toe k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-02", "description": "This place SUCKS big time!!!! In the name of veggie dish, they serve MEAT. I am a hardcore vegetarian. I ordered Paneer Tikka Masala, hardly did I know this place likes to substitute Paneer with Chicken pieces. After I noticed that it was not paneer, I showed it to the server. They did not have curtsey to apologize. They acted very casually as though it was not a BIG DEAL at all. But It is for  Vegetarian's like me. A STRONG NO to this place.", "author": "Divya R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-18", "description": "We tried this place out Sunday night for the first time, after hearing good things from others.  We walked in to a pleasant ambiance, much more so than typical SF Indian restaurants.  Their menu satisfied my north-indian-loving palate and my husband's preference for south indian food.\n\nHe ordered the rava masala dosa and raved about the flavorful sambar & chutneys as well as the delicious dosa.  We also got the paneer tikka masala and palak paneer - full of flavor without being too oily/greasy - we were big fans and will definitely be back!\n\nFYI - they don't serve beer or wine, but said you could bring your own drinks.  Love having another BYO option!", "author": "N. J. K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-15", "description": "Have been here for lunch twice with a couple of friends. They might still be gaining a following because there was only one other table occupied on one of the occasions. Perhaps dinner is more crowded. Good service and very tasty food both times. Not too oily and the dishes seemed fresh. Have had onion and garlic naan, aloo paratha, aloo palak, aloo gobi, baigan bartha, masala dosa, utthapam, and matter paneer--all very good. This is tied for the best Indian place in the inner sunset (out of 5 total). Definitely better than Tasty Curry which was in this spot previously. It's great that they have both North and South Indian food.", "author": "Nirav B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-03", "description": "This is a great addition to the Inner Sunset roster of eats.  Much better than naan & curry.  Delicious, gracious service, and did I say delicious?  Highly recommended.", "author": "Evan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-11", "description": "DELICIOUS. Came here on a Sunday night when I was craving Sambar like no other. We came and ordered a chicken masala dosa and a spicy gobi uttapam and a side of chicken tikka masala. I had to order the CTM because it's a standard at most indian places and I wanted to see if Masala Dosa's was any good. Of course, if you're going to a restaurant that has the word Dosa in it, you should probably stick to the South Indian options. The CTM was good, but even after asking for it extra spicy it lacked any spice at all. The spicy Gobi Uttapam was amazing. It came out piping hot with sambar and two chutneys. To top it off, it was actually really big. The sambar was also very good, it was really spicy and definitely catered to my love for hot food. I tried a little bit of the chicken masala dosa, which was basically a dosa stuffed with tandoori chicken pieces, potatoes, and peas. The dosa was made well, but the stuffing was flavorless, definitely not like the masala dosa stuffing at Dosa on Fillmore. The service is very good and they come around frequently to check if you need anything. I still prefer the ambience and decor at Dosa on Fillmore, but this place is definitely a good runner up and I liked the Uttapam here better. The pros of this place: They have no corking fee if you bring your own wine, and they deliver!", "author": "Neha H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-30", "description": "Worst place for South Indian food. Name is misleading. We waited 50 min for our uthappam and in the end it wasn't good at all. Never going back there.", "author": "Ravi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-20", "description": "Masala Dosa was very good!  My boyfriend, the garbage disposal, and I went there because they specifically have gluten free items.  (I know Indian food is pretty gluten free as it is, minus the naan, but peace of mind is important here.)  They had great service and reasonable prices.  We had the standard white people dish: Makhani (butter) chicken ($9, includes rice) and a seasonal vegetable uttapam ($8).  Both dishes were awesome and it ended up being the perfect amount of food.  We walked from Noe Valley to try something different and were so happy to stumble upon this place!  I wish I would've known about it when I was at UCSF!!!", "author": "Cersei T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-25", "description": "I've been to Masala Dosa a number of times over the past two months (it's that good and that affordable!) and the food and service are consistently excellent. \n\nThe restaurant is quiet and has soft lighting, comfortable seating, and delicious, delicious Indian food. All of the food has been good, but I'd recommend not missing out on the South Indian dishes, like the Paper Masala Dosa.", "author": "K. D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-17", "description": "Food was great.  Loved that they had both South and North Indian cuisines.\n\nAll the dishes were good.\n\nVindaloo was sweet at the get-go, and then built to an incredible fire.\n\nLeast memorable was the Spring Dosa, mainly because it lacked the complexity of the other dishes.  However, it is a simple dish, and the sambar that came with it was great.\n\nWe had three out of the four desserts, and they were all great, which was a surprise - you never expect desserts at an ethnic restaurant to be more than an afterthought.\n\nService was choppy, but very friendly.  Seems like they are still working out that part.\n\nLooking forward to our next visit.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-04", "description": "Food is ok, but billing is mess. They charge 18% gratuity even for 2 people and do not give proper bill.", "author": "Chandra K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-11", "description": "I FOUND A PIECE OF METAL IN MY TIKKA MASALA!\nI went to Masala Dosa right when it opened and had a great experience. Then, a few weeks later, I ordered take-out and as I was eating my chicken tikka masala, I bit down on a piece of metal- a nut/bolt. I was shocked and washed it off to make sure I knew what it was. I took the food back to Dosa, and they said 'Oh, yeah. that must be from our cans back in the kitchen. I can refund you for the masala, but not for the rice or samosas because you didn't bring them back- you only brought the masala so I'll give you money back for just that.\"\nI was shocked because I could have choked and died! I also would have expected to get my full refund for a lethal meal. I HAVE gone back since (it is next door and desperate times call for...), and the food has been good since, but I am constantly investigating my food as I eat it, so that I don't get metal again. : (", "author": "Sahar D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "this is for their basmati rice. it was perfect! buttery and nicely spiced. want to try more here but the rice was just delicious", "author": "Sienna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-15", "description": "how about that...went back a week later and the place was packed! Had another great meal.", "author": "punk l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-15", "description": "Great food, great service, nice atmosphere. Very good lamb- not gristly pieces like some restaurants. I'll be back!", "author": "A. W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-25", "description": "I can't believe anyone would give this place a negative review! It's quickly becoming one of my favorite restaurants, try the tomato soup!!!", "author": "Daughter Judy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-02", "description": "Ok, I'm a north indian living in the inner sunset.  \"Oh, you must be so happy to live near such wonderful and tasty north indian places .. like Tikka Masala, and Naan 'n Curry,\" you say.  \"I would rather eat from my compost bin,\" I retort.  These places have led me to believe that all Indian food in SF is terrible and I never, ever eat Indian food in this city outside of when my mother visits.  \nWhen my 3-year old commanded me to eat at Masala Dosa today, I was understandably worried.  South Indian food?  That's harder to get right than North Indian food!\nWell, we started with Idli w/ sambar, samosas mango lassi, chai and then had a masala dosa and finished with some gulab jamun.  \nHoly crap!  This food is good!  The idli wasn't the absolute best, but the sambar was really tasty (and spicy!).  Samosas had actual flavor in the potatoes and the chutney was tasty too.  The Chai? well, a little too milky for my tastes and the refill never came, but pretty good nonetheless.  The mango lassi I didn't get to try as my 3-year old wouldn't part with it (which I take to mean it was good too).  The dosa was very good too, though the chutneys with the dosa were nowhere near as tasty as other great South Indian places in the South Bay.  Did I mention the sambar was really tasty?  Well, it was.  The gulab jamun was likewise really good.  Oh, and I took some takeout home too (paneer tikka masala) and it was pretty good too.\n\nThe service wasn't the best, but last I checked, I don't eat service.  \nI like this place so much that I am even gonna take my parents there in a couple of weeks when they visit.  You think I'm tough on Indian restaurants, you should see my mother!  I'll update this post later when their reviews are in.  \nOverall, I think this place is a much needed place for the sunset and I hope it stays in business for a while.", "author": "A G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-16", "description": "We ate there for lunch and the food was delicious. We had a potato and onion cream of wheat dosa that was fresh, well spiced and very clean and crispy with really good chutneys. We also had the chicken tikka masala which was some of the best tikka masala sauce I've had but the chicken was somewhat overcooked. That was the only criticism I have of the whole experience. Our server was friendly, prompt and came back to check on us the right number of times. It is just a tad more expensive than some other Indian restaurants in the area but it I have no problem paying an extra buck or two for this kind of quality.  Its great to have a good restaurant with unique offerings in the neighborhood.", "author": "M. B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-06", "description": "well, i decided to give it another chance after waiting 3 months\n\nthis time i walked out after sitting un-served for at least 10 min with several people running around studiously avoiding eye contact and without even acknowledging presence- they are clueless when it comes to providing decent service", "author": "S K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-30", "description": "The best customer service I've received at an Indian restaurant in the city.", "author": "N I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-15", "description": "It's really hard to find a good Indian restaurant in the city. There are other places in Fremont that are really good but too far... I happened across this place next to Cybelle's Pizza and decided to stop in for an early dinner on a Sunday. We waited to be seated for a while and were pretty close to walking out but my sticktoitiveness and straight craving for Indian kept us there. We finally got seated and ordered we had the Shrimp in a spicy sauce and the chicken vindaloo since we are not a fan of the lamb. We were loving our entrees, the shrimp were clean and easy to eat and the chicken was supposed to be spicy but it was not quite up there in heat but still moist as meat in curry is almost always dry. We ordred regular na'an and the Garlic na'an and I have to say the na'an is ok. It's very similar to just medi flat bread. I look for my na'an to be fluffy and help pick up the rice and curried meats from my plate. Ahh I think next time we'll order for pick up and just bake our Trader Joe's na'an and enjoy at home. Definitely will try this place again though...", "author": "graham c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-14", "description": "I haven't eaten at Masala Dosa yet but this review is for Masala, I hope the food is equally good with the new location and menu.  I love the food at Masala, their tandoori grill appetizer is a great way to start the meal.  We love the chicken tikka masala and palak paneer. The service is always amazing even when they deliver.", "author": "T G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-10", "description": "i am prompted to write this review after dining across the street at curry village. i dined at masala dosa about a month ago and the food was delicious, flavorful, and well-balanced. some of the best indian i have ever had. however, today i was being cheap and wanted to try the buffet at curry village across the street. big mistake!!! i will never cheat on you again masala dosa!!! even though you are a little on the pricer side, you are worth every cent.", "author": "Robbie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-20", "description": "the food is really good, very flavorful and not greasy. i'm in love with the eggplant dish. my boyfriend asked for a dish that wasnt on the menu last night and they made it for him. that's service! extra bonus - my super-picky-eater friend loved this place when she came with us one time.", "author": "Yevi A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-28", "description": "This place is very good with quality ingredients and we had good service.  It was fairly quiet when we went in and we were so happy with the gluten free options there. Unfortunately we couldnt try the naan or samosas, but the Dosas are a great substitute. We loved the chickpeas, mango lassi, and chicken tikka.  We asked for all of the dishes to be extra spicy.  If you truly like it spicy you really have to have them understand you want spice.  We did find that the food was tasty- unlike other reviewers, it didnt seem bland to us.", "author": "N A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-08", "description": "Was craving for Indian food and couldn't decide between this place and Curry Village.  Decided to try Masala Dosa and it was excellent.  It's the best chicken korma I have eaten.  If ordering to go, make sure you order before going because it takes half an hour.  Phone number in Yelp for Masala Dosa is also incorrect.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-15", "description": "I was a regular at the old restaurant that was at this location and waited a long time before trying the new place.  I was very pleasantly surprised.  The place looks great and the food was really good.  We hada pretty small dinner, but the veggie jalfrezi was super and garlic nan was perfect.  Tandori chicken was also perfect.  I miss the old place, but I'll be happy to come back to this spot.", "author": "Dennis M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-08", "description": "We went for lunch on June 3rd 2014 because we love South Indian food and have tasted it all over the world. How disappointing that this restaurant served the worst South Indian food ever. I ordered the seekh kabob dosa and my wife ordered the idli appetizer. Bogh dishes came with sambal which tasted like solid salt and was totally inedible. The idli was also too salty to eat. We told the waiter and he brought me some newly made sambal which was ok. The seekh kabob dosa was fine but not special. The  waiter never brought any freshly made sambal or idli for my wife. After waiting another half an hour we asked when her meal would be coming and were told that nothing was coming. She had never been told they were not preparing something for her or asked if she wanted to order something else. So after being in the restaurant for over a hour, we left. The waiter did not seem to understand that someone sitting there with no food was not ok.", "author": "Suzanne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-10", "description": "A Indian friend just back in town wanted to get together over lunch, and her first choice was Masala, which led to a little confusion, since while she was away the owners  had shut down the original Masala to concentrate on this one. But all is well.  The new place is uphill and upscale.  The old one had a crowded dining room and a patio nobody seemed to use; this version has a spacious and elegant room.  If Curry Village across the way is for large hungry groups, Masala Dosa is a date night restaurant, where you would not feel out of place in a suit or cocktail dress (though they don't serve alcohol).  Not that they have an actual dress code, with Craigslist next door that would not be a good idea, since the scruffy Indian guy next to you is probably a software engineer if not a UCSF med student.  And they happily seated two women in the window.  OK, the food.  Said friend is from Kerala, makes great dosas herself, and considers the food here both tops and authentic.  The dosas are like crepes or a wrap, with various meat or veggie fillings.  The uttapams are made from the same chickpea/rice flour base (gluten-free), but with the fillings baked on top - some people call them an Indian pizza, but don't mistake that for anything like what a couple of Sunset restaurants serve as \"Indian Pizza\".  There are also various biryani and curry dishes, plus appetizers such as iddly, which looks like a large marshmellow, and which is used like a chip for dipping.  I really like the chicken biryani, and am disappointed that one dish to have disappeared is the veggie Kashmiri Biryani, with dried fruits & nuts.  But it was North Indian, so it didn't make the cut.  As with most Indian restaurants, desserts are not much. Sometime maybe I'll order a plain dosa with the mango ice cream and see how that goes as a dessert crepe.  The chai is made fresh by the cup, and with a strong ginger flavor.  It was an enjoyable meal as always, and we will both be back.", "author": "Pat L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-31", "description": "Great spot!! The food is well done and the service is excellent- a little neighborhood gem. I had Salmon Tandoori, which was my favorite and prawn vindaloo. Next time I am going for the lamb, but was with a non lamb eater so I will save it for my next visit. I have eaten at a few Indian places in SF and this is my go to from now on. Be advised, they don't have a liquor license, but bring your own and all is well.", "author": "Sara W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-04", "description": "We had delicious dinner!  Cauliflower pakora, papadum, garlic naan, samosas,  tandori chicken and Palak paneer.  Everything was great!  Even our seven year old liked it!  She liked the mango lassie!  I tried both Indian wines and they were good.  Nice neighborhood!  You should go!", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-03", "description": "They've really classed up the joint! Nice new decor, and 2 lovely seats right in the window so you can people watch while you enjoy your tasty meal. The owners and their staff are super friendly and are really looking to please, especially since this is a new venture for them. They also currently own Masala down the street, but apparently this menu has much more of a South Indian flavor to it, so I think they're trying out a lot of different recipes than they offered at Masala. I'm a novice to Indian food, but I was excited to see that the first few dosas on the menu are gluten-free- which unfortunately is now  my diet. I had the Masala Dosa and it was fantastic! I'll definitely be going back, and crossing my fingers that the window seat is open again.", "author": "Brandi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-04", "description": "ordered the onion naan, samosas, and chicken tikki masala. everything was kind of disappointing except the masala.  free delivery tho and fast", "author": "Lúcia C."}
