{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "Super cute cafe in San Fran that I stumbled upon. The space is a little tight for seating or waiting on to go orders which is my only complaint. Otherwise the food looked delicious - avocado bagel sandwiches, and I ordered a latte which was delicious and the perfect temperature. A small was $4+ which is a little pricey given the size. \n\nAlso OMG their homemade pop tarts are a must.", "author": "Tari O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-15", "description": "Nothing has changed. Service still sucks. Hipsters still working slow, but at least their herb is legal now.\n\nIt would be great if they had a bigger bagel selection and could pay attention when I ask for my order to go.", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-22", "description": "I really like this place, the food, coffee/tea, ambience and people are all dandy.\n\nHowever, the internet is so slow to the point of almost not being able to load web pages. In this day and age this is really ridiculous. I like to come here and work but can't since the internet is soooo slow!\n\nPLEASE GET FASTER INTERNET :)", "author": "B r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "First-time visit & find the interior very cool.\n-Ordered yogurt w/ granola & fruits + honey drizzles. Tastes great. \n-Fast internet & great place for work\n-Very limited seating though, I could not find a set\n-Parking was also not easy to find. \n-Cute decor & plants\n-Food is a bit pricey but good quality.", "author": "Jess W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-14", "description": "Without a doubt one of the worst experiences I've had at a coffee shop. \n\nWent with my wife this past Sunday morning. We got in line behind a man and his daughter who appeared to know the woman working the counter as they had a long conversation in Hebrew as he ordered. \n\nAfter they ordered and walked away, the woman behind the counter stood there for a good three minutes waving and making faces at the child who was now sitting at a table just outside of the cafe. Meanwhile, a line had formed behind me that went all of the way out of the door and onto the sidewalk. Yet she continued to make faces at the child. Eventually, she took a cookie out from a jar and walked it to the child before coming back inside (by now there were approximately 15 people in line behind me). \n\nWhen she got to the counter, she looked at me and said \"what?\"\n\nNo \"hello\". No \"good morning\". No \"what would you like to order?\" Just \"What?\" as though I was annoying her by being there. \n\nI ordered a latte and a buttered bagel, my wife ordered a latte and asked the woman whether or not she could get a bagel with avocado. The woman responded \"It's on the menu, you can read it\" Yes, we had the menu with us and it was confusing as to whether or not it was an option so my wife sought clarification only to receive a condescending response.\n\nI cannot remember the last time someone was so rude to us at a coffee shop, restaurant or any service industry position. It was mind blowing. It felt like she had a grudge against us for something but we had never been here before and had never seen this woman before. \n\nBeyond unacceptable way to treat customers. If I could give zero stars, I would. \n\nFinally, after being second in line only to wait over 15 minutes we had finally placed our order only to wait another 15-20 minutes for them to make two simple bagels!  \n\nAs if that wasn't bad enough, the coffee was average at best, and the bagels were stale.", "author": "James A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "Really cute coffee shop. I love the patio seating and the hip interior. The service was also good. \n\nI ordered a soy cap (see in photo how it looks like a latte?) and it was very good! However, after getting through the first layer of foam, I was sad to see that there was only an inch of foam in my cappuccino, thus making it a latte. Regardless, it was really solid. \n\nMy cousin ordered granola and it looked very good as well. I'm allergic to bananas so I didn't take a nibble but the portion was nice. \n\nLots of people in this cafe working and reading so it's a bit tough to find a spot during their peak hours.", "author": "Steph G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "The Apple & Brie sandwich was simply made, but really tasty! A baguette with slices of apples and brie with arugula and honey! Great combo of flavors. Good for a light meal or heavy snack. \n\nPretty comfortable little spot, with both inside seating and outside.\n\nDidn't try their coffee, so no comment on that.", "author": "Marc B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-13", "description": "Don't be fooled by their homemade poptarts.\n\nThe price for one is costly and um...do you see the raspberry filling?\n\nYeah, neither did I. I just tasted dry crust and they said to keep eating until I got to the middle. \n\nUm, here's a picture of the middle. Where's the filling?\n\nAverage coffee but disappointing poptart, but since I want to support local businesses I'll give this 3 stars instead of two.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "I decided to take a walk through my neighborhood and after an hours stroll started feeling thirsty and hungry. This spot was quiet and looked decent enough so I grabbed a menu and ordered the salami panini. I paid and warmed a seat by the window while I waited. Then the cashier announced they were out of salami. Slightly bummed but an easy fix since I already had a second choice in mind... the apple and brie panini. \n\nMoments later a plate with a good looking panini was placed in front of me. I assumed the panini would taste as good as it looked and I was correct. The bread was crisply toasted without being so hard that it shaves the inside of your mouth. The brie was delectable and they gave a generous ratio of brie to apple and arugula. The honey sweetness on top made this a 5 star package because every bite got increasingly better. I would love to make this at home!\n\nAside from the 5 star panini, I also liked the staff and overall feel of the venue. It's a small establishment but comfortable and the staff made it more relaxing with polite chat. I noticed the male cashier initiated conversation with every customer and everyone ordering looked so happy during their stay and upon leaving. I don't think he was the owner (he seemed a bit too young) but he seemed to have a genuine like for his job which made my experience there better. \n\nI already know I'm bringing my friends here again soon and will be ordering the brie apple panini again and again.", "author": "Kristy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "Cozy neighborhood cadre with free WiFi and wonderful expresso.  Easy street parking on MacAllister and lots of tables inside and out.\nFriendly staff.  Nice place to work in peace or enjoy coffee with friends.\n\nHighly recommended", "author": "Richard D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Had my usual (espresso) macchiato (how I compare coffee places). A beautiful roast that didn't get acidic as it sat for the two hours I sipped it. Would come again, for the chill and nice working environment.", "author": "Kimberlee G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-24", "description": "I went here to do a little bit of work. I ordered a cappuccino but while I was waiting for them to make it I realized that my laptop was dead and needed a charge..... but they have zero outlets. Well, actually, they have a couple outlets but they block them up so you can't use them. I didn't try a sip of the cappuccino because I needed to get work done so I left to find another cafe with outlets. I did eat a chocolate croissant while I waited, and it was similar to what you would get at Peet's or Starbucks, except they didn't offer to heat it up. One star for sunshine.", "author": "Maria G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "Stopped by for a quick coffee on a Sunday morning. No real line at around 10:30 in the morning, which was a pleasant surprise. \n\nOrdered a flat white and waited 5-10 minutes for it to be made. Flat white was exactly as I like it.\n\nOverall, a great spot with quick service, cute decor and reasonable prices.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "Super cute spot. Perfect for studying in the mornings. The chai is really good and their homemade pop tarts are worth it.", "author": "Hannah W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-13", "description": "I'm confused about this place! It's on a cute street corner in a cute and more quiet neighborhood. The inside gets great lighting and there's outdoor seating too.\n\nI got the Kenyan pourover but it just tasted too watered down. I would hesitate to get anything here again bc of how bad the coffee was. But the place is so cute I want to like it!", "author": "Jeanie N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-17", "description": "Seems to be run by hipster zombies, consistently. Weird. The pop-tarts from Black Jet Bakery are tasty. Else, meh.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "Cute coffee shop with food and great drink options! I love that it's really easy to get to from my bus route (5). They do have free wifi, but I found that it was slow. I only wish they had more seating because it does fill up really fast, but they did cram as much seating they could given the small space.", "author": "Erica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "I love this place because of the comfy, airy eclectic atmosphere, the lovely people, and of course the fresh coffee that fuels me at 7:15am on a Tuesday morning. I've yet to try any of the food, but it looks wonderful. Matching Half is the antedote to your pretentious laptop lounge. Samara(see photo) is my morning HERO!", "author": "Reuben K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "Delicious lattes and homemade pastries coupled with a beautiful interior make for a great spot for a coffee date! \n\nCame here with a close friend and we both had a latte served in their cool ceramic mugs. We shared the nutella and black cherry puff pastry pop tarts- would recommend both of these! The baristas were friendly, and the noise level was at a comfortable level. Also saw people with laptops, so doing some light work here is also possible. \n\nOverall, a great place to catch up with a friend/hold a casual meeting at! Will be back when I'm in the city!", "author": "Robin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Nice local spot to come by and have a cup of coffee in the morning. They have seating inside and also outside so you can enjoy the nice weather if you prefer. They also serve beer and wine, so after work if I want to have an alcoholic drink, I can come by and get a cup, which is nice. Coffee and beer all at one place, what else do you need??", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Lovely neighborhood cafe for lattes, cappuccinos, coffee or tea. They make their pastries fresh, and you can order sandwiches too! I tend to keep it simple whenever I visit, and I've never had a bad experience. It's not very large inside, but there's ample seating. If you're taking a stroll with your pet there's always the option of outdoor seating.", "author": "Ali R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "Great cappuccino. Comfortable atmosphere. If you don't want to wait in line for The Mill but want great coffee and a spot to read or talk with someone, come here! Didn't try the food but I'd like to next time :)", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-12", "description": "Too small of a Café for as big of a crowd as they get always running out of inventory after long lines it would be nice if staff advised that they were out of items before you got to the counter after waiting a long time", "author": "Dustin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-23", "description": "Coffee was good but did not realized a Machiatto comes in such a tiny shot. But they was my fault; I should've known. Down it real quick before my hiking trip and it definitely kept me wide awake. \n\nThe bagel with butter was toasted to perfection! Also had a raspberry pop tart and that was really good too. \n\nThis place is super cute and adorable.", "author": "Caitlin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "Hands-down, best soy latté I've...ever had.\nVery friendly barista/cashier. \nFast service. \nQuiet/cozy.", "author": "Grace W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-29", "description": "I've been here many many times over the several years. Service is always nice enough. \n\nI've never received a HOT cappuccino or latte EVEN when requesting extra hot. On at least a half dozen visits, I have to microwave my expresso drinks to make them actually hot. So if you love great tasting luke warm lattes and cappuccinos then this is your place. \n\nThat is all.", "author": "L D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-09", "description": "A small cornerfront venue packed with people working on laptops out of whatever table space they have, Matching Half is nevertheless a dependable neighborhood cafe offering inexpensive drinks and a limited food menu as well.\n\nIf you're into camping out here to do some work, you'll have to jockey for table space, let alone a power outlet. If you're bundled up in enough layers and have enough juice in your laptop or tablet, the outside tables are a better option to get some people watching in, alongside your \"work.\"  \n\nService is fast and efficient, and again this isn't a bad neighborhood venue. Not necessarily worth a special trip, though.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-18", "description": "Food is good, if a bit pricey, and the service is friendly.  Not a great place to work as they play loud, distracting music (despite asking them to turn it down several times), their wi-fi is painfully slow and takes minutes to load a single page, and no outlets for charging. Wish they would make it more work-friendly considering the majority of the people who come here are looking for a quiet place to work.", "author": "Sasha D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "It's a cozy place, and beverages are nice. Especially their coffee is good because of using Sightglass's beans. However, their WiFi is so slow. Therefore, I think if you want to use a laptop there, I can't recommend there.", "author": "Yumiko H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "With easy going staff and cute decor, this place is great to hang out and get work done. They have delicious coffee - serving up andytown roasters finest and to your liking! They have alcoholic dranksss and a couple options on tap. The food is fresh but is a bit pricy. They have a lot of seating and lovely music. \n\nThe reason why I docked off a star was because their WiFi IS THE WORST! Seriously, it feels like I'm using AOL dial up from the 90s in this place. Also, there is no WiFi password, so there's a chance a guy in the apartment next door is stealing all your information. Butttt if you're looking for a place to catch up with a friend or read/write, this is the place for you.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-29", "description": "A sunny morning, but it's ruined by the server with attitude, dressed up with dark red dress and earrings. I'm not sure if she's being discriminate to a Chinese. She's rude, unprofessional, ruining the brand and the reputation of this cafe.", "author": "Annie Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-25", "description": "I've never understood this place but it's in my neighborhood. This past visit, it took over 10 minutes to even order and there were only 3 people in front of me. Then I waited an additional TWENTY minutes for two bagels and cream cheese to-go.\n\n...They literally operate their \"kitchen\" from a toaster oven and panini press. They nuke their eggs in a microwave for those breakfast sandwiches. It's almost entertaining to watch them try to cook ham in a toaster oven...Until you've been watching for 20 minutes.\n\nIf there's been enough time for me to write this review, you've taken way too long. Will not be back.", "author": "Chanel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "A great medium-sized hideaway cafe in a residential neighborhood away from the main street craziness.  Love the vibe of this place...chill background music great for working/reading/hanging out; a mix of bar, individual table, and booth seating; a simple yet unique interior design that gives it a cozy eclectic feel.\n\nEats and libations...\n- Sightglass coffee\n- Fair selection of breakfast/lunch items\n- Beer/Wine selections for later in the evening\n\nParking...much easier than other locations, with 2hr and 4hr street parking.\nAdded perk...close-by stops for those of you with a sweets/carb-loving tooth like me include Mills Bakery and Chile Pies Baking Co.  #winnerwinnerchickendinner\n\nDefinitely a top spot for me in this neighborhood :)", "author": "Mon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "This place is so cute! It's my favorite coffee shop in NoPA - very reminiscent of European cafés \n\nA great quality I love about Matching Half is they serve all of their coffee in ceramics handmade by the owner :) \n\nP.S. Great balance of milk to espresso in their macchiatos", "author": "Judith P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-24", "description": "Good chai latte but the girl who made the drinks was unfriendly. We said we were taking our drinks to go. They gave my fiancé his coffee in a to-go cup but had mine in a glass cup. So I asked her if I can have mine in a to-go cup and she gave me a dirty look like it was my fault. First time and probably last time here.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-20", "description": "Cool little cafe in NOPA. \n\nI don't drink coffee, but the tea was good. I also got a bacon and avocado sandwich on an everything bagel here for under $6, which is pretty unheard of in SF.\n\nThe service was a little slow, but I'm an impatient east coaster. \n\nOverall, good prices and good vibes.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Nestled in Lower Haight, this coffee shop has really great cold brew. They also have other espresso drinks that are top-notch. My only reservation is that it gets particularly crowded on weekends, so this is not necessarily the best place to do work.", "author": "Edson M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "My new usual! I've met up with friends here, made it a study spot and also grabbed coffee on the go. The food and coffee is amazing and the customer service is too! I love the feel of the place and how welcoming it is. Highly recommend it!", "author": "Emily H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-05", "description": "This place can never seem to get it right. I'd say I don't know why I keep going back except that it's next to my bus stop so when I'm in a rush in the morning and haven't had a chance to make breakfast, it's the easiest option. First time I ordered the breakfast sandwich with avocado on brioche and they made the order correctly. It just tasted so bland. I added a ton of salt and pepper and it became okay-ish. The homemade pop tart was also pretty tasteless and lacked filling. Next time I order the same thing and somehow end up with a blend of the veggie bagel and breakfast sandwich. It's a hard stale bagel with an egg and a slice of avocado on it. What? Didn't even add cheese. Next time they straight up put ham on it instead of avocado. I just don't understand what's so hard about it when there are only about six items on the food menu. This doesn't happen to me anywhere else.. In summary: Drinks were okay, food is bland, order is usually wrong.", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Loved the yogurt and granola. So fresh. Jasmine loose leads tea was unbelievably perfect. Wishing my Russian bf were with me", "author": "Cherry J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-27", "description": "Good coffee, solid service, good atmosphere, but I really wasn't feeling the music. Not a very chill playlist so it was a little difficult to get some work done. Lots of rock - which I am sure many people enjoy but it just wasnt for me.", "author": "Mariam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "Nice coffee shop in the center of NOPA. we love to come by and sit here for a cup of coffee in the weekends. The food sometimes takes longer to be ready.", "author": "Gali S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-04", "description": "I've had this cafe bookmarked for months now, and I have a friend who frequents this establishment so I decided to join him one afternoon. It has a laid-back feeling to it. Kinda cute. There's coffee and food, so it would be ideal to camp out for a few hours and get some work done. Originally I found Matching Half Cafe on a list of coffeeshops ideal for people working remotely.\n\nFor a place that's good for remote workers, it was frustrating that all of the outlets along the back wall didn't work. Strange. I do like that Matching Half is multipurpose with its coffee service during the day and eventual availability of wine and beer. I wouldn't feel too compelled to come back here but would be open to another spontaneous rendezvous with my friend.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Great coffe and fresh croisant. Also ordered a delicious breakfast sandwich. Excellent service!", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-08", "description": "So I happened to stumble across this cafe on an eater list as a good place to study and bring your laptop .. however all their power outlets don't work and it is a VERY small place that only fits a small communal table in the back and several small 2-person tables along the window, some in the aisle, and bar seating available.\n\nAside the fact that it's a small cafe and I wouldn't recommend to study or spend a large amount of time here, I think it's cool that they're more of a local cafe by the panhandle and serve a variety of beverages from coffee, wine, and draft beer on tap! My boyfriend and I came here to do some studying and get work done but I felt a little uncomfortable and squished knowing I couldn't spread out all my study equipment around me like I'm used to doing. I got their white peony tea and he got a breakfast sandwich & coffee with bacon that looked and smelled really good. My tea came in a little cute teapot and they also came around to refill my water! Even with the small space around us, we did manage to get what we wanted to done and he even got a glass of wine later.\n\nParking here isn't too bad to find as all the blocks are pretty much street parking. The interior of the cafe is nice and cute; they have two living mini walls and they have textured walls with some hip patterned wallpaper.", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-29", "description": "Wow, I've been here before and had a decent lunch, but breakfast here this morning was just awful. \n\nI ordered an iced coffee, bagel with cream cheese and breakfast sandwich to go....it took literally 20 minutes. The coffee was a tiny 12oz portion and not even filled to top of the cup. The bagel had barely any cream cheese, which is absurd considering the cream cheese cost $2 by itself. (And when a NY Jew accuses you of skimping, you know you're doing it wrong.) Finally the $8 breakfast sandwich: microwaved rubbery eggs, barely any cheese or avocado. Did I mention the service was terrible--no apology for the wait, no napkins given with this \"to go\" order; everyone was still half asleep and it was 9:15AM. If I wanted a breakfast this shitty I could have gone to McDonalds and saved $10. This place should step up its game or it will be losing more customers like me.", "author": "Rachel E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-30", "description": "I kept passing by this place and never stopped. Now it shall be my new fuel stop after a morning run to carry me over my final SF hill on the route to home. \nIt's a cute tiny neighborhood cafe where you can work on your laptop while enjoying a quick bite & coffee. It has a hipster vibe. \nThey have limited outdoor seating, imagine would be nice on a sunny day. Visited on a lazy sunday afternoon. It was not crowded and we were able to find a table for 4. Heard from a friend who frequents this place that Saturday mornings there is quite a line for breakfast.", "author": "Suna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "Shoutout to Matching Half Cafe for quality caffeine, snacks, food, alcohol and ambiance. I'm a customer for 5 years for quick drinks to go, catching up with friends and doing work. Always nice to get out of the house and hit them up, where it feels like a home away from home.", "author": "Alexander M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "Classic neighborhood joint with great sandwiches  nice people, great outdoor seating if sunny.  The Apple and Brie sandy is awesome. Also great breakfast sandys.", "author": "Nick A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "Great little coffee place- free wifi, outside seating but currently under renovations. A little over priced on food- but tastes good. Breakfast sandwich on a croissant like bread with egg, cheddar and choice of avocado of meat. I chose avocado because those bad boys are expensive to get these days.", "author": "Leslie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "It was worth the hike. Unassuming, neighborhood cafe with excellent coffee and food. Friendly service!", "author": "Ebru C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Cute local cafe, decent coffee, good sandwiches, great decor, free Wi-Fi. Only problem is that it got uncomfortably warm to sit there on a sunny day. An awning or umbrellas on the Baker Street side would help a lot to make it more comfortable.", "author": "Em D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "While the macchiato I ordered was more milk-heavy than I think a classic macchiato is generally made, I thought it was great and didn't mind that surprise. If you like very little milk I'd recommend specifying that, but i had no complaints because this one was so good, and the steaming was expert. \n\nI also picked up a homemade jalapeño pop tart which was delicious. \n\nMy only complaint about this place might be that it was full of people on laptops - not sure if they offer wifi but it looked like it, and I'm becoming more and more partial to cafes that don't provide internet access.", "author": "Adrienne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "My boyfriend and I were on our way to the Japanese Tea Garden and decided to stop by and try their chai latte. Let me just say, that was the best chai latte I've ever had. I also had a very tasty peach pop tart. The wait is a bit long but we'll worth it!", "author": "Sandra R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Overpriced but I love it. Yummy Chai Latte, great sandwiches, tasty salads, and a good place to sit and read or do work.", "author": "Lana B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-28", "description": "This review is only for their breakfast sandwich which is ham (substitute for bacon for 50 cents more), cheddar, and egg. The sandwich was fine/tasty enough; three stars though because it was a relatively small sandwich and a \"just fine\" sandwich, at a fancy price of $7.50. I liked their outdoor seating and location, being off the main Divisadero strip.", "author": "Will H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "Chill atmosphere, good coffee/bites, good tunes..which is why people seem to campout here I guess. Certain times you won't get a seat inside but if you can, it's a nice place.", "author": "Juli C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "Excellently executed espresso, and coffee. They have both indoor and outdoor seating and also serve wine and beer.", "author": "Callum B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "Matching Half is a go-to in the NoPa neighborhood. It sits just close enough to the panhandle of GGP to snag a cup and take a morning stroll. One of their best offerings are the homemade pop tarts. Get here early to snag your favorite flavor like Nutella! The staff is friendly and cheerful even when you show up at exactly 7AM when they open. Also check out their spin on oatmeal cream pies. PS their pastries are delivered fresh every morning from Black Jet :)", "author": "Natalie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "Great friendly coffee and breakfast place not far from USF. They make really good breakfast sandwich and serve a variety of different coffees.", "author": "Hank M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "I am always sad to leave San Francisco, but at least I found a great coffee shop to warmup while I pack my bags. Matching Half located in NOPA has deep fried pop-tarts, a great tea and coffee selection and bubbles as well! They have indoor and outdoor seating which makes it convenient to find a spot to sit! I came back to this spot twice it's so good. I remember since I was little that the coffee shop preceding Matching Half was not so successful, but I think since my neighborhood demographic is changing with techies and students, this makes it a great space to work or blog.", "author": "Cecily B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-20", "description": "Matching Half Cafe has exactly two things going for it:  (1) the beautiful building and (2) the cute sign.  It's also situated interestingly on a hill and has decent outdoor tables, but I said two things and I'm sticking with two things.\n\nEverything else about this place is annoying.  It's expensive.  Food takes forever to come out.  Portions are anorexic-model-in-training meager.  It's frequented by all the annoying people who have moved into my neighborhood in the past five years.  It's uncomfortable inside.\n\nIt reminds me a lot, in fact, of One World Cafe, which it replaced, in a way.  But whereas One World Cafe was merely disappointing, Matching Half Cafe is disappointing, annoying, and pretentious--and that's a pretty good description of how my neighborhood has gotten worse since 2011.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-23", "description": "Mannn, I have such mixed feelings about this place. Here's a quick breakdown:\n\nPROS\n-Great food, great coffee, AWESOME baked goods\n-Nice vibe, lots of natural sunlight\n-Friendly staff \n-Very clean and pleasant bathroom\n-Outdoor seating available\n-Right on the 5 bus line\n-ALCOHOL (wines and beers)\n\nCONS\n-No power sources\n-Long wait times\n-Limited seating area\n\nEssentially, this place is fabulous as a spot to get a jammin cup of java and to enjoy a pleasant breakfast, brunch, or lunch with a friend. The food is great, vibe is chill, and the overall quality of the establishment is great if you can get past the fact that the friendly staff just kinda take a while to get orders out. \n\nThis is a BAD place if you want to camp out to get a bunch of work done with your computer. Yes, there are outlets. No, they're not going to charge your electronics.They turned off the power sources for a reason. I can understand this from a business perspective. They don't want you camping out for 10 hours taking away precious table space. They want to flip those tables and keep the money coming in to stay in business. I get it. I can't hold that against them. \n\nI do have to say that my Lox bagel did take a good 15-20 minutes and it was not extremely busy. But then some other people around me got their food within 5 minutes of ordering, so it's not like ALL of their orders come out super late. Just keep timing in mind if you're in a rush.\n\nOverall, I'd definitely come back to this place for a light meal/date with a friend, but definitely not to get work done unless I'm going all paper.", "author": "Cara O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-31", "description": "My brother and I met up here for lunch today and it was an excellent spot to spend a couple hours eating lunch, having a beer, and then enjoying coffee while watching people pass by outside. The space is a little tight for the lunchtime surge, but the fact that it surges is its own signal! \n\nI had a turkey sandwich with avocado and tasty chips on the side, and washed it down with a pilsner. My brother had a regular coffee, which he reported as very acidic, but my double espresso cappuccino was perfect.", "author": "Robert V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-20", "description": "The matching half cafe. Went there with some people and tried the grilled cheese, turkey and Jack sandwich, and the salami baguette. I wish I could give this more stars but it was just a little pricey, with a drink the meal would be $15 easily.\n\nThe sandwiches were good but the grilled cheese was definitely way too oily for my taste. The turkey jack sandwich is fit for two people while the salami is fit for a child.\n\nSeems to be a local favorite, there were lots of hipsters and students lounging around.", "author": "Amanda W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "Super cute cafe with tables lined up next to the windows for lots of light. Quiet neighborhood with low traffic and not much street noise. They have a serious cookie collection and homemade poptarts (nutella??? dayum!!). I like the old skool ice-cream-parlor countertop seating, and there are lovely stained glass windows that filter in blue light. Tea/coffee + a pastry will run you $5 - $7. They have the requisite milk-ish options: skim, almond, soy. Downsides are that the seating is limited, there aren't any (working) outlets if you want to plug in, and the wait can be long if you come at the wrong time. Oh, and if it's cold and rainy they won't close the door because \"the windows fog,\" so bring a coat. Otherwise - customer service is friendly and intimate, coffee/tea selections are top notch, and it's a lovely place to sit and work if you've got an hour to spare.", "author": "Ray J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-28", "description": "Cute hipster coffee shop. I enjoyed the coffee, but it took a long time when I went on a Saturday morning. Like a really long time it felt like.", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "Fun little coffee shop in the neighborhood. Great selection of coffee with good bites and wine.\nBaristas are really friendly and good enough space to sit and do your work. I was here for 3 hours and got a lot of work done. Not noisy at all.", "author": "Sailaja B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-15", "description": "Really nice space and community cafe. Unfortunately the people who work there are NOT friendly at all. Really doesn't feel like you are welcome or that they appreciate your business. I have also been there 3 times and have had a similar experience every time. Cold brew was very weak as well. Bummer because I had high hopes :(", "author": "Ben G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "Wonderful coffee and service.  A bit of a long line at times but moves along smoothly.", "author": "Gregory H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "Want to find the geographical center of the city?  Apparently, if you come here, you're there.  \n\nThis is my neighborhood cafe, so I may be a little bias, but I love Matching Half.  Unlike other reviewers, I only have the occasional problem with the wifi and if you ask the baristas, they are more than happy to give you tips to improve your signal (like walking towards the door to grab the signal before sitting at that back table).\n\nI usually get a pot of tea and work.  Their tea is good, but they always leave the leaves in, which will make the tea too bitter.  Easy fix by tossing them out after a few minutes.  They're much more focused on coffee, but I never drink the stuff so I can't comment on that either.\n\nBut if you're looking for a nice quite cafe to get some work done in the literal heart of the city, this is it.", "author": "Jessica A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-05", "description": "I used to love this place. \nNow it looks like it is becoming one of this pretentious cafe. People there used to be friendly and paying attention to customers, now it looks like nobody cares, they make you wait for ever etc.... Very disappointing\nAlso, same problems that have been existing for a while (read your reviews!!) : no power outlets and VERY BAD wifi. Like, if you offer wifi, offer a descent connection or don't offer it at all. Somewhere in the middle is just making your customers frustrated.", "author": "Marion P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "Okay - loveeeeee this cafe!\n\nDelicious lattes.\nYummy breakfast sandwiches.\nAwesome vibe.\n\nAnd.......GREAT customer service.  Like when you're treated like a regular, but you're not.\n\nRandom story:  Was killing time here waiting for a ride.  Store was closing.  I was worried bc I had just gotten my hair done at a salon across the street, and it was raining.  Asked if I could wait in here.  Said yes and offered me a free muffin.  What?\n\nLove love love.\n\n:)", "author": "Ruchi P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "okay coffee with reasonable price. great place to study. food was ok too. the shop itself is very cozy and has wifi. there is no plug so make sure your laptop is charged!", "author": "Helia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "Neighborhood gem. Great coffee & breakfast or lunch. I found the service to be fine and I was there on a weekend morning. The coffee was really good, and yeah it did seem a little stronger, I like my caffeine buzz!!  Had a homemade jalapeno poptart, it was so flakey and good, yum yum. A nice little seating area outside. A great place!", "author": "Karen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-04", "description": "Matching Half Cafe is thebomb.com!\n\nI discovered the cafe a few years back when I was living in the Haight. I used to stop in with a good book and order a nice cup of tea or a kale salad. Last week I had the chance to return after one of my close friends moved to the neighborhood. We were walking to Divisidero when I took a detour to show her some other local businesses. That's when we wandered in! \n\nIt's a quite space with nice artwork and a killer playlist (very important). They sell a variety of coffee, tea, wine, and food. We just ordered drinks, but the food that I've had in the past has been very good. Staff is friendly and they have wifi. My friend also loved it and I know she's stoked to have such a nice spot so close to her apartment!", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-29", "description": "Come here if you have nowhere to be. If you don't mind waiting over 20 minutes for a basic breakfast sandwich, this place is for you!\nI wouldn't mind waiting that long if there was someone actually cooking my eggs, but when it's a dude making them in a microwave, my patience starts to wear out. \nI'm sure the person who made my sandwich is nice and all, I just wish I would've seen a little more hustle from him. \n\nFor a mediocre sandwich, I didn't think the wait was worth it.", "author": "Danny H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-21", "description": "Mediocre. The food is nothing to write home about. Coffee and such is just about the same as every other place. If you live near here this is a nice spot. But I wouldn't go out of my way to visit or bring people here saying, \"ya gotta try this!\". It's a small space and the line is often too long. Would not come here for a quick caffeine fix. Best to only visit during non peak business hours. Staff always seems pleasant.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-08", "description": "It's my favour neighborhood cafe! Nice vibes, good coffee and the home style decor just made me productive while staying there! My favors combo are the cafe latte and the breakfast sandwich. One thing though,they are a bit pricey , $2.75 for a coffee and around$7 for the breakfast sandiwch, so if you plan to have a big breakfast, come with friends to split even the costs. They are also busy during the morning but the wait isn't crazy at all.  A very nice corner cafe!", "author": "Yuki J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "High end coffee and lattes set the bar for this modern cafe. There are a few outlets at the group table for those looking to camp out and get some work done. But I really love sitting at one of the outdoor tables nicely shaded from the morning sun that bakes many of the other local cafes. The cherry muffins are also great and bagels come from the House of Bagels one of my favorite local bagel shops.", "author": "David A R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-21", "description": "In line at Matching Half, once again marveling at the comically slow pace at which the whole place operates. The coffee is very good, as is the food, but be prepared to wait ~10 min for a cup of to-go drip coffee and about a half hour for anything else.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-03", "description": "Oh this place soothed my soul just right, a perfect wide windowed stone and wood space with beautiful, warm delicate Sight Glass coffee and a few taps of SF beer, Magnolia and Sudwork, and simple, fresh tasty food. Non-snobby staff who chatted easily with each person who came in no matter how third wave savvy their coffee order. Behind the counter they talked excitedly about ideas for future dishes and events.\n\nThis cafe is a short walk from the Haight in a cool, residential area with a few other bars and shops, but none of the touristy bustle. Maybe it was because the sun came out and the fog burned off while I was here but this was the moment I began to feel like SF was a place I could love and live in. I get bummed and freaked here sometimes by the heartbreaking poverty and nauseating gulf between rich and poor, but that's when I have spent too long in the financial or touristy sectors. Getting out to a real neighbourhood where food and drink are served with a love for local and a quiet mellow sunny rhythm heals all, always.", "author": "Risa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-08", "description": "Perfect place for working! Good coffee and sandwiches! \nThe place is very quiet and peaceful...", "author": "Hagit S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-18", "description": "Lack of plugs. Lackluster service. Crap coffee and a cold brew that is more like a sludge of coffee (you are supposed to strain out the coffee grounds). 0.45 Mbps down and 0.15 Mbps up... Two stars is because the food is good but made without gloved hands.", "author": "Mischa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-26", "description": "The cafe that's literally across the street.\n\nService is slow, and delivers on quality. \n\nThe seating area is pleasant. On the inside, broad windows stream in daylight, and provide a grand view of the neighborhood. On the outside on a nice day, this particular corner of McAllister and Baker gets some nice sunlight.", "author": "Michelle J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "Great coffee, great food, small space.  A victim of its own popularity, the biggest issue is finding a seat to enjoy your meal.", "author": "Irwin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-08", "description": "This coffee shop is perfect for so many occasions - study spot, coffee run, Sunday morning recovery food. Their breakfast sandwiches are so freaking good, especially the delicious buttery crunch from the brioche bun. I've tried their sandwiches which were all right but nothing compares to their breakfast sandwiches! No morning routine is complete without one of those :)", "author": "Jingxi Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-09", "description": "Laptop camper here. This charming café in a Victorian building is the hipster hangout in this part of town. The food and coffee (Sightglass) are a step above the normal coffeehouse fare. There's something homey and cute about the place. I like the stained glass windows, the wood floors, the wood counters, wood chairs and plants. \n\nThe bagel sandwiches looked hearty and delicious. They also have baguette sandwiches and pastries, including Black Jet Baking pop tarts. Wine and beer are available.\n\n* Yogurt parfait http://www.yelp.com/biz_photos/matching-half-caf%C3%A9-san-francisco-3?userid=NOUfyJW-BAo_-Cbfo8edww#GaZE94jTbvqN3C4tcjifOw: Very nice, made with Straus organic plain yogurt, fresh fruit, 18 Rabbits granola, walnuts, and a drizzle of honey. \n\nThe wi-fi is free, fast and secure. Campers, it's a noisy place with tables that are too close together and there's only one outlet. There are some communal tables, outdoor seating and counter seating.\n\nYou know you love me. X0 X0, laptop camper.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "Loved it! Friendly staff, delicious coffee, yummy food! A little on the pricey side but hey, this is San Francisco.", "author": "Nishant G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "I used to come here a little too often when I went to USF.   I always order the Tomato Basil Panini and it NEVER disappoints.  The place is small but it's what makes this cafe a little bit more \"SF\".  I only give it one less star because of amount of time it takes for them to prepare the food and also because it can be a little pricey.  Nonetheless,  I intend to return many more times.", "author": "Avni P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "When I moved to my new neighborhood, I was afraid that I would be leaving my old coffee shop without a replacement. I'm so happy that Matching Half is around because yay! now I have a replacement. \n\nThe coffee is good, the sandwiches are delicious and piping hot (and I mean really hot... be careful), people are really nice, the bathroom is clean, and they have free wifi! Wifi is free, but private. Ask for the password when you buy something.\n\nBecause the power plugs don't work, you can't stay forever, which makes sense, but, come with a fully juiced laptop and you can definitely stay a while. Although small, it's not overly crowded or noisy. And on nice days, you can sit outside.", "author": "Mariko F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "Simply great coffee and pastries, and perfect location. I come here all the time when visiting my girlfriend since she lives a few blocks away. \n\nThe mocha is always on point, and the chai is amazing. Nice quaint little place that is perfect to sit and chat with both inside & outside seating. Great for studying. They even have a little bar where they do serve a few beers on tap. \n\nDefinitely one of my favorite cafe spots in SF. A hidden gem that is not crowded with fixie bikers.", "author": "James M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-09", "description": "Cool place to study while drinking a beer/wine or coffee. \nThey have outdoor seating, just limited outlet space for your computers so come charged!!!!", "author": "Dede C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-20", "description": "Nice and small cafe to get shit done. Their salads actually look amazing and their chai tea lattes (my go to pick me up / get shit done drink) were quite nice.\n\nDownsides: kind of a small cafe, so I can see it being hard finding a table or place to sit. In addition, only one power source! And I wasn't really feeling the music when I went (a bit on the rock-ish side?). I also wish their wifi had a password and wasn't free.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "This place has great coffee and a delicious turkey sandwich.  Their salami da which with butter and cornichons is also outstanding.  It's a good quiet place to work too.", "author": "Jay R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-30", "description": "The food is pretty good, but it's just slow as faaaaak. They just move at the same turtle pace no matter how busy they are. it's super duper annoying. I just want a coffee and it's just hit the ten minute mark. \n\n15 mins and I've got a coffee, there were 3 espresso drinks before me, let's do the math here let's see....it takes way to long you lazy hipsters. Just a liiiitle bit of hustle would do you wonders.", "author": "Penguin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "I've been dying to try this place, as I always pass it while visiting San Francisco. Overall, the experience was 3/5 stars, but I'm giving it 4 for the ambiance and friendly staff. So I ordered a Gibraltar and yogurt with granola and my dad ordered a breakfast sandwich. The Gibraltar was ready in under 2 minutes, which was great. However, the two items we got took about 15. My yogurt was done after 5 minutes maybe and it just sat on the kitchen counter while they slowly prepared the sandwich. The wait sucked, but the food was delicious, including my now-cold Gibraltar! The girl who took my order was really kind and the interior was super cute. Hopefully I can come back here soon and stay a little longer!", "author": "Dom L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "Intimate spot with excellent coffee and food. I ordered an egg, ham and cheddar sandwich and my wife had the egg, avocado and cheddar. Both were delicious! And the barista knows what he's doing. His soy latté was spot on. We will be back.", "author": "Steve C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-26", "description": "In general this is a really cool place. The coffee is great and the food looks amazing (haven't tried it due to food allergies). It's easy and close to my house and the wine/beer part is such a little Celt touch. Bathroom is always clean and in general the atmosphere is very solid. There are a few things that consistently annoy me though:\n\nThe service is pretty slow. I definitely don't mind when people spend time on making me a lovely latte and or put the extra effort into making something yummy for me but fuck... My time is valuable too! When I see the barista chatting with her friend or other co-workers  at the end of the bar (happened on multiple occasions) while I'm waiting to order it doesn't make me feel like a valued customer. I'm patient but let's be realistic here. It shouldn't take me 8 min. to just order the coffee. \n\nSecond, the wi-fi is always in and out, which is a little perturbing when I'm there doing work.  \n\nOther than that, this is a cool little neighborhood place when you have some time to kill and chill.", "author": "Krista G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "Some fun hidden menu options you should check out:  They have a gibraltar, which many like with almond milk.  They can swap out yogurt in the granola bowl for steamed milk, which is interesting on a cold & damp SF morning.  My one wish is that they'd use a greek style strained yogurt for that bowl.  They can also make you a lox salad since they keep smoked salmon on hand to make lox bagels; nice if you don't eat bagels/sandwiches yet still love meat.\n\nOther fun things to do here:  Order a banana when they're super ripe and spotty brown; goes great with espresso drinks with milk less the or equal to cappuccino level.  Check out their changing arrangement of artwork every few months.  Currently, it's an installation of small canvases with colorful, dancy geometric patterns.  Sit down next to their card/flyer section when you're flying solo.  Peruse the various yoga instructor, tech startup, meditation, photography, acupuncture, and other curious services available.  If you come on the sunday streets day, they typically have a cool live band playing.  Last time it was an quirky, malt shop doo-wop set.  \n\nFinally a word of advice: The food here is best for snacking and less for lunching/brunching, so have the right expectations in mind.  The espresso machine/drip coffee is rightly the main event.", "author": "Andy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "I just stopped in here to grab some coffee but given how inviting the interior was, chose to order a sandwich as well. First off, I ordered a cappuccino, which was served beautifully, but the espresso tasted a little over extracted. However, I didn't let that ruin the experience. I then chose to go with the apple and brie sandwich and that was just delicious! The apples gave it a slight sweetness, while the arugula and brie balanced it out with peppery, creamy savoriness. It was a delightful treat to stumble upon!", "author": "Carly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "Very friendly staff.  Had the Apple & Brie sandwich, which was delicious.\n\nIf you're bringing your laptop, make sure it's fully charged.  Only one of the outlets works!", "author": "Brendan Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-14", "description": "Matching Half makes some great mochas (particularly when Jason is on duty), and they have good customer service. The downside is that bagels can take up to 30 minutes. I've had to wait 10-15 minutes for bagels when there was no line. Why do your bagels take so long? I can't figure out if your set up is bad, employees are slow, or what exactly is the problem. \n\nWould be a nearly perfect cafe if you can figure out the bagel problem.\nLove your mochas--keep making them as is!", "author": "Andrea R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "Yummy coffee, friendly staff... It's on the sunny side of the street... Bud most of all this place is privately owned by a local owner, which make me feel good about giving them my money. It is my favorite coffee shop in my hood! \n\nThey have hand made pop tarts! I mean really!!!", "author": "Jeannette F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-08", "description": "Cute cafe, cute pastries. Some people complained about the drinks being luke warm but I thought they were just perfectly brewed, I hate when my espresso is brewed with overly hot water because it comes out overly acidic. \n\nWould love to come back for the breakfast sandwiches and pastries!", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-19", "description": "This is one cool neighborhood. But is it because of cafe's like Matching Half that have taken up residence that has added the cool factor, or is it because the neighborhood has made cafes like Matching Half cool?\n\nIt's the classic chicken or the egg argument. \n\nEither way, this is a nice find and an excellent coffee shop to pass the time. There is free wifi and plenty of outdoor seating that captures the warm afternoon sun. The coffee is a major hit and they serve up San Francisco's own Sightglass. They are so cool that they even use iPads for credit card payment.\n\nLike the minimalist decor and the \"cool\" but friendly service. \n\nOne of word of warning, they have home made Pop Tarts!", "author": "Rene C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "Love this cafe! Great food, happy staff, perfect location. This place feels like home, so welcoming :)", "author": "Diane V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-14", "description": "Dark iced coffee, wood tables, big windows with cool afternoon light. Gardens in wine glasses. Eclectic wooden art in layers over the back wall. \n\nA perfect place to work or read.", "author": "Elizabeth M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "yum!\n\ngood espresso, limited seating on a late sunday morning.  drinks came quickly.\n\njalapeño poptart is good\nbreakfast sandwith is more than filling\nthe \"large\" sized turkey sandwich is really 2 meals in size and delicious\n\nalso they may have had a slayer espresso at some point but now its a standard la marzocco strada", "author": "steve a."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-13", "description": "People are nice but politeness and smiles doesn't make up for this place's shortcomings.   This coffee shop does not have a way to charge devices.  They have actually turned off their outlets.  They even say no power on them.  Basically, buy coffee or whatever and then don't let the door smack u n the ass on the way out. Don't want you hanging out very long here.  wtf?  They also charge full price for every cup of coffee.  gentrified crap really.  Coffee is better at my house.  Not a bad place to chill 4 a minute but as far as coffee shops go I'd check out another place.  plenty close by.", "author": "Seth C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-19", "description": "It's a nice cafe, good location, good coffee, but:\n\n1) there's never any seating, since the space is so small\n2) the internet is down half the time, spotty the rest\n3) the music often ends and the workers forget to turn it on again, so I sometimes find myself sitting there in dead silence\n4) when I ordered a small sandwich (that costs $6.50), the waiter forgot my order all together.  I reminded him 20 minutes later, and then he tells me they're out of bread and I'd have to get something else.  \n\nIf you're going to buy skinny hipster jeans, make sure you can fit them.  Likewise, if they're going to sell themselves as a trendy third wave cafe, they need to fix some operational issues and earn the money they expect customers to pay.", "author": "Khoa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "5 stars for the Raspberry Cheese Pop Tart. It was amazing.\n\n5 stars for the lox bagel. It was so good. \n\n2 stars for the coffee. It was so bad.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "Staff are friendly and coffee is good, but don't order the grilled cheese.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "Great neighborhood coffee shop. Friendly staff, good coffee and other food and beverage offerings. The only major problem is TERRIBLE wifi. If you are looking for a coffee shop to do some work - find another place. Otherwise, it's solid 4 stars.", "author": "Kirill E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-26", "description": "Matching Half is a pleasant, comfortable place to get consistently good pour over coffee. \nThey use Sightglass beans. (used Verve before Sightglass was roasting) \nThey offer a few pour over coffee options to choose from. \nThe people working there are nice. \n\nBest coffee in this neighborhood, hidden away on a quiet corner.", "author": "RK W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-15", "description": "I've only been here once due to a recommendation from a friend. It's a great study spot with free wi-fi. However, if you come with a large party, expect to split up. There's limited indoor seating and most of the tables are tables of 2. There's only one large table that fits up to about 8 if you squish.\n\nIt took a while for me to find the menu, but they have it on the table by the cashier. They also take card. So you don't have to worry if you have enough cash or finding an ATM.\n\nTheir food is really good! I had their grilled cheese. Their breakfast sandwich is quite popular. I saw many people order it. I had a bite from my friend's and it was delicious. The breakfast sandwich and the grilled cheese was quite large. I couldn't finish it. Their sandwiches range around 6-8 dollars. They also have baguette sandwiches which my friend said was delicious, she had the salami, and it was smaller in size if you don't have much of an appetite.\n\nThey also have quite a variety of house coffees. Their drips range from 2.50-4 dollars. I haven't tried their espresso.\n\nThey provide a bathroom, plus! Another nice little thing they have are hooks under the bar table so you can hang your bag, convenient if you bring a book bag or purse.\nDownside, they only had one outlet, but there was a little sign that said no power on top so I didn't bother to try to see if it worked. So bring a fully charged laptop or extra batteries, or a book.\n\nYou will also have to find street parking. There's lots of metered parking, but if you venture out another block or so there are also residential areas. Just hope you get lucky!\n\nThe staff are very nice and I plan on coming back!", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "Really good coffee and nice sunny location. \nThey need more power outlets though. If you want to work here, charge your battery prior to coming over!", "author": "Caroline K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-10", "description": "Quiet, cozy, and good coffee for a refreshingly non-San Francisco price (less than $3 for a good cup). 4 stars because not much outlet access so it's not a good all-day work spot if you're on your computer, but the weekday daytime environment is definitely good for brainwaves.", "author": "Amanda J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-13", "description": "Nice little corner cafe, serving up Sightglass coffee, bagels and homemade pop-tarts (genius!) in a warm and airy space. This is a great spot to grab a table and enjoy a coffee and a chat.\n\nWhat it isn't great for however, is take-away. There is next to no room in front of the counter/machines which makes waiting a challenge - and they don't take your name, just slap down orders on the counter - which means you can't wait outside. What happened instead, was a group of us dancing around each other trying desperately not to spill scolding hot coffee on each other. \n\nTake-out blunders aside, a cute cafe and one that I suspect would be a lovely to enjoy on a quiet afternoon with a glass of wine. And a pop-tart. That's a combination, right?", "author": "Mel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "Very nicely done cappuccino. I'd post a picture but I drank it already :-(\nSelection of sandwiches, salads and baked tasty things looks great too, and the prices are pretty low. And they have beer and wine. All good reason to come back :-)", "author": "Nicki R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-16", "description": "Great little spot to come and do a little work. Free wifi but be prepared with a full charge. There's only one working outlet (intentional) in the whole place and it's near the milk/sugar station to discourage long term squatters. Coffee is solid and the sandwiches are good albeit a little pricey...", "author": "Denis M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-27", "description": "Don't you love walking into an establishment to get a coffee and a bagel first thing in the morning only to be met with pretentious hipster attitude? (it's not cool to be a hipster, guys) You think that elitist attitude makes people want to spend money? You work at a coffee shop, a pretty crappy one at that. I mean, I'd expect it at a place like Saks, or Neiman Marcus, but a neighborhood cafe? No, you think you're so freakin cool with the cable knit sweater you stole out of your grandfathers closet, and your goodwill loafers you wear sock-less, Gross! I don't know who owns this place, but they seriously need to do some retraining in customer service, hygiene, and dress code. No one wants to buy food or drink from a dirty, unbathed jerk. Seriously guys, you work at a coffee shop, you're not that cool. NO stars are deserved. \n\nP.s. the coffee sucks, it's overpriced, and a bagel, plain, not even toasted or cut, is $1.75. WTF. a bagel you have to do nothing with should be 50cents...I don't care how \"good\" you say the bagels are. Unless it was personally flown in from New York by Mel Brooks, IT'S NOT WORTH $1.75. Jerks!", "author": "Barney B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-29", "description": "Amazing chai lattes. Also a little pricey but their breakfasts are perfect. The breakfast sandwich is my favorite", "author": "Meaghan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-14", "description": "Don't necessarily expect to get your cold, bland food in a timely manner. But the coffee's great. I also like the small and cozy atmosphere.  Despite the hipsters always associated with third wave coffee joints the folks baristas are generally cool.\n\nRead update!", "author": "D.J. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "This is my local so I love it. It's got wifi, really friendly barista, takes Square, and both indoor and outdoor seating.\nTheir coffee is really consistent and stronger than other places which is what I like.\nOnly down side is no real gluten free food options.", "author": "Van-Anh N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-26", "description": "Not sure how long they've been carrying Gillian's Black Jet Baking Company pop tarts, but I'm so excited that I now have a place close to my house to swoop some of her delectable treats! Today's flavors included jalapeño cheese, raspberry, and coconut kiwi. If you haven't tried them yet, you're missing out!", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-15", "description": "Latte is great. People are nice but power outlets doesn't work. Seems like they don't want you to spend more time in there.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-28", "description": "The coffee/chai is solid but the food is basically how an average person would make a sandwich or bagel but add 5 dollars to the price - nothing special.", "author": "Rohan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-03", "description": "Reasonable priced and very nice staff.  We popped in after we visited the Farmer's Market to get some coffee with the pastries we just purchased.  Though they don't have a large selection, what they have is good especially if you like your plan 'ol cup of joe.  I also got a macchiato, though it wasn't what I had expected (Yes I go to Starbucks way too much)... None the less it was delicious, and I think we were speaking with one of the owners and discussed why they don't carry any type of flavored coffee drinks (ie Vanilla), and he explained that it just takes away from the flavor of the coffee... Though my sister touché'd him that he let patrons add milk/cream and sugar to their coffees... He was definitely nice, and very passionate about his Café, which I liked.  Ill make sure to stop by again for another cup of joe when I am in town.", "author": "Bryanna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "Fantastic coffee. Good ambiance. Good service. Great place to spend an afternoon getting work done while enjoying the buzz generated by a great latte. Definitely worth the long walk to get here. The only danger is I won't want to leave.", "author": "Josh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "Excellent and well-made coffee - they make a good Flat White. The lox bagels are delicious with good wild salmon and the Large sandwiches are huge. The place has a good chilled atmosphere and nice outdoor seating that faces the sun, up a hill on a reasonably quiet street.", "author": "Andrew P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-23", "description": "We had a cup of granola & yoghurt and a breakfast bap. All perfect and served quickly. However the server forgot our tea and coffee. As we're from the uk we're not used to your half and half milk which is disgusting in coffee and the breakfast bap was very heavy on my stomach for hours afterwards. Not a great experience.", "author": "Alex B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "The atmosphere here is quite nice and the barista was kind to explain what's on the menu and help find something that I would enjoy. Definitely would love to come back and just have a lax day drinking a cup of cappuccino on a sunny day.", "author": "Alvin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-02", "description": "Nice place. Chill music and relaxing atmosphere. Only WARNING for people going there to get work done: they don't have power outlets except for one in a corner away from the tables. So just make sure you have enough power on your devices.", "author": "Erik G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-31", "description": "Cute interior, nice enough baristas, neighborhood cafe, but they only have one functioning outlet by the front counter for the entire cafe! If you want to come here to work make sure your devices are already fully charged. People have to take turns using the one outlet if they are running low. And their internet was really slow and it was cold inside. Not the best place for cozying up and being very productive.", "author": "Shayan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-19", "description": "Really tasty bagel, good crowd coming in and out. The shop seems like the perfect size and just right amount of coffee noise in the background. Also big windows to get a san francisco-esque view. Only complaint was that I was charged a whopping $2 dollars for a drip coffee refill after i had ordered a $5 dollar latte.", "author": "David M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-12", "description": "Small, quiet hipster cafe. I like how there isn't much foot nor car traffic going through that intersection. Plenty of outdoor seating for when the sun comes out.\n\nGuatemala drip from spyglass roasters was enjoyable, but its far from the best coffee in the area. They have a few local craft beers on tap as well.\n\nThe inside gets stuffy on warm days. Otherwise, its a good place to work or wind down. The power outlets DO NOT work, so charge your electronics or resort to getting annoyed.", "author": "Alfred L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "Love my local cafe! The staff is the best it's ever been. Friendly, remembers your order, knows your name, and always takes pride in their coffee and food. If you are looking for a smile and a sunny seat outside while you sip your afternoon away, matching half is the spot.", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "Best cafe in my neighborhood. People there are always friendly and Jason is especially affable. I hope they stay around a long time. The clientele seems diverse to me and kids are welcome. I could care less about how many power outlets are accessible - happy to see laptop addicts go somewhere else if that's really an issue. \n\nMy only complaint is that when the bosses aren't around, the service is sometimes ridiculously slow, if still friendly. If it takes 20+ min to turn out a panini on a non-busy weekday afternoon, then either something's wrong with the workers or the kitchen facilities. But it IS a tasty sandwich!", "author": "Frank B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "I was pleasantly surprised by this place when a friend introduced me to it. The coffee is great, but be ready to know what you want because they only have a teeny tiny menu on the counter telling you what they offer. This is a place where coffee pros will feel at ease, and bubble lovers can get their fix. I quite liked their bar-style seating.\n\nCriticisms: terrible seating! The available chairs are uncomfy and the outside area is awkwardly sunny. Expect to squint at the person you're talking to a lot a lot a lot if you come here mid-beautiful-day. The inside echoes so it's not a good place to hold a conversation.", "author": "Sterling D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-01", "description": "What's the point of outlets if you're going to label them with \"No Power\"? Lame.\n\nGood work environment, though, if your laptop is charged.\nGood tea selection.\nGood service.\nFood seems a bit overpriced.\n\nSeriously, though, allow people to use your outlets!", "author": "Neeharika B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-21", "description": "After dinner at Green Chile Kitchen I wanted some dessert. More specifically I wanted a cupcake. And even more specifically I want a mini cupcake. Just across the street I saw Matching Half Cafe and just inside the window I saw a bakery dish full of mini cupcakes. Joy of joys!\n\nI danced in and inquired of flavors. They had standards like vanilla cream and red velvet and not-so-standard like peanut butter chocolate and cinnamon horchata. I immediately ordered a vanilla cream and the cinnamon horchata to take home. The vanilla was standard as you'd expect - with cream cheese frosting and quite moist and delicious. The cinnamon horchata was just as decadent as it sounds. I will be back to have another. And another. And maybe even another. Don't judge me. We all have our weaknesses you know.\n\nIt's a cute coffee house and if the cupcakes are any indication they know what's up in a kitchen so I just may be making my way over here more often. If this is in your 'hood you'd be wise to do the same.", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "I have only been living in this neighborhood for a few weeks and I already love this place. Great coffee. Great food. Outdoor seating for when I get a dog. Only negative.....it's always so hot inside. There will come a day that weather may not allow me to sit outside and when that day comes I will have to go elsewhere. Because it is way too hot inside. But I love the coffee and the service is top shelf.", "author": "Elgin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-17", "description": "Going to the DMV stinks but it doesn't have to be that bad because one can just walk 4 blocks to this wonderful neighborhood cafe for a cup of jo.\n\nCoffee is great as is the atmosphere and the people that work there's attitude. \n\nI'm glad to be done with my DMV issues but will miss the Matching Half Cafe.  Maybe I'll have to do a special trip back...", "author": "David A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-15", "description": "For a quick on-the-go Sunday morning breakfast, this was a nice stop.\n\nI ordered a small cup of drip coffee (made by Blue Bottle) and as a critical coffee drinker, this was excellent. Dark roast that wasn't burnt or acidic = happy camper. I was pretty hungry and knew a croissant just wasn't going to cut it. Luckily, their breakfast sandwich caught my eye. Warm brioche bun with quality ham, egg, and melted cheese? Om nom nom! \n\nSmall Drip Coffee + Breakfast Sandwich = $10 (for SF, average)\n\nReally nice atmosphere in there and friendly baristas. Service was a little slow, but it was pretty busy in there. Normally I don't mind, but I was on the run. Also, usually I like to sit at a cafe and if I wasn't taking it to-go, there would have been no room to sit. Pretty small place and lots of people in there. So keep that in mind when looking for a study spot. \n\nSum It Up: Yummy Food/Drink, Average Prices, Limited Seating", "author": "Sasha T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-25", "description": "Decor & ambiance - amazing.\nService - okay. \nChai tea latte with soy - okay, kinda watery, nice foam though. \n\nKinda lame how it doesn't have working outlets. There's only one out of three and that one is only accessible to one table.", "author": "Jessie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-27", "description": "How did the hipster burn his tongue?\n\nBy drinking his coffee before it was cool.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "Great location, atmosphere and free wifi, but my latte was just so-so. The wifi is a bit slow.", "author": "Amin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-12", "description": "Stopped by to do some homework around noon and found it very crowded, mainly people on laptops, reading, ect. (they do have free wifi)\nI ordered a breakfast sandwich on plain bagel with a hot chocolate. My hot chocolate was quick, although it could have been a bit sweeter it was good. My sandwich took a little longer but it was also very enjoyable. \nOverall, the place is a bit small and can get crammed and the food is a bit overpriced. But it had a cool/trendy atmosphere and the customer service was good. \nCool little coffee shop to visit!", "author": "Atzay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-25", "description": "Some of the best coffee I've had in SF. Amazing breakfast sandwich and really good homemade pop tarts. \n\nGreat outdoor seating, wi-fi, and really interesting artwork.  \n\nA great place to get the day started.", "author": "Daniel D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-21", "description": "Five dollars and twenty minutes later, you're sitting at a sturdy blonde-wood table sipping a dixie cup of coffee staring at a wall terrarium.  DO YOU FEEL COOL YET?\n\nIf you're not wearing Tom's or pleather mid-90's ankle boots, don't even dream of walking in this place.  Also, only bring Lincolns b/c all the prices are in multiples of fives and they don't give change.  Enjoy some cheerful banter while you order?  Get out of here, you friendly freak!  Can't you tell by our radical hairstyles that we're a terse team of coffee-brewing wizards?  \n\nThe coffee is good.  Worth everything else?  Up to you.", "author": "Ellen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-13", "description": "+3 stars for well crafted cappuccinos, lattes, and excellent dark brewed drip coffees\n\n+1 for very cool, helpful staff that never fails to go the extra distance to make sure clients are taken care of. \n\nThere's outside seating that faces west - it catches sun for 3/4 of the day until sunset  - a great place to go for when the east-facing outside seating at Mojo has darkened halfway through the day.\n\nTrust me on this one...", "author": "Mark S. I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-02", "description": "I've been coming here since I moved to the neighborhood 2 years ago. It's my favorite place to get some work done and the food and drink (coffee, wine, beer) is rock-solid. The lox bagel and the turkey sammie are where it's at. If only they could improve on their iced coffee.\n\nMatching Half is busiest on the weekends (beware the precious toddlers with their parents) and most lovely and serene on weekday afternoons (perfect if you're trying to be productive). As others have noted, they have free wifi, no outlets, and mellow staff that - per the SF norm - take their time but do so (imo) in a friendly, non-annoying way. \n\nLastly, they use Square so using a credit card is not a problem. In SF, this is a rare but welcome feature.", "author": "Emily M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-15", "description": "I love Matching Half, it's definitely my go-to coffee shop / cafe--and I have a lot of choices by my house! The staff is super nice, most notably the male owner-he's the shit. \n\nWhenever I'm slightly hungover, I always get their mozzarella tomato basil sando, which is grilled--it's my favorite and always makes me feel more prepared to face the day. Their other sandwiches are tasty and above par for most coffee shops. Coffee is exceptional quality..my only beef? I REALLY WISH they had a larger option for iced coffee! I can down a lot of iced coffee, and with all the ice needed, their small size always leaves me wanting-especially because it's so good. \n\nA lot of the art is done by Workshop, across the street, or other rad artists. Oh, and for those of you cashphobes, they now accept credit cards, which cannot be said for every cafe in this city!\n\nGo matching half!", "author": "Afton T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "The bagel lox were spectacular! Also the kale salad. What makes the salad so great, other than the fresh ingredients, is that they like on the feta! Most places skimp on the cheese, but not matching half. Keep up the good work!", "author": "Sam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-28", "description": "Big, big fan since I'm in the neighborhood and have been dying for something other than Starbucks, the Lucky grocery store drip coffee (where they have an \"honesty tin\" to pay for your cup o' joe), and the hippie-fied place on Central and Hayes. \n\nClean design, sweet looking espresso machine with dark wood accents, large windows for lots of light, beer and wine options (with happy hour), and various bagel/snacks to keep things going. My first few visits when the place opened, I was served some pretty tepid cappuccinos, but his has much improved lately. Great coffee (due to great baristas).\n\nCash only.", "author": "Jasmyn M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-27", "description": "ZERO STARS! This coffee shop sucks! The staff is horrible; rude, pretentious, entitled. Not only are the prices outrageous compared to the quality of the products the provide, but they HANDLE FOOD WITH THEIR UNWASHED BARE HANDS AFTER HANDLING MONEY. Never going back here again. I live on the block, and I'd rather drive across the city to get a bagel than deal with those hipster douchebags. (They don't deserve any stars, but yelp is making me leave at least one)", "author": "Crimson Fiona M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-08", "description": "Came here on a weekend visit to SF, and found this to be a first-rate neighborhood cafe in all regards: even when super-slammed, the (adorable) staff were friendly & attentive, the coffee (from Sightglass, mm!) well-prepared (we're coffee snobs, and my date had one of the best cappuccinos we found on this SF trip, while I had some super well-balanced drip), the breakfast sandwich tasty and a great value, and the decor super-cute.", "author": "myrrh l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "Absolutely my favorite cafe in this neighborhood! Their coffee is excellent ! The staff is always friendly and most of all their food is delicious! The small baguettes are a must- especially the salami baguette with cheese and pickles! The pop tarts and the pastries are also really good  ! This place gets really full Saturday and Sunday mornings, but it's worth the wait!", "author": "Therese H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-07", "description": "Love the coffee, snacks and location but make sure to take into account that (with no line and after you placed your order) it will take 20 minutes (!!) for them to make your lox bagel ($8). Consistently 15-20 minutes. Same with many of the other sandwiches. \nThis is simply too long.\n\nUpdate:\nSeems like they read their Yelp reviews! :) My lox bagel recently has taken just around 5 minutes. Go matching half!", "author": "Pep G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-26", "description": "Seriously, Best coffee place ever. Well, at least for me. Love the breakfast and the Chai latte is amazing.", "author": "Amalie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-15", "description": "I'm sitting at work drinking a perfectly reasonable latte from Unnamed Coffee Chain and thinking \"wow, 99% of coffee now tastes mediocre at best thanks to Matching Half.\" Yes, it's that good.\n\nAlso thinking \"I wish I had one of those awesome chocolate chip cookies - the ones sprinkled with sea salt. Yummy.\"", "author": "Janna M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-13", "description": "Was really excited when this place moved into the neighborhood. They cleaned up and modernized a very dated space.  They had good food that was appropriately priced for the quality - coffee may be a bit overpriced.  The owners seemed awesome and I was really rooting for them to succeed - I still am.  The reason for the three stars, you ask?  WTF is up with the bad attitude of the people working there?  I'm in MHC once a week and about 90% of the time, there is no sense of urgency, there are no smiles, there is only this cool, detached, hipster indifference to the customer.  Being a neighborhood joint that you want to frequent, this seriously bugs.", "author": "mark h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-19", "description": "There's really nothing all that special about this place, but I like it. \n\nIt's only a few blocks from my house, and I've stopped in a few times. As far as drinks go, I've only tried the brewed coffee and it's fine. I've tried a few pastries (I think a muffin or two and a croissant) and they were both good as well. It's a pretty basic menu as far as coffee and espresso goes, but I kind of like that. No nonsense!  I think in addition to typical coffee shop pastries they do serve sandwiches and salads, but I've never tried them. \n\nI've never actually hung out there (I've just popped in and out), but it's a cute little location with a friendly staff. They also have free Wi-Fi.", "author": "George A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-29", "description": "Coffee is strong, tasty and expensive.\n\nMature hipster vibe.\n\nGood SALMON LOCKS BAGEL\n\nthe Green Chili brunch into matching half drip is a winning combo...", "author": "Walker C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-04", "description": "Hey Matching Half!  Your \"living wall\" is DEAD!  Along with it's living little circular saw buddy.  Oh, I get it, irony!  You can pick up some new air plants and succulents just around the corner at the plant shop.\n\nEven though you kill your plants I like you Matching Half.  First of all, you are a cafe, you you gotta have coffee.  Sight glass makes some pretty bomb coffee and you save me the trip down to SOMA to satisfy my craving (though I don't know if I have tested your espresso machine skills yet).  You ice you cake with home make pop tarts that are soooo good, today I almost iced myself with some traffic making a U-turn to go get one.  And home made oreos too!  Good thing I have a little self control.\n\nYou are also a pretty chill little place to sit, inside or out.  Free WiFi (no plugs, you low battery life suckers).  And stained glass peacocks.  Easy access to pie shakes, a green burrito and craft training college.  Far enough away from Divis to get rid of some of that drabble.  Maybe some day I'll try your meats between some breads.", "author": "Adrian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-29", "description": "Great lunch spot. \n\nSmall but inventive selection of sandwiches, good coffee (Sightglass) , and good (small) beer selection. I had a tomato mozzarella panini with a green side salad.\n\n Sitting outside on a sunny afternoon at Matching Half cafe is very nice. Sunny cafe but seating is limited inside.", "author": "Leuwam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "our neighborhood go to coffee shop. i love sight glass coffee, they offer almond milk, the staff is super nice, and food is great. they just repainted and wallpapered and it looks good. only negative is they can often be slow as molasses.", "author": "Tatum T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-22", "description": "There's something that I don't get here. \n\n- They have a great location. Nice bright space, big windows, on the corner, outdoor seating.\n\n- Interior is relaxing, modern, clean. \n\n- Music isn't loud and dumb. They play jazz, blues, and oldies at a modest level. Like not awkwardly silent, nor obnoxiously loud.\n\n- They have free Wi-Fi. Here's the doozy: there are NO WORKING POWER OUTLETS!!!!!!! \n\nYou would think that it's an epic combo like peanut butter and jelly - cafe wi-fi + power outlets for your laptop...but no...this does not exist...\n\nI wasted $2.75 on an iced tea just to sit and check my email til my partially charged computer died 20 minutes later. Sigh. \n\nSo sad that a place so cool has to shaft you like this. Minus stars, stars, and STARS!!!!! \n\nI go to Oasis Cafe now though their coffee is sub par. But they have outlets (like a real cafe!) and nice little nooks and quiet space.", "author": "Peng M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-09", "description": "I met with my book club ladies here one Sunday afternoon and I was pleasantly surprised by the quality of the food and coffee at this place.\nEspresso was strong, the staff was smart and knew what they were doing, it was clean and it was well run.\nIt's a little small if you have more than one other body with you, but it seems like a great neighborhood place to swing by for a quality cup of coffee.\nThe only issue was that they don't take cards, and that sort of cramped my style since I hadn't gone to the bank before swinging by the cafe. Luckily my friends love me, and have cold hard cash  :-)", "author": "Kathy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-04", "description": "good coffee house. only one left in the area.\n\nhomemade pop tarts. \n\nand here's a bunch of text I'm going to include just to make this long enough to qualify as a boba fide review. stupid yelp!", "author": "Steve F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "This is a perfect little corner cafe to sip and stare out the windows, maybe even get some work done on the free wi-fi. The baristas are pleasant and the chocolate chip cookies are delicious.", "author": "Leah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-27", "description": "I'm a bit surprised that some reviews complain about coffee size/strength/temperature. I like a strong americano, and at other cafes I usually have to ask for room because they put too much water in it. Here they put it in an Italian A.C.F. porcelain cup (looks like 190ml), and it's been perfect every time I've been here. If you like it at Mojo, you'll like it here. [Update: I've been here over a dozen times now and it's always a perfect cup.]\n\nI didn't frequent this place back when this was One World, it was just another panhandle cafe. I preferred to ride my bike to Coffee Bar. But Matching Half is great -- it's bright, airy, clean, not terribly crowded despite being a small place, and the people are nice, not stuck up at all. The outlets on the back wall don't have power, but that's good so it's not overrun with laptops.\n\nOh also, they're always playing great beats. Half the times I'm there, I pull out Shazam.", "author": "Tom P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-30", "description": "Mmmmm.... mochas yummy! Very pretty presentation. Its a tad on the too sweet and weak side but still quite tasty. Clean, trendy space with outdoor seating. Nice location (quieter street traffic). Friendly prompt service.", "author": "Chelsea D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-09", "description": "I come here for the dog watching. It's amazing.\n\nThe coffee is pretty good too.\n\nOnly compliant is that the line moves very, very slowly.", "author": "Hillary W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-29", "description": "After reading the other reviews, I'm not sure if I just got lucky or what, but the folks working there were nice enough to me, and the espresso and apricot tart were fantastic.  They even heated up the tart to give it that extra special yumminess.\n\nThe place itself is very cute, with a number of seats outside as well as inside.  I almost gave them five stars, but it was a tad on the pricey side (although I would say it's worth it) and for the life of me I couldn't find a menu.  Perhaps in my early morning haze I just missed it?  Well, no matter.  The apricot tarts are right there on the counter and I suspect I'll be going back for more of those and maybe I'll find the menu at a later date.  Can't wait to try the regular drip coffee next time!  :)", "author": "Christian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-13", "description": "Great ambience, good coffee, and wonderful place to get some work done in the sunshine.", "author": "Samuel J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-15", "description": "I like my Latte here, only Blue bottle has managed to impress me in this country... and now these guys.\nThis guy knows what he is doing even though he's NOT A GIANTS FAN, yea you know what I am talking about.....yup.\n\nIt's all good in the hood.....literally!\n\nStay handsome!", "author": "cecilia k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-31", "description": "This is my favorite cafe in the area. It's a bit out of the way, two blocks off Divis, on a quiet corner with lots of sun in the afternoon. On a nice day you can sit at the tables outside, and when the weather gets cold there's plenty of seating inside. I love how cozy this place feels. \n\nThe drip coffee is great while the cappuccinos tend to be on the bitter side. I think this is just the style of espresso drinks in SF though - all the fancy (blue bottle, ritual, etc.) cafes serve something similar. The food is pretty standard cafe food, nothing too exciting.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-31", "description": "Great yuppy hipster cafe with super capable baristas and yummy food.", "author": "Tyler M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "Favorite cafe to work at in the area! Always quiet, bright, clean, and playing music you can work to. Baristas are usually really friendly, too. Just be warned- tables can be hard to come by, and outlets are non-existent. \n\n They have tables outside that are usually available, so it's a perfect place to sit and chat on a nice day.  \n\nWhile this is a great place to get stuff done or unwind, it definitely ISN'T the place to get lunch. Food is overpriced and very few options.", "author": "Kristen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-12", "description": "Great coffee and pop tarts!!!! I had a chai and my fiancé had a latte-both creamy and spot on flavor wise. We also split a breakfast sandwich that I had kind of low expectations for (they microwave the eggs) but I was pleasantly surprised! Nice little outdoor seating area as well.", "author": "Nikki S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-07", "description": "Love love this place. This is my go-to spot for the perfect cappuccino. I also love their  breakfast sandwiches, and their pop-tarts are pretty delicious too. Such a cute spot to hang out, great ambiance and atmosphere.\n\nMatching Half is also great for a good beer in the evening. They feature some really great bands.", "author": "Sara N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "Cute little coffee shop. Their mocha was great and the pastries looked yummy! Would definitely go back.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "I love this place and come regularly for coffee and lunch. I am glad the power outlets are turned off to avoid people camping out all day and taking up the limited seating.\n\nThe main thing that would make me give 5 stars would be reduced price refills. I know free refills aren't economical, but $1 refills (like they do at the mill) would be superb (it would be nice to have a second cup after that sandwich, but not at full price).", "author": "Justin T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-14", "description": "Decent coffee; average food; great atmosphere.  \n\nThis place gets low marks because of the strange, not-quite-rude, service.  They refuse to put espresso shots in ice coffee out of principle and fairness , as their beans are of such high quality that to do so would be an act of sacrilege so offensive to the coffee gods that it's safer to offend the customer by refusing.  \n\nThey also have a strict policy of asking if you'd like them to add half-in-half and *then* directing you to do it yourself after you answer \"yes\".  Very bizarre.  \n\nIt remains to be seen whether one can buy an espresso shot to add to their iced coffee without being run from the store.  \n\nSince the whole debacle left me with surely a more bitter taste in my mouth than espresso over ice, I'll be taking my bean-water money elsewhere.\n\nUPDATE:  This place reminds me of the coffee shop featured on Marc Maron's show, where the snotty barista refuses to ice his latte.  Look, your coffee is good, but when I purchase it, it becomes my coffee.  If I want to ice it, that is MY decision.", "author": "N Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-18", "description": "Just wanted to add that this place plays the BEST music. I rarely find myself wearing my headphones cuz they have such good taste- especially in the hip hop genre. Kudos MH. Kudos.", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-02", "description": "It was really good drip coffee, I like the way they served it to me and my friends. The workers are super nice and the shop is very clean. The price was good. We got two cups for 5 bucks. It was priced pretty good. I will go back for sure", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-10", "description": "I have a \"thing\" for corner cafes and anything in corners (keep your thoughts clean, people!!) Matching Half is wonderfully located at the corner of McAllister and Baker. What a gem. This delightful shop makes sandwiches, has pastries, Sightglass Coffee, teas, loose leaf teas, and a limited selection of wines. I am here mainly for some study space. There are about 6 tables for two and one large community table in the back for eight. There are also a handful of stools at the bar. This space is cozy, but there's room to luxuriate in all that open air-lots of light-humbly decorated space. I ordered an iced English breakfast tea. They have wifi for those who need the Internet. Unfortunately, there aren't any outlets for use... there are some in the back (hurrah!), but they are all labeled \"No Power\" (womp. womp.). Eh. In the end, I'm just happy I found another great coffeeshop to do some thinking, brainstorming, theorizing, conceptualizing, problematizing... (I'm a humanist. That's what we do.) Enjoy.", "author": "James Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-20", "description": "I just moved in the neighborhood and looking for a good cafe with good coffee. This place doesn't disappoint. Like so many places, the make each cup of regular coffee via a manual drip system that is excellent. You have an option of premium coffee from Sightglass. I have tried Guatemala and it's worth the extra $1.\n\nThey also server beer and wine. They have limited but excellent selection of beer on tap. Magnolia, Marin brewing company and others are represented. The wine list is decent.\n\nThe food is OK nothing over the top. The pastry selection could be better. Overall a good place for coffee, beer or a glass of wine.", "author": "Subhash J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "Matching Half Café has friendly baristas, reasonable prices, a well-lit space, and good coffee. I went on Sunday afternoon and it wasn't crowded. What more can one ask for? I'll be going back!", "author": "Peter A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-16", "description": "Quick and Simple:\n\nThis place is a fabulous little coffee shop with a chic urban feel. With a feeling of Blue Bottle --and a little more edge and charm courtesy of its location and feeling of independence -- this place inherently had my heart. And my caffeinated soul.\n\nThe espresso I had was fantastic. The service was fantastic. The vibe was superb. Matching Half Coffee -- a HUGE success.", "author": "Thom S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-05", "description": "Super cool spot. Great coffee (pour over). For the pour over, you can select from a few different locations. I always get the Guatemala, which is great. They have nice outdoor seating, and plenty of space inside as well. Coffee, is pretty pricey, but it is super high quality.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-17", "description": "-great coffee\n-tasty food\n-friendly service\n-clean, welcoming atmosphere\n\nbummed i don't live down the street from it anymore.", "author": "Alicia J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "Love this place. Love all the staff, and great spot for people watching. Became my go-to cafe after moving to the area, and especially after Sophie closed.", "author": "Randy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-02", "description": "Fuck all you people complaining about the outlets. I'm sick of you clogging up every available table at every café in SF.\n\nThat said, this place is awesome. Great coffee, wonderful people-watching, great décor, delicious food, and NO LAPTOP ZOMBIES! WOOHOO!", "author": "Henny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-06", "description": "Recently at the Matching Half: \n\nStopped by with a friend a few hours before close.  The fellow behind the bar gave us some good-natured flack for splitting a cup of coffee and then delivered it to our table.  It was a gray day, but the place still gets fantastic light, and it's hard to be gloomy when they've got their soul playlist on.  The Matching Half has an unbelievable cast of adorable kid patrons, and this time the baristas were helping a well-behaved little guy with whiskers painted on his face distinguish between the recycling and the compost.  We stayed for a beer and got generous samples of the two we were choosing between.  At close, they offered us the leftover pastries and let us try a new kind of drip coffee.  If you're looking for a coffee shop to make your rainy afternoon. . . .", "author": "Joanna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-25", "description": "If you like a cafe based on the view from the window then this is the plae for you. The windows are among the best in the city. Huge and overlooking a few nice artsy Victorian houses, best view from a cafe in all of SF. Wh? Because its not overcrowded with cars and yet the rumble of a sweet neighborhood is constant. \n\nRight on the 5 bus line. Muni peeps love this. \n\nJust got some new loose leaf teas.", "author": "bob m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-26", "description": "This is my second review today: this one and one for Blue Bottle in Hayes.\n\nBoth have great coffee. Both make great coffee drinks. Both have reasonable prices.\n\nThe difference is that staff at Matching Half are much friendlier.\n\nThe only criticism I have for Matching Half is that it'd be nice if they either removed the \"coffee pot for two\", \"coffee pot for three\" from their menu or started stocking more Chemex equipment.", "author": "Emmett K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "I was wandering aimlessly on the streets of Turk and Lyon when I all of a sudden found myself craving a smooth cup of coffee. I didn't know of any cafes nearby, but then I stumbled upon Matching Half on the corner of McAllister and it was love at first sight. \n\nThis place is tiny, but it has all the right moves. First off, it's in a great location. I can see this place being one of \"go-to\" spots for coffee the next time I meet up with someone. If you need a cafe to hit the books and study, you might want to consider Matching Hat. Whereas Starbucks is constantly busy with people coming in and out, this cafe seems more modest and mellow. \n\nThe windows are huge, so the place is very well lit. Decorations are minimal, but the overall vibe is a solid \"cool\" in my book. You get the perfect amount of caffeine fix for just the right amount of money. For just $4, you can get a delicious Chai Latte that's perfectly blended. They also have assorted, healthy muffins and cookies. The cranberry oatmeal raisin cookie is bomb. I will definitely be back for more, and more.\n\nKeep in mind, they only accept cash!", "author": "Linda T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-17", "description": "It's a hipster watering hole. \n\nEspresso is on the mild end. Doesn't help if you're looking for a richer blend, something to shock you out of your morning drowse (might have to go for a double or triple then).\n\nThe interior and quaint ambiance has really grown on me. Here's why:\n- amble seating inside, few outlets discourage laptop campers so the cafe seating fosters more of a conventional cafe and chat environment \n- cute bar counter seating\n- plenty outdoor seating - come here on a nice day, overcast even, and you'll have the sun shining nicely over you. \n- great music not too grungy nor too ambient. I get reading done here without the background music distracting me.\n\nBut otherwise service is poor. They're not personable nor efficient - between 3 workers and 2 customers, they couldn't identify who had a regular coffee and who had the decaf. I mean, it's not like there was a rush....", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "Pssst.....it's the best coffee curation (if you drink black) around. Just don't tell anyone :)", "author": "Mario C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-06", "description": "A cafe that reminds me of home!  I'm new to the neighborhood.  I ordered my favorite drink and this has been the only cafe around that didn't correct me on how to order!\n\nNot to mention, my americano was delicious!  And so is their sea salted chocolate chip cookies!\n\nCan't wait to try out  more...", "author": "Trisha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-20", "description": "My fiance and i just moved into the neighborhood and we were praying there was a coffee place EXACTLY like this near by. \n\nThe brew to order drip coffee is fantastic and the espresso is even better. This place takes a lot of care in making each cup of coffee or latte and you can taste it! \n\nAlso they have one of the best breakfast sandwiches ever! Seriously amazing.", "author": "Dan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-11", "description": "This cafe has the best cappuccinos hands down! Their pastries are fantastic I think they get them from local bakeries every morning. Their morning bun which has orange zest inside its so tasty and refreshing at the same time. Plus it's small so you don't feel like you've just eaten like the Pillsbury doughboy. \n\nThe only complaint I have is this place really does take their coffee seriously so be prepared to wait. If you see a line you'll more than likely be there for the next 15 minutes or so.... it's worth it!", "author": "Maria M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-11", "description": "I'm a big fan of Matching Half, its a wonderful place to relax and I find the staff and owners to be excellent people. There's always something new and interesting popping up there, I'm a big fan of the salted chocolate chip cookies and the mini cupcakes. Their chai strikes that good spot that's both sweet and salty, and they make a good cappuccino. \n\nThe whole place has a peaceful, airy feeling during the day, and a chill down-home vibe at night. I love the outdoor tables and the big communal table in the back.\n\nMy favorite, though, is that they make me one of the best breakfast bagels in the city. It's not on the menu, although all the ingredients are. It's a sesame bagel with egg, fontina, and basil. Order a Hoodie special, lets see if we can get it on the menu full-time. ;)", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-10", "description": "Had a Sight Glass espresso and an apricot pop tart made in house.  Both were very nice.  The coffee was pretty balanced, light to medium bodied....and overall pretty good job by the barista.  The space is a neighborhood feel, not overly pretentious and mostly locals from the NOPA area.  A good comfy spot.", "author": "Porca M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-02", "description": "I really really really wanted to give this place 5 stars.\n\nLet me start by saying they make excellent coffee. Every cup I have had has been enjoyable and it does not hurt that they sell and use Sightglass beans. They also have a nice selection of pastries.\n\nThere are also some nice beers on tap.\n\nThe only downside is that the space feels a little awkward to me. It just does not feel suited for conversation or reading which is my usual reason for stopping in a cafe for a beer or coffee. There are not comfortable places to sit for any length. It seems like the seats are designed for short stays.\n\nI do highly recommend this place for anybody looking for nice coffee or beer.", "author": "Eric G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-11", "description": "Hands down, the nicest people in the coffee business. I love these guys! They have been serving me the best latte in town since I opened my business across the corner from them, and every day, I thank my lucky stars that they're my neighbors. Their sandwiches are utterly delicious- I am constantly torn between the salami on baguette or the melted mozzarella and tomato.\n\nSeriously, everyone that works here is a gem and everything they make is delicious. I'm a fan!", "author": "Demetra D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-17", "description": "This is my new local coffee shop, and it's run by a guy who is also a local and lives near by. He has a real passion for coffee, and as such if you're expecting a Starbucks like experience just get back in your car and head to one. \n\nAs with some traditional coffee shops, they take their time to make all their drinks \"correctly\", or in a traditional fashion. Your latte will get made with real milk, and it's slow steamed one cup at a time (not in a big bucket like at Starbucks, which is how they can make 20 at a time). It's then slow poured over the espresso shots (every drink comes as a double) until you get that pretty leaf  appearance on the top. Again, like any traditional coffee place does.\n\nThey use very good beans and their expresso is super smooth in any of the drinks I've had their. And like Blue Bottle, the make each cup of regular coffee via a manual drip system, one cup at a time. Again, it's not the fastest cup of coffee in the world, but this isn't that kind of place either.\n\nThey also have some hot breakfast foods there now too, like bagels with egg and stuff on it, in addition to the pastries they already had. They are also adding more beers as well with the installation of some beer taps. I think they have like 5-6 beers on tap now, in addition to whatever they have in bottles.\n\nOver all if you're looking for a GOOD cup of coffee and you're a fan of these kinds of places, go check it out. I'd put them on par with any of the good coffee joints here in SF.", "author": "Erik B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-28", "description": "No free or even reduced price refills on the already too expensive drip coffee.", "author": "Jonathan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-12", "description": "Sure, Blue Bottle is amazing and technically a bit better coffee, especially if you like strong coffee. I like to go to the Blue Bottle in the Mint Plaza, but there is always a line and it is out of the way.\n\nMatching Half for me is also out of my way, it is a destination location. But, I know a lot of people in there are local to the neighborhood which is why I love it. I love to experience the different neighborhoods and what they have to offer. To me, this coffee shop is the best of that and the best of a true coffee shop experience.\n\nDecor = unique, eclectic and fun\nLatte = my favorite thing to get here\nPeople = very friendly and interesting\nStaff = very nice and actually care\nMusic = hand-picked by staff\n\nThe overall experience is much better than Blue Bottle.", "author": "Deseray T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-23", "description": "I met up with a friend in the area on a Saturday afternoon and needed to do some work after, so I yelped cafe's and came here on a whim. I'm so glad that I did! Maybe it's too early to write a review since I only ordered a peach ginger tea and haven't tried any of their foods or baked goods (they had muffins, a variety of sweet & savory empanadas, cookies, & maybe a few other things but I forgot), but I think if I lived nearby this would definitely be my favorite spot to spend a few relaxing hours doing work, journaling, reading, or hanging out with a friend... I loved the chill (but not drab at all) vibe and it has lots of big windows so it's really nice to come on a bright sunny day. They serve Sightglass coffee also! And parking is pretty easy (always a huge plus, especially in SF!). The people who work there are super nice too :)", "author": "C K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-17", "description": "Met a friend here to do some serious work on our MSW research projects. I'd never been to this little corner, and I was really pleasantly surprised.\n\nThey brew your coffee by the cup -- nice touch. However, it's that flowery, light, Ritual-style coffee, which isn't my favorite. I need something more BOLD.\n\nThe music playing could have been my iTunes library on shuffle, with even some obscure artists represented, so that made me feel right at home.\n\nThe clientele and staff were a bit scenestery, but not overtly smug, so I was okay with it.\n\nOverall, a nice airy atmosphere and a good place to camp out and do some reading or writing.", "author": "Megan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-10", "description": "What a great neighborhood cafe. Good coffee (Sight Glass), friendly service, and solid food. Today I had the breakfast sandwich and croissant, both of which were average (3 stars). +1 star though for being an awesome hangout spot (seating at the bar, outside, and airy/sunny from all the windows).", "author": "Pria P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-06", "description": "I got a mocha, and it's wonderful!  Delightful!  Superb!  I'm sipping it as I type and the world's feeling like a lovely place.  Ahhhh, coffee.\n\nThis is the first coffee place I've gone to since moving into my new apartment in SF (though not the first SF coffee place I've been to in general), because it's only about a block and a half from my place...and I couldn't be happier.  This is the kind of coffee I'll be excited to grab every morning before heading to my MUNI stop.  \n\nTo give you a sense of the prices -- a latte's $3.25, a mocha's $3.50.  Drip coffee's $2.  \n\nI'm looking forward to trying their other drinks, and their food selection at some point.  I just couldn't hold myself back from an immediate yelp for this stellar mocha!  (FYI, the coffee drinks on the menu are what they've got -- no flavor shots and such-like...which is cool with me, but I'm putting it out there in case you're a vanilla-latte-only type of person, or something like that.)\n\nThey were under-staffed for a holiday, but you wouldn't have known it by wait time -- they got my drink to me quickly.  And even so, the guy who took my order and made my drink apologized to me for their being busy/under-staffed!  He and his co-worker were entirely friendly, super polite, ready to help.\n\nThe place feels cosy and warm, perhaps due partly to the blond wood and quality of light streaming in -- it had a golden quality to it, really attractive and pleasant.  I was sad to be on a schedule, and I look forward to heading over there when I have time to hang out.", "author": "Crys L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-16", "description": "I love a lot of things like my new Nike shoes and my baby and my dog but today I think the homemade Oreos here are best.", "author": "Today Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-21", "description": "I think if I were to ever open a cafe it would be exactly like Matching Half.  This little place has great decor, the music isn't too loud, and the coffee is delicious.  I haven't tried the food, but I have my eye on blue cheese sandwich.  Only problem I have is this place is too popular and it can be hard to get a seat sometimes.\n\nOutdoor seating for nice weather.", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-08", "description": "So I live a block away from this place. I've stopped in a couple times before hopping on the bus to get to work and the interior and set up is really nice and it's convenient it's so close to my place. However, I've gotten the same barista the two times I've been in here and can I say friendliness isn't her strong point. No smile, no friendly greeting...just a blank stare and  \"what can I get you?\". OK, I get it's early and maybe you're not a morning person but you work in a cafe. Drink some coffee. Would it hurt you to be a little nice to your customers? Maybe she just has a bland and dry personality. I'l go back in to find out but three strikes you're out dude!\n\nCoffee is ok. Double latte comes in a tiny cup which looks like it's meant more for an Americano. Sorry, I like my double lattes in a big cup, not a tiny one. I haven't tried any other coffees but after that tiny little double latte I think I'll switch it up next time to see what's different.\n\nI haven't tried the food so this review is only for coffee and service.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-30", "description": "I like the minimalist, no-fuss, no-clutter nature of this cafe. It's atmosphere makes me feel clean and refreshed, with all the plants, nice dishware and open windows.\n\nIt's almost one of those zero-outlet establishments which would put it on my black list (as I'm an avid cafe computer user), but there's one outlet below the coffee station where you could get your charge on.", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-23", "description": "Great blue-bottle based cafe in NoPa, with a slayer machine.\n\nAlso sell beer and wine!", "author": "Alun E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-08", "description": "Cappuccino: 4-star (not perfect)\nMusic:  5-star(not too loud)\nService: 5-star\nInternet: 5-star (fast enough)\nAtmosphere: 5-star\nTemperature: 5-star\nBrightness: 5-star (has large windows)\nTable: 5-star\nCleanness: 5-star\nBathroom: 5-star (very clean)", "author": "Yosuke K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-12", "description": "This is the kind of place I'm looking to patronize regularly ... and I will!\n\nThe people are awesome, the atmosphere is very comfortable and they just got their liquor license! So I can easily see myself grabbing a few beers at a Saturday night and then coming back in on Sunday morning to read my paper and have a fabulous latte and pastry. \n\nTalk about latte art, the baristas are true artists. Definitely worth a try once, twice - or everyday if you're like me.", "author": "Sho B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-23", "description": "I'm new to this neighborhood and go it for a quick lunch before work.  I order a latte, turkey sandwich with a side salad for a total of about 13.00 and change.  Not cheap but for the city in a small cafe its about average.  My latte comes in what we used to refer to as a tea cup.  Its beautiful and hot but way to strong for me.   I go to the counter and ask  them to transfer into a coffee cup and add more milk.   The manager tells me they can't do that.  They have agreed to sell only one size of latte.  I ask again, please pour it into a coffee cup and add some more milk.  I have a gastric issue and it will only cause me pain about 20 minutes after drinking it.   He says they that they can't do that.  He offered to pull me a short shot (in the same sort of cup) and it will have more milk.  I don't want that.  I want all the caffeine but I want it diluted.   He absolutely refused.. I reminded him I am the customer and he said, yes, I AM the customer but they will not sell a latte in a bigger cup.   I offered to pay for the extra milk.  Again, they refuse to sell a latte in a larger cup.    OK folks, is it me????  I told him that I would not  be coming back and I wanted a refund on my coffee.  Instead of keeping a customer he still refused to transfer my latte into a larger cup and gave me a refund on my latte.    I work for a very large retail store, customer service is the top most importance.  We've had to do some stupid things because our customs were demanding.  Nothing that cost a lot of money for the store but its hard to let the customer get one over one you. Especially when you both know they are.   In this case I was not.  I just wanted a bit more milk in my latte.\n\nThis guy is good at what he does and never raised his voice or became rude.  I appreciate that.  The sandwich was very good and the side salad was worth the money.   I think their espresso might even be very good too.    \n\nThe young man who was my server was also very sweet and offered to get me something else to drink and apologized for the inconvenience.  All in all it would have been an excellent review if not for their silly customer service issues.\n\nStill, I won't be coming back.  There are many more little business out there that want my business are are willing to take care of my small requests because they realize that every customer is different and often one must be flexible to keep their business growing.", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-01", "description": "Much needed decent independent coffee joint in NOPA hood. They have a very nice Slayer espresso machine with creates amazing shots. Staff is very unassuming and cool. The logo on their outdoor sign is a bit hard to read, i admit. Great work and addition to the neighborhood, MH!", "author": "casey c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-23", "description": "A quieter alternative to the rush on Divis. Great place to get work done. Also, the turkey sandwich and Oreos are pretty phenomenal.", "author": "Ashna C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-24", "description": "Gave Matching Half Café another chance. Staff is as nice as ever. But this time the WiFi didn't work. They said their router had been malfunctioning and that they probably need to get a new one. I am out of luck with this place.", "author": "Guillermo G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-18", "description": "Delicious, 3rd wave coffee. Free Wi-Fi. Notable pastries (their homemade poptarts are not made by them but they rock). Didn't give 5 stars because of their lackluster sandwiches, and sometimes there's a hint of an attitude in the otherwise friendly staff.", "author": "Nikolas B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-11", "description": "love, love, love this place to grab a cupcake/scone/etc and a cappuccino.\nPerfect little place to go to with your books or a friend to chit-chat.", "author": "farzana k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-05", "description": "I'm happy to see someone read their yelp reviews! \n\nI tried Matching Half again last night and was very happy to see a nicer staff that promptly greeted my group, a fully stocked kitchen and great wine specials!! \n\nI had the turkey sandwich, it was tasty but nothing special. The salad on the side was a little boring. Basically just romaine with dressing. However, everyone enjoyed their wine and the happy hour prices were good. They also have a few good beers. I think this is a good spot for happy hour or coffee & pastries. \n\nOverall it's a nice, clean location...a welcome addition to the hood!\n\np.s. they should think about changing their sign. As one reviewer said, it would probably look great on a business card, but it just doesn't look good on a sign.", "author": "Kandace K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-09", "description": "Hooray, finally a cafe in this neighborhood that serves high quality coffee with friendly service. No attitude, you ask? Am I in Oz? Must I return with the Witch's slippers? You needn't wake yourself up, these lovely people have realized that you don't need to be a-holes in order to serve coffee, even in this town and even in Nopa. The coffee is quite good and the baristas are on top of their game. Yes, a bit of a learning curve but I've been in 3 times over the past week and each time the service improved.\n\nA lot of the negative reviews seem to be from people who have no patience at all for a brand new cafe working out the kinks. Give them a break, jeez. You don't like it? Go back to the coffee butchers over at Mojo who, after a few years in business, have no clue how to make a decent cappuccino. I'm pretty sure they're too busy admiring their tattoos to care. \n\nWelcome to the neighborhood, Matching Half. It's great to have you.", "author": "Pamela S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-17", "description": "The coffee here is pretty good, the atmosphere is pleasant and it's a great addition to the neighborhood. \n\nThe so so review is because of the major inconsistencies with the coffee and the sizes. The coffee taste varies each time and sometimes when I order a Latte it comes in a large cup and sometimes in a small. I usually order the drip and ask the counter person for the strongest beans, although this has varied too. \n\nAll and all, if you're in the hood this place is worth checking out. The kicker for me (and the reason I am taking a break) is because there is a petite woman who seems to be working or \"lingering\" every time I go. She might be the owner (not positive) but she is unbelievably unpleasant. She has sucked the energy right out of me on several occasions, which is the last thing you want when you haven't had coffee or started your day yet. I could name several examples but I'll just leave it at that and hope things get better. The other folks that work there are very friendly!", "author": "Kara S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-12", "description": "I live down the street and have been here 4 times to give this cute independantly owned coffee shop a(nother) chance... \n\n  Sadly, EVERY time I have been in, the customer service has SUCKED! Look, thier coffee is good, but not as much as all of the other small batch coffee houses sprawling our city. \n  Blue Bottle, Ritual, Four Barrel... Better coffee, with no lame ass attitude problems! \n Sorry folks, but your grumpy barristas and amateur customer service have me hitting up those better spots in the city.", "author": "Danielle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-21", "description": "Friendly if somewhat bland caffeine and wine destination.\n\nHave no complaints about the service - very accommodating, warm and genuine. They customized both my sandwiches (ham for turkey, add lettuce, pears instead of cheese, etc.) without extra charge. Unfortunately egg whites aren't an option, and they missed my request for no dressing on one of them. Prices slightly high for the size.\n\nAll was consumed in a clean, nondescript atmosphere. Free wifi, but there is currently only one working outlet. I'm glad no one tripped over my cord.\n\nI left satisfied but with little to recommend.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-09", "description": "Nice, low key coffee shop/cafe. Friendly staff, good food and usually not too crowded during the weekdays. Not particularly cheap though that is offset a little by the nice environment if you want to sit and work for an hour or two. Don't come here if you are in a hurry though; everything moves VERY slowly! Also, it's a bit over the top hipster... oh well.", "author": "A Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-05", "description": "FINALLY... Excellent coffee in my hood!!! Can't beat fresh ground Verve* (soon to be Sightglass**!) w/ miro-filtered water running though either a Slayer*** for a perfect Macchiato ($2.50) or their handcrafted single origin drips ($2). Hands down the best crafted coffee west of 315 Linden Alley. \n\nBonus: The young owners, that have invested a lot of love and energy into their dream and created something quite special, couldn't be more humble, sweet and real.\n\n* * http://vervecoffeeroasters.myshopify.com/pages/about\n* ** http://twitter.com/sightglass\n* *** http://www.slayerespresso.com\n\nDrinking Suggestions: \n\n1.With Espresso, less is more and milk is for babies, so if you're into Lattés, try graduating to a Cappuccino.\n2. With Single Origin, try no milk or sugar. It'll open you up the distinct, rich, and unique flavors of Latin America, Africa, and Indonesia. \n3. Make time to enjoy your drink out of glass or ceramic (paper cups taste like...well... paper, compromising a clean uncontaminated taste) \n4. Finally, don't get in a fit about \"it's not hot enough.\" Most places overheat milk, killing all notes (i.e. grassy, honey, etc.) and sweetness, resulting in a scalded/sour taste. \n\nP.S. To the entitled, self-important, egotistical yelp haters with no patience and an expectance for phony appeasement and jumbo syrup drinks, It's easy to destroy rather then create, isn't it?", "author": "Engelbert H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-27", "description": "This has rapidly become my favorite coffee place in the neighborhood. Without a doubt they mke the best cup of 'Joe in the 'hood and everyone who works here is super nice. Jason and his staff really create a nice, friendly environment and the cafe is well lit and comfortable. The sandwiches are well done and all in all they do a great job. \n\nI'd go here every day, but, as with many drip coffee places, sometimes you have to wait. Not that this is the end-of-the-world, but if I'm in a hurry I still go to Cafe Abir. Also the bagel making speed here is Herculean in its lethargy, but these are small complaints for an overall terrific spot.\n\nDoesn't get five stars because I have to be subjected to the horrendous sounds of reggae once a week...I'd rather listen to the death-rattle of my only child than reggae.", "author": "brant f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-31", "description": "Matching Half is a good, hidden little neighborhood coffee shop, although it can get quite packed on the weekends and they have been known to run out of most of the food on their menu by mid-afternoon.\n\nThe coffee is good though, as are most of the salads and sandwiches. Also, I seem to have a certain weakness for the homemade pop tarts...", "author": "Brian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-14", "description": "A friend of mine who lives in the neighborhood suggested that I check this place out. It's an awesome little cafe. They have free wifi and a simple menu. I ordered an apple and goat cheese baguette with some hand drip coffee. Both were tasty. I was also able to try some of their handmade oreos, which I never seen before, and homemade pop tarts. I'll be sure to stop by this place if I'm in the area again. Nice neighborhood cafe.", "author": "Frances V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-05", "description": "Definitely the best latte in the city. Not to mention the best little muffin things that are just the perfect size leaving you satiated without the gross-i-ate-too-much feeling.\n\nAdded bonus, the large table in the back, which is perfect for board games with friends.\n\nJust wish I was still living 1 block away.", "author": "Jane H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "Best coffee shop in the neighborhood. Only downside is that I never make coffee for myself because this place is conveniently next door.", "author": "Brendan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-26", "description": "The idea behind Matching Half is pretty cool... you no longer need to decide whether you want to go to a place with coffee, a bar for beer, or a wine bar.  Now, you can go to a place that does all three well.\n\nMatching Half has its soft opening this week, and it seems like a pretty cool place.  There's a bar on one side where you order your drinks and a line of tables on the other side.  The decor is simple, yet stylish, and they have wifi available.\n\nI need to go once they have their beer & wine license and get the kinks worked out, but for now I give it 3 stars.\n\nH as free wifi internet available for customers\nA lcohol or caffeine... you decide!\nL ocated in the Western Addition at McAllister & Baker St\nF ind room at the communal table in the back or take a seat at the bar", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-24", "description": "I absolutely love this cafe. They always provide water for my dog when I bring her by and their pop tarts are delicious. It's a great spot to sit and read or meet up with someone for lunch/coffee. Their turkey sandwich is really bomb too! I love the atmosphere of the place and the pictures that they change on the walls are always interesting and fun to look at. Keep it up guys!", "author": "Rachel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-03", "description": "I'm here almost every day when I'm in SF. The coffee is great and the people are friendly. I love that it seems halfway between a coffee shop an a friendly bar. Great beers are always on tap, with pints at only $4 during happy hour. The food is good for light meals, and is always fresh and well-prepared. \n\nThe only bad part is when all of you other people show up, and I can't get a table ;)", "author": "Mr S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-11", "description": "Good place, pretty decent coffees, great Customer service, great design, great food....all in all, it's pretty tight", "author": "Joshua D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-27", "description": "The Matching Half Cafe is the kind of cafe San Francisco can always use more of.  It's local, fresh, well-lit, and clearly cared for.  I've had more than a beer or two while saddled up to the bar, chatting with friends, and relaxing in the chill atmosphere.  The real measure of a new restaurant-cum-cafe is whether i'd want to spend another couple hours there, and with the Matching Half, I can resolutely say \"yes\" to the great service, great drinks, and relaxed vibe.  \n\ngood times!", "author": "Jacob M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-03", "description": "Dear Matching Half,\n\nUntil today, you were my among my favorite cafes.  Pleasant staff, great lunch food, good music, a big table to work at, and *excellent coffee*  - overall, a good place to park my butt for a couple of hours in the midst of my workday. \n\nMH, I don't know what happened, but the past couple of cups I've gotten from you guys have been abysmal.  Brown water, with none of the rounded bitterness that brings a tingle to my mouth in the morning. \n\nI'm sad - what happened?  How did you guys go south so quickly and dramatically?", "author": "Becka R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-28", "description": "This cafe is adorable and makes me wish that I lived in the neighborhood!\n\nI had the chamomile tea and the Pear and Fontina sandwich with a fig chutney.\n\nThe chamomile tea came in a lovely little pot and was excellent (loose leaf tea).\n\nThe sandwich was good, although I wished the pear had been paired with a stronger cheese, since I found that the sweetness over-powered the savory in the sandwich. I think this is a personal preference thing though.\n\nThe space is especially lovely, definitely stop by if you are ever in the neighborhood!", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-13", "description": "I absolutely love this place.  Friendly staff, -great- food, and a pleasant, neighborhood vibe.  It is an inviting atmosphere.\n\nBe on the lookout for: chocolate chip cookies with sea salt sprinkled on top, the kale salad, and their bagels.  The bagels they serve are reminiscent of east coast bagels,  but are a little lighter and less malty.  It is a nice balance.\n\nThe live music shows they occasionally put on are always fun, and they make an effort to have interesting art on the wall.  It isn't always to my taste, but it at least has artistic merit.", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-20", "description": "I remember this place when it was a run down, and then boarded up, coffee joint a few years ago. So I was pleasantly surprised to roll by the other day and see a new, fresh and bright cafe in it's place. \n\nSunday I decided to take a leisurely stroll and check the place out. It being warmer and sunnier (somewhat) than the last few weeks I thought an iced latte sounded just about right.\n\nUpon ordering said latte I was told I couldn't have it. I figured their ice machine hadn't been installed yet and was offered a chilled coffee. I agreed and my barista proceeded to fill a glass with ice and cold coffee?\nUm, why couldn't I have an iced latte, I inquired. \"We don't pour our espresso over ice, it shocks it... We take our coffee very seriously\" was his answer.\n\nReally guys.. really? You're gonna open a cafe and tell customers how they can and can't have their coffee. I mean, I'm a bit of a coffee snob too but come on, really?\n\nTo my further dismay the iced coffee I did get was kinda bland and now the staff just seemed to dislike me. Apparently I had done something wrong.\n\nOh well, not my matching half i guess. I'll stick with Velo Rouge and their strong ass, delicious iced lattes and super chill staff.", "author": "Scott W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-28", "description": "Ah yes, my cute little neighborhood coffee shop. The staff is super friendly and the patrons seems to be folks around the hood, which gives it that homey feel. I love the art (many of it from neighbor Workshop). They also have live music sometimes in the evenings. Their bagels and morning goods are tasty and while I don't love the drip Sightglass coffee (gasp), the lattes are great.", "author": "Emilia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-08", "description": "This place is a bright spot in a cool little four-corner commercial/residential area.\n\nThe view is sweet, big windows - you can watch morning waves of people heading to the bus stop. Also, there is always an art collection hanging on the wall inside.  \n\nAs for the food and drinks, it's all pretty much right on.  Well worth a visit.", "author": "Todd S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-27", "description": "Happy to have a nice coffee house/wine spot with outdoor seating close to the crib.\n\nIt's beautifully designed and has a very peaceful vibe that blends well with the neighborhood. \n\nI thought it was really pricey for what I ordered - $3.25 for a standard no frills latte in a teeny little to-go cup. The coffee was on par with other local coffee shops, but not exceptional - so I felt a little jipped on the price. (I could have walked 2 blocks further Central Cafe and gotten a latte twice the size with a little shot of vanilla for the same price)\n\nWe went at 9am on a weekday, it was full inside, but not packed and  it took about 10 mins. to get two lattes to go - i'm sure this is a \"working out the kinks\" thing.\n\nI'll definitely give them another go in a few weeks once they get rolling and figure out the swing of things. They seemed a bit disorganized and stressed out today - but I'm really glad to see them in the neighborhood.. \n\nI'll be back in a few weeks and really hope to up my review rating - I hope they get it all worked out and succeed-  as small businesses like Matching Half built right into the residential areas are great for our neighborhood.", "author": "Melissa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-04", "description": "Probably the best coffee I know of 5 blocks in any direction of the place, its a really well set up small space, and its right across the street from Green Chile Kitchen which is one of my favorite mexican places in the area.\n\nThey's cash only, which can be a bit annoying but its really good overall, I usually get the Mocha or the Cappuccino.", "author": "Abhinav S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-16", "description": "I only live half a block away & I've been there two times already. I love the look of the cafe and the owl logo. The coffee is good but it's just not hot enough. Coffee should = hot. First time just tried the drip for $2 just lukewarm. Just tried the premium for $3 which they drip on the spot. Almost cold-how could that be?! I like my coffee damn hot-almost burn your mouth hot. And for $3 bucks, I want that! Is that it too much to ask? I'll still go back but I expect a HOT cup!", "author": "Karen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-21", "description": "I love this place. I live nearby and have tons of options as far as coffee shops - this place is by far my fav. The staff is super nice and the chocolate croisants are da bomb. The granolla, yogurt, honey, and fresh fruit is always a tasty A.M. snack as well. Only complaint would be that there doesn't seem to be and outlets that work to plug your laptop in! Still, could never knock this place a star based on that. I'll be back tomorrow =}", "author": "Douglas S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-23", "description": "Update: Matching Half now accepts credit cards!!! BuhBYE bajillion dollar ATM fee!! Lalalove it.", "author": "Kacie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-06", "description": "There are a few other cafes closer to my apartment, but I'll willingly walk with heavy computer and everything to get a seat here. It's beautiful inside, with nice wooden tables, lots of windows, and cool art on the walls that seems to change regularly. It seems like the owner and employees care a lot about the cafe and work hard to keep everything top notch.\n\nI usually get just plain coffee, which is rich and not at all bitter, although sometimes I spring for the cappuccino. Espresso drinks are smaller than some might like, but they're so delicious it's worth it (think Blue Bottle style). The food is good too. I especially like the turkey sandwich, and the fruit and granola for breakfast time. \n\nThey have free WiFi too (but only one plug, and it's not close to most of the tables). Basically everything about this place is great. You can sit and study, eat good food, and they have beer and wine, outside seating, and they played all the World Cup games. Absolutely no reason not to go.", "author": "Tonya N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-01", "description": "Fantastic local coffee shop, great food, try the Kale salad!  Im headed there now for a latte!", "author": "Trent S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-16", "description": "The Hipster Laptop Mafia rules here, and too often there's no available seating. Single iPad drones camp out for interminable periods at tables for two, using it as a public library or a means of escaping their terrible roommates or depressing apartments. Sitting outside, an option, is hardly practical in most weather.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-15", "description": "Happy to finally be able to get a decent cappuccino within walking distance of home. That's a huge deal, but boy is it annoying to deal with the people there. It's like some random friends got together, bought a really fancy espresso machine, and opened a shop.  They are slow and unprofessional. It lacks the smooth speed of a legit coffee house.\n\nIf they got a little more on top of things, and used organic beans and milk, I'd be a much happier camper. But since there is zero competition in the neighborhood, I'll be back most weekends.", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-07", "description": "Nice joint. Very helpful baristas, and the coffee is made strong. The pop tarts are also extremely tasty.", "author": "C D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-19", "description": "simply put this place has the best coffee in the western Addition/NoPa area. i love the two dollar PBRs as well. the people are friendly and unpretentious. i live near by and wander in at least once or twice a day. the only downside could be all the tables being hogged by the laptops and everyone who thinks all they should have to pay for an office is the price of a 2.5 dollar latte. great sunny (afternoon) outdoor seating as well. \none of my favorite spots hands down.", "author": "nate c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-17", "description": "A small neighborhood cafe. GREAT Macchiato but only when pretty, female barista makes: Don'noh why... Drip coffee is too weak for me. Gimmie a strong, flavorful shot to make my day!", "author": "Yoshiko M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-11", "description": "over-priced cafe near Baker St., has Izze soft drinks.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-19", "description": "This place is a gem.  I can get great coffee or beer, depending on the mood and the time of day.  This place has a great feel and really good light.  People watching is good too.", "author": "Tom D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-07", "description": "I would love to inform all that MH now takes credit cards, thanks to the amazing technology that is Square. Yay!", "author": "Brodie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-24", "description": "I've noticed the quality of the coffee here starting to slip, a shame since they charge a premium for it.  Your safest bet is to get an Americano which always delivers.  The staff is friendly and they make some delicious food items.  There usually isn't enough seating with all of the Macbook owners camping out and it's too cold and windy to sit outside.  The rotating artwork keeps this place looking fresh and hip but it does feel like a scene sometimes.", "author": "N E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-21", "description": "First, best drip coffee in the city.  Totally addictive.  I've been to four barrel, blue bottle, etc, etc, and these guys just do it better.  Excellent location, too, with plenty of outdoor seating in a quiet and sometimes sunny location.  Friendly baristas.  Free wifi.  Good food.  So glad these guys are in the hood.", "author": "Rob E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-05", "description": "Cool, alternative feel. I like it. (Be sure to walk there, no parking)", "author": "Sean H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-19", "description": "Homemade poptarts are overrated. The service was so-so. Coffee was decent...I had the breakfast sandwich which also was ok (not anything I would drive back into the city for). It;s a decent place to get coffee if you're in the neighborhood.", "author": "Elaine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-02", "description": "Finally, something other than Starbucks within a 2 block radius. Every single cup I've had from them has been perfect. I love the brightness of the cafe and the quality of their beans. I get Sightglass from them every once in awhile for the home brew. On lighter days, we've brought boardgames to the back table. Perfect size for Galaxy Truckers. Pair that up with 2-3 cups of coffee on a rainy day and call it perfect.", "author": "Jacinta H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-20", "description": "Fantastic place. I love that it's so close to USF. The espresso is tasty and bright: citrus notes, with a medium roast flavor.  They offer pastries and a great sandwich selection. Definitely visit this place. I hope they can keep the campers out while school in session.", "author": "Ron S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-23", "description": "Wow.  I have rarely been compelled to immediately write a review (I'm actually still here...).  First of all - great coffee and awesome selection of pastries from Blackjet Bakers (so freaking good).  More importantly - the service is incredible.\n\nThere is only one working outlet (which is why I took off the star), but they pointed me right there and helped me get my stuff out of the way and let me set up and work.  As soon as I sat down, I spilled my drink ... classic.  Let me be clear, I spilled it.  I didn't get knocked over, it was 100% my fault.  They immediately came with towels and helped me clean it up, and all the while made me a new drink.  \n\nI know this may seem like the right thing to do, but there are so many snobby places lately that this common courtesy really goes a long way.  I will absolutely be back here for the ambiance, the coffee and snacks, and the people.\n\nP.S. - THEY PLAY AMAZING MUSIC!", "author": "Josh L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-13", "description": "This place either serves INSANE coffee or water as hell coffee.\nI was really psyched on a new coffee spot opening right on the corner of my street and when I went to try it out I was SUPER bummed.  It looks snobby inside, and you'll probably not be greeted by the staff because they are sort of snobby too.  The first time I went, i ordered a cofee to go.  That's IT.  15 minutes later, i had a cup of coffee in a small paper cup.  It was super hot and they don't have any of those sleeves to protect your hands.  They didn't appologize that it took that long for a cup of coffee.  I could have easily walked to the supermarket, and brewed my own in half that time.  But instead i paid 2 dollars for a small cup of insane coffee.  It was very strong and thus, made me insane.\n\nI wanted to give them a chance to redeem themselves, so I returned a week later with my boyfriend.  The service was a bit friendlier.  Boyfriend ordered an egg and cheese on a bagel, they only had 2 options for bagels.  We also ordered 2 coffees to go, and low and behold, the bagel w/egg and cheese was ready a good 10 minutes before our coffees.\nAlso, how can you have fancy coffee and no sugar that doesn't come in a packet?\n\nStep it up, matching half, this neighborhood expects better from you.", "author": "Alexandra A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-11", "description": "Near perfect--great staff, amazing coffee, beautiful space.  And, outdoor seating is well-needed in the area.\n\nOnly knock: $2 coffee refills.  It's a bit much.\n\nThey disconnected their power outlets so that laptop users won't camp out.  Great if you're just a patron, bad if you're going there to work.", "author": "david m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-04", "description": "I have been going here since they opened. It is hands down one of my favorite spots to get coffee and snacks in SF. The food is always good. I love the breakfast sandwiches, I always opt for avocado rather than ham on mine, but either way, they are great! They serve Sight Glass coffee, I like getting a cap and they always make it well!", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-07", "description": "Great products here, but what's the use if you can't enjoy them!\nThe gal preparing my bagel, literally stared at the toaster waiting for it.\nHow bout, maybe... wash your hands?!!!\nAnd not continuously running your fingers through your hair, or wiping your mouth, or fidgeting with your cloths!\nThen proceeding to mindlessly spin and spread, spin and spread, spin and spread, spin and spread...get the picture? Stop. You've already touched the bagel bout 30 times!\nThere's no excuse. You need to except that you are a food handler. And with it comes responsibility. \nDon't run your fingers through your hair or across your mouth ever!\nAnd if you do, stop and wash your hands immediately. And spreading a bagel requires about two swipes. \nAnd if you're asking yourself, why does this all matter?\nThen there's the problem...", "author": "Ame W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-04", "description": "Tasty food, great customer service, but...\n\nCoffee used to be hefty-hefty-hefty but is now WIMPY-WIMPY-WIMPY!  Pls fix thx.", "author": "a s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-26", "description": "Back for a second review. \n\nI still love coming here. The music, the coffee, the food; all of it is excellent. I understand that some people are less than pleased with the number of outlets. However, let me broach the topic like this. Would you rather be able to sit in here for 2-3 hours(of battery life) and enjoy a sandwich, pastry or espresso; or would you rather not be able to take a set at all because the 6 early birds have been camped out for hours on end with an endless power supply.\n\nThe Food:\nI am always skeptical of new food places, part of being OCD. However, I did have a tomato, moz and basil sandwich there a few weeks ago and fell in love, I now have one at least twice a week. Same goes with the breakfast sandwich. Add a little tomato and it's perfect. Throw that fucker on a croissant and POW!\n\nVerdict on appeal:\nStill one of my favorite places to spend an afternoon. Start of with a sandwich and espresso. Finish off the experience with a few beers as I read the paper and all of the sudden the news ain't so depressing. And look at that it stopped raining as I put a period on this review.", "author": "Jackson D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-15", "description": "Nice addition to the neighborhood.  Great capuccino, great snacks.  A little pricey but worth it.\n\nAlthough... about a year ago they made alot of noise about how they intended to buy a Surly Big Dummy or some similar hipster El Camino so that they could go greener and localer.  They staged an advertising campaign to drive business to raise money for it, and got the local bike crowd to urge customers in - but as far as I can tell they're Dummy-less.", "author": "peter s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "What a pleasant surprise!!! My husband + dog came here for lunch on Sunday and we were greeted by a very friendly staff. I ordered the ham/cheese/tomato panini and it was DELISH.  Perfectly thin ham, melted cheese, and the bread was oh so soft!  We enjoyed their tables outside out front, and the staff even brings you your food when its ready.  Im so happy this place is in my hood! Ill be coming here weekly :)", "author": "Veronica P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-26", "description": "COFFEE SHOP SNOBBERY 101---I really wanted to like this spot because of it's location. Sunny outdoor seating and a clean indoor appearance makes matching half appealing, BUT more important is a quality product and customer service both of which are lacking here. They serve a Latte in a 8oz to-go cup, better know as an 'Africano' because they believe this to be the benchmark for proportions and something that sets them apart from the multitude of coffee shops in the area. Normally this would be fine because if you wanted you could ask for a larger cup and that is what you would get. Not at Matching half though! They believe so strongly in their idealistic proportion rule that they are willing to have an argument over it thus losing valuable business over a silly principle. Believe me I have tested them on many occasion in hopes they would step up and understand how to properly serve the needs and wishes of their customers only to be met with arrogance or some stupid excuse like 'the larger cup doesn't fit' or 'our milk steamer can is the size of a thimble' or 'we take our coffee seriously and that isn't how you are supposed to have it' or 'we've run out of larger cups' when you can see them behind the incompetent barista who on average takes somewhere between 10 and 15 minutes minimum to make your drink. Cutting off the nose to spite ones face it seems and far from making friends. \n\nCoffee shop snobbery and an establishment which offends it's customers with it's overt incompetence is not where i would choose to spend my daily 4 dollars and would advise others to think twice about supporting this place. They are rude and defensive purveyors of marginally decent coffee that pales in comparison to Mojo, Ritual, Blue bottle, Apollo, and Cafe Abir which is just around the corner. Remember Matching half people...without the support of your local community you have nothing.\n\nPS let us all remember as well that out of the 51 or so reviews the lion share come from friends and relatives of the owners. For a place that displays such high levels of SUCK i can't imagine that there are 50+ people out there who honestly like POOR service and are willing to overlook fundamental flaws in every aspect of this type of small business. Listen to the real people who spent the time writing and not the bubbly rants of blind loyalists.", "author": "Trevor M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-31", "description": "Still love the coffee, the internet connection and the vibe but finding out today that there are pretty much NO power outlets. There are 3 along the back wall all with a little sticker on them that say \"No Power\", can't find any others either. Grrr... this is kinda an important thing for a cafe to have, right?", "author": "Rachael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-17", "description": "Very nice space and decor, and equipped with a Slayer espresso machine, like Sightglass.  And, like Sightglass, the Slayer-made espressos can be a bit inconsistent, and occasionally on the acidic side.  That said, they've never been less than very good, and the people are very friendly.  On my WinXP laptop, I haven't consistently connected to their wi-fi network, but my iPhone does, so I can't hold that against them. :-)", "author": "Ari M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-09", "description": "love this little corner coffee shop. yummy breakfast sandwiches, addictive yogurt + granola + fruit bowl, and tasty cappuccinos. lovely ambiance and friendly staff. one of my favorites.", "author": "Jane L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-06", "description": "Latte is too small and not hot enough. They need to crank the temp up and offer more than 1 size. Great location across from Green Chili.", "author": "Shawn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-16", "description": "I've known Lauren since jr. high, and she's always had impeccable taste. While everyone else went through their awkward phase, she just oozed style and class, so when I finally meandered over to her new cafe, Matching Half, I wasn't surprised at how awesome it looked. She and long time boyfriend Jason hand made the tables and bar and they're so sleek and sophisticated. The chairs were modern and comfortable too, and the glasswear is gorgeous and displayed tastefully. The menu is smart and simple, and done really well. My fav is the breakfast special - for somewhere around 6-8 bucks (my bad for not paying complete attention to the price) you can score a delicious breakfast egg sandwich on brioche and a PBR. For a dollar more you can move it on up in the world and get a mimosa to replace the beer.  My kind of deal.", "author": "Amber K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-01", "description": "I would really like to recommend this cafe, especially because in theory it's an excellent addition to the neighborhood.  After another bad experience, however, I'm avoiding it and keeping my fingers crossed that the owners either hire someone to help them with operational and customer service issues, or figure it out very quickly on their own so they retain their currently enthusiastic clientele.  For now, I recommend you stay away unless you like getting high blood pressure in the morning and have a lot of time to spare so you've got \"cushion time\" should your order get screwed up - very likely - and need time for a \"do over\".\n\nThe Bad:\n-If you handle money, cashier person, DON'T handle food with your dirty hands -- it's gross.\n-It's sad that such a beautiful cafe should be filled inside and out with piles of dirty plates, cups, etc.  It was amusing when one of the owners, as she slowly made espresso drinks, kept apologizing that they were out of plates.  Um...get someone to buss and stock.  \n-You can't serve coffee and espresso drinks and not have regular sugar.  Not acceptable.  I don't care if you are \"out\".  No excuses.\n-None of the baristas seem to have had any training and this has made for lukewarm drinks and VERY SLOW service.  \n-I ordered a wheat bagel with cream cheese at 10:15 a.m., and they were already out of cream cheese, but I wasn't notified until ten minutes after I placed my order.  I was told it would be awhile before they got more.  (How about a quick trip to the convenience store across the street?)  I switched my order to wheat, cheese and egg.  I got a cinnamon raisin with cheese and egg.  After having waited 20 minutes for my food I took a deep breath and notified one of the owners, and he took care of the mistake quickly.  By then I needed it to go, and I was done with my latte.  Mistakes happen, but they've got to be handled quickly.  So far, there is nothing quick about the Matching Half Cafe.\n-Admittedly annoying and picky comment:  the font of the sign hanging outside would look great on on a business card...just not on a large sign.  It makes my eyes involuntarily cross every time I look at it.\n\nAs someone who has worked in a cafe, I totally get that it can take awhile to work out the kinks -- but the timeframe for getting it right better be a super fast one.  Otherwise the novelty of this beautiful cafe will wear off quickly, no matter the pleasantness of the owners or the quality of coffee.  I already had a couple of great choices for coffee and bagels, and I'm happy to stick to them.\n\nThe Good:\n-No discernible attitude among the employees.\n-Most beautiful cafe bathroom I've ever seen.\n-Lots of light inside, and lots of seating outside.\n-The promise of a good afternoon/evening spot for beer and wine.\n-Nice owners with good intentions.", "author": "G. B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-21", "description": "Was stoked for a nice coffee shop to open up.  The bummer is they can't keep their drip coffee hot.  Thy put it in containers and give it to you on cups that stay lukewarm for 3 minutes.  Everyone In our building had to ditch this place.  We get our coffee at the Mexican place across the street that opens at nine and has lump sugar.  We gave matching half a chance but they never did anything about it.  Bummer.", "author": "Tim T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-26", "description": "Matching Half Cafe is an oasis in a city overrun with chain coffee shops. The couple who started it literally poured their hearts, souls, and sweat into remodeling the venue and it shows! Enjoy a quality espresso drink by day (or brunch with a mimosa added for only a $1!!!) and a glass of wine or beer by night. MHC boasts a clean, modern aesthetic infused with old-fashioned hospitality. Plus, there's the bonus of outdoor seating!", "author": "M. D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-17", "description": "I feel so lucky that I happened to live in the green side area of the city. It's not Central Park, but we have lotsa trees and amazing grass and we have Matching Half Cafe. This cool-feeling corner neighborhood cafe has one of the best Chai Latte that I've ever had. Seriously, I'm not trying to be their spokesperson or anything, but it's delicious. It gives you the chai kick but still gives you enough foam to play the mustache effect with. Matching Half Cafe is becoming one of my favorite place to have my afternoon coffee. The place is spotless. Uh oh..., I should say, I got introduced by Mission Minis Cupcakes from there too. I love this place. Can't you tell? *hint: 5 bright red stars*...", "author": "Inne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-26", "description": "I love love love this place!! Great, local coffee and snacks, lovely interior, awesome decor and the employees are fucking rad! Everyone that works there is super friendly and aren't pretentious like most folks at great sf coffee shops. Well done ya'll.", "author": "Liza Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-26", "description": "Tremendous espresso-well made using a really nice blend. This espresso enters Copenhagen Coffee Collective territory. Sugar and milk would only detract.", "author": "Pope M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-14", "description": "I was super excited when I realized a new cafe was going to open on this corner.  Went to check out this morning and was sorely disappointed.  If you are expecting to get a coffee drink that actually fits your desires, this is not the place for you.  Your options: whole milk or nonfat.  I'm sorry, that is a HUGE difference in taste.  And no offer by the barista to make it blended.  I don't consider myself to be a high maintenance person, but come on, offer up some lowfat!  Plus it was $3.25 for the smallest latte I've ever gotten.  Half the size of a normal small latte.  Definitely not worth the price when it wasn't even really what I wanted to begin with.\n\nI'm all for supporting local business.  But I have no interest in an overpriced, snobby, hipster-esque cafe in the neighborhood.  I'll stick to what's already here.", "author": "a. w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-13", "description": "Absolutely LOVE this place!! My only complaint (which is why I'm only giving it 4 stars instead of 5) is that there are almost no outlets to plug in your laptop so be warned that your limited to your battery life. Otherwise the coffee is oh so good, the staff is great, and the food is yummy!!!", "author": "Nathan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-15", "description": "Dean and Deluca Meet the Western Addition\n\nThe Matching Half Cafe brings a touch of class to the Western Addition (or if you prefer to NOPA). \nThe white interior with subway tiles lining the walls has a Dean and Deluca feel that adds much to this up and coming area of the city. \n\nThe coffee is divine as are the pastries from the Bakers of Paris. \nThe staff is a little short handed, but this appears only to be because business is much better than the owners had anticipated. \n\nThe cafe has really taken off. With lines forming outside the door on Saturday  and Sunday\n\nMore importantly, the cafe adds another eatery within walking distance of Western Addition/NOPA residents. \n\nWith the opening of the Matching Half Cafe, this revitalized neighborhood has gained a great cup of coffee and a new sense of community in the bargain.", "author": "Michele F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-09", "description": "Cute spot, great coffee, and the cappuccino I dream about...but I don't think I have enough urban outfitters in my life to spend any significant time there...I think I can get over that though.", "author": "Liz A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-28", "description": "Not my favorite. I go here on occasion because I it is in a convenient location for me. \nThe coffee is usually a fruity blend, I tend to like a more earthy roast. \nIf you get a coffee \"for here\" they don't give you any sort of discount if you want a refill. \nThe sandwiches and pastries are overpriced.\nI will say though, that the service and the atmosphere is very nice.", "author": "sarah d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-03", "description": "What a great addition to Western Addition.  The espresso drinks alone merit a 5 star rating.  Seriously as good as anything I get at Blue Bottle or Four Barrel.  The fact that it's a cute, light-filled space with nice peaceful views, outdoor seating and good bagels?  Just icing.  Looking forward to many more visits.\n\n\n@Kandace of prev. review:  If you are afraid of the conv. store on Baker and McAllister, maybe you should move to Walnut Creek.  Just saying.", "author": "Troy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-25", "description": "Super good.  Very fresh.  Only complaint is no ketchup!  Really?  With a breakfast sandwich on the menu?", "author": "Stacey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-13", "description": "I recently tried the caprese sandwich here and it fucking rocked. Must reiterate the five stars.", "author": "Jasmine F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-23", "description": "It's a nice place to have a cup of coffee. I love to go to Alamo square and I always stop by here and grab a coffee :)", "author": "Jay R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-23", "description": "Went here the other day to study after I heard they had free Internet and good coffee.  I loved the space, it has a calming effect and is pretty quiet.  The coffee is delicious, food is so so.  4 stars for the ambiance and coffee, would have probably given 3 for the food.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-23", "description": "The coffee is to die for. The staff is the sweetest and they have some of the best things to nosh on in the morning. And it is beautifully designed and bright. I love to start my mornings here. It should be illegal that this place is in my neighborhood, as my coffee and espresso intake doubled because its so yummy. I am addicted, but I am happy about it!!!!", "author": "London E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-02", "description": "I was so excited to see the dark and dirty hole of a \"Cafe\" re-made into the light and tasteful place that it has become.  \n\nI tried a coffee and sandwich today and was surprised by both the wonderful flavor of the coffee and yummy taste of the sandwich.   \n\nThe staff and owners still seem to be working out the kinks (they have only been opened a week now) but their enthusiasm and obvious desire to please was evident.\n\nI hope they will continue to improve and then we will have what the neighborhood has been sorely missing for so long; a warm and friendly place to gather and converse.\n\nI for one will continue to patronize as often as I can as I am certain the owners will learn from this first week's experience.", "author": "John S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-25", "description": "Not really a fan.  Love the location, staff was fine but the two times I've gone there my drink was lukewarm (chai latte and, today, regular latte).   Isn't coffee supposed to be hot or is this some new hipster deal that I've not yet heard about.  Whatever, turn up the heat for christ sake!", "author": "Drew W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-30", "description": "Yet another disturbing sign that the last bastion of relative affordability and non-yuppie scumdom is coming to a sad end! Somehow these people managed to take a pefectly lovely, warm inviting space and turn it into just another cold, snotty and unpleasent place  for cold, snotty and unpleasent drones to gather hacking away blindly on their laptops. PLEASE people...go back to the Marina and take the yuppies with you.", "author": "Shay M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-21", "description": "What a great, clean cafe with yummy lattes and good bites too.  I typically will pick up a coffee on my way to work or a bite to eat on the weekends.  I've found always friendly service and am extremely happy to support a  great local business!   I recommend trying those Mission Mini cupcakes too, they are delectable!  Don't forget, it's cash only.", "author": "Leslie U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-05", "description": "Alright, it's time that I set some of these yelpers straight. \nIt seems as though people have been rating this place in very strange ways. \"Yeah, this place is great. Great coffee, great food. 3 stars.\" \nThese people, obviously don't know much about the mcbaker intersection, and have obviously no memory of the terrible two, neon and one world. God damnit these places sucked so bad that it was enough to make someone walk/ride to divis to get a decent coffee. I do say decent, not good because divis doesn't have good coffee. \n\nThat's right, this is easily the best coffee in Western Addition. And I dare you to argue with me on this. Don't even think about mentioning Mojo or Abir. Oh shit, Please don't mention Abir. That shit hole is the absolute worst. I feel like I'm on stage every time I go in there. At least, it's the worst next to the now deceased neon and one world. Anyways, let's not get off topic here. \n\nWhy is this new place good? Hand made, drip coffee made with amazing coffee beans. One of a kind espresso and cappuccinos. Superb food, amazing decor, great music. Crap man, what else do you want in a coffee shop? Not to mention how nice the staff is. \n\nYes, they're new, yes they are working out small kinks, but this place is already top notch. And they're only going to get better. I just can't wait until people start talking about how great this place is months from now. \"Have you been to Matching Half? It's my favorite coffee shop.\" That's what they'll say. I'll just respond, \"Yeah, no shitJohnny come lately, I loved it originally. When it wasn't so damn cool to love it.\" That's what I'll say.", "author": "scotty s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-01", "description": "the staff is all very nice and the coffee is off the hook. what more could i want. i used to settle for the coffee at the old place that was here before. no more settling here. \n\nthey take their brew seriously with out the typical coffee shop employee attitude.\n\nhighly recomend for a cup to go or better just to kick back and enjoy. \n\nwhen the weather gets better you wont be able to find a seat in this place. especially on the outdoor seats.", "author": "Dennis K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-27", "description": "This place is three blocks away from my house.  I've been here around 3x.  For drinks, I've only had their drip coffee and it is outstanding.  They also make a mean bagel.  They don't slop on the cream cheese, but rather spread it carefully and don't overdo it.  The breakfast sandwich is also pretty good.  They are a little bit slow, but they are so nice it really doesn't matter to me.", "author": "CC L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-27", "description": "Matching Half Cafe appeared out of nowhere this week on my bike route to work so I stopped in for an espresso.  Really nice inside, felt clean and minimal but comfortable.  Tables and chairs outside looked like a great place to sit in the sun.  My coffee was delicious, they carry Blue Bottle and Four Barrel.  I didn't get a chance to eat but the menu looked tasty.  Apparently they are not fully open yet, for sure I'll be back to check it out again as they get into full swing.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-06", "description": "I've lived in the western addition/panhandle area for about 6 years now, and one thing that has been sorely lacking is a place with great coffee and good, cheap beer. Cafe Abir went through all those months of renovation and somehow got worse, and Mojo just isn't my scene.\n\nMatching Half cafe changes all that. This is hands down the best coffee in the neighborhood (and I would argue a larger territory), they have a great selection of awesome, affordable beer and wine, and a really solid food menu. The decor is simple, beautiful, and bright. The staff is nicer than you could ever imagine. \n\nSeriously, go. You'll love it.", "author": "Gavin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-03", "description": "Hands down the best coffee I've had since leaving Melbourne 12 months ago. Rich, dense, smooth, perfectly moussey foam - it's divine.\n\nFit out\nThe interior is lovely, simple and stylish - what, no cheese? It's a classy fit-out, and about time San Francisco got some of that. That said, they could do with some more art on the walls and it was also a little warm in there on an indian summer late morning. I adore the wall planter. (4/5)\n\nFood\nLooks like they're doing the \"let's wait to order food til we see how many customers we have\" thing. Which means that the food ran out REALLY early on the weekend and I didn't get to eat anything. Excusable for a first weekend, and I really hope they fix it. (-/5)\n\nStaff\nThe baristas are wonderful, and everyone is very friendly. It seems like a few of the younger girls are getting their ocean legs, but hopefully they'll pcik up soon. I would also recommend that they figure out what they're doing about table service - it's not clear how/who is clearing tables. (3/5)\n\nCoffee\nIf this place scored zero on everything else I would still come here for the coffee. I'm a MASSIVE coffee snob and their espresso is a beautiful thing to behold. It made me very, very happy (5/5)\n\nOverall, I'm super excited that this place has opened up, and I look forward to watching them learn and grow. Good luck Matching Half Cafe!!", "author": "Terese S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-30", "description": "i looove this place. the owners are possibly the nicest people in the neighborhood. they work 24-7. the staff is great! it has helped this corner thrive. you go in here and you get to know the owners, you understand they care about thier business and learn your name and drink fast. where as green chile, i go in 3 x a week and they have no idea i exist. \n\nthe coffee. amazing. sightglass is on par and possibly better than blue bottle & ritual. the guys who work at sightglass there are in the cafe sometimes and super nice! the sandwiches are good. the service is great. the environment is great. \n\npeople judge sometimes on here, but guess what, a fresh high quality cappucino isnt cheap anymore and its in small cups. its gourmet. i think its well worth it. its one of the best capps ive had. and it says something that foodies from all over the city hang here for coffee. delfins. check. quince. check. nopa staff. check. \n\nso glad they are here.", "author": "kelly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-26", "description": "I love this coffe shop, I really do! Walking distance from home, fast internet, good food, I couldn't ask for more. As I walked in there was no one to be found over the counter, I waited for a couple of minutes for someone to show up. I asked for coffee over ice, and the \"barista\" replied offended: \"we don't do that here\". Then I asked kindly for a cup of coffee and a glass with ice ad she still answered with an attitude. Fine, I said, give me a cup of coffe, a glass with ice and I'll fix my drink when you are not watching. She looked at me confused and proceeded with making the coffee. Later, she charged me for the coffe and she was still rude.I would like to ask the Manager to be more selective while hiring, as this chubby, blondish little prick needs to learn how to deal with customers. There are way too many unemployed people out there, that could do a much better job. Please feel free to contact me with any questions.", "author": "paul V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-01", "description": "New fave spot in the hod ya'll.  The cat that is behind the bar usually is rocking out the reggae.  Clean, vibrant, fresh look inside with a big communal table in the back, and 2 tops along the ample windows. The coffee is aiiight but the sandwiches are delish.  Try the Mozzarella and Basil grilled sammy.  From the \"weird but cool dept\" : bathroom is fresh and clean.  WiFi 411:  free wifi. spotty connection,  no power outlets makes this gorilla not so happy.  Worth buying an extra battery for however.", "author": "Naeem N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-31", "description": "ok so my second time in here the very nice young lady behind the counter almost set me off. i wanted med double latte in a 12oz cup.. i like a stong cup without a lot of milk. and as much as i love love loved the first cup i had here the previous day, i felt it was a bit small. so thought i would just get a bigger cup. na uh, not here.\n\nback to the sweet young lady. she said that they felt thier coffee was perfect in that size cup with that amount of coffee. Whaaaat? i know my coffee sister. i will never question them again. i just order two cups!\n\nyou know what. i love that they take their coffee so serious and they are all still super nice. i mean lets face it coffee  shop employees tend to be the coolest cats in SF for some reason. they have more attitude than a pro-sports althlete. need an example check out how cool, they are in Cafe Abir around the corner. they are sooo cool they refuse to actually speak to you. uh hmm. soooo cool.\n\nnot here they are true barristas and they are all super coolnice and friendly.\n\ni cant pass this place without getting a cup anymore (ok two)\n\noh and the icing on the cake, the food is killer as well.\n\ngreat job guys", "author": "Jorge E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-27", "description": "I'm happy that these guys opened up shop here.  For years, my husband and I have been longing for a business of better quality to open at this location, (and the one formerly occupied by Neon).  Our wishes are finally coming true!!  I got a cup of Sumatra this morning that was nicely brewed.  It could have been a tad hotter, but it is the 2nd day of business after all.  I'll be back soon for the food!", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-22", "description": "consistently RUDE with an extra measure of atti'TUDE!\nsure the coffee is good- but I honestly don't get why (in a customer service industry, and yes, that is still what it amts to) the arrogant, \"don;t really give a crap\" about you attitude has to be a part of it! But of course, as long as the customers  swan all around, and are misled in to thinking that this is part of the thing that makes it \"chic\"... well, then it will continue. I've given them lots of chances, and wondered if at first it was just me-- but I have had other people say the same thing. It comes down to this: it's a \"top down\" problem (and potentially, solution.) But after going in again today to see the same crap from the owner and the crew working around her-- I realize it's not going to change (unless customers demand it). So I will just take my business somewhere else... like Matching Half or even Farm Table where I feel my business is actually appreciated.", "author": "christina h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-23", "description": "I get up every Saturday stoked to go to this place and chill out with a delicious cup of their premium drip (Verve Roasters). I like everything about this place. They have good small breakfast items like bagels and sandos. My GF says the chai is awesome. Everyone always seems friendly to me. Definately no snobby coffee attitudes like you get at other places with comparably awesome coffee. Being somewhat of a beer snob, I am impressed with their small selection of beers too. All in all, i will always highly recommend this spot to anyone.", "author": "DJ A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-05", "description": "The coffee isn't hot enough in the mornings, bummer. I put cream in it and it's cold within 10 minutes.", "author": "Brian Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-02", "description": "One size doesn't fit all, and even for a small size the price is steep for a soy latte.  Unapologetically without vegan cookies, donuts, or muffins.  All seating (at small tables, bar or outside) is hard.  Tables inside on a sunny day are too hot and glaring from afternoon sun.", "author": "Bob G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-27", "description": "Basic yes, but nicely styled.  I am extremely picky when it comes to coffee and the cappuccino was good.  The breakfast sandwich was simple yet tasty.  Very nice addition to our neighborhood.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-20", "description": "First of all, this is about 100 steps from my apartment and I have just set foot in here.  I'm actually enjoying a Chai Latte as we speak.  Victory.  It's raining, and I couldn't possibly walk a little farther to Bean Bag, so alas, here I am.  Cozy, clean--Yes. Overflowing with outlets to charge your computer? Not so much. Come here for a coffee or a mini cupcake, but if you're like me and have a bunk comp. that doesn't hold its charge, you'll be perched in the window like a trophy, next to the only outlet that works.  Ditch the computer and come with a friend instead.", "author": "Laura A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-01", "description": "I'm so excited that we have such a great coffee spot in our neighborhood. I go there so often that my friends have started calling The Matching Half, \"Anthony's Place.\" The people are super friendly, the coffee is exceptional, the attitude relaxed; I even like the sign printed on brown paper. If you're ever near, definitely stop by.", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-30", "description": "Dog friendly, outdoor seating, good vibe, and friendly service.  What's not to like?  Well actually, the coffee is extremely strong (individual drip style) so watch out.  And the wine list and food options are a bit short so hopefully they will expand those.", "author": "Russ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-18", "description": "I am so excited!!! A great new coffee shop in my neighborhood. Perfect ambience, no crowds, tranquility and amazing space to work - the coffee is good, strong and could be better. But hey, I am a coffee snob, so that said - I give this place 5 stars.", "author": "Judith B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-05", "description": "Wow!  I live at this corner,  and am one happy local!  I didn't know how big of a hit this place would be.  It feels so great now to see all the people crowding around this new popular joint.  Cheers to the owners.  Great Job!   So simple, yet beautiful inside.   And super cheap eats!   Yall will definitely see a lot of me :)", "author": "Marqus B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-20", "description": "The coffee is cheap and tasty, the food smells and looks amazing. The gourmet pop tarts are delicious (try the jalapeno!). The only downside is the lack of electric plugs, but they probably do that on purpose to keep students like me from posting up all day and only buying one cup of coffee...", "author": "J J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-23", "description": "Nice atmosphere, something that feels like the Mission but in the Panhandle - which is nice. Clean, modern and quiet. This is what makes it a 3 star place instead of a 2. \n\nMy complaint is about the coffee. They call it drip, even go through the trouble of pouring hot water into your cub and then pouring it out to heat it up, and then pour the pre-made coffee out of a thermos! There is nothing drip about that. \n\nMy second complaint is the WiFi is spotty.", "author": "Sean R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-11", "description": "just got the kale salad to go.  Not enough dressing to make eating raw kale worth it.  Please note.", "author": "Sheila S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-05", "description": "Was on a bike ride and stopped in. A great neighborhood cafe. You can feel the love.", "author": "lucas b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-23", "description": "Love love love. \nI love popping in for a quick coffee fix. Sightglass coffee is one of my favorites. It's best when they aren't busy and they are able to make a drip coffee from scratch. \n\nThank goodness they have bar seating which is usually available. It can be frustrating and a total bummer when you expect to just sit for 10 minutes with a coffee and a quick bit, and laptops are spread out everywhere. That being said- the visitors to this cafe are pretty chill and seem to sit to the back large table and leave the smaller tables or bar free. Also there is no where to plug a computer in, and that keeps traffic moving (great idea!) \nGreat granola- definitely expensive for a breakfast, but it's a nice weekend treat. It's definitely much fresher than other cafes, and they use good yogurt/honey.\n I love their salads and the unusual paninis. I've never had the egg bagel, but it looks pretty good. \nThe owners are always really happy and polite, however some of the newer hires have been a little intimidating to order from. This cafe always seems so upbeat, happy, efficient, so the grumpy barista's should go get a job at Cafe Tude where they indulge in giving halfass service.\n (ie: one day they were out of the yogurt for the granola bowl, so she said in her rough tone she said they were all out - but the owner stepped in quickly and said he could use milk if we wanted, which was fine with us. He saved the sale because we were just about to walk out and find breakfast elsewhere, but in the end we stayed!)", "author": "Alexandra a."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-07", "description": "I came here a few days ago.  I was pleasant surprised how nice the space is.  I had seen this place before it turns into the cafe it is today, and I think the owners did a great job to transform this space.  The space is welcoming, lots of light.  And the use of space is great, lots of seating, and the place is clean overall.  The first problem I had was the cappuccino.  The milk wasn't frothed properly.  The top was covered with large bubbles, instead of a nice shinny microfoam.  Second problem is with the pastry.  I know they don't make it themselves.  I ordered the nutella pop tart made by Black Jet.  After I cut it in halves, one half of it has no nutella at all.  May be the pop tart was heated in a toaster, so when it was heated, all the nutella went to the bottom halve.  Before I left, I showed the leftover of the half pop tart to the staff.  I told her that there's no filling in it.  She looked at the opened up pop tart, didn't say anything, and walked away.  Better barista and better service would make this place 4 start for me.", "author": "Tim R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "Rocket  fuel  for  the  masses! Really  great, fresh  coffee  and  only  $2.00!", "author": "Spike B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-26", "description": "Holy !@#% the coffee is strong. I like Peets and Blue Bottle but this is going too far. Hit me in the gut like a cannon ball. Be warned!", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-14", "description": "I'm pretty sure cafe life doesn't get better than this (seriously). Great coffee, delicious food, beautiful atmosphere.", "author": "Martina D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-20", "description": "living directly on the block of MH, i eagerly awaited as i watched it being built. passing it every morning with lots of hope of having coffee in the morning and drinks in the evening.\nwell.... it sucks monkey balls!!!!\ntwo dollars for a small coffee that tasted funny??? then for the rude cashier to be totally dismissive towards me??? hummm, not interested.\ni was willing to give it another chance, but reading the other yelp reviews, its showing that it wasnt me being overly sensitive, as rude service has been dished to the others..... ill keep my dollars and get coffee a decent cup for 1.25 downtown and call it a day.\n\nohhh and the fact that this place is sooooo lilly white.... there is no flavor going on what-so-ever. like one of the other yelpers said.... go back to the marina, and take the yuppies with you. i muched liked it when it was a dingy coffee house with a make shift print screen outfit on the other corner and a greasy spoon opposite of that...  yes the yuppies have taken over.... they suck, my money stays in my pocket and i will just look at them with disgust as i do every morning when i walk by. same for green chilli...", "author": "tiffany h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-20", "description": "Very high quality coffee drinks, cozy decor, and friendly vibe. Achilles heel is the food-- so-so sandwiches and salads at rather high prices. I drink lattes and coffees here several times a week and think it serves some of the best coffee drinks in the city.", "author": "Jane R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-09", "description": "Do not come here if you plan on working. They have no power outlets for use except an awkward one under the cream and sugar counter, which would barely reach one table. I tried to cancel my latte order once I realized this but the rude woman at the counter basically told me I was out of luck. They weren't even done making my drink! I left without my coffee and $3.25 poorer because I didn't want to bring it into another cafe.", "author": "Lisa E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-12", "description": "mmm.  this place is the shiznit.  who says SF doesn't need another higher-end coffee joint?   it's great to be able to grab a first rate cup of coffee on the way to work and a beer on the way home.  as far as new businesses go, this place really has what it takes. 5 stars.", "author": "michael s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-26", "description": "this place is the jam.  good people and good coffee.  what else do you need.  oh - and for the cafe abir person... you can stay there.  we don't want you at matching half.  we will keep our patience and cute owl t-shirts out of your way.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-28", "description": "when the alarm goes off on monday mornings i literally pry myself out of bed thinking of this coffee. the drip here is simply delicious.  the pours never fail to be strong and the coffee has a distinct taste that will make you question why all coffee doesnt taste this good.  \n\nthe interior is crisp, a little pretentious at times but the clean decor will allow the shop to grow easily. my one complaint is that they dont open until 7!  a half hour earlier and id give them 5 stars.", "author": "devin d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-24", "description": "i really want to like this place, but i just can't give it a good rating.  their coffee is usually cold, only comes in one nice, and takes about 20 minutes even for just a drip.  they need to re-think their business plan a bit.\n\nthat being said, the people are nice outside of the loud parties they have thrown that i'm fairly sure are not legal.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-15", "description": "just had the most pretentious coffee buying experience of my life here. i walked in and ordered an espresso to go. sounds simple, right? the barista took a long pause, got a funny look on her face, and responded with \"yeeeah, we don't do espresso to-go here.\" looking confused, i wondered if they were out of to-go cups or something. \"see, the owner doesn't want us to make espresso to-go, because the crema sticks to the inside of the paper cup... and it's just not how you drink espresso.\" she explained. seeing clearly that logic and customer desire had nothing to do with the argument, i began to leave. \"wait.\" she called after me. i turned back to the counter. \"i can make one just for you.\" she whispered. i agreed, paying two dollars for the espresso and one dollar for a tip. after what seemed like a really long time for just an espresso, she put my drink on the counter. it was a small cup with less than one ounce of average looking espresso in it... i mean, it barely covered the bottom of the cup. i'm not good at math, but it cost me more than a dollar a sip plus some embarrassment on the side. in the end, i'd much rather go to a place that will just give me what i ask for than one that wants to teach me an expensive lesson about how i should drink my coffee.", "author": "zachary p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-30", "description": "The pastries and sandwiches are solid. The lattes are good, but the drink menu is more minimalist than what I prefer in a coffee shop. The brown packaging paper with sharpie makes me too nervous to request any deviation for risk of being told what I want is NOT an option.", "author": "Raquel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-01", "description": "this new joint was a welcome surprise.  the interior is positively serene and really highlights the charms of the space.  great coffee and a very functional outdoor seating area made for a perfect morning.  i'm sure this place will come into its own in good time.", "author": "Philip M."}
