{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "The summary: not really a tiki bar. A dive bar that maybe used to be a tiki bar. Some games, random decor, an awesome back patio, middle-tier drinks with heavy pours, and a decent happy hour.\n\nWhat's good? Drinks are less than $10, the pours are heavy, and if you like divey atmospheres, this is a great place. Sweet (newly renovated) patio!!\n\nWhat's bad? Well, it's not really a tiki bar too much. Don't come here expecting an extensive cocktail menu, custom tiki cups, or tiki historical references. It's also divey, so if that's not your scene, this isn't your scene. Also the prices are only alright...they're not as good as say, trader vic's, which also has an awesome variety of tiki drinks.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-08", "description": "Came on a Friday night and it didn't disappoint - probably because my pals told me not to expect much other than it was a fun dive bar to get cheap drinks and maybe shoot some hoops. I did one of those two things and it was fine.\n\nThey'll make a mean well drink or serve you up a semi-cold glass of beer on tap, but I'd stay away from their specialty cocktails as I was getting some puckered faces when friends took their first sip. They're cheap - so don't expect fancy craft concoctions. And if you're only sporting plastic in your wallet, you'll be in a world of hurt as they only accept cash. They do have an ATM on site with some nice fees, but if you want to imbibe, that's the price you pay for your liquor.\n\nI heard the place gets packed around 930/10PM on the weekends, other than that there was plenty of spots to sit around the bar and it wasn't super loud where we couldn't hold a conversation.\n\nWould for sure come back, the price was right and I had a good time.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-19", "description": "It's a dive bar that seems like it might be a tiki bar but its def still a dive bar and for that it's great at what it is. \n\n+ Questionable communal snack mix in little dishes at the bar\n+ Cash only\n+ Cheap drinks\n+ Maybe the worst mai tai I've ever had but it was still drinkable so, maybe just stick to beer as one should in a dive bar\n\nI'm no regular of the Marina but I get the sense that this neighborhood isn't likely to be a place I will frequently find myself or make the trek to but Mauna Loa is a great place for us plebes to go in this neck of the woods to have a very adequate good time.", "author": "Candice G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-20", "description": "Fun dive-y bar in the heart of the Marina. It's a much welcome change of pace from nearby Balboa Cafe, Eastside West, or the Matrix. \n\nPerks:\n- cheap drinks \n- kitschy/tiki bar meets sports bar atmosphere\n- they have fun games (pool table, hoops, etc.) to accompany your beverages.\n\nCons:\n- Cash bar\n- not exactly the friendliest bartenders on the block.\n- don't come in here expecting craft cocktails (stick with beers and shots).\n- depending on the time of night, it can get super crowded. So if you're looking to have an actual conversation with your drinking buddies, get here on the earlier side.\n\nAll in all, Mauna Loa remains a reliable Marina staple, so long as you don't come in with high expectations.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Great divey tiki bar! Drinks a little overpriced for the ingredients/atmosphere but still a fun spot!", "author": "Emma V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "My favorite bar in SF. Kurt is a great guy to\nhang out. I've known Kurt for nearly 30 years. I have many fond memories, including meeting my wife pilar and %\n sarurdayxws", "author": "Jack C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "Totally a dive bar in a great location. Like everyone else has posted don't expect much. The bartender seemed kind of off, but she was sweet - When I asked for a happy hour Jameson special because it was about 7pm and it didn't end till 8pm Mon-Fri she didn't know there was happy hour, I'm not mad at her. If I worked at a bar I'm sure I wouldn't know happy hour if I only worked late evenings. I would come again, wish their were bar seats available and took cards as well instead of just cash - that why we were onto the next one.", "author": "Tawny V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-08", "description": "Discrimination at its finest -\n\nThis bar is one of the rudest bars I've ever been to and the bouncer is a huge douche.. and I'm from NYC so I think that holds some weight.\n\nMy friends and I showed up on a Friday night after getting a recommendation from the waiter at Umami Burger down the street: go to Mauna Loa bar - it's a good time, tell them Chava sent you, and they'll take care of you.\n\nUpon arriving, there was nobody outside of the bar, so we strolled in. A few seconds later, a 'bouncer,' or should I say, 9th year of college frat bro who doesn't even know how to do his job, asked us to \"back up\" and step outside since he needed to card us. \"Back up, back up, back up, go outside.\" Already, that's a bit rude, but expected from crappy bouncers in the Marina, so we're fine with that. But, when I proceed to ask very nicely - \"Hey, we got sent over from Chava and he said really good things and that you guys are a great time - are there any specials or deals tonight?\" - he proceeds to very facetiously say \"Umm... nope!\" and brushes us off. \n\nAt this very same time, a group of blond girls and guys walk in, and the bouncer just smiles and nods them in without carding. We're not sure why they're getting in so easily when we've already had several bad quips from the bouncer.\n\nFinally, we get in and decide to let it go. But, I did tell him, \"Look, I think you were sort of rude when we came in.\" He completely brushes it off and says, again, sarcastically, \"Oh, you didn't like the way I said no?\" Yeah, douche, not really.\n\nAfter 30 minutes or so when we decide to leave, I can't help but let him know, \"Again, you were extremely rude and honestly discriminatory,\" to which he was completely surprised by. \"Discriminatory?\" Yeah, you were. You clearly had much more positive interactions with all the other customers in the bar, and news flash: discrimination is when you treat different types of people differently. It's hard to trace the why behind the actions, but the actions were very clear. \n\nNot long after, we asked for his manager to discuss the problem. This part's hilarious. He sends another bartender who is probably 7 years old and acts that way too. We then ask for someone who is truly more senior, and the 2nd woman that comes out is the same joke the rest of the staff is. She tries to offhandedly apologize just so we leave, and when we don't, because we want a genuine response, she accuses us of harassing the staff.. When we remind her we are just stating facts and filing a complaint, and that we were paying customers, she goes, \"Not anymore.\"\n\nI'm sorry, what? You're trying to tell us we're not customers? It's one thing if we were punching people at the bar; it's another to just be stating the obvious: don't treat your customers like crap for no reason, and especially not if you're not doing that to everyone. Hello, that's discrimination. Tired of [white] people looking so shocked when you say they're exhibiting that; just because you don't think you're 'racist,' doesn't mean your actions aren't reflecting and upholding that very definition. \n\nOverall, extremely unprofessional and unpleasant experience. As someone who just moved over here, I didn't expect this. In New York, people who are rude are rude to everyone. It disgusts me that some people in SF are so oblivious to the lack of diversity and apparent ongoing discrimination that takes place every weekend in the Marina. Time to finally take responsibility for what you are or what you stand for, and stop making excuses.", "author": "Maggie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "Best Bar in town. If you want to know the old school real SF people. This is the place. Your always welcome at Mauna Loa as long as your nice.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "By far my favorite bar in the Marina. I don't spend much time in the Marina, I find a lot of the restaurants/bars to be a bit overrated, packed, and just boring for my taste, but Mauna Loa Club is a nice diamond in the ruff.\n\nLocated on the corner of Fillmore and Union, Mauna Loa doesn't look like much from the outside but step inside/step back in time to this cozy, unassuming and comfortable bar. A nice selection of beers on tap with prices from $5-$7 and also serving up a full bar with plenty of liquor and spirit options.  The bartenders here are great. I have never had to wait more than 30 seconds for them to greet me, they are quick to take your order, friendly and willing to answer any questions about styles of beers/offer a taste. \n\nI had one particularly great night here on New Years Eve 2015. Not really the spot that screams NYE but my boyfriend and I were walking around town and wanted somewhere low key to grab a quick beer that wouldn't be too crowded.  Spent a little while at Mauna Loa chatting with the bartenders and other patrons. At one point the owner came in and bought the whole bar a round of drinks - wooo! cheers to that. Since then, this place has had a little space in my heart for a welcoming bar that really cares about the customers and gives quality service. \n\nAlso, a great patio in the back, only open two times a year (once for the Union street festival - not sure about the other time?) and BRING CASH!", "author": "Kelsey B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-07", "description": "Went in for a beer and some games on a quite, uneventful Wednesday... as an industry bartender of 10 years and a neighbor of the area, I was appalled and disgusted with the rude female bartender working last night. this isn't the first time this individual has been rude and grumpy for no reason... might be time for a career change honey, it's called the service Industry for a reason, and clearly you hate your job. If this individual is behind the bar I will avoid this establishment at all costs and take my business elsewhere... definitely no longer recommending this place to my patrons and regulars at my bars due to this terrible service and unnecessary treatment. As businesses owners I'd recommend cleaning up your staff and remind your bartender that being in the service industry means being friendly and knowing how to serve. Such a shame!", "author": "Meg D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "Cute little bar with tiki drinks for under $10. (Where can you find drinks for under $10 these days?) They have some arcade games and even a nice little outdoor area in the back! A nice casual spot for when you don't feel like being all bougie. Only gotcha: cash only!", "author": "Davis K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "This is a great neighborhood bar with reasonable drink prices, friendly staff, sports on tv, a constant stream of people changing up the vibe. Being from Chicago, I can truly appreciate the corner bar feel of Muana Loa...", "author": "Charles L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "First time coming yesterday, and it was great to grab a table and play cards, provided by the bar tender. They also have a pool table, arcade games, basketball game. The atmosphere is wonderful, down-to-earth fun. TVs were playing the exciting football game. Even a regular, a dog, saddled up to the counter and asked for his special treat, and the bartender was quick to oblige! This is one cool bar. Don't miss it!", "author": "Kiera R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "Great bartenders- cool atmosphere in the best neighborhood in the city!! I think we tipped em like 35 bucks, - The drinks were typical dive bar style, nothin wrong with that,", "author": "Josie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Fillmore Street, one of my go to places on a Satruday or Sunday night. Went there yesterday, on a Thursday night to look for a fun place to have a few drinks but most places were relatively dead. We ended up hanging out at Mauna Loa Club for a a while, having some beers and playing pool. \n\nMauna Loa Club, located at the corner of Union and Fillmore, is your classic dive bar. With pool tables, arcade games (if I remember correctly ?!) and cheap drinks. The wooden decor and chill vibe was unexpected as we made our way along Fillmore Street, as many of the bars and restaurants around there are more upscale. Mauna Loa was a welcome addition to our Thursday night bar hopping expedition. We played some pool, choose some songs on the jukebox and had an all around good time.", "author": "Aletta B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-15", "description": "Great place to be harassed and groped by creepy old men who won't get kicked out by the bouncer.", "author": "Asha J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-26", "description": "Cole slaw is very good and waiters are extremely friendly. I would recommend the chicken Katsu, BBQ chicken, short ribs, or poke. Have never been disappointed here and keep coming back. Reasonable prices and quick service too!  The combos are also a great option if you want to try a little of everything.", "author": "Frances H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-21", "description": "Short and sweet. \n\nA dive bar in the Marina.\n\nA much needed breath of fresh air to the douchebaggery that oozes through the streets of this neighborhood.\n\nCheap(er) drinks than their nearby \"competition.\"\n\nThose draaaaanks... they're stiff. No measuring here.\n\nShoot some hoops, it's okay.\n\nGrab a seat, there's usually plenty to go around.\n\nGreat juke but the price per song is a bit steep.\n\nWear your Hawaiian shirt, you'll be fine.", "author": "Brad B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "Appropriate dive bar to grab a pineapple vodka! Enjoyable wasn't too packed and service was prompt. Aloha!", "author": "J K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "Manua Loa will always have a special place in my heart. The majority of my 20's were spent in this bar, leaving me with great memories, good friends, and lots of hang overs. To be honest there were a few bad experience that translated into great stories I could share with my friends over a drink or two.  \n\nDrinks are cheat, bar is cash only, and they have Pop-o-Shot! \n\nThe personalities of the bartenders vary greatly but this a good thing, keeps it interesting.  \n\nIf you are lucky you can snag the best seat in the house (Corner of the bar, next to the window) and people watch.", "author": "Jen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "Nice water hole in the the marina! First things first, this place is cash only!!! Take out some cash and come party!!!\n\nLost of draft beers including alagash white which is not on tap may places around here! \n\nLots of TVs and a pool table make for a great time. Come here for day drinks, friendly bar staff, and a great vibe.", "author": "Kristin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Great dive bar amidst a whole neighborhood of douchey marina bars. This place has great specials, fun bar games, plenty of seating and standing room, and a pleasant attitude that welcomes all patrons. A nice change from the high maintenance bars around the area, a refreshing dose of normal in a sea of crap.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-22", "description": "Casual, cash bar. A few surf boards and turtle shells..  but hey, you saw the name what were you expecting?\n\nVery friendly staff and in looking around this place is pretty big. \n\nTv's friendly talk, great drinks and a few specials....toss in a decent happy hour....worth the visit.", "author": "Dan A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-07", "description": "Simply put if you as a customer feel like you're an inconvenience to the bartender at a bar you're in the wrong place....or the bartender is in the wrong profession. The place is ok but the dark haired female bartender this Saturday afternoon was let's say less than. Customer service professionals that are rude are bad for business and not professionals", "author": "Robert H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "Great bar. Cash only. Friendly bartender- possibly owner- Curt? Happy hour $5 well drinks and draft beers with a solid selection.  Clean bar, good drinks, solid specials, and the best 90s music. We met some of the best people here and I'd love to come back.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "I love a great dive bar but you know what I love more? A dive bar that carries good wine . Mauna Loa doesn't carry a lot of wine but they carry good wine including a rose. Who would have known? Not me if Cyna, the rockstar, bartender didn't tell me. See ya next Saturday afternoon dearest! You made my Saturday fantastic!", "author": "paulina k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "The go-to spot in the Marina for a chill/fun night.  Pop a shot + juke box to play your own songs + tvs + cheap drinks + chill atmosphere...what more could you want in a local bar?!?", "author": "Faith B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "Fun, friendly, relaxing night. Love the beer selection and ease of hanging out. Great \"local\" (even if I'm not a local). Sculpin a current favorite. Don't forget, cash only.", "author": "Dredge E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "A friend reccomended I try this marina bar. I'm not in the marina a lot because I really don't care for most of the places up there to drink. However, I'm glad to know this place is there.\nI love dive bars, I love beer and I love games. I was very pleased with the pricing here and the service. Happy hour is a great deal and the bartender there is awesome! Cina always remembers what we ordered and remembers my husband and I too when we come in. People like that make me feel at home and keep me coming back. Cheers!", "author": "Bibi B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-04", "description": "Dear Mauna Loa,\n\nI really try to like you. I've been here multiple times. You're pretty close to my workplace. You're a quirky looking Hawaiian Bar in the Marina. You claim to be a Dive. I really want to like you, but you make it very hard. \n\nMauna Loa is disappointing. It claims to be a dive bar but doesn't have a real happy hour. Last time I was there, I was charged $11 for a Dark and Stormy at 5:30 pm! ($9 for the Meyer's Rum, and get this: $2 for the ginger beer)  Now, I don't want to boast, but I've drank in bars ALL around the city and charging for a mixer when you've already charged for a hard liquor is unheard of. It wasn't even a generous pour... not cool! \n\nAnd a cash only dive bar? In the Marina? That charges the same prices as a nice SOMA bar for a simple drink? No thanks! \n\nIt's usually pretty quiet on weeknights at happy hour time. Your usual middle-aged daytime drinkers (What do they do all day??), or your extra loud, mostly white, Marina crowd. \n\nI would tell you to skip it, but if you're constrained to that neighborhood, there aren't too many better places to skip it to! \n\nSOLID 2 STARS.", "author": "Krithika H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "Love this bar!  Friendly staff, good drinks, good company.  A solid neighborhood bar where you can relax and enjoy some sports or music on the juke box.  I'll be a customer for years to come!  Thanks Mauna Loa!!!", "author": "Graham D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-19", "description": "As far as dive bars go, it's hard to give them 4 stars. It's difficult to find a place worthy that rating.\n\nMauna Loa Club is definitely a fun place to hang out with a variety of games such as basketball, foosball, pool, etc... Even more fun when you've been drinking! For people from LA visiting SF, this is pretty much like a Busby's without the dance floor.\n\nI came here around 11pm on a Friday night and it was packed! It was packed like sardines. Despite the number of the people in the bar, it was very easy and quick to get a round. \n\nThey have drink specials, so you can get pretty torn up here.\n\nCASH ONLY.", "author": "James B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-24", "description": "Witnessed their bouncers trying to KILL some kid tonight.  \n\nThe short portly/fat 45ish looking white guys with soft facial features and salt and pepper hair were out for blood...\n\nPile drived this guys head on public property after my friends and I had helped to establish about 10 ft of space OUTSIDE the bar and the situation was essentially diffused.  VIGILANTE BULL SHI*.\n\nMy friend got an MMA elbow to the jaw from the bouncer for his efforts at peace.  Other guy with huge nose who was getting free drinks (and likely on the payroll) came out and kicked the guy in the head and tried to fight me too. COWARDLY. COWARDS. \n\nPolice report and lawsuit are pending.\n\nPLEASE.  DO NOT GO HERE. THIS IS A MORAL ISSUE.\nTHEY TRY TO KILL THEIR PATRONS WITH GANG HEAD KICKS.\n\nI WAS APPALLED BY THE INTENT TO KILL.\n\n\nTHE OWNER SENT THE CRIMiNAL BOuncers home to protect them. THe owner would not discuss the injury to my friend even though they were on the premises. They claimed the instagator ( who they tried to kill with head kicks) was on PCP ?!? I saw him and that is complete BS.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-01", "description": "There are several reasons I like this bar:\n\n1. Pool Table that is actually available to play on! $1/game.\n2. Juke box - $1/song\n3. Reasonably priced drinks\n4. Strong drinks\n5. Not overly crowded\n6. Available seating\n\nMauna Loa Club, you're alright!", "author": "Junel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-06", "description": "Great to grab a beer and play some pool.", "author": "Peggy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-21", "description": "To be completely honest, the only reason that I'm writing a review is to create a list of places that have Big Buck Hunter...which this place has. They have Buck Hunter HD Online (2nd newest one and definitely one of the hardest). As of August 15 the 1st player (orange) gun is off by about an inch to the left and a half down. You might think its picky, but trust me you need it in order to get the big points by shooting far targets, and making sure your shots count. \n\nThe bar is fine, drinks are normal priced. the regulars are cool, the kids that come in for large groups are not and give off a bitchy vibe. Not the place's fault, but it is what it is. Nice selection of beer, and they have Mexican beers.", "author": "Susie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "when i moved to SF in 1990, this was my first bar i ever went to.  back again for a couple of beers last night.  \n\nThe Good:\n\nPretty Girls\nGreat Hoop Shoot in the Back - aim the the backboard area right approve the rim - only way to fleece your friends.\nCold Beer\nGood Tunes\n\nThe Bad:\n\nNone - It is a dive bar - don't be an elitist.  Great place.  Go and enjoy.", "author": "Allan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-02", "description": "I've been here twice now- both times with an entourage of female friends. \n\nThings I don't like:\n\n1) Cash only bar. Come on guys. Get with the times.\n2) Awkward women's restroom with only one stall.\n3) Drinks of disproportionate proportions. \n\nThings I do like:\n\n1) Pool table and other random games.\n2) Music selection\n3) General crowd this place draws. Its usually rather eclectic.\n\nI'd venture back, but wouldn't be bummed if I didn't see if for awhile!", "author": "Annalise F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-01", "description": "I guess I would consider myself a regular at Mauna Loa. Its prime location in between the Marina and Pac Heights make it ideal for a night of fun bar-hopping.\n\nI don't know what the deal is with recent reviews talking about some fight that happened here recently, I wasn't even aware that this place had a bouncer. I've never been asked to show ID at the door or anything. Anyways . . . \n\nPros: friendly bartenders, good drinks, a juke box that plays all your favorite hits (from \"Call Me Maybe\" to \"Gangsta's Paradise\"), a foosball table, and other arcade games in the back. \n\nCons: Cash only bar. I mean, it's 2012, and I hate going to bars that only accept cash because let's face it, carrying $60+ with you when you go out is kinda a drag especially when you want to reserve that cash for other emergent necessities like taking your crew to follow that group of cute boys heading to bar across town or for your cab ride home. \n\nBut with all that said, I keep coming back for the Jon Dalys and for the awesome bartender who gave us $5 to pump some jams on the jukebox that one time.", "author": "Linna L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-13", "description": "I kind of thought that Mauna Loa would have crazy specialty cocktails, or at least rum drinks on special, but it's more of a dive bar.\n\nIt's full of wood and regulars. People that drink draft beers and easy shots. Friendly people playing pool, foosball or arcade basketball in the back. And sometimes there is that one guy or gal that started drinking way too early and is either having a hard time staying on the stool or controlling their inside voice volume.\n\nIt's not a regular destination for me per se, but I have to admit I do enjoy my drinks there whenever I stop in and for that it's A-OK with me.", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-21", "description": "This is one of those places that really isn't worth going to. Not only are the staff rude bros who wear backwards caps like lame '90s try-hard skater kids, they also aggressively encourage you to buy last drinks and proceed to turn on the lights and physically push you out when you have over half a beer left less than 10 minutes later. This is an irresponsible service of alcohol that should not be tolerated. I hope this bar soon goes into administration. I will then buy it and fire the wanker wearing the lame backwards cap.", "author": "Jackson S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "I had a really great experience and time at Mauna Loa the other Sunday (funday). Basically, the bar transformed into a country fest! Somehow, the bar seemed to bring together so many of SF country music fans. They have a great, huge, high-tech touchscreen juke box machine that also let's you play games, post photos, etc. We put in money (it's not super cheap though) and started selected country songs and then about 5 others followed suit. Soon the whole bar was chatting about their fave country music tunes and singing along to the music. \n\nMeanwhile, we also played pool, shot hoops at pop-a-shot, and enjoyed $3 well drinks (rum & pineapple juice = so yummy even when the rum is a well!). Such a great, chill bar... with country music too! :)", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Classic dive. Cash only, haggard bathroom and a solid good time.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-19", "description": "3.5 \n4th star simply because the bartenders are cool as hell and they have a modern jukebox with a crowd that seriously likes new country.  If a place has folks that dig Jason Aldean and Luke Perry while drinking beer and no shee-shee drinks, AND there's a hoops in the back?!  Count me in when I am in that kinda mood.", "author": "Athena S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-28", "description": "I found my dive bar.  This is it.  Cash only is the only down side.  But overall a good dive bar and games for your sober friends or DD, too.  \n\nLove the basketball, bowling, foosball, pool and  games all over the place.  Paid $5 for shock top.  Not too shabby.  I could picture myself frequenting this place a lot.  \n\nA bit of a sausage-fest, more than I'm used too with about a guy/girl ratio of 15:1 but that is just a downside for the guys I guess. The handful of girls that were there were girls there were with a boyfriend or with a large group of guys.  If you are looking for a dudes night out, or a place to NOT find large groups of women, this would be a good choice.", "author": "Hazel K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-09", "description": "Curt and Tammi are unreal as true representatives of this place. Wow this is my first time here and the warmth of this place is inexplicable. I appreciate that it is clear up front it's cash only and there is no question.\n\nOk and.... Amazing red wine!!!!", "author": "mary helen d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-29", "description": "Marina dive bar. They have some old school bar games like one of those hockey tables and such. Can have a good crowd. No dance floor.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-18", "description": "I came here last night with some friends. The general consensus was to try to avoid the d-bagginess of some of the other places in the Marina. What we got instead of expensive and high class d-bagginess was instead a cheap substitute. Not sure I'd particularly recommend this place to anyone. There are divier places of greater repute if you're looking for a dive, and there are definitely much nicer places for anything else.\n\nA \"dive bar\" feel, but not quite the real deal. I should know - I've spent thousands of dollars on research over the years.\n\nBartenders had the dive bar attitude down, including the ability to ignore me for 10 minutes twice in a row, even to the point that they took out the lemons, the knife, and the cutting board to do prep work before acknowledging me. It's alright, it's cool; I can wait. I'm a try-sexual. I'll try any place once. But lose my business as an establishment that serves alcohol and you are losing one heck of a devoted customer; I have true staying power when it comes to alcohol and would be a friend for life getting my drinkie-poo on.\n\nHate to rain on the dive bar parade, but the next time I want to be ignored by bartenders, then here are my requirements: I want the tattoos to be prison style, not fashion, and I want the contempt to be earned, not just thrown out there like a general M.O. I'll take my chances at the dive bars on 6th Street/Folsom area, Mission, or Richmond any day, and be glad to wait 20 minutes to order my $5 beer.\n\n[Boo hiss scratch, yes, I am an angry kitten right now].", "author": "Anna S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-28", "description": "They're cash only, and their ATM doesn't work. They want me to go across the street to get cash instead of accepting my credit card. No thanks. I'll give my money to someone who provides customer convenience. They don't care about you here.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-23", "description": "What an awesome place!!! \n\nI am writing about a month late but still I can remember the bar that started my great night. Came through here to have my first round of beers after I spent a day of shopping in union area. Only a few people eating and having a beer at around 4 pm. I think what I just liked was that it's your average neighborhood bar. I wish I was living in this area to come here more often!", "author": "Ezequiel R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-03", "description": "If you're looking for a place to play pool, play video hunting, and shoot basketball arcade this is an okay play to do so. If you're looking for a place to have good drinks, this is NOT the place. Even with such great prices, its not worth coming here, if you're looking for drinks. There are plenty of other bars very close by you may want to check out, just  heads\n\nWater down drinks.", "author": "Isiah B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-18", "description": "Went to this bar on a Saturday night and wasn't allowed in because the bouncer said my id was a fake. Wouldn't even look at my credit card for verification of my identity. I'm 25 years old. \n\nLost any business from me, which granted I am only one customer, but I don't understand a business that doesn't seem to care at all. I wasn't unruly or belligerent to the bouncer, I just wanted to check out a bar that I'd heard was fun.", "author": "Shannon R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-20", "description": "Dear bartender Jen-\n\nI know that you think that because you are a bartender that you are a hot shot.... actually I won't even act like i know what you think. I do I know what I think and I DON'T think that makes you a hot shot!\n\nBeing rude to your customers is NOT how to bring business in and I found you to be rude, slow, and have terrible customer service.  Try to smile... maybe that help.  Try saying goodbye when someone says goodbye to you.  Try being polite when someone tries to engage in a conversation with you.\n\nThe bar itself is a great little dive bar.  Pool, TVs, booze!  Everything that you need and want in a dive bar.  We went on a Wednesday so it was the perfect amount of people.  Friendly people to play pool with and make new friends.\n\nHOWEVER, if the girl behind the bar is Jen... I'm out.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-24", "description": "Friendly bar-staff. Strong, Cheap Drinks. Dirty Bathroom.\n\nYour typical dive-bar.", "author": "Helen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-21", "description": "Cool place in the Marina.  Small.  You can play pool for awhile, but eventually it will be way too full.  They've got some other games on, as well.  A fun place to hang out and chat.  It gets HOT, though, when it's full...", "author": "Brian B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "Calling it a club is being generous. This is a very cool dive bar, however. It's a little like Bar None just a few blocks away in that it has a lot if games and a good beer selection.", "author": "Zach H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-17", "description": "I hadn't been to Mauna Loa since..holy crap my review back in 2007?!?!?!\n\nWELL.\n\nIt is still my favorite \"dive\" bar in the Marina. ML is always laid back, has a good happy hour, and the crowd is less obnoxious than any other bar especially on a Friday night. Well, let me rephrase, the local crowd is less obnoxious, but the out of towner B&T crowd who managed to find this gem last Friday really should have taken the cues from the locals who rolled our eyes at the sad attempt at rapping to the jukebox and dancing with flailing limbs.\n\nBut, the fact that most people just stayed away from these buffoons goes to show that the ML crowd tends to not get caught up in the drama and lets people who need to scream and make asshats of themselves do their thing and leave. \n\nBartenders were fast and friendly as always. Although minus 1 star for the barback who continued to knock into me and hit me in the back with a box of beer. A simple \"please excuse me\" would have saved me the bruises.", "author": "Kathy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-11", "description": "Lots of games (bball, foosball, pool)..but the cherry on the top was definitely the complimentary goldfish crackers for me! Tastes of childhood in between sips of [hopefully not childhood] alcohol! \n\n....Evidently, I still am a \"child\" in some respects (Admit it! You are too...)", "author": "G L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-20", "description": "This is a Marina bar that's a little more my style. Though the male to female ratio seems to be heavily skewed, like many places in the neighborhood, there's thankfully plenty of stools, little corners you can claim for your group, all while you drink, laugh and bask in the mildly kitschy tiki and somewhat random decor of this odd bar.\n\nNot only do they have 10+ affordable beers on tap (quite impressive for the size of the place) including PBR, Blue Moon, Trumer Pils, Lost Coast Great White Ale and others, but they also have pool, foosball, that hunting video game and arcade basketball. The music was fun 80s tunes and everyone always seems to be having a good time. This is one of the first Marina bars I've been to where I haven't had to battle high maintenance blondes with oversized Gucci hobo bags and belligerent jock types at the bar to get a drink. Bummer it's cash only. Fun bar, nonetheless.", "author": "Chelsea P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-05", "description": "Probably the only bar in the area that I wouldn't mind coming back to again. It's dive-y, and the decor doesn't match the theme really- it's a Hawaiian bar but with no real Hawaiian touches but I still really liked it. They have two bars and plenty of space so it didn't feel crowded- it was pretty crowded but I could actually sit at the smaller second bar comfortably and have a conversation at close to normal sound level. \n\nThe second bar is cash only but that's really not a big deal. Their ATM charges less than two bucks!! Outside of New Orleans I haven't seen one that cheap. I have no idea why they just don't change the name of the bar to 'Our ATM charges less than two dollars' I think it would draw a lot of people in. They also have absinthe and absinthe cocktails- I didn't partake this time but I am impressed and amazed that a place carries it-what with the stigma and all. A definite 3.5 and a guaranteed return visit from me if/when I return to the San Francisco area.", "author": "Ted C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-26", "description": "Pro: Foosball Table and Basketball Nets at the back of the bar\nCon: Creepy Marina boys hitting on you\n\nPro: Fairly Cheap Drinks\nCon: Bathroom is tiny and gross.\n\nPro: Bartenders get drunk while pouring and don't add your bill up correctly.\nCon: Cash only\n\nPro: Lost my wallet there one night and they found it for me\nCon: Crowd often reminds me of the old fraternity parties in college\n\nOverall, the Loa is good for a quick drink on your way to somewhere else or as a last stop. But, if you're staying in Pac Heights that night, take a cab up that 3 block hill because Fillmore after a night at the Loa is like climbing Mt. Everest! Trust me, I've been there...3 inch heels and all.", "author": "Nam N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-21", "description": "12.18.10\n\nMauna Loa.  What you would think an awesome fraternity house would be.  Packed into a tiny bar.\n\nFoosball?  Check\nBasketball?  Check\nBig Buck Hunter?  Check\nPool table?  Check\n\nBars in the front and the back.  Dark, loud and grimy.\n\nExactly what you'd expect at a frat house.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-13", "description": "Solid dive bar in the marina. Spent a couple hours in the black playing foosball and watching the guys shoot hoops.", "author": "Ally T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-18", "description": "This is a great little bar in the Marina. The staff is super friendly, and they have fun games in the back to play! This place is cash only, but they have an ATM inside!", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-16", "description": "This place is garbage. It's stinky and the people are rude. Waste of time with so many better options nearby.", "author": "Omar C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-19", "description": "Let me preface my low two-star rating by saying that I like dive bars, and I'm not anti-Marina. I have a lot of fun in this area when I'm in the mood. \n\nHowever, this is a place I would not be excited to come back to--at least on a Saturday night, when I first visited.\n\nCash only bar... okay, sure, authentic dive, but super annoying especially if you're worried about having cash to get a cab home and the ATM is out of order (it was).\n\nSecondly, it was HOT in there. As in, I was sweating just standing there and not in a sea of sweating frat boys either!\n\nThe drink I had (cocktail) was tiny, could barely taste the booze and was overpriced.\n\nIt's cool that they have games, for sure, but on Saturday night it almost made it worse because it was so crowded and I kept almost getting my eye poked out with a pool cue.\n\nI do like the wood dive bar feel so maybe this place would be great for happy hour. But it didn't impress me.", "author": "Courtney A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-04", "description": "It's the Marina, but it doesn't feel as \"Marina-ey\" inside this dive bar. It's got open space and a good flow and when I went, it had a cool mix of people. Drinks were  fairly priced-- just keep in mind that it's cash only! Also, the bouncer Claudio was a super sweet heart. He was super helpful with directions and making our group feel very welcome when we came in!", "author": "Courteney K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-07", "description": "What's with the fucking attitude, people?!?   Ok I get that this is a neighborhood dive bar and clearly everyone here knows everybody else and you're all chum and all, but if we walk into your establishment, the least we could expect is a friendly word from the bartender.   If the regulars wish to ostracize us, so be it, but the fucking bartender?  We pay your salary you dumb prick!   And what's with the look, huh?  Are you going for the Bob Ross \"Joy of Painting\" lookalike contest?\n\nHe didn't really fuck up my drink, since I got a Bushmills on ice, but my wife said that her vodka Sprite sucked ass.   We promptly finished our drinks and exited the establishment.   Thankfully we cruised down to the Balboa to salvage the night, but I agree with Uli's review...  The vibe here was full on Fear & Loathing.", "author": "David O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-13", "description": "Marina friend #1: Dude, let's go to Mauna Loa\nMe: Ah, fu**, you KNOW I don't like the Marina. \n\nSeriously, the fact that this place is across the street from Matric Fillmore almost made me puke, but I ate my words and had fun. \n\nIt was more of a divey sports bar in the marina (err, \"cow hollow\").\n\nI think what put it over the top for me was the chill crowd (ie: not douchebag-filled) and the mini basketball machine in the back. I could spend hours on that thing accepting challenges from strangers. Add beer to that endeavor and you've got yourself an evening.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-17", "description": "What a disappointment and a letdown after starting so good.\n\nOn the fable Goth Night at the Marina, a crowd of Goth gitup of SF & LA Yelpers do a barhop from one corner to another. It started up very promising with Circa and Kelly's Tavern. Then it went to a thundering thud of Matrix Filmore. We should stop there, but we decided to roll that dice.\n\nIt went crashing into smithereens with this one.\n\nMauna Loa is a very confusing place to be in. It had couple of games in the back like a strip down version of Dave & Buster's. A pool table on the side that people kept interrupting by bumping into the poor game. Last, but not least... a jukebox. \n\nIt's great if you are looking to chill and have fun, but it seemed to get the overcrowd fallout from Matrix Filmore and stuff the place to a tilt. Not very appealing place to be as it get crowded. You need to be constantly moving to avoid standing in people's way.\n\nIt has the look of a dive bar if the price of the drinks matches it. Alas, it's a crowded bar that is no better than a poor man version of Hooters.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-24", "description": "As far as dive bars go, Mauna Loa does it pretty well. Its got the creeky old wood floors, the lighting and the smell that one would expect of any respectable dive. That being said, its nothing to go out of the way for, however, if I end up at Mauna Loa somewhere along the way its always proved to be a good time.\n\nPros: two bars (a main one in the front, and one in the back that is open on the weekends after 9pm). A jukebox thats always playing singable hits. A pool table, basketball game, buckhunter, and other retro video games in the back. A good mix of people looking for a fun night. Oh, and the prices are reasonable too.\n\nCons: Cash only and it can get hot when its crowded", "author": "Krista S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-29", "description": "This place is cool!!\n\nIt is a great mid-week place to meet friends for some fun activities. It has foosball, basketball, Big Buck Hunter, and a pool table. Pool is even free on a Monday!!\n\nBehind the bar there are dice for some liars dice! $1 a game keeps it interesting... I even won my first ever game :)\n\nThe beer is reasonable prices and a good selection.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-22", "description": "The latina girl bartender is really mean.  She should be fired immediately.  She is literally driving people out of the bar with her nasty attitude.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-18", "description": "Didn't think I'd find a place like this in the Marina. Reminds me of the dive bars in my small Ohio college town. Went on a Monday and Tammy came up and told us that she cooks a free dinner every Monday! Brats and sauerkraut last night, pulled pork next Monday! Don't pass this place up!", "author": "Audrey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-07", "description": "BEST DIVE BAR IN THE MARINA!!!\n\nBig Buck Hunter, Basketball Shootout, awesome jukebox, and pool table - what more could you want from a great dive!?! It's dark and just gives off the dive bar vibe!\n\nThey've got good beer on tap (and they're reasonably priced), they pour heavy shots and the bartenders are sassy and witty!\n\nOthers may complain about the frat boys/d-bags that frequent Mauna Loa's, but what do you expect in the Marina District? They're easy to ignore when you're partaking in a game of Big Buck Hunter or pool... or just make sure to avoid this place on a Friday or Saturday night (or pre-funk here before it gets crowded).\n\nThis is a CASH only place, so either bring some skrilla or hit up the ATM machine between the Men's bathroom & the Buck Hunter machine!!!", "author": "Christine Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-13", "description": "Hazel K., a San Francisco local, brought me and some friends here during a weekend visit because it is her favorite bar in the city. After one visit, I can see why one would frequent this place often. It's a very mellow dive bar where the music is played at a tolerable volume, and conversations are possible. It seems it does get crowded on the weekends, but people don't hog bar-space so it's actually quite easy to get to a bartender and order a round. There is one of those basketball shooting games, a pool table, foosball table, some bowling game, and the bartenders have dice for dicey games.\n\nAlso, everyone was very friendly! Strangers got in on our basketball competitions and challenged us to games of pool. As far as I could tell, at least with the people I encountered, it was not a douchey crowd. Overall, a good time was had here.\n\nLike others have mentioned, cash only.", "author": "Amie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-14", "description": "Cool place. Very stereotypical Marina dive bar :)\n\nCheap drinks, fun people, fun games. \n\nThey make a nice vodka soda! Definitely dont skimp on the vodka.", "author": "M M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-08", "description": "I have never been more confused or mortified before than Curt made me feel here.  I came to Mauna Loa after the 49er game to have a drink with my friend for his birthday.  I didn't realize that Manua Loa was cash only so when we showed up, I took $80 out of their ATM.  What happened next was ridiculous . . . I asked the bartender for 2 Bud Lights and a glass of water for my friend.  I handed him a $20 and after he gave me the beers, he had $1 in his hand.  He told me that I gave him $1 and that wasn't enough.  I explained that I had given him $20 because I had used their ATM and my boyfriend was holding the $60.  He told me that he hadn't opened the register and I was wrong.  I said that there must be a misunderstanding and started looking on the bar and floor for the $20.  I asked him to look on his side of the bar for the $20.  He then dismissed me and told me that I was drunk and since I was making a big deal of it, that he would give me the drinks for free.  I called my boyfriend over and told him what was going on.  He explained to Curt that we didn't have any cash so there was no way I could have given him $1 and that we weren't drunk since we just got there.  In between all of us, Curt was drinking beers and taking shots with the people next to us.  He then proceeded to call us drunk assholes - we then spotted our $20 sitting next to the register.  When we told him that we thought our $20 was right there, he told us that he was going to call the cops and to get out of his bar.  My boyfriend tried to reason with him which wasn't worth it.  We left the untouched beers on the counter and walked out.  I have never had a bar experience like that before and couldn't believe how he was yelling at me when I tried to reason with him.  I was polite and trying to find the missing $20 but he wasn't interested.  I can afford $20 so I hope he enjoys the tip but I won't ever go there again.", "author": "Arica V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-06", "description": "I have been coming here for awhile now; and love this dive bar. At this cash only bar - the drinks are fairly cheap and there a ton of games to play from foosball, basketball, Big Buck Hunter, and a pool table with a bar in both the front and back of the town.\n\nTypically, I have come on both a Saturday and Sunday, and neither day have been over-ally crowded to the point of where it's unable to have a conversation or enjoy yourself.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-27", "description": "I would have upped the star factor if the place did not smell like a dirty diaper. \n We went on a Thursday and it was pretty full, with Journey blasting and the people next to me chowing on a fresh pizza I wanted a beer bad! The bartenders were friendly and poured a fat drink for my friend, so she was really happy. \n The people seemed frat-like but really friendly and jovial, not asshole frat-like. They had a a few pool tables and games on the side wall, the music was good in the Juke which was good. But Journey was being played an awful lot. \n It is a dive bar, but was a fun experience, except for that smell. We could not figure it out and had to leave after a few drinks. \n Whew out into the city night...", "author": "Emily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-24", "description": "I like this bar--pop-a-shot is awesome and prices are reasonable.  Normally I think I would've given a 3 star bc its just a fun bar.  Not really 4 stars but not a great place.  HOWEVER, I just was there last night.  And unfortunately I believe my phone was stolen (literally hours before my 28th birthday).  The staff was super helpful and sympathetic.  Still no phone but the sentiment was helpful!  Thank you!\n\nBeware of pick-purses...ugh just watch your purses ladies.  The gal literally snatched my phone while my purse was on my person!", "author": "Angela S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-01", "description": "A good friend of mine who is a local took me to this bar. First thing to know this is a cash only bar, which I find only adds to the total experience (Norm never paid with plastic). If you are looking for umbrella drinks, coat checks and a chance to show your Amex Black card this is not for you. But if you appreciate a real neighborhood style bar were people know your name and you can have a discussion the current hot topic or just about really good Micro Brews this would be the spot. The owner is an outstanding individual and great to carry on a discussion with. \n\nThe beer selection is great the variety will truly be appreciated by any micro brew fan. The only miss is no Galaga so I could stomp my buddy once and for all in our bar decathlon.   :o", "author": "Jake B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-19", "description": "Another great place to hang out and watch a Giants or 49er game. It is however a bit small for the size of crowds that it gets, in other words don't wear your good shoes as your feet will get stepped on. You can tell that the bartenders and barbacks have their favourite customers, but that's the name of the game eh, get those tips anyway that you can. All in all I do like this place from time to time.", "author": "Henry F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-10", "description": "It is unfortunate that an established bar such as Mauna Loa has such an attitude. I was there tonight with roughly 20 friends. We were in the back of the bar next to the basketball hoop game. \n\nThe back of the bar has only one female bartender who left her post for 20 minutes on a busy Friday night leaving a crowd of thirsty customers.\n\nSince the bartender was missing, my friend reached over the bar to refill her water.  It was then that the bartender's boyfriend (who looked like he had just stepped out of Long Beach circa 1990 with a flipped up black billed cap and dark plastic rimmed glasses) stepped behind the bar and ripped the water gun out of my friend's hand. \n\nHe proceeded to cuss us out, and then tapped off his beer! \n\nWhen the bartender returned, her boyfriend whispered in her ear what had just happened. She stared at us with daggers in her eyes and proceeded to cuss us out. \n\nMind you ... we only wanted some water; and she was the one who left her post on a busy Friday night. \n\nI am extremely disappointed at the Mauna Loa's poor service and lame attitude.  My friends and I will find a NEW local hangout.", "author": "Kate F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-22", "description": "Great bar in the Marina that doesn't have the typical Marina crowd all the time.  Good selection of beers on tap at normal pint prices.  Has a pool table, buckshot, foosball, and basketball game.  Check out the small bar in the back, wait is normally shorter than the one up front.  Can get loud easily between the people and music, so recommended for a rowdy night out with a group.  Cash only which is a bummer but not a deal breaker.", "author": "Tristan Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-04", "description": "I love this place! It's a much appreciated respite from the string of clubby/fratty places on this street. Bartender is always friendly and helpful and the selection isn't vast, but atmosphere is so charming and chill. A nice change of pace here.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-26", "description": "Used to come here all the time when I was younger. Very typical Marina place, Good place to meet girls and chug beers. The one drawback was when I had to take a big shit in the bathroom. There is no stall in the men's room, meaning there are a couple urinals and a toilet. While on the toilet, people kept coming and going from the bathroom, opening the door and exposing me to everyone in the bar. They could clearly see me sitting/shitting on the toilet....", "author": "Jim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-03", "description": "I love this place!  You can find me here on a weekly basis. Great bartenders, pop shot, and the new buck hunter. what more does a guy need?", "author": "Bryan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-13", "description": "*Shudders at the thought of being at this bar* \n\nI have found that most places in the Marina I actually like... Mauna Loa is not one of them... it is one of those places that makes me think.. YUP I'm in the Marina... AKA the place is full of Marina Douche bags \n\nThose overly annoying men who think they are super hot but really just make you vomit in your mouth a lil bit. And of course their snooty lady friends who look you up and down for wearing a sweatband.. whoops! \n\nIn addition to the bad crowd, it was OVERLY crowded... and after 20 minutes of waiting by the bar for a beer I found myself feeling oddly claustrophobic. The games in the back are nice.. however there really isn't enough space for them... I wanted to flee this place like a Jew at a concentration camp... too soon????", "author": "Hailey P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-19", "description": "This is one of those bars that you are always forced to goto even though you hate the place because your friends all go, or at least in my case. Here is how I break it down:\n\nThe goods:\n-Close to other bars so you can leave quickly (haha)\n-The bouncers, actually really mellow and non-intense, good guys.\n-The basketball game/buckhunter\n\nthe bads:\n-Cash only... WTF, who does that still?\n-Awkward layout causes for no comfortable place to sit and constantly bumping into people, spilling drinks everywhere. So cramped that it makes it awkward having conversations or meeting people.\n-Literally need a rape whistle or a set of tits to get a drink... the bartenders here are horribly slow and rude.\n\nIn general, this is just one of those places I have never really liked yet I find myself going every couple months, leaving with the same taste in my mouth. Hopefully my friends will come to the same conclusion I have...", "author": "Sam K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-18", "description": "It's close - 5 stars\n\nIt's too expensive for it's own good - 4 stars\n\nI suck at foosball - 3 stars\n\nIt's better on a weeknight, save yourself from the suburban crazies.", "author": "Jess S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-30", "description": "Mauna Loa Club holds a special place in my heart because it was the first bar I went to the night I moved in. I didn't know anyone yet, but my brother's friend lived in the neighborhood and wanted to hang. She spent the whole night talking about how much she hated living in the Marina. Fail. \n\nFast forward 3 years, I still love living in the Marina, but I usually come here on weeknights. It's not very crowded, which means no long lines at the bar or the teeny weeny bathroom and you can take full advantage of the GAMES! The basketball arcade game is my favorite. They've got pool and Foosball too. I just wish they took cards!", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "It's a great place to start or end - they have pool, basketball, and foosball! It is a cash bar so be sure to hit up the ATM before coming. There is a fine beer selection and there is usually a drink special for the night - which is acceptable if you are planning on getting sugar sloshed. -1pt because the foosballs get stolen or lost and are not replaced, so you are paying 75 cents to play an incomplete game. It can also get really hot in the evenings because the backdoor is kept closed and there is otherwise no ventilation.", "author": "Don W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-24", "description": "A ridiculous fight broke out there and I tried to help stop it. We separated the two people, but an old middle aged bouncer slumbered out and was really aggressive. Another middle aged bouncer and this crazy guy (probably the owner) charged out and started stomping one of the guys we had separated. I think he was only 21 or 22. They started stomping his head on the street and kicking him in the face. NOT COOL!!  \nI couldn't believe it! I tried to get the bouncers off of the guy, because it looked like they were going to kill him. Then, the fat old bouncer turned around, looked at me with these crazy eyes, and started punching me in the face over and over again!! \nIt was terrible! I was absolutely shocked!! After I took a small beating, I asked to speak to the manager or owner.  The perpetrators (bouncers) all left within minutes to cover their own asses, and not get arrested. The owner was there, but never came out to talk.\nAnyways, a police report has been filed, and they have a BIG lawsuit on their hands. We were all off property. The middle aged bouncers instigated a relentless beating on someone I was not associated with, absolutely kicking the shit out of him on the curb and street. And then they came after me when I tried to calm them down. They hit me in the face and jaw several times. I never threw a punch. I tried to get him to stop hitting me, but he just kept going to town. Then, I tried to talk to them about it, and they blamed me for the entire incident....shoring up their story for the police. These bastards have to pay for this!", "author": "Jon J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-25", "description": "Great place to go if you want to pick up underage girls or watch people throwing up in the corner.\n\nIt's a dive bar by Marina standards - a bunch of super young kids going out to get drunk and hook up, but in a non-dressy environment.\n\nAlso, they have deer hunter.", "author": "Bob R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-31", "description": "Jesse on Tuesday night's is the best!!\n\nWe used to hang out here every Tuesday after work, play foos and basketball, and a little buck hunter. It is the divey-est of the marina bars - you don't have to deal with beer pong a-holes or blue light coronas.\n\nOne star off because Friday and Saturday nights get too crazy - can't say the crowd is really my style. If you bring along good company like we do, you won't notice the \"marina\" stereotypes as much.", "author": "Chelsea D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-11", "description": "So it doesn't feel Hawaiian/tropical at all despite the name, more like a marina dive bar that doesn't take cards. I've swung in here from time to time, either to find a crowd of boys who act much younger than 21, or single men older than my father posted up at the bar. Not my favorite spot in the marina, but at least there's foosball and games.", "author": "Kristin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-16", "description": "I have been here in the daytime, on a weekday, when it is virtually empty, and the place itself isn't half bad. The have pool and bar snacks. Not popcorn or pretzels but that mix stuff that you can pick through for your favorite things. I like the little sesame things so this makes me happy. They even have one of those silly basketball games in the back that I havent seen since the last time I was in a Chuckee Cheese. How often do you see that in a bar? The bartenders are down to earth and the place doesn't ooze pretentiousness as many of the Marina bars do. They have an open front window so you can enjoy the fresh air on a nice day. Daytime experience is a four star experience. \n\nNight time it goes downhill. They start doing specials at the back bar (there are two) with names like \"tits and ass\" that have the flavor of the latter. But, they are appealing to the Marina crowd. \n\nI have heard you are what you eat. Does that apply to drinks too?", "author": "Drue C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-12", "description": "I don't know what to say about Mauna Loa. It's a cross between a dive bar, a tiki bar, a sports bar...\n\nAnd it's in the Marina. \n\nWHAT ON EARTH do you say about that? \n\nA few things that deserve a mention, however:\n\nThey have foosball. And an internet jukebox. And the bartender is a very nice dude. However I don't know if he'll still be nice to me and my crew now that he's definitely uncovered the nasty heap of vomit we left outside the front door...\n\n(It wasn't MINE, okay?)\n\nWe weren't trying to tell you anything, Mauna Loa! We actually had a good time with you and your foosball table! We were just metaphorically demonstrating our feelings about the MARINA... \n\nGet it? Vomiting on the Marina? It was a very calculated statement. Very punk rock.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-15", "description": "This place has super ice melting powers.\n\nThe cubes in my drink melted in a matter of minutes.\n\nWarm drink..bleh.\n\nALSO....\n\nIt smelled like ass in here.  \n\nNo joke.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-05", "description": "It's strange, when we headed over there after meeting up with our friends, I assumed that this place was Hawaiian themed (\"Mauna Loa\")  After going there, I have no clue if this place has anything to do with Hawaii.  It was ridiculously packed, and the guest demographic seemed to be current or former college frat members and ex-cheerleaders, all completely trashed.\n\nThere were absolutely no space for any of us to stand comfortably around the bar or pretty much the front 3/4 of the bar, so we headed on to the back of the bar, where we found some games, particularly foosball.  \n\nMy friend Ting is obsessed with foosball so she shrieked out of excitement when she found out that they had it.  We started playing within our group, and eventually were joined by a couple of guys that were really good at it.  Then we were ultimately taken over by another pair of guys that were REALLY good at it.  Like, did-you-play-this-game-every-day-through-4-years-of-college? good.  All strategic, passing the little ball between \"players\" in the same line, etc.  We were all quite impressed & were entertained being spectators at this point.\n\nAnyway, to sum up my experience.... this bar is basically a rowdy guys/drunk girls' hang out.  Would I come here alone or with just a couple of girls? errrhhmm no... drinks weren't particularly impressive, the guys there are drunk and not particularly attractive so why go?  Would I go there with a bunch of co-ed friends when we are bar-hopping in the area? Sure, why not.  But I will go straight to the back of the bar around the foosball table lol.  If I were a single bachelor or just with a whole bunch of guys & want to get loud and hammered?  This place would be a great choice.", "author": "Sascha O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-07", "description": "A dive bar in the Marina, that's funny.\n\nI came here many moons ago and drove by it yesterday and realized I had never reviewed it. The one and only time I came here was when I didn't live here, which I think explains a lot because I now know better, but regardless, if you are stuck in the Marina and want a cheap drink in a divey sort of Hawaaian themed, Ventures kinda place and enjoy being surrounded by stripe shirt, buttoned down fashions, then this is as good a bet as any. \n\nWould I rush back here, haha, not likely, but they did have a fun digital jukebox and the bartender seemed nice enough. Terrible Blooy Mary though.", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-16", "description": "Recently, my friend and I were dragged to Mauna Loa by a pair of good-looking striped shirts. It seemed a little dank and overflowing with Marinaites, but a girl will support her sista if the hormones are a-blazin'. She wanted the tall guy with the pretty blue eyes. I got stuck with the somewhat shorter guy with the backwards baseball cap. She's 5'1 and I'm 6'1, go figure. I'll be her wingwoman anytime. \n\nAnyways, as it would turn out, the handsome guy was insufferably boring. Honestly, it's great that you went to a prestigious university and were in a top fraternity, blah blah blah, but I STILL don't care about your golf score. I lucked out, and HIS wingman, the guy with the baseball hat, turned out to be awesome. (Proof positive, gentlemen, that personality trumps looks EVERYTIME.) We bonded. He bought us a round of beer when he turned out to be the only one with cash in his wallet. Hell, my friend was jealous of me and the almost guaranteed good night I was to have. \n\nAnd then I was brought face to face with one of the Cardinal rules of drinking: Whenever a lady is having a fabulous drunkenly good time with a gentleman, one of them is gonna get too drunk to continue. Guess who that happened to?\n\n\"Um...I need to get outside and get some fresh air...I feel green.\" I announced to the group while we waited for the pool table to open. My friend, already looking for a clean break from Mr. Pretty-But-Boring, whisked me outside where I proceeded to pass out on the curb. The guys took this as a typical girl bailing because she's bored maneuver, and we never saw them again after I recovered. I wasn't lying, I swearrrrrrrrr. I really did feel sick. This bar was super super stuffy...no ventilation?\n\nStill...good place for drinks when you haven't already knocked down 10 elsewhere. I especially enjoyed the bouncer who didn't card me after I turned the entry into a revolving door every three minutes, the party in the bathroom with the \"French Doors,\" and the female patron in line that told me I looked like \"that girl from Save the Last Dance...but without the frizzy hair.\"\n\nAnd to the shorter guy who I deserted? Call me. Oh, you don't have my number? Just kidding, I guess something suddenly came up.", "author": "Devon S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-16", "description": "Who wants to play a game of popshot -- it's a bball game not a porno yo!  \nNot big on basketball, what about fussball?  They got that shi here too.\n\nDeff not the greatest bar ever but it's a step up from KT's for shizzle.  It's an older frat scene.  A bit better then the lowest grade Marina.  But don't give Mauna Loa too much credit unless your big on campus activities -- if you know what I mean!?", "author": "Kat R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-14", "description": "Can I just say that cash only bars blow goats?  I NEVER have cash.  I feel awful for all of my friends that I have mooched off of every time we go to Loa (which is often) because I always make them buy me drinks.  Damn you cash only...\n\nOther than that, Loa is awesome.  Every time I go in, I contemplate how I am going to steal the racecar light over the pool table.  It is so freaking awesome and it would look killer in my basement.  I like the basketball game in the back - not so typical - I dig it.\n\nThis is a fun, low key place where I've blacked out a FEW too many times, I'm always sure to bump into someone I don't want to, and someone I adore.  LOVE IT.", "author": "Caitlin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-22", "description": "The first time I ever walked by this place, I heard a girl laughing hysterically inside and, when I turned to look, she fell out of the window onto Fillmore Street.  She picked herself up, dusted herself off, and went back inside and kept drinking.  I wasn't thinking fast enough to get the jeweler on the phone and go propose to her, but I did fall in love with the bar.\n\nCash only, and more often than not someone in there is looking for a fight.  But there are a lot of Cal alumni here so it's a mini reunion every time.  They stopped serving High Life in bottles, which is a crying shame.  Good drink specials during the week.  Well kept foosball table and Pop a Shot will keep me coming back.", "author": "Geoff K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-12", "description": "Expecting a svelte bar with club music, contemporary decor, and the dim lighting that'll set a pretentious lounge mood? This is not your place.\n\nBy the bar's name, I was expecting a tiki bar feel. The decoration only kind of lives up to that expectation. Then again, I don't go to a bar only for its decor. It's more of a homey, somewhat tiki, bar decoration with a pool table, bowling video game, and hoop game stuck in. At the least, you can be entertained by the games if not the alcohol.\n\nI came here on a Saturday night for a bachelorette party. It started off slow because there were only a handful of people at the first station and none at the second station. We ended up moving to that second station, manned by a blonde female (didn't get her name) and she was part of the reason we all had a fun time. She was great with the drinks but also was an active participant in our party. When we asked her to make a drink that she didn't know, she looked it up on her phone and made adjustments (after asking us if that was ok). \n\nThe crowd is your usual Marina, young professionals and college crowd. They were quite friendly this particular night, trying to help us with completing the tasks on the bachelorette party list. I'll have fond memories of the stupid stuff we did in the name of the bachelorette.", "author": "Gwen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-04", "description": "You know you have a girlfriend for life when you both can talk about how some hot loser you met  back in the day took you here on a first 'getting to know you' kind of date...\r\n\r\nand then realize it's the same guy you are talking about!!!! Small city... Ha!  Most girls would be ridiculous about that sort of thing...\r\n\r\nNo, but I sometimes stumble into this place.....it is a dirty boy's cave for sure.  Lots of them tumbling around and about, looking for trouble, but somehow - it just doesn't appeal to me in the same way!", "author": "Yelper A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-07", "description": "Mauna Loa is the Marina bar that all of your friends who like the Marina try to drag you too, assuring you that \"it's totally not a Marina bar!\"\n\nYes it is.\n\nDon't get me wrong, I love the fact that they have Big Buck Hunter and yes, drinks are a little cheaper than your average Marina watering hole.  Still the crowd is 100% Marina - just dressed down a little.  (Read - the collar on the polo shirt is not popped).\n\n3 stars, because on a slow Tuesday, this can be a fun place to come to play a little foosball, the aforementioned BBH, and get some drinks.  If you've got to come, come on a weekday - on the weekend, it's too crowded to even move.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-18", "description": "My first impression of Mauna Loa was that it was kind of confused.\n\nIt's called Mauna Loa and there are a few island decorations on the wall, but it's not a tiki bar by any stretch of the imagination.\n\nThere were some flat screens with the game on but not enough to make the place a sports bar.\n\nAnd maybe this is a dive bar by marina standards, but anywhere else it wouldn't be seedy enough for the label.\n\nIt is, however, an unpretentious neighborhood bar in a part of town that sorely needs unpretentious neighborhood bars. Good beers on tap and the staff is friendly and quick, though pints are a little more expensive than one would expect. I wouldn't cross town to come here but it's useful if you're in the area and want to get away from backwards baseball caps and attitude.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-22", "description": "Bars with pop-a -shot automatically get my vote. I know. Its juvenile to love a bar with a pool and Foosball table in addition to the \"amazing game where you can exhibit your endless basketball skill while drunk  off your ass.\" Its a lot harder than people think - just imagine very sloppy drunk people trying to use coordination armed with nothing but raw talent and tiny basketballs the size of a baby's head. \n\nI digress. Its a fun, lowbrow joint that serves up plenty of self entertainment and takes you back to the days where you wish you could borrow your sister's fake ID and be part of the cool crowd. Now that I have had plenty of years of imbibing under my belt, I still stand behind this establishment. Its never let me down in the sense that there is always beer flowing and fun games to partake in. Hint: Games are a great segue for a bunch of drunkards to get to know each other. So key. \n\nNeedless to say its way better than the beer pong playing, college frat boy crowd at the Bar None. This is not to say ML doesn't get some overflow. You've been warned. Its the friggin Marina. If you actually expect to go somewhere here and not run across the intensely vapid schmoes that inhabit this area than you are even more deluded than they are!", "author": "Stacy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-09", "description": "I like to think of Mauna Loa as a Chuck-E-Cheese for adults. You can play pool, foosball, Buck Hunter, and the bane of my existence Pop-A-Shot all while pounding back a few beers. \n\nIt may be smack in the middle of the Marina (you will find some of the typical Marina crowd there) but its more down to earth than the rest of the bars in the area. The crowd seems to be more mellow. \n\nThe drinks are relatively cheap and they even have Pabst Blue Ribbon, but I am still waiting for the day that Mauna Loa starts serving Natty Ice. \n\nMake sure you bring enough singles (not to put in the panties of the Marina girls) for the games. I think I end up spending 20 bucks on drinks here and another 20 on the games.", "author": "Arin N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-13", "description": "The only reason I keep ending up at this place is that my best friend is addicted to pop-a-shot. Yeah, the arcade basketball game. I play foosball while he plays pop-a shot, and everyone's happy.\n\nSo why do don't I like this place? The entire front of the bar is full of triangle bar spillover. They have a pretty average beer selection and it's cash only. Here's the killer, though: This guy who thinks he is a pro foosball player shows up on peak nights and clowns everyone in the bar. He just cleans up. It's not for money or anything -- this guy just likes to beat up on drunk idiots. It would be like if I enjoyed picking fights with kindergarteners. It's not even fun to play him. I have seen him pumping quarters into the foosball table by himself on a saturday night, just setting up the ball in a particular position and practicing moves without an opponent. He even brings his own silicone lubricant so that the handles glide more smoothly. Having really serious people around takes all the fun out of being drunk.", "author": "Derek S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-28", "description": "The number one reason people come to Mauna Loa is to play pop-a-shot (the basketball game). They also have a jukebox, pool table, foosball, buckhunter and other retro video games in the back.  I've had both good and bad experiences here. About every other time I come it smells like someone threw up on my face and wouldn't let me take a shower for three days. The other times it smells like a bar and I grab a beer and play a few games of pop-a-shot followed by some foosball.\n\nThis bar is definitely better when it isn't packed with people, but what bar isn't?\n\nAnother cash only bar. They also have a patio out back and I've been here twice when they've randomly been having a free bbq if you're drinking.", "author": "Jackie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-21", "description": "Fantastic service on Mondays. There is an amazing woman who is so kind and personable. And get this, she even makes food for the bar patrons! Five stars for excellent service.", "author": "elly w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-17", "description": "HaHaHa DIVE BAR INDEED!\n\nCash only which I detest. \n\nBUT they have a basketball game in the back ,and after several beers, I DOMINATE!", "author": "Nancy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-05", "description": "Aaarggh.\n\nIt is not so much that I dislike Mauna Loa per se- it's a fratty bar in a fratty neighborhood, and lordy knows I've been to my fair share of those. I mean, some of my best friends were in a fraternity, and I spent many a night singing their charming ditties and hazing their pledges. And, I think that my 1,353rd night out in a fratty bar won't kill me. I would just rather spend my valuable time elsewhere now that I live here in fabulous San Frnacisco.\n\nSomewhere without a hoopy hoop machine.\n\nAnd without people who are excited about hoopy hoop.\n\nEven my fraternity guy friends have moved past the hoopy hoop. Some of them have turned 30, after all.\n\nBut not so the people at Mauna Loa! They're also 30... but still excited about hoopy hoop and Deer Hunter. I also feel like this is a place that people go when they don't know what else to do- \"Meh, let's go to Mauna Loa.\"\n\nTo that I say \"Meh, let's just not and say we did. BORING.\"\n\nBut, there are a few good things about this place.\n1. Second bar- keeps things moving (but it's cash only)\n2. Lots of bar stools\n3. We snuck an entire bottle of tequila in here, it was still sealed and we were not planning on opening it (carrying it around for a passed out bday girl), but we did it! And then I hid it under the sink in the bathroom so I wouldn't have to haul it around. Genius, yes?\n\nSo, in conclusion: Mauna Loa= my night has been a bust.", "author": "Katie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-22", "description": "random find during a random Tuesday afternoon mimi pub crawl.\n\njukebox (always a plus in my mind) fast and super friendly service! hilarious regulars who both entertained and bought us shots! plus a complimentary fancy cheese and cracker tray?? hell yes!!\n\nA strong recommendation for non-douchebagery in the douchebag prone marina.", "author": "Caddy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-23", "description": "Been here a few times, never during peak bar hours and have found a haven.\n\nMy last experience was a Monday evening with a couple of friends around 7ish. Just a few older gentlemen at the bar, and Tammy the bartender.\n\nThere were FREE hot dogs and oxtail chili that Tammy made for everybody. Simply incredible.\n\n3.50 for a pint of Great White Ale, my favorite. Tammy just wanted to make us happy, she let us sample any beer that we weren't sure about and kept coming over to our table just to give us cups full of goldfish snacks and peanuts. Between Tammy (the grandmother -figure I always wanted) the cheap beer, good music, relative calm and pop-a-shot basketball, it was the best monday night ever.\n\nOnce again . . .FREE hot dogs monday nights. Don't know if the chili is there everytime or Tammy just made it to be lovable.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-16", "description": "-One star for not being KT's.\n-One star for having a second bar near the back to ease some congestion.\n-One star for some pretty hot ladies.\n-Minus one star for many of those sluts refusing to acknowledge me. \n-Two stars for the arcade-style basketball game in the back.\n-Minus one star for groups of junior investment bankers playing Big Buck Hunter with entirely too much enthusiasm.", "author": "Sam M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-10", "description": "This place is a mixed bag of experiences. It's got a dive look and feel but if you ever have been during a weekend night, it's packed to the gills meat market style. I've nearly gotten into fights and yet have had strangely good times too. The last time I was here my friend decided he'd hold his bday in the back bar and since we absolutely owned that area, the booze was flowing, and no one our party of 20 were sober. That included his parents. When everyone's having a good time it's easy to ignore everything else that's going on. However as a regular hangout I'd say there were many better places but it's good for the unusual people watching every now and then.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-27", "description": "One of my favorite places to drink when I lived in SF in the early 90's, and so I was so pleased to be able to drop in for a pint last week and revisit my old haunt.\n\nThis place has not lost any of its character in all these years, and it's just heartwarming as hell to see that ever-distinctive yellow lighted Mauna Loa sign.\n\nGood jukebox.  Crappy parquet wooden half-circle bar.  20 beers on tap.  Solid mai tai.  What's not to love?  Praying that places like the Loa can last over time.", "author": "Brad P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-22", "description": "I can't.  I mean, I just can't.  \nOK, fine.  Maybe just a bit.  \nI have been here many times.  Because I have co-workers that love the place.  My God, do I hate it.  Every time I come here I remember why I don't live in the Marina.  Sure, if I were in college, I would love this bar.  I loved the Marina when I was in college.  But, see, I was 20.  I had bad taste.  I think that was pretty apparent to those who knew me when I was 20.\nMauna Loa.  \nI can't.  I mean, I just can't.", "author": "Blake W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-20", "description": "Terrible bar tenders, and their anchor steam was flat. Seriously flat, like less than a 2 mm of head. They kept insisting that it was 'just tapped' and 'fine'. Also they close around 1:30, can't really call yourself a dive bar if your last call isn't really last.", "author": "Zach H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-07", "description": "Mauna Loa is easily one of my favorite dives in San Francisco.  True, it's a little small, and the no-credit law is a little bit on the annoying side, but where else can you play big game hunter and pop-shot while still being surrounded by yuppies?  \nThe drinks are stiff, ambiance is cool, and it's always a fun time.  Just make sure you bring lots of cash and face away from the men's bathroom door.  Good thing I'm an exhibitionist.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-02", "description": "This place is a-ok but not the best the Marina has to offer...or is it?\nI've been here a couple times for some juke box tunes and cheap drink specials but there's nothing super special about this place.\nThey do have some antique video and canival games which really amuses me, however, the only men in the bar seemed to be utterly occupied by these games.\nI've never been here when it's been super packed, but I wouldn't go if it was.", "author": "Dani B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-17", "description": "Fun bar- has foosball and a basketball game. We had a good time.  1 star removed for their cash only policy!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-15", "description": "I couldn't bring myself to pick the first verse over the second or vice versa. they both express my heartfelt emotions equally:\n\nSo you wanna die, commit suicide\nDial 1-800-Cyanide line\nFar as life, yo it ain't worth it\nPut a rope around your neck and jerk it\nThe trick didn't work\nYour life was fucked up from the first day of birth\nAfter watching Jackie Gleason walk into a precinct\nGun down the captain for no fucking reason\nAnd get some LSD or a drink from the bar\nGet behind your wheel and crash the car\nLike Desert Storm, got bombs for the war\nconfront an alligator, let it eat ya raw\nBack to the function, riding the caboose to hell\nBZZZZZT touched the third rail.\nYou fucked up chicken, now you just got fried\nCause it's a suicide\n\n *chorus (if you've never heard this song, go get it son: 1-800-suicide)*\n\nHey you little rich kid, what's your beef?\nCome and tell the Grym Reaper all of your grief\nYou asked for a Benz and you only got a Jeep\nYour pop's got endz, but yo he's mad cheap\nMaybe you're a bastard child you think\nMom and dad are white and you're dark as ink\nMaybe you're Sicilian with a tan\nBut you hate lasagna and the pizza man\nNow you stand on the grave digga locked and\nYou're singing the blues about the rough life you've got\nNot\nYou don't wanna live no more\nI guess you're really ready for the grave yard tour\nWhen you get home just fill up your windows and you doors\nTurn your oven on high for about four hours\nLight you a blunt, kiss your ass goodbye\nYou gassed yourself 'cause it's a suicide", "author": "Nicholas E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-09", "description": "Do you like free food with a nice cold beer? If so, you should probably check this bar out on Mondays.  Tammy makes a mean pulled pork sandwich.  The vibe is mostly unpretentious, which is unusual for the area.  Also, I like to play the basketball game in the back and bet people on the game for drinks.  It's probably not the best bar to pull chicks but who cares..I'd rather drink a beer, eat food, and watch football after work.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-28", "description": "Not bad, not great. We went here for a friend's birthday night out ... I was just along for the ride. I was pretty pumped when I saw the name was Mauna Loa -- thought I could pretend I was in Hawaii.\n\nBut that quickly changed once we got inside. Cramped. Just OK. The crowd reminded me of people I'd see in a bar in Ohio (I have friends in Ohio) and while that's not a bad thing, it just threw me off because I expected it to be some trendy Marina bar. Not to mention some slutty whore bitch who tried to pick up my boyfriend right in front of me. She didn't even seem that drunk. She bought him a beer RIGHT IN FRONT OF ME. Bitch, pull up the collar of your off-one-shoulder white trash shirt and walk the fuck away. Yeah, you heard me. OK, too bad I can't be that awesomely confrontational in person. Instead I had the birthday man go give my bf a kiss on the cheek so she got the, ahem, wrong idea. Anyway. Bitch.\n\nBut aside from that, the bartenders were all really cool and friendly and made good drinks. And you could actually hear in this place without yelling. The music/atmosphere was loud, but not PUMPIN' so conversations were possible. Unfortunately that also made conversations with the bitch and my bf possible. OK, OK ... I'll get over it ... one day.", "author": "Lea B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-17", "description": "It's 2008. I think it's time we move past the cash only bar. We've put people on the moon, internet on phones, and building hybrid cars, but you can't accept a credit card???\n\nMauna Loa is a fun bar, but I'm just over places that don't accept cards. I don't want to carry $50-$100 in my wallet, so you can do math behind the bar.\n\nOverall, its a down to earth bar, with a fun crowd, though it does bring out the stupid in people. I'm sure I'll be back, but can we at least agree that Mauna and many other places in the city need to catch up to TODAY!", "author": "Mike K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-26", "description": "Two words:  Frat.  Party.\n\nMy roommate sometimes has sparks of  brilliance.  One night when we misguidedly found ourselves hiding from popped collars and i-banker talk (groan) on my first and last Marina pub crawl, he yelled these words into the night sky:  \"This place is the shit side of a shadow!\"\n\nI don't know exactly what it means, but it somehow fits Mauna Loa perfectly (and the Marina as a whole... sorry).  Gets two stars only because the gin & tonics were strong enough to cast a haze over the rampant douche-bagdom...", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-30", "description": "The first rule of Mauna Loa Club is you don't talk about MLC...but:\r\n\r\nThere are many \"Nevers\" in life....MANY. Some of the \"Nevers\" are hard to learn. The \"Never\" I learned at the MLC was a valuable one. Olives, Fondue, Tequila, Purple Hooters and Jersey Dave trying to get us in a round of fisty-cuffs should NEVER happen again. \r\n\r\n3 duckets for the first part of the night. Otherwise, another NEVER bar in the Marina.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-05", "description": "I'm mostly writing this review to give props to the way the bartander dealt with an annoying biligerent kid on the 4th of July.  I'm not sure what he was saying, or how this whole ordeal began, but my ears perked up when the bartender tried to kick the said kid out of the bar.  The kid's response was \"Well I'm a lawyer so watch out.\"  Hahahaha.  He was like sure, try to kick me out and call the cops.  So the bartender grabbed the kid (maybe by the ear) and led him out of the bar.  Much to his chagrin, there just so happened to be a cop outside who promptly dealt with the a-hole.\n\nI'm not sure what it was, but my draft Stella didn't taste that great.  It was warm.\n\nI liked the chill atmosphere.  With three plasma tvs, It would be a good place to watch a game.\n\nCash Only.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-25", "description": "OK bar compared to the rest of the bars in the area. It gets super hot in there cause there is no ventilation. It's cash only but they have a good amount of beers on tap.", "author": "Darius A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-26", "description": "I've been looking for a foosball table in San Francisco for a month and finally found a good tournament table at Mauno Loa's. But the place only gets two starts because the table is not well maintained, it's not level, and it has the cheapest balls you can buy. They are so bad, in fact that you can't get them to stop rolling and when they are rolling it's impossible to tell which direction they will jump next. If you like foosball, as much as I do anyhow, it's not worth wasting your time here. The only thing worse than the table are the potential opponents you will find. I was hoping to find someone to give me a good run for my money, but I didn't. Ok, I'll give this a 3 star rating because I realize that I'm a bit of a foosball junkie and not everyone has my same opinion of the game.\n\nIf anyone knows of a good place to play foosball, perhaps where people host tournaments, please let me know.\n\nAdditionally, they only accept cash.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-28", "description": "Great selection of beer that's on tap.  Bartenders do not skimp on the booze when making your mixed drinks.  They serve Goldfish crackers at the bar most times... Foosball, pool table, basketball hoop arcade, hi-tech jukebox, friendly people, pet-friendly... what more can you ask for?  Well, maybe more space, but really, when you're enjoying yourself that much, you don't really care if you bump elbows and make new friends;)  Definitely my first stop for drinks...sometimes my last, it depends;)", "author": "Kim P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-16", "description": "It was sunday afternoon at around 3:00PM.  I'd stopped by catch the last few innings of a Giants-Dodgers game, one where the home team wasn't faring so well and the boys-in-blue were handing us our asses. The Giants were down 5-2 in the bottom of the 8th.  Ex-Homeboy turned traitor Jeff Kent had just nailed one into the bleachers.  Schmidt had held the Dodgers to two runs, but the relievers didn't look encouraging.  The possibility of Barry Bonds hitting number 714 hung like a carrot before a staduim full of fans....but nobody seemed to be holding their breath. Another forlorn face alongside mine stared blanky at the screen in front of us.   \r\n\r\nBaseball aside, the Mauna Loa's not a bad spot to hang on a Sunday afternoon, though I've peeked in at night and seen it packed with a crowd of twentysomethings that I had no intentions of wading into.  A small horseshoe bar greets visitors, and a larger area further in back hosts a pool table and several video games.  Three well positioned LCD televisions face outward from a small inner-semicircle within the horseshoe, giving almost everyone at the bar a \"best seat in the house\". \r\n\r\nThe bar had one other aspect I wasn't used to seeing....an afternoon crowd with single female patrons, and ones that were old enough for me to seriously admire.  Then I remembered...I'm in Cow Hollow. Barry Bonds never got on base that day. If I explained to any of these women that I was a 43-year old self-employed computer repairman whose biggest financial boast was positive cash flow, my batting average for the day wouldn't have looked much better.\r\n\r\nEnd of the Ninth. Empty glass. Bid farewell to the other gloomy Giants fan. Exit onto Fillmore. I met eyes with the cutest woman in the place on my way out, but didn't break my stride on my way to catch the 22 Filmore over the hill. Part of me thought to myself, \"If I were a younger man...\".  The other half retorted with, \"Who you kiddin' fool?\"", "author": "Mike W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-19", "description": "Dive bar and just what you would expect - marina guys, overdressed girls in white coats and cash only. Fantastic.\n\nExcept it is! I have been here a few times and the best thing about this place is the basketball shootout game and foosball table in the back. It makes it the kind of bar you could stay at all day/night. \n\noh and the drinks are cheap too!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-27", "description": "If you are 23 and under, you and your friends should go here each and every night of the week. It's  cooler that the other neighborhood 23-and under spots like the Comet Club and Bar None. The drinks are definitely cheaper that the Maitrix across the street. You can make friends with the other patrons over a game of pool or the juke box.  You may even meet a nice guy who wears a fleece and works in finance. \n\nIf you are over 23, stay far away.", "author": "Colleen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-09", "description": "All I remember is that...Ellis K and I had some custom drink here. Some drink called...nipple something or other...and no it wasn't buttery nipple. I dunno...it just tasted really sweet. Ellis...if you remember...let me know~!! \n\nThis place was alrite. It wasn't crowded just like the other bars we went to. The thing I like about SF is that...drinks are so cheap there. Cheaper than LA. Well...I guess...a lot of places are cheaper than LA when it comes to nightlife. Cheap drinks. Gothy yelpers. Fun. Fun. Fun.", "author": "Caroline Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-16", "description": "The only pop-a-shot game in the Marina.  A fine place to go to avoid the d-bag collar poppers overflowing from Matrix out onto the sidewalk.  Order up PBR or some Frenet shots, put some Journey on the internet jukebox and relax.  \n\nBonus: rarely, they open the back patio.  These are the most special days of all.", "author": "Rob K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-26", "description": "Dirty, Dingy, Small, Cramped, Stuffy and Cliquey place. Not very easy to meet new friendly people here, everyone seems to come with their own clique already. Pool table is a joke, situated in worst possible area. CASH ONLY", "author": "Tracy N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-11", "description": "Wow, look at all these pathetic reviews about this place...talking about \"ambiance\" and \"decor\" and \"decoration\"...good God, it's a freakin dive bar, not Hometime!  We came here last night because it was on the way home and after about 5 seconds, I pretty much hated it.\n\nFirst of all, it was after the Red Sox game and the bar was chalk full of Sox fans; one guy with a jacked up new england accent drunkenly said \"Hey man?!? you sox fans?!  This is a Sox bar!!!\"  Last time I checked, Mauna Loa was 3000 miles the OTHER way from Boston; and why's this city chalk full of sox and pats fans?  There should be a law where if you're a Sox or Pats fan and you leave Boston, you should get stabbed in the stomach.\n\nThe drinks came slow, cash only, crowd was a pack of franks.  The only thing good about this place are the basketball hoop in the back.  The Polynesian Gods would turn in their graves if they knew about this place.", "author": "Nico M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-24", "description": "Perhaps one of my favorite taverns in San Francisco.  The Mauna Loa (or 'The Loa' or 'Den of Lovely Sin') is old-reliable.  I like this place because the owner works the bar, lives upstairs and if you're a regular, he'll take care of you in the sense that when you stroll in on a Tuesday, he gives you the story of what you did-- and marginally remember doing-- a week before...  he is a chronicle of your own drunken antics.  And by you I mean me.  We all need that kind of critical feedback-- in fact, it's a component that's missing from most bars where the staff is more interested in getting you sauced and taking your money than in either making you laugh or reconciling your demons.\n\nThis place has a tremendous internet jukebox that reaches out into the internets and brings back everything from Journey to Santana to Usher (remember Usher?  he's the dude that makes the girls wiggle and froth).  The pooltable's a bit shit as there's a column near one corner that completely prevents any kind of decent shot...  that's the kind of thing a realtor would call 'charming'.\n\nAnd then there's the true gem of the Marina... pop-a-shot.  What better way to settle a wager for a beer than a bit of pop-a-shot.  Although watch out for the pop-a-shot shark.  He's like the aforementioned bar staff and is more interested in taking your money so he can get drunk.  No bueno.\n\nThe crowd here ranges from the older regulars who watch all manner of sport from NASCAR to football.  They work in the financial district and raze each other like family.  When they fade into the early evening, the rowdy crowd comes out, dudes in striped shirts and girls in tight pants.  What's not to love!  This is a great place to meet a date for the night or perhaps for a lifetime... although I can't personally recall any of the latter and quite a few of the former.  And by you in this case I mean you and certainly not me.\n\nCheers!", "author": "John R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-19", "description": "ditto on the frat scene. didn't realize such a place existed in the marina. 3 stars on the bar itself.\n\nam actually only writing a review bc my blackberry was stolen out of my coat pocket last night (coat was hanging on the wall quite near to me and generally in view.) i just noticed that a prior reviewer had similar experience.\n\nso yes, fine dive bar. just watch your stuff.", "author": "kt s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-15", "description": "As dive bars go, Mauna Loa gets an A. If they served something greasy like fries or hot dogs, it would be an A+. \n\nWe went for a private thing, they treated us well. Drinks were strong and fun.", "author": "Amani Ellen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-23", "description": "Great drinks and an awesome door man! \n\nTotally the opposite of the stereotypical \"Marina\" bar - it was fun and really mellow and down to earth.  No pink polo shirts!", "author": "Josie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-14", "description": "I like this bar for everything it is and isn't: \n\nIt is a dive...which I happen to like. \nIt is pretty cheap...I bought a round of four drinks (two rum and cokes and two beers) for less than $20 on a Saturday night\nIt isn't pretentious....which it could try to be given the location. \nIt isn't full of the typical Marina clientel...people are a little more chill.", "author": "Jenn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-22", "description": "I can't believe I have yet to write a review on this place.  Its in the rotation.  For sure.\n\nPop-a-shot, foosball, pool tables, juke box have all been covered.  The Loa is crowded, hot, blah blah blah.\n\nUnion Street Festival.  2002.  My job at the time forced me to work on what used to be the best day of the year.  Throughout the day I'm bombarded with drunken voicemails filling me in on the carnage the festival was inflicting on my friends.  We are talking drunken confessions of love, inappropriate gropings, and two shoving matches.  Epic stuff.\n\nMeanwhile, I'm stuck in a fi-di office fulfilling my role as model bitch (it wasn't as glamerous as it sounds).  When I finally got out around nine, I needed to do two things:  find my friends and get drunk (catch up).\n\nThere was only one place that I'd be able to do both:  The Loa.\n\nIts that kind of place.\n\nMy story isn't that good, but it's true.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-10", "description": "For the sheer fact that a couple came in on their wedding night this Saturday, this place is aces w/ me.  Um, she was in a STUNNING Vera Wang gown which was a bit of a contrast from the weeds and odd Xmas decor on the wall.  But hey, it takes all kinds.  Bar tenders are on it.  Get's packed around 11ish, but if you have a spot at the bar, you are golden.  You like sports, you're gravy they have tons of TVs.  Oh and did I mention the basketball game in the back?\n\nYeah.  Be aware cash only..  Forget parking, hello it's the marina.  Hoof it or cab it!", "author": "Nicole F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-20", "description": "The Marina-as-guilty-pleasure is an admission I will gladly make.  As long as I don't have to park there, the cabs never stop running, and I don't have to spend more then 17 minutes at the Coment Club [or any other bar, for that matter] unless I choose to, I don't really have any issues with Chestnut or Union Sts or the Bermuda Triangle.\nOnce you get past the bottleneck up front, it's usually not crowded in the back and there are games to play as well as a second bar, so no fighting for space to order more beers.  That said, I recall spending lots of time texting or trying to figure out why we are sitting in Mauna Loa instead of the next meetup spot -- so I guess that's saying something.\n\nLadies, watch out for the bathroom door: the first time I was there, some extremely drunk/rude girl decided to not only slam it open so hard it removed [most] of my toenail, she then felt the need to lecture me on why I should have worn closed-toe shoes. Thanks? Lesson learned.\n\nGood times, Mauna Loa.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-14", "description": "This place was pretty decent as bars go. I didn't quite get why it was called mauna loa as nothing really resembled anything hawaiian except the two hidden surf boards on the wall. Other than that, it was your typical, non descript neighborhood bar.\n\nI liked the fact that they had real ginger ale to go with my whisky so cool beans to that.\n\nFor the most part the clientel seemed OK, though not the most social to those not in their group. Case in point: L and I were curious about the dice game some guys at the bar were playing. Neither of us were cruzin for attention or drinks or anything (I was currently holding a full beverage) and we're both cute, friendly girls. We simply walked over to their direction to ask what they were playing and if there was another set of dice. Before we could say anything, one of the guys shoved me away and grabbed the two seats next to him and said I couldn't be there because his friends were outside smoking and were coming back to their seats. Hmmm, wasn't planning on taking any seats. After that, I guess I didn't feel overly welcome if these were regulars so we ended up leaving pretty soon after. Perhaps a more friendly attitude by the customers would have been cool but at least the bartenders were nice.\n\nSo it may not end up being a go-to, but I wouldn't not go there if just for a quick whisky and ginger.", "author": "Allison T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-30", "description": "Other than cash only policy and dingy bathroom, liked everything about the bar. Good people, drinks, and entertainment.", "author": "Robbie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-03", "description": "So far, this is the closest I've come to the CC Club in Minneapolis.  Since nobody knows what that is, I can best describe it as the bar that Tom Arnold bummed around in before he was \"famous\".  Yeah, think that sums it up nicely.\n\nFree goldfish too.  Bar popcorn has some serious competition.", "author": "Dave K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-25", "description": "This is the best dive bar in the Marina, hands down. The trick is you have to go on a weekday because otherwise a lot of preppies come in on the weekend. Tammie the bartender is the best. She makes great drinks and always takes care of you. She also puts out a free food platter of salami and cheese.", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-16", "description": "I dig this place.  Even though there are definitely some chicks (every time) that you just want to put in a cab with a bottle of water and send them home cause they are either making a fool of themselves or acting like a classic Marina A-Hole.  But you get that anywhere.  I think that the crowd is generally pretty nice and I love getting some beer and playing the basketball shoot game in the back.  I should venture here more often.  Chill place.  And nice Bartenders which in my book can make or break a place!!!", "author": "Kylie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-24", "description": "A friend of mine loves this place, so I have to assume my last experience could have been atypical -- but it was abysmal.\n\nI was there late on a weeknight, and they weren't super slammed so the service was reasonably fast, but the end of the evening was completely rude.  At the end of the night when it was time to pay the bill, one of the bartenders made change for $100 for my colleague to pitch in for the tab, and after doing so thought that she had accidentally given the $100 bill back to him.  She barked at him to pull the wad of cash out of his pocket, and when he said she didn't give him back a $100 bill and didn't have one (and she didn't give it back to him, I was watching) she snatched the wad of cash out of his hand and started rifling through it.  A number of us saw this happen and were dumbfounded.  To make matters worse, in her haste she accidentally flipped a few bills out of the stack onto the floor behind the bar, and had to pick them up and put them back up on the bar (hopefully they were all returned).  When she finished and didn't find the bill, she made a snide comment -- no apology in sight -- about figuring it out later, and went back to barking at us to get out of the bar (It was roughly 2am and they were trying to close the bar).  I understand that bar people need to close on-time to stay within city regulations, etc.... but really people there are more friendly ways to deliver the same message.  A friendly \"thanks for coming, we're closed and you need to go but please come back soon\" kind of message would have left us happier, more likely to return, and I'm sure we all would have left a better tip too.\n\nActing annoyed that people are still in your bar after having been rude to them and not apologizing is not going to result in a return visit.  There are too many other places to get drinks in SF.", "author": "Teague A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-23", "description": "We were here for literally 2 minutes last night. We walked from Umami Sushi to Mauna Loa to use the bathroom, so this review is for their bathroom. Bonus points on their wavy looking sink! I'd go to the bathroom here again! :-) The crowd seemed cool, but the girls and I were already tipsy from dinner... Or we had goggle eyes, who knows...", "author": "Jojo N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-29", "description": "hawaiian named bar....no mai tai!?...entrance and bar front....pool tables games back...late afternoon marina stroll continue...sunday, sunny and clear, but cold....seek shelter in mauna loa...drink of fat tire round....early and rowdy small group yelling and screaming....disturbing our late afternoon drink....", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-22", "description": "After diner in the area on a Wednesday night, some friends took us here so we could hang out with each other and not deal with a big crowd.  They have foosball, pool, Buck HunterPro and PopAShot, so that means its awesome.  I'm guessing the standard crowd is similar to the guys who were wearing their suits, and look like every other Finance guy from Manhattan, but it was fine, because multiple ladies were all about my shaggy hair and beard.  Hmm...\n\nCheap beer and shots, and this bar doesn't try to be any classier.\n\n\nBut I would never go here on the weekend, or actually plan to go here; only if I was in the are would I come back.  Does that last sentence even make sense?", "author": "Thomas G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-08", "description": "Mauna Loa, for those of us in the Marina who want a little spice of hipster in our nightlife.  \n\nFirst of all, the cash only requirement is definitely a downer.  I don't really become a true fan of a bar until I've had to come back the next day because I left my tab open.  It's a genuine a rite of passage. \n\nMore on the decor:  All wood, and to be honest, a bit on the cramped side.  However, when there is the right amount of people at the bar, the place is downright cozy--in a good way.  Add 100 dudes and 3 ladies . . . . less cozy and more \"No I'm not hanging out with this guy 3 inches away from me, we just happen to be standing here.\"\n\nA strong point in favor of Mauna Loa \"Club\" (Club?  When did that happen?), is the games.  It has the full assortment of pool, foosball, and the kicker, the recently upgraded basketball machine.  Makes for good times, especially when dudes get beat by their significant other on the basketball machine and have that \"I could have dun' better if I wanted to\" face going.\n\nBottom line:  When the number of people at the bar is right, not too few or too many, and you have enough cash on hand (read: before the strip club people), a good place to get your drink on, play some games and chill in a place that doesn't try TOO hard to be cool.", "author": "Jordan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-14", "description": "When I lived in SF I was rarely in the Marina district so I wasn't sure what cool dive bars they have in the area.  While visiting last month we stayed in this area and luckily  found this great bar.  There aren't many.  We met up some old peeps and had a great time.  Our bartender was awesome.  I cannot remember her name but she was great.  A lovely city, $5 Fat Tires, a game of pool and great conversations.  Ideal.", "author": "Grace L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-18", "description": "me (to group):  where are we going?  i'm think i'm ok w/anywhere, as long as it's not somewhere like circa.  i'll have to kill myself if that's the case...\n\ncolin:  i think it's called mauna loa?  they have a pool table, foosball...\nme:  FOOS...!?!?!  (i covered my mouth mid-sentence b/c i realized how loud i was.)\n\ni'm an avid foosball player.  my office has a table.  i usually play four times a week w/my boss and co-workers at the end of the day.  it makes me feel like i have purpose in my life.\n\nthe crowd wasn't too diverse, unfortunately.  ...the awesome bartendress served me a near-clear cranberry grey goose, which was all i needed for the time that i was there.\n\ncolin and i headed straight for the foosball table.  we successfully held the table down for a pretty long time.  thanks for being a great foos partner, colin!  :)\n\nfoosball table, strong drinks, forgetting where i was = a jewel in the marina rough.", "author": "Ting A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-21", "description": "The Blonde bartender with the beautiful S.F. boobs is a sweetheart. No attitude either which is rare for the neighborhood. Nice to see a bartender in the marina who isn't jaded. Other than her the place is kinda forgettable. Just a simple dive bar among the myriad of  kidney killing liver losing locales.", "author": "santiago g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-04", "description": "I just discovered that one of the bartenders (possibly the owner?) is a fan of Magnum, P.I. and on Thursdays - from 3pm to 6pm - they show back-to-back episodes of Magnum, P.I. (played off DVDs).  That's enough to entice me to drop in and tip a beer with the regulars on Thursday afternoons.", "author": "Alec B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-28", "description": "This bar is for those who are seeking some suds, billards, and a juke box full of sing-able hits.  It is a kind of like a dive bar that caters to locals-only, but invites outsiders to be a part of their cool club.  \n\nMy tip is to head directly to the bar to amply liquidify yourself and then make a bee-line to own the juke box.  Ply yourself with drinks and fire up some hits.  Once you properly take care of the music, then mingle with the crowd and you'll find some bad-ass cool cats, lucious ladies, and a few of those who cross both lines.\n\nGood times, Mauna Loa.  It rocks.  Can't wait to go back.", "author": "Bob D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-16", "description": "A buddy of mine recently had his \"Guess What? I've Decided to Totally Ruin My Life by Marrying Some Chickie I Just Met AND We're Moving to L.A.\" party here. Okay, maybe that's not what HE called it, but it's what 82.57% of us in attendance were thinking. Anyway, I'm not a full-on Marina-hater. It's definitely not part of my favorite City boroughs list, but I'm a relatively tolerant fella. That said, if you happen to be one of those who despises all things Marina, do not despair. This bar is actually quite fun. It has a relaxed, laid-back atmosphere, cheap drinks, and is group-friendly, so there's mass appeal no matter how much Haterade you've been sipping.", "author": "Gregor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-22", "description": "Thank you Tammy for the snacks and strong drinks. \"Stinky Cheese\" Tuesdays are great at Mauna Loa: free nibbles of cheese, crackers, and slices of meat (if you are carnivorous). I have passed this place many times and it is usually packed, although there were only 4 or 5 other patrons when we were having our Tuesday night happy hour. HH drinks are $3.50 and they pack a little punch! I will be hanging out here more.", "author": "Theresa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-09", "description": "Went here with some friends and had a great time. We meet a lot of really cool people and the staff great as well. My work meeting the next morning was not fun but I'll be back", "author": "Mike H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-25", "description": "we stopped in before the yelp event at kasa.\n\nthis hawaiian themed spot has lots of games like bball, deer shooting, fooseball, a pool table, and i think i saw pinball? other than that, it's a bar.\n\noh yea, the men's bathroom is real small with no door lock, so i was walked in on a few times. though there's a toilet and a urinal so when the drinks are really flowing you can prob go 2 at a time.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-20", "description": "From the outside on weekend nights, this place looks like it houses one of the most obnoxious crowds in the Triangle area; however, I was pleasantly surprised to find it inviting and fun, in a juvenile, fake ID-having kind of way.  They have foosball and a basketball game at the back of the bar along with a bunch of kids getting sloppy playing quarters.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-27", "description": "(One of) the only divey bar(s) in Cow Hollow.  Nice semi-circular bar serving fairly cheapy drinks (PBR on tap) with games on the tubes above.  I'm not a big fooseball guy, so besides the Pop-a-shot game in the back, the middle and back 'game' sections of the joint are kind of beat-up and whack (small pool table & pinball machine, dark and cramped with nowhere to sit and not much room to move around), and the bathroom has no lock on the door, so for me, it's all about the bar.  Can get crowded on Fri/Sat nights, but this is a great place for Marys on Sunday AM when you just want to watch the game and figure out where it all went wrong (right?), without dealing with the cheesedick sportsbar crowds @ other places.", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "Pop A Shot...big buck hunter...this place is my fav..only downer is its CASH ONLY...thats why its not a 5! Wayne the bouncer is crazy good at Pop A Shot..seen him get like 120!!", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-08", "description": "I have to say, I like this bar. It is filled with a bunch of boners, but you'll have that. This bar is dirty, they serve crap whiskey and they have a pool table. What's not to like about this place. I had no desire to talk to anyone, so I just sat back, got drunk and rocked out to the Stones.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-14", "description": "A slightly more pretentious version of Trad'r Sam's, I went here with three friends only to find myself soon locked in a cage of Marina dudes with vertically striped shirts. I panicked, downed my beer, got the hell out of there, hoping my friends would execute a recon. I suppose this place is alright. It deserves another try next time I'm in the vicinity--would be a good stop on a bar-hopping expedition.", "author": "Patrick G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-25", "description": "The only dive bar I go to... ever... \nManual: Come in before 10pm, get your seats , better between the bar and the window, so you can see everything and won't be crowded, order drinks and enjoy the freak-show which starts at  around 10:30 pm. You will see best that marina has to offer: cute drunken college girls, loud frat dudes, sleek cougars, wannabe cools with stunna shades on :-) Never disappoints!!!", "author": "Irina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-29", "description": "The Loa has been a home away from home for years.  I have met so many wonderful friends there.  Renee is the owner, a former teacher, and mentor.  He always welcomes you like you are one of his own.  His son, Curt, runs the place and treats you like family.  Tammy, one of the best bartenders in SF, offers up chili hot dog Mondays and fancy cheese plate Tuesdays.  It's a great afterwork bar to converse with the locals about business and sports.  Um, can I say....  not only do they have pool, Buck hunter but pop-a-shots.  Fun for all sports fans.  Decent wine too.  It's a great place to meet work colleagues, friends and first dates.", "author": "Angel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-18", "description": "We came here after our company Christmas party. It's a cool place, especially because of the fooseball, pop-a-shot, and gun slinging game. \n\nThe bar tender was okay, and the prices weren't too bad. Nothing to write home about. \n\nI'd come back just to play big buck hunter!", "author": "Josh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-13", "description": "The epitome of the Marina \"Fake Dive\" bar.  A regular haunt.", "author": "Jay W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-10", "description": "I'm not going to be one of those people that says \"OMG I love this bar because its a dive bar and not like those other Marina Bars\". If you're in the Marina, you know what you're getting yourself into. Mauna Loa is the same... Johnny I-Banker to your right, Tommy Frat Business Guy to your left. The thing that makes ML great is the Pop-A-Shot machine in the back, and cheap PBR. The men's bathroom smells like a hamster cage, which among the previously mentioned items, it what makes this place great.", "author": "Heavy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-07", "description": "i came to mauna loa on a tuesday night. i felt like it was 10pm but to my surprise it was only 8. hahaha. sooooo there werent that many people in there. we walked in and the bartender immediately asked what we wanted. thank you kind sir, how courteous of you!\n\npbr on draft. thank youuuuu!\npool table.\ncute bathroom. the doors make me laugh.\nhoops in the back.\n2 bars. but when i was there 1 was closed.\nsome seating.\nits divey. but its cute divey.\n\nthank you mauna loa for allowing us to kick it.", "author": "A. V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-02", "description": "WHAT THE HECK? \n\nThis place is too ghetto for me, and it's located IN the marina... does that mean I'm snooty, like a typical Marina beb?", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-05", "description": "I guess it's ok --- if you're the type of person who enjoys being crammed into a smelly, poorly designed hallway with a large number of former and current frat dudes and the dumb sorority girls they try to score with.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-15", "description": "Mauna Loa has a special place in my heart because once, on my way out of Bar None to this fabulous bar, I met a guide who was willing to show me the way and instead walked by it four times and made me fall in love with him as he did it. No really that's how we met. Without that affectionate association I give it a solid three stars. The cash only thing boggles my mind, as if they really don't get enough revenue to pay whatever fees they need for a credit card machine. But the bartender was awesome and really great with keeping all the drinks full, which unfortunately sets it apart from lots of bars around here. The crowd is class-A marina douche, but luckily I crave that kind of interaction every once in a while, so it works out. Plus, I go there, so what does that make me?", "author": "Katie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-18", "description": "Hit this with my boys last night and kicked some ass in basketball, even with my girly shot.  The bartender was impossibly nice; we felt bad she had to suffer the ramblings of a lonely soul sitting at the bar, but we had to be in the back with the games.  The somewhat confusing and discordant decor-- Can-Can dancer?  Check; Mauna Loa hawaiiana?  Check; Kentucky Derby memorabilia?  Check! --added to the charm.  I suspect, however, that as would be true for most Marina bars, I liked this place in part because it was an empty Monday night with just me and my charming companions.", "author": "sunny d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-05", "description": "Forget what happens just a few blocks away around the Matrix and Balboa ect... This place is  a nice spot to cop a seat at the bar and try and get the birthday girl drunk so that she will get the naked on with you.... while she did get drunk, she wasn't willing to fuck... at least the bar was nice and not to expensive.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-17", "description": "You have to be really wasted to enjoy this place... hence the stars. They have one of those new-fangled jukeboxes that lets you download songs.", "author": "Nick K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-28", "description": "As my friend put it, \"it smells like poo\". She also found a suspicious looking hair on her pint glass. On the plus side, they do have foosball and a hoops game and some decent beers on tap. However, if you plan on dropping the kids off at the pool, you should look elsewhere. The tiny mensroom doesn't have a lock on the door allowing for complete viewing...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-02", "description": "We're not talking chart-topping good times here, but this bar ain't bad.  There's usually enough elbow room--more than the neighboring bars.  Less pretentious, early to late 20-something crowd.  Tee-shirt and jeans night in the Marina....and a vicious moving-hoop basketball arcade game in the back.", "author": "Robby T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-25", "description": "Another bar I visited during the afternoon with a large group.  Very fun because of the pool, golden tee (!) and other games.  Not sure what it is like in the evenings, though as I walked past it one evening people were spilling out of the doors singing.  I'm in!", "author": "Beth G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-13", "description": "Hitting up the Mauna Loa on a weekend brings with it a whole host of disadvantages- packed bar, \"interesting crowd\"... in general... meh (like a number of Polk street establishments).  That said, hit up the Mauna Loa on a weeknight and it turns into one hell of a drive bar/great place to be. On Monday nights, Rory (avid Giants fan, cool chick) serves up strong drinks quickly. Free hotdogs if you arrive before 9.  Juke box is cool- you can download any song you want and on the weeknights there is very little waiting for your songs to come up. Reasonable priced pool table and b-ball games make this a fun place to hit up after work.", "author": "Jenni D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-08", "description": "what a fun place!  I really liked how low key this bar is, though once it did hit the witching our it got CROWDED!  Drinks were awesome, bartenders were awesome!  and I loved the little basketball game in the back!  fun times!!", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-19", "description": "Horribly rude bartenders.  I will never step foot in this place again, as it is clear that the employees do not value their customers in any way, shape, or form.  The bartender cussed out the girl next to me for simply asking why they had served her group of friends warm jaegger bombs.  Her group left, and so did mine as the behavior of the staff was repulsive.  This place is AWFUL!", "author": "Leigh-Anna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-26", "description": "A darn good dive bar in Cow Hollow.  Much better to hang here than most other places in the hood.  There is a good selection of beers on tap, pool, a jukebox, and other bar games in the back.  Watch out for Melinda, she will hussle you at pop-a-shot.", "author": "Dave L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-27", "description": "Most of the Fillmore Chestnut bars are the same old yuppie stuff.  Not Mauna Loa.......They have a special every day and they have Trumer Pils which is by far the best up and coming beer on the market.....THE BEST part of all is the backside with the Fooseball table and Basketball shoooting game.   My boy Lumbo went for 81 just like Kobe last year.  Dont cheat by just banking them in and having the score machine cheat for you.  I definetely suggest this place to start off your night before going to cut a rug on the dance floor at a club.  With a good crowd and great games to keep you busy, Mauna Loa is the place to be.", "author": "Harry E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-13", "description": "Pro: getting drunk and battling your friends on the fooseball table\n\nCon: getting drunk off of drinks that resemble the ones you mixed when you played \"bartender\" in 10th grade\n\nPro: being a dive bar makes everything feel unpretentious, like you don't have to fit some standard of clientele...you can get shamelessly shitfaced.\n\nCon: getting shamelessly shitfaced in front of some creepy old dudes who want to show you their apartment because they \"have artwork that might inspire you\"......???", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-29", "description": "strong drinks, mellow crowd, good music.  what more could you ask for?  maybe some cute girls, but then again you don't usually go to a dive bar with high hopes.  fun games in the back to keep you and your drunk buddies entertained.\n\nADDED BONUS- if you're bored of the inside games... there is a metal grate on an incline out front on the sidewalk.  if it's raining, or if you have a bucket of water to dump on the grate- it becomes slippery.  if you have a drunk friend with bad balance named el doooostay, you can convince him to try to slide across said grate.  if you're lucky, his feet will fly out from under him and he'll land flat on his back with an earth shattering thud.  if he's lucky, he'll only have some minor internal bleeding and a mild concussion.", "author": "Sean L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-11", "description": "Three stars for the overall dive bar status (sometimes leaves you without much about the place to rate), but 4 stars because of the WEEKDAY EVENINGS that can be had here. The regular bartenders are friendly, engaging people, and the regulars are a world apart from your typical B&T and Marina popped-collar scene that you'll encounter after 8 on Fridays & Saturdays.  If I had to rate it based on the weekend, I wouldn't even bother with one star, but I can't knock the place for what I have experienced outside that short time frame.  My only real complaints have to do with the men's room:  it smells of sweaty animals, wet buffalo and old feet (the experience is more nauseating than it sounds), and it's tiny size makes it next to impossible to smoke crack in privacy.  \n\nA universal comment: I see two completely different neighborhoods occupying the same space depending on whether it is a Tuesday afternoon or a Saturday night.  To each their own, of course... while the weekend nights there appeal to a certain crowd, you can't beat pop-a-shot, foosball, and big buck hunter all within 10 feet of each other. Serving your inner-child is never a bad thing! (unless you try cramming yourself in there late on a weekend night, which I wouldn't suggest as the countless varieties of axe body spray lingering in the air, fighting their epic battle for dominance and attention in your breathing space, will make you throw up in your mouth just a little...)", "author": "Bre L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-05-25", "description": "I'm only giving this place a few starts because it makes me realize my age. And if you go at the wrong time (i.e. Midnight) just forget about getting inside without becoming a sweat sandwich. I always forget that it's cash only too. I guess you have to be pretty wasted to have a good time here, and in case you need an example of this, just check out my photo above there with Todd.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-20", "description": "The Mauna Loa Club is a fun place to hang out on a weekend for Tornado foosball.  The location is very lively, and has a fairly good amount of challengers who think they can play better foosball with more drinks.  I took one star off, because many people spill their drinks on the playing field, that I have to clean up on the weekends.  Still, if anyone is interested in playing or practicing foosball, then I will not say no.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-06", "description": "Nice place, great location. The staff is friendly and you get goldfish crackers when you order a drink, which is a bonus in my book.", "author": "Charissa W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-10", "description": "This place has a good East Coast vibe. Lots of beautiful people, but not too pretentious. I dig the  staff who doesn't let anyone take themselves too seriously.  I applaud the fact that the bouncer lambastes and turns away anybody who he plainly doesn't like.  Thank goodness all the other 'Triangle' bars attract the annoying Marina folk.", "author": "Todd J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-08-23", "description": "I don't really know how people still flock to this place.  Maybe the lighting is just a little to high, because you can see how dirty the place looks.  The drinks are okay, but I never seem to enjoy the crowd that is there.", "author": "Robert R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-02", "description": "Well, I'm 24, so I guess that makes it my \"scene.\"  I would argue that anyone who stays young at heart would enjoy shooting some hoops, kickin' it  foosball style, blowing up rabbits on the buck shot game, and all the while enjoying a nice variety of brews.  The crowd seemed decent- it was actually slightly older/mature than I expected.  It's a clean, almost refreshing dive.", "author": "Erica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-23", "description": "Very nice staff, cool people, laid back and a pool table, what's not to love?", "author": "Moi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-08", "description": "cash only, but great games, pool, b-ball, and both golden T and the EASports version of it! \nvery relaxed atmosphere. I like it!", "author": "Scott K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-21", "description": "Union Street generally annoys the hell out of me, but for some reason I've always had a soft spot for Mauna Loa.  It's nothing special inside -- a standard dive bar with a pool table.  It gets very crowded on the weekends, but the crowd isn't the same B&T bunch that you find down the street at BarNone, so it's tolerable.", "author": "Andrew E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-22", "description": "A really great place if you're looking for that recent post-college crowd.  Fun groups of people, friends, pool, deer-hunter, foozeball.. it's like Chuck-E-Cheese, but for the young-20's crowd.  Very social.  Definitely a place I'll want to check out again.  It was not overly crowded and packed... you could walk around in the place, but still a good presence.  Drink specials depending on the day of the week - Saturdays are $5 Asian Bulls (Asian Vodka and Redbulls).. pretty strong.  Definitely the 'marina crowd' at this bar... the transvestite playing pool stood out a little bit.  Cash-only bar.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-11", "description": "The third stop of the series.  Maybe I was a bit buzzed at this point, but I was almost sure this was a dive bar in the Marina.  Yes, a dive bar.  Replete with cheesy, dated, faux wood paneling and mismatched decor, none of which served any theme even remotely Hawaiian.  With the arcade games in the back it was kinda like a poor man's Dave & Buster's-but just the Buster part.  Drinks are not too dive priced-spent my last $16 on a draft and two shots.", "author": "Sam N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-02-22", "description": "This is on the top 10 for 2 reasons...1)they serve car bombs 2) they have a foosball table!", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-27", "description": "Star ding for being full of 23 year old bubbleheads, but I am a sucker for foosball and pop-a-shot!", "author": "Max C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-12", "description": "Yeah this bar smells bad, doesn't accept plastic, is filthy  - but there is Hot Shots in the back.  Everything else is forgiven and forgotten.\n\nDoes anyone else find it amusing that Mauna Loa calls itself a club?", "author": "AngelaS F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-07", "description": "i'm totally with blake on this one:  this bar makes me want to carve my eyes out with a spoon.  i have friends who loooooove it and i can't for the life of me figure out why.  \n\ndrinks?  notsomuch. \n\ncrowd?  notsomuch.  \n\nambiance?  notsomuch.  \n\nbest part of the night?  going somewhere else.", "author": "nic f."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-03", "description": "Pretty good space. Really cramped getting in the door past the bar. Back is usually less crowded and it's fun when there's live music. Big singles beat, some seating at bar and back. I seem to end up here when I'm in the Marina dancing :)", "author": "Mel H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-06-09", "description": "If my best friend's wife didn't bartend there, I would honestly never set foot in this joint again. I hate to sound like a typical Marina-basher, but jeez - you really feel like you're on another planet in this place. It's quite an incredible petri dish of whiteness in there, folks. That being said, if you do happen to hang out here, go directly to the back bar and say hiya to Karen - she's the bomb, yo. :)", "author": "Justin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-23", "description": "I like to come here as soon as I get tired of the people at the Matrix.  Good jukebox, well mixed drinks, variety of beers and moderate prices.  Wish it wasn't a cash only bar though.", "author": "Medwin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-30", "description": "Second only to \"Asqew,\" (see previous Yelp Review) \"Mauna Loa\" is the most difficult word to spell.\n\nI used to come to Mauna Loa a lot, right after graduating from Bar None.  But now that I'm somewhat older and a whole lot wiser--and refuse to wait in bar lines--I give it wide clearance.  \n\nIf I were to be younger, and more naive, and maybe blonder, and definitely more patient, I might go to Mauna Loa.  I've found that it's especially good for when you are planning to \"accidentally\" run in to someone from your recent past, and for when you're looking for a plethora of bar games such as Pop-a-Shot, Golden Tee, and Liar's Dice.\n\nI also get the feeling that the staff are pretty darn nice to and tolerant of the crowd, so cheers to them.", "author": "Hannah J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-19", "description": "I was pleasantly surprised by this place.  A good selection of micro-brew beers on tap, not overwhelmingly yuppie (at least on a Tuesday night), and having pool, foosball and a basketball shooting game is a definite plus.", "author": "Karla R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-22", "description": "Will never know what made us decide to check out the Marina after the Mission... can only guess it was the influence of my bud's fancy jacket and shirt trying to look dapper and slick... but for whatever reason, after checking out Matrix for laughs and leaving with a much more needed level of raunchy down and out fun, we were luckily corralled here by some cute suburban kiddies with crazy ski-bum-trashy pals celebrating one of their birthdays, too.  Well.... it was fun... pool table (yipee) and basketball games, juke box and just a fun dive.  So... don't plan on being back in the neighborhood for a night out... but great for a little almost-raunchy (ala marina style) silly fun.", "author": "Today Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-18", "description": "All praise to its name...I've been going to the Loa for almost 6 years and I still love it. Pop a Shot in the back, Wayne at the front door, solid bartenders who aren't afraid to throw a few back with you and a crowd that  is good looking and likes to party...nothing but good times, even when it's crowded to hell.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-20", "description": "A nice cahnge of pace, if you are looking for an atmostphere that is not duplicated anywhere else in the Marina. The cash only aspect is a bit tedious, but they have some pretty attractive drink specials and they have Journey on the Juke box. That alone will get this Marina establishment and above average rating.", "author": "Tabor, S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-20", "description": "Oh, Mauna Loa.........the last time I was there I kicked some douchebag's ass at Big Buck Hunter.  Chicks rule.", "author": "Shauna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-26", "description": "This is my absolute favorite weeknight Marina hangout.  Drink specials abound, I heart internet jukeboxes, the bartenders are friendly, they have Big Buck Hunter, and there's never a problem getting up a game of pool.  It's not pretentious, and they have free, all-you-can-eat hotdogs on Monday nights (not that I eat them but it still cracks me up).  I love dive bars and I love this place.", "author": "Dale M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-15", "description": "This place is a great time.  Usually attracts a mellow--wanting to party kind of crowd.  I always have fun there....even though its in the marina", "author": "Laura J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-05", "description": "It can get a little too crowded but I always have fun at this bar.  Plus they have pop a shot.", "author": "b s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-06", "description": "As a former Cal student I almost always run into alumni at this place.  I love the Fat Tire specials during the week, the games in the back and the overall vibe. Its dark and cozy and there is neat stuff all over the walls. The vibe is so mellow and its a refreshing change from the crowds further down the street.  Make sure you have enough cash since they dont take cards.", "author": "Cassandra E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-14", "description": "I've always loved this place for being the low-key alternative to the rest of the bar offerings on Fillmore.  It used to be primarily a neighborhood hangout, but it seems as though word has spread and the crowd seems to turning into more singles-on-the-prowl than it used to be.  It's still the most relaxed venue in the area, though, especially mid-week.", "author": "Zach L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-01", "description": "Hasn't changed at all in at least the fourteen years that I've lived here and in this case that's a good thing. The staff is always friendly and you won't sit around with an empty glass in front of you for long.", "author": "Dan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-10", "description": "Jill and Jen are the best 2-woman bartending crew in the city.  Lately this place has been filled with too many striped shirts, but is always a good time.  Not really a dive anymore, but still a bar that is less marina than everywhere else in the neighborhood.  Grab a glass of goldfish and get ready to get hammered.", "author": "Jay T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-04", "description": "fun little dive bar, i always seem to have a good time here (from what I remember haha).", "author": "Chrissy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-04-21", "description": "how could you not love this place? i love the 'Loa! its small, laid back, sometimes loud and always fun. you just want to sit here all night drink with your friends and maybe catch a game on the TV. its not fancy, just a simple place for drinks. good location too.", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-05-09", "description": "for the new year's resolution, i was determined to explore the districts of SF that i havent really visited too much. so, despite all my reservations about it, we decided to try out a bar in the marina. i've always avoided this neighborhood like the plague because the bars there attract the worst people ever. well, within seconds of walking into the Mauna Loa, i could see why i've been avoiding this area. i felt like i walked into a frat party from hell. everyone there was super cheezy. the kind of people who used to be a fratboy/jock/cheerleader and now have lots of money and like to brag about it to everyone around them. within a few mnutes of being there, a fight almost broke out. of course, in the end there wasn't an actual fight, instead it was just some testosterone fueled bullshit where people can act all badass and then go home later and brag to all of their friends how they almost beat someone up. ugh.\n\nthe thing is, the bar itself here was actually pretty cool. nice bartenders, decent beer selection, foosball table... the place would actually make a decent bar if it wasn't for all the idiots that were there. after one drink, richard refused to go back inside but the rest of us toughed it out and had another drink. then, we got the hell out of there.\n\nalso, i'm still not sure why this place has a hawaiian name seeing as there is nothing else hawaiian about it.\n\n(my resolution this year is to visit 50 new bars in SF.  read about it at: http://fiftybars.thisisvlad.com )", "author": "vlad k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-06-03", "description": "Although I know people who enjoy this place, I have a hard time finding any redeeming qualities about the bar or its patrons at large. It strikes me as the epitome of all that is irritating about the Marina. When I walk in here late on a Saturday night, I immediately have to ask myself, \"Am I a chump or a clown?\" Because those are the only two options, man.", "author": "Eugene P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-07", "description": "Okay, the marina is like a huge frat party.  one of those themed frat parties you pay $10 for and are transported on a bus to some huge field with jungle juice and shit.  The theme of this party is \"businessmen gone wild\".  at one point, we saw a drunk girl screaming at her boy friend, who had obviously drunkenly cheated at her... she pushed him into a chain link fence.  Her friends were laughing and talking about pizza orgasmica.  it was awesome... that's where my night in the marina turned around.  after that, a friend of mine got a bucket of water dumped on her head out of a second story window.  she took a picture of their address and will notifying the authorities.  And then, we found the Mauna Loa.  What a fun place!  Am I in the Marina, or did i just step off my private jet for a relaxing vacation in hawaii?  I tell you, I'm not sure.  all I know is that it wasn't overcrowded, and we could hear each other talk.  It was nice.", "author": "Caleb D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-07", "description": "3 words.  pop a shot.  it's one of the best bar games around, and there aren't many places that offer it in the city.  this bar is a nice pick for a casual night out with friends - good location, nice bartenders, bar games galore (did i mention pop-a-shot?), and a great jukebox.", "author": "Jan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-25", "description": "The drinks are pretty stiff here, and there are a number of games (Golden Tee, Pool, Foosball, basket-toss, etc) to play, but when the space gets crowded (as it does on Friday/Saturday nights) using them quickly becomes impossible. The crowd is usually attractive mid-late 20-somethings to 30's, plenty of outgiong and interesting folks all around. Of course, it's not the Matrix Fillmore, so the level of pretention is a bit lower, which is rare in this part of the city.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-13", "description": "If you are looking for another place you would call fraternity central, this is a good destination.  However, I would not put it in the same level as Bar None.  The people are a bit more respectable and during off hours, I have actually enjoyed the clientele.", "author": "Matt J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-26", "description": "this place used to be 4 stars.  now, it is overflowing with obnoxious people.  i always seem to see a hen party there when i go.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-22", "description": "the lady bartender always remembers me when i come in, and that's like never, and she never charges me.  bartender courtesy, thx!", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-22", "description": "Best dive bar in the area. Staff is cool...they treat regulars well. Always sports on the plasma and good music. Go Monday-Thurs to avoid the B&T crowd.", "author": "Dirk S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-10", "description": "The women bar tenders there are disgusting pigs.", "author": "Dan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-21", "description": "booze is booze, however this bar has not only pool table, big buck hunter, but pop shot basketball game! yes please!!", "author": "Jess L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-02", "description": "The female bartenders are adorable and totally fun. I have to say though.. the clientel on a thurs-sun are totally yuppies, and I know it's the Marina, but seriously, get over yourself and have a good time. The men will hit on you wether you in a turttle neck or a Jlo dress. The pool table is free. The juke box has an amazing selection. The drinks are reasonably priced, and they have a fun basketball game in the back. Restrooms are clean. Tuesday has free chili dogs. I say check it out, you may find what your looking for. If you a female your in luck, you won't go home alone, or wake up with \"what the fuck was I thinking\" there are a plethora of gorgeous young men. If your a guy, your in luck, plenty of self concious women who want to suck dick are present, get yourself ready for a good time. GLBT.. ehh not so much. I've met a few hot lezzy's there, and a few gay cutie boys, but it's very midwest in a way. But honestly it's so marina dive bar that it's perfect. The unfortunate part is that the waitresses are so cute and kind, yet they have to deal with BS. Fun for out of towners, and youngin's", "author": "Katie M."}
