{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "Owner is great super sweet. Great customer service definitely try it. But don't Postmates! \n\n\n\n\nC- pizza. Expectations were super high. The pictures made it look like some classic style New York pizza. I ordered an XL pepperoni via Postmates and this had nothing to do with lack of freshness from the trip pizza was Costco mozzarella with scarce baby pepperonis throughout. I know I should probably make better choices for pizza at 3am but also would like to warn future me's from spending 40$ on a pizza that was more a 10$ taste. THERE WAS NO SAUCE AT ALL ON IT", "author": "Valerie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-04", "description": "Not a very good slice of pizza for almost $5.00 damn I hope I don't get sick. Cold and old.", "author": "Adam H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "These guys are the best! We had a very late night order for a large group a few nights ago and after explaining our predicament the owner was able to get us a great price on some great (and very appreciated) pizza! I think the owner delivered the pizza himself after hours - was so grateful and pleased with their outstanding customer service! Super recommend.", "author": "Emily M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "I did not go to the tenderloin to get this pie, I had it delivered at a stupid ungodly hour, because I was working nights.  So, I have no idea what the store looks like, but I have to say, I really enjoyed the Pizza.  I got an all meat one, for my whole crew, and it was really good.  I say give them a shot, so far I am a fan of the food....", "author": "Paul G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "Great guys. Great tasting pizza. In my top 3 favorite pizza spots hands down. I deliver for them with postmates and my orders are always ready. Will always keep coming here as long as they are around.", "author": "Jake T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-19", "description": "Not really impressed - the pizza was fine, but nothing to write home about. Had multiple different slides, so is not based on any individual slice. Eat here, sure. Come again, nah, will try a different shop.", "author": "Mikkel If H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "So thankful for Maysoons Pizza & the awesome delivery guy! I was traveling for work, staying in a nearby hotel. After working late, was so glad to find Maysoons Pizza delivered. I ordered the Green Pizza with pesto & artichokes but asked for no broccoli & instead tomatoes. Added some marinara on the side & ranch too. Wow! The garlic is so savory & fresh! I'm a tad obsessed with pesto & this is good pesto! The delivery guy was so nice too. He even was willing to text me my receipt when I forgot to get it (because I was so hungry I wasn't thinking & I have to have my receipts when traveling for work). Very cool!! Pizza is delicious. Service was quick & staff was outstanding! Thanks Maysoons! Nom nom nom", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-31", "description": "Solid for late night delivery! We ordered their Maysoons special pizza and it was good. Nothing too special, just regular takeout pizza. Delivery was on time too. No complains.", "author": "Ashad J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-08", "description": "Called for delivery of three large cheese pizzas. Took TWO hours for the pizzas to arrive. That is not an exaggeration. Of course everything was cold by then. This place seems a little behind the times.", "author": "Martha P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-17", "description": "don't, stop, MAYSOONS\ndon't, stop may\nbc i'm havin a pizza! havin a pizza!\n\nlike a bbq saucing thru the pie like a chicken\ndefying the laws of extra meats\nadd broccoli mushroom by like spinachy pizza\ngonna order order order mozzarella cheese\n\ndeliver thru late night yeah!\n200 teeth that's why they call me mr appetite\ni'm dining at the speed of light\ni wanna date a superpizza woman or 2 ;)\n\ndon't stop maysoons\ni'm havin such a pizza i'm eatin it all\ndon't stop maysoons\ni wanna have a pizza just give em a call", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Best pizza in the neighborhood -- and open until about 5am.. \nthe garlic bread gets made fresh every time, so it's always freshass ingredients. I should know, I work at the rum bar next door.\nMaysoon's. Srsly. 5 stars", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-21", "description": "Late night dinner for me was a slice of vegetarian pizza with the sesame crust. $4 per slice, which was just perfect for me to enjoy all the goodness without worrying about overeating on the whole pie. \n\nI enjoyed the flavours a lot. When I am back I will make sure to eat here again.", "author": "Anelya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "Tiny place with Great midnight pizza!\nRecommend the Everything Slice they use All Beef Pepperoni which is big deal for me since I don't eat pork products.", "author": "Sammy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "They delivered to my hotel room, that, in itself, was awesome... I didn't check the time, but it felt like it took little time to arrive... the pizza was alright... the only thing I want to complain about, is that I did order a 7UP not a Sprite & they gave me a Sprite.", "author": "S F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "Great combination slice. Nice fellows work there. There was a combo slice or two along with some Hawaiian & another on a separate tray however he gave me what I pointed to, a slice from what appeared to be a fresh pie. Didn't need warming.  I like their crispy thin crust, not burnt but black on the bottom & a bit crispy. Not the white doughy crust I don't like. Good cheese. Cool single slice thin triangular box. Way to go & only $5.00!", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-12", "description": "ETA of 45-55 minutes when ordered, ended up taking 80 and the pizza was cold. Besides the delivery experience, the quality of the food was not the best either. Most likely will not order again.", "author": "Joey V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Nice and good halal items at Maysoons pizzza now , like the baked Kafka in the oven with tahini sauce , and fresh bread", "author": "Issa A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-17", "description": "Well, it was my first time using the delivery app. I placed the order 3 times accidentally. Two using my card and then one with cash. I've been charged on my card and they told me to pay cash!  They told me they would refund me but they have not.", "author": "Austin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "My work ordered us food from this restaurant.\nWe had different kinds of pizza they were all extremely delicious.\nFood was properly cooked specially with all the meats.\nThe buffalo wings and the salad were very good as well.\nWould like to go into the restaurant to try food in house.", "author": "Yvette A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-03", "description": "If you're looking for a quick slice when you're wasted, it's great. I don't suggest ordering delivery. I asked for boneless wings and got bone-in. Pizza was ok, I use to love it but seems as if they changed it.", "author": "Kelcee F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "Pizza craving and want food delivered fast? Order at Maysoons\n\nIt's Sunday evening and I'm looking for food to order home. All the food delivery apps are surging on delivery prices so I wasn't trying to spend essentially 30 dollars per large pizza, so in comes Maysoons to save the day.\n\nWe were all starving since we already decided to order pizza super late, and we still had to wait for the food to deliver. But the pizza delivery arrived 25 minutes early and the squad was so hyped after that. The early delivery and the fact that we were starving made it the best pizza I've had in a long time.\n\nOrdered the supreme, the pesto, and the buffalo wings. Buffalo wings felt more fried than buffalo, but it was still good.\n\nWould order again if I was craving pizza.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Really good place! Pizza is great! Hot sauce is great! Nice staff. Would definitely recommend for a late night snack!", "author": "Wei D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-19", "description": "Average, like warm pizza. I'm convinced the reviews aren't real. Look at how many reviews of people don't have friends or are fresh new accounts. Maybe at 4am it would be worth it but there are better options", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Best pizza in this hood. I'm a pizza snob, that who I am. This is good pizza. Crust - chewy yet crunchy on the outside, cheese - enough without being overwhelming, sauce- just enough not oozy which is gross. I have made pizza spot and I didn't expect it!!! Yay!", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "Loved the pizza.. the pepperoni and Hawaiian were amazing!! ! The owner was so nice and friendly.", "author": "Lauren E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Hello people of San Francisco, do I have the review for you!\n\nMaysoons Pizza is absolutely fantastic! This kind gentleman made us feel welcome immediately! We were consumed by the wonderful smell of the fresh cooked pizza. He made sure to take care of us by providing the freshest slices of pizza available! \nWe couldn't be more happy with a good ole slice of pizza! \nOn top of the fantastic service! The pizza tasted great on top of that! Just fantastic\n10/10 would recommend! Will eat this pizza every day of my life!!!!!", "author": "Katie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "I ordered pizza for delivery through the yelp app at 1:00 am. It took about an hour to get it. Other than that, the pizza itself was great. I just wasn't sure why it took almost an hour to get it when we were staying not too far away and it said that it would be open super late, so it's not like I ordered right when they were about to close shop. Maybe don't order through the app? Try calling instead.", "author": "Linh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Hello guys u have to come to mansions pizza , everything here it's just so tasty .late night pizza sandwiches answer me anything just amazing", "author": "Bilal A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "The pizza here is the best. The way they made it is delicious. It's always still hot when I got the pizza delivery. For some reason, just the cheese pizza itself is already good enough. I also have my co workers to try, they all surprised and loved it. I definitely will recommend this place for my friends.", "author": "Lucie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "Great Pizza. It arrived earlier than expected and was delicious (got the vegetarian pizza with olives,  onion,  tomato and bell pepper). They took care of the notes I requested. Highly recommended", "author": "Haytham M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "Still a great place. Happy I came everytime I do. Raed is my favorite..... Stop on in people.", "author": "Nate W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "This place was so good after a late night at the Edwardian Ball. Crispy crust, delicious sauce, yummy ingredients, and super sweet service. I would go back just for a slice next time in the hood.", "author": "Jyoti A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Qwesome place ,its ben long time not finding pizza with the taste , maysoons pizza hit it ,perfect customer service ,wise price , open late", "author": "Haitham S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "We started the night at emporium bar. Obviously, as the night went by, we wanted some pizza. We stopped at Rusted Mule (poor decision) and then finally decided to end our night at Maysoons. What a lifesaver. It was the night of the atmospheric river. We ran through puddles, jumped over puddles, and got hit by falling puddles. The power was out at Maysoons, but Omar greeted us with delight and warmth and a flashlight. We had no cash, and since the power was out we could not use our credit cards, but Omar came through with some slices anyways. Thanks, Omar. We will never forget your awesome customer service.", "author": "Taylor D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-21", "description": "Ugh ordered pizza from here late night, the pricing on the website and menu is different when you walk in. They need to correct that, it's not right to charge whatever you feel like but we were starving. They didn't even have their prices up there so we didn't know if they were BS'ing or not. Seems like they are always changing their prices to whatever they feel like.\n\nI love pizza, and this was probably the worst I've tasted, even with sauce it was dry. The margherita side was a little better but the cheese they use is horrible, sauce is tasteless and dough is just sad. Do yourself a favor and just get a 7/11 pizza for $5. We did that the next day and it was much better than this cardboard.", "author": "Sarina V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "If you read this , please , order pizza from here and continue to read . Probably the best pizza ever in this area , while you do another bite of slice I  just want to tell that this place also have an awesome burgers , ask this handsome guys to add some mushrooms to that cheeseburger and you gonna love that !", "author": "Sean C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-05", "description": "Pizza was good, I liked the crust. Delivery was super fast, which I really appreciated. I ordered through Door Dash and decided to try a new place. My only complaint was the plastic bag with two paper plates and napkins that accompanied the order. Please think of the environment and save the plastic - most people who order a single pizza at home don't need paper plates or napkins.", "author": "Eve F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-14", "description": "Dirty \"restaurant\" that smells like burned cheese.  I saw a cockroach the size of a small mouse scamper by.  No thanks!  Health Department inspection score of 71 -- can't believe they haven't been shut down yet.", "author": "Kathleen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "Hey Yelp,\n\nUnless you'd like to make my account \"Elite,\" please stop asking me to leave reviews.\n\nThank you,\n\nTyler G.", "author": "Tyler G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-17", "description": "Do yourself a favor and save your money for a frozen pizza of something else, this place is terrible. Late delivery, soggy disgusting pizza. Ordered bacon, chicken, w/ranch sauce which is my favorite pizza. Very little toppings.  Overall undercooked (raw slices of bacon cut into oddly rengular thin strips), meat of poor quality (chicken was fatty, pretty sure the bacon was fake), cheese (too much) was gross, sauce also was gross (seemed like some kind of garlic butter vs ranch). Cheese slid right off to reveal a layer of bread/crust underneath about as thin as 2-3 pieces of printer paper. That would be fine if I were ordering a thin crust pizza and it was cooked properly... but no it was undercooked and soggy/floppy. The crust was the only edible part of this pizza which seemed to be average at best. Seriously gas station pizza, little caesars, bagel bites... anything else but this pizza", "author": "K W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-29", "description": "These guys are completely dishonest. They give you one price on the menu, but back up the price once you order. They claim it's an \"old\" menu. \"New menu comes tomorrow.\" Then why had this happened before.", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "Visited after the WARRIORS won the FINALS in Game 5. This Place looks like it's nothing special, however after I had a single slice I had to get another. My cousin who lives in the city kept telling me about this place and to my surprise it lived up to his hype. \n\nTo top it off the Staff was SOLID. The name I recall is RAED(sorry if I misspelled that). Not that they have to provide too much as its a quick pizza stop, but you can tell they actually care about the customers and what they are doing.", "author": "D P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "I just had 4 pizzas in a role and this place have the best pizzas ever so glad I found this place people are so friendly too amazing place", "author": "A S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "This place has come a long way, ever since new ownership took over they have worked on the place and cleaned up really good, the customer service is outstanding they really care for their customers, they have also added new eats on the menus like the halal chicken shawarma plate just something to die for, they also have non oil fryer that fries everything w/out oil very healthy food this will be my go to place for pizza/mediterranean :)", "author": "Mohammed A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "I was slightly drunk, so this review is based on my gf telling me how much I wouldn't shut up talking about that crunchy chewy crust, the perfectly seasoned sauce with crisp pepperoni on top. \n\nI told her how I wanted to buy her a slice, so I did, but I ate it omw back to the apartment. \"Sorry babe\"! \n\nAnyways, I'll up date this when I was another slice or two sober. Or sober-er. Yea. Sober-er.", "author": "Roman V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "There are many pizza spots in San Francisco, majority of them are decent but this is my go to spot for delicious pizza. Prices are reasonable, staff are very friendly. Late hours are a major plus for weekend after a long night out with friends! \n\nCombination with sesame crust is my absolute favorite.", "author": "Naheed S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "Great customer service from everyone, they really care about the customers. \n\nThe hawaiian pizza was perfect, very generous amount of great quality toppings and they also added more cheese on top! The crust was crispy outside with a soft center making it very addictive to munch on. \n\nMaysoons is now my regular pizza spot!", "author": "Dav K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-26", "description": "Acceptable pizza! Good prices. I got a custom pizza with pepperoni, mushrooms, and garlic. Couldn't taste the garlic, but that's why they invented garlic powder, so whatever.", "author": "Gina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-28", "description": "Food was okay, but the actual store is very very dirty. They have one table that has food rubbed on it, the coffee machine has food stuck on it, and floors are dirty. The paper and cheese bottles are also dirty. When you go to eat somewhere, you expect it to be clean. They also burned something while we were there. It was so smokey in there we had to leave. I recommend that they paint and clean up a bit.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "Combination pizza is undesirable , \nGreat service Margarita pizza with fresh mozzarella cheese and alot of fresh basil smells amazing", "author": "Mohamed Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "The late night cravings for that solid meal is complete with a pizza pie from maysoons! The pizza texture and flavor were fulfilling and when there's silence in the room you know that everyone is enjoying every bite of that slice..The gentleman who greeted me and my friends was very friendly and surely understand the science of making a good pizza! Surely worth a try !", "author": "Garen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-14", "description": "The pizza was late, cold, and not very good. The crust is thin, flavorless, and lacks a nice texture or crispyness. The cheese also lacked flavor, but overall the toppings were too salty. Kinda gross pizza actually.", "author": "Stacy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-19", "description": "Reasonably priced food and perfect for a late night. The chicken wings were fresh and tasty.", "author": "Enrique A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Best pizza!!! Ray is the best ever!!! Ray makes the best pizza! A true neighborhood gem!!!", "author": "Jay P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-27", "description": "App still said open and sign in window still said open. But the bloke working was a little over eager to close and started his clean up to early. Since I left the comfort of the Kabuki hotel room for this I am pretty disappointed.", "author": "Peter T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Fast service even when they drove across town. My kids loved the pizza. 5 stars for sure.", "author": "Ronald C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-17", "description": "Deliver was late\nSandwich was cold and not great. Pesto chicken sandwich felt like Costco pesto and Costco chicken strips over cold roll", "author": "Coco S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-01", "description": "I ordered a pizza at 12am and never received my pizza. I called 11-15 times until they finally picked up at 3am. All they did was apologize for no t delivering the pizza. Terrible service! I will never order pizza from here.", "author": "April M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-13", "description": "Ordered pizza delivery from here and was astonished to open the box and see a pizza with sparse toppings, all concentrated in the center of the pizza, and worst of all pretty much NO sauce.  There was so little sauce we actually had to heat up some pasta sauce to dip our pizza in.  Crust was awesome, I will say.  Too bad, they get the hard part right and bumble the easy part.", "author": "Tyson C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "This this pizza place have amazing pizza  . Ilike a the combination between the East and the West Italian Greek Middle East recipe you never got tired from eating that pizza everyday your . \nlet you know guys", "author": "Saber A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-03", "description": "The first time I ordered a medium pizza and chicken wings, it was great! Unfortunately my second order was not so great. The pizza was overcooked with black crust, but the temperature was lukewarm. I also ordered the appetizer combo which also came in the same condition. I was hoping this pizzeria would be our local go to, but I guess I'll keep looking.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Mansions pizza is the place you want to spoil ur self , the guys they r so friendly they make what ever u wish , it looks just pizza , but when u get inside it just everything , I explained about my chicken wrap I used to eat back home , they made it for me , even more tasty , the owner liked it and he will put it on the menus , I want to give them 5 stars for food and everything els , ad we r as drivers working late night , it just the right spot", "author": "Hadi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Best pizza I ever had. Nicest people working there. Service is great.\nI enjoy the late night pizza after a few drinks down the street \nFood is properly wormed up and custom slices are made to order \nI recommend this place for sure.", "author": "Quan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Few drinks at bar ..best pizza on Geary ..staff is friendly and the manager Ray is very humble and kind ..halal pepperoni", "author": "Linda X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-26", "description": "I think the only place on Earth where u can get chopped up hot dogs on your pizza! Sounds yummy? If it does, u from another planet! \nThe crust was doughy with no crunch and this was the freshest pizza out the oven?!?! Sad... The place was filthy and we had to wipe up our own table! And damn was that table gross!!! C'mon y'all... clean up, take pride in pizza and take better care of the people!", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-08", "description": "Pizza was fresh, hot and tasty. The owner delivered it and was a very nice guy, said if we enjoy it please review. I love the hustle, owner out delivering his own pies. Give them a shot, you won't regret it.", "author": "Marky M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-26", "description": "I'll give it one for the manager that compensated me. Should known better than to order cheeseburger and French fries at a pizza place. Waited 15 min while pizza came out for my friends. Could have told my burger was going to come out hella min later. When I complained worker called his manager who refunded me. So I'll give it that but clerk kept saying \"just this one time\" when I'm yelping \"last time.\" Customer service means everything", "author": "KB B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-29", "description": "I'm gonna be honest, I've only ever been here drunk. It's great drunk pizza! Large slices, totally filling, everything you want after a night out. The place is really tiny though and there's not much else to it other than ordering your slice and them handing it to you. Not sure if I'd ever order a whole pie, but if you need a slice, it'll get the job done.", "author": "Kristen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-05", "description": "I stoped by mysoons pizza , tried there sesame crust viggeterisn pizza , I saw many reviews on yelp as I love seasame on bread , I got couple slices it's really yeasty , the owner is very nice person , price is wise open late I will come again , thank you maysoons pizza", "author": "Mohannad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "Awesome service delicious pizza I got a chance to meet the owner and hes such a nice and kind young gentlemen who puts his effort in giving delicious pizza and a quality service to the community of San Fransisco down town,hands down this is one of the best place I get my moneys worth .", "author": "Ibrahim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Maysoons Pizza is probably one of the better spots in the city and I think that the pizza is pretty good the workers are nice and especially the owner of the establishment is tops I would recommend this spot", "author": "Chris K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-18", "description": "I tried a Margherita pizza from this place and it was horrible..  it had way too much cheese and garlic on it. I had to remove chunks of garlic with a spoon and  it didn't have basil at all! And even if they had added the basil, the garlic was the only flavor you could feel anyway. \n\nA good classic Margherita only has fresh mozarella, pomodoro,  fresh whole basil leaves and some olive oil on top.. thats it!. I can't believe how many pizza places in SF fail to make the most simple of all Pizzas! that happens to be my favorite.", "author": "Rodrigo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-12", "description": "Stopped in here at 2:00 A.M. After a Giants game that ran late because it was near the hotel and it definitely got the job done for a late night snack. There are only a handful of options for the pizza, but we ordered a slice of pepperoni, a slice of cheese, and a slice of combination and both my husband and I liked them all. So glad we found a place like this that's open until 4:00 A.M. We would definitely go back", "author": "Lexi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "Love this pizza place!  The owner and staff are super friendly and the pizza is the bomb.  Late night slice or whole pie, you gotta check it out.", "author": "Tiffany A. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "Maysoons Pizza is the friendliest. I had such a great experience here. It was very late and I needed pizza for my workers... Maysoons was quick and efficient. Luckily I got to have a slice as well, and the pizza hit the spot for sure. Soft amazing crust, and extra large slices.", "author": "Callie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "There aren't many great pizza places in San Francisco -- let alone great pizza places open late at night -- but Maysoons Pizza happens to be both! The ingredients they use, like the mozzarella, are incredibly fresh. \n\nFrom now on, Maysoons is the only pizza I'm ordering at night!! :)", "author": "JP M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Maysoons Pizza is my new favorite pizza in the city. Started working near by and can't stay away from their Kafta Pizza. It's super flavorful and has a crispy crust. The owner Ray is the most respectful business owner ever. Always welcoming and thanks me for coming it all the time.", "author": "Mohsen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "Best pizza in the world i enjoy the service and the quality of the food.tasty pizza good team ,if u r in san francisco just visit maysoons pizza", "author": "Steve F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "Awesome late night pizza spot!! Always open and always have delicious slices. The chicken strips are also amazing. The prices are great and the service is always quick and they are super nice.", "author": "Alexander A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "We had a couple pizzas and the wings and it was great! Great experience with carry out too. I would highly recommend if you are in the area.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-24", "description": "So I ordered online through Yelp Eat 24, 1 med pepperoni pizza and wings.. Estimated delivery time, 30-45 minutes.  \n\n1hr 45 minutes later my cold pizza and cold wings showed up.\n\nWon't be doing that again...", "author": "Paul F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "This has gotta be my favorite place for pizza hands down. I recommend Maysoons to everybody. Every . The best pizza in the city", "author": "Alex E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-02", "description": "6 day old pizza. Seriously. \n\nI got two slices-one cheese, one veggie. The first problem, is that they didn't even heat the slices up properly. They threw them in the oven for less than 10 secs before popping them in the to go box and handing them over. \n\nWhen I got home and bite into the first slice, it was cold. I literally live a block away, it should still be hot! The crust was hard as a rock and the cheese was clumpy and stale. \n\nDon't go here and waste $4 on a slice of pizza. It's not worth even that", "author": "Seumanu D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-11", "description": "Literally the worst experience I've ever had with both Eat 24 and Maysoons. The estimated delivery time was 45 minutes to an hour. After an hour and a half I decided to call the restaurant just to check on my order. The phone just kept ringing and ringing. I googled the restaurant and the number that is listed was wrong. I ended up calling Eat24 to see what to do and spent 30 minutes on the phone with them only to tell me THEY COULDN'T FIND MY ORDER! Not only did they say they couldn't help me, but offered no advise on what to do. Mind you, it's been over 2 hours since I placed the order at this point. I'm ravenous at this point and have to find another place to order from. After ordering from another restaurant, I get a call from the delivery driver saying he's outside. No apologies or anything. Just, \"here's your pizza, sign here.\" Got the pizza and chicken inside and everything was cold. Literally the worst delivery experience I've ever had.", "author": "Nick P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "I love you guy O mi h thanks for coming Rhonda in a clutch the chicken was so good. Pizza was not best nor upiew from San fenaxisxo so I forgive you.\n\nCuisine. Is amazing", "author": "Mia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "The food was great. Missed the delivery guys phone call and they made the extra effort to return and deliver it again! What great service!! Will def order again. Wings were tasty and big.", "author": "Taylor M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Great service all around, no matter what time of night. Pizza for the people. They make the block better", "author": "Mike K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "Hey ppl this place is wow  we came from alameda to San francisco stopped by maysoons pizza had some Spicy pizza was great ,they have halal meat also ,just wow", "author": "Junead A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "This is the best pizza in our neighborhood and I works next door, so I eat it all the time. Fresh and prepared with love.", "author": "Olga Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-20", "description": "Tomato basil was on point! Owner was generous and made us feel at home. If you are out having drinks in the area I would recommend a pit stop here.", "author": "Dan H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-03", "description": "The pizza was \"whatever\". We ordered food at 11p they said 50mins. I called 2x to see where the order was. They are literally .4 miles from our hotel and they came at 1230a with cold pizza.\n\nSo upsetting since the reviews have been good.\n\nWe ordered two topping pizza and chicken stripes.", "author": "Melly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "This is hands down my favorite spot to grab a quick bite after a drink. The pizza is unbelievable and always hot and fresh. You can tell they use the best ingredients. Great for delivery as well. Always a great customer service after a fun night in the city.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-28", "description": "Delivery pizza order was incorrect.\nNot NY style.\nNot real bacon (turkey bacon maybe?). \nOK garlic bread.", "author": "Michail Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-26", "description": "I work next door I always come here to eat many deferent things the pizza is so tasty I visited tonight and ordered lamb beef shawarma it was very good I recommend them to use pita bread little slow but it's tasty keep it up mahsoons pizza", "author": "Alex H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-13", "description": "The food was good however the man that delivered to our hotel was a sarcastic jerk. We waited way over the estimated time then used parking as an excuse when he could have simply parked in front of the hotel and put his flashers on like\nAnyone else. late... rude.. but the food was ok", "author": "Tammy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "Great late night spot in the tenderloin. The staff is always super friendly and the pizza is great! Love this neighborhood spot.", "author": "Alice N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Ray is a boss, folks. We got the wrong topping, Ray hooked up both pizzas! Great pizza- even greater customer service. Highly recommended. Thanks guys. \n\nJim_James", "author": "Jim J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-19", "description": "Ok pizza it's cool that they stay open late if your hella hungry for some food my pizza was steal and old but I was drunk so fuc* it", "author": "Nick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "Solid NY style pizza. I had the veggie which was made with a pesto sauce. Would've preferred tomato but still was satisfying. Crust was a very nice consistency as well. Would come back again for a bite when I'm in the area.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "Nice place, tasty pizza , good team , try the vegetarian with sesame crust it's amazing , price perfect owner said he won't to raze the price", "author": "Adam A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-11", "description": "I know we ordered late after Guns and Roses concert 12:03 am they said 45min to an hour food got there at 2 am on the eat24. Know they use outside service to deliver food still a reflection of them.\nThe food a bacon burger was terrible, cheese cake was frozen almost solid , and chicken strips ok and French fries that where not cooked but maybe 1/2 way.\nI wish could give a better review but I use these reviews to pick my restaurant a lot and it's only fair to the rest of us to know.\nPossibly the others who gave the place better reviews did not order so late or very early in this case but maybe the should not be open at that time if that's the quality of there food", "author": "James K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "I simply LOVE this place. I live right in that area so I have virtually a bazillion options for pizza, but I choose to walk the extra block to make it to Maysoons. Employees are very friendly and the slices are huge, cheesy, and the crust is so thick!! 5/5", "author": "Abe B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "This place is awesome. Such friendly staff and delicious pizza. I highly recommend this pizza. They also serve hot sandwiches and burgers that are pretty good. The best part is that they are open late night.", "author": "Princess Jasmine J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "So good ! Great pizza ! Great garlic bread, very nice delivery guy ! At 3 am I didn't expect something this good !", "author": "F G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "Best pizza this side of town !! Always amazing love these guys. Proper crust none of that bisquik bs proper non frozen cheese and toppings.", "author": "Bob L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "Maysoons has the best pizza slices this side of the tl. There chicken strips are one bad motha sut yo mouth, with a sweet sweet side of those golden crispy fries. Also if you got those late night drunchies there always open late, it is the spot to be. So your doin something wrong if you have not gotten your ass down to maysoons yet. So don't forget to bring your loose date for a late night bite before that even later night bite.", "author": "Adam D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "Delicious pizza--right amount and texture of crust. Flavorful--the sesame crust seasoning is awesome!\n\nWe had a bit of a mixup and received the wrong pizza. They fixed it and brought the new one, letting us keep both. Nice service. \n\nRecommended!", "author": "Justin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "The best pizza ever.\n\nThis is my only pizza place , you cant go wrong with this place... \n\n Mark is the man there ..", "author": "Angel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "Maysoon's Pizza is the BEST! They catered one of our corporate events and they were phenomenal. Delivery was on time, food was delicious and customer service was A++. I would definitely use them again for future events!", "author": "Edgar M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-26", "description": "No tomato sauce in a chicken parm sandwich (only cheese, mayo, and chicken ), tomato sauce in a philly cheese steak (),  and the \"buffalo chicken wings\" are just chicken skin covered chicken wings fried with no seasoning (). I give it two stars because it's late and we were hungry, but never again.", "author": "Natalia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "By far the best pizza in town! Came across this place by chance and was amazed how delicious it was. The boss is very charming and kind, I can not express how amazing this place is. Would definitely recommend and come back! See you there!", "author": "Jess L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Arrived in town from Houston Texas, and had an awful meal in Chinatown.   Laid down for a short nap, but when I awoke it was late.  Didn't know the area, so decided to do a search online.  Searched 'pizza' in zip code and found this one.  Was super excited to find out that they delivered, so placed an order:  it was 10:00pm on a Monday night.  The pizza arrived by 10:30, and it smelled delicious!  The delivery guy was thoughtful enough to bring plates, which I thought was a super nice touch.  Loved the pizza so much, we ordered again two days later.", "author": "Sabrina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "I lived in nyc for 4 years so my bar for pizza is higj. Mahmoods is dope! Delicious pizza. Affordable. And the man was super attentive and helpful - let me pay for one price with card and bent over backwards to help me find parmasean. But really the pizza is what counts. I had a veggie slice because even thou I love meat in general I prefer veggie pizza.... weird I know right. But anyway his pizza is delish. Go here. Great when drunk", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "Maysoons is the best! I live a block away and come here all the time. The staff is so friendly and the food is amazing. Highly recommend.", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "This place for pizza so so good and perfect surface and faster and easier and the pizza so delicious thank you so much appreciate for service", "author": "Abdul Wahahb R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Went here late at night...it took a while but everything we got was fresh. The pizza was amazing very flavorful and thick. My gf had chicken tenders and fries which she loved. The gentleman that helped me was very nice and friendly.", "author": "Fabi V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "Excellent home style tasting pizza with a large variety of food! Super friendly staff who welcome everyone with a warm middle eastern embrace! Definitely recommend anyone looking for a quick snack to check out this little spot, you will not be disappointed!", "author": "Vladimir K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Maysoons Pizza is the place that I most of the time I would like to go for my Pizza. Friendly guy and costumers service..I had an event and needed a large order of food and Maysoons Pizza was the the restaurant that accommodated my event need for the event.  There were fast in getting the food on time. This place of business is open late which makes it very convenient to get when other businesses are closed. I would recommend this restaurant to friends because they treat their customers really good.", "author": "Nada A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-10", "description": "No. This pizza was crap. I have no idea how people gave this anything more than a star. Save your time and your money.", "author": "Tommy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "This pizza was an amazing surprise! I was treated with amazing service and the food was incredible. Do NOT skip the seeded crust, it's heaven and like nothing else you'll find. Just stop by and get good pizza", "author": "Mira M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "The issues we had were resolved quickly and professionally. Originally the delivery was sent to the wrong address, and after calling the store and speaking with the owner, we received a fresh pizza within a very short amount of time. We are new to the neighborhood and wanted to find the best pizza around. This is for sure the best pizza we've had in SF! Highly recommendable ! Thank you!", "author": "Kerry G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "Good pizza. Right price, right crunch and the dough is just the right amount of sweet", "author": "Nick O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "These guys are great! I get off work late and they're one of the only late night Pizza places that sells hot, fresh, tasty Pizza!!!!! The Pizza is great, the location is awesome and the people who work and own the place are friendly, welcoming  and make bomb ass pizza. The best late night pizza spot in the city; period.  (seriously)", "author": "Dave M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "Incredible experience.  It all started with a few yes's at the bar.  Cut to- feeling utterly helpless in my hotel room in a foreign city at 2AM on a foggy sunday evening.  Scrolling through yelp, to my most pleasant surprise this gem of a pizza factory appeared oh so brightly.  Really satisfied with the simplicity of the ordering system through yelp, as the convenience made my night even better (disclaimer: didn't know that was possible).  After some heavy contemplation I decided on my 4 delicious toppings and pressed send.  The food arrived in a jif and it could not have been delivered by anyone friendlier.  Didn't catch his name unfortunately and i totally spaced that i didnt have any cash so i couldnt tip him :(.  But anyways i highly recommend these guys for any of your pizza desperation moments.  Also, the garlic bread wAs deelish.  Thanks!", "author": "Tombo C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "5 stars for delivering good, fresh pizza, ON-TIME at 1am Tuesday night. Delivery guy was friendly. The anchovies were awesome. Thank you.", "author": "Johnny N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "Ray got the poppin ass pizza!! And fries with the garlic sauce on point. Stays open late so you can always get your munchie fix. Yee", "author": "Tatiana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "Come through to Ray with the jooooog pizza!! And fries! He'll hook you up with that yummy food!! Ask for the garlic sauce and sumac with your fries. Change yo life !!!!", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "Best by the slice! Quick, easy, delicious. I work across the street and they are my place to go! Friendly service also", "author": "James W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "This pizza place is in a newly evolving part of the tenderloin right next to a great bar! The workers and owners are ridiculously friendly and my family loves the pizza. Solid pizza, great because they deliver or you can pick up.", "author": "Christina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "i came here all the time when i feel hungry , it's really something everybody should try , pizza is an amazing, shawerma is crazy tasty , falafel OMG , available till late night , customer service is so good funny staff all the time  , for drivers at night time nice spot to hung out , keep it up guys love u", "author": "Omar N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "I really love that this place is just a walk from Union Square and it is very affordable.  The pizza is really good, especially the barbecue chicken, and the chicken strips and bbq wings are amazing! I keep coming back because of how good the food is.", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "Pizza is so good and they won't tell us what's in their batter.. worth the $4.50 for a slice of combo! Come by and have one with a beer or two.. Faded, faded, faded..", "author": "Dimitri T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-03", "description": "Quick delivery. Pizza was good. Price is a little bit on the high side, but overall nice spot to order a late night snack/dinner.", "author": "Christopher P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "Great pizza, great service,need I say more while playing some wonderful Arabic music in the background!", "author": "Kimia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Fresh food, great service, very respectful and loving crew. They just added halal chicken shawarma that's really good would definitively come to this place again :)", "author": "Mohammad A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "Lovley place , amazing pizza , open late , anytime u go there nice friendly team , i love there viggie  slice with seasame seeds crust , highly recomended , they also do delivery", "author": "Saleh E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "Well made pizza, Delicious! This place has the perfect menu, something for every craving. My favorites are the Pesto, feta and artichoke Pizza and also the Chicken Strips with tangy bbq sauce.", "author": "S A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "Nice nice great place for pizza and hot wings , its really tasty food, after wehanged out at rum & suger bar we stopped by maysoons pizza the owner and employee are nice highly recomended", "author": "Sa3ad Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-08", "description": "Delivery gets 0 stars. It took almost 2 hours to get to my place and the guy was kicking attitude because he didn't want to actually deliver it to my apartment door. My pizza was cold and had to be reheated. \n\nActual pizza gets 2 starts. It was soggy, and the bread had a weird taste to it.", "author": "Crystal R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Loooove this place . Everything here is really delicious. even the slices that sit out by the window are always tasty. The price is right and theyre Open till 4am which is ausome when ur looking for food after you leave the bar. The boys here are always so sweet and welcoming. They even have a tv u can watch a game or music videos on while you eat. Definitely my fav pizza spot in the hood.", "author": "Kiki R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-30", "description": "TL;DR They charged my card, didn't deliver my food, and ignored my phone calls.\n\nNever got my food! I ordered at 12:30am. Granted this is a bit late, but they are open until 4am on a Saturday night. I was supposed to get my food in 45-60 minutes. After almost an hour past the delivery time I called them and they said my \"friend\" received my order. This is definitely not possible as it was only my gf and myself. The man on the phone sounded confused and asked to call me back. He never called back! When I tried calling the restaurant the phone just rang and rang. Terrible service.", "author": "Craig C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "i love this place .open late good rice frindley service ,always coming here , very busy on the weekend staff always ready , come and try it u will be happ guys", "author": "Francisco J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "Better pizza than Piccolo or Chico's in tenderloin.  Much cleaner place too.  The crust is surprisingly good, it's not exactly crispy but it's fairly soft and the dough adds a good taste.\n\nUpdate: Docking a star.  The quality of the pizza seems very temperamental based on the cook.  Some days, the cheese pizza barely has any cheese on it, other days it's superb.", "author": "Lol N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Amaizing place for pizza I drive in San Francisco late night guys over there so helpful on top they have an amazing pizza , first time I see sesame crust  pizza veggie one I just love it , price so wise for San Francisco", "author": "Hussain A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-03", "description": "Do not order delivery from them. Don't waste your time because I did. I waited for over two hours until finally giving up that they weren't going to show. Eat24 were as accommodating as they could be but I bet the restaurant never even started on the order. Terrible service. Terrible communication. Just don't waste your time.", "author": "Ashlinn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "Surprisingly good pizza from a hole in the wall, cheap pizza place.  Most places you get a lot of doughy crust.  You actually get a lot of toppings on the slices here, and the quality is great for the price, the crust is slightly crisp without being too heavy.\n\nThe folks inside are friendly, and we got our slices in no time.", "author": "D X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-20", "description": "Just before Midnight I ordered a large pizza with Pepperoni and Mushrooms and extra pepperoni....  at nearly 3AM I received a large (I guess) plain pepperoni pizza... That for some reason smelled like a grilled hamburger   and  cost $31.29.", "author": "William B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "Ordered a customized margarita chicken+ olive pizza to be delivered at the Clift. Very satisfied with the quality of the food, sure it took a little while for the pizza to get delivered but it was worth the wait- Their kitchen is open till 2 am!", "author": "Rana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "Very tasty Pizza.  Wait time is a little long but worth it.  Ingredients are tasty.  Budget an extra half hour in your schedule.", "author": "Crystal D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-01", "description": "Came here for lunch. Got a slice of cheese and a slice of pepperoni. There were six small slices of pepperoni on the pepperoni slice, so half the bites I took didn't have pepperoni in it. I'm planning on coming here again, as it is decent pizza within walking distance, but I wouldn't go out of my way for it.\n\nHere's how I rate a cheese slice: \n5-stars: don't need to add anything to it for it to be delicious\n4-stars: only need to add parmesan and it is delicious\n3-stars: need to parmesan, oregano, and garlic and it is delicious\n2-stars: even the above treatment only makes it so-so\n1-star: cafeteria pizza", "author": "Jon O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "Great pizza joint with friendly staff, open late on weekdays which is a huge plus for me. Great neighborhood pizza spot, my favorite for movie night at home is the margherita pizza with sausage.", "author": "Noah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "I was next door at the ice cream place when a smell hit me full force. I walked outside and saw that the smell was coming from next door. Looking upon the pizza in the display case, I notice that the pizzas are all fresh out the oven. I walk in to look at the prices, and see that they are all resonably cheap. I purchased one slice of cheese, and the taste was out  of this world! I finished eating it, and immediately decided to try their veggie slice. Their veggie slice has this amazing sesame seed crust, and their pesto sauce, mixed with their veggies was beyond any expectation I had for this store. I will definitely be back again soon, and will help them get rid of their oh so delicious pizza!", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-12", "description": "I was super excited to order pizza from this place from eat 24. I unfortunately had the wrong phone number on my order by one digit. After waiting until my delivery time I called the restaurant and asked them about my order. They said they tried to deliver it and driver called me and given the wrong number obviously didn't reach me. I gave them the right number and was told it would be 15 minutes. I waited 15 minutes and called again. I was told another 10. I waited 10 and called again. Again I was told 15 minutes. Again was told to wait more and more. Was given totally inaccurate times. On top of that order was apparently delivered to wrong address AND I was told that due to the fact I gave the wrong number it caused a delay and they have never had that happen before. Therefore this was my fault according to them. I was treated poorly on the phone. Assumption was that this was all my fault and that I was the nuisance. My first time ever ordering from this place. Never again.  Here it is. 5:30 am and I don't have the order still.", "author": "Vera S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-18", "description": "So I called at 947pm this evening to place an order for delivery and thought I had the wrong number because the person that answered said \"hello?\" Instead of the business name. After establishing I had the correct place I asked to place an order for delivery and the gentleman said \"you can't physically pick it up?\"....he could have easily said sorry,  unfortunately we are unable to deliver at this time. Instead I was put on hold after he asked if I had cash or a card. About 5-7 minutes later he picked up and took my order and seemed more pleasant than when he originally answered the phone. He told me it would be 45-60 min. Understandable since it's a Saturday night.....I called around 1114pm inquiring about my order and it arrived at 1119pm....the food was luke warm. It was actually good pizza and had the service been better and the pizza delivered at a reasonable time and hot I would have given it at least 4 stars. Do better.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Delicious pizza at an affordable price. Very nice owners, great takeout and delivery!", "author": "Robert S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Great late night pizza spot! Amazing customer service and yummy pizza and they also have really good mozzarella sticks. Open later then the bars so you can grab something to eat late night!", "author": "Sara T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-27", "description": "Ordered over the phone, took a couple attempts to finally get the order right with the guy on the phone. Estimated delivery time 45-60 minutes. Called after 90 minutes to check on status and a different guy (kid) tells me that the pizza is out for delivery and should be there shortly. Five minutes later he calls me back and asks me for my address because the guy who took the order wrote the address wrong. He had no issues with taking my credit card info and charging it but ask him to take an order and write down an address and he's clueless. 30 MINUTES LATER the driver finally arrives with a cold pizza apologizing profusely. He says he's the only delivery guy working. Can't blame him for piss poor management. At the end of the day the pizza was not bad despite not being hot or even warm for that matter. My recommendations for this place is to have someone who speaks and understands good English take the orders and hire some more delivery guys. The pizza is good but you ruin the experience for the customer with poor service. Oh, I ordered one XL pepperoni with half mushrooms on it. Hope this helps.", "author": "Lenny S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-04", "description": "Place looks filthy. Have to wade through trash and cigarette butts just to walk in the door.", "author": "Chip R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-03", "description": "They just called two hours after the order and told me they didn't even start it yet. Even got a status update 40 mins ago saying it was out for delivery (did they lie or did Eat24?). Told me maybe they could give me \"something\" for free next time. ($50 order wouldn't give discount this time). Just cancelled. Obviously horrible service. Wish I could've tried the pizza", "author": "Alan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-04", "description": "NOT NY STYLE!!!!!!  tried Maysoon in hopes of finding a NY style slice which a few yelpers said Maysoon was in their reviews. The first thing I noticed when my slices arrived was that the crust was really thick (you can't fold it) and not thin and floppy like what I would typically associate with NY style. Aside from it not being NY style, the sauce is flavorless so can't give them more than 3 stars.", "author": "Joe P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "great food and open late which is very convenient.  one of the best pizza places in this neighborhood.", "author": "He L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "first off let me say that this is one of my favorite spots even though ive been there once a month ago! i stopped by here after a couple drinks next to them and found the pizzas to be spectacularly and spontaneously amazing! the owner raed was very nice to me and my guy, and the employees were super duper nice! will stop by here when i can! love you guys!", "author": "Devin A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-20", "description": "We ordered our pizza at 10 and have still not received it by 12:30 and our hotel is only one mile away. I've tried calling multiple times and have gotten no response. If I would have known this I would have tried Pizza Hut or Dominos before this place.", "author": "Kortney S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-18", "description": "I ordered the Hawaiian Pizza. Almost no sauce, no bacon as it said on the menu and very little Canadian bacon. Also it was dry. It was tasteless. I also ordered the burger and it was OK, but was too sweet for some reason. I won't order from here again. There are better places nearby.", "author": "JJoyce R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "The pizza is delicious. The staff are accommodating. If you want to have a great pizza, this is the place!!!!", "author": "Mike H."}
