{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "What's there not to like about here. \n.\nYea bright outside dark inside takes a min for the eyes to adjust. \n.\nBut as soon as I seen the prices which is lower than the one next door this is the place. Well I guess any saloon is always a place to crash at and fill up with good strong drinks. \n.\nWell since I'm waiting for dinner might as well come in and get a drink. 3 dollar line star been a while since I last had some in San Antonio. \n.\nNice space, dog friendly, pool tables. And not pack on a weekday at least. Also they have purse hooks which we all love. Welp this is one of my new favorite place to get some beers when thirsty in the city. Thanks for reading and have a yelptastic day!", "author": "Alex T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-07", "description": "Tried to order an Anchor Steam and the bartender says \"We don't serve Japanese beers here.\" \n\nOh, but it's fine to serve Lagunitas (Amsterdam parent co.); Stella Artois (Belgian); and Guinness (Irish). Gotcha. #FOH", "author": "Dyanna Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "I like that this is a laid back spot. \nFriendly crowd. I'd say, Mid 20s n above.\n\n2 bars, one in front, one at the back. \n\nIf you like to dance, good place. But its ovi, that music is some sort of spotify or pandora. But that's fine, because there is no cover fee. \n\nCocktails are not that great so just get shots.\n\nWish they served finger food.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-17", "description": "If your a minority prepare for racist comments!!!! Walked in there hoping to have a good time ended getting a barrage of racist comments on the way out.", "author": "Tristeb D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-26", "description": "One of the few mainstays on Polk Street\n\nThis bar is pretty long with two bars (front and back).  The drinks are moderately price with consideration to Mayes next door although similar to other bars on the block. Great place for dancing although not so great if you enjoy live mixing.  \n\nFor those who do enjoy dancing, the floor can be a little dirty and sometimes raunchy.  The place appeals younger individuals.  However, with a good group of people, you should be able to navigate and enjoy a part of your night out here.", "author": "Joel Christian A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Best bar in the city by far, the bartenders are soooo good and make sure to take the time to get to know every client on a personal level. Love them all !! The drinks are good as always strong, super affordable and fun", "author": "Flower F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "This was pretty chill, low-key spot that I met some friends to watch a hockey game. Plenty of drink choices and a decent sized space with pretty good seating. There were no less than 6 TVs and we were able to watch our game with no problem. Great spot to grab a few beers and catch a game. There's no food offered here, but did see that some customers brought in food from outside places. So plan accordingly.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-04", "description": "AMF ($15): served in a tall cup, like a pint for beer. Strong AF.\n\n+Dance floor in the back\n+Bathroom is small and a little dinky, 2 stalls", "author": "Telena V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-03", "description": "Came here last Friday to take out family from out of town.\n\nWas looking for another place in the area but this place seemed to be the lively! \n\nThere was no cover which was nice. The three security members were outside checking ID's. That processed seemed easy enough. \n\nOnce inside you first see the open floor area, the bar to the left, and some booths over to the far right. I didn't get a chance to travel any further back because it was packed but not to the max yet.\n\nWhen to the part first to get some drinks. It seemed like this place was a bit understaffed. Lots of people were ordering drinks but only a few were being attended to you. I couldn't help but see the blatant conversation going on between two bartenders who were not helping anyone until they had decided to end their conversation and then decided to attend to the eager customers looking to order drinks, just odd and peculiar but oh well I guess.\n\nThe vibe of the crowd was mixed. I would say that the demographic was that of early to late 20s. Not too much of a rowdy crowd but eventually the Saloon did eventually fill up. \n\nThe bathroom was gross but that was to be expected. Just foul in every way imaginable.\n\nThe dancing is not really what you anticipate but then again it is a bar not a club. Everyone is dancing in their own world, more or less. If you come with a group then you should be good but be careful. There are some questionable folks that will wonder around looking suspect and suspicious, hold your wallets and phones close to you. \n\nStayed here till about midnight and then we had to go. This place just did not meet the expectations of a Friday night in San Francisco. Might have to give Vertigo Bar a try next time. Just an okay experience.\n\nOh, some of the mixed drinks are a bit watered down. That is probably a result of the amount of ice that is used in making their drinks. \n\nBest of luck to you all off you that choose to \"LIVE IT UP\" here on a Friday or Saturday night.\n\n#BottomsDown", "author": "Robert F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-19", "description": "I waited in line. All my friends got their ids checked, and got in (one of them even had an expired id and got in). The bouncer took one look at my Texas ID, and said \"Texas ids tend to be fake. You can't come in. We have the right to deny you service\". My id was real, but he said I couldn't come in.", "author": "Jojo Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Best Guinness pour in the city and it's not even an Irish pub.  Although you wouldn't know it with two Irishmen behind the bar.  This saloon is what bars should be.  Great crowds, great service and great beer.  Everyone in McTeague's takes pride in what they do and it's apparent in all the beverages poured.\n\nIf you are looking for a pub with history and a great place to meet new friends, this is your place!", "author": "Joshua S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "I love this place! Great drinks and the best service ever! Great selection of beer on draft including some unexpectedly delicious craft brews along with traditional favorites. The bartenders for fantastic. They are friendly and extremely talented mixologists. Stop in for a Cheers feel bar.", "author": "Christie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-01", "description": "A lively dive bar on Polk.  Great music for anyone who enjoys hip hop and R&B, but don't expect much in terms of drinks...mediocre cocktails and a draft selection limited to light beers, Guinness, etc. served in plastic cups.\n\nPerfectly cool with good company as the booths towards the back are a good spot to hang out.  Otherwise, look elsewhere.", "author": "Eric F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-26", "description": "The music here sucked. Music genre was bouncing from one to another for every song - slow song to rap to who knows what. \n\nOn the plus side, drink prices are somewhat decent here - several bucks for a drink. \n\nNot a fan, but it does get decently crowded towards midnight.", "author": "Becca S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Any dog friendly bar in SF gets 5 stars in my book! The drinks are good too, multiple TVs and a pool table.", "author": "Megan D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-19", "description": "I've been coming to McTeague's for 10 years. Went back sat night got my drinks. I look at the drinks and see they are in much smaller cups than they used to be. I ask the bartender did the cups get smaller ?  He says no I look weirdly at my friend- he then asks why are you making that face ? I've been making these drinks for 10 years. So fucking rude, you know which one you are. I've been going to this bar for 10 YEARS TOO, no need for that rude comment.", "author": "Nessa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "My Bestie and I stumbled across this gem of a bar while in SF for a short getaway. The plan was to Bar hop and take in as many places as we could in one night, once we stepped foot into McTeagues our Bar hopping came to an immediate end. The Bartender Stephen is by far my favorite part of our visit, he is friendly and sweet and makes the perfect Kamikaze. If you are looking for the type of place that feels like home the 2nd that you sit down look no further than McTeagues!!", "author": "Greta H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-01", "description": "Small joint; watered down drinks, bartender in the sparkly dress on New Years was a total bitch.", "author": "Genna N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-24", "description": "They're terrible at letting people that don't have a California ID into the bar. All my friends got their California IDs checked and got in. When the bouncer saw my Washington driver's license, he asked if I had another form of ID (as if I would be carrying around my passport) and when I said no he said we can't accept your ID. It's pretty ridiculous that they didn't let me in on the basis of having a non-California ID, even though it was a legit form of identification. Would not recommend if you're coming from out of state.", "author": "Rachelle Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-15", "description": "Lol I never know how to review dive bars. Like what's the criteria here? How do you review these places with the same scale as a nicer establishment?\n\nAs many Polk nights end up, a group of friends and I were at McTeague's around midnight on a Saturday (or Sunday I guess). There was a long line, but it moved pretty quickly. I think it took about 15-20 min before we got in. Main thing that my friends wanted to come here for -- no cover and a good time. I've never been, so didn't really know what to expect. Kind of got the typical dive bar scene but with so many angry people ?? So many drunk people spilling beer and yelling at each other, this place was just a bit way too aggressive for me scene wise.\n\nThe music was primarily rap and hip hop. The inside is actually fairly large, though it obviously gets crowded. It's a pretty good place to jam, that is if you get over the typical lurking crowd of men looking to prey on women. So I guess my 3 star review is more attributed to a less than desirable crowd in my personal opinion. If I want to have a divey night out, there are other places I would rather go to. \n\nService wise though, the bouncers here are super nice. Not nice like will let you in with your fake, but just super nice, friendly and awesome people. The SO and I chatted with one of the bouncers, he was an interesting dude who carried on a great conversation and even said goodbye to us on our way out. That's a real nice touch of service you just don't get at most places. \n\ntldr; overall, I thought it was an okay bar, but don't feel a strong affinity to come back. I thought the people who worked there were awesome though!", "author": "Jasmine X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "Cool vibe in this dimly lit bar. Lots of wood and old time decor.  Lots of fun petting the dogs roaming around and chatting with the owners.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "Always a place to stop when you are in sf. It's in a great location by multiple places. When I go bar hopping with my friends on Polk street this is one of my favorites. Typically during the weekends it's busy and there is a line outside, however I think it is worth the wait. Another thing to keep in mind is that there is usually a cover charge usually about $10.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-20", "description": "Divey forsure!\n\nWeekend Security were hustling and doing a great job during St. Patricks Day.", "author": "Krishneel K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-22", "description": "UNEDUCATED, DISCRIMINATORY, & IGNORANT POLICY- they wouldn't take my ID because I'm from Guam and wouldn't give me a reason. It's a US territory learn about it sometime. The bouncer couldn't give us any reason nor a manager to speak to regarding their ignorant & discriminatory policies.  The bouncer couldn't even speak to me like I was a human being and just ignored me the second he saw my ID. Apparently there wasn't a manager available to speak to tonight either.\n\nWhen I mentioned their company would lose business because of their arbitrary policies (he probably never heard of guam and therefore found my ID as fake) he says \"oh not necessarily\" so I guess that means they don't care about losing business to people from anywhere outside of the state or people from a place that isn't a huge city.", "author": "Marin J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-01", "description": "Came here on a FRIDAY night. Nothing special. The decor was old and music wasn't great. Outdated music?! McTeague smelled like puke even early in the night. The floor was sticky as well. Drinks are overpriced for an outdated bar. The probably have to remodel if they are not in a good location. \n\nJust another old smelly dive bar on Polk. Only plus side is no cover charge.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-29", "description": "In a lot of parts of the United States, McTeague's would be the best bar in town.  Right?  \n\nThey open early and have a great selection of European Matches, and they draw a knowledgeable crowd.  They have a big selection of Drafts, range of $7 Cocktails, and higher end Whiskey/Scotch offerings.  I love watching sports here, and they have a lot of TV's.  It's a big place, and it draws a diverse crowd.  It is really one of the better Sports Bars in SF, and if you are from out of town and want to watch Football (EPL, not NFL) in the AM, you can't miss here.  6:30am on the Weekends, if I'm not mistaken.  You should also check out their art - I have some photos posted.\n\nI don't know a lot about the history, but I know it dates back to the olden days of the 1800's.  I can only imagine Polk Gulch at that point.  It's diverse and rough-and-tumble now, but to think of dirt streets and a whole continent between you and The East (and no airplanes)...  I think this place helps us retain some of our Old School Awesomeness.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-04", "description": "Seeking a tourist trap with rude bartenders wearing cowboy hats for a more \"authentic\" vibe?  Found your spot!  Pump up the Nickelback and enjoy!!\n\nCharacterless interior and lackluster service in an area where significantly better options abound.", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-11", "description": "They have no cover charge here which is great because many bars on Polk charge on Friday nights. Ambiance is nice and drinks are decently priced for San Francisco. \n\nP.S. for ladies, they have a secret restroom hidden on the left of the girls restroom with no sign on the door. If there's a long line and you need to go, look for this restroom!", "author": "Lushi Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-02", "description": "If you're at least heavily buzzed and ready to dance like an inflatable air man, then there's a small chance you will have fun. Anymore sober and reality will hit you hard (trust me, I was DD, more sober than the Pope). Grimy, hot and stuffy, chaotic, sticky floor, puking smell blends with sweat, loud sucky music with old weird decor. \n\nThey stuffed people in as  if they were making bratwurst. Drinks are too expensive for a dive bar (~12 bucks for a mai tai & other cocktails). While waiting for your drunken friends to come to their senses (will not happen), I challenge you to a game of no-contact: you weave around without touching anyone(Hint: you will lose every time, your crotch (boobs for girls) is the weak point, it will make contact).", "author": "Minh V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "Had a nice evening with their cocktails and loud music. Staff is friendly.\n\nIt's little crowded, otherwise nothing to complain about.", "author": "Ranjit M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "I've only been late at night. Fun place, bigger than it looks from the outside. Usually worth the wait if there's a line.Great music and the beers aren't as over priced as most places in the city. Last time there was a little too much standing around and not enough dancing going on.", "author": "Jackie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-21", "description": "Not a bad bar. Hardly anyone was there on a Wednesday night, and service was fast and easy. Drinks were a bit pricey, but I would definitely come back. The place has a nice aura to it--good for a chill night hanging with friends but I also get the impression it can get pretty busy and crowded on Friday/Saturday nights. There were two main bar areas in the front and back to order drinks, but since it was Wednesday night, only the front portion/seating was open.", "author": "Tony A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-05", "description": "Oh McT's, how we love you. Whether it's the line dancing lessons, the MNF parties, the crazy and terrifyingly demented halloween decorations, or the huge line out front for 4-deep at the bar, we keep coming back.\n\nWhy? Girls. McT's has the best flow of any bar in the area and on pub crawls, theme days (SantaCon) or Halloween, it never disappoints.\n\nSure, the floor smells like a frat house kitchen and people camp out in the scant seating like they are camping overnight, but we love it, and we always come back.\n\nAffordable drinks, fun bartenders, lots of TVs, and fun people. If this place every get's bought and turned into a frou frou hipster bar I swear, someone will burn it down (and trust me, with the years of spilled liquor seeped into the woodwork, it will go up like a matchstick house)", "author": "Mike V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "You know I actually liked this place. \n\nWe don't have much 'Saloons' in Hawaii. The ones we do have, doesn't give you that country vibe this place did. We also came on a Thursday, which is apparently their country night. \n\nThe bartender that was helping us was awesome! He was super cool and patient with us.", "author": "Ariana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "Great vibes as soon as we walked in, the bartender was very welcoming! Made a drink of his choice for me that hit the spot! Great  dance floor and music. Definitely recommend going .", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-06", "description": "My friend and I have been to this bar numerous times and have never been really disappointed! Yes on Saturday's it tends to be very crowded (what place doesn't though) and hard to move around in, but they have a small upper level that my friend and I always end up dancing on that gives us a little more space. Drinks are about $7 if you wanna get fancy with it, and the alcohol ratio is fair.\n    The only reason i did not give this place 5 stars is because on some nights for some reason the music is not to hot , well at least for dancing. More rap/slow songs. I personally am into  twerk music when I am out... but sometimes they are on point with their music, luckily if you go to polk there are a ton of bars and dance clubs in walking distance. I do recommend to check it out though because it was still a lot of fun and has a good vibe!", "author": "Devon H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-16", "description": "Did Litquake choose this venue for its Goodreads Lit Quiz event for its name? McTeague is the title of a novel written by Frank Norris around 1899 about an eponymous dentist who opens a dental office on Polk St. in San Francisco.  I talked to one of the Litquake volunteers and he said the place wasn't chosen for its name but for its size. \n\nThis is a pretty sizable bar.  You wouldn't think so from the outside but it is inside. The main bar counter is long and there are booths and bar stools across from the bar. Plenty of seating for those who want to sit. Beyond the bar is another room in the back with a smaller bar, several more booths and more bar stools and big barrels as tables. \n\nThere are weird stuff on the wall as well as ceiling. There is a huge sign by the women's restroom warning people of phone thefts.  This place was crowded the night we came, as people were watching the Giants game. I can't speak about their cocktails because we just had beer here.  They have a lot of TVs, so it's a good place to watch sports. We saw people bring in food purchased outside the premises to have with their beer too. Not a bad place to get together with other Giants fans to watch the game and for nerds like us to compete in a literary quiz!", "author": "Hazel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-24", "description": "This is a very large bar that extends far into the building with different rooms with multiple bars. It's a little more on the ratchet side. People were drunk and acting rowdy. It's way too loud to come here for a lounge feel. I'd recommend this bar if you're looking for hip hop and lots of dancing room.", "author": "Evana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "The music was amazing, no cover, and great dancing. Drinks were also reasonable. My only complaint is the $15 minimum for using a card.", "author": "Kyle L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-11", "description": "If I could leave zero stars I would; I actually created my yelp account solely for this review. I really love this place, but it unfortunately has a problem with attracting thieves. In 2015, two of my close friends had their iPhones stolen out of their back pockets. As I completely felt for them, I did not want to discredit the bar because I loved it and bad crowds can be found anywhere; especially in a city.\n\nI came back to the bar this last Saturday, the 9th and was there for about 30 minutes. I had one drink within this time span and went back to the bar to get another. I ordered my drink and opened my purse to pay and my iPhone, debit/credit cards, and license were gone. I am not one to lose things, nor have I ever had anything stolen from me.  A reminder that my purse was ZIPPED, so the people that are doing this obviously know exactly what they are doing.\n\nFurthermore, once I figured out my cards were missing, my boyfriend asked the bar tenders if there were any tabs open under my name because my things had been stolen. They said that there were not, and with this being said they should have been on alert looking for my name. I was not able to cancel my cards until I got home, and the next day there were three large charges on my account from McTeague's. Fortunately, I can have the charges reversed and purchase a new iPhone, but the fact that the bar tenders were alerted and still did not catch this is a bit concerning.\n\nOver all, I am sad to have to leave this review, but within the last year multiple items have been stolen from my friends and I here. Security told me that this kind of thing happens all of the time here. If this is the case, WHY isn't there security inside keeping an eye out? It is one thing to set your things down and have them stolen, but it is another to have them stolen from you while you diligently have them in your possession. \n\nMy point in writing this is so that this does not happen to anyone else. It's a terrible feeling and I would not want anyone to have to deal with this. Hopefully McTeagues can solve this problem.", "author": "Racquel T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-09", "description": "Inexpensive*\nNice place to grab a drink on a Thursday night; clean when I was there at 8pm. Friendly security guards and friendly bartenders.\n\n\n\n\n*perception of expenses may be skewed from living in LA and bay area", "author": "Trang B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "Decent music on weekend nights and no cover. Thumbs up in my book. It's a great place to hang out at if Mayes next door has a huge line - and cover.", "author": "Tina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-28", "description": "Came here early to watch the Warriors Final Game and hopefully have a victory party but that was not the case. I sat in the back to watch on the game on the big screen and had the awesome bartender Tony. He was great and promised I could be his first order and I was. I was also his last after my team lost :(\nStill had a great time though. I've been here for plenty of crazy Friday and Saturday nights with my best friend. Always a good time at this place. The people are generally friendly, including the security up front and it's never super overly crowded to the point it's unpleasant. Always just on point.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "This place was fun!! Great lil vibes in there. Love the shuffle board! Great beer on tap!! Will def stop back by when I'm in town again", "author": "Tuna O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-28", "description": "Eeehhh.. I've been here about 3 times. And while the crowd is okay, the actual environment is pretty unbearable for me. Right when I walk in..all I smell is vomit. Excuse me? The first time I came was for a friend's bachelorette and we went bar hopping--I thought maybe someone did puke. Second time...was confused. Last night we got there at like 10p!! It STILL smelled awful! There's this sour smell right as you walk in, it wasn't even crowded last night. Makes me think this smell never goes away..\n\nFor somebody who has a sensitive nose, I can't deal. There must be other places that don't smell so disgusting upon entry. =/", "author": "Emily C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-18", "description": "Nice pub on Polk and Bush. It's called \"Saloon\" and that should give you a hint - Thursday's is Country Night! Love it or hate it - the rest of the week you'll find this bar to be a good mix of Irish pub, American sports bar, and your typical dive spot. \n\nFor the Country Nights they offer line dancing lessons (it's tough to follow even if you haven't had a drink yet!). It's a fun and mixed crowd and the drinks are good.\n\nCheck out the specials - $2 Longnecks on Thursdays.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "I specifically signed up for yelp just to write this review.\nThis review is strictly for the bouncer, Tyrome (I don't remember his exact name but he's the tall black guy)\nI lost my purse here on a Friday Night and returned to the bar on a Saturday\nonly to find out that the bouncer found my purse on Friday night and returned it to the bar.\nTyrome is freakin awesome,This man deserves a raise.\nDespite the shitty situation I got myself in that night, I was thankful I got all my belongings back expect my iphone.\nLadies, I would be extra careful coming out this area, gets super sketchy late at night\nYou would not want to be stuck in the shitty position that I'm in.", "author": "Victoria y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-01", "description": "This bar has its pros and its cons. Drinks were reasonably priced, music was good (but they play it from weird locations so it's not very loud in parts of the bar). The glass floor is light up in one section and cool, but some are broken and it looks kind of janky. Finally; I don't know if my group had a bad night or what, but 3 people lost or had stolen their iPhones. Another friend who was not there later said that bar is notorious for pick pocketing. So that is unnerving, be very careful with your belongings!", "author": "Alec T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "Came here for the super bowl and the customer service was outstanding. No cover and free complimentary pizza and wings?? I'm in! \n\nIn a time when everyone was trying to charge extra because of the super bowl, McTeagues focused on helping out fans and providing great customer service. \n\nThe crowd was there to have fun, no issues, no obnoxious kids.  The bar tenders were personable, approachable and downright friendly. We had a great time.", "author": "luis m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-07", "description": "This is a pretty chill bar! There's two parts to it, which I like. You can just hang out in the front and drink. There are some places to sit and/or stand around tables. Then there's a dancing area in the back and they play bomb music. I was drunkenly obsessed over the rubix cube looking light up floor in between floors.", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "Oh, you got problems?\n\nThere's a group called EVERYBODY and they all meet at the bar. \n\nProblems solved.\n\nEspecially on Thursday nights when it's $2 longnecks, $5 American Born moonshine and a lot of down home country folks rockin their boots on the dance floor. \n\nIf country music ain't your thang, there's plenty of TV's to catch soccer and/or football games here too!", "author": "Janice C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-03", "description": "Was here during fleet week and it was crowded as fuck. The drinks were great and the small dance floor in the back was fun.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "Always come to this bar to hang out with friends. Nice atmosphere on weekday. Not too crowded", "author": "Por P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "A great selection of music [modern, country, dance...] + cheap drinks + nice employees + not crowded with douches = PERFECT for a party of girls to enjoy the first night of bachelorette fun!! \n\n:)", "author": "Katie F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-13", "description": "WHOAAAA!\n\nEverything was just fine here on a Saturday night here until I decided to head towards the back and crossed the invisible but VERY APPARENT line that lies smack-dab between the middle of the bar and the dance floor area right where the bathrooms are. \n\nI'm sorry McTeague's, ya'll get two stars for having good service and drinks at reasonable prices, but goooodlaawwwwd!!! I'll be damned if this place isn't the smelliest bar I've ever been in my entire life! I seriously felt like I got hit in the face by that locker-room-esque wall of odor that's trapped in the back. GET SOME FANS! or A/C in here NOW! \n\nI feel so bad for the people that have to work here. I had just gotten back from 8hrs at a festival on top of being 3 drinks deep and I couldn't even tolerate the pocket of stench for more than a few seconds. \n\nThis is a decent sized venue and again the prices and service was good, but that lack of ventilation is inexcusable.", "author": "Bob Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-05", "description": "Great locals bar, with friendly owners, who occasionally will do a shot with out-of-towners that actually get the McTeague's reference...I think we found our new home away from home.\n\nLissa G and I popped in one afternoon to McTeague's Saloon solely based on the name since my wife is an English teacher book loving nerd, in a good way of course. The Saloon definitely felt like it had been there for a long time and had that old time feel, even though it has not been open very long. With gold teeth abound (McTeague reference - look it up) we settled in for a couple of drinks and pints of Guinness. \n\nThe owners stopped by for a chat and to give us some great spots to try for dinner that night. All and all, friendly folks and a spot that will make you feel right at home.", "author": "Jim G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "McTeagues is honestly one of the most fun bars I've been to here in the city. Very warm, friendly, and hilarious team of bartenders at the place, and more importantly - a good, clean, beautiful crowd! The drinks are great, the service is stellar, and just an awesome place to party, or even watch the game! \n\nI spent my New Years Eve here for their \"Studio 54\" themed disco party- and they really went all out.. Disco lighting and decorations. A photo booth. And even an LED Dance Floor! Most happening place on Polk street in my opinion.", "author": "Devin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "I've been to McTeague's twice. Once for a night out with the girls and just recently for the USA's first World Cup game. This place is great. They had the American Outlaws there and hosted a bunch of people who emptied out a few of the beverages on tap.\n\nThe bartenders: Very witty. If you can't take sarcasm or aren't able to throw it right back...brace yourself if you decide to say something dumb. They keep the ball rolling and do a great job of getting beverages out quickly. & when they're out of something know what you want as a back up. They do a really good job of making sure you get something to drink!\n\nThe beverages: At night they made me a bullet Manhattan on the rocks & they made it mighty fine. At 9:00 in the morning I was served a delicious tequila sunrise. I will say it didn't feel right ordering a tequila sunrise there but I also didn't want to order an OJ. Pick your poison. Oh the noon time whiskey sour is delicious too! That's not a new drink. It's just a whiskey sour at 12:00. Still delicious.\n\nThe bar: Got prime seats at the end of the bar close to the door for the USA game. Also got prime seats at a booth in the evening. They've got great seating no matter what you're looking for. It's not overly decorated which is great because no one wants to be assaulted visually by cheap themed decor. I will say look up at the ceiling. They've got a few pieces of art work that's pretty cool & there may be a chance for you to get educated on premier league teams.\n\nThe grub: Bring your own. There is a bunch of places you can take out from and they encourage it too. But don't be a Dirty D and leave your junk all over the place. If you ask nicely the staff will dispose of it for you if you can't find a trash can yourself. \n\nNote: It's a Saloon. Don't expect table service or to get a novelty \"scorpion bowl\" with a plethora of fruit. You'll upset the regulars and the bartenders. And no one will feel bad if they kick you out. Great place to grab a beer or some whiskey and watch the game.", "author": "Tam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-14", "description": "Part of the late night, bar hopping Polk experience starts and ends with McTeague's. Part Irish pub, part west coast \"Saloon,\" it is a drinking sanctuary that accommodates all occasions and all crowds. Judging by the lines and how consistently packed it is nightly, it is by far one of the area's most popular bars.\n\nPlenty on tap and drink specials for days, libations just never seem to end here. From the obligatory Guinness on tap to the Shiner Dark as well as cocktail deals, no one can or should go thirsty. I myself prefer a strong whiskey on the rocks, which they have plenty to choose from.\n\nThere is free pool, live music on occasion, and when in season, lots of sports playing on all the various TVs. It's a great place for Giants / 49er games and even better during MLS matchups. There is a small selection of pub food and even complimentary BBQ during weekend games.\n\nWhen the crowds come and the ventilation suffers, that's when I'm out of here. Saturday nights around midnight can be a cluster of dbaggery, but then again, what place on Polk isn't inundated?", "author": "Jando S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-03", "description": "Probably the only reason we'll come here on a weekend is because there is not a line.  You usually don't have to wait to get into McTeague's and there is no cover.  Once you get inside, it could be pretty crowded.  If you get there early enough, there are booths in the front and also in the back. \n\nThere are 2 bars, one as you enter and another smaller one in the back.  The bartenders are nice and quick.  The drinks are average.  The one drawback about this place is that it is known for theft.  There have been so many times when I've come that someone has gotten their phone stolen.  Probably not worth the risk to come here if you are a girl.", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-07", "description": "I realllllly like this place because right off the bat, the bouncer was funny, chill and super nice! He was joking around with us and was so welcoming! Lol! Did I mention NO COVER! Yay! I came last night (Friday night, 12amish) and there's a bar in the front and a smaller room in the back with a bar which is a little more crowded. There are booths which is cool for groups. It was easy to get a spot in the bar to order drinks but remember that if you plan on using card, there is a $20 minimum. The bartender was quick and nice! I got a FireBall, a beer and a Jameson Pineapple for $20ish bucks, not bad! \n\nThis place does not have a dance floor BUT it has this awesome small lit up area of flooring that you are allowed to stand on but cannot stand against the walls due to everyone walking through. Did I mention the bouncers inside were so chill and nice too?! Omg I wish I these kind of bouncers were everywhere I went! Lol!", "author": "Veronica A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-07", "description": "This place sucks. I've tried to go in 2 times and they haven't accepted my Mexican ID when every other place does. So fuck this place, I will make sure not to recommend this to anyone specially if they're only form of ID is a Mexican one. Like seriously what kind of bullshit is that.", "author": "SuckaNut V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Had a great Saturday night here, was able to get a $10 margarita the was amazing and a AMF for $15 but it was a huge glass. Over all super fun, good vibes everywhere!", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-11", "description": "Mediocre bar, terrible service. I waited 10 minutes to put in my order, bartender took the order of a woman that walked up after 1 minute of waiting. When I called him out and gave home a middle finger he had security escort me out. Never going back. BTW security thought it was funny and we socialized on the sidewalk while I waited for the people in my group to finish their drinks.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "Casual. Good jams. Decent drinks. Fun people. \n\nThis was our first stop to a long night of bar hopping and boy am I glad we stopped here first! We had great drinks here to start the night and danced our little hearts away. This place had awesome mainstream and old school hits to sing our lungs out. \n\nGirlfriends and I will be back when in SF!", "author": "Gladys L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-20", "description": "Unassuming from the outside, but McTeague's is definitely a Polk street incumbent.  Super long, classic wooden bar is the center attraction while Irish decor is littered all around.  McTeague's boasts cheap drinks and a rowdy crowd.  The drawback being, the crowd may be a bit too rowdy on weekends, and the cheap drinks often end up attracting the wrong crowd if that means anything to you.  Great place to pound some shots and maybe get into a fight?", "author": "David C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-29", "description": "This is a classic dive bar on Polk. I'd save it for the end of your bar crawl.\n\nPros: No cover charge. (At least we weren't charged) Crazy unique decor including a coffin hanging from the ceiling with a skeleton hanging out. There is a really cool lit up dance floor and there is a surprising amount of seating, if you can snag it.\n\nCons: It smelled like puke and the floor was sticky even though we were there at the beginning of the night. Glassware looked dirty as well. The music was really outdated so even though people gathered throughout the night and there was always someone trying to start the dance floor, it never really got started.", "author": "Kari G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-16", "description": "Sad that I have to come all the way from Austin to San Francisco for line dancing, but McTeagues was worth the trip.\n\nAdded bonus: $2 longnecks.\n\nUpdate: While I still like this place, after 3 visits I discovered my experience is unfortunately dependent upon when you go.  My last trip out was ruined by the a a scourge of vapid drunken college students.  One of them actually told me I \"had to teach her\" how to line dance and that \"I was going too quickly\" (said in the whiniest drunken tone possible).   I will be back, but I hope the night I choose has a more mature crowd!", "author": "Adina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "Bartenders will get to know you by name, remember your drink and high five you when the Giants score. \n\nIn other words my type of drinking hole.\n\nListen its not too pretty, but if you want that walk down the street and fight for a place at the bar and squish shoulder to shoulder. Plus soccer is god here which is every drinking man's sport.", "author": "Timothy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "So, I have a love hate relationship with McTeague's. On one hand I love them because I have been escorted out more than once and they still let me come back. Friday night was another one of those nights of drunken debauchery. On the other hand I hate this place because it makes me want to rage like I am still in college. I have no idea why I always end up at McTeague's when I am completely annihilated. But thanks for dealing with me shouting \"I'm the Duke of San Francisco, I OWN THIS BITCH\" this last Friday and I apologize to the bartender that dealt with me. \n\nFuck, I am 34 and still acting like this...\n\nGod I love San Francisco.", "author": "James N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "I was surprised walking in this establishment that there were empty seats at the bar. I was further surprised that the micro-brew that I ordered was only $4 and so where many others too.\n\nWhat's going on here? I don't think it was happy hour or anything. If so, $4 is still a pretty awesome price for a pint of beer in SF.\n\nAnd I like the ambiance here too. Kinda looks like an old cabin with an electronic jukebox and a pool table in the back. So you can definitely tell that it as a \"saloon\" feel to it too.\n\nMaybe I came in on an off-night for these guys, but I like the not-so-busy-feeling here, so I can see myself coming back to this bar again.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "Real Harp beer! God bless, the blessed owner Miles!\nBest real Irish bar in San Francisco! I highly recommend meeting Seamus and the lot who make this place the best! 5 stars!", "author": "Anna L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-06", "description": "Since moving to the Bay, the first time going out in the area neighborhood.\n\nBouncers: Super cool and were chatting it up with even though all my friends were behind me. All of the staff were pretty relaxed.\n\nBartenders: super responsive and made some really stiff drinks.  Most of my cup was vodka and there was a few drops of Red Bull in it. Yum. Typical prices.\n\nAtmosphere: Enough room to walk around and didn't run into too many dbags. A few guys were creeping hard on my friends but eventually got the hint to be gone. \nMusic was on point and I'm told it's off of a spottily account since there's no DJ. Computers taking our jobs!\n\nBathroom: Man that was gross so hopefully you don't have to do more than numero uno. If you do, god's speed.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-30", "description": "Pretty sure we walked 10 blocks to go dance and there is no dancing here. The bartender told us haven't had dancing for over a year", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "Well. This ol boy from Texas figured out that they served Lone Star beer, so why not drop by? Lone Star was there. But as I sipped on some suds, Turnpike Troubadours can on the speakers. This is on a Monday, folks. Country shindigs go down on Thursdays, good on 'em. I reckon there's a taste of home here no matter the day. \nGive the barkeep Tony some love for me.", "author": "Steve P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-14", "description": "I used to come here all the time and loved it (especially country  night on Thursdays, although I'm not sure if they still do that).\n\nThis weekend, I was there with some friends and they were playing videos of Nazi rallies/with Hitler speaking for at least 20 minutes. When my friend asked them to change it, they dismissed her with \"Honey, don't take it so personally, have another drink\".\n\nTotally inappropriate. This bar is gross anyway and there are so many other good bars on Polk that I don't need to ever go back.", "author": "Alana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-11", "description": "I've never wrote about dive bars, so this would be my favorite one so far! \n\n*Spacious*\n\n*Happy Hour*\n\n*Pool Table*\n\n*Great way to celebrate*", "author": "Kathy V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-26", "description": "Decent-enough bar. Not cheap and not expensive. Lots of TV's and chill vibe. Decent taps. No food, though, or I would have given it more stars. Bartenders can be hit or miss here. Bartender I had last time I think was Irish? He was attentive enough but doesn't know how to make some mixed drinks well. Just stick to beer and shots and you'll be fine.", "author": "MakeUp M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "Great for watching USA soccer games with the American outlaws.", "author": "Chase T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "A soccer bar! Hell yes. Also great prices and a friendly place. At night it gets pretty packed and there's a dance floor. Good during the daytime or nighttime.", "author": "Shawn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "This is a very fun saloon. It's decorated in a very eclectic fashion with lots of sports flags & memorabilia lining the walls and ceilings. I can't comment on it's night life since I have only ever been here to watch Everton soccer games. The bartenders are very friendly and efficient. They are attentive without hovering and love to watch the soccer games with the patrons. They also won't judge you if all your order is hot black tea (like me!) The bartenders also remember the customers who come more regularly. They have a bar in the front and booths in the back if you want to sit removed from all of the action. The restrooms are clean as well, which is always a rarity in a saloon like setting. Nestled in the heart of downtown SF, I'd highly suggest this as a fun place to come watch any sporting event.", "author": "Alyssa L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-09", "description": "It smells like poop by the doorway and I don't mean the outside. \n\nSloppy people watching galore", "author": "Susy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-09", "description": "Came here to get turnt up on Saturday night and did just that.  The bar is pretty big, but its packed fast.  The crowd is somewhat diverse.  Actually I would say it is a good cross section of the SF demographic, pretty much a little bit of everything, where as some of the other bars on Polk skew one way or the other.  \n\nDrinks are decently priced and they take card to it makes things easier.  Once you get your drink and find a spot, you can start partaking in the drunken fun which may or may not include drunken dancing and singing (as room permits).  I am pretty sure the music comes from somebody's ipod or computer since there is absolutely no mixing or focus on any particular genre...Top 40 though out the decades we have lived?\n\nNo cover and relaxed atmosphere works for me!", "author": "Veasna H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-17", "description": "Someone stole my phone here :( And the bouncers were very nonchalant about it.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "Stumbled upon this place on a Friday night after leaving Mayes. There was a line to get in but luckily we saw a friend towards the front. No cover for guys or girls. Quick service at the bar, enough room to dance or just talk and hang out- whatever you prefer. Good amount of people. We had a lot of fun and I would definitely come back.", "author": "Samantha H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-02", "description": "As a 28 year old grown woman, it depresses me slightly that the majority of my Saturday nights end at this bar. I have not moved on from getting blind drunk and getting incomparably excited by the sound of listening to the backstreet boys.\n\nThis place is usually a good time, it depends on the crowd, how drunk you are, and if they oblige and play enough spice girls and backstreet boys.\n\nSometimes you have to wait a while to get served, which is entirely for the best in the long run because they pour strong drinks here. I go from basic drunk bitch to cerebral palsy from roughly half of a gin and tonic here. Also, as this place gets packed toward end of night, you can assume everyone else here is also on their last, drunken leg as well.\n\nIt's definitely a younger scene, which can make you feel as though you are:\n\na) a cougar  \nand/or \nb) an old desperate ho.\n\nThere is also one more option:\n\nc) get so blind drunk that age becomes irrelevant. \n\nI often go for choice C before making out with a random 23 year old. It's pretty promising, good way to find future husbands, ladies.\n\nOverall, it's a good place to end the night on Polk, always funny, always full of characters... Just need to find some more men here who are a bit further away from completing puberty.\n\nCheers mcteagues, see ya again this weekend.\n\nPS girls:  8/10 times, you can definitely find hot British and Australian tourists here who are down to make out with you in public.", "author": "Valerie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Oooww. I never thought there is a such a good place. Entrance looks kinda weird but once you step inside you are going to experience an amazing crowd with wonderful music. And they got great Sound systems too. No matter where you are, some random corner, Mini lounge or on the lighting dance floor you'll hear the same sound with excellent bass. This place is amazing and fully took over by Young crowd on Friday's and Saturday's. Thumbs up I'm going there again. \n\nBut the only catch is, Minimum $15 for credit card transaction.", "author": "Vamsi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-24", "description": "It's pretty cool in here. They have a bar area with tables and a small dance floor in the back. Went here on a Saturday because a friend recommended but we left because the music went from hip hop then pop and rock lol it was chill there but not the type of music we wanted to dance to.", "author": "Marilee A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-24", "description": "Some very fanatic line dancers come here Thursday night which is a bit intimidating for the laymen. Still a fun time and cheep drinks. \n\nI would like to come on a different evening and check out the bar outside of honkey tonk hoe downs as its just one event of the week. Ambiance is cool too and not what I expected with a bar hosting a line dancing night.", "author": "Kristan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-21", "description": "I love this place! I've gone about three times and every single time was an experience to remember. Always good looking friendly people & great music. \n\nThis place is usually crowded since it's one of the few bars with no cover charge on Polk. Love it.", "author": "Ruth B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-18", "description": "I don't know what it is about this place, but every time I come here, I always have a great time! The crowd is great, the drinks are strong and the security guy out front is the sweetest! \n\nOnly thing... Thursday is country night. What the F?! Are we in Texas? Are we in middle America?! Why is a fun SF bar having full on, line dancing, country night? My friend and I came in on this wonderful country night, had a drink, and came right out. Hopefully this only happened once...", "author": "Anastasia N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-03", "description": "I don't understand why some people like this place so much. Maybe because I've only gone here on super crowded Friday and Saturday nights. You literally can't move through the bar without brushing against someone. It gets so stuffy and gross.\n\nHowever, it's not the worst bar ever. They play decent music, but no one ever dances haha. Probably because there really is no room to despite the large area. At least the drinks are cheap!", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-02", "description": "Went on a Tuesday night around 8p, not crowded at all. Was told by the *extremely* inebriated and angry bartender that we weren't allowed to order any cocktails on the menu, that he's only doing beer and shots. He said if we wanted a cocktail, we should get out. \nThey have cocktails menus all over the bar, unclear why he wasn't willing to do it. There were maybe 6 people at the bar, and an additional 20 scattered throughout the rest of the pub. It was not that crowded, just incredibly uncalled for rude and poor service.", "author": "C Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-14", "description": "DISGUSTING, ABUSIVE & UNPROFESSIONAL STAFF!\n\nI live down the street on Polk and decided to check this place out on a Friday night with some friends. When we got there there, was a small line but we got to the front in  a minute or two, and were looking forward to a fun night at a local bar. That was until I was confronted by the most rude, unprofessional, and disgusting bouncer I've encountered in my life. \n\nThe bouncer asked me for my ID, glanced at it for a second, and proceeded to tell me it was fake - mind you I'm 25. I legitimately thought he was joking with me so I said \"you're joking right\".. for some reason, that one really ticked him off. He came right up to my face (to the point where I could smell the alcohol on his breath, which is an entirely different problem), and told me to get the F*** out of his doorway. \n\nWhen I told him to take another look because I'm 25 and my ID is real, he grabbed me by the arm, threw me to the ground and told me he was going to step on me if I didn't leave the premises!  I don't care if this guys job is to bounce the door -  he has absolutely no right to physically throw a girl on the floor!\n\nNeither I nor my friends are EVER going back to McTeague's saloon... no one else should either until they:\n\n1. Teach their bouncers how to do their job and properly read ID's\n2. Understand that it's against the law to have their bouncers drinking on the job\n3. Fire the disgusting bouncer who thinks it's ok to physically abuse a potential patron for no reason\n\nThere are plenty of other great bars on polk with respectful staff, and really anything is better than McTeague's Saloon", "author": "Siiana A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-08", "description": "They insulted my Mexican hombre at the bar for ten minutes, all he was trying to do was get a drink...   they were yelling at him and telling him that we weren't welcome because of the language difference... All he did was stand at the bar for half an hour, patiently trying to get service....\n\n\nIm not returning, ever.\nI appreciate diversity.", "author": "Bryan V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-26", "description": "Cheap drinks with a very diverse crowd.  I came with some friends here on a Friday night and there was no cover.  There is definitely no shortage of guys here, but I guess thats pretty typical of the dive bar scene.\n\nThey have a bar up front as well as another bar at the back of the place.  The back bar is definitely less packed.  In the very back there are some hidden tables which is nice if you want to just chill with the people you came with.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-24", "description": "It pays to be a mellow, fun loving kind of chap at McTeague's. Why? The bartenders will remember you, treat you well, and they will be your best friends. Like best friends do, they are willing to back you up when the time comes.\n\nBy nature I'm a very relaxed guy. I like to watch football here for 6 hours and chat it up all Sunday long. A few weeks back though, I came as close to knocking out some teeth as I have in a very long time. A drunk, mouthy individual would not shut up. He just wouldn't, and he was directing his booze soaked ire to the left side of my face. For about 30 minutes.\n\nThe observant bartenders warned him. They told him he was pissing people off and needed to have a nice glass of shut the hell up. But would he listen? Nawwwwww, he was drunk. You know how that goes.\n\nThe bartenders who know me, know my demeanor, could smell something was wrong. The comments after the fact were that they'd never seen Justin like that before. I was ready to rip his head off. Perhaps me smacking his hand out of my vicinity and yelling point blank two inches from his face to shut the fuck up gave me away. I'm not positive.\n\nBefore I snapped and caught me an assault charge they 86ed him and sent his ass packing. That's good business right there, they recognized me as a regular and a fairly happy one at that. To evaluate and say hey, we know this guy and he's not like this. Something is amiss, we need to fix it. Well played, if it wasn't me that douche would have been pissing off another patron, I guarantee it.\n\nI calmed down about 10 minutes after he bounced. We had a shot and laughed it off. I tried to buy but they were having none of it. I explained the sitch to maybe 10 bar goers who approached me and said \"Dude... you were super pissed..... what did he do?\" Luckily it went no further, McTeague's had my back and vicariously that means if you're a good customer who doesn't start shit, they'll back you up too.\n\nI really appreciated that. Some bars will ignore and let the dust settle as it will. They treated me, a frequent visitor, with respect and remedied the situation before that asshole made me remedy it myself. I like McTeague's, and I like knowing that they care enough to take care of decent customers. I can honestly say I feel like they're my friends and I look forward to seeing their faces every time I roll through. \n\nMuch love Amber and Rick, much love. I'm sure Mr. asshole thanks you too, he got to keep his teeth.", "author": "Justin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-12", "description": "McTeague's is a great, not-too-divey, Irish bar. It's pretty spacious (try to walk all the way to the back if you plan to stay for a while!) with solid music options and friendly staff. On Halloween they had a candy bar and a lot of fun decorations (another reason to go to the back!). If you're wanting to show out-of-town friends a good time, definitely bring them here.", "author": "Elizabeth W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-03", "description": "Just one stop of many in Polk street bar hopping. The drinks are good and it's always crawling with people. I just hate how the DJ plays the songs where you actually listen to the end of the song where it gets real quiet and awkward before it begins to another song. It also gets really hot and smelly in here during the peak hours. Might come back with friends if we're bar hopping.", "author": "Helen J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-28", "description": "This place smells like vomit, BO, piss, and ass.  On weekends, it gets packed, shoulder to shoulder and there is no ventilation.  The floors are sticky and wet.  If you love all that, then I can't think of a better place for you.  I have been several times and the experience is the same each time.  No mas.", "author": "Victor C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-03", "description": "This place was great.  After a few hours of sightseeing, I needed to find a watering hole.  I decided to duck in here and see what was up with the opening ceremonies for the Olympics.  It was about 9pm when I went in and was pretty dead.  There were some people sitting around the bar and a few more sitting at some tables.\nMy drink was alright, if you like a super strong pour.  For my first drink, it was more than I wanted, but I drank it anyway.  Not one to waste a drink, you know?\nLoved the high back booths that make you feel like you're the only ones there.  I can see those working out well for a date night because they're dark and kind of intimate.  Several tvs were mounted behind the bar, 3 for the Giants game and 3 for the opening ceremonies.  As an hour went by, the place started to fill up and by the time I left at midnight, it was packed.\n\nBest thing about this place was the decor - eccentric is a good word.  There were all sorts of things hanging from the ceiling and on the walls.  If I were on Polk Street looking for a bar, I would definitely go here again.\nThe bartenders were attentive and this is definitely the place to go to chill with friends.", "author": "Samantha E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-25", "description": "Watch out if you pay cash, especially if you have an accent. Went here with two of my foreign friends, one Aussie and a Brit. We each ordered 3 whiskeys with Coke chase.   I was charged $21 and then the next was charged $31. Upon complaint, he was given $10 back, and thanked me because he had no idea the price. Then my English mate went up for THE EXACT SAME ORDER an was also charged $31. I told him to count his change and after he complained, the MANAGER!!! who served him gave him $10 after a death stare competition. \nNow, you tell me, what kind of legitimate bar makes the same mistake twice in a row, and admits so quickly that they were wrong??? I called him out on it, and was kicked out of the bar for backing my mates up. DO NOT PATRONIZE THIS BAR. If you do go, pay with card or know the drink prices. Its a big scam and the manager Simon is a scrub who cheats customers.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "I love this place. It always has the right vibe and the bartender who works the right side of the front room bar, Lindsey, is the best fucking bartender in the city bar none!", "author": "Raymond P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-21", "description": "Don't ever go here. I've been going to bars for so many years and have always kept my eye on my things and this place is a target for things to be stolen. In one night our group had three things stolen. A sweater, my leather jacket (I believe it it was people who asked to sit next to us) and even turning away for help with carrying shots someone took one of my shots for my friends. This bar is a target for theft and is frankly not worth it. Coming out of the bar a poor girl was crying about her phone getting stolen. I think the only reason why my bag wasn't stolen is because I was skeptical of these people sitting next to us and I moved it. When we informed security they could give two shits. Given the level of theft here witnessed in only one night I think this place gets targeted. Don't go. I don't often write reviews and this experience triggered one. I tried to talk to the employees and they weren't having it.\n\nSad. Don't spend a dollar here.", "author": "M B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-05", "description": "One star because of the theft problem.\n\nI, along with numerous others, had my phone lifted from my pocket last night. According to staff, this has been happening incredibly frequently. Quite a few girls are having their purses stolen as well. Be extra careful and aware or your surroundings while here. This has never happened to me before, and I'd consider myself to be very careful.  It's incredibly unfortunate that this is happening, as this one experience has ruined this bar for me.", "author": "Cara M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-11", "description": "Won't ever be going back here, taking any of my friends back here, or recommending to anyone that they ever come here for anything.\nWas enjoying a good time at the bar during Santa Con when some dumba** put his shoulder into me on his way out. Apparently his brother had earlier tried to dance with my girlfriend, who called his elf outfit gay (...we'd been drinking, lol).\nBefore I knew it the dude was all over me, trying to get a punch in, but I just held his arms trying to deescalate the situation while he tried to shove me. \nI ended up getting kicked out while the dude and his brother verbally harassed my girlfriend. She tried to tell the bouncers and bartender what was happening, who ignored her.\nI know Santa Con is a busy time for the bars, especially on Polk St, and they have to deal with a lot. But it was just unacceptable that the bar employees ignored my girlfriend while she was asking for help.\nLike I said, never drinking here again or taking anyone. And anyone who asks about McTeagues will get the absolute worst recommendation from me.", "author": "Nick G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "Me and my friends are always out at Mcteagues. It has a great crowd and great music with a dance floor.  A good open space to dance and chat. The drinks are not too expensive and the staff are nice.", "author": "Marian P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-10", "description": "Really nice open space with good music playing.  It was a good start to the night as we were there for the first stop of the night since we were out early and able to talk and socialize while there.  The drinks were served quickly.  Not sure on the pricing of the drinks but they were tasty and had good alcohol content.", "author": "Allison A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-07", "description": "Seeking a bar with a bigger dance floor, my friends and I were directed to McTeague's Saloon. Not quite the crowd we were looking for but I didn't mind the place at all.\n\nVery casual atmosphere with seemingly chill people. I mean, it's a pub. Very spacious and a pretty big bar area. Didn't get to try the drinks because we didn't stay long.\n\nDefinitely a bar to hangout in just to chill and catch up.", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "I love this place! I don't know if it's the throwback songs that play throughout the night, the casual atmosphere, or the fact that it's not skin-on-skin crowded. Approaching the bar to buy a drink is easily doable, something that cannot be said for every bar in the city. I had come here with a couple friends about a month ago, and brought some other friends two weeks later. We started our night here and my friends loved it! It was a great place to dance, get our blood flowing and get a couple drinks. The bartenders were friendly, and I love that there are two bars inside. Definitely recommend this place for anyone who loves a good dive bar every now and then.", "author": "Aparna T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-16", "description": "Standard bar. Drinks are not super pricey, nor cheap. I've been twice now, once on a Friday and once Saturday. Both times I've been the bartenders pour weak drinks. Make sure to ask for what alcohol you prefer and pay a little extra for top shelf. This place can get crowded. Standard crowd meaning 20-something....closer to the young end though. The music is current hip hop and pop. I cannot attest to what other reviewers said about pick pocketing here, so I am not sure. Word to the wise, never leave anything unattended at any bar and it'll never get stolen. Put your wallet and phone in a zipped front pocket. Easy.", "author": "Ms. F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-13", "description": "Wife and I went here last night (Thursday) to check out their country theme night. We just moved to the Bay Area from Texas and thus were thirsty for Texas bear and country music. McTeague's definitely helped quench our thirst on both accounts! As for music, they were playing all the good classics as well as some good newer stuff.\n\nDrinks were cheap and delicious! We enjoyed a few $3 Shiner Bock drafts and $2 Lone Star longnecks. They also have tacos and/or hot dogs for sale, depending on the night. Hard to find deals this good anywhere in the city!\n\nWe also met one of the owners (Chris was his name, I believe) who was super nice and generously offered us a drink on the house. We had fun chatting with him, and are happy to recommend his establishment!", "author": "Juan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "This is my new go-to spot on Polk St.  Fantastic location, great drinks, large venue, and reasonable prices.  A great place to stop in for a drink (or several) while you bar hop on Polk St.\n\nOn a separate note, these guys are very big on US Soccer and always have the games on.  They provide sound and tv screens during big games, and have a separate area in the back can be utilized if there are other games going on (Warriors, 49ers, etc.)\n\nWhen Jesus is around to make food, definitely order something!  He makes delicious tacos and charges very affordable prices.  Great bar food to munch on while watching sports.", "author": "Aalok P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-17", "description": "I saw people trying to play twister with the lights on the floor. Cus its big enough to play twister on the floor...\n\nCheap drinks. Bad decisions. Friendly bar staff. Good times.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-14", "description": "This review is good and bad. The good is for the bar itself. I walked in and it was very welcoming. They even offered to buy us our first round! Plus, the music they were playing was amazing. It was a great place at first. However, the bad is for the bouncer. I've never met such an ignorant man. He took my friend's ID (my friend being 23) saying it was fake, and proceeded to threaten him while calling him derogatory words. Not cool. We waited 50 mins for the cops to show up to get back the stolen ID. They called it in to verify it and it was indeed real. The bouncer then proceeded to tell the cops they were idiots and it was fake. Needless to say it wasn't a pleasant experience and now no matter how fun the bar may sound, i can't recommend it. :(", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "Super chill.. Open before most bars in SF... Steve is awesome!!  Good Irish bar. Pool table. Good times.", "author": "Tracy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-21", "description": "This place is shady as hell but I guess their choice of music isn't half bad. Spent a drunk night here, too.", "author": "Ruobin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-21", "description": "Super nice bar tenders at night and during the day. They're a soccer bar so they'll turn up the volume on important US games and I think they play EPL games even early in the morning. TVs line the wall behind the bar and there's TONS of seating. \n\nThis is also a great place to go at night if you're on Polk street. It does get really crowded but it's definitely worth it since there isn't any cover and the drinks are cheap/strong!\n\nBloody Mary's are hot, hot , hot! And they give you pickled green beans. Yes, please and thank you! \n\nI love coming to McTeague's and I'm hoping the American Outlaws will make it their new chapter bar.", "author": "Christine B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-23", "description": "If you want to get everything that matters stolen, come to this bar.\n\nMy friends and I came here for a fun Saturday night - by the time I left, I had my phone and debit card stolen. When I asked to speak to the manager (AFTER I was escorted out because I was \"too emotional\") all the security outside could say was \"he's inside and he can't help you.\" \n\nI actually had $500 worth of things taken at this bar, and I heard three other girls outside who had the same complaint. Management took no responsibility and said it was a common occurrence every weekend - personally, there are much better bars to go to where this sort of thing doesn't happen.", "author": "Mehr G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "Michael the bouncer or security guard outside is really cool. Had a good conversation with him. This place is awesome to be at during the USMNT games it's off the charts. Good fun bar doesn't seem to have anything bad about it .", "author": "Kyle R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-16", "description": "Made my first - and last - visit to Mcteague's last night. I agree w/ many of the other reviews. This place has a serious identity crisis going on. It's an Irish pub that thinks it's a night club of sorts. What sort, I don't know. 1990's rap and hip-hop music was blaring making it impossible to have a conversation, and the place was packed with wall-to-wall people, making it impossible to move. People were so intoxicated they were literally falling down, spilling their drinks, and subsequently the floor was covered in a mixture of various alcoholic liquids and broken glass. At one point I thought I was caught in the middle of a bar fight, but it turns out the wasted girl standing behind me in 5\" heels couldn't hold her liquor anymore and fell ass-first onto the floor, knocking me from behind in her descent. Not safe. At all. \n\nThey are definitely exceeding maximum capacity by a tremendous amount of people, violating fire and safety code(s) in the city. Trying to leave at 12:00A.M. was a nightmare. The crowd dynamics made it impossible to move, let alone leave the place. It was scary, and felt like I was about to be trampled. If anything were to happen, such as a fight, or misunderstanding between drunk people, the uncontrollable crowd dynamics would most definitely result in a serious crowd disaster. Over-crowded spaces like this can become dangerous places, if not well managed. Unfortunately, all of the 'security' was stationed at the entrance of the venue - not scattered throughout the bar, doing their jobs. They need to obey city code and stay within the limits of their capacity. \n\nIt was a weird, low-brow, sketchy, bridge-and-tunnel kinda place, with dynamics that could escalate into a dangerous situation, quickly. Keep your wallets, pocket books and any valuables close to you. Or better yet, just go somewhere else, anywhere else... you're bound to have a better experience.", "author": "Beckz K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-08", "description": "I came here for Halloween festivities and I was sober. This was obviously a mistake but it was during my 3month detox! I couldn't help it!\n\nLuckily, we were able to snag the little nook right next to the door and front window. It was sooo crowded and gross inside. Granted, it was probably because of the holiday, but it wasn't pleasant in any way. Also, the bathrooms are so tiny. There were only 2 stalls and clearly they get a lot of guests! This was not ok!\n\nI've been to some other places on Polk St, so I don't think I prefer McTeague's at all.. bleh", "author": "Erin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-09", "description": "MASS PICK-POCKETING OCCURRED HERE LAST NIGHT\n\nPROS\n- Minimal wait; can get in at midnight w/o question\n- No cover\n- Funny movies with subtitles playing\n- Well-drinks only $5\n- Lots of young adults\n\nCONS\n- Drinks are weak\n- Not good for dancing (lack of space and dance music)\n- No maximum occupancy enforced\n- 6+ other women & myself (relatively sober) had their iPhones stolen from their purses\n- No lost and found\n- Lack of desire by security to look into the pick-pocketing issue when asked\n\nNote to security: \n- Enforce max. occupancy \nYou described that theft happens \"all of the time,\" at your establishment, and yet have not taken measures to help alleviate it on your end.- even an announcement to the bar warning others and letting the perps know they are not welcome would have been a start.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-22", "description": "Awesome spot. The drinks are good and not too bad price wise. The place is laid back and casual. There is usually a little crowd of random fun peeps to grab a beer with. Very clean place and they take good care of maintaining it.", "author": "Jeffery H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-11", "description": "Had my Iphone stolen RIGHT OUT OF MY PURSE that was ON ME here. Although i've never had any other bad experiences here before...the crowd some nights can be a hit or miss. \n\nWatch your wallets and bags...thieves are all up in this joint", "author": "Yas G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-22", "description": "Met a bunch of German dudes in my stay in SF last weekend, and decided to party it up with them. \n\nThis was the first place on our stop, and it was crazy crowded. Also, total sausage fest, so yeah...\n\nAnyways, the drinks weren't too expensive, especially for SF standards. I think it was like $5-6 for beer, and $7 for shots.\n\nIn an attempt to represent our country, I accepted my German brethren's' challenge in drinking, and downed shot after shot of Jägermeister, all for America. \n\nI came out on top at the end, but my liver definitely did not. \n\nGreat place to start off the night, but at a 9-to-1 guy girl ratio, it won't be your ending spot.", "author": "Peter Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-27", "description": "I'm sorry McTeague's. I know people LOVE you- but I just can't get myself to do so- at least not yet.\n\nCame here after dinner with some friends as soon as the 49ers had clinched the playoffs. I really, really wanted to like McTeague's but the crowd totally turned me off. \n\nHere's what McTeague's has going for it:\n\n1) The price is right! For $16 we got two vodka soda's and a beer (maybe 2 beers- I didn't pay, so I'm not totally sure.) \n\n2) I LOVE the layout! This place looks like it should be a ton of fun! The funky colored floor in the back is straight out of a Michael Jackson music video (though on a much, much smaller scale.)\n\n3) Your bouncers are awesome. (Not as awesome as the bouncer at the Latin America Club- he's still my favorite) Totally friendly dudes.\n\nHere's what scares me about McTeague's:\n\nNow that I'm in the Tender-Nob, Lower-Nob, Whatever, the crowd is looking seedy. Fights are breaking out and I feel like a minnow surrounded by sharks. My friend and I started feeling a bit unsafe and left.", "author": "Annalise F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-29", "description": "Hell Ya! \n\nThe place to catch League Soccer. Plenty of Tellies.", "author": "Madhusudhan R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-19", "description": "Bouncers are extremely aggressive and unreasonable.  A bouncer kicked out my friend because she was drunk. I had just bought $40 worth of drinks for my other friends so I asked if we could finish them and then leave.  The bouncer got super aggressive when I asked this, and demanded that we all leave immediately.  No one else was drunk.  He actually shoved my female friend! No need to get physical, dude. I won't be going here ever again.", "author": "Cayleigh W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-27", "description": "My friend and I visited this bar for a high school reunion. For the most part, the bar tenders were very accommodating. The reason why I am giving this place \"2 stars\" has nothing to do with the bar tenders OR music. My friend lost her wallet in the bar, or got her wallet \"stolen.\" One of the bouncers/security told me he did NOT like me calling him \"sir\" when I respectfully called him \"Sir,\" put his hand in my face and dismissed me when we asked if we could check through the bathroom for the wallet. He told me \"In the same way you don't like me calling you \"sweetie,\" I don't like being called \"sir'\". I didn't know what else to call him! And I'm sure most people know it is not the same dynamic. As a woman I felt oppressed and disrespected. ESPECIALLY when he put his hand in my face and dismissed me. At one point, he even yelled down to me right at my face. Mind you, I'm a little girl, standing at 5'1, and this man was no shorter than 6 feet tall. Even other bouncers couldn't put their chests up and fully defend him because even they saw how wrong it all looked. But of course, they weren't going to let their guard down on me either. I understand that bouncers are hired for a reason and are hired to prevent confrontation and further attention. And at the same time, I do understand that bars are not \"liable\" for lost/stolen items but ALL WE WANTED TO DO was check. If not allowed to check, we would have at least wanted to be been treated with respect, whether or not the wallet was there. We felt very disrespected and almost oppressed for this reason. Turns out the wallet was found. A minute ago. At the venue. Thanks but no thanks bar hoppers. I would like to visit this bar again, as I am a NATIVE San Franciscan. But it will be a problem if the bar hoppers/security talk to women this way again.", "author": "Katrina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "Great casual bar for a beer & sports. Ok whiskey selection. Will definitely stop in again when I'm in the area.", "author": "Cody C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-01", "description": "You came here with someone? What a shame. \n\nEveryone here seems to have their eyes on the crowd, or at least that is the case this Hallows eve. There is something about costumes that makes the male species bolder....but not brighter. \n\nI had a string of awesome conversations here. And by awesome I mean awkward, creepy, and a little perverted. \n\nOne gentlemen told me and my cheerfully-buzzed gal pal that he's with child....going into a detailed account of how he was given a uterus and has been artificially inseminated. I vaguely recall this being the plot of a bad 90's comedy...\n\nThe next gentlemen tried his hand with an insult, telling us over the loud music, \"You girls look like perverts!!\" Oh, really? His friend then told us that we should stroke his balls. No, thanks. \n\nThen there was a very sweet man with a Pirate costume on, oh no that's not a costume? My bad. He told my (now beyond buzzed) pal that he once dressed up as a woman in college and was appalled by the way that men treated him in bars, and that he now has an increased respect for women. To you pirate lady-man: try bein' a lady in this bar!\n\nMaybe its the throngs of has-been greeks who need to get their fix of the drunken antics among the 20 something crowd, or the girls who like to be fondled by strange men who gaze into your eyes as they walk through the crowd. To each his own! \n\nMcTeague's gets 4 stars for entertainment on Halloween, but my college days were well lived, and I don't think this is the bar for me.", "author": "Jocelyn B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-12", "description": "Ah no......definitely not.  Stopped in at Mc Teague's Saloon at about 3:30 this afternoon, with a friend who needed to talk.  I spent a LOT of time listening.  Anyway, we sat at the far end of the bar, near the door, and the bartender finally got around to us maybe fifteen minutes later.  There was a small group of  about 10 people  circled in one space at the bar, seemingly watching one TV.  Other than that there were only two other patrons.  We were there for at least an hour, and the bartender never approached us again.  Even when he gave the check to people very close to us, he never even looked our way.  I was really hoping for another drink; it would have made the one sided conversation much more bearable.  When I got frustrated enough to leave, the bartender was at the opposite end of the bar, watching TV.\nWho hires these people?!?", "author": "janice s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-24", "description": "I'm not sure what the theme is here. I saw cowboy boots along with some other random things. It's nice that this place is pretty big, so we were able to fit okay in the back close to the other booths.  The bartenders were okay for the most part, except for this one guy (wish I got his name) who took so long to get me just a cup of water! He walked in the back to check the kegs and came back before he could get me water! It really is quick, dude. The music was pretty good from what I remember and it's nice that they have plenty of security guards walking around. I hate the disco ball in the back because it kept blinding me in the face.", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-24", "description": "Unpretentious and clean - somehow a hard combo for a not-fancy bar to hit!\n\nI actually wandered in here the day after a Giants game, and the place was clean and the staff was right on it. Add to that the fact that they still had a sense of humor, and I immediately added McTeague's to my 'safe places to land' list. \n\nAlso - nice bar, TVs have not TAKEN OVER through enormous size and oppressive VOLUME, and the barkeep was actually playing the jukebox every time commercials came on. Nice touches that make it possible to hang out...", "author": "K W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-01", "description": "There are....a lot of guys here. Yes, as others have said, total sausage fest. For the good part of the time my friend and I were there, we were the only females besides the bartenders. \n\nSpeaking of the bartenders....they kind of ignored customers and talked with each other while customers were waiting. Um, excuse me? At first we thought it was because they wanted to take care of the male customers first....but, nope....just stood there talking to each other. \n\nPretty standard prices for SF bars, $6 for Guiness on tap. Not too bad, but not sure I was thrilled about the atmosphere. May come back again some time, but we'll see. \n\nOh, interesting decorations though. I especially liked the Janis Joplin iconography.", "author": "Rowena L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-29", "description": "Hello bar!\nYeah, alright.\nIt's a saloon looking bar on Polk Street with average drinks at average prices. Sometimes there are sexy people here but not always.\nThere are TVs for ports watching.\nThere's a pool table in back for sporting.\nThey serve food sometimes.\nThere's a juke box\n\nYou can have fun here!", "author": "Alexander R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-08", "description": "Love this place! My friend and I were on a search for a young crowd, but not too kiddish or creepy. Avergae pricing, and a lit up dance floor (very small) in the back. \nThe bouncer told us to go to the back bar past the dance floor to get drinks because it was way faster, and it definitely is. No wait time at all and friendly bartenders.\n\nMultiple groups of guys come alone here, so of course the usual cheesy pick up line and ass grabbing is a given. Can be trashy groups at times, but overall crowded and a good time. Easy to get in, no wait or cover as well. I'd be back!", "author": "Leigh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-20", "description": "Big, chill bar on Polk street. \n\nI like Polk street, but I don't like crowds and douchebags. McTeagues is a great place to just hang out with nice and chill people. Bartenders are friendly & drinks are cheap. \n\nYou can watch football here (I mean the real football, where the players use their feet to advance the play, hence the name \"football\") even in the very early mornings as long as it's an EPL game or a World Cup/Euro Cup game (just make sure to double check prior to arriving here at 4am, as they do have their favorite and not-so-favorite teams, so sometimes they wouldn't want to open that early in the morning). \n\nYes, I like this place, I like the people and I like the drinks.", "author": "Helen D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-19", "description": "RACIST TO THE CORE!!! I would give a zero if possible. Some woman complained to the bouncer that we were shouting in her ear during a freaking WARRIORS final game and the bouncers kicked out my  friend and said \"she is a regular stay away from her\" . I have never experienced such racist and preferential treatment in my life every in SF. But this freaking place crossed all its limit. TRUST ME StAY AWaY FROM THIS BAR IF U R A PERSON OF COLOR . I still cannot fathom the shit they did to my friends.", "author": "Ripple K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-04", "description": "My friends wanted to go bar hopping on a Friday night and we found a perfect bar for our first stop of the night! McTeague's! I have never been to this place before, since I am rarely on this part of the city so I didn't know what to expect! \n\nLine was pretty long at 11 o'clock and we instantly thought we weren't gonna be able to get in! Lucky us the line moved fast and we were inside within twenty minutes!  It's pretty big inside! and the bar on the left was BUSY, but ordering drinks here was a breeze and $7 for a shot of Jameson?!?! Keep 'em comin!!! \n\nMost of the bartenders were extremely nice and generous, except for one girl who had an attitude towards a couple of my friends over a small misunderstanding about the drinks. I didn't get her name, but she was obviously giving my friends the stank eye from the other side of the bar. The bartenders in the back of the bar were nice and we got drinks there instead. We'd rather have our money and our tip go to people who deserve it :)\n\nOverall, we liked this place! Huge bar area & there are plenty of tables on the other side. Music was also a mix of different genres to cater to the very mix and diverse crowd here! 4/5 for McTeague's!", "author": "Glenn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-23", "description": "When I went last night (Friday) it was too crowded and there the male:female ratio was pretty terrible, like 10:1. Maybe on a regular weekday, the place is spacious like lots of people are saying.\n\nI liked the interior design and the random western props around the joint. I thought it was going to be more of an Irish pub but it seemed more western.\n\nPolk street is kinda weak compared to other streets like Mission St.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-26", "description": "Open on Christmas Day kind of a mixed crowd, overall not bad. Even thooo it's in the TL!", "author": "Robert O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-14", "description": "How do I love thee, McTeague's? Let me count the ways:\n\n1. The moment I walked through the door, an adorable handlebar-mustashioed bartender greeted me in a sincerely cheery way...YAY for cute boys greeting me cheerily;\n\n2. I have no idea what that music was that was playing on the jukebox, but, DAMMIT, it was good...ALL of it;\n\n3. The longer I sat there, the more I started to forget which decade I was in, which city I was in...it was like I was in Anytown, USA;\n\n4. My Hornitos shots were filled to the BRIM...to the very BRIM; and\n\n5. All around me there was interesting conversation upon which to eavesdrop.\n\nI have a feeling I'll be darkening your doorstep again very soon, McTeague's.", "author": "Valeria R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "This place is always fun to go to for a fun night out with your friends if you wanna go drinking and dancing. Service at the bar is generally quick. It's a pretty young crowd, looks like mostly college students, and generally more guys than girls on the weekend.", "author": "Cat M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-27", "description": "Oh McTeagues, with your crap mash ups and poorly placed soap dispensers, I am rooting for you. You are one of the the last douche-free zones on Polk.  Your watered down Bushmills must be exactly what my parents used to enjoy after my high school self had at their liquor cabinet. Yay Karma!", "author": "Delilah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "Stopped by McTeagues for football on Sunday. They had a bunch of TV's with a different game on each one. The place was not overly crowded, there was a seat for just about everyone in the bar. \n\nTo snack on we ordered the pulled pork nachos. They were really good, piled high with pork, cheese, salsa, sour cream, and fresh avocado. I would defiantly come back here for Sunday football.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-05", "description": "I saw a lot of McCrunk things happen in this place, but the Shiner Dark made it all ok. \n\nThis little Nob Hill bar is sort of a cross between a dive and a sports bar. They have a bunch of Texas beers on tap, which made a few of the Texans in our group more than happy. The dark environs made our fairly intoxicated group feel quite comfortable, and the interwebs-juke offered a bumpin' selection of songs, keeping the music-minded at bay. \n\nOverall, it's a place I could definitely pop into again on a bar crawl. A McDrunken bar crawl.", "author": "Don B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-03", "description": "What's a night of drinking on Polk St. without a stop at McTeague's for a pint of Guinness and a game of pool?\n\nIf you're looking for a laid back pub with tons of room, pool, and great beers on tap , then this is your spot. The bar here is huge, which makes getting a drink quick and easy. \n\nWhen you need a change of pace from the hipster dive bars that line Polk head to  McTeague's for a little Irish hospitality.", "author": "Tom L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-23", "description": "Good drink prices.\n\nLots of HD Screens for sports.\n\nDog friendly.\n\nDefinitely supports SF Teams.", "author": "Steven F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-16", "description": "And not just for Monday Night Football either! They hook up the free BBQ during Sunday games as well! Forget just the 99%, this is a deal 100% of the population can get behind!", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-21", "description": "Just One sentence: If you want to enjoy your Friday (you know what I mean) ... go there!", "author": "Reza T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-09", "description": "Came here after a work event with a friend and must admit the service sucked.  One of the waitresses was taking shots with customers a table over from me, while our actual waitress was nowhere to be seen (probably Miley Cyrus twerking in the back). \n After fifteen minutes of waiting I decided to order drinks from the bar.  Let's not forget the fact that it wasn't busy! The cool waitress who rips shots with customers didn't even ask us if we were being waited on--not a shocker.  When I asked the bartender if it's normal that the staff drinks on the job he responded \"yes\".  That's good to know?\nThe atmosphere wasn't bad though, normal diverse crowd, but the wait staff brings the place down.  Motto of this bar should be \nGood luck to the owners!", "author": "John L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-16", "description": "Watched the NFL Divisional Round Playoffs here and it was a great time. The bartender moved a table without us even asking. The place got crazy but the bartenders did a good job. I would suggest either pulling the barstools away from the bar to alleviate congestion or adding a few more bartenders. That S.F game was pretty nutty.\n\nI am dinging them a star however because of the food. It was quite possibly the worst food I have ever had. The chicken wings were by far the WORST wings I have ever had. They tasted like wings out of a microwave or something that Papa John's would deliver. I will definitely return on my next visit to SD but I will be sure to eat before going in.", "author": "Jack L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-14", "description": "Some dead celebrities on the ceiling, some complimentary BBQ ribs on the collapsable table near the door, and Shiner Bock on special 24/7. That is what makes McTeague's a righteous saloon. \n\nWhile it's mostly a destination for catching a football game, I actually respect it as a bar beyond just sports. The booths in the back are cozy and the bartenders ain't nosy. Throw on some NFL action and everyone is high fiving and smiling away. \n\nI'd take an hour or so here any day.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-02", "description": "Be careful- two of my friends have had their iPhones pick-pocketed here on different nights. According to other reviews, it's happened quite a few times before. Security suggests you \"wear your purse in front of you\". I won't be going back.", "author": "Elyse L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-13", "description": "The drink selection is not great, but there's usually a good vibe here.  Lots of space to stand around and chat, and barrels to put your drinks on.  Came here for my birthday and they have this wicked colourful tile floor in the back that we ended up playing impromptu adult Twister on.  Good times!", "author": "Letitia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "I like it Southern Style sometimes, but any day is a Shiner Bock day.\n\n\nThat's right. On tap.\n\nGetty-up N' Yee-haw.\n\nAfter that, get your people watchin' eyes out and shake it a bit on the floor cuz this place is PRIME for both.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-09", "description": "Fun bar with good staff. The 2 buck lonestar and country music on Thursday draws a nice crowd.  Not bad for sports on the weekend.  I agree its one of the last douche free zones on Polk.", "author": "Todd F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-17", "description": "Divey yet generally solid Irish / Texas bar on lower Polk in Tendernob.  Can become too much of a mob scene for me at times on weekends, but overall respectable joint.\n\nThe good:\n1- cheap drinks\n2- around a lot of other places (good location for barhopping / pub crawl)\n3- shiner bock\n4- has an \"Alex Smith #11 Sucks\" sign up at the bar\n5- closest thing in the bay area to Texas for Longhorn football watching\n6- near my house (file under: things of great importance to you)\n\nThe bad: \n7- can develop a slightly bro-on-the-prowl creeper vibe on weekend nights (Marina lite, I'll call it...)\n8- despite being a decently big place, it fills up (I guess this is both a pro and a con) and can get super crowded, almost overwhelmingly so\n9- like most places on Polk, McTeagues has like a 5:1 guy:girl ratio.  While you'd think this would be a plus for me, please see #7 above.\n10- $15 bar tab minimum, which at the McTeagues prices, you may or may not be able to meet", "author": "Molly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-17", "description": "For a dive bar, which I am not too big a fan of, I thought this place was pretty cool. They do NOT serve any food but you are more than welcome to bring food in. You can buy pitchers of beer and watch a game but they also have a seperate room so its not all about sports. I thought this place was pretty cool. Happy I went.", "author": "Brittini S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-27", "description": "This is a real old school sports bar for real sports fans. No (or at least not as many) poseurs here. Deceptively large with a lot of booths for you and your small group of cronies. Bouncers are nice and cool but do their job of keeping the peace and the waitresses here get it done -- they are able to keep it together in the largest of packed crowds and get you plenty to drink in record time (relative to other sports bars during a major event). Lots of staff to keep your tables clear of used glasses and trash. I like the oldish wood interiors and eclectic decor. And I love it that the bartender was able to make me a proper Manhattan with a brandied cherry that I ordered on a whim vs. the usual beer on tap.", "author": "Kate A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-21", "description": "Wife and I had a great experience this past Saturday.  We are in our forties so on the older side of the crowd but lots of fun people in the room.  The staff was over the top kind and very attentive.  We went to 4 other places in the area and all were OK but McTeague's was our absolute favorite and a big part of what we will remember from our trip to San Francisco", "author": "Julie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-08", "description": "I knew I was going to like this place. I took a class at SF State called History of San Francisco, and we had to read the book, \"McTeague\". I fell in love with the book and when I walked past this bar I thought \"I MUST GO HERE!!!!\n\nIt's a lot bigger inside that I thought. Plenty of seating is always good! There was also an electronic juke box which made me a happy girl. They don't really specialize in fancy cocktails, so don't try to order one. My dumb ass asked the bar tender to make me something creative with vodka and she said \"Um, we're pretty much a beer and whiskey kind of bar.\" And my boyfriend made the \"haha, my girlfriend is kind of a ding bat\" laugh. Oopsie. The bartender was a good sport and made me a cocktail that was pretty good. \n\nFor our second round, our bartender was this dude with a voice like Macho Man Randy Savage. He was freakin awesome. I asked him if he had read the book, \"McTeague,\" and he said he tried but someone stole the book from the bar. I plan on going back and giving him a copy. Anyways, he made me a strong drink and I liked him. He was nice, even though he looked like he could kick my ass.\n\nSo yeah, McTeague's was cool. I would probably go here with my beer drinking friends and not my vodka drinking friends though.", "author": "Liz M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-13", "description": "Thursdays is country night\nline dancing lessions they say they start at 7pm its more like 8.30pm\nnot great teaching it lasts for less than 10 minutes,hard to follow\nits a fun night ,spontenous line dancing breaks out every 20 minutes after teacher is gone,who knows what steps people are doing,\nits at the back bar\nbeer specials 2-3 beers $2 see the sign outside the bar,bar staff at front a bit slow\n\nfriendly bar man at back,quick service,\nwatch a few youtube videos before you go,so you will be an expert line dancer \nthey had hot dogs $3\nfun Thursday night,lone star beer $2,chumba beer not in stock,and dos equis$2\nment to have $1 tachos but not in stock,\nlook for coffin on ceiling,in front bar\nlots of tv screens in front bar", "author": "cc c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-15", "description": "To preface, I lived in Austin, went to UT and therefore bleed burnt orange. And barring a horrific experience, I will support any establishment that does the same. That said, my love for McTeagues extends beyond the Longhorn camaraderie: \n\nPros\n- Shiner on draft, Shiner black (or blonde in the summer) and Lone Star--all of which are on special during football games\n- Super chill vibe most of the time...a great place to settle in, have a couple of drinks and catch a game\n- Bartenders are always nice; not always looking to chat you up, but timely in taking drink orders \n- Solid BBQ and other food on Mondays and for special events\n\nCons\n- It can get a little nuts at night on the weekends...and it's a pain to stand in line.", "author": "Jenn G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-08", "description": "I really liked the inside when I went here. A lot of space, eclectic decour. It had a very strange quality to it, especially with the big golden teeth. But the bartender was drunk and didn't seem to know how to make a drink. The service was just pretty poor. Maybe I'll give it another chance on a busier night. That's when it seems to thrive according to reviews, but my first impression wasn't a good one.", "author": "Dexter H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-01", "description": "Well! It was nice to look up and see Kurt Cobain waving from his coffin on the ceiling. So 4 stars for the right there, and for a $4 pint of Sierra Nevada, though it wasn't the best tasting Sierra I've had pulled from a tap. \n\nThe barkeeps were lovely and the interior is nice and spacious, and even though they took an existing nothing of a space and sprayed a can of \"YeOldeMcOlde\" on it, it is somehow not too bothersome.", "author": "Gwynnie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-29", "description": "Unique interior that speaks the word \"fun\"! Although it looks small from the outside, this place is fairly big and is a great place for a group gathering. The last time I was at the bar was on a Friday night after work (around 8pm), and there was hardly anyone inside. Perhaps too early?", "author": "Amy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "McTeague's is the place to be for US national team soccer matches in SF. They put the matches on pretty much all their TVs with sound, the bartenders respect and love the fans (as opposed to those that treat US soccer as an afterthought or hassle), and they ring their bell whenever we score!\n\nThey have tons of room, reasonable prices, and it makes for a great atmosphere to watch our teams play.", "author": "Casey P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-11", "description": "My friends and I stumbled upon this place walking along Polk. It was late afternoon on a Saturday and we wanted somewhere to hang out before dinner. First impression: they made strong, cheap drinks! I had a cranberry vodka and a Long Island while my friends enjoyed a few draft beers. Our bill for six drinks came out to about $30. A budget-friendly bar!\n\nThe bar had a good vibe, too. Crowd was mixed and everyone was pretty chill. I liked the \"old San Francisco\" feel with the decor.", "author": "Cynthia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-26", "description": "Finally found a legit sports bar in San Francisco!\n\nI randomly stumbled into this place on a Saturday afternoon because my boyfriend was looking for a sports bar to watch college football and McTeague's definitely delivered!\n\nThere are multiple HD-TV's and the bar tender was very accommodating and gladly changed the games on each TV based on what people wanted to see. \n\nThe reason this place is getting 5 stars is because of Jesus' BBQ! McTeague's offers donation-based BBQ prepared by Jesus (their chef) that is simply delicious! Be sure to tip to Jesus! He's the man!", "author": "Martha N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-25", "description": "I'm not knocking this place in any way- it was an adequate stop in our Friday night barhop. But nothing stood out as being special- no good music, no great drink specials, etc.\n\nI realized I forgot my ID while in line and explained to the bouncer. (I'm clearly over 21 and the man I was with had his ID, and was too.) The bouncer was definitely curt about it, and I had to take a cab back to Hayes Valley to get my ID. (We were meeting my sis in law there) \n\nThey recognized me when I got back in line....for my trouble, they could've kicked me a free drink or something, but no. :/\n\nI wouldn't return, honestly. Very loud, noisy, crowded, can't walk type of place.", "author": "Ashley P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-18", "description": "I love McTeague's!\n\nHow much?  Yesterday I drunk texted my friend and thanked him for introducing me to the bar.  I don't think I've ever done that before in my life.  He was extremely confused and asked how drunk I was.\n\nThursday Night:\nPretty empty.  They closed off the back room due to the lack of patrons.  Plenty of available booths/ seating to the side.  No cover.\n\nFriday Night:\nSo crowded there's barely room to walk.  Is this seriously the same bar?  I don't think I've ever been to a bar THIS crowded.  Still no cover!  Back room is open and there's apparently even a place where the floor lights up in multi-colored blocks.\n\nFRIDAY WINS!  (Play Rebecca Black song \"Friday\" here.  And down that jager bomb like a champ.)", "author": "Fei L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-20", "description": "Me: \"do you have the big ten channel on satellite?\" \n\nThem: \" Yes dear and we have your vodka tonic and bathrobe waiting at the bar with your pipe\" \n\nMe: \"Are you showing the Purdue game?\" \n\nThem: \"Of course master and we have all of the Irish playmates that you pre selected in the ball cage lubed up with raspberry as per your instructions\" \n\nMe: \" I asked for Brazilians \n\nThem: \"fixed, oh and the donkey did not agree with the price you quoted\" \n\nMe: \"Oh well, at least tell me that JuJaun is starting center\" \n\nThem: \"Leads the league in scoring he does sir\" \n\nNot sure where we are going with this but I wasn't wrong about the Dutch in the world cup and I promise you will see the Boilers in the final 8 at least. \n\nI asked them if I could \"Boiler up\" and they conceded. Not many places that will do that for you.", "author": "Dru P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-18", "description": "Lone Star in California?  SOLD!  Well, almost. \n\nThis is any bar U.S.A..  Great pub-relaxed atmosphere.  Big bar, considering its location.  Lots of T.V.s to catch a game.  They also stream Netflix, and sometimes when the bartenders are feeling friendly, will take requests. \n\nPool tables, bar music...you know the drill.  Good first stop for a night of bar hopping.  But I wouldn't write home to mom about it.", "author": "Claire G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-27", "description": "McTeague's is a great place to grab a high ball after work. \n\nI like the classic interior. A nice sturdy wood bar, pool table, plenty of comfortable space. It's a great place to go with friends. If you're alone or in the mood for mingling it's good for that too. The crowd is usually a good mix of ages and types so, whoever you are, you will likely strike up a conversation with someone cool. \n\nI drink cocktails with club soda and I've been poured countless flat drinks, but I've never gotten a flat drink here, so the drinks are great too. \n\nCheers McTeague's!", "author": "Slim P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-27", "description": "The Polk St. version of Kels Irish Bar for me and my friends.  Maybe a little more mellow because of the lack of dancing...\n\nGood moderate priced bar you can find yourself in on Saturday in jeans, but still dress up in heels in you feel like it.   Can get pretty crowded, and its always a guarantee you will make some new friends.", "author": "Cassie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-14", "description": "I came here on Friday night to buy my darling Phil a beer, and am glad to add it to my list of \"Places on Polk.\"  Oh, I didn't make that list yet?  No matter, because I will.  \n\nThis would be a great place to have some sort of I-spy game at it (done after consuming one of their many beers and doing some shots- at happy hour prices, of course).  I spied a skeleton, lots of pretty bottles, cozy booths, a pool table, good crowd, a nice bartender, an ATM, and...a few other things that I'm not going to reveal because it would ruin my chances of beating you next time we come here.\n\nWhat I did NOT spy was a kitchen, despite the fact that they had food items on the menu.  When I heard a telltale \"ding,\"  I figured that must be it.  \n\nNot a bad place, and I believe they take plastic which is a bonus for me as I never carry around cash.  I heard some people had some trouble with the in/out door, but that tends to happen when people are drinking.\n\nI will probably be back...someday.", "author": "Pam S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-29", "description": "If you want to be treated like you're in Vegas, come to this shithole. And by that, I don't mean treated like a high roller, I mean treated like a talking wallet. \n\nIf you want to hang out in a crowded hallway filled with people, go to McTeagues. \n\nIf you want to have the lights turned on at 1:20, this is your spot. I was moved from one end of the bar to the other a HALF AN HOUR before last call. All I wanted to do was finish the beer that I paid for, wasn't making a fuss, wasn't beligerent. It was me and my girlfriend in a booth finishing our very full drinks. Some dickhead tells us to put our drinks down and leave. I look at my watch and he says,\"don't look at your watch, get movin'.\" \n\nI've been here a few times and every time has been mediocre. The place has no vibe, good or bad, looks like shit and is too crowded.\n\nOh, did I mention that they charged a cover and then pushed everyone out 10 minutes later? What a fucking scam. \n\nMediocre everything, over priced. Honestly, they've fooled me enough times.", "author": "Jay C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "Ay me lads, Howerya on tis fine day?? Lemme give ye the craic on this place. I was brought along with my boyfriend and his cousin for their coworker's going away job celebration. It wasn't what I expected, not like your average bar. This seems like a place where you can unwind and just have a drink or so. I thought there'd be dancing but there wasn't anyone dancing...well my boyfriend danced anyways trying to get me to dance too, thought he was cute that night for doing so. We also saw a group of people bringing in their own pizza...if I'd known better I'd bring my own food too.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-04", "description": "I've had mellow happy hours here (my favorite), I've had not-so-mellow raging good times here with dozens of new best friends, multiple shots, cocktails and pitchers of high quality beer...it's a cavernous space, great for large groups with strong drinks for cheap (my go-to drinks are almost always lighter in color than most places and it's definitely not due to extra ice), and it's also just a nice spot to chill after work.  It can get really crowded at times, but I've never felt claustrophobic when it is.  \n\nEntertaining decor on the ceiling, great music selection (whoever played the bluegrass version of \"Gin and Juice\" during a commercial in Game 1 of the World Series here, I salute you) and they even have food now - everytime I go here, I find something new to rave about.", "author": "Sus... B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-05", "description": "Just came in and loving it. It is 4pm on a Thursday, I am working thanks to free Wifi surrounded by great music, lovely environment, and lovely bartenders:)", "author": "Duygu G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-30", "description": "Stepping into this bar felt like I was traveling back in time to a frat party.  The place was packed and I was served beer in a plastic cup.  That may have had something to do with a 49ers game, but I suspect not.  This is not a place to kick back for a casual conversation but rather to get loaded and eventually have someone in your group puke and be escorted out.  I'm sure that's the MO of a lot of folks there.\n\nThis would be a stop on a bar crawl but not a final destination.\n\n(Maybe I am just getting too old for this scene.)", "author": "Marcin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-01", "description": "8 bucks for a shot of JB and a tap beer? That's not good. You know why? Because for a chill 40 bucks, you've got 5 beers and 5 shots. \n\nIf you can take that, you belong at AA, not McTeagues. \n\nThe rustic interior has so much western influence that screams like a first generation Chinese born in Walnut Creek: Am I White or am I Chinese?! I'm so confused!\n\nBut, it's more of a \"Am I Irish or am I Texan?\" It sort of feels like \"I really don't belong in SF.\" Then you see the red lighting everywhere and it looks like a scene out of a vampire movie http://static.px.yelp.com/bphoto/Iv8htFzevvuRaHKfcEGq6Q/l\n\nSo what it is, McTeagues? Irish, PWT, and into dark magic?\n\nThe bathrooms, however, are incredibly clean and the atmosphere is very chill. The dead celebrity/hippy coffin drawings on the ceiling are fun to stare at http://static.px.yelp.com/bphoto/NLqGSBzTuUDjZA9UTyhI1Q/l and the bartenders are good conversationalists. I love the solo pool table that hogs the spotlight in the rear.\n\nMy verdict is to use this place like a brothel... It's good the moment but there's better elsewhere.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-31", "description": "I first found out about McTeague's when one of the owners emailed me to reach out on behalf of the bar to offer to host an event for the Texas Exes, my alumni group.  I decided to check the bar out to see what it could offer, as our current game-watching location (Blue Light) was offering us nothing except a convenient place to watch our games.\n\nUpon walking into McTeague's, I found a very spacious spot with comfortable surroundings.  The place is Irish & Texas-themed, as one owner is Irish and the other is Texan.  I got to chat with Chris (the Texan owner) and found out he wanted the bar to be a home for us Texas Exes.  The bar had a lot going for it: Texas decor in the back room, Shiner Bock and Shiner Black on tap, and 2 smokers to cook up some BBQ.\n\nWe decided to hold our Christmas party at the bar to test it out.  Chris cooked up BBQ for our group that was pretty tasty... and yes, it was really Texas-style BBQ, not that crap California-style stuff.  Everyone who attended liked the space, the food, and the drinks.  There was a decent crowd, but there was plenty of room to walk around and mingle, unlike in Blue Light where you get packed in like sardines and struggle to get a drink.\n\nOverall, I love the spot and plan on having future Texas Exes events there.  It's also in a nice up-and-coming area on Lower Polk.  Chris is laid-back and really easy to work with.  I also hear they do free BBQ on college football game days.  Next year, they are planning on adding another couple of TVs during football season.\n\nThanks, McTeague's!", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-06", "description": "Had a pubcrawl here with friends for a charity.  They kicked me out because I had a money bucket in my hand.  I used to like this bar, but their managers are pricks and I will never give them another dollar.", "author": "Becky S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-05", "description": "I always skip over this place in favor of the Hemlock down the street, but since the Hemlock got rid of its pool table, the place just isn't the same. So we hopped on over here to shoot, and I was impressed. Aside from having a pool table, the bar itself is spacious and I love the open floor contrasted with the intimate booth seating.\n\nGot a vodka cran and it was $5 and tasted like cranberry juice. Eek! I asked the bartender (a guy whose name I forget but who was rad regardless) if he could spruce it up a bit, which he did gladly. In fact, after a few more sips, I had to request more juice to even it out. \n\nMy friend left his glasses here on accident, and when we called, they found them and set them aside. What great people! I'm sold.", "author": "Natalye R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-10", "description": "yess i've been looking for a place that reminds me of pb bars in san diego!!\n\nfinally finally finally.  i went out polk st for the very first time over the weekend and this was our second stop.  i went with two of my friends and saw some friends inside...\n\none of my friends was in crutches and heels + we weren't wearing much because we had just left manor west = a lot of attention from random people...\n\nbut you know how girls are.  we didn't really want to talk to anyone else... so what did we do??  tried to convince anyone who talked to us that we were crazy...\n\nby obsessively talking about fraiser... except it backfired because this one guy loved fraiser.\n\nokay this is weird.  it was just a humorous night because we had this little game going on so i was laughing a lot.  \n\nmore about mcteague's itself... no cover to get in.  there was a line, but it was pretty fast because people were coming in and out.  bouncer was nice and so were the bartenders.  they were fast -- yay!  there's $15 minimum on cards though :(\n\nbutttt my birthday is this weekend and i think i want to head over to polk for some day drinking (:  maybe start here.  or end here.  or just stay here.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-12", "description": "My friend had her iphone stolen there. The security did absolutely NOTHING to help out even though we pointed out the theft. By the time they reacted the thief had reached the streets and the security said they can no longer do anything. The management should do something about this. Ridiculous!!!", "author": "Deniz A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-26", "description": "This is one hot spot to visit if you are bar hopping on Polk St.\n\nDrinks are cheap, strong and it's always super packed on Thursday or Friday nights!\n\nThe bartenders here are nice and super generous, so tip them well! \n\nWe never have a boring time when we visit McTeague's!", "author": "Christina T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-26", "description": "There is something really sketchy going on at this bar. My friends and I came in here for no more than 10 minutes. I myself was completely sober. I had my I phone stolen right out of my purse, and a few days later received a call from my bank that there were fraudulent charges on my credit card. This was the last place I used my card. I tried to talk to management and was told \"Sorry your phone was stolen\" then they proceeded to kick me out. I got upset and tried to talk to the bouncer and he was laughing \"Girl your phone got jacked you can't come back inside\".... All I am saying is avoid coming here if you care about your belongings!", "author": "Hanna D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-24", "description": "Salute to McTeague for the best time (to drink) and for the worst time (to get kicked out).\n\nThis is my usual hangout bar after work. You can't complain about this place at all - a pool table, tv's, BEERS and LIQUORS. Of course the fun hangout moments. Good times.", "author": "Edmund L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-23", "description": "I asked for a Jameson and coke. I got a shit ton of Jameson and a little coke. For 6 bucks. Instead of the usual 8. UHM I'm a happy girl.\n\nThe bartenders are fun. And funny. I love to flirt with them. I love their kick ass attitude. I love watching the cute scene boys play poool. And I love meeting people here.\n\nI can easily stumble my way home. Plus.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-02", "description": "San Francisco Bars!\n\nCLEANLINESS: 4/5\nSERVICE: 4/5\nDRINKS: N/A\n\nCame here one night with a group of friends. This place was packed! The atmosphere was cool. I didn't expect much from the bars here in San Francisco, but this place was pretty cool. Although there were a lot of people, you can still breathe inside and it wasn't so hot either. They also have some table seating, which is nice.", "author": "Desmond C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "If you're in your 20s, this is far and away the most happening bar in the city.  I've had consistently great Friday and Saturday nights here all summer.", "author": "Augman L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-15", "description": "Wonderful place. Big size , nice people and music. I usually walk the place to its other end, I kept walking and there was always another area, dance floor, another area and finally some nice couches and tables towards the end. Will visit there more often.", "author": "Neeraj A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-05", "description": "The place has a pretty cool aesthetic but is way too loud. Also, their drinks are weak and overpriced. I don't mind a packed bar, but the acoustics of the place made the noise unbearable. What's more, the layout makes it really hard to maneuver when the place is full. In the main area they have a step up to a row of booths. They have a bannister along the step, 3 feet from the booths. If you sit down here, when its crowded, you will shortly have people standing immediately next to you doing an awkward butt shake at face level. Forget about trying to maneuver your way back to the bar, you have to navigate the shoulder-to-shoulder people and the bizarrely placed  and oddly long bannister. This place might be nice if you're looking for a drink on a Tuesday afternoon or something, but on Saturday night it's hell.", "author": "Theresa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-27", "description": "It's a good sports bar with lots of HDTVs. Too many dudes, though. It's big, but it's mostly open floor space (and not a dance floor). There's a second bar and some booths in the back, which is nice, but there's no smoking room.\n\n5:1 Guy:Girl Ratio + Lack of smoking room (I'm gross, I know) = -1 star. Other than that, a great place.", "author": "Eliot R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-12", "description": "Wow, has this place gotten popular! Lately the lines outside are just insane. My friends and I decided to go last Saturday night after a dinner and we had not been in months. It has a good ratio of men: women, only I saw way more women this time. As you walk in, it looks like your typical saloon, no you will not see fur trappers, cowboys, soldiers, gold prospectors, miners,  gamblers, or rango. You will see people actually pretty dressed up for this place.\n\nIt's always full to where you bump into everyone, and hard to get to the bar area to order a drink. There are booths on the sides and has the western feel to it. There is a separate room in the back with another bar and you have to walk though a mini hallway where guys usually stand against the wall like hawks to see all the women pass by or the occasional couple who I just want to tell them, Dear couple intensely making out in my way, get a room, tsk, tsk. If you look closely at in the back there are more hidden booths. \n\nI always have a good time here, theres only a juke box, which is good, but if you want more upbeat it's not the place to go for dancing. The prices are reasonable, last time I bought my friend a beer and I had a vodka tonic and it came out to be $10. So we proceeded with shot, shots, shots, shots and started to speak in another language, loudly, and that's when we knew we had too many. The drinks here are a million times better than at Mayes next door and there is no cover. \n\nI met the owner the other day and asked him why they do last call at 1:15am, and he says because it is too full and the cops pass by. Everyone was kicked out by 1:45am, uber lame. Rewind, 30 min before, there was this douche who had a champagne bottle and starting dancing champagne showers and got all of us soaked. Thank you big and scary bouncers for kicking him out, much appreciated!", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-29", "description": "Shots of tequila are generally always a bad idea.  Thank goodness for Henny.  That sugar makes the medicine go down...  Quick service... 20-something crowd (why AM I HERE, AGAIN?)....dark...lots of teles (can always catch some Texas game...).  This place is A - IGHT.", "author": "Hiromi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-27", "description": "This place is really cool, fast drinks, friendly bartenders, lots of TVs and places to sit.  The fellow drinkers are affable and into sports as well.  I think they serve food here also but they didn't mind when I brought my own sandwich in and ate it at one of their barrels (lol, they have barrels set up as tables to add table space without taking up a lot of room).  This is a very comfortable bar with lots of good people to drink with and watch games at.  I'd bring my mom here.", "author": "Brandon E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-25", "description": "Stopped in there this Saturday noon to grab a couple cheap brews based on reviews. Cool atmosphere but the bartender charged me $3 for a $2 Lone Star and looked at me weird when I didn't tip him due to the forementioned. I didn't bother sticking around for long after that.", "author": "Nate C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-02", "description": "I can't say enough great things about McTeagues.  It has become my go to place in SF for drinks and to watch games.   They are now showing the Sharks playoff games with sound as well.  Management and the owner are terrific and very accommodating as well.", "author": "Lara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-07", "description": "A nice, chill bar on Polk and usually standing room only -- a good place to grab a few beers but on a Friday night was tough to hear my friends -- so, not the best spot if you want to have a pretty consistent conversation.  Otherwise, the feel of the place is pretty good, and although it was crowded, it still didn't feel thaaaaat crowded.  A-ok.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-28", "description": "I went here Saturday night.  I generally don't go to bars this far from home (about a 10 minute cab ride) but the girls wanted to go.  Turned out to be awesome.  Somewhat packed but not like you're bumping elbows with people.  Lots of great Halloween costumes spotted as well.  Good drink specials, everybody had a great time, and the bar layout is great - it is wide enough that you can actually see across the room, talk to other people and easily get up to the bar.  Will go back again.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-26", "description": "Definitely a decent dive bar on Polk. STRONG drinks, cheap beers, dim lighting, and that smell of a bar we all love. A good place to watch games when other places are slammed too. I never decide to come here but also don't mind when friends suggest it. \n\nThey also have a cool set of paintings that show dead people standing above coffins on the ceiling such as Kurt Kobain, Jimmy Hendrix etc.. so look up next time you are there!", "author": "Mike K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-15", "description": "Man, my head has been way up my ass to not stumble across this place until now. Really cool bar! Reminds me of any countless bars in the East Village/ 3rd Avenue in Manhattan. It wasn't very busy for a Friday, but I hear that Fridays in the city aren't what they used to be. Whatever.  Definitely coming back here during college football next year...", "author": "Jim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-22", "description": "Really my favorite bar in SF...When I first moved to SF three years ago this was my spot since I lived in Nob Hill--Great for watching sporting events, late night drinking...everything.\n\nWhy did I wait this long to write this review? Well because last night I went again and remembered why it is my favorite bar. First, I asked them to change one of the tv's to a volleyball game I wanted to and they did right away without giving me a hard time.\n\nThen, it was my friends birthday and they made sure to help us order a specialty shot for her to enjoy.\n\nWe were there earlier (7-9) and it was easy for us to enjoy be around the tv and for us to enjoy watching the game.\n\nAlthough late night (10:30-11PM) the place will start to get really crowded and is not really my scene (I enjoy chill places where you can sit and enjoy beer and whisky). Overall this is a great place to be anytime during the day/for watching a game. Or if you want a fun packed night.", "author": "Jon W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-31", "description": "if you wanna brodown it doesn't get better than mcteagues. unfortunately the aforementioned broing down doesn't really do it for me any more. It's pretty crowded there too despite it's cavernous size.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-11", "description": "Plus another star for happy hour being from 12-7pm...\n\n$3 mimosas and $3 Guiness? What????? Amazing.\n\n-1 star for not having a back patio.  It does get pretty dark in there.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-14", "description": "Pushy crowds, frat-tastic flirts, and angry drunken girls who threatened me in the bathroom because I apparently took too long. As in, tried to break in and hit me. It was difficult to have a normal, even civil, conversation. The highlight of my experience was getting a seat at the bar (which almost got hijacked by a lone middle aged man) with my friend, and chatting it up with the door guy while waiting for our other friends to enter.\n\nThis was an evening in the life of me when I ventured to McTeague's the other night. I've been here for St. Patrick's Day, random weeknights, and the busy Friday or Saturday... it's always seems busy, which is good. The bartenders are cool, but geez... I get panic attacks and can't stand being crowded. The crowd on said Friday night was particularly unruly, and as a rule of thumb, I dislike any small-ish bar with a line (and believe me, I wouldn't have come if it was this busy upon entering).", "author": "Kristin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-09", "description": "this place is frekain awesome!!!\nI gotta say they have freakin' great specials on Saturdays (for college football, and continue onto the night) \nthat, and i don't know if its a \"TEXAS bar\" but i was there for the UT v. T-Tech game ... yeah the one where they lost in the last second, and the safety jumped the route... yada, yada, yada.... \n\nanyway, it was pretty dead at the time, but in the evenings, it gets pretty busy.  decent TV's, i think they have ~5, and one was set to pig-hunting (interestingly enough)\n\noverall, i love this place because its a good balance between a place where i can go and chill and watch the game, but also can go and stay out all night there too!", "author": "Ken T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-09", "description": "2 dollar lone stars!  Can't complain there. Bar has a cult texans following. Get ready for some football!", "author": "Tommy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "Regular pub with tacky stuff on the walls nothing too special about it.  It has nice booths.", "author": "Matthew P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-21", "description": "I like this place, it usually has a good crowd and good beer. Today I thought the beer wasn't cold enough. Trumer Pils and Stella were served a tad too warm for my taste. Some beers may be better at 45 degrees, but not these IMO.", "author": "Thomas M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-13", "description": "Friendly bartenders. Great and roomy setup. Wide and quality draft beer selection including Batch 19 and Shiner Boch.\n\nLone Star State of Mind: If you're a Texan missing Texas music or just a fan of Texas music, this is your place. Big supporter of University of Texas sports - not a big deal for me, but good to know. $2 Lone Star.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "If your looking for a good bar for your Polk Street \"Let's Get Drunk and Regret What We Did\" Crawl between Red Devil Lounge and your final stop, Lush... McTeague's is the place to go. \n\nIt was 9PM when we rolled in - expecting to chill - there was about a trillion people there (really...a trillion)...no dancing really...just strictly standing room only drinking. Although, I did see some booths, all of them were filled up super early on for a Saturday night.\n\nThere seems to be some noticeable favoring there tho...I ordered the same drink as my friend...and, although I didn't mind AT ALL, there was like 5 times the vodka in mine than hers.\n\nJuke Box was filled with oldies and goodies...no real top 40 madness which is nice and refreshing when you know just one block away you can get your top 40 groove on at Veritgo. \n\nAlso has darts and one pool table for the gamers in a separated room from the main area.", "author": "Katy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-19", "description": "This place is crowded as hell on the weekend. The bartenders, Curtis in particular... gods. All of them. The place was just remodeled in the back and looks FANTASTIC! \n\nBig selection of beers, tons of hard liquor, good prices, awesome music. What more could you ask for!?", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-22", "description": "I came to this pub hoping to find an atmosphere reflecting that of the book. The large tooth outside of the bar was promising, but inside, there were no distinguishing factors from the novel or movie. \n\nThe interior is spacious, and tastefully decorated as an Irish pub/ saloon. Disappointingly, they did not serve Anchor Steam beer, but they do have pitchers of beer for $12. While I was inside of McTeague's, I heard the bartender kick out two people for not having an ID, and that may be one of the reasons why the bar was so empty.", "author": "Emily B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-10", "description": "It's in a great spot on Polk, the drinks are decently priced, there's no cover charge - but good goddamn is it crowded. If you try to go in any day except M-F, they'll have bouncers at the door and a line down the block. It's a college spot, so beware. Other than that, it's amazing! Very cozy and the regulars are friendly.", "author": "Cecilia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-09", "description": "I am here so often I have to give this place 5 stars\n\nGreat location near tons of other bars this is my go to bar. Its a great place to meet new people or go with a group of friends. \n\nAge range: 21 to 28 approx\n\nIts a big place and gets real crowded which makes it fun. Not too hard to get a drink\n\nThursday to Saturday are the best nights here\n\nNo dancing.\n\nHappy hour is also unbeatable", "author": "James B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-27", "description": "I gotta give this place a serious shout-out.  About as good as it gets in my book.  I haven't been on a Friday or Saturday night, but when my softball team strolls in on Monday nights, they ALWAYS hook it up and are some of the friendliest bartenders I've ever had the pleasure of buying a $2 or $3 LONE STAR from.  Yeah, that's right, Lone Star.  Get some.\n\nAs for the ambiance: good amount of TV's with sports on, cool artwork, and laid back pub atmosphere.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-13", "description": "Came here mid-week with a friend. She is from Texas, went to Texas and  loves Texas. This is the place to go if you need a Texas fix. \n\nI have to say I was not a Texas fan until after I hung out at McTeague's. That place is the place to go if you are a Texas fan. I believe the owner went to Texas. Any the place is decked out in Texas gear, as well as items that make me think of the west. It is definitely the traditional kind of bar. It is definitely spacious and really cool. \n\nThe beer selection is pretty decent. I was happy they had blue moon on tap, and that seemed to suffice. Their prices are reasonable. There really wasn't a crowd there, but I hear it can get busy on the weekends. Definitely a place I would come back to, to catch a football game or a hockey game.", "author": "Diana R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-25", "description": "I'm a huge UT fan, which is strange coming from a California girl, so I can appreciate this place a little more than most people.\n\nStopped in after a few drinks at Hemlock, because McTeague's happens to be one of our friends FAVORITE places ever.  The place was packed, the mood and atmosphere was alright, but I'm gonna go ahead and say I wasn't drunk enough to really enjoy myself here.\n\nThe drinks weren't too bad, decent beers on tap, and not too expensive.  The wait at the bar was a little longer than I would have liked, but understandable.  No soap in the girls bathroom left me cringing every time I walked out and back to the bar, and yes the jukebox that night played Tik-Tok three times in less than an hour.  WHO DOES THAT", "author": "Madison B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-09", "description": "What can I say this place is AWESOME......  Its a friendly local bar that draws 20-30's peeps.  Note:  the best night is hands down Friday night, since peeps come here to drink and mingle versus Saturday which is kind of pre-drinking spot before going to the final destination.  From what I've seen, people usually go here before going to Mayes (next door).   The crowd is really laid back and friendly, some people are dressed up and the rest are in jeans/tees.  They have 1 pool table in the back with several sets with various games on.  Ratios are usually pretty good here, like 50:50, very outgoing crowd, so if your anti-social and need a hardcore dive bar, then this isn't your place.  The crowd is a mix of ex-marina, North beachsters, and Russian Hill peeps... Major bonus since there arent any hipsters (sorry Mission peeps, but try Hemlock which is down the street).   Drinks are moderately priced.  Plus, a major bonus is that it doesnt take 10 hours to get 1 drink (ummmm like some places, I wont name, the hell with it, ex Mayes, lol).   \nOverall, cool place if your looking for a fun, mellow crowd, were you can meet new people and down some decent brew..", "author": "Mike M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-23", "description": "As I'm in here 3+ times/wk, I haven't a clue how this has not been reviewed...\n\nSince I've lived in SF, some of my most memorable nights have happened here...bf asking me to move in, obama's inauguration, bumping into my first bf from FRANCE at the pool table (Wtf?), many a reunion of college friends...\n\nPool table, booths, huge bar, good barkeeps...McTeagues continues to deliver some of the best times to be had in this town", "author": "Gabrielle J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-07", "description": "McTeague's makes me McHappy! \n\nIn one week's time I'll have completed my move to The Loin and will officially have inherited McTeague's Saloon as one of my local bars. I couldn't be happier. A far cry from the Bus Stop, this sports bar has large flat screen TV's, a long and spacious bar, and a pool table in the back for all you billiard players (or for people like me who like to play and just make fools out of themselves). The crowd is diverse and friendly.\n\nI'm looking in to my Loin-like crystal ball and I see lot's of beer, sports and fun in my future!\n\nP.S. Holler at me for #300!!! Woooot!", "author": "Julia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-11", "description": "Correction:\n\nI have been to McTeague's Saloon 4 times (Thanks Janney...you are a great editor!)\n\n4. Ali's fabulous birthday (so fun Ali!)", "author": "Angelo F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-28", "description": "A big, gold-painted molar hangs from the outside McTeague's sign and that should have been clue enough for this English major.  However, it's been a long while since I read McTeague by Frank Norris....\n\nSo, I've been by McTeague's Saloon many times but never popped in until a rude bartender at Route 66 caused me to look afield.\n\nBad news first:  Even an hour after opening, and allowing for the TL-redolent air circulating through, the saloon retains an unfortunate (but probably Gold Rush-authentic) spilled liquor and old mop water smell.  But that's the worst of it.\n\nGood news:  The old-timey setting, generous seating, artwork (look up), good range of bar selections, and a courteous bartender willing to mix up a drink as requested left me with a favorable impression (even if it is yet another big sports bar).", "author": "Poet D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-27", "description": "McTeague's is a downright fun bar and I'm surprised I don't come here more.\n\nPlanted on Polk, it rounds out the line of watering holes pretty well on this street. Casual, easy going and basic, but it still has it's own unique feel.\n\nIt's a wide space, with a weathered floor and long wood bar that has seen its fair share of tipsy. Those who man the bar are on point as well. It was packed on Friday night as we came to celebrate a friend's Birthday, but we never waited more than a few minutes before we were attended to.\n\nThe crowd really makes this place. Down to earth, beer drinking folk, all looking to find the laughs of the night, and find the route that will at some point lead them to a basket of fries at Grubstake.\n\nDrinks are cheap and you don't need to don the designer threads to mingle.\n\nGood times. Very Good Times.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-16", "description": "Good ole' McTeague's. My bar-of-choice for the first stop (and sometimes last stop) of any Polk Street bar hop. I love the vibe this place has. Amidst a sea of flashier bars typically packed with the type of people that take themselves just a bit too seriously, McTeague's offers solace to thirsty twentysomethings who want nothing more than chill a atmosphere to kick back with friends and enjoy good beer at good prices. Plus, there is often plenty of seating, a lively, young crowd and cups and dice for your occasional drinking game. Overall, McTeague's is a great place to spend a Friday or Saturday night if you're looking for something fun and not too crazy.\n\nThe only -1? McTeague's gets very crowded at around 11:30 on weekends, so either come early or come prepared to feel a tad claustrophobic.", "author": "Joseph F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-18", "description": "Awesome place! The bartenders are nice here. The girl bartender didn't charge me the minimum because I didn't know there was one for putting down a card. Dark and homey. Great neighborhood bar. There are TVs, and a pool table. Great happy hour deals. Dog friend too!", "author": "Katie Anne N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-10", "description": "Great cheap drinks. I like blacking out here because I always wake up in a bed that's not in jail, and I always still have my wallet, phone, and keys *knock on wood*.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-23", "description": "I love love love this bar! it has such a fun environment and the drink prices are very reasonable. \n\nThe only thing is it gets super packed so you should get there early! \nbut they have an extra bar in the back so thats pretty convenient.\n\ncash only so stop at an ATM!", "author": "Victoria G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "Popular bar on Polk St. Its wild on the weekends, but during the day its pretty quiet, and has plenty of tv's to watch sports. Its a cool Irish bar with some Longhorn fans. However, It's a lot different at night on the weekends. The bar is packed on the weekends with twenty and thirty year olds that have not left their college days too far behind them. They are either working and would love nothing more than to spend their money on alcohol or they are unemployed and would love nothing more than alcohol. The lines can get a little long here, but its usually not too bad. There tables in the front, booths in the back, and some drink tables in the middle. No cover. Drink prices are average.\n\nOn another note, I came here once with my good friend, the black out queen. She has somewhat recently retired that crown, but she occasionally shows glimpses of her glory days. Today was one of those days and we could not be happier. At some point during the night she decided that paying for alcohol at a bar just doesn't really make sense. So, she got herself a beer glass, reached over the bar, and poured herself a glass from the tap. We paused...looked at her...and rejoiced in sweet, sweet victory. Somehow, she skated by on that one and I've never had a more satisfying beer. And I think at this point, my black out friend believed this was how bars worked now. So, she casually went back for more and she should not have. The bartender went off on her. We stood huddled together like little school children being scolded. Our eyes scanned the floor as if we were going to find our lost dignity down there. But, we didn't get kicked out. So, another plus because of cool bartenders!\n\nAnother bar that my black out friend did not get kicked out of.", "author": "Arthur C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-11", "description": "Ahh what can I say, this is my secondary local only because I don't live near by. But its my first & usually only stop when I hit Polk street.\nI watch the World cup here & the atmosphere was awesome. \nVery friendly bar staff who know there stuff.\nThis is a true bar in all sense of the word. \nIt may look & feel like an Irish bar from the outside but subtle hints let you know its more southern, with Irish flair. \nI notice the Texas longhorns are floating about the joint, but I won't hold that against them.\nGo Tide!!!", "author": "Jennifer R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-28", "description": "The Tender-Nob..... a neighborhood torn between classy and trashy. McTeagues comfortably borders the two neighborhoods, bringing in a crowded collection of the best of both worlds. A salon with a strong personality, stiff drinks, and sweet deals. Here you'll find a  dark, wide bar full of classic rock and colorful characters. With $2 beers and $4 well drinks - you can sip in the lively atmosphere without blowing your budget. The bar is well staffed - drink wait is short and service is attentive. Giving your more time for you to enjoy the many flat screen TVs, pool table, or jammin juke box. \n\nNext time your partying on Polk - make it over to McTeagues for a TenderNob treat!", "author": "Caroline J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-30", "description": "So the first time I came in here, I wasn't quite sure what to make of an irish/texan bar with giant teeth hanging from the ceiling. I decided tho that for being 5 o clock on a bright sunny day, it was dark enough to feel right at home. \nThere was quite an eclectic mix of people which I always see as a good sign because usually that means its a bar that makes everyone feel comfortable, which it does.\nIve been back since with friends to play pool at night and it was a consistently comfortable bar with good beers, friendly bartenders, sports and all the things required of a good local spot.\nHere's where I must rave about this place. The first day I came in famished from having not eaten all day. Scribbled on a piece of paper taped to the cash register was a sign saying \"$5 chicken tacos\". Then I see a man in the corner with a set up that looked like he brought everything from his kitchen. (Which now I would gladly welcome any day) I wasn't too sure this was going to turn out well cause I can be a bit of a food snob. Anyway best effin tacos ever! I've dreamt about theses things several nights since! The kind gentlemen even made ours after he had already quit for the day. So if you get a chance, they're a must!", "author": "Vickie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-22", "description": "They need to fix their jukebox or something. If I hear the Ke$ha Tik-Tok song one more time, my head might explode. It played 3 times in 40 minutes on Friday night. \n\nIt's a Texas bar, so I can't hate too much. Any bar with Shiner on tap is A-ok by me :) I usually have fun when I go here, but usually like to start the night here rather than end it.", "author": "Krystha B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-01", "description": "Don't get me wrong, I like this place but it looks like someone ordered a \"Pub in a Box\". If they manage to stay in business for a decade or so it will eventually acquire the authentic patina of grime it deserves.\n\nI was on my way to another bar when I walked past this place, popped my head in and asked the bartender if they allowed dogs. While the bartender was telling me that dogs are OK I noticed David Allen Coe was playing on the jukebox. SCORE!\n\n\"Hey Katie, call Gwynnie and tell her there's been a change of plans. I'll be back with Matilda.\"\n\nSo now I have my best girl (Katie) and my best drinking buddy (Matilda) in a bar that plays twang bangin country music and waiting for some good friends to show up. What's that, they have Shiner Bock on tap? I haven't had a Shiner in about 20 years and now that I've got that out of my system I can wait another 20. Racer 5 on tap? Oh hell yeah!\n\nWhen I settled up my tab it was an embarrassingly  small amount. \nYOU HAVE NOT SEEN THE LAST OF ME!!!", "author": "Lance G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-03", "description": "Let's face it, anywhere on this Polk Street strip of bars will have a somewhat marina/douchebag/fratboy contingent. However I think McTeague's is a little less so than other options! It has a lodge-sports bar like feel. On a Friday/Saturday night you will be shoulder-to-shoulder and probably won't have luck getting a table. So try their happy hour on weekdays or a Saturday afternoon. With a vast beer selection, its a great place to meet up with friends. \n\nIf you end up on Polk Street when a bar crawl has gone terribly wrong, swing into McTeague's Saloon from some relief.", "author": "Halley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-19", "description": "This place reminds me of the Kells in Seattle and that's probably why I liked it so much. Places like this on a Saturday night...you just have to be in the mood for. Anyway, we came here for our night our in San Francisco on my bachelorette party weekend. \n\nWe immediately scored one of the large seating areas by the front door. They had great beer on tap here and really good shots. It was also only a short cab ride from our hotel off of Market Street. I'd definitely come back here!", "author": "Cathy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-14", "description": "this place is pretty fun besides the preponderance of guys.. but then again it is SF. \n\nThis place doesn't have cover... constantly crowded... just imagine a really really large and crowded dive bar where you have to push and pull in order to get anywhere...\nDrinks are cheap and if you come with a good group you can easily have an amazing time for a fair price here.", "author": "James H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-16", "description": "This was my first time at McTeague's--that I can remember--and it was pretty fun. The drinks were reasonably priced and there were just your standard drinks. What pretty much makes this place is the ambiance and the people go there. It's a pretty chill environment and it easily gets packed. There wasn't anything exciting that stood out, but I definitely recommend it as a place to stop when going out or a place to include in a Friday or Saturday night bar crawl.", "author": "David L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-04", "description": "So, this guy looks like every over-the-hill jock villain from every 80's movie. The lil' curly \"man bang\" he's using to try and cover his receding hairline is bobbing up & down as he does the robot while he's mocking my friend, and it hits me...this is a pretty shitty place to grab a drink.\n\nI've been to this bar a few times, mostly during the last World Cup, and it was ok. I didn't think it was anything to write home about. The drinks sucked, and the beers were way too overpriced. Now, during the night time setting, just jam like God knows how many, yuppies, douches, and jobbers into that same lack-luster bar setting, and what you have is what we affectionately refer to back East as a \"Hot Mess\".\n\nI don't require much from a bar. And yes, there were more than a few pretty girls there, but good luck trying to holla at them. It's was too jam-packed to even get to the bar, let alone stalk some pray. No sir, these are not the hunting grounds you're looking for. \n\nI don't know what my friends thought of the joint. They were three sheets to the wind, with their beer goggles strapped on tight. I'll be surprised if they remember even being there. I know that bars in SF tend to be a touch crowded and overpriced, but honestly, you can do a lot better that McTeague's. xD", "author": "Shirrod R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-06", "description": "Really like the bar staff at McTeague's. They're very personable and chill. The juke box was a nice touch too-they even take your pics and display them for the night.", "author": "Amanda V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-28", "description": "My new favorite spot in the city. I was walking around Polk looking for a bar to kill some time before a show across the street when I spot a sign for Happy Hour that boasts $2 Lonestar beers. Cha-ching!. Love Lonestar and really miss Texas a lot so this was a win win!\n\nWalk inside, dark enough but not dingy. Big Texas Longhorns flag on the ceiling. Paintings of Kurt Cobain and Hunter S. Thompson and Racer 5 on tap. Boondock saints and sports on the big screen tv's.\n\nIf you're a man and you're reading this and not drooling all over yourself. I'd be willing to question you're sense of manliness!", "author": "Tony C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-08", "description": "Solid choice, especially if you enjoy beer.  They've got a pretty good selection of beers on tap, which during happy hours and Monday/Thursday Night Football were $3, and even when it isn't a special it is still reasonably priced.\n\nMcTeague's is a good place to go if you're with a group of friends, or if you just want to watch the game.", "author": "Matt N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-26", "description": "Great place and atmosphere. A little crowded on the Friday night that we went there but great place to meet people and the bartender there (the woman) was fantastic", "author": "Allan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-23", "description": "Times are tough out there folks.  Especially if you've moved out here from Texas and have yet to get used to the insane prices of the Bay Area.  Luckily the owners of McTeague's has a bailout for all the beer drinkers from Texas (and anyone else who wants cheap Texan beer).  $2 bottles of Lone Star all day every day.  That's right, no matter when you walk into this place you can get a $2 beer.  Want to spend more?  They also have Shiner Bock, and Shiner 100 on tap and Shiner black in bottles for a little more.  Cold Texas beer at cheap prices in a great bar in San Francisco?  Now that's some change I can believe in.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-14", "description": "I really was having the most excellent time here until a friend pointed out to me that out of the 14 of us in our group 5 of us, had glasses that were either cracked sideways, horizontally that is, or vertically, or had broken glass inside or outside of our drinks.  And no that is not a good thing.\n\nSo maybe McTeagues needs to invest in some need drinkwear.  Macy's is known to have great sales.  I got a whole bunch of good beer glasses on sale from my wedding!  Maybe it's time for them to stock up.  5/14 aren't good odds I would think. \n\nOther than that I was having a blast.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-28", "description": "Happy Hour from Noon - 7pm.  Really, do you need anything else?\n\nOk, here goes - McTeague's has a fantastic selection of beer that is priced at $3 a pint during happy hour or $11 for a pitcher. $11 for a pitcher of Shiner Black? Yes please!\n\nThe spacious bar also features a bunch of flat screens (they had the Champions League on Wednesday afternoon when we walked in) in addition to a pool table and a dart board in the back. This is definitely a great space to start an evening of hard drinking. \n\nOne star off because I had to teach the bartender how to make a martini. But really, McTeague's is all about beer. Wait, is it noon yet?", "author": "phil h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-23", "description": "Was there for a Giants / 49ers game on 10/18 .... great atmosphere and prices for food and beer seemed reasonable .... place was hopping with both the Giants and 49ers playing. Seemed like a good spot to watch sports in the lower Polk St area.", "author": "F J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "Pimp Step Bernard is headin over 2night! Fresh butt ready to be touched by all and only males.  Look for the THOTS and pimp step will be there, butt ready.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-28", "description": "I like this place.  They have shiner bock on tap, along with about 100 other beer options.  So, this will definitely be go to beer place.  The booths are nice, especially if you just want to meet up with a few friends and catch up. \n\nI think this place really depends on when you go.  It gets really busy on weekends and can take forever to get a drink.  It's a little too popular with the early twenties trendy crowd slumming it on lower polk on the weekends for me.  But, early weekend nights and weeknights, it's a decent place to grab a beer.  I would even give it four stars for week day happy hours.  \n\nBut, it's definitely not the place to go to meet people.  Everyone comes in groups and hangouts with their own group.  No one really chats it up at the bar or anywhere else.  Hence, why it's a great place to catch up with friends, but not so great if you want to get out and talk to people.\n\nOverall, this place is a solid local bar with an amazing selection of beers (on tap and not).  The bartenders are friendly, but don't except anything more than a nod when it's busy (which is fair since they are so busy).  I wouldn't order any specialty drinks here.  This is a basic pub.  You order beer or gin and tonic or vodka soda.  You don't order anything more complicated, it won't be good. I'll go back, but only on certain times and certain days when I really just want to sit and have a beer.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-23", "description": "It had booze.\nIt had booths.\nIt had an ATM.\nIt had a lot of dead space.\nIm sorry... I cant say anything else remarkably good or bad about this place. \nTotally non descript. \nIn fact this place was a bit of a drag... \n\n(... thats a small hint for my next review...  ;-P )\n\n[Bar #4, 9 pints down]", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-11", "description": "Great place to watch Sunday football! They have plenty of drink specials, great prices and lots of seating. There are about 6 TVs above the bar and if the game you're looking for isn't on the bartenders are really nice about switching the channel for you.\n\nThe bloody mary that I got was pretty thick and had a ton of spices in it. Not the absolute best I've ever had (a little too heavy on the spice) but certainly not the worst. I'd give it a 3.5 out of 5 stars. One thing that  I cannot stand is a watery bloody mary and you will definitely not get that here! \n\nI'm looking forward to coming back and trying McTeague's at night as opposed to Sunday at 10am!", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-21", "description": "Best nostalgic juke box, every song made me feel like a teenager\ngood beer selection, but i was doing booze, nice, stiff and cheap\nand the bartender was super friendly and kept coming around, didn't once have to catch his attention, he was on it.\nand then when i thought this place couldn't get any better i looked up...", "author": "Jacquelyne M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-22", "description": "Pretty empty on a Saturday afternoon, even with it being the jumping off point for CrawlSF's Polk Village Bar Crawl. Unfortunately, the $20 card minimum is enough to sway an otherwise positive experience in a spacious bar with good looking guys*, tasty gin and tonics, and a big fan at the entrance that is overly conducive to drunk and windy Vogueing. \n\nWaitaminute - $2 shots that taste like pink grapefruit gummy candies and are called pink tacos? I've never had lesbian tendencies before, but I certainly slurped a bunch of those down. YAY PINK TACOS!\n\n*When I say it was empty, that's because it was. Those good-looking guys came with us, 'cause that's how we roll. My group of 15 wasn't just a part of the bar crawl, we WERE the bar crawl.", "author": "Devon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-19", "description": "The Marina meets the Mission - younger crowd, but cool bar!", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-05", "description": "No, it's not in my neighborhood BUT, they've got anything you might possibly want to drink AND they will let you bring your food in as well as your dog.  The regulars are solid and the staff is dope.  Pool? Ball-game? Internet jukebox? Quentin Tarantino films?...They all exist here for your enjoyment.  For those trifled by the weekend madness, the weekday nights will satisfy your needs...so don't be shy.  Now, if I could just move it a little bit closer to my apartment, this place would be perfect.", "author": "Katrina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-06", "description": "I don't frequent many bars but Mcteague's may change this fact.\n\nIt's hard in a city like San Francisco who prides itself on having many fine establishments to find one bar that you want to go more than any others.\n\nBars are like shoes for me.  I have a lot of shoes for a guy, but I like to wear them all depending on how I feel.  Mctegaues just might be my new favorite pair of shoes.\n\nThe bar is long but wide.  It never feels too crowded but you can pack a ton of people in there. I went here twice two weekends ago, which never happens.  I had a great time both nights.  It's on Polk and Sutter so if you need a change of scene shoot over to R Bar and do some people watching.  If you feel like dancing hit up Vertigo.", "author": "Adam L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-04", "description": "I must've put in $2937492374923 into the juke box and it never played my damn songs.  \n\nI've been here twice, nothing totally stands out.  The front door guys are always super nice and friendly when checking my ID.  I don't know how much drinks are here because I've yet to pay for them on my own.  Last night (Saturday) a bunch of meat heads and douche bags were there.... but they were all generally pretty friendly.  It's a pretty decent sized space but can get super crowded (St. Patty's Day).", "author": "Walerz B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-13", "description": "Came here for the Lagunitas beer week event, otherwise I would have never ventured to this area of town. This place is HUGE. The bartenders were friendly but didn't seem super knowledgeable about the beer. I really enjoyed the intimate booths and live music, hell even the free bbq was nice. As a vegetarian I at least got to partake in potato salad and cole slaw, both of which helped the copious amounts of beer we had enjoyed that day. Not sure if I would return as Polk St isn't my kinda people but maybe for another beer event.", "author": "Cori W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-28", "description": "McTeagues eh? \n\nWent there four times last week after work for a beer. They have plenty of TVs for sports, plenty of draft towers for beer, plenty of bottles on the bar to make stiff mixed drinks and a damn cool decorated interior. \n\nMcTeagues is a very comfortable watering hole during the day. I really enjoy this place and will most definitely be going back as often as I can. \n\nWhat I didn't like was the ambient volume inside this place on a Friday night. Holy blown out ear drums, it was nuts. Maybe I'm just to old but I prefer McTeagues during the afternoon for a ball game and some beers. \n\nOther than that, I recommend McTeagues to anyone. \n\nGo Cubs!!!", "author": "Wayne B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-30", "description": "Great Bar. Great Space. Tons of seating (booths, tables). Tons of standing room. TV's to watch any sports event. Lots of locals for people watching. Pool Table at the back.\n\nNote*  Dont be fooled if I ask to get in on a game of pool...Filipinos have a natural gene to hustle in a game of billiards =)...many have be deceived.", "author": "Gladys D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-19", "description": "I live in the neighborhood and enjoy stopping in during the week, or on the occasional weekend afternoon to watch baseball and eat a burger from Sliders on the corner.\n\nThe bartenders are always cool and there's enough televisions to catch any important game that might be going on.  Even had a good time gambling on the national spelling bee one evening!\n\nGood prices on their beer during happy hour.", "author": "King O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-23", "description": "Came here for Halloween so can't speak to its usual action.  Spacious and didn't have funny smells, good enough for me.  It seems popular with the residents.  I only came here once when I was a resident.", "author": "Erika C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-07", "description": "I love this bar.  Seriously, love at first sight, or first drink maybe.  This place is clean, there are two bathrooms for women, the juke box music is solid, AND the drinks are cheap.\n\nI still prefer Bigfoot Bar, but I'm sure you'll see me again at McTeagues, especially because drinks are only $4 post happy hour...and I am cheap...", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-23", "description": "Nothing like some cheap busch on Polk Street!\n\nThe first few times I went here I didn't think the place was that special.  The only selling point for me were the $2 Busch cans.  The place was too crowded with balding white guys for me.\n\nThen, reading other reviews, I found out that this place is owned by Irish-Texans.  The decor came to life for me.  I understood the randomness of the pub decor and saddles.  Also the tribute to the fallen angels of our time above the bar (R.I.P. Kurt, Hunter, Rick, Janis...) is something that no other bar has.\n\nTo seal the deal on my continued business to this establishment, I had to try the raved about happy hour.  They serve $3 pints and $11 pitchers of... not Coors... not Busch... rather Stella, Shiner Bock, Anchor Steam and everything quality you can name from noon-7pm.  And it just happened to be during the BCS National Championship where they serve FREE bbq during halftime (for all college games)!!!\n\nIf there is a must-see game on TV, I would highly recommend dropping by during happy hour and watching the game on the array of flat screens.", "author": "Joey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-17", "description": "I came to watch the Woman's soccer game and it was the perfect place to do it. Not crowded at all, great crowd, and great venue. Also nice that you can bring outside food in", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-28", "description": "You may be asking yourself so why oh why did they need to open up another bar on Polk Street? Well there are many reasons but I can give you 2 good ones--a) Polk has the highest concentration of bars on a city street in San Francisco and it has to maintain its title and b) as a general observation (myself living in this area on and off over the last few years) I've noticed that Polkers--regardless of age, lifestyle choices, gender, income racket, you name it--seem to take a liking both alcohol and gatherings.Over opening weekend I saw many Polk regulars from all walks of life come into get a feel of the \"new family member\". Judging from everyone's reactions I can assume that it will be a welcome addition to the already active nightlife. \n \n The bar's namesake and itself is a nod to a character from Frank Norris' McTeague and to an era of San Francisco history almost forgotten (thrillist.com has more on the history of its origins both the novel and the building itself). Thoughtful decorations like the lamps, a wagon wheel on the ceiling, the high dark wood booths with thick lacquered tables and a long bar with plenty of libations quickly add to the gathering spot aura this place has already acquired. This place makes the most of its length and can definitely accommodate more than a few healthy sized clans. There is a pool table in the back (with some plush seating there as well) and apparently they plan on hosting music there at some point. For now there is a jukebox with a picture of Marilyn Monroe resting upon it. Staff members I met seemed in the custom Polk fashion of being cordial if not down right friendly.    \n\nThe selection at the bar is a healthy one. I counted at least 20+ beer taps (with minimal repeats). Popular local favorites like Anchor Steam and Prohibition Ale were amongst those present and the LARGE display of liquor set along glass shelves, against stone brick work, led me to believe that they can cover more than just the basics. Someone mentioned something about a menu but I didn't see one. Regardless of that one quibble I can say that this place has a lot to offer. Go while it still has that new bar smell to it.\n\n2 more quick things: they open at noon (earlier than most of the bars in the immediate area) and during the week Happy Hour is from 12-7. ($3 drafts,$3 wells seems to be special). Plus Friday afternoons around 4 or 5 have an extra bonus, free food. Last week's nibbles were smoked spicy chicken drumsticks and they were as big and good as you'd expect at a friend's BBQ. Yummy!", "author": "Veronica G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-17", "description": "I like me some liquor.  Maybe a little too much.  But I still like me some liquor.  Do you like you some liquor?  Here's to our no-nonsense drinking spot.\n\nThe drinks here are stiff and definitely get the job done.  All the bartenders are highly experienced (at least the ones I've met) and that means if you treat them well they'll remember and return the favor.\n\nThis is a great place to come and watch sports, kick it with friends, play pool and have yourself some drinks.  And more drinks.  And then one last one before you hit the road [but not driving of course]  Its a really big place and usually has plenty of room.  If you come on a friday or saturday night it is definitely more crowded then usual but still has ample room.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-05", "description": "I love the dark, wide space that takes me to the back of the bar without obstruction on a busy Friday night, also the booths and tables that line the wall offer plenty of seating, so the seat-vultures aren't hovering over you, waiting to swoop on your chair the second you get up. It's great!\n\nCool bartenders. Stiff drinks. Sweet jukebox. Great beer deals.", "author": "Deanna T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-23", "description": "I've been here a couple times, mostly to watch Giants and 49ers games. It's pretty chill except on weekend nights it gets pretty packed. There are lots of TV's, you can bring outside food in if it isn't slammed.  They have a good amount of seating. Cool place to just hang out with some friends and get a beer.  **They do have a card minimum**", "author": "Jen O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-12", "description": "I happen to like McTeague's. I'm not sure how (because it isn't exactly my usual style of bar) but it turned into my go-to spot. With that said, I was surprised by how much fun I had the first time I went, and the time after that, and the time after that, etc. In fact, I continually have a good time there. It may be that I hover in the back near the pool table, and feel genuine joy when someone finally picks a good song on the juke box. Or, it may be that if you are easy to please, this is the bar for you. Lots of good beer to choose from, and even if you have to wait a second, the bartenders are normally pretty nice and make up for it.\n\nI also like that the mix of people here is generally different, and most people are willing to get a little chatty over a game of pool. It makes it feel fun, without the awkward one-pool-table-competitiveness-vibe overwhelming everything. This bar is hard to peg...you can't really pin down the crowd with a generic catch-all, but that makes it pretty easy for you to blend in and have a good time with the people you came with.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-20", "description": "To do it right: $17\n\nLook! An Irish pub.\nEight dollars for one Bushmill's?!\nLet's get Chinese food.\n\nSummary: Regrettably, McTeague's is haiku-able.", "author": "Troy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-24", "description": "Love this place! Tons of space, good beer, big TVs, and awesome staff. Bartenders are cool and remembered me after one extremely busy football night. Owner is great (found my money in the bathroom and gave it back to me)! Can't complain about this place.  Plus you can go anywhere on Polk to get food to go and bring in the bar.  Well not just on Polk but you get the idea.", "author": "Devynne H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-26", "description": "I'd have to give this place different levels of stars for going at different times. I've been to McTeague's at night on the weekend, and I wasn't really feeling it. It was really packed, and it was hard to get a drink quickly.\n\nHowever, I've been there for happy hour on Friday, which had free nachos (!) and my friend and I easily found a place to sit and relax. Then it's a really laid back bar, with a good choice of beer, and a good option for hanging out and talking with your friends, especially because they have booths. I've also been there at 8:30 on a random Monday night, and even though it was almost empty, but to me, it's more enjoyable during the off-peak hours, because you really get to enjoy the atmosphere of the bar, and see then I start to understand why it's called McTeague (after the book) because of the nice wood decor and saloon vibe. \n\nOverall, I'll go back, but mostly because I live right nearby, and not on a Saturday night -- then maybe I'll head down the block to one of the other hundreds of bars nearby.", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-17", "description": "McTeague's is always a sure bet when just wanting to meet up with friends and have a good time. Can't go wrong.", "author": "Bridget B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-10", "description": "A great new bar to open on Polk street.  Came in here after a happy hour at R Bar and was quite pleased with the joint.  It has a midwest feel to it...bigger than your average SF bar.  There is also a renaissance feel to the decor.  Drinks seemed pretty reasonable.  The crowd seemed like potential for being a good crowd.  \n\nI'll be back I'm sure.", "author": "Beth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-24", "description": "I liked McTeague's, it reminds me of Bacchus Kirk but lighter.  I recently went to watch some basketball and it wasn't a bad spot.  We left Ace's because Badger fans took over the joint and well red doesn't look good on me.  McTeague's wasn't too crowded, had a bunch of TV's and the booths are nice and intimate.  I was a bit confused about the roped off area in the back that said, \"Private Party\" yet there were only two people back there on the pool table.  Maybe everyone else hadn't shown up at that point.   I guess in theory it would be fun to have the pool table to yourselves but I also feel like it is 100% selfish.  I mean, this is a bar, how can you bogart the table like that.    Either way, for the area, I liked it.   I would probably go back.  It was clean, the decor was fun and the crowd was less D-Bag than some of the other venue's Friday night clientele.", "author": "Kristin Marie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-01", "description": "Have you ever wanted to listen to country music while sitting in an Irish pub?  I didn't know that I wanted to either, but it turns out that it was just what the doctor ordered! \n\nIn my neverending quest to find the interwebs in places that I can sit in without having a major freakout, I came across McTeague's.  That's right, a bar with interwebs!  Joy.  Plus, the owner (I think) even made sure I sat somewhere where I could keep my computer plugged in.  Shcore.\n\nAnd the Irish/Texan mishmash is almost just right.  I personally have ZERO problem hearing some Morrissey right after Johnny Cash.  It's the kind of warm misery that works perfectly for a rainy afternoon when you're contemplating the future and could probably use a good cry.\n\nOh, and it looks like they have fun televised game days where you can revel with others who like the watch the ball go far!  And eat free food, of course.", "author": "Coco D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-17", "description": "I guess I finally crawled out from under my rock 'cause I made it over to this place and was shocked to find out it's been open for two months. So far, it meets all my criteria for  a bar.For a SF bar, it definitely surpasses them.\n\nFriendly bartender- check\nRoom to breathe- check \npool table, darts AND seating- check\nBeer Selection-  SO satisfying\nOne inch puddle or less in the bathroom and no smell stronger than those encountered in my days as a public school janitor- CHECK \nPeople watching- not as many freaks and geeks as I'd like but still enough to keep me somewhat entertained\nHot men- oh yeah, we're still in SF. Forget this category.\n\nOverall- stay away from Polk Street!, It sucks and you're way better off going to North Beach.\n\nP.S. Probably should update this after a weekend visit. We'll call it test-retest validity. Research people!", "author": "deb C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-03", "description": "I'm still trying to figure out if this place is for real.  Country bar?  PWT bar?  Rock bar?  Saloon?  What's going on?  Hmmm.  It was dead on a Sunday night and I was very confused as to why there was someone checking ID's at the front door when NO ONE was there.  \n\nBut the Bartender did make me a delicious filthy martini and give me as many olives as I wanted.  Also he hooked me and my friend up.  Two cocktails and the beer and shot special for $10.  He rocked!\n\nI'm sure this place is more fun when people are actually there.", "author": "Justine D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-16", "description": "Came in hoping that they would have some nice memoribilia relating to Frank Norris, who was the author of the great American novel about the dentist who lived on Polk St.  that gave this bar it's name  -- and who is immortalized down the street by Frank Norris alley...)   This book was also the basis for Eric von Stroheim's magnum opus, the silent film GREED which was originally more than 10 hours long (a really great film, starring Zasu Pitts...)\n\nUnless they've added some -- no memorabilia.  I was sorely disappointed, and went to the bar to order a drink (it was quiet) and asked the AfricanAmerican bartender if there was any memorabilia?  He said no -- and I said that was a shame, as Frank Norris was my great-uncle.  He peered at me and repeated what I said...and then we had the most wonderful conversation!  He knew a GREAT deal about Norris and McTeague.  \n\nWow!  that was unexpectedly nice.  I've started to go in a couple of times, but the loud, drunken crowd looked rabid and I'm not sure my shots are current...", "author": "L M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-11", "description": "It has been a really long time since I walked into a bar and totally didn't feel like the odd mexican out, It's mainly my fault, I am highly sensitive and overly self conscious, but for what ever reason, McTeague's left me feeling happy, confident and ready to take on Godzilla in a no holds bar, last one standing, cage match. \n\nThe ladies there last night was very attractive, even the not so attractive ladies has personality for days, so in turn, made them attractive (did I cover my ass on that one?) Everyone there was handsome. I didn't have to get shit faced to enjoy myself. AND! A McCallan 12yr whiskey was $8.00! I think this has been the cheapest place I have had this... I spent $21.00 or so somewhere in the city for the same drink. I took 1 star away because the last whiskey i ordered wasn't whiskey at all, but vodka... but I guess it was ok since i was driving anyways. I Really enjoyed this place, and the company I was with.", "author": "danny e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-12", "description": "This place is great!  I don't know how I always end up here every time I am on Polk, but there you go.\n\n1) Drunken stupor.  We grabbed chairs around a barrel and ordered away.\n2) Not-so-drunken stupor.  Had a drink and went on our merry way.\n3) College football night.  It was surprisingly empty in there, so empty that I got a table.  Drinks were cheap, and the entertainment was fantastic!", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-30", "description": "My enjoyment of the bar scene has greatly diminished in the past year, either a sign of getting old, or that I'm usually just bored out of my mind. I'm done shouting above bad music and dealing with obnoxious drunks, and I'm not spending a lot of money on booze when I'm not big drinker. I fully admit a club is not much different, but at least I can dance.\n\nSo McTeague's was a nice find, as beers are cheap ($3 for a Miller Lite doesn't feel like a waste of money) and there is a massive jug of water available for patrons. No waiting for a bartender to get you a glass.\n\nMusic was still bad, but that's just my little world I live in.\n\nWere I headed out for drinks in Nob Hill and had to recommend a place, this spot would be near the top of the list.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-26", "description": "I think this place looks like a nice place to hang out. Was over here on Saturday night and it was pretty crowded. So this spot seems to on it.  The only thing I wish it had was some good music, I didnt really notice any songs in the background since it was so crowded.  Its like Elbo Room crowded and its a bigger bar.\n\nThe drinks flow well here and get to you pretty fast, which definitely is a plus since this place is pretty crowded.\n\nGood crowd of folks. Good place to start the night and then roll over Vertigo to get your groove on if thats on your list of To-Do's for the evening.\n\nOne thing I just learned is their Happy Hour's are super long and have pretty good prices.", "author": "Mark L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-25", "description": "What?!  A new place in Polk Gulch!  This place is a step up from the other standbys in the neighborhood.  It's nice to step into a new/clean establishment on this part of Polk.\n\nWhat's good - for starters a full bar with over 10 quality beers on tap. I'm not a huge whiskey or bourbon fan but these guys have a lot to choose from.  Go for the house Pale Ale.   \n\nThere is also a decent selection of  food (small plates) on the menu. Also the booths are nice as is the pool in the back.\n\nThe interior is a bit kitsch but then again so are a lot of the other places on Polk.", "author": "Doug C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-20", "description": "This is a great bar with great people working there. I walked in with my buddy having just been on the road for 5 hours, and got a great reception. The bartenders drank along side us, and really helped the mood out a lot.", "author": "Jeffrey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-20", "description": "In spite of it's Irish name, this place really has nothing to do with an Irish bar. Other than the fact that people go here and get drunk. \n\nThe few times I've been in McTeague's I've had a great time. It's a pretty large space inside. Pool table provided in the rear. The first time I ever went here was actually part of a birthday pub crawl and the place held all 20 or whatever of us fine, we took over an area in the back, I had too many shots of fernet, it was great! \n\nReally friendly bartenders, lots of folks that know each other around there. I'd comment on the drink prices but now that I think of it I've never paid for a drink in this place, I somehow always get someone to buy 'em for me here... Guess I should go more often!", "author": "Andy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-19", "description": "Lots of white caps and blond hair, screaming Journey and Mellencamp songs while pointing at the ceiling and each other. It's not a bad thing, it's just not my thing. \n\nIn a way it's nice to have this to counterbalance the hipsters taking over the TL.", "author": "Edward P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-16", "description": "On what was supposed to be a chill Thursday evening, McTeagues became one of my many stops along Polk street where I proceeded to take back shots and drink a few vodka gimlets. Definitely not a super hip bar, but one where you grab drinks with friends and chat it up. Bartenders were attentive, drinks not too pricey.", "author": "Jackie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "Nice atmosphere and friendly staff make mcteague's an all around good neighborhood bar. This is my bar of choice for sporting event viewings within the polk-post area.", "author": "Maggie V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-25", "description": "Looks really cool.  Opens tonight.  I May go tonight... if I do, there will be a real review here soon.", "author": "Joshua E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-24", "description": "Great place! I loved the friendly service, quality mixed drinks, and rock bottom happy hour prices. The \"happy hour\" is a bit of a misnomer, at McTeague's it's actually a happy 7 hours (12-7 i think), but who am I to complain?\n\nReally cool bartenders and great Irish Car Bombs - how can you go wrong?", "author": "Jay S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-11", "description": "Came here after a work event with a friend and must admit the service sucked.  One of the waitresses was taking shots with customers a table over from me, while our actual waitress was nowhere to be seen.  After fifteen minutes of waiting I decided to order drinks from the bar.  Let's not forget the fact that it wasn't busy!...the cool waitress who rips shots with customers didn't even ask if we were being waited on. When I asked the bartender if it's normal that the staff drinks on the job he responded \"yes'.  That's good to know?  I wonder if the cooks are doing the same thing.  The atmosphere wasn't bad though, but to consider this place an Irish pubs is an insult to true Irish pubs.", "author": "John L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-07", "description": "Give me free things and I'm a fan. They had a free buffet! Also, Coors Light was only $2. The main reason I'm a fan, however, is that when a drunk dude got up to some douchebaggery, one of the employees approached him and told him to knock it off because he was bugging people. I can't think of a better place to watch the Superbowl.", "author": "Merrilee T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-20", "description": "Killed time here for about 3 hours.\n\nA bit on the expensive side and they don't serve food (BOO!).\n\nStaff was friendly and the beer was cold but it was pretty hot inside that joint. \n\nA lot of seating with a middle aged mixed crowd. \n\nDidn't really have much to complain about and I really liked how dark it was in the booths here. \n\nPool table and darts to boot. \n\nPerfectly OK spot to kill some time.", "author": "John Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-30", "description": "Got a beer here (before Iron Cupcake), they had a good selection. I liked the ambiance, very pub-ish and relaxed. There's a lot of premier-league flags up and the bartender was really attentive.", "author": "Analisa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-31", "description": "Now one of my favorite hangouts on Polk south of California. Great selection of whiskies and bourbons. Get the Bulleit Bourbon!  \n\nCame here before a concert at the Regency (which sucks as a venue by the way). Looking forward to returning for happy hour!", "author": "Joel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-04", "description": "McTeagues, my long lost friend I've been looking for and now always around. You appear with open arms and \"nothing to hide, believing what I say\". \n\nA place that can not only quench my thirst, but could have saved Mac himself in Death Valley. Great space with plenty of room and a few nooks, not some hole where you are continuously bumping into everyone. I dig the style here and appreciate the change from norm - $2 Busch and not the same'ol cheap beer option in Pabst. Solid location with places all around to get some grub at half time - yes, they have the NFL ticket not just broadcast! And everyone I've met that works there has been pretty cool, so I'll keep coming back for sure.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-21", "description": "Solid 4 stars for McTeagues. The bartenders are always super quick to take drink orders, the bouncers aren't jerks, and the actual bar space is bigger than most of the Polk St bars. For these reasons McTeagues is definitely good enough to make it one of my go to bars!", "author": "Kelly N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-27", "description": "Always packed full of loud & obnoxious bros.  Stupid crowds. $10 Irish car bombs.", "author": "Scott G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-06", "description": "i was surprised at the size of mcteague's saloon.\n\nin the back was a room with ample standing/walking space. tables were rather abundant on this friday eve and the drinks were moderately priced.\n\nin all, a stable bar on the polk walk.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-26", "description": "This is my favorite bar in the Polk/Bush area.  The new booths in the back are awesome and there is always a good crowd.  Get there early or you'll be waiting in a long line.", "author": "Jason D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-18", "description": "Two dollar Shiner Black + complimentary nacho bar + dog friendly = GOOD TIMES!  This place rules!", "author": "Dana D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-21", "description": "I'm not a big bar person anymore (yeah I'm getting old) but after hearing about McTeague's Saloon I was very curious to check it out.  I met with an old co-worker here last week and I really liked the place.  It was a much larger bar then I thought with a full bar, seating across from the bar at stand up tables and booths and a pool table in the back.  A good size crowd was out too.  Since McTeague's is close to my place and a very cool bar I will come back.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-11", "description": "I went here one Friday night to meet up with two 'friends of a friend', and was ditched.  I wasn't devastated, because it was a pretty decent place.  They played Tom Petty on the Juke at one point.\n\nThis is still my first month in the City, and I don't have any real friends-- so going to a bar like this one solo is a little bit overwhelming.\n\nIn conclusion, I'll go back during a happy hour or on a Saturday morning...", "author": "L J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-06", "description": "Laid back and divey. Things that make me feel comfortable at a bar . Much rather go here than the Hemlock", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-03", "description": "Too expensive to be a dive bar, but not too pricey, with a dark lighting feel.  Plenty of specialty drinks.  I will definitely come back here.", "author": "Joel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-24", "description": "Had a great night here. the bartender, brigid, was a delight. the drinks are well priced & wonderfully served. i came here solo & left feeling like i had met my friends there. \nGreat staff, friendly saloon...", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "I'm a pretty big fan of this bar, there's plenty of seating/standing space, a good sized bar counter space to order drinks, a lively crowd on Friday and Saturday, good happy hour prices during the week, and great service from the bartenders. There's a pool table in the way back, but it's pretty much always in use so be prepared to beat someone first before you can play for friends. The crowd is young, in their 20s, and I've met someone from abroad every night I've gone, so it's pretty well cultured.", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-27", "description": "This place was great.  Was in San Fran and needed a place to watch the Longhorn football game.  They were friendly and had Shiner on draft.  Fun atmosphere during the football game and good beer.  What else do you need.", "author": "Allen P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-21", "description": "Despite the fact that McTeague's has a bunch of nice flat screens, booths to chill in, and pretty cool bartenders, I still couldn't really get into it. Mainly because of the crowd. I partially think it was because I was in a shitty mood and came here after a long weekend, but then the other part of me thinks it's because I'm just reaching a point where I've been to a shit ton of bars like this and they're fast losing their cool factor to me. Either way I plan on going back and giving McTeague's a chance when I'm in a little bit better of a mood. For now though, three stars it is.", "author": "Tommy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-16", "description": "I gave McTeague's a 3 but it could be better next time because I liked the place. The problem I had was the music was inaudible, mainly a thumping base and the bartender seemed new (slow and not talkative). There were lots of people which is always nice and lively and since the place was large and it was still pretty early it wasn't totally packed (which I liked). We tried the Nachos but I wouldn't do it again unless I was really hungry. I'm not a fan of the canned cheese sauce, the guacamole wasn't good but we did finish the plate so it wasn't all bad but we were very hungry.", "author": "Dianne M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-18", "description": "The Blonde Woman Bartender rocks, I ordered close to 10 different drinks for my group and she got them all right. \n\nWhile I will return to this bar, there are a few qualifiers...mainly that I won't go back on a holiday/mass drinking day for the public. Some of our drinks got spilled by an employee who didn't appologise or assist in cleaning.  \n\nWhen I called to complain the next day I spoke with Chris, he was very kind, appologetic and offered to refund my money...I don't need my money refunded, just an appology.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-16", "description": "This place a great spot to drink watch sports and waste an entire day. The bartenders are great and do an awesome job of remembering every stupid thing or person you have done. Its like cheers but the staff wont take any crap from you. The guests are all types. Preppy d-bags to the old local drunks. Everynight is different. You can count on one thing every time. Good Drinks, Good Conversations, And a story you will have to tell to your friends that usually starts with \"Dude 5 mins after you left....\"", "author": "Michael T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-05", "description": "I went to college in Austin, TX.  How thrilled am I to walk into a bar that has $2 Lone Stars (during happy hour), and Tito's Vodka!!!!  WooHoo!  I had a great time on a lazy Monday afternoon, watching various games on the TV's and chatting with my friend.  Not sure if it becomes the kind of frat house bar that I stayed away from on 6th St. in Austin on a Sat night... but I am willing to give it a try.  The place was clean and staff was friendly. No complaints really.  Thanks UT Alumni!", "author": "Kimmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-27", "description": "This place is great, I can't believe I have been to all the douchiest places on Polk yet never been to McTeague's before the last few months. The bartenders here are funny . . can't quite figure out how to describe them but I love them!  They're laid back and just. .I don't know, cool.  The 2 times I have been here I have left very drunk, and now I am sitting here hoping I left a tip, a good tip. . when I left last night.  Usually I leave too much cash when I'm drunk but the problem is I had no cash yesterday and I can't fathom that I was doing math very well adding up tips at 2am drunk ..  so . .shit!  Guess i have to go back there  .. just to make sure I tipped. ..maybe I should pre-tip in case I get all drunk there again.", "author": "Muriel D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-26", "description": "Simply A-OK, I mean what is there really to say? It's a bar. A place to stand around, drink beer, play some pool, and talk to your friends. I would probably go back just because it seemed to have a nice laid back crowd for a Saturday night.", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-09", "description": "Stella, Sierra on tap. Cheap ass 2 dollar bottles of Lone Star and a cool cat, jive talkin bartender named Curtis is what makes this bar a favorite for me and my drinking buddy.", "author": "Andrew Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-23", "description": "This is one of my go-to local bars.  It's roomy enough so that I don't ever feel like I'm trapped in a long hallway packed full of strangers.  Otherwise- its a bar.  Dark wood, plenty of beer.  No PBR, which I find a little strange, but I guess maybe at age 30 I should try to class it up a bit anyway.   The crowd is mostly locals (except for Irish holidays).", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-23", "description": "$2 Shiner Blacks all day every day, or Chimay if I'm living life that day - yay!!!  And you just may get some free chili out front, or a chili buffet inside...you just never know...love the staff and the regulars at this place...", "author": "Brooke C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-21", "description": "Any bar with a picture of Shane MacGowan on the ceiling is A-OK with me. Bartender and clientele were super friendly. Meant to stay for one drink but ended up staying for hours. Being from out of town, I though SF would be full of aging hippie douche-bags, but places like this helped correct my bias.", "author": "Sean W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-04", "description": "Im rarely in the city but found myself there two nights ago. Had gone to some crappy bar that I felt horribly out of place, walked down the street to this lovely gem just to fit right in. Welcomed by the Johnny Cash music and a handlebar mustached bartender who makes me feel at home, I walked up to order a PBR. \"Nope, PBR's too classy.. We do have LoneStar though.\" This is one of the reasons for my 5star rating. I visit Texas a few times a year, and have been looking for my beloved Lonestar since returning from my last visit. \nAll in all this place made me very happy, let me slip out of the city atmosphere, into an awesome saloon that I'll be returning to again. On top of Lonestar they have ShinerBock on tap served in rad mason jars. I also liked the paintings depicting legends who've passed (Janis Joplin, Cobain, Rick James!) as angels, and the big Texas Longhorns flag. I guess I could keep writing about everything I like.. because thats just it..I loved everything. Oh! And they have pool too.\nI know that I'll be coming here every time I find myself in San Fran.", "author": "Lucia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-08", "description": "Many years ago, I fished a tattered paperback copy of Frank Norris' \"McTeague\" from a filthy bin at a used book store and couldn't put it down. It's a 19th century novel about the complacent misery of a Polk Street area dentist who hates his wife and loves his beer. Regardless of the literary tribute, I adore this pub for its mixed crowd and enveloping warmth, despite being such a cavernous space. Yes, I think Dr. McTeague himself would be happy to belly up to its beautiful bar for numerous pints to try and forget his troubles. And I'd definitely buy the first round.", "author": "Gregor G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-26", "description": "Not bad. Never really feel welcome in this bar. Maybe it's just me, but I don't know. Drinks aren't bad. I guess it's not my scene.", "author": "Stafford J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-04", "description": "This is a great bar.  Super spacious and prices are normal.  Went there on a Thursday night and it was happening.  Since it so large, it does not get too crowded.  Gonna try to catch a game here as well since many TV screens.", "author": "Chuck Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-06", "description": "McTeagues lies directly in the path of least resistance from the bus stop to my doorstep which makes this is a very dangerous situation.  It's a great place to stop and have a couple (half-dozen) Anchor's to fortify my body for the long (3 block), cold, walk home.  The bartenders are friendly (Amber is great), the beer is always cold and cheap, and the games are always playing.  Good group of regulars and welcoming to anyone that walks in.\n\nIf you are down on Polk Street, stop in and say hello.", "author": "Matt A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-29", "description": "A staple to the Polk St bars, McT is just a downright old school place to grab cheap drinks and hang. they got a long bar that runs all the way down the place and booths where you can chill and talk. This place is like the neighborhood bar around the corner where everybody knows your name not named \"Cheers\".", "author": "Ed L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-29", "description": "I always go to this place and I've never EVER had an issue to where I thought, \"maybe I shouldn't come here anymore.\"  The folks who frequent it are nice and seem no-nonsense since my favorite bartender Amber kicked out one very drunk and rude doucher who flipped me off (granted I was giving him the dirty eye because I had encountered him earlier in the evening and watched him run out on his tab).  Their happy hour is fantastic...so good and I love the saloon feel.  Go here if you want to chill and have a drink that's not going to cost you an hour's pay, but don't go here and be a douche because no one in the joint's going to tolerate that.", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-13", "description": "Great place. Crowded and hard to get a beer at the bar. Drafts beers fo 4.50. Did I say hard to get a beer, how about damn near impossible to get a beer at the bar that is 4 deep. Order two when you go up, that will help your situation. As I'm standing at the bar, I heard one guy say to his friend there's a lot of meat heads in here. As I looked around he was right. I also noticed that the people here get pretty wasted compared to some of the other bars around town. I was surprised there were no fights outside at closing time, but I did see people not able to walk straight. Very hard to move around inside as it is very over crowded. Everyone seemed to be in good spirits and looked like they all knew each other. All in all, I had good time. Forgot to mention. Good 80's music was playing. That was a plus watching the drunks dancing. lol.", "author": "Joe A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-04", "description": "Polk street bars rock, and I totally love McTeague's! Never have a bad time here! Friendly and fun atmosphere. Lot's of places to sit if you catch a table. Friendly bartenders. Great place to chill, drink, party, good crowd!", "author": "Chrissy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-30", "description": "This is the space next to O Reilly's Holy Grail which has been empty forevers. It is now a spacious saloon with Shiner bock and good selection of whisky.  Woo!", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-15", "description": "This is a pretty good place to come for some low priced brew or well drinks. Definitely a place to start off the night since it is low priced. The crowd there is mixed and can sometimes be too loud to talk in. I dont go to concerts to yell, so I dont dig bars where I have to do the same thing...start the night a little early, get your drinking done here!", "author": "Shaye S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-26", "description": "Spent last evening there, and  McTeagues was a great time. Rolled in at 10, played pool the whole nite, and left happy at 1:30. The drinks are reasonably priced, and they have good amount of bartenders working. Great mix of people in there every time I go. Good location that is convenient for people coming from other parts. Great neighborhood bar that does not feel too divey. Shot 'n' a beer!", "author": "John F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-26", "description": "Neat little Irish bar. I don't really know what it is about McTeague's, but I ALWAYS have a great time there. Been there for happy hours during the week, and it is not nearly as crowded as it is on the weekends but still have a fun vibe to it. It gets pretty packed on the weekends and turns into any other Polk street bar. Unless you find a table or a corner, you may find yourself being pushed around a bit on the weekends but hey - it's just like any other Polk street bar.", "author": "Janie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-03", "description": "The perfect place to sit with friends in dark booths and sip english-style warm beer.", "author": "Mason G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-10", "description": "Dark, spacious, Irish, Texan, beer, pool, booths, fun.", "author": "L C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-11", "description": "Went here once with a larger group and we managed to get a table near the front. Place was absolutely jammed, but we still had a good time. Chill staff across the board. Really don't know anything about it other than someone involved (assuming the owner) seems to love Texas and they serve cold beeahs. Check.", "author": "D S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-19", "description": "Great place to hang out.  McTeague's is a very spacious and open bar with a great pool table in the back.  The seating is always open at the bar or at the booths.  I live in North Beach and have gone to many a seedy bars just to try to play pool but I would definitely make my way to McTeague's instead.", "author": "Tira F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-25", "description": "Probably my most recent favorite bar to go to on Polk street, let alone all of SF.  Just a great long bar, with great drink specials and lots of different areas of seating, whether it be booths, bars, or tables.  Pool table in the back.  This place is awesome.", "author": "Charles C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-25", "description": "Great spot. Lots of ice cold drafts, great church pews and solid barstaff. They always take care of you. Extra points for jukebox and $2 beer options.", "author": "Patrick O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-06", "description": "I love to check out a new bar in my favorite neighborhood.  I went on a Monday night so the place was pretty empty (just how I like it).  Great decor, plenty of room and a great atmosphere.  My roommate tells me a pint of Stella was $4 so that's about right for the area.  It's nice to have a new place to swing by when on Polk.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-10", "description": "One word to describe McTeague's - WIDE. I know that is a really weird reason to like a bar, but it's just perfectly spacious without feeling \"big.\" I never realized how narrow most bars in SF are until I came here. It's one of my favorite bars in the city. I just feel happy when I'm here and I like the gold molars on the ceiling.", "author": "Rose K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "Good place to get rowdy with some seemingly authentic Irish folks.  Loud music and beer stained floors.  Not too many douches venture into this place so it makes for good group gatherings.  Quick bar service and friendly as well.  Good times always to be had here.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-14", "description": "good: parking and lots of people on a friday night\nbad: my drink wasn't strong enough and the crowd didn't seem all that sociable\noverall, i would go again but make sure to ask them to make my drink STRONG. my long island tasted GOOD. it isn't supposed to taste good. it is supposed to taste strong and eff you up. i did not get effed up.", "author": "sigourney w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-15", "description": "This is a solid option on Polk street to get a drink with friends!  I happened to wander into this place with a friend recently, and decided to check it out.  It was fairly new, with nice tables, spacious floor, and good decor of inviting wood and wall hangings.  The most important part to me was the bartenders were friendly, the drinks fairly inexpensive (similar to most places on Polk, so not necessarily that special on that dimension), and the service was prompt.  It definitely seems like a good place to start off the night for a couple hours, although maybe not spend an entire night there.", "author": "Lemar H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-12", "description": "McTeague's would normally only get 3 stars out of me, but I do like what they've done with the space, which was empty for years before they moved in.\n\nRight next door to the now-defunct Mayes/Midpoint bar debacle, I was skeptical of this place at first.  Because it opened up right after Mayes closed down, it appeared to be a feeble effort by the previous owners of Mayes to recoup the tons of $$ they had plowed into the failed venture.\n\nBut thankfully, it appears that McTeague's is here to stay.  It occupies a very welcome place in a string of bars on that stretch of Polk.\n\nWhat McTeague's does right: it's nice and dark and inviting.   It doesn't try to be a typical Irish sports bar.  It's not too fancy, not too divey, the drink prices are not excessive.  It's fairly inviting inside, with a long bar on one side.  Bartenders have always been efficient and pleasant.\n\nIt could use more personality, but hopefully that will come in time.  Also, it would be nice if they were to start serving bar food, as well as think about hosting select local live music on certain nights.  Then I'd bump this place up a star.", "author": "Dave N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-27", "description": "Nice place to get your pint on.  Guiness was going for $4 on my visit.  The place is huge by SF standards, which gets McTeague's the fourth star.  The stools at our table were a bit unsteady, which made me wonder if they'd witnessed their share of rows.  You know how we 1/4-Irish like to duke it out.", "author": "Daryl E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-13", "description": "After having a couple glasses of wine at S.N.O.B. we went a few doors down to McTeague's Saloon which was pretty much empty. It was a Sunday night, so it was expected. We went straight to the bar ordered a beer and then back to the pool table and played a couple rounds with our roommates (quarters needed) . If it's possible to take over the back little section with a group of your friends I would say, that is the best way to get the full advantage of the bar. We will have to venture back on another night when I'm sure it will have a bunch more people. http://www.sanfrancisconoobs.com/07-13-2009/s-n-o-b-wine-bar-and-mcteague%e2%80%99s-saloon-in-nob-hill/", "author": "Casi C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-21", "description": "I don't like being deceived.  The website states that happy hour drink prices are $3 for well and draft drinks.  I went there for happy hour last night and ordered a vodka and 7up and it was 4 bucks.  Popov and that bar do not deserve my four bucks.  Oh, and the atmosphere is shitty with blaring tvs and horrible lighting, even though the tables are nice and woody.  Lamelamelamelameliarslamelamelame.", "author": "Liza W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-30", "description": "The most comfortable spot on Polk to just pop in, relax, and feel welcome.", "author": "Chris V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-28", "description": "Great new place. Lots of good tap beer, nice to see shiner bock on the bill. Nice whiskey choices. Beer was 4$ a pint sunday night, lets see if the price goes up. Pool table for 1$ juke box. I liked the decor old red wood ,lots of room, big wood booths for social gatherings. Friendly bartender. One guy at the bar even bought a round for everyone . Very cool! Also named after one of my favorite books of fiction called \"Mcteague\" by Frank Norris a must read if you live or hang in the hood.", "author": "Don j. c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-02", "description": "The location is hard to beat: nice bar in the middle of Polk St. My Margaritas were generous pours and even nicer at only $5. I was there to watch the Giants...and well, apparently every game my friends have watched at McTeauge's has ended in lots of tears. They were convinced the Giants were gonna lose...which they did. But I think the dignity was lost long ago: my friend fell off a bar stool. In any case, good service for being super-packed, pleasant bartenders despite the loud patrons, and good drinks for cheap. Liked it and will be back.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-23", "description": "rad neighborhood bar [on a weeknight]. this is the kind of place i want to bring a few homies [on a weeknight] and kick it in an atmosphere thats wide open, not too loud, plays the right music [our choice on a jukebox weeknights], has a pool table, serves a decent selection of good beers [in pitchers], and has a great special [$2 lonestar pints...all the time].\n\ntoo bad i dont live nearby, or else id be a regular.", "author": "Jon W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-18", "description": "I really like this bar. Its got a great vibe, good jukebox, pool table and its nice and roomy. Probably one of my favorite bars in the city as of right now!", "author": "R T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-23", "description": "Guinness: $5\n\nWalking into your friend's conversation about sandwich vaginas: priceless.", "author": "Shannon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-20", "description": "I love the bar. The story behind the name is what gives this pub originality. Mcteague is a book written about A man on Polk street in the 1890s. Its a fun different kind of place.", "author": "Jeffrey A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-07", "description": "Forgot to Yelp this spot. Went here the other night and just really didn't get what the hype is about. Maybe it was an off night...The scene was very odd. The drinks weren't great. Don't see going back anytime soon!", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-29", "description": "Happy Hour from noon  to 7...check\nBooths that make you feel classy and at the same time give you an opportunity to not have to hang out at the bar...check\nPool table...check\nClassic country blaring on the jukebox...check\nDid I mention the happy hour from noon to 7? Because that's pretty awesome.", "author": "Masha B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-22", "description": "Went here for a friend's birthday in January only to return in March for my own. \n\nI called on Wednesday to reserve two booths for the upcoming Saturday night and the woman on the phone said she'd get the info to the boss but doesn't see it as a problem. Said she'd get him to call and verify with me. Thursday rolled around and I didn't get a call and totally forgot. Friday morning I called back to make sure I'll have the booths - I was expecting about 12 people and figured most would like somewhere to sit. Same woman on the phone, remembered me, said the boss \"hasn't come back yet\" but still didn't think it'd be a problem. Ok fine, no biggie. \n\nSaturday night! Dinner at 21st Amendment then on to McTeague's. It's my birthday, I'm ready for some birthday drinkie and good times with friends. Part of my group and I walk in around 9p (the time we reserved the booths for) and I notice every booth have people sitting in 'em. Two booths were reserved for someone else. Well this sucks. I let a bartender know whats up and he gets the boss-man. Boss comes up to me and is totally nice and understanding, I let him know of my phone calls.. etc. He gets us temporary seats and lets us know people he knows are in some of the booths and we'll get the booths when they leave (\"they were planning to leave soon\" he says) and then gets my friends and I a free round of drinks. He was very nice about it all and I have no qualms about it. By the time the rest of my group showed up we had at least one booth and tall table and a short time after that the second booth opened up.\n\nOverall the experience was great. My friends who haven't been here before all enjoyed it and thought it was a pretty chill place. Will keep this place on my \"the list\" and return again!", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-14", "description": "fun on football sundays.\nlame on weekend nights.\ni thought i walked into the rockit room or some shit. \ntake your sports hats and square toed leather shoes elsewhere.\nor wait. i just wont come back, save you the trouble.", "author": "Tim B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-02", "description": "Based on the location I was not sure what to expect but I love the interior.  It was pretty quite when we were there but it is a nice place to watch sports. The jukebox was playing Johnny Cash and they have a lot of great beers on tap including Shiner Bok (which is hard to get outside of Texas). The  taps seemed to have an issue as some of the beers tasted funky (plasticy) but the bartender replaced them without question which was good service.", "author": "Courtney R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-28", "description": "Dudes.$12 for a red breast and s small pour at that! Live in the area....lots of bars....I'm just sayin'", "author": "Roger A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-25", "description": "The last time I was here I swore never to come in again- me & a friend stood right in front of two bartenders for over five minutes & were completely ignored while they chatted away- not helping customers, just chatting & ignoring us (maybe we didn't have the right vibe)\n\nThis time we went in & the Amazing Liz was behind the bar- she completely changed my opinion on McTeagues. Great service, she remembered my groups order through numerous re-orders, and I never saw her without a smile. If she's working, a definite 4-5 stars. Without Liz.... well, lets say that I only hope the other bartenders step up to the plate & become as good as her.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-14", "description": "Great bar.  The only issue I had was with a bouncer, but the owner himself took care of the situation in a way that not only made me feel good about coming back, but seemed to make the bouncer less antagonistic towards me.  I really appreciated that.  I know it can be tough being a bouncer, but I also know that a patron should be treated with respect.  The owner took both into account and I will definitely spend more time and money there in the future.\n\nBartenders are cool too.", "author": "a e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "okay i am not gonna lie. the first few times i came here i walked away a little confused. for example they have my favorite vodka (jean marc xo) but would always charge me a different price for it (ranging from 5-12 bucks). and no. i always order it the same way. rocks lemon twist. so its not like they charge more for rocks vs mixed drinks or whatever you were thinking.  however, being a main stay for a lot of my friends (the bar that is) i have had to venture to this establishment quite often. it has grown on me (see the four star rating). lots of space, not crazily loud, usually some rather fine ladies (and dudes, e.g., myself and my friends).  i have grown to like mcteagues. you should check it out. \noh yea. they finally started being consistent with their jean marc xo prices: $8.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-23", "description": "used to go to molly mcgees and now i got to mcteagues. kinda of a fan of irish pubs. its a pretty big area and lots of tvs. great for watching hte giants limited to seating but oh well. i wish when the playoffs are on they would play the giants on more tvs...who really cares about other teams when the home town heros are kicking ass and taking names.", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-21", "description": "Awesome place, its a lot of fun with a great crowd.", "author": "luis a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-08", "description": "The bar itself is really nice and chill. It's a great place for Happy Hour and a great place to watch games. I also think their drink prices are reasonable when compared to other bars. The only problem I had with the bar is the music. They played some of the worst music I ever heard at a bar. Maybe I picked a wrong night but for me to change my mind on the ratings, the music needs to start getting a little better.", "author": "Nir B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-19", "description": "A cute, cozy local (for me) pub that you can casually walk into and expect to find a seat or table for yourself. The bartender is very generous. She was very generous with my scotch.", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-26", "description": "I'm a big fan of this bar.  You can get a beer for 2$.  And it's a great place to watch NFL games on Sundays; nowhere near as crowded as all those bars up near Broadway.  Cool portraits on the ceilings too.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-04", "description": "McTeagues is my new favorite bar in SF...great crowd, good beer selection, bartenders are very friendly...and it's an awesome space. Pretty much your ideal neighborhood bar!\n\nThere will be a great event December 11th...COME CHECK IT OUT!\n\nFacebook Event: http://www.facebook.com/home.php?ref=home#/event.php?eid=63535080800&ref=mf\n\nEvite: http://www.evite.com/pages/invite/viewInvite.jsp?inviteId=GJMREJVIWUGHMOZSPKQG", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-29", "description": "Great place with a pool, lots of seats, cheap beer and a friendly atmosphere", "author": "laurent c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-03", "description": "Great bar for watching soccer (football) opens at 6am for EPL games and can't wait for the world cup next year. Michael is a great bar tender who makes awesome bloody marys and he's a nice bloke for a Chelsea fan.", "author": "Noel W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-25", "description": "Good tap selection, friendly bartender. Can't complain. They have a pool table, along with a ton of cues, in the back if you're feeling up for a social game. The crowd here was pretty friendly, although it wasn't very full on a Sunday night.", "author": "David W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-07", "description": "This bar is so gay that even Boy George would take the time to roll down the window in a passing car and yell Fag.  Seriously though, there are a lot of fun bars on Polk.  Walk past this one.", "author": "Ross F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-14", "description": "Curb Appeal made us walk in...5 hours later we left with a hand full of new friends and big smiles on our faces! The locals, service, pool table, and sports kept us there all day. Excellent Bar with great drink selection, good vibes and attentive Service (drink was never empty). We were exploring SF from LA, and my husband and I left McTeague's with a hand full of insider hot spots. It felt like we were with old friends when really they were new ones. Thanks Mike1 Mike2 and Mike's girlfriend for all your suggestions-we took them and had the best 5 days!", "author": "Urban D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-25", "description": "i fuckin love this place!!\n\ngreat beer selection!\ngreat crowd and vibe!\ngreat for watching games or after work and not too crowded\ngreat if you want a lively semi crowded bar on weekend nights\nBartenders are amazing and very generous\nthe jukebox is phenomenal\n\ngo here and you may run into me", "author": "chris g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-16", "description": "Finally, a bar that addresses the concern of the customer who wants to have his game on, while getting his game on.  Where else can you choose between private booth, saddle, belly up, pool table room or open floor with your favorite game on flat screen under a Hunter S Thompson coffin lid?  Rumor that they will open early (10 AM)  to support the needs of a March Madness Thursday March 19, 2009 pub crawl crowd, warms me heart.  (Walking distance from Swan's Oyster Depot)", "author": "dag d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-15", "description": "The best place to watch soccer in San Francisco, period.  I have been to many pubs in North Beach, the Sunset, and Richmond, but this place is the best.  There is always a crowd even at 7am.  Beers are cheap, plenty of TVs, and Michael the bartender is awesome (despite him being a Chelsea fan....).  No other place to watch soccer in the city.", "author": "Drew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-28", "description": "i like the saloon feeling of this place. seems like its been around forever and isn't trying too hard to be trendy. my favorite spot is the pool table area in the back because there's a lot more room to sit or stretch out and it's not too loud back there. the only drawback is that on weekends it can take forever to get the bartender's attention since it's always so packed in here. but once you do, it's worth it 'cause the beer is cheap and the company's good!", "author": "N. M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-21", "description": "My friends and I will never return!  Female bartender wasa witch.  Made an awful drink, which we politely asked to change for something else and she gave more attitude than I have ever seen.  Insecure girl thought she made the best drinks in town and said she is known for her drinks.  Told her it was nothing personal, just wasn't what we were expecting.  She was rude and went around to everyone talking about these rude people who didn't like her drink.  Managing bartender didn't seem to care that she was extremely rude and said it happened often and people mistook her \"way as a Puerto Rican\" for being rude.  I'm hispanic as well, so was a bit insulted.  She needs to realize she is in a SERVICE position and make customers happy rather than be a witch when someone expresses dislike for her amazing (amazingly awful) drinks.  Even the manager made an awful face when I explained how she made the drinks.  Will tell everyone I know to stay away from this place.  Awful.", "author": "J W."}
