{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "I've been going to Mehfil for years, and it's honestly one of my favorite Indian places in the world. Not like on any kinda of expert, but I've had Indian food on several continents, and I'm always drawn back here. \n\nTheir lunch bowls are famous in SoMa, as is their Chicken Tikka Masala. But many of their other dishes are also great. \n\nIt's a family operation, and I've seen the same guy running this place for over a decade. \n\nIt's not the fanciest location, but the foods worth it.", "author": "Erik B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-01", "description": "Mehfil is a popular lunch spot among the masses. In fact it's so popular we have an app built internally that scrapes the daily specials and returns the information back to us. I'm pretty impressed we have that kind of automation at our disposal. Also they print out daily menus for each day of the week as well. \n\nWe dropped in during a busy Dreamforce week because Ippudo was quoting a 25 minute wait. That was outright crazy and we wanted to eat without waiting. After much deliberation, we settled on Mehfil and were seated right away when we arrived.\n\nI was settled on the sizzling salmon hot platter. One thing I like about their specials is the inclusion of soup, salad, and naan. You get the most value out of it and I haven't been disappointed. I also got a mango lassi to go with my meal. Definitely get garlic naan with your meal. Back to the sizzling platter. The portion of fish was huge and we shared it family style. Also the quality of salmon was good and the fish was indeed fresh. \n\nThere were some service issues.\n1) They messed up and did not put in our second order of naan into the kitchen. \n2) We got an order of chicken tikka masala that we did not order (which we promptly sent back). \n3) We asked for a check and it took them ages to bring it over. \n\nThis is A-OK with a 3.5 stars given it's close proximity, popularity among the masses, and their dedication to the menu.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-08", "description": "Food poisoning something fierce. No no no no. \n\nBummer because it was our favorite. I only want to write to warn others and hopefully they will take this seriously.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "Seven dollars for a gigantic take-out box of rice and curry.  Vegetarian curries are six dollars.  What's not to love?   \n\nThey have several different curries available under their \"Lunch Box\" menu.  During my lunch break, I tried their chicken masala lunch box (without any naan) and boy it was filling!  I found the curry to be a good blend of creamy and hearty.  The chicken was a tad on the drier side, but I can't complain because it's still a great take out lunch special.  They also have a goat curry lunch box as well.", "author": "Hailey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Brilliant takeaway place if you're craving for Indian food!\n\nI've only been here for their \"lunch boxes\". You enter and walk down close to the kitchen. They pick up a box with rice in it. You can pick 1 or 2 fresh, hot gravies to go on top. They let you do 50-50 on two gravies.\n\nI've had rajma and some paneer ones on different occasions, they're fantastic. You're in and out of the store in 5 mins tops.\n\nAlso, they're dirt cheap ($6 for the veggie box if you pay by cash, $7 with card). Would def recommend for takeout lunch!", "author": "Vignesh B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "I would say the place is decent. Had ordered lamb biryani and would say they offered a lot of quantity for the price. But I didn't get the kick of a typical indian biryani in that though would say its worth trying a dish there. Would be back  to try something else.", "author": "Sharad B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "I ordered the Chicken Tikka Masala ($7) to-go. If you order takeout, you will have to pay an additional $1 if you use a credit card. \n\nThe meal had a really good value. My only complaint is that the chicken was a little dry. I was given a lot of chicken pieces though and a ton of sauce. The sauce was a little spicy. \n\nI was very full after eating this meal. I will probably come back in the future and try the vegetarian dishes. It's interesting how the takeout menu changes everyday.", "author": "Kristina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-04", "description": "Good option for delivery when we are craving some indian food. The bengan bharta in particular is tasty!", "author": "Rachana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "I only pick up my Mealpal orders here. It's a fast and easy Indian place that you grab Chicken Tikka Masala in 30 seconds.", "author": "Yanzhong L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "I just got my delivery from yelp. Mehfil has the best butter chicken. Every time I order it from other locations, I'm disappointed. I ordered butter chicken, samosa, garlic naan, some stuff naan, and chai. Everything was really good. I'm surprised my chai was still hot because I live pretty far from the restaurant. They wrapped everything very well to avoid spilling.\n\nThe driver was an older Indian man. He was really rushing. He gave me the food and immediately rushed off. He's working super hard to make sure other deliveries are on time. I had to scream to him to give him his tip. \n\nI love this place and I will continue being a loyal customer. :)", "author": "Karen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "We love this place. Not only is the food great, but the service is fantastic. We're so comfortable here and are always confident in getting anything on the menu knowing it will be delicious.\n\nDon't be thrown off by the appearance--cracked seats, stained walls--the place is old and worn but definitely clean. The bathrooms too, though disappointingly they are gendered despite being single stall.", "author": "Megan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Where do you go for great Indian food? Look for a restaurant that has Indians eating there... and this great little place doesn't disappoint...\nThe lamb in the Rogan Josh was super and the rice was perfect and not sticky.\nNaan left me wanting to buy extra to take home.\nService was great, everything clean...\nGulab jamon sadly tasted like my local store made it but c'mon, it's gulab jamon... only perfect when your grandma from Mumbai makes it...", "author": "Andy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-22", "description": "Amber India and Curry Up Now are definitely my favorite Indian lunch options downtown.  But sometimes you don't feel like pigging out at a buffet nor having Indian fusion.  That's when a bowl of curry and rice hits the spot.  It's not earth shattering, but it gets the job done at a reasonable price.\n\nChicken Tikka Masala: Not bad for a $7 lunch in the FiDi/SoMa area.  They give you a ton of tikka masala sauce, so the rice almost feels like creamy risotto.  The sauce really is the best part since it's so yummy and comforting.  The chicken chunks feel a bit dry though.  I mean this is easily mitigated by the generous sauce portion, but you'll definitely notice it when you bite through a large tikka chunk.\n\nGarlic Naan: Not particularly garlicky.  Decent naan though with some parts light and crispy and other parts thick and chewy.  Probably an excessive add-on if you're getting a rice & curry bowl.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-18", "description": "This is a busy Indian restaurant in SOMA. It's conveniently located for a lot office crowd. It's not a fancy place, pretty basic but can do the job. I used to have questions about their hygiene level last year when their health rating was not great at all. It vastly improved this year. However, I never had stomach issues after eating here so I kept coming. When dining in, they serve dal soup which is especially nice for chilly days. My colleague orders his favorite butter chicken/chicken tikka masala most times which is good. Their naan is soft, easy to tear/break apart. I have tried different dishes.....they have been decent. Off late, I get egg biryani which they are able to customize for me. That's very convenient and it means they can make something fresh quickly...A lot of people also queue up at the back for to-go pickups which can be quite convenient. \nA decent place for Indian food.", "author": "Tejashree M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "Great Indian food at a low price.\n\nThis may not be the best Indian food you can find in San Francisco but it is one of the best and definitely the best bang for your buck.\n\nThe service is fast and the menu is pretty good. Definitely try the food. It's true authentic punjabi food.", "author": "Naman G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-26", "description": "Their butter chicken and tikka masala is BOMB.COM\nService is friendly and quick ! If you preorder over the phone, you can just get in and pick up your food! \nTheir new location is HUGE, ample seating!", "author": "Kay H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-14", "description": "I went this place last day with my friend and we order samosas and tea ..\nTall skinny guy brought samosas which is really good and tea he brought in dirty cup with, was cold ... it seems like we ordered hot tea but they serve as cold and service is not good at all ...once you order you have to wait for foreverWill never go back", "author": "Manu P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "Food was delicious and service was great. I really enjoyed the meat combination, the dessert was tasty too. I would come back and try the curry next time", "author": "S L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-06", "description": "I think I was expecting more flavor from a Northern Indian food establishment.  I also am sad after eating it and now seeing the food safety score warning. \nOn the other hand, it wasn't terrible.   The butter chicken was very \"butter\", and  I felt the chicken sagwala could have been less creamy.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-15", "description": "This place has steadily slid downhill. I eat there every few months and have finally had my last meal there. Less and less meat in their dishes, flavors slowly but surely disappearing, and whiter and whiter lettuce in their salads.  Search for better options...", "author": "SF Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-15", "description": "Got the Chicken Tikka Masala ($7) with the Garlic Naan for a total of $9.50. Decent lunch, I like the sauce but as seen in other reviews the chicken was dry and the naan just tasted like dough, nothing too special.  The atmosphere seems nice and it's very, very quick to get your order as they have everything prepared already. For a 5 minute quick grab to go, this is good fast-food, but not the finest of foods.", "author": "Leo W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-13", "description": "A great lunch time place for a simple meal, and less than $10! I usually get the Chicken Tikka Masala, along with Garlic Naan, but I'm willing to experiment with some other options one of these days. The line moves very quickly. Perfect for people who are limited on time. I get 10% off my bill because of Yelp Cash Back, so I will keep on coming back for more!", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "We discovered this place strolling on the 2nd. Although we reached almost at the closing time (9 30), the food they served was fresh. We had shahi paneer (comes with rice), garlic naan and aloo kulcha. All the items were very good. The restaurant was very spacious too, and having such a big restaurant just by the market was wonderful. Would definitely recommend and visit again.", "author": "Salman Khan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-20", "description": "Over all it's a nice place for lunch. There a seating section and a walk in grub a lunch to go section - both mix and you can be seated on a place where you see folks coming in and out every two minutes. Kind of wish they had the two separate, although to be fair they have a separate section to pay for the to go lunches. \nAlso seating section is very cramped- if someone wants to squeeze by your table to get to their don't be surprise if they move your plates and dishes. This especially happens with the table for two. \nService isn't terrible but it's not great either. We got to order our lunch pretty fast but then we're looking for the waiter when we wanted to leave. \n\nFood wise the place is great!\n\nTry out the chicken tikka masala and the lamb vindaloo! They are a must!", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "Great price and delicious food. Their service reminds me of India. Quick and efficient, without small talk. I've seen a lot of people that consider this rude and leave a bad review. Just keep in mind it's not rude, it's just them trying to give you great service in a different way.", "author": "Alexandra H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "Fast food doesn't need to be burgers and fries.\n\nIn the back of Mehfil Indian Cuisine is a busy kitchen and order station, rolled together.  Past the packed tables filled with hungry customers lies a place where you can order off a inexpensive to-go menu, that will get you in and out of the establishment in under 15 minutes.  In a handy bag loaded with rice, meats, and curries, you'll be able to indulge in a traditional Indian meal packed with tons of flavors and guaranteed to leave you full and satisfied.\n\nThe employees at Mehfil are fast and efficient, placing orders and getting your food ready in lightning speed.  You just line up, pick one of their under $10 combo meals, pay, and you'll be in curry goodness in no time.  With such a cheap cost of food, I recommend visiting Mehfil's frequently and sampling their entire lunch menu.\n\nYou can mix up your traditional lunch on the go with some tasty curries at Mehfil.", "author": "Nadav P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-01", "description": "Pretty good food. The pricing is fair as well when compared with other nearby Indian restaurants. The taste is great and the serving size is pretty moderate as well. \n\nMy only wish is that it would have been nice to have a better bathroom to wash your hands before you dine in. Their men's bathroom is quite small and claustrophobic.\n\nPlease revamp your bathroom. It's not a good look.", "author": "Manpreet S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "Most of my jobs based in SF have always been in this area so I'm very familiar with Mehfil and have been going here for my Indian food cravings.\n\nYou can eat-in for lunch, but something that my coworkers and I like to do is head towards the back, like you're going to the bar, but it's more of a cafeteria-like situation where they have a specific menu. \n\nMy standby is chicken tikka masala, but they also have really good meatballs!", "author": "Aivy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "My favorite to-go lunch place in ask if FiDi where I can get a quick lunch for less than $10 total, I visit every time I visit SF on weekday lunches. I like that the menu rotates often. Rice is quite soggy; curry is delicious filled with many spices. Order Chai tea for $1.50. Please have cash ready, they charge $1 extra for credit cards. Service is very fast even in peak Lunch rush hour. I am in and out in under 3 minutes to get my curry lunch to go.", "author": "Susan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "I go to mehfil once a week and order the same thing. They have daily \"to go\" lunch specials for $7.  I order half veggies half chicken tikka Marsala.  It comes with rice.\n\nYou can't beat the price and the food is tasty and mildly spiced.\n\nI keep going back!!", "author": "David L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-03", "description": "They get three stars because the food is tasty. I had the Saag Paneer, Rice, and Meethi Naan and Chai for lunch. That is the positive. Unfortunately, a few negatives, and I doubt I'll be back: \nThe service was confused, confusing, and just not great. A lot of waiting for things, including the menu, and butter I asked for. \nI also am always disappointed with Indian restaurants that don't offer a sugar-free chai tea, and/or no chai tea refill. \nI wish I could be more positive, everyone seems sweet, and like they were trying, kind of - but I just am not blown away enough by the food to tolerate the lack of service. The Saag Paneer was good, but the Meethi Naan was totally dry, and basically like dry white bread with a dusting of fenugreek powder. It's true , this is how the menu described it, but i was expecting something more buttery/authentic. \nOne plus: Their Wifi works great, and they gave me the password without too much hassle. So that was good. :)", "author": "Marianna S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-15", "description": "Haven't even tasted the food yet, but ordered 51$ worth of entrees and nobody thought to tell me that they do not include rice. Now my food is here and I have to make rice before I can eat it. All they said when I called was, \"We never send rice.\" Inconsiderate service.", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-15", "description": "Such a disappointing delivery order last Friday, May 13th. Our office ordered a bunch of lunch boxes for delivery along with naan, etc.\n\nUnfortunately, they forgot one person's order and messed mine up completely. I ordered a lunch box, NO RICE. Mine arrived with... guess what?! Rice! I couldn't eat it as I don't like white rice. I also placed an order for Samosas, but those never arrived. The only thing that did was my garlic naan I wanted. But what am I going to eat with the garlic naan?! I didn't get any curry! Basically, I didn't get a lunch at all which was disappointing as I was starving!\n\nHopefully, my company wasn't charged by Mehfil for the two items they forgot and they refunded the messed up box as that wasn't what we ordered. I write this with some frustration as I really wanted Indian food that day. Mehfil was a complete FAIL!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "A review for their lunch service. Extremely fast, tasty, and inexpensive vegetarian and meat options. Vegetarian dishes over rice are generally $6 and meat is $7. They are friendly and accommodating and have a clean functional restaurant space.\n\nToday I ordered the lunch combo and an extra side of pakora. Even without paying for wait service, they offered me water. Highly recommended lunch option downtown!", "author": "Gabe S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "We ordered the Chicken Tikka Masala, Saag Chicken, Raita, Egg Biriyani and some naan.  Everything was so delicious!  If you order from here, you won't be disappointed!  Definitely worth trying!", "author": "Jerilyn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-13", "description": "I got the $7 tikka masala plus garlic naan. It's unremarkable, a little watery, kinda just...meh. It's enough to make you full, though. No major complaints.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-03", "description": "The food is solid but the business is poorly run. Service is often terrible and I've gotten at least three incorrect orders when ordering online.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-28", "description": "This is a great place to get your Indian food fix. It's not a fancy place but they have got some great specialties. \n\nWe ordered:\n- chicken tikka (tender and moist!)\n- karahi chicken (wasn't a fan)\n- channa paneer (not a combination I've seen before but Mehfil did it well!)\n- vegetarian malai koftas (this was the BEST dish, great sauce and very tender koftas)\n\nService was good, too. I'm definitely going back", "author": "Japna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "I've never been to the physical restaurant, so I can't speak for the ambience or service, but I've ordered delivery several times and it's solid, reasonably priced Indian food. My go-to dishes are some combination of paneer makhani, tandoori prawns, samosas, and naan. Delivery has always been on-time and included the correct items.", "author": "Liron N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-01", "description": "I ordered the daal makhani for lunch and it was pretty good! Everything was quick and to the point - I was in and out within minutes (perfect if your in a crunch for time). Lots of great vegetarian options and, from the smell of it, everything is packed with flavor. The daal makhani had some heat to it, but otherwise, a very simple, tasty, and filling meal. The rice was nice and soft and made on the spot. My meal was a bit on the heavy side though, so I split it into two and saved the other half for dinner. Not a bad stop for lunch, and for the price, portion, and speed, it can't be beat.", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "I go here at least once a week for their lunch special. I usually get half meat and half veggies with rice for $7. The naan is $1 and the papadum is $2, and both are delicious. Nice place, great service; plan to have a formal dinner there soon.", "author": "Joseph T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "Mehfil's is amazing! It is my favorite Indian restaurant in the bay area. I make it a point to stay within walking distance to this restaurant and visit it multiple times when I'm in town.  My favorite is the tandoori chicken masala.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "Unbearable value in the city. $7 for a lunch that will fill you up. Delicious. Not super healthy, but fairly high quality. Can't beat it if you want a quick Indian lunch. Total in-out time is less than 5 min for takeout.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "Disgusting food. Shame to call it Indian. Super oily pakoras. Tasteless chicken. Bad presentation. Beer had a weird taste. You rather sleep hungry that. Go to this place.", "author": "Vishal B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-23", "description": "Awesome $5 lunch special! \n\nI love that the menu changes and I don't have to think about it. I get half-and-half of whatever the day's offerings are. Fast, easy and delicious.", "author": "Kim C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Awesome foos. Authentic indian good and their spicy is actually spicy. Giving them 5 star as its worth it.", "author": "Ginny B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-06", "description": "This food is way below average.  The beef vindaloo tastes like it was thrown together will little care or attention to quality.   For $13.95 You can expect much more from restaurants in SF.  \n\nOne saving grace is that it is not crowded after work and that is EXTREMELY hard to find in this neighborhood.  They also have $4.50 beers so it's not all bad.  \n\nThe service is also lovely.  Very friendly staff makes it pleasant to hang out at least.  \n\nToo bad the food isn't better.", "author": "William D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "This little secret spot is a great go to place for quick, inexpensive and good Indian food. Walk to the back of the restaurant and order to go food there. They have five different bowls. When you go to the register ask for some Naan, even have garlic Naan. It's so funny because the pull the warm Naan out of a cooler. This was a really good warm $8 lunch.", "author": "Ken A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "Plenty of \"Mehfils haters\" at the office believe that this place is inferior to the nearby North India establishment. To that I say \"how many times did you get chicken bones if your chicken tikka from mehfils? None!\". This is a great place to grab cheap take-out Indian food during lunch EVEN IF OTHERS FROM THE OFFICE DISAGREE. \n\nDon't forget to grab garlic naan!", "author": "Greg B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "One of the best lunch deals in FiDi hands down.\nI've only had their lunch takeout so this review is only for takeout.\n$5-6/ veg or meat combo with rice - naan is $1-2 extra? Can't beat that.\nNote: the lunch takeout deal is cash only or I think you can use your cc for an extra $1 charge - something like that.\n\nThey give you a huge serving of food and there's a rotating menu daily of curries and veggies. Chicken tikka malasa is always on the menu - the flavors are good though the chicken cubes were kinda dry the times I've had. \n\nI usually go with a combo of 2 veggies. I like that they serve up non-mainstream choices as well - one of the best dishes I had was curried radish and peas? I haven't seen this dish again but it was excellent.", "author": "Brenda L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-13", "description": "I'm writing in Regards the the Fillmore location. Which yelp says is closed but it's actually open. Worst delivery I've ever had. The delivery man called and yelled at me for not answering my phone then told me to come get my food because he wasn't brining it up to me. When I questioned what he was talking about and repeated my apartment number the man came up and threw my food at me. So much for treating myself to Indian take out at $30 for two items not including rice. The shame in this situation is the food is good. I will not order from this restaurant again.", "author": "Michele G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-14", "description": "This place is pretty hit or miss. I came here with a group and the waiter spilled a hot sizzling plate all over one of my friends... and he didn't even apologize. The chicken was terribly undercooked (basically RAW!) so we ended up not eating it anyway. \n\nThe first time I had their butter chicken it was amazing. I came again a week later, ordered the same thing, and it was clumped up and gross. \n\nTheir lunch price is competitive... but there's so many other (and better) lunch places I think their inconsistency and low quality service don't make up for it.", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-07", "description": "Mehfil is great if you're looking to grab a quick lunch. They have a lunch box menu which comes with white rice and a choice of curry. They have 5 curries to choose from. The chicken tikka masala or the lamb curry are both decent options. You can also get a combination of two curries.\n\nThe food isn't bad but nothing thats really ever been exciting. It would nice if both the rice and curry were kept warm. Although for $6 it's a steal. You can add on a naan for $2 at the cashier. \n\nThe lines move really quick so you can be in and out within 5 minutes. Wish they accepted credit cards (cash only).", "author": "Zoher Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-08", "description": "Quick and delicious Indian food conveniently located in the Financial District. I made a reservation ahead with Allset, our table and food was promptly set upon our arrival. Note that the pricing on Allset is higher than the take out option at Mehfil.", "author": "Lexy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-21", "description": "Service could have been a little better, but the food was really good. Great authentic Indian food!", "author": "Nicole N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "*THIS POST HAS NOTHING TO DO WITH THE FOOD BUT THE DRIVER WHO DID DROP OFF OUR DELIVERY* Haven't even gotten to it yet since I'm still in shock about what happened. \n\nYou would think that getting food delivered earlier than expected would be great! But to my surprise, I had a very angry driver drop off our food banging on the closest window to my front gate. I have a doorbell and it works perfectly fine. I also have a phone number that is left with you in case you need to reach me. \n\nFirst and only thing he asked me about was a TIP since I paid through eat24 and only paid for my meal. I literally did not know who was banging at my window at 9PM at night but I didn't bring cash so I went back upstairs to get some money and didn't have any singles so I had a good amount of coins in my hand. \n\nI told him \"this is the only change I have. There's some coins in there\" I know it seemed kinda shady that I had coins in my hand but he was not happy, put his hand in my face and walked away from me talking the most shit about me and my coins.\n\nThanks for your shitty service. You definitely did not deserve the 20% tip that was only partly in quarters.", "author": "Caroline R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "Wow this restaurant is perfect for lunch and dinner. I used to go there for lunch box everyday. But now I moved to LA. I missed this place. My mom and her friends visited Mehfil on Thursday evening for dinner on my recommendation. And Mehfil proved it 100%. I never write any review before but can't stop my self to write today. They said food was super delicious and service was excellent. They didn't know about much of Indian spices but girl came to table to explain when they were asking to turban guy about all. She explained and gave some great guidance about North Indian food.    Overall i just wanna say it's worth to recommend someone for Mehfil great food. I will visit to you guys soon. Loved it.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "5-stars for their lunch deal - we dined in\n\n$12.99 for (I can't remember the name) - a chicken dish cooked in a clay pot with onions and bell peppers with some fresh lemon that I squeezed on top (it was fantastic I wish I could remember) (5/5)\n\nBut I also tried my friends chicken tikka masala and it was good (5/5)\n\nThe salad and the soup were okay, the rice was pretty good (standard).\n\nService was pretty good too.\n\nMAIN POINT:\nBasically, the lunch special is fantastic - lots of options for a great price and lots of food (it also helps that the food is pretty good)", "author": "Alexander W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Highly recommend for lunch box service is very fast and with smiling face. High quality, authentic, delicious Indian food in downtown. \n\nThe portions are plenty for one person. \n\nI always get the vegetarian curry. I recommend the chicken tikka masala and saag paneer. Saag paneer is amazing \n\nThe atmosphere is really good . It's also very spacious so you get your own space. The waiters and waitresses are extremely polite and attentive to your needs so your glass is never half empty.", "author": "Lakhwinder G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-06", "description": "A quick and easy spot to grab lunch. I find myself coming here a lot just because the food is super quick (in and out within 2-3 mins) and it's tasty. I always go for their lunchbox and choose half/half of something. I have gone maybe 10 times now and I have yet to see a repeat in curries so they have a huuge variety. Usually 2-3 of the curries are vegetarian which, in my opinion, taste the best but I don't go for the ones with mushroom or eggplant. Bottom line, Mehfil is just a good place to go if you are in a hurry or have no idea what you want to eat :)\n\n***CASH ONLY!!!", "author": "Tiffany E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "This is for take out lunch... very fast service..good food.. cheap as well...love their saag paneer..", "author": "Srinivas A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-02", "description": "When it's this wet and miserable out, I'm glad that there is a convenient place to get some curry takeout around the corner from work. And it's a steal too.\n\nThe $5 and up lunchbox keeps office workers coming during the week. You can dine-in (lunchbox n/a for dine-in) but it seems most folks head right to the back and get in line for the lunchbox. Chicken tikka masala is a daily staple but I do love the fact that they rotate the rest of the menu every day for variety. Of those daily specials I like the Soia Murg - cubed chicken cooked in a dill herb curry sauce, and the self explanatory chicken asparagus curry. I often ask for more curry gravy to soak up the basmati rice. \n\nIt does feel like they've practiced some restraint on the level of heat and spice but for a quick and cheap curry lunch, especially on a rainy day, I'm glad I can run over to Mehfil between meetings.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-24", "description": "Mehfil is a very convenient to-go lunch spot in the FiDi area. I like their bento boxes which are usually $5-6, depending on their specials of the day. My favorites are the VEGETABLE BIRYANI and GARLIC CHICKEN in tomato sauce.  I like how customers have the option mix/match the veggie and meat dishes for the bento boxes. You may also get a side of mint chutney and tamarind sauce for no extra charge. The portions are pretty decent for the price.\n\nI personally prefer North India's lunch bento boxes, but I will add Mehfil to my lunch rotation as a cheaper option.\n\nThey also offer a lunch buffet and I'll come back sometime soon to try eating inside the restaurant.", "author": "Bonnie Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-31", "description": "Hadn't read reviews before going there and was unaware of the safety rating. I am here for 2 days with my family and was casually roaming  around Market St when saw this restaurant and went for dinner. Except Dal Makhani every thing was awful. Chicken was undercooked with burnt capsicum. The parantha and roti were so thick that it tasted like rubber. Very bad experience. The service was quick and good.", "author": "Swapnil G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-27", "description": "If you're ready to stand in lines out the door and waste half your lunch hour waiting around for a salad, there are plenty of other options during the noontime weekday hour surrounding the Financial District. If you're over the rush and just want to be in & out in literally a minute without much hassle or fanfare, do the Mehfil lunch option (take-out only). \n\nThe restaurant is still crowded with people, but if you head to the back they have the trays of that days selected menu. They literally just pour into a to-go container, you head up to the counter, and you're out in a minute. Plus it's only $5 if you pay cash. Employees are definitely indifferent to the customers, clearly focused on getting you through the line as fast as possible. Eh, I want to be out of there quick anyways ... \n\nToday I had the chicken cranberry. Chicken was tender and it had some flavor to it, nothing out of this world but still enjoyable for the amount I spent on it. There was way too much rice compared to the actual chicken/cranberry. Even eating rice with every bite and some in between I was left with at least half a container of rice when I finished the main part of the meal, which was slightly disappointing. Flavor, good. Portions could use some evening out. \n\nIt's not a place you would go if you had time to go anywhere else, but if you're in a rush for the price/location/speed it'll do the trick.", "author": "Kailyn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "Food was very good.\nMehfil naan was great.\n\ndelivery took forever though. for a place that's .2 miles from my apartment, 1hr 25mins seems like a lot.", "author": "A P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "Chicken Tikka was delicious! Food came quickly and service was good. What more could you want?", "author": "Sammy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-14", "description": "This is only for the LUNCH BOX takeout food. \n\nFirst off in the Financial Area food can get very expensive! So to be able to find a cheap ($5-$6) and fast take out place is amazing. \n\nIm usually there at 11am and there is no one at all - in and out - easy peasy!\n\nEveryday they have new items on their Lunch Box takeout menu. I have tried a couple of things - Saag Paneer, Chicken Asparagus, Meatballs, chicken and mushrooms - and sadly ALL of these dishes lack flavor. \n\nOther than the fast/cheap service its the Chicken Tikka Masala that gives it the 4 stars! It is so delicious SOOO much flavor and spice its amazing! \n\nlastly dont forget - Bring your cash or you get scolded :)", "author": "Nina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "I've had better Indian food, but for a quick lunch spot, this place is pretty solid. Good flavors overall, but the meat isn't consistently cooked well. Lunch takeout is super cheap - only $5-6!! - which is pretty much nothing compared to a lot of the lunch options around FiDi. Their takeout menu rotates daily\n\n=========================\n\n*** RECOMMEND ***\n\n-CHICKEN TIKKA MASALA - 3.5/5\nYummy! The curry is delicious, but the chicken is a little inconsistent - sometimes super tender, sometimes a little dry and sometimes very dry.\n\n-LAMB CURRY - 4/5\nPretty good, though the lamb is also inconsistent. Some pieces are tender and others are too dry and overcooked.\n\n-MEHFIL-E-MIX / MIX VEGETABLES - 5/5\nVeggies are well cooked and the sauce is very flavorful with a hint of heat\n\n-SAAG PANEER - 4/5\nPretty good and flavorful. This would be so much better if there was good naan to dip with!\n\n-SAMOSA - 4/5\nTheir samosas are pretty big. Nice and crispy on the outside without being super greasy, and full of potatoes, spices and a little heat on the inside. I wish there were more peas though to balance out all the potatoes.\n\n=========================\n\n*** PASS ***\n\n-NAAN - 2/5\nNot that good. I love naan, but their naan is doughy and undercooked. Too chewy for my liking. Honestly, the Costco naan tastes better\n\n-GARLIC NAAN - 2.5/5\nPlain naan garnished with some fresh garlic. Same as the plain naan - too doughy. The garlic at least gives it some more flavor, but I've had much, much better.\n\n-PANEER PAKORA - 1/5\n[Cottage cheese marinated in chickpea batter, spices, and herbs]\nNot really a fan of the texture. It's basically like fried cottage cheese. \n\n-CHICKEN TIKKA- 2/5\nNot that good. Chicken is too dry and lacked flavor. The chicken tikka masala is much much better\n\n-CHICKEN LACHNA - 1.5/5\n[Fried chicken strips]\nMeh. Dry strips of fried chicken. Lacking flavor.\n\n-RAITA - 1/5\n[Yogurt mixed with cucumber, mint leaves]\nHas a hint of heat in it, but way too sour", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "I have worked in this area for almost 12 years. When I first started working in the area mehfil was located on the corner of 2nd and Harrison, which was great because it was literally across the street and a block up from my office, quick, delicious, inexpensive lunch. 5 years ago I changed jobs and moved near Market and 2nd, Mehfil did the right thing and moved closer to my new office. I assume this is because they loved me so much, but could have been that it's a larger space and more central for a lunch rush. Either way, I still eat here often, and still love their food. CTM w/ Naan is my go to, but from time to time I'll switch it up, I've yet to find anything here that disappoints.", "author": "Thomas W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-14", "description": "Their chef changed at some point this year... Saag paneer is way different - less flavor, less spinach, light it was bulked with corn starch. Lunch to go, is still a great value at $6-$7 but it's not as tasty as it used to be and they're less generous with the sauce.", "author": "Lily H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "Great food. Good value. Recommended for a quick Togo . The service is efficient and staff is courteous.", "author": "Akshay J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-26", "description": "Finally, this yelp inspection confirms, why I was not feeling right when I ate there after lunch. I had there chicken ticka masala and there Mango chicken Something.. (lunch special) now I know why they call it a \"lunch special\".  Avoid eating here, seriously spend the extra 5 at another place if you have too.", "author": "Ruthie V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-29", "description": "Bad Service and bad food. We went for a casual office lunch in a small group. I ordered sizzling chicken tikka. The waiter spilled hot sauce from the the sizzler on my lap and did not even apologize. He just gave me a new cloth napkin. My chicken was undercooked. So I returned it. I tried other dishes my co-workers had ordered. I did not like them either. Overall, bad food and bad experience. I am not going back there.", "author": "Sanjay A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-02", "description": "So I ended up ordering the $6 box meal. The food was okay. edible and okay. But the people working there were rude. So when I bought the box meal, the lady behind the cashier, she said I could sit somewhere at the extreme end of the restaurant just because I order a box meal. The second option she said was to sit outside the restaurant which I didn't want to as yesterday was quite a sunny day in SF! I ended up sitting inside on a 2 people seating. I was just about to eat and she STOPPED ME. She said I cannot sit there. Mind you the entire restaurant was EMPTY. And I was on my feet for straight 5-6 hours and I just wanted to sit. So I took the meal for to go. They were really really rude.", "author": "Aditi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "This place is very popular for dine-in and extremely popular for take-out. The take-out is quick, hot, flavorful and inexpensive. Everything I have had is great. I love the Chicken Tika and the Paneer dishes. For the take out you'll get a bed of white rice and your choice of 5 items on the top. (no brown rice available)\n If you want all of the veggie dishes, say \"Veggie Combo\" you'll get the 2 veggie dishes on the bed of rice, your container of lovely food will be $5. If you want a meat selection pick the number from the menu 1-5 (read the menu on the column in the back) and it will be rice + main dish for $6. You can mix and match, if you wish. The serving area is a steam table in back. The serving dishes (round bowls) lock tight. It is $5 veggie or $6 meat with cash. Charge/Debit is a bit more. The staff is friendly, the wait time is short, and in this high-priced area of downtown SF, you cannot get a better lunch. REALLY good, and especially if it is one of those windy foggy days. Enjoy!", "author": "Jacqueline S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-14", "description": "I had been here only once and I had very very bad experience, the place looks pretty decent and the food wasn't that expensive but the food made me very very sick and that was not fun! I have heard my friends complain about the cleanliness of this place despite of it I went there. I ordered saag paneer that comes with rice. The rice was stale and dry and the curry was very flavorless. Never going back here.", "author": "Shwetz M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "Really liked it!\n\nPros:\n\n- chicken was good and flavorful\n- big portion\n- offers brown rice substitute \n- service was quick\n\nCons:\n\n- pricey... lunch was $13\n- tables are a bit too close together", "author": "Greg S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "Came here for their lunch special and got exactly what I was about expecting. Got chicken tikimasala over rice and also bought some garlic naan bread with it. Came to about $10 bucks out the door which was an absolute steal. Not the best Indian food I've ever had, but it was very tasty. Not too over the top spicy and the naan was perfect with the tikimasala sauce. The staff was friendly and offered some suggestions on what to eat. The place looked clean overall and was very busy during the work lunch hours, but I was in and out in under ten minutes. Would definitely give this place another shot soon for some Indian food!", "author": "James R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-27", "description": "This review is only for the take-away lunch special. As an Indian, I can tell you that their curries are mostly watered down and sometimes lack proper seasoning.", "author": "Harsha R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-16", "description": "This review is only for the to-go lunch boxes. Here's a breakdown of my 3-star rating:\n\n5 stars for price - you can't beat a $6 lunch box for chicken tikka malasa \n\n3 stars for chicken:rice ratio - i got 3 pieces of chicken and enough rice to feed a village. it's a ton of food but could use more chicken and less rice. \n\n1 star for cleanliness - i found 2 eyelashes and a piece of hair in my box. super gross. \n\nOverall, you get what you pay for. apparently i paid for rice with a side of human hair.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "Delicious traditional Indian food in DT SF! Great garlic bread. \n\nFOOD: My friend and I shared the korma lamb ($13) and Achaari Chicken ($11) over rice and garlic bread ($2.50). The korma lamb was delicious - I really liked the different aromatics in the curry sauce, and there were giant pieces of lamb meat, so it very satisfying to eat. We asked achaari chicken to be moderately spicy, which was a bit too spicy for me. The garlic bread was really good - very doughy. We also ordered mango juice ($2.50), which had almost a milkshake texture and tasted very good. \n\nPRICE: With tips & tax, we each paid $20, which is more expensive than what I would usually pay. But it was a very balanced meal and I really liked everything we ordered. \n\nSETTING: The restaurant is conveniently located in Union Square. There are 20-25 tables inside and lots of space to move around. We came here when the Warriors were playing and good thing they have TVs! (not that I really watch sports....)\n\nSERVICE: We came on a Sunday night and we were sat down immediately. Our order came by very quickly also. The waiter was very nice and gave us very sincere recommendations. \n\nOVERALL IMPRESSION: I liked it! Even though it's a little expensive, I really enjoyed everything I ordered and the restaurant setup/location.", "author": "Wendy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-30", "description": "We actually went for a sit-down meal and it was excellent. There's a lot of variety on the menu and we enjoyed veggie and chicken dishes. However I'd have to say the take out lunches look to be the main feature and I'll have to come back to try.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "I was working at san francisco downtown, and had many times a lunch at mehfil. I really like Saag Paneer, and strongly recommend this veggie. It's been a year but I couldn't find better saag anywhere else. Go for it.\n\nParking: Parking is a bit of a headache as the restaurant is located in downtown. It would be really difficult in weekends to find a parking spot. \n\nI have visited the place after a year or so in search of some authentic North Indian food and I am delighted to say the quality of Saag Paneer is still intact. I would highly recommend the restaurant's Saag Paneer.\n\nService: Service is pretty good.\n\nCost: Cheaper than most Indian restaurants at SF downtown\n\nThey give complimentary rice along with veggie.", "author": "Chints V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-21", "description": "It is a great place to go for lunch. It is reasonably priced, and very good. Dinner options are also great.", "author": "Wyatt S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-01", "description": "Sigh. I was expecting a neutral experience. I ordered a biryani on a Thursday night. It has been ages I have experienced a lazy staff. They simply forget the customer they seated - again and again. How hard is it? Seat them - serve water and menu, take order, deliver order, do a courtesy call, clean up, produce bill, produce receipt, say goodbye. They missed me on most of these touch points. I could've walked out at any time, but I waited, waited, waited and then the waitress finally saw me having asked her 15 minutes ago for the bill and she went like 'OMG!' And asked another waited to bring the bill. Not even an apology. \n\nAs I write this its been 10 more minutes and no one has come to pick up my card to complete the payment. \n\nGuess they dont really care? \n\nAlso, the biryani had wet rice. Its was more of a chicken rice gumbo. The dry fruit was soggy. \n\nAnd cherry on top is the waitresses buttering with a bigger family on the next table.\n\nI started with 2 stars. I am going to walk the bill to counter. Decreasing a star. I wish we could go to zero with stars too!", "author": "Zaki S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "The lunch combo was only $5 and you get to choose two items over rice. The portions were medium sized but it was good for lunch. The curries were very flavourful and I liked how they have multiple vegetarian options.", "author": "James S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "I are here tonight as I was I close to the area and the fiancé wanted Indian food. We ordered the veggie korma and the aloo gobi (potatoes and cauliflower), we also got a mango lassi, and garlic nan and raita.\n\nThe mango lassi was delicious, it had a wonderful flavor without being overpowering. The aloo gobi and the veggie korma were both very good. The service was excellent and the portions are a nice size.\n\nMp's take: check this place out!!!", "author": "Maninderpal M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "Got chicken tikka masala. Really delicious! And kind server. I'll probably come back to show my friends this place", "author": "Katie Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-19", "description": "I ordered from Mehfil on Uber Eats, specifically because it guaranteed delivery in under 30 minutes. After waiting for over an hour, I contacted Uber, to request help. A few minutes, later Mehfil called me to inform me that they could not process my order as requested (no onions). I asked them why it took an hour for them to contact me, and they simply said they would cancel my order.", "author": "Carlos K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-27", "description": "I don't know why, but I've been on a curry splurge the last week or so.  Even though it's right across from where I work, I never really considered coming here for lunch.\n\nPretty simple concept if you're doing takeout.  Go all the way to the back of the restaurant and they have a takeout menu; veggie options are just $5 (cheaper than Subway!) and any takeout item with chicken or lamb is $6.  CASH ONLY!  You'll be in and out within 5 minutes pretty much.\n\nThe chicken tikki masala is probably my favorite, but the chicken is questionable.  I've gotten it twice now and the first time the chicken was too dry and overcooked, the second time it was cooked pretty well.  If you're looking to get some naan, it'll also set you back another $3.\n\nNot a bad place if you want food to go!", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "I wish there were separate reviews for different concerns. *sigh*\n\nAnyways for a $6 lunch, speedy lines, and great tasting food--this place deserves a 5 star rating. This has nothing to do with delivery or anything outside of my experience here. I went in ordered, got the food, paid the cashier, and I was in and out within 5 mins.\n\nOh, make sure you get the Mango Lassi. It goes well with your $6 meal. =D", "author": "Justin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-18", "description": "This is low-priced for a reason. Unless you are on a strict budget, I would recommend avoiding this place", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "Great lunch spot in downtown I have  ever seen . This is an amazing place for lunch if you are craving some Indian food. I've had great experiences with their lunch box and dine in. First of all food is amazing if you want to get lunch box. It's just 6 for vegetarians and 6to 7 for non vegetarians. You can also get side of Naan as well. Staff is so friendly and cashier girl will always attend you with smiling face. Chicken tikka masala is delicious but don't forget to get goat curry. It's once in month but so good. I cannot miss it.                                                      Overall excellent service and food. I worked 10 mints away from this restaurant but this is becoming my daily lunch deal. Everything is so much organised you can get you lunch with in 2 minuets service is so fasy", "author": "Money85ful .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-07", "description": "Easily the best ratio of price / taste / portion size for takeout lunch I've seen in downtown SF!  You'll break the bank at $9.50 if you also order naan, but if you do, definitely get the garlic naan.  Their lunch menu changes frequently, too, and you can mix/match amongst the 5 options.  The only permanent option (#5) is chicken tikka masala, and I always order that as 1/2 of my order.  If you're a fan of consistency and deliciousness, do *not* miss out on lunch at Mehfil.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-08", "description": "This place is ridiculous. \n\nI've come here on and off for four to five years. I order over the phone and I always go and pick it up. I always ask them how long it will take and it's always 10-15 minutes. I know that's bs, because I always have to wait when I get there, but that's ok. At least I know what to expect, and so I'm nice, courteous, and understanding.\n\nWith all that said, last night is the last time I'm coming here. \n\n8:30pm - I call in my order and they tell me 10-15 minutes, per usual. I'm with my daughter and she's about to knock out in her car seat. \n\n8:40pm - I arrive at Mehfil. At this point, my daughter is asleep. I run inside and try to pay, but the guy is on the phone. He doesn't even acknowledge me. About 5 minutes later, he waves a lady down and she swipes my card and asks me to take a seat as the order is still being prepared. I told her I will be back. \n\n8:55pm - I run back in and take a seat. Still nothing. The lady acknowledges me, but I go back outside.\n\n9:10pm - It's taken longer than I would like, so I wake my daughter up and take her inside with me to wait. We sit down together and my daughter is still half-asleep. I ask the lady when the food is ready and she asks me to repeat my order (even though she took my money and confirmed me order oh, about half an hour ago). She said she will check on the order. It's clear to me that the order was never started. I woke my daughter up for this? Since I've waited this long, I might as well wait some more, right?\n\n9:20pm - The guy who initially ignored me comes by and asks me, \"you placed your order already, right?\" At that point, I had enough. I told him to \"forget it -- I've already waited over half an hour for the order and it's still not ready. Forget it x 3.\" He didn't offer to refund the money or apologize or anything. I just walked out I was so angry at them.\n\nBottom line tl;dr version: They took my money; made me wait nearly an hour; did not give me my food; did not apologize; did not refund my money; so I took off and will never go back to this wretched place ever again.", "author": "Ken L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "Stopped by with a couple of coworkers for lunch recently. We ordered three curry dishes and some naan. Food was very good, on par with the places I've been in the TL. Service was friendly but our waitress was inexperienced and it took 30-35 minutes to get our food. Fortunately we weren't in a rush so it wasn't a big deal, but it could have been challenging if we were trying to get out in an hour or less.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "I was going to get something basic and cheap BUT their sign outside captured my eyes. Ordered a Chicken Tikka Masala and man it does not disappoint! Soooo good! The person who was serving the portions was helpful as it was my first time. Order in the back, walk to the bar area to pay. They charge you a dollar if you use a card but whatever. Its worth it! The food is delicious! I will be back for more!", "author": "A o S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-25", "description": "Food - 4/10\n-Subpar Salad\n-The Tandoori Shrimp was over-seasoned, to the point where I could not taste any difference between it and Tandoori Chicken. Bad\n-Okay rice\n-The Naan tasted great. Warm and Fresh!\n\nService - 6/10\n-Nice waiter overall, but forgot to get naan for our table until the end of the meal\n-No extra water left at our table, which with spicy food would be really nice. No waiter in sight, so I got up and got a pitcher of water for our table. A bit later on, the waiters were much better at bringing water to our table.", "author": "Brian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "I came to Mehfil so many times so i felt im obligated to write a review.\n\nCame here mostly for the lunch specials. CASH and super quick if you want a hearty and filling meal. \n\nMy favorite dish is saag paneer. Their chicken tikka masala was actually alright. \n\nI've also sit down and ate here once for a team lunch. Got lunch special tandoori shrimp and it was pretty good. Came with a small soup and salad (with very spicy dressing), those jumbo shrimps were heavily marinated and flavored. Came with a tomato-based dipping sauce which tastes like butter chicken sauce.", "author": "Ruxin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "I think this restaurant needs diamonds rather then stars. DELICIOUS !! One of my favorite resturant in the SAN FRANCISCO will be \"MEHFIL INDIAN CUISINE \".Because the food quality and quantity Is delicious .Especially my favorite dish is Chicken tikka masala and coming  to the staff is very attentive and friendly.They will make you feel very welcome.The inside is always perfectly clean and immaculate with lovely decor.if you live in San Francisco and haven't tried ....you must", "author": "Arjun Goud K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-01", "description": "Been here a few times for lunch, busy in general.  I enjoy their lamb dish very much, any lamb.  Good lunch!", "author": "CAScuba Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-06", "description": "I like the food here, but don't expect any requests to actually be honored. Twice in a row I've ordered green chutney sauce, and both times they simply don't add it to the order. I will not order here again.", "author": "Florian R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "Awesome place to eat indian food. Food is very nice.  Alot of special love to visit here soon", "author": "Dipin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-05", "description": "Really flavorful Indian food.  The staff is friendly and the food is delicious.  Prices are reasonable.\n\nThe sauces and seasonings are very nice.  We went for dinner, ordered 2 dishes, 2 naans, and 2 drinks and it was plenty with leftovers.  The sweet lassi was very good.\n\nI have not tried their discounted lunch menu yet but look forward to it.", "author": "Hui C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "***Warning: Only based on Lunch Rush Menu***\n\nPassing by this place to work a couple of times, I noticed that they have a $5-6 menu during lunch hours. I especially wanted to try them out after seeing one of my coworkers eating it. Forgetting lunch in my car one day, I decided to check them out.\n\nLocated like a block away from the Montgomery Bart Station, you can find this restaurant. Like I said, this review is only based on the Lunch Rush Menu. Instead of sitting down and ordering, if you ask for the Lunch choices, they'll send you to the back of the restaurant at a Cafeteria style counter.\n\nThere are like 5 or so different items to choose from. All times I've went, I've only had the Chicken Tikka Masala. They fill the bottom of the to-go plastic tupperware with rice and smother the top with a couple of pieces of chicken and the Tikka Masala sauce. This alone is only $6, and you can add Naan bread for an extra $1.50/$2.00 depending on your choice of plain or garlic perspectively.\n\n***Note: There is a sur charge if you pay with card***\n\nThe chicken is cooked well and the sauce is sooooo good. It's got some spice, but it's not overwhelming. You get a good amount for the value. It's definitely good if you're in the area. Forewarning, this price is only during lunch, which I think is only until about 5:00pm (not too sure on the end time)", "author": "Robert O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-06", "description": "I also have a love hate relationship with Mehfil.\n\nI've eaten the $5 lunch special at least once a week for over two years. It is delicious, but recently they started shorting people on portion sizes. Most of my coworkers eat here weekly as well and we all agree - the short guy (who took over serving responsibilities from the tall guy) does not dish out enough. It's to the point where I have to buy two lunches.\n\nThe only other good $5 lunch that I'm aware of is at the Gold Club.", "author": "Charles K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "I got m'fill at Mehfil! But really... they're good portions for the price. \n\nGo to the back and get in the line that is somewhat reminiscent of the soup Nazi episode of Seinfeld, and pay at the bar. Quick, cheap, and delicious.", "author": "August Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "I love Mehfil's lunch special, haven't gone for dinner. Tiki Masala is a safe choice and always on the menu with 4 other rotating options. Even with the raise in price from 5 to 6 dollars, it's still a great deal.\n\nWalk in, go straight to the back. They have the lunch special posted on the columns.\n\nThe people in the back will hook you up if you ask. They'll do half and half of two orders, or if you like it spicy they have a red powder they'll add. Be careful though! They like to add a lot.\n\nEnough food to keep you full by itself, but if you're really hungry get the Naan.", "author": "John O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "A colleague was visiting from Miami. We stood out late the night before so I was dreading lunch all morning (I couldn't even hold down water!). To my delight the Jasmine rice filled me up, tasted scrumptious, and neutralized my stomach for the rest of the day. Service was attentive and efficient. This spot has my vote!!!", "author": "Vanessa G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-13", "description": "RAW CHICKEN. \n\nAfter reading the other reviews, my colleagues and I were enthusiastic about trying this place for their $6 lunch box. Everything seemed fine until I started eating the dish. I noticed that the texture of some of the chicken pieces seemed off - not nearly as firm as they should have been. I just assumed it may have been some fat. Then one of my colleagues made the same observation and after a careful examination, we noticed that the chicken was still raw. \n\nI returned to the restaurant with a couple pieces of the raw chicken and brought it to the attention of the staff. The lady with whom I spoke did not seem to grasp the severity of the situation and just looked at the other staff for guidance. She mentioned it to at least two other employees, yet no one took any action. In the end, she took the chicken and told me that since I had only brought a small portion, she couldn't offer any compensation. Although I wasn't seeking compensation, an establishment that is truly committed to customer service would have gladly offered another dish at no cost. At the very least, the gesture would have been appreciated. \n\nAlthough serving raw chicken is never acceptable, it was Mehfil's handling of the situation that was particularly troubling. Their anemic response to my negative dining experience ensured that my first time would be my last time.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-29", "description": "I used UberEATS to order from this restaurant today. I ordered 2 chicken tikka masala. The description clearly states that it comes with rice. Once I got my order I didn't see the rice. I called the driver, he said no rice was given to him, I called restaurant and they say rice is extra. So I'm arguing with him bc I for damn sure know how to read and I didn't get my rice. I ordered extra rice at that. Shows on my receipt and still didn't get rice. I ended up hanging up on the guy and calling UberEATS. The lady was nice. She looked up the menu to make and seen the same thing. She calls restaurant and gets the same attitude that I received. UberEATS ended up giving me my money back and a homeless man got a decent meal for today. I'll never order from this place ever again. They do not honor their menu.", "author": "Charletta S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-09", "description": "They run a few specials a day and you go to the back and order from an assembly line style. My CTM box was about $9 with garlic naan. Good flavor and meal on the quick and cheap! Try to bring cash as they charge $1 for credit cards.", "author": "Alyssa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "A bead of sweat runs down my forehead. I cannot help myself. Rich deep flavors I will never be able to reproduce or fully comprehend. Wheelchair accessible with on-grade entry and dining area and a wheelchair lift to the bar. The Amritsari naan was so simple yet the profound impact of combining sesame seeds, onion seeds, fennel seeds and poppy seeds on a perfect naan has left me floored and utterly devoted.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "This place is great. I've been going here on and off for years now because my offices have been nearby. I usually get the takeout special, which has veg and non-veg options. The $5/$6 takeout is tasty, filling, and inexpensive. I love their beef meatballs takeout, and their veg options are very, very tasty, with a variety of vegetables in each dish, with a menu that rotates daily, especially for the veg options. \n\nTip: For the takeout, you can have \"half-and-half\", like a meat and a veg, and they'll just charge you the higher of the two (usually $6 total). This is a great option to get a more balanced meal.\n\nTip: For the takeout. There are several \"private public spaces\" including one just across the street and down a little where you can eat. Google private public spaces SF and you can see a list. There is also an app that shows them on a map.", "author": "Jimmy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-03", "description": "The rotation of restaurant operations at the severely jinxed address of 28 2nd Street has been mind-boggling. Let's see, it was once the Lunch Menu and then it was an Italian place called Castafiore. And oh yes, then there was the two-part South Asian period where it became Bindi, a place I liked and even received an ROTD for my review of it, and for no reason I could think of, it changed into Okra while serving basically the same food. Then for less than a nano-second, it became Cafe Med, where they had a pretty good Mediterranean buffet set-up with fresh hummus and roasted vegetables. But it closed its doors before it became a habit for me.\n\nI didn't bother reviewing this location since Bindi because by the time I was ready to write something, it changed into something else. But now Mehfil is trying to buck the odds and open their third restaurant at this location, even though their Folsom location is less than three blocks away. My friend Linda and I decided to try the new Mehfil on the second day of their operation, and it was a mixed experience for us and frankly a state of divine chaos. The staff was running around in a semi-crazed state forgetting to close out transactions and just not paying attention to the customers. Hopefully it will calm down to a more comfortable routine for them. Linda tried the $7 Tandoori Chicken Tikka Salad and felt it missed the mark considerably.\n\nThe slice of chicken tikka adraki was quite dried out despite having been marinated in yogurt. The spring mix, iceberg lettuce, cucumber, tomato, carrots and red bell peppers were reasonable enough, but she found the house-made Mehfil-E-Mango dressing indigestible. I went for the $5 vegetarian twofer of Channa Saag and Laganshala over rice (see photo). The Channa Saag is a chickpea and spinach puree which was tasty but a tad too oily for my taste, while the Laganshala is a vegetable stew of cauliflower, carrots, potatoes, and green beans seasoned with a number of spices. The latter was easily the best dish because it was the simplest. I'll probably wait a while before coming back since their opening week jitters started to get on my nerves.\n\nFOOD - 3 stars...the laganshala saved the meal, the rest of it needs work\nAMBIANCE - 2.5 stars...same weird bi-level space that makes no sense to me\nSERVICE - 2 stars...chaos is the word of the day\nTOTAL - 3 stars...barely holing onto 3 stars but I hate it to be the next in a long line of casualties at this address", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "My husband and I went here for dinner the butter chicken was amazing! We'll definitely be back! Fast and friendly service it was great!", "author": "Amy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-25", "description": "This place recently raised their veggie lunch special to $6. The food is OK,  but the extra $2 for Naan makes it less attractive then other Indian restaurants. This is a good option if your in hurry for the most part.", "author": "Jay P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-09", "description": "Mehfil was one of the options given to me by my friend for lunch today, as it was his turn to choose the place. The first option was Togo's, and since I would rather lick the sidewalk than eat Togo's (why? Personal opinion: it's awful, I don't like chains, and depending on the day, it's either Subway's pretty cousin or ugly little sister, - ain't guna cut it, especially with all the awesome sandwich shops in the Financial), so we went with Mehfil.\n\nI've been to Mehfil before, but it was in the pre-historic times when my palate was so immature and my stomach was so small; I think I actually ordered one piece of naan, and that was my lunch, not kidding. Since I've become a real human, I wanted to give it another go, and today I had a craving for Chicken Tikka Massala. And that is what I got.\n\nLunch special for this dish is $7, plus $1 for hot, charred naan which is always my favorite part of the dish. So $8, not too bad, it's cash only. My friend only had his lucky dollar, and I had $5, so the cashier let it slide and told us to come back another time and pay the rest. \n\nAlso, pretty sure they do cash only for the lunch specials because they are trying to dump old food, but I can't really complain. \n\nOR CAN I?!? The chicken in my dish was very dry and there was waaay too much rice, which was also dry. What am I supposed to do after all these carbs? Take a food-induced nap at my desk? I saved half, so I have a snack or dinner later. The Tikka Massala sauce was flavorful, but lacked heat. Made me fondly think back on Naan 'N Curry near Jackson that has now, sadly, been closed.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-31", "description": "Two stars for the food - decent if it actually was delivered timely. I've ordered a few times and the last two occasions took 2hrs and 1.5hrs to deliver, respectively. Needless to say the food was worm at best at this point. I also had to call them and check on the delivery status and the two excuses I got were \"traffic\" and \"car broke down, getting another car.\" I guess I'll have to find another Indian food joint where I can spend money or just not deal with the awful delivery service in San Francisco at all. Oh yes, forgot to mention, I live about 15 minutes walk away from these guys - not like I am on the other end of town.", "author": "Assen D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-26", "description": "It's a love hate type of thing.\n\nI love Mehfil. Part of me screams 5 stars every time I see it. That's my impatient part, which loves the fact that you can be in and out of Mehfil in legit *one minute*.\n\nBut I also hate Mehfil for being so sporadic in its menu. I'm sure its great for people who like meat, but for me, what I crave is the paneer bhurji. Unfortunately, they've only ever served it once :(. Just kidding, they probably served it more than once, but the lunch menu is mostly different every day (mostly because they always always always have chicken tikka masala), and paneer bhurji is just never there when I check.\n\nMehfil is certainly an experience to try out. The food is pretty delish if they happen to have what you like. Today I checked the menu for paneer bhurji, but found bengan bhartha instead. So today it's a 3 star.", "author": "Sahil P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "I've worked in the FiDi for over two years now and can confidently say that the $5 lunch special is the best value for lunch downtown. I eat a lot, and many places that cost twice the price do not fill me up (looking at you salads!). To be able to be relatively full (not too too full) for $5 is cheaper than I can make at home and bring in. \n\nIt is pretty basic with just rice and a topping, but the quality is pretty high and the spices/tastes are spot on. \n\nOne tip- ask for a combo of two options that you like and you usually can get a bit more variety. I will be back many times.", "author": "Ted L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-09", "description": "I've always loved the Mehfil over on Folsom St because they had such a great lunch special, but it was a bit of a hike. With this new location, the new Mehfil will be one of my go-to spots. \n\nThe lunch special is great $5-$6 ($5 for vegetarian, $6 for meat dishes). There are 5-6 options to choose from, and there's typically a chicken tikka masala on the menu. It's a great value as the lunches are a good size. And these lunch specials are to-go only. \n\nThe layout of this location is a bit odd as you have to walk all the way through to the back of the restaurant to get to the lunch specials and when I was there, the line was really starting to build by 12:15. The line moves quickly since all of the food is pre-made, but it is a bit annoying to have to wait in two lines (one for the food, one to pay).", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-16", "description": "I had the Daal Makhani on the Meal Pal menu.  This is the first time I have had something at Meal pal that I didn't like.  It was just plain and not enough food.  I later got some sushi.  I walked a few good miles to get here.  I am not a picky eater, but it just was not good.", "author": "Winston O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "Mehfil Indian is located walking distance from the Palace Hotel.  I could not find anything open close to the Palace Hotel and the concierge told me that Mehfil was open late.  The restaurant layout is narrow and has two levels.  The FOOD however is STELLAR.  I tried the Salmon Achaari aka Fish Achaari.  It's a unique recipe consisting of fennel seeds,. mustard seeds, onion, cumin, garlic and tomato in a pureed gravy.  The fish was Salmon and together with the Achaari gravy was the BEST Indian seafood experience I have ever tried!  I started with vegetable samosas and washed it all down with Taj Beer from India.  Please note I have been indulging in Indian cuisine for 20 years and have had eaten Indian food in Mumbai, Pune, Jaipur, Delhi, Agra, NYC, San Francisco, Boston, Miami etc.  The place has delicious food!  The manager and the waitress were exuding some kind of romantic tension vibe and the cook was a long white bearded gentleman who carefully watched his food creations come to life like an artist  The service and food are EXCELLENT!  The atmosphere is average.  Get caught up in the authentic Indian vibe.  This is a place for foodies and adventurers.  So stay home if you are an elitist or a food snob.  GREAT family run vibe.", "author": "David H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-01", "description": "This is a decent lunch place, I'd say. They give you a lot of food and the prices aren't outrageous.  It should also be said that finding a place to sit and eat in a work lunch timeframe can be a tall order in this neighborhood.\n\nWe had Samosas, which were great, and two kinds of naan. All of that was pretty fantastic. But the curry is bland.\nThat's just not okay.", "author": "Justin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "This was the best Indian food I've had so far in SF. I've tried about 7 other places via delivery (Mehfil was delivered too) and this has been my favorite so far. Ordered the Chicken Tikka Masala, Saag Paneer, with Garlic Naan", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "Not sure why this place has only 3.5 stars. Probably must be the service. I have only ordered delivery from this place and I have to say that this is the best palak paneer and malai kofta I have ever had. Tried the food at couple other Indian restaurants nearby which are also good, but this one by far takes the cake. I keep repeating the above two dishes so cannot comment on the whole menu, but these deserve 5 stars. Will be trying paneer makhani and biryani next time. Let's see.", "author": "Raj S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-12", "description": "Desperately looking for cheap tasty (un)healthy indian food in FiDI?? Look no more. 6 dollars, fast lines, and already in a takeout box. I recommend any of their chicken curries. You do NOT want to spend extra money on a side of naan, it is stale and bland! Head on to the back of the restaurant during lunch hours and they'll hook you up.", "author": "Menisha V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-11", "description": "I'm not sure what just happened. I was seriously craving curry and I've walked past this place for months. I finally had a longer lunch and decided to go in. Inside was much nicer than I expected. I got there at 11:15am... I walked in and was completely ignored. I honestly thought they weren't open. A girl gave me a menu once i asked her, I'm not even sure if she worked there, but the rest of the staff completely ignored me. It was the lunch menu but with none of the specials from the signs outside. Which was fine because I knew what I wanted to order. I waited ten minutes or so while everyone was running around creating deliveries or on the phone before I walked out. \n\nI was really looking forward to curry, but I don't think I'll be back. \n\nDon't come here before noon I guess. Seems their delivery business is pretty intense.", "author": "Lara E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-06", "description": "Food was very tasty when I went in and sat down for dinner. Not sure about the pricing, but it wasn't overly expensive. Good service.\n\nHowever, when I went and got to-go at lunch the quality was definitely not as good, but the price was only $5 or $6. You definitely get what you pay for at this place. I would probably only recommend lunch if you're really craving Indian and you need it really fast.", "author": "Kyle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "I literally LOVED this food; AMAZING service; super super clean premises; EXTREMELY welcoming; if I could give this 7 stars out of 5, I ABSOLUTELY would.", "author": "Connor M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "This is my favorite lunch/dinner spot. Decently priced for the quality of the food. I haven't tasted anything I didn't like. \n\nSamosas are the best here. I don't know what the sauces that come with it are, but they're all really good. \n\nI also wish I remembered the names of the dishes I like to get, but I don't. They have an awesome happy hour, $4-$5 for beer, but with how good the food is, I almost have no room for beer. \n\nMy coworker and I always split an appetizer and main dish, and between the two of us, the bill comes out to $6-7 bucks each. That's a deal in the Financial District.\n\nTheir menu also changes day-to-day, which I think is a great way to keep fans coming back. I know i'll keep coming back/", "author": "Nicolle B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-03", "description": "Was craving butter chicken but the chicken tikka masala was close enough.", "author": "Cindy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "I've never dined in-- I assume the rating is due to service, because the food is so good!! This is my go-to delivery place when I'm missing home or just want comfort food.\n\nI'm super picky with my indian food, in particular the consistency of saag, which most places get wrong (oily, too pureed, too watery, etc). Mehfil has the best saag paneer  in the city, and I have tried a LOT of places. If you ask for it spicy, it will be spicy.  Shahi paneer is also delicious here, and their naan is very moist.", "author": "Sonia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "I passed the place 3 times before going inside. My third pass I noticed and Indian couple eating inside so I said. \"Must be decent.\" \nWhen they were leaving I asked where they were from and they said Delhi.\nThey heard about the restaurant from Indian friends and family.\nEnough said so go eat wonderful Indian in SF. \nRon", "author": "Ron g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-25", "description": "We came here for a work lunch because Amber was super full (might be due to a convention or something). We ordered off the a la cart menu and that was a mistake. The food took FOREVER to come out!! Our waitress was a space cadet too, although she seemed nice, but she just seemed like she was somewhere else.\n\nWe shared a few naans, the saag paneer, the chicken vindaloo and the lamb biriyani. The food was very good -- it was flavorful and they fished out most of the whole spices so I didn't end up with a grenade in my mouth that I had to find a polite way to spit out in front of my coworkers. \n\nFor the money, I would much MUCH rather do the lunch buffet at Amber.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-23", "description": "I ordered a chicken biryani from here and it's the worst peice of crap I ever ate. The raita was spilled on the rice during delivery, it tasted like feet. Never coming to this dump.", "author": "Raghavendra B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-09", "description": "The $5 dollar lunch special is great! Average quality Indian food. \n\nKeep in mind there usually is a long line during lunch but it goes by quickly.", "author": "Ashwin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "Really good Indian food and you can have lunch boxes staring 5$ with rice and yummy vegetable! For the lunch deals there is not much choice but considering the speed and the price: Great!", "author": "Irina P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-28", "description": "First let's start with the positive- the tikka masala was tasty! Just the right combination of spicy and good round flavored. The rice, was fine. The naan, was disappointing because two of my four pieces weren't fully baked and still doughy. There wasn't really any ambience, which is just fine I'm not picky about that. Service was quick to take my order and deliver it but took forever to get my check.", "author": "Amber R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-20", "description": "My co-worker took me here for lunch on my first day (yay corporate expense account!) and we really enjoyed the food. There's some interesting stuff here even on the lunch menu that a lot of Indian places don't have.\n\nWe both decided to do combos of one whole dish and a second half-dish (for $5.99). She got the Tandoori Salmon and Bhindi Masala, and I got the Punjabi Goat Curry and Laganshala. We also both got Zafrani Lassis, because I'd heard that was the unique thing to get here.\n\nAll of the dishes were tasty, but the salmon took the cake for most aromatic. It came on a sizzling plate and smelled wonderful--fish mixed with an array of exotic spices combined with vegetables. It was pretty delicious, though I couldn't have eaten an entire dish of it as it was quite rich. If you're not an okra fan like me, skip the Bhindi Masala. No amount of spices can cover up that slimy saliva texture. Yuck! The Goat Curry was a little spicy and very tasty, with tender pieces of goat meat. The Laganshala sounded great, but seemed kind of....bland....to me. If you are a fan of the original tart froyo flavor, you should definitely try the Zafrani Lassi, which has the same tart creaminess with a bonus of other fruity flavors and spices.\n\nDespite the fact that we had a \"sit-down\" lunch, the food came out really fast. Yet, we were allowed to enjoy at our leisure without ever feeling rush. Praises for the service are definitely warranted--the people who work here are exceptionally friendly and hospitable.", "author": "Josephine L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-19", "description": "Despite their menu claiming dishes are served with rice they aren't delivered that way via Uber Eats (or other delivery services for that matter). To make things worse, when we called to ask about this after not having rice delivered they were rude as could be on the phone and claimed the menu says nothing about rice with the dishes, even though it clearly does. Will never order from or eat here again.", "author": "Nate D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "It's interesting I've been coming here and ordering delivery from this place for close to 3 years now. I used to go here for lunch both to eat at the buffet, order from the lunch plate area and delivery for both home and work. Since I've moved jobs now it's primarily delivery for at home but we've ordered for work lunches and the experience has been the same.\n\nLet's start with the lunch experience. You could get a quick inexpensive rice and another option for 6 to 7 bucks and you're in and out for those on the go. The other option was to grab a to go plate and you could grab from the same buffet that you could grab from if you ate there. I've done both and both are solid.\n\nDelivery. By far this place has been the best delivery restaurant of any cuisine I've ordered from. It's the only place that consistently delivers before the stated time. Most places are always late which I understand because SF is a hard city to get around, which amazes me even more that this place is further than some of the restaurants we order from and they still deliver in half the time. \n\nNow the food. It is consistently good. I've ordered a ton from here and I've yet to have a time where my wife or anyone made any comments about \"hmm this time something is off\". \n\nI have to say it makes sense. I recall the owner was the one usually at the cashier during busy lunches. He was always friendly and you could tell he made an effort to make sure people were taken care of.", "author": "Hyung L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-06", "description": "We had our early dinner here. Place is cleana and ambience is good. We ordered paneer chickpeas. It tasted like they just boiled and served it. No salt or any taste of spices. Rice were also half cooked. Was not a very good experience.", "author": "Nik K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-26", "description": "My office is right next door, so this has become my No. 1 lunch spot. For $8, you get a big bowl of excellent chicken tikka masala, plus better-than-average naan. There are other lunch specials daily, but I've tried very few of them (the saag paneer is great; wish they had it more often). Highly recommended.", "author": "Noah T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-17", "description": "Naan pretty good. Saag paneer okay. Lamb vindaloo was alright. Was busy during lunch hour near financial district. Service was fine and food came quickly.", "author": "Swapan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-30", "description": "biggest bang for your buck in my opinion around fidi for a dellicious and filling lunch!\n\nthe bento box to go is about $6 depending on what you entree you get with the rice, and it's enough food to fill your empty growling stomach and to put you to sleep in the afternoon. \n\ni usually get half chicken tikka masala and half a vegetarian option, and ask for it spicy - they sprinkle some nomsies powder that will sure make you red in the face! teehee.  also, a trick is to get a side of tikka sauce in a smaller container (they charge $1 extra) - its soooo worth it! then you can drown all your delicious rice in that sauuuceeee! mmmmmm! i pretty much have this once every two weeks. \n\n#tikkatuesday ftw.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Best to go place for Indian food in a very reasonable  price during lunch time in San Francisco.", "author": "Kalyani S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-21", "description": "I came here for lunch with a few friends. They have a different menu everyday. We opted for the sit down experience, but I think it's more bang for your buck if you take it to go.\n\nEveryone ordered different dishes to try, including a vegetarian dish, lamb, chicken mushroom, and chicken tikka masala. All the entrees were delicious. The lamb was nice and tender, and the vegetarian dish had a nice heartiness to it. The tikka masala had delicious sauce, but the chicken mushroom's chicken was a lot more tender. The dishes came with a small serving of lentil soup, plates of \"salad\" that were cucumbers and tomatoes, naan and basmati rice. We were all pretty stuffed and satisfied after our meals. The total came out to be around $15 per person including tax and tip.\n\nI think the food here is great, but it's a bit overpriced, especially for sit down. When you takeout, you get basmati rice with your choice of curry over the rice. It's a pretty big portion for around $6-7 which I think is much more worth it. I'd recommend this place, but take out only.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-22", "description": "Worse food ever. Do your self a favor and pick something else. A slice of pizza from anywhere will be better then this. Main ingredient in food is water. Chicken Tikka Masala watery and lassi was yogurt flavor water. Pathetic! \n\nCheck the lassi I poured into a bowl to show how bad it was and its almost like cheating customers. \n\nSeriously this is what they call lassi!!!! \nhttps://www.youtube.com/watch?v=EfY_NvnaUyc&feature=youtu.be", "author": "Nitesh J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-20", "description": "Good alternative - but Mehfil gets a 1-star for ambiance and warmth for a dining establishment.  I walk down 2nd street every morning and most mornings as I pass by their window at 6:50 AM, the front booth by the sidewalk window is full of dirty plates, silverware, napkins and glasses from either the evening before - or the evening before that!  Sorry, but if the management cannot clean up after themselves, so the restaurant looks presentable as hundreds and hundreds of people pass by early in the AM, I wonder what the kitchen or back area looks like?  Is it clean?  I will post a picture next time I see...", "author": "GJ C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-10", "description": "First time here, had the $5 shahi paneer lunch special w/ rice. Seems like demand up and quality down?", "author": "Shruti D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-22", "description": "Are you kidding me? I can get a decent Indian meal at lunch for $5? Why couldn't I have found this place earlier?\n\nThey usually have 5 lunch specials, ranging from $5-$7. Two vegetarian dishes and three non-vegetarian that change every day.\n\nI'll admit, it's not the best Indian food you've ever tasted, but for $5 it's great.", "author": "Greg A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-15", "description": "I read the one review about seeing a big bottle of food coloring out in the open, and it's not that I didn't believe him, it's more that I didn't think it would be THAT blatant!\n\nI walked up to the counter to get lunch takeout and there it was sitting on the counter in front of the kitchen right next to the take out menu with the label facing the customers (see picture). Yup, that's a big old bottle of orange food coloring. INTERESTING!\n\nI will say that I've only gotten takeout lunches from here and the chicken tikka is acceptable and cheap. It's not great: the chicken is almost always dry, the chunks are too big to cut up with the flimsy plastic fork you get, but for a quick lunch it's \"acceptable\". No more, no less.\n\nI wouldn't go in and sit down to eat here.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "Great customer service!!! Aman there is always polite and very courteous. Their naan is always fresh & when I get it delivered, it always come really warm! Their chicken biryani is also good, the chicken is always fresh. I've never had a meal from there where I've been disappointed. Can't wait to try more food items here!!", "author": "Sonya L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-22", "description": "Took over two hours to get delivery.  \nLast time I ordered they forgot something. Should have learned from their first mistake.", "author": "cheryl R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-17", "description": "Came here last week with my friend for lunch. the food is aite.. the service is kinda slow. they do give you a good portion... plenty of carbs lol. Naan AND rice.\nthe soup that comes with the special is yucky. lol no flavor.\n\nwe had the cranberry chicken. It was ok.. definitely not my most favorite thing in the world. I don't know if i will be coming back... =/", "author": "Judy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-22", "description": "Cheap, tasty, fast, Indian food.  For a fast lunch, walk straight to the back and order one of the 5 dishes.  Also, you can mix 2 of the dishes together.  Don't forget to order a Naan by the register.  Also, paying with cash is cheaper.  My friends love the red sauce too (also at the register).", "author": "Ryan I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "The lunch box is a steal here $5-6 out the door but cash only so be sure not to be banking on your credit card. I can't speak for the sit in experience but would recommend the tikka masala box. I wish I could review the other boxes but each time I go I'm just too tempted by the sweet sweet tikka masala.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-14", "description": "I had the 5$ veggie lunch box.I bought 2 of them and apparently this is the only item that is CASH ONLY !! WTF!! You take cards for everything else and when i bought something for $10 you say CASH ONLY..! ? I ended up paying couple bucks extra to pay with card..\n\nNext I was about to sit and eat my lunch and they say, I need to sit outside and eat as its a lunch boX. Again, WTFFF!!!\n\nRude Sh!t.. PLEASE AVOID..", "author": "Karteek P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-15", "description": "Gross...sat down and a roach crawled past my shoulder. So gross. We showed the waitress and she pretended it wasn't there. We walked out.", "author": "Chris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "I well like to say that they have very good food had the chicken tikka and the kabob and naan chicken was fresh and the food was really good need to go back in and try more food oh the sweets are good after you had a good meal  I tell all my friends go try the food you'll wana go back for more...", "author": "Sunny M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-20", "description": "This review is for service only:\n\nI was in there packing up food for a to go order and the waiter was overbearing and rude. I did not use their supplies nor did I ask for help, but the manager insisted on arguing with me about adding saran wrap to their \"leak proof\" container. I was biking and needed to make sure nothing spilled inside my backpack. Lastly, THEY forgot an item and once I returned for it the manager found it permissible to scold me. FIRST, I was a customer. SECOND, they should not blame customers for their own mistake. THIRD, if they treat customers like this they must treat their staff worse.\n\nI refuse to patronize restaurants that do not respect people and if they feel comfortable being overtly rude they must care little about the quality of food and care at their establishment.", "author": "M M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-21", "description": "Food wasn't that flavorful, not spicy at all. Service was horrible. Asked for a napkin, water for my wife and I two separate times. Never got it. My wife had to wait in line at the bar to get water.", "author": "Rowan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "I love this place, the lunch specials are really nice.\nTASTY TASTY TASTY\nGOOD GOOD GOOD", "author": "Simran B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "Great food and service, not to mention the food is very well prepared and healthy. i highly recommend this place for a great Indian Meal!!!!!", "author": "Bobby B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-02", "description": "These guys are just the worse.\n\nWent in with a team from work to sit for lunch. Everyone was dirty, food quality was low, and the staff was lacking basic manners.\n\nWon't be back to this place.", "author": "Restaurant C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-23", "description": "I have this at least once a month. A bit pricey, but pretty darn good so you don't mind paying the extra few dollars.", "author": "Kimberly N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-29", "description": "I have been ordering from Mehfil for several years.  They have historically been very prompt with their deliveries, and the food has been excellent.  In the past couple of months, however, the service has declined dramatically.  I have had several orders in the past few weeks where the delivery took over an hour, and the restaurant is only two blocks from my home.  When I called, I was told the driver was on his way.  When I called again after 30 minutes, I was told the same thing.  Tonight was the final straw - nothing delivered after 40 minutes, and when I called to inquire, I was told the \"driver is outside my door.\"  20 minutes later, the driver arrived with my order, MINUS ANY RICE.  I don't know what has happened here with Mehfil, but I'm done ordering from them.  Their service and quality has declined dramatically. Very disappointing.", "author": "Sig L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-29", "description": "They're super cheap and fast, especially for a place in the financial district. They also deliver consistently on time. \n\nTheir naan is good. While it's not mind-blowing or anything, it's correctly made, and that's all I ask. As for their curry though, while the flavors are there, the meat is usually overcooked and manages to be dry, and the vegetables are just flavorless. \n\nMaybe a good option for those looking to save money, a quick bite, or just something to fill you up. Not so much if you're looking for quality.", "author": "Alan Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-02", "description": "This place is a good place if you want to sit down and grab some indian food quickly. However, the Chicken Tika Masala was okay but I felt it was a little bit overpriced.\n\nAtmosphere and service was excellent though", "author": "Alvin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "Bottom Line: One of the best tasting restaurants around and it is unbelievably inexpensive, $5!\n\nThis is excellent food and one of my favorite spots for lunch. The lunch box is $5 dollars for veggie and $6 for meat combo. Naan is another dollar but you really don't need it because you get a ton of food. I recommend getting the veggie combo because it is so savory and filling. The food is so comforting; you can feel the love in the cooking.\n\nI guess the only downside is that lunch is cash only so just keep a twenty at your office desk so you don' miss out.", "author": "Matthew T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-29", "description": "Some people just love this place, but I found the seasoning on the dishes to be a bit mild for my taste.  They have a nice deal at lunch, served family style.  We did not leave hungry.  I can't think of a better Indian option in this area.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "Friendly people, delicious food. and the lunch takeout special is an exceptional deal! They vary the selection daily (besides a few mainstays like their chicken tikka masala) which keeps me coming back to try something new. I should mention, they're lunch box service is exceptionally fast during the financial district's lunch rush, so it's a good option when you're in a hurry.", "author": "Brendan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "So happy I found this place! Close to my work, fast service. Cheap lunch box; 6.00 chicken tikka masala.  The food was packed  hot to order, good portion, and most importantly, spicy delicious! YUM...I need my Indian food fix sometimes!", "author": "Marvella W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-06", "description": "I've been coming here for a quick and easy lunch for the last couple years and am very happy with the Chicken Tikka Masala. Head to the back counter, get a bowl of CTM over rice, grab some naan, and then pay $8 at the middle counter. There's never a line and you are in and out in under 5 minutes. They usually have a vegetarian option and some other rotating lunch options, something with meatballs that is pretty tasty too.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-07", "description": "I wouldn't say this is the best indian food, but I always go to the back of the restaurant and get the take-out. Maybe the sit down, fresh food is better. \n\nLunch special is $5 and naan is $2. It says cash only, but i usually just use my card and they charge an extra dollar. Mehfil is right across the street from my office so it's very convenient. \n\nI have yet to try anything other than the chicken tikka masala, but it's pretty good", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-06", "description": "Came here today because I've heard about their awesome cheap lunch to go options. Mehfil doesn't disappoint! Just walked in to the back and ordered the chicken tikka masala. The guy filled a to go container with basmati rice then added the tikka masala right on top. He gave me my order then I walked over to the counter to pay. It's cash only for this deal so it was only $5. I hear if you add naan it's only $8.\n\nSuper delish tikka masala that hit the spot on a cold rainy day. I definitely would want to come back to try their other lunch specials! Quick, cheap and satisfying lunch is hard to find downtown!", "author": "Christine W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-21", "description": "Happy camper after this meal!  Ordered take-out via telephone and went to pick it up.  The food was ready in about 15 minutes and nicely packaged so nothing leaked.  The smell of the garlic hummus alone made me want to just eat right then and there.  When I went inside I noticed that the inside is very spacious - not fancy by any means but very casual and has a cafeteria kind of feel.  But, very nice staff!  When I went at 6:30pm on a Sunday it was nearly empty but there were a lot of take-out orders on the counter.  I'm a vegetarian so the following was ordered: \n\n**Kachumber Salad $3.50\nDiced cucumber and vine ripened tomatoes mixed with spices and lemon juice.\nSaag Paneer $9.95 (so good with great mix of spices and lemon. no oil!) \n**Home made cottage cheese cubes cooked with fresh spinach leaves with a little yogurt, ginger, garlic, and tomatoes. Served with Indian basmati rice. (this is good everywhere and this place was no different - great flavor)\n**Aloo Bengan $8.95\nEggplants cooked with red onions, ginger, garlic, and vine ripened tomatoes with white potatoes. Served with Indian basmati rice. (YUM!!)\n**Malai Kofta $9.95\nAssortment of fresh vegetables mashed together and mixed with home made cottage cheese formed in cylindrically shaped dumplings cooked in a base gravy of saffron, cashews, ginger, garlic, tomatoes, and garam masala. Served with Indian basmati rice. (Indian meatballs in a delicious cream sauce - delish)\n\nDefinitely will be ordering more food from this place!", "author": "Naomi P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-11", "description": "TL; DR: Great food! Slow delivery, broken online UI.\n\nOrdered using their online tool for the next day. Didn't get an email response confirming order. Emailed their info@ address, and got a bounce back. Called the next day and was told the order went through. Confirmed order and delivery time, everything was great!\n\nUntil their driver got lost and was about 45 minutes late. Since this was for a meeting I was running that wasn't great. And we've gotten delivery from them before, which is was why I ordered from them in the first place. So that wasn't pleasant, especially when they told me the driver was in the building when he wasn't (I checked with security and reception).\n\nAgain, their food is great. But this experience was stressful and my meeting was going to be stressful without exterior stressors. I may order from them again, because their food is very tasty, but I will think twice about it.", "author": "Jacob R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-11", "description": "Very disappointed at the service of this place.  My Wife and I have eaten here before and decided to do take-out.  The food is not bad not spectacular.   My experience for this review is related to the service.  \n\nToday is a North Indian religious day called Karva Chauth.  The main focus of this day is my wife fasts the whole day until the full moon comes out.  So basically she was very hungry by the time it was time to eat.   I called made a take out order on the phone to time it with when the full moon shows.  We drove to pick the food up and they stated there was no order put in.   Then they managed to be very rude about it after the fact to my starving wife.  I understand mistakes are made but then fix the mistake make the food right there!   We ended up paying extra and getting a great meal from Amber that was ready and packed for us in 15 minutes.  \n\nWe wont be coming back to this pace!", "author": "Aseem n."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-15", "description": "Always get the chicken tikka masala to go lunch box for $6 which is a good deal for the area and it's pretty good. \n\nHowever, service is lacking - I always greet the gentlemen in the back serving the food however they do not respond and simply state \"Next.\" Also, is 10 cents for a bag necessary at a location that serves food and doesn't even enter the bag into the cash register system?", "author": "Nikhil V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-03", "description": "I finally tried this place after a co-worker suggested this restaurant for food. I love hot & peppery Indian food. I was very happy they were open in the evening on a Saturday. I was attending a nearby gallery that does not serve food, I came to get a quick bite. I ordered my standard Saag Paneer which comes with rice included and a Taj Mahal. It looked good and was fresh but I asked for it to be super spicy & hot and it came salted perfectly but with no pepper heat whatsoever.  This makes me not want to come back for fear it would be bland.", "author": "Infodiva B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "some of the best indian food i've had in a while and very reasonably priced! cute space and the staff is also very friendly. kind of hard to find in a car and trying to figure out parking though. you could blink and you'd miss it.  but still, very quaint little space.", "author": "Sam C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-15", "description": "This place was great! I ordered the Chicken Tikka Masala lunch bowl and it was so delicious. Just the perfect amount of spiciness and it was very flavorful. You can't beat a  $5-7 lunch in the financial district, its quite a gem!", "author": "Gabriela S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-23", "description": "9pm on a Sunday night in the Financial District = slim pickings if you're starving, and that is when and how I found myself. Mehfil was super close to my hotel, but I went on a mile detour because I left my hotel headed in the wrong direction. On the upside, I got some exercise, worked up even more of an appetite and tested the safety of the Financial District streets as a lone woman. \n\nWhen I finally arrived, I was the only customer, but I was greeted quickly and warmly. I ordered the Vegetable Korma and was pleased to see that they don't get ya with a la carte rice. I ordered roti to accompany my curry. I thought the korma was delicious filled with a variety of vegetables and raisins for sweetness. I had no problem finishing the entire bowl on my own. I see in the other reviews that they have a very affordable lunch option, and I would definitely give that a try if I happen to be back in the area and looking for a lunch spot.", "author": "Misti Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-25", "description": "I have walked by this place many times, but never stopped in. Today I was craving Indian food, so I stopped in to buy their lunch special. Walk all the way to the back and choose one of 6 options--for either $5 or $6. I chose Chicken Tikka Masala over rice and received a  huge portion for $6. The person behind me asked for half/half, which I had wished I knew about because I like a little variety! Next time!\n\nThe CTM was o.k. --they use breast meat, but the pieces are so huge they are somewhat tough and don't have the opportunity to simmer in the yummy sauce. If they cut the chicken smaller, it would be easier to eat and you would get chicken in every bite!\n\nYou pay (in cash) at the bar where you have the option of adding naan for $2--sort of a rip off, but I didn't realize there was an extra charge until I received $2 back, instead of $4.\n\nI'll be back to try out some of the other dishes. A fast, cheap lunch in the FD!", "author": "Mrs P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-29", "description": "$5 for lunch holy Jesus that is amazing.  It's also stupid fast.  The Indian is decent, not perfect.  But the price makes it pretty unreal of a deal, kind of a steal.\n\nWhenever I go here I seem to get mehfil of decent Indian at an even more decent price.  Recommended as an inexpensive lunch option!", "author": "Alex H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "The combination of price, location and quality is simply amazing. Depending on what you ask for, you can grab lunch quickly and as cheap as $5. Since I'm a vegetarian I had to opt for a slightly more expensive option at $6.50, but God do they deliver incredibly well for that price point.\nYou should definitely try it out if you're in the area; I have not tried eating at the restaurant itself, but it looks a log bigger than many other established places around the city.", "author": "Dinesh H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "I told a coworker that I wasn't into Indian food. He said this place would change my mind. He was right! I tried the butter chicken and spinach and both were delish!", "author": "Lindsey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-14", "description": "I only come for the $5 vegetarian cash only take out lunch....since I am vegetarian and only need lunch in this hood.  On days when there is something with saag,  they get 6 stars.  Days without spinach but maybe daal or chana, 3-4 stars.   Other days I just don't bother coming in as vegetables on rice is not a lasting meal, which puts the \"meh\" in \"Mehfil.\".\n\nThey used to have their daily menu online so you could plan in advance, but not anymore.  Fortunately most days they post the menu in the window.\n\nFellow take-outers, please get your money ready while standing in the line to pay.   You know the drill!   Thanks!", "author": "Ellie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-23", "description": "Used to be on folsom street and moved to new location. Never had their fast and cheap lunch specials but have been there a few times for dinner at the new location. Like their vegetarian paneer saag and chicken korma", "author": "Kenneth L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "Amazing takeout lunchtime special. Chicken Tikka Masala for $5 - great quality and quantity.\n\nI am British and love a good curry. This hit the spot on a budget with no lunchtime waiting", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "Best Indian take out in the area! Every time I come here, I'm greeted and even winked at. They have three locations, prices are great, and the food is awesome. \n\nThree wise tips is all you need: \n\n+Walk to the back and get lunch take out of Chicken Tikka Masala that comes in a bowl with rice (I've tried everything, it's the best) - $6\n+Purchase Naan - $2\n+Pay with Cash (Avoid $1 fee)", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-13", "description": "I have a very sensitive stomach to different food types, but I can say is I have tried almost everything on the menu and it is amazing. The flavor of all the dishes is so tasty.  \n\nGreat place to get a quick bite after work..", "author": "Jonathan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "Some of the best indian food I've ever had! My favorite go-to place when I'm craving some saag paneer and chicken tikka masala. The customer service is great - the staff is friendly and attentive! I definitely recommend Mehfil to everyone I can!", "author": "Japjot B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-16", "description": "I finally got around to trying this place yesterday for lunch.  I was drawn in by all the Yelp reviews about the yummy to go lunch specials that change daily.  And the price!  Between $5-7 for lunch?  Oh yeah!\n\nThey update their menu online every day so you can decide what you want before you even step foot inside.  Head to the back of the restaurant where you can see the piping hot food behind the counter.  I opted for the chicken cranberry, which was similar to tikka masala but with dried cranberries added.  For $6 I got a generous heap of chicken cranberry, rice, & fresh naan.  The chicken was tender & the chunks were huge!  I ended up only eating half of the naan since the portions were so large.  They also serve wraps & have a few vegetarian options.  \n\nI did notice that they charge $1 if you pay for your to go order with a credit card, so be sure to bring cash.  For $6 you won't need much of it!", "author": "Erin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-06", "description": "We got food here for Diwali and it was disappointing. The aloo bengan and channa was OK. The meat was bad, especially the chicken which was undercooked and chewy. I will pass, too many other good options for Indian and Pakistani in the neighborhood.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "I'm not the biggest fan of Indian Food and totally left this off my list for a number of years. My wife is big on Indian food and using her ways of subtle and constant manipulation she was able to get me to go to Dosa. I have a whole separate review on Dosa but that re-experience of Indian food changed my outlook towards the cuisine itself. Maybe my palate matured or maybe it just took me that long to get over the very last experience that floored me for a couple days.\n \nMehfil is completely different from Dosa. It's a good experience and probably one of the better values in the Financial. They have a menu that is constantly updated. All the food comes hot and fresh. They provide everyone with a small cup of tasty lentil soup and a starter salad to be shared by the table. They also bring out naan for the table to use for scooping up the delicious sauces. I've had their tandoori chicken and prawns and both are excellent. Their masalas are also excellent. It's tasty and affordable. It's best to get in before 11:30 on a normal day. But they do have quite a number of tables. \n\nI gave them 4 stars and they are a superb restaurant for their target market. They are great for a quick or extended sit down lunch. The servers are friendly and again you can't beat the solid prices.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-20", "description": "The price is cheap and so is the food...\n1. Uncdercooked rice- gave me Tummy Ache :(\n2. NO CASH? Have to PAY 1$ extra ???\n\nNot going to this place again!!", "author": "Vinoothna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "They are in this area from long time, I have picked Togo boxes from more than 3 years. Location has changed but taste is same. Most affordable I the SF downtown area. Their menu changes everyday so you can pick boxes for whole week. Same items if you dine-in its costly. Like this place.", "author": "Anurag M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-11", "description": "I came here for lunch with my buddies on a Friday. We ordered from their lunch menu which changes daily. The dish comes with basmati rice, naan, salad and a small cup of lentil soup. \n\nI ordered paneer bhurji ($9.95). This is the first time I had this dish so I may not have a good benchmark. The dish is flavorful from coriander powder, turmeric and cumin seeds. Paneer is mashed well with the curry, diced tomatoes and green peas. The portion is quite generous, so it kept me full until late evening.\n\nYou can ask for more rice or naan if you want more.", "author": "Saran R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-23", "description": "Its hard to beat $5(veg) lunch combo(2 entree + rice)\n\nMy favorite here is Dal followed by  saag paneer.\n\nThey only have 2 veggie items everyday. Some items are not good.", "author": "Hari M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-09", "description": "Sweet deal.\n\nFood: Cubed chicken cooked in yogurt and spices, topped with sweetened dried cranberries and served atop rice. Lots of chicken and quite a bit of spice.  Good.\n\nPrice: One of a few lunch specials for $5. Changes each day. Great.\n\nThree stars for the food. Five for the price.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "Delicious food, awesome staff.\n\nWould totally recommend to anyone looking for a tasty lunch in the city.\n\nOrdered 3 dishes, 5 arrived. Two of them on the house. Naan was wonderful.\n\nI'm so full, time for a nap.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-14", "description": "3 Stars because I have had good experiences in the past but based on my recent visits I'd give it 1 star. \n\nI always seem to order the same entree at this restaurant. Kadhai Paneer or Dal Makhani, Rice and Naan. The Kadhai Paneer is great and one of the best I've had in the bay area however off late I've noticed that the entrees seem to be lacking taste and the service is getting really bad. I had to wait for 20 minutes for a waiter to show up after we got the table, wait another 50 minutes for the food to arrive after we ordered the food. The waiter forgot the order and asked us to confirm the entrees when we asked him whats taking so long. \n\nDont get fooled by the sign that reads we change our menu everyday. Well the menu literally changes but the food is the same with a new name every day.", "author": "Rahul P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-27", "description": "I'm giving 5 stars for the lunch grab n go $5-6.  (I haven't been to the sit-down yet, but I think I need to try that salmon)\n\nThe best Saag Aloo I've ever had! Over a rice bowl with the cranberry chicken, a lighter version of chicken tikka masala. They will make a combo of any 2 items for the same price as 1. Great deal SUPER fast, all the other luch spots had big lines...maybe I just lucked out. YUM! I'll be back!", "author": "raven n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-03", "description": "I had sniffed the Mehfil at 2nd and Folsom and it smelled wonderful, so I was heading towards there for dinner and found this place on the way. Same place, they said. OK, I'm lazy enough to not walk 2.5 more blocks, I'll bite.\n\nI ordered malai gosht (lamb), the kachri murag (chicken), the zafrani lassi (20 kinds of dried fruit and saffron) and the amritsari naan. My world got ROCKED.\n\nA few years ago, a friend took me to a place in Riverside that offered malai sauce and it was the best Indian dish I had ever eaten, of the many wonderful Indian dishes I've eaten. I haven't been able to find it since and I had forgotten it. When the malai gosht showed up, I finally remembered. It is a cashew, cream, cardamom, cumin, coriander and tomato sauce. It is AMAZING. \n\nThe kachri murag, with a spicy sauce, was also very good and my husband preferred it when he got to eat the leftovers (more malai for me).\n\nThe amritsari naan has a variety of seeds: fennel, sesame, onion and poppy. It was DELICIOUS with the meal and DELICIOUS the next day with some duck rillette.\n\nI'm not likely to order the zafrani lassi again. Not its problem, just not as world rocking as the malai and the amritsari naan.\n\nHave been eating my way through the menu...the chicken korma is amazing. What a great place.", "author": "Vena V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-07", "description": "Had their PUNJABI GOAT CURRY!! 5/5.. LOVED IT!!! It was on their daily special today.. Sad to learn that it wont be available any day that one wishes to have it.. I think its just once a week special or so.. Also had their Chicken Tikka Masala..4.5/5 .. Loved it too!! I prefer food to be spicy so ordered the spicy version of both curries. Of all the Indian food I have tried in the past one year this is the one I liked best till now!! Will definitely be visiting this place again!!", "author": "Gvn G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-06", "description": "The food here is pretty good but service is so slow and unfriendly that it makes it impossible to recommend. I have come here a few times for the sit-down meal, and you really need to arrive at 11:30 or earlier for a decent experience. If you come a little before noon you'll have to wait forever to order and then chase the waiter when he deserts your table. We even had to walk up to the service counter to pay because we could not catch anyone's eye to request the tab. \n\nAs an alternative, I recommend the cheap take-out meals. Besides not needing to wait for attention, you might get the one guy who smiles and greets you. I have learned to request extra sauce. Avoid the tikka chicken, which tends to be very dry. The chai (at $1.95) and naan are delicious!\n\nI predict that if they can train their staff to be friendly (e.g., a smile and eye contact, attentiveness) it will improve their Yelp scores and chances of staying open. They should even have the staff in photos on their website smiling instead of looking vaguely displeased. The Indian restaurant in this location before them closed so if they want to avoid a similar fate they need to get a grip on customer service.", "author": "Anita B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "I am vegetarian and when I order off their a la carte, their food is delicious. And when I ask for spicy food, it is actually spicy. Most places do not give me spice to my level when I ask, so I like this place for that. \n\nTheir lunch menu sucks though for vegetarian people (for take-out or dine-in). I do not know who picks it, but they always have the worst choices. They pick fan favorites when it comes to meat - Chicken Tikka Masala. But when it comes to vegetarian, it's always some weird, not good curries. Once a week, it will be something good like Malai Kofta or Paneer or something. But the other times suck.\n\nTheir dine-in lunch special also includes lentil soup and salad, both of which are horrible. I don't know who would eat that. \n\nSo I only come here when I have time to sit-down and spend $15ish on a curry and naan from their a la carte menu.", "author": "Saumya B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-22", "description": "My dinner guest and I both experienced *digestive issues* the next day and this was the only meal we shared. There's not a ton of business at night (the dining room is really quiet on a weeknight) and most of the business is takeout.  That  being said, I was suspicious about how long the food sits out in the kitchen... frankly I don't think Tikka Masala gets freshly thrown together in the 15-20 min after you order... It's probably more that it gets heated up or something.  \n\nService was pretty bad the night we went. Unfortunately my waiter didn't seem to understand English very well so he couldn't understand my questions about the menu...\n\nI think the Folsom location has better traffic in and out.  I've had takeout from the Folsom location plenty of times and have never experienced digestion problems.   \n\nLunch here is really quick. It's ready made so you pick from a limited offering and they scoop it into a box for you to go.  \n\nThey also open late.  They're one of the few locations around 2nd and Market that are open that late.  Your other options that I know of are Osha, Subway and McD that are opened past 9pm.", "author": "Alias A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-29", "description": "$6 curry on rice to go (add $2 for a huge piece of naan).\n\nVery Quick, excellent for a grab and go lunch.\n\nFor togo orders, go straight to the back and order then take it to the register at the front to pay.", "author": "Steven F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "Extremely fast, extremely fresh $5 vegetarian food in the back of the restaurant to go.\n\nMake sure to have cash.", "author": "Carver D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-09", "description": "We regularly go here for lunch box in the noon ... this place is ok for a small quick meal ... hardly takes like 5-10 min for you to go in and out .. \n\nBut the guys in the kitchen, behind the buffet counter are quite rude !!\n\nWhy can't they serve professionally with a straight face .. stupid people and the place stinks ... don't know how long the place will hold good though the food is fine ..", "author": "Deepak A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-24", "description": "Based on the price/location of the lunch spot/specials I was hesitant and played it safe with the chicken tikka masala. It was solid, other people complain that it is dry, but my chicken was pretty tasty, not too dry. Cut up in chunks that are slightly too big and impossible to cut with that tiny fork, but when you work downtown do the right thing and keep some durable utensils in your office, or sit down and eat there. \n\nSuper cheap, $10 for a large portion of chicken tikka masala, over Basmati rice, add garlic naan. Enough food for lunch and dinner. \n\nThe naan was pretty middle of the road. \n\nIn and out in 10mins at 12:30pm on a Wednesday? I'll take it, and be back.", "author": "Kortni S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-24", "description": "Mehfil is back! Let me explain. When they moved up the street from their Folsom location, we noticed the food quality take a hit. This was our go to Indian delivery place but we decided to take a break after some disappointing experiences with food. Happy to say after that break we gave Mehfil another try and the food was good again. Our standbys chicken korma and butter chicken were delicious. The saag dishes are also tasty.  Prices aren't cheap but not unreasonable. Delivery service is generally prompt.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-26", "description": "Food was great,  I asked for super spicy and they made a strong attempt.\n\nDO NOT GO HERE with more than 3 PEOPLE and expect to split a check.\n\nvery frustrating and confusing, as if no one had ever asked this before.\n\nDoesn't look like they have the ability to do such a complicated procedure.  \n\nFood is great!!  just don't go with friends!  \nif you only have 2 friends this place is perfect for you!", "author": "Al C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-14", "description": "The food at Mehfil has become drastically worse. Their chicken tikka masala was sooo dry & tasteless that I had to throw it out!! The naan was soggy & half-baked...how can you mess up naan??!!  Won't eat there again...", "author": "Maryam Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-16", "description": "So not been here for the first time but definitely this will be the last time.\nWe ordered lunch menus which was placed as ALA Carte first. Then when it was taking a while we asked the waitress to look into it and she corrected it. Well food came after sometime, when it came it came without the salad and soup which comes with lunch menu. We asked them again, they apologized and then came back with the soup and salad. Did not end here, they forgot another rice which they were supposed to give. Reminded them, then it came back. Now here is where it goes all downhill. We asked to make the dishes SPICY. It was bland as hell. We called them, asked them to make it SPICY as requested. The person went back, got a bowl of red chilly powder, placed it on the table and left. We were shocked. Any how, we called them again that we asked to make it spicy not just hand over some red chilly powder to be sprinkled to the dish. They apologized again and went back. This time the gravy came back and guess what, instead of trying to make it a spicy gravy, they just sprinkled the red chilly powder and stirred it and got it back, even without re heating so that it mixes well.\n\nThat was the time we were regretting our decision of coming there. But hold on- when the check came, it came with 18% gratuity for the out standing bad services they provided. We called them and asked and they said its a rule to add 18% gratuity for 4+ guests. We said but we don't want to pay that since your service was so bad. They said, cant do anything you have to pay. \nSo what did we do? We paid left and here I am writing a review. For the 18% gratuity I hope it costs them more for what they did.\nI wanted to see if there was no Start but unfortunately there is no such option here.\nSO MEHFIL- first learn customer service from your Counterparts and then run ur show.\n\nNO MEHFIL FOR ME OR MY FRIENDS AND AQUAINTANCES", "author": "Tanuka B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "After skimming a few reviews to validate or refute my findings, I'm going it alone again and saying, \"to hell with what others think, here's the opinion of Yours Truly.\" \nI stumbled (not so figuratively, maybe somewhat literally) upon this place after a raucous evening of drinks with coworkers nearby (if you're reading this closely you'll notice it is written on a Monday. Yes. I can't explain it).\nAnyway I was not expecting much to say the least. I had never heard of it, a Subway was next door and I seriously considered it, but I've eaten at least a thousand Subway subs and after enough they get to be, well, just gross. \nSo, enter Mehfil. I walked in, was promptly seated and after looking over their definitely expansive menu decided on my default Indian oder of Chicken Tikka Masala and naan. I opted for the butter naan instead of garlic naan because garlic naan and I don't always agree. Shortly after ordering I was presented with a nice dish of the masala, rice (which I didn't order but was provided all the same) and piping hot butter naan. \nLet me tell you, I've had a lot of curreis and chicken tikka masala in my day. I'm reluctant to claim \"best\" anywhere but this was damn good. Perfectly spiced. By that I mean it was spicy but not overly so. There were none of those annoying pieces of something that are always in masalas that are authentic. Sorry, I don't know what they're called, but I have to spit them out every time. They taste like licorice and baby diapers and they absolutely ruin every dish in other establishments. Not here. Here the masala is pure, free of all the annoying extras including bay leaves which they must use but filter out before serving, and lo - this is the real deal.\nI surprise myself even now, writing this. I consider myself to be a fairly renowned snob when it comes to Indian. I've been to London and had some of the best, have been a Shalimar fan for 20 years, go to Amber India on a regular basis, and try as many of the new decent places like Kasa as I can. I won't way Mehfil is the best of them all but again I was not expecting much and was more than pleasantly surprised. I'll be back.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-16", "description": "I just had a pick up and was super sad as I  opened the bag ! The bengan bharta was reheated via microwave and almost 100% chick pea flour ! The lamb tasted awful infact tasted unhealthy and very old! The rice was ok! And all spilled in The bag because the lids had big holes ( 2 out of three items and the one item where the Lid was not broken was the rice ? \nAnd my stomach feels really weird now \nI had to throw it all away that's how awful it was broken plastic pieces from the lids  \nwith food yuck mixed in a paper bag  yumz :(((((((( and that all for 32 dollars ?", "author": "M. B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-09", "description": "Thought the food here was pretty darn good. I loved how the sweet lassi wasn't overly sweet. The CTM was solid. Love that stuff. For the price, great. Serve was friendly. Worry that they weren't busy.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-15", "description": "I would give them 3.5 stars if I could. The food is perfect for a quick lunch. In and out and the price is amazing, a full lunch for 5 or 6 bucks. The food is just ok though, nothing spectacular. Good not great. It will fill you up but the lack of spice and flavor may let you down.", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "Awesome Punjabi Food. Great place for authentic North Indian food. Chicken Tikka Masala is amazing....", "author": "Karan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "Had an order delivered to the lobby of my office on Beale. Paid with American Express. I do not know if they accept American Express for dine-in/pickup, but their online order system on their website accepts it. Delivery (ordered online) took about an hour, which is what I expected. I did not get a confirmation call after 20 minutes. . When I called, the order was being prepared and expected to deliver in 30-45 mins, which was accurate. \n\nThe saag paneer (ordered it \"hot\") was excellent. The spice flavor was great, the heat was as-ordered, it had good texture, just the right amount of cheese, whole nine yards. The cucumber salad is pretty standard. I was not impressed with the chicken appetizer.", "author": "Jesten T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "I mainly go here for lunch, and it's hard to beat the $6 plate full of food. The pick-up counter at the back is where it's at.", "author": "Rob K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-26", "description": "Price: 5 stars\nFood: 3.5 stars\nService: 1.5 stars\nAtmosphere: 4 stars\n\nThis review is about their to-go lunch only. It's extremely inexpensive for the location, $5-$6 (tax included) for a bowl of bismati rice and a dish on top (chicken tikka masala, etc.). The portions are not large, but you wouldn't expect them to be that big considering the price. It'll fill you up if you're looking for a quick lunch bite.\n\nThe food is above average - but served in a fast-food like manner, so gets dinged a star for that. Not bad, but not exceptional either - you get what you pay for.\n\nThe service is a joke. They literally will not allow you to seat in the restaurant to eat, nor will they give you anything to go with your order (napkins, get on your own, expect only 1 fork, etc.). The funniest thing is when they ring you up, never expect a smile - my friends and I have made it a game almost to see if we can elicit some sort of happy look from the cashier.\n\nThe atmosphere is nice, but since you can't eat inside for the lunch special, it really doesn't matter.\n\nSeated lunch, which I've done before, is not that good of a deal, but there's no other classy Indian places nearby.\n\n3 stars for being A-OK for lunch specials.", "author": "D K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-28", "description": "many of my co-workers are of Indian decent and we often eat Indian food at lunch. One of my co-workers has been raving on and on about this place so I finally agreed to go. \n\nWe walked from our office to the restaurant which is on the corner of 2nd and Market Street. I have to mention that this is a DIRTY part of the city b/c we found a nice steamy pile of yuck on the corner. \n\nWe went inside and there were tables spread out on a lower level and more seating up the stairs. We sat on the upper level towards the middle of the establishment. \n\nThe tables were small, marble garden tables.. we sat at one not wanting to take one of the wall tables that were for a party of 6. Which we regretted after we got our food.\n\nThe menu only had 4 items on it but the waitress told me they had tandoori chicken if i wanted (it wasn't on the menu). I ordered the Tandoori Chicken, someone ordered the curry chicken, my mgr ordered Paneer curry, and the guy that suggested the place ordered Lamb curry. Everything was served with naan and rice. My tandoori chicken was delish... i haven't had a place mess up tandoori chicken yet. All of the food was actually really good! For drinks we ordered different types of lassi: mango, salt, and a spice one. The consistency was off for the spice one.. there were big chunks of ice in it.. not blended well. The mango lassi was just ok.. the consistency wasn't as thick as i've had it else where, but it tasted ok. I didn't try the salt lassi.\n\nI must say I am disappointed with their service. Our main dishes came out prompt but the naan and rice took forever to come out, we even had to ask for it. The table was so small that they couldn't give us all our rice and naan at the same time and we had to share which was fine except we had to keep asking for more when we ran out and it took long for them to give it to us. \n\nAfter we were done, they gave us the check but never came back to check our payment.. I had to stand up and give our check to the lady. (the place wasn't even that busy). \n\nI'd order togo from this place just because the food was good, but i will probably never eat in again.", "author": "J-nine I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "This is my go-to spot for delivery. It's consistent food quality and almost always right on time. The only issue is that the older white gentlemen who delivers from time to time has been very rude to me multiple times, actually yelling at me. He's had some trouble with our phone system at the building, and I guess has decided he doesn't like me. Always relieved when he doesn't show up with our food.", "author": "Heather M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-13", "description": "This review is based on take out only.\n\nThis place is great because of the $5 takeout lunches. The reason it is not 5 stars is because the takeout menu changes daily so there are things on the menu that i was not interested in trying.\n\nIf you're a big eater like me, you will either feel slightly satisfied or full. It just depends on what you ordered that day. Nonetheless, it's a $5 well spent for a lunch (given you've checked out the menu online prior to going).", "author": "David T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-07", "description": "Good portions but underwhelming flavors -- even the chai was very ... mellow. Good service, good lunch-break option, fills your belly and may satisfy your Chicken Tikka Masala craving but not to the fullest, flavorful extent!", "author": "Shin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "They have lunch special here that is both good in taste and amazing in value.  You get a take-out box of rice and meatballs for only $6.  There are other lunch special dishes for only $5 from the take-out menu.\n\nThey even let you do a half-half mix.  (You do pay the higher price, so typically $6)\n\nThis is a new location but I am excited to come back again.", "author": "Steven M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-19", "description": "The worst indian food i had in SF. I had ordered mehfil e khas curry with kadhai chicken. The rice was not at all basmati and the curries were pathetic to taste. Save your money and pick some other restaurant..", "author": "Manini T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-26", "description": "I have been coming to Mehfil restaurants for some years now and lately been coming to this one as it is the newest. My wife and I always come here when we are in beautiful San Francisco  and get our usual butter chicken and garlic naan and wow it is very very tasty that I always overeat here. \n Service had always been friendly as I myself am very sociable and so were they in return and I love that. I will at times ask the usual waiter of other meat dishes he thinks is good, as I keep ordering the same thing, and the fish curry he suggested to me was absolutely great! I will sample my wife's vegetable dishes and wow that too was delicious. I am very impressed by the food here. \n  I have been to many Indian restaurants up and down California and I have to say this one is in my top 3.", "author": "Preet J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-18", "description": "Great for a quick lunch.  $6 chicken tikka masala is my favorite.  They use white meat that is tandori roasted.  Makes a big difference!\n\nAlso, if you're there for a sit down lunch, their lentil soup is delicious.", "author": "John D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-15", "description": "I am north Indian, I've had north indian food in 12 countries so far, and in countless restaurants. this is by far, the most flavorless, spiceless indian food i've ever had. the pakoras were nice. the rest of the food - i could not even get through the meal - I had to pause and write this review. I am not going to finish my meal. (i had ordered a delivery through grubhub, if that makes a difference)", "author": "Vaibhav B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-07", "description": "Very long wait time, unorganized staff who were running around, rude. All on a slow Monday night. Not worth it.", "author": "Sara W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-17", "description": "They had some good lunch food and served us very fast. Going to the back and getting the special there is a great option for fast lunch in a neighborhood with ever-growing lunch lines, as long as you make sure to bring cash. I had chicken tikka masala and a mango lassi and both were pretty tasty, if not superlative. I've also had a sit down meal here a few times, with the same experience - not mindblowing, but tasty food and fast service. I'll definitely be going there again.", "author": "Xanda S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-12", "description": "Worst experience ever! Very bad customer service and on the top of it these guys don't have an order for waiting. They made us wait for 30mins and served us the food after an hour and when we asked for it the female server ended up with an argument which is totally invalid. Would never go for this place or recommend anyone in future for the service I have received.", "author": "Rohith H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-17", "description": "Wife and I went there and got some Chicken Tikka Marsala to go for each of us with Naan bread. This was our very first experience of this place so we were excited as we love tikka Marsala and Naan bread. So we take our food home and eat and the tikka Marsala was ok, not great  but ok. Honestly it was kinda watery. The one thing that made us decide to never eat here again was the fact that we found a beetle cooked into the Naan bread which instantly made both of us lose our appetites. This was so gross and we will never eat here again.", "author": "John B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-22", "description": "Good place, always order for delivery, but they always forget utensils! How're we suppose to eat without them?! Also, do not order rice with any of the dishes, they always just bring one, even if you've ordered two or three.", "author": "Joey H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-03", "description": "meh....this place is just ok.  The only thing I ever get here is the chicken tikka masala from the take-out section in the back.  The service isn't that great but what brings me back here is the $6 lunch plate that's pretty filling, there's hardly ever a long wait and it's across the street from my building.  The tikka masala sauce is almost consistent but sometimes it's way too spicy.  For the chicken, I don't think it's cooked with the sauce but grilled and then added after the sauce has been cooked because sometimes the meat is a little tough and dry.  I don't like that they keep their nann wrapped in foil in a water cooler so the bread isn't crispy anymore and you don't even know when it was made.  I think it was better when the restaurant was called Bindi.....it was 50 cents cheaper and they didn't keep their nann in a water cooler.", "author": "Yien S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-11", "description": "Ordered take out and was delivered the grossest food I've ever had in my life!   Makes every other one star review I've ever given look like Chez Panisse.  The chicken in my chicken biryani was purple inside and filled with gummy inedible  joints.  I couldn't eat it and instead had to have a dinner of leftover dried apricots.  Avoid at all costs!!!!", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-30", "description": "They used to have good food but now they are bad taste Also the people can't speak any English so I have trouble when I order also", "author": "Claude C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "I love going to Mehfil for Happy Hour (glass of red or white wine or beer - $4.50), but more specifically for their Butter Chicken ($16.00). It's so good! Prices are reasonable for San Francisco.", "author": "Seth H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "I am not really a fan when it comes to eating Indian food out, but I feel Mehfil is one Indian place I don't mind going again. Their Samosas are really good, it has a distinct stuffing unlike what you get at other restaurants. I had their vegetarian dishes, Paneer Malai and Mushroom Mutter both were really delicious and the Garlic Naan was good too. They also have a decent ambience and all their dishes are moderately priced. I highly recommend this place for a good fulfilling Indian meal. 5/5 for food and quality of service. I would like if they could maintain their toilets and washrooms a little better. Hence 4/5 overall.", "author": "Chinz C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-13", "description": "The lunch specials are subpar at best.  If you want a $6-7 lunch in this area try Lee's Deli, Fountain Cafe, or Jimmy John's.\n\nI got the Chicken Tikka Masala, their \"most popular dish\", and it was very underwhelming.  All their lunch specials are pre-made and kept warm buffet style (trays that are being kept at constant temperature.  My $6 lunch (cash only) consisted of a generous portion of \"Superior Basmati Rice\" (which was just plain white rice), curry, and 6 bite-size pieces of chicken.  The chicken was very dry, you could tell that it was being kept under a heat lamp all day.  The curry itself was actually quite delicious.\n\nAgain, for $6 in this area, I don't expect much, which is why I gave it 3 stars.  You can get a lot more bang for your buck if you check out the other places I listed.", "author": "Aalok P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-21", "description": "We asked for spicy paneer makhani and the only thing that the vegetable tasted of was chilly powder. Not good at all. Also they had added alot of synthetic color that even after washing twice my fingers look like cheeto fingers..", "author": "Mohini T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-13", "description": "The food is ok. The service is terrible. Nobody receives you to ask if you want to dine in or take out. Impolite service. Almost as if they think the customer is lucky to have arrived at their door.", "author": "Deepa G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-04", "description": "I went twice first one was better experience . Veg Biriyani is good \n2nd visit I wasn't very satisfied", "author": "Pavan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-22", "description": "Love it here. Fast lunch specials, good for dinner, delivery service. I have consistently gotten takeout from Mehfil and never been disappointed. Love the service, too.\n\nChicken tikka masala, channa paneer, basmati rice and a mango lassi were my faves. The samosas are delicious, too!", "author": "Jenna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-05", "description": "They do a great lunch deal if you head straight to the back. Rice with a choice of an curry which can vary by day. The particular day we went in, I got the rice with Gajar Matar and my BF opted to get his with Chicken Tikka Masala. Both were great, but I do wish that there was a choice that offered a blend of both veggies and meat (rather than one being strict vegetarian and the other being... well, carnivorous). I assume it's probably just because of the specific day we went in. Anyhow, the meal was good but definitely treat yourself to a chai because it's delicious.", "author": "Shauna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-06", "description": "Mehfil is an excellent choice for lunch!\nIf you want take-out, go straight to the back of the restaurant and they have fast service for essential/premade dishes, like Chicken Tikka Masala.  $6.99 for a BIG portion is a DEAL in this part of town.  If you want a little something green to go along with it, they have a cucumber and tomato salad that is fresh and easy.  Cash only.\n\nSit down dining is a perfectly lovely option, too.  I took a job candidate here for a lunch interview and it worked out well because we could hear each other, the menu was easy to navigate, service was good...\n\nFood Quality: A: GOOD QUALITY, WHITE-MEAT CHICKEN - HOORAY!!\nService: B+ :making it easy for a good, fast, reasonably priced lunch\nAtmosphere: B: Clean, updated atmosphere - not over the top.\nPrice: A for takeout!  B for sit down", "author": "JM H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-15", "description": "I came here for lunch hearing good reviews about it from my colleagues. Their lunch option is pretty cheap but I felt that the rice was a bit uncooked. The rajma was less spicy than expected. Otherwise it was all good. Paying with credit card ncreases your meal cost by 1 dollar so carry cash :)", "author": "Karishma R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-30", "description": "Food was ok but nothing to write home about.\nThe service was so terrible I will never eat here again.", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-31", "description": "i dont know if its just today or if it's this bad everyday. The food here tastes pathetic.", "author": "Chakradhar R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-28", "description": "Man after the A's game we BART it over to Folsom to get a quick Indian cuisine craving fulfilled but oh CRAP! it's closed but there's hope a new paper sign saying they moved to 2nd Street. you mean to tell me we walked in a complete circle? Any how they moved and it seems like the food got better. I was a big fan of the Chicken Vindaloo and the Tikka Masala. The Na'an was awesome and we loved the Samosa's and the restaurant is a lot cleaner and they have their own bathroom now. no more sharing with another restaurant which is weird all itself. I highly recommend this I think it's better than Any of the Clay Oven Restaurants sparsed in different areas around the city", "author": "graham c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-27", "description": "I have been at Mehfil a couple of times now and on both occasions, their food wasn't good. (More specifically, I was there for late dinners (after 8 PM) on weekdays). Also, the service wasn't very good - the person who waited on us wasn't too eager to please us. The food felt like it was made in a hurry for an lavish mid-night meal. Cannot complain about the quantity of the meal though - that was fine.", "author": "Hari B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "Awesome chicken tikka masala lunch box with rice for just $6! I swear they have the best chicken tikka masala in the city. I won't go anywhere else. The butter chicken is also amazing. When we get delivery, it's always chicken tikka masala and butter chicken with a side of naan. The dishes come with rice. The best!", "author": "Liz H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-27", "description": "Not bad, a little expensive for lunch if you decide to sit. Most people just pick up food and go back to the office (I think). We had the salmon tandoori, which was so good. I had the chicken tikka masala which was also good. Maybe just 5 items on the menu during lunch, about $12-15 each. At least the rice and naan are free. 3.5 stars (comparing to my faves in the Tenderloin.. Shalimar, Chutney, Lahore, et al)", "author": "Vol T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "We had dinner at this pleasant & attractive restaurant last night. It's at 2301 Fillmore at Clay street, very convenient location, as it's one block from the Clay theatre. Although my companion is a fan of Indian cuisine, I can take it or leave it---but I make an exception for Mehfil. My prawn dish was excellent: I like spicy food, and this was perfect. Didn't drown out the flavor of the shellfish, but enhanced them with a savory little kick. The Indian food lover had lamb Roganjosh---it was really good (I had a taste!). He would have liked an IPA to accompany it, but unfortunately their beer selection doesn't stretch that far & he was less happy with what he ordered than I was with my glass of very acceptable red wine. All in all, a place we plan to return to, as there are many tempting things on the menu we'd like to try. Oh yes---the service was very good: attentive & discreet. Bravo Mehfil, and thank you!", "author": "Helen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "I ordered chicken tikka masala, veggie samosa, plain naan, and raita online through grubhub for delivery. Food came 30 minutes faster than expected, was still warm, and was delicious. The chicken tikka masala was very good and also came with rice (most places charge extra). The samosa came with 3 different sauces, so next time I won't order the raita (which was only a couple of bucks but was a huge serving that I don't know what to do with now). I would order from them again.", "author": "P U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "This review is for their delivery only - I've never been in. Good food for good prices - the biryani was especially delicious, and the chicken tikka masala was a huge hit with my office. Generous portions, great naan, and they include rice with your order so you're never stuck with a quart of tikka masala sauce and not enough naan to soak it up. Haven't had anything from them I haven't liked yet, and they deliver on time. Definitely my neighborhood go-to place!", "author": "Teicho S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-21", "description": "FULL DISCLOSURE: I work 1 block away. I'm here twice a week for take out lunch. \n\nFacts: \n\n1. I get the $6 chicken Tikka lunch special, which is a round black box full to the brim with golden curry on a bed of rice. \n2. You can mix and match, and be like \"Hey, can I get chicken Tikka AND paneer bhaji?\". They will oblige. \n3. I always ask for more gravy. The curry must flow. Make sure you look them in the eye and ask.\n4. Bring cash. You'll be in and out in 300 seconds tops.\n5. They're not the warmest in the hospitality business. Don't expect some cheerleader waitress thrilled to see your sedentary face. I never dine in. \n6. Feel free to chat in Punjabi or Hindi.\n7. They have another location on 2nd & Folsom. \n8. Menu changes, but chicken Tikka reigns supreme. Also costs a buck more - all the other lunch boxes are $5\n9. A good way to cheer up a coworker having a shitty day is to get them a Mehfil lunch box, and talk to them for 10 minutes. You'll both make everyone else jealous of the amazing time you're having with each other. This may lead to bro time later on or possibly marriage. Offspring not guaranteed.", "author": "Vineet S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-06", "description": "I ordered for delivery. It took them more than 2 hours, and I had to call them twice!!\nTheir food is good, but 2 hours is unacceptable.", "author": "John L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-15", "description": "Terrible experience. Completely empty, we sat down and waited 15 minutes with no service. When I politely asked someone for help I got ridiculous response. This place is run by morons.", "author": "Ansel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-13", "description": "Well, I eat here probably four days a week and am always happy.  Lunch is cash only but at $5 or $6 out the door the price can't be beat (that's without naan).  I usually get a half veggie half meat dish, generally the tikka masala.  Anyway, I love it, quick, good and cheap.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-17", "description": "There's a saying in the restaurant business: people go for the food and come back for the hospitality. One thing is certain: Mehfil is a MEH FAIL. I'll never return to any of their restaurants. I recommend that you never visit. \n\nThis review is for my visit to Mehfil on Second St in San Francisco with a friend on 3 October 2012 from 12:20 noon until 1:40 PM. \n\nI enjoy Indian cuisine. Truly, I do. Today, I did not. My friend and I enjoyed two delicious dishes: a chicken curry and a lamb kebab. Their sauces were sinfully rich and seductively savory. Included with a la carte dine-in are a salad, lentil soup, rice and naan. The lentil soup was littered with pepper, which was fine for me, but would likely not be great for others. The cucumber and tomato salad felt like a wilted afterthought scooped from a batch that was prepped days prior. The rice wasn't memorable, but it was mandatory. \n\nThe naan... Everyone loves naan. If you don't love naan, something is wrong with you. Naan is the deliciousness that epitomizes Indian cuisine. A well defined Indian staple, naan is more necessary than rice. \n\nI like eating my Indian dishes with naan more than rice. I'd tear pieces of naan and dip them in the sauce, or I'd wrap pieces of meat with naan. It was delicious. I'm pretty sure I'm not the only one who enjoys their Indian food with naan instead of rice. \n\n I typically need more than one naan, so when I asked for a couple, I was surprised that there was a long delay in its delivery. The menu indicated that naan was included with a la carte dine-in service, so naan should be made available at the request of customers if they need more. \n\nWhen heavenly, buttery, savory, seductively dipped naan is treated as a dish that cannot be provided to the client after he requests it multiple times but it was delivered without haste and as if it wasn't deserved... when a waitress condescendingly demonizes visitors who enjoy naan more than life itself... it's impossible to enjoy Indian cuisine. \n\nI received the final check, and the bill indicated an extra charge for naan. I was confused because naan was included with a la cart dine-in service. I mentioned this to the waitress, and she made me feel like an idiot. She said the naan was limited per customer and not \"unlimited\". She said the printed menu indicated this, but it actually does not. The manager's attention was called, but he stood back and peered at our table with no apology for the misunderstanding. The extra naan charge was only a couple dollars, but the waitress and manager's handling of the situation oozed a condescending tone. They were unbelievably rude and suggested that I shouldn't return if I couldn't afford the extra naan charge. I couldn't believe how belittled I felt. I couldn't believe how stupid they both made me feel. \n\nNaan used to make me happy. Mehfil's stingy, selfish, and elitist staff has ruined my love for naan.", "author": "Travel Swagger R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-07", "description": "Great new location with the best lunch deals. Can't go wrong with the chicken curry.", "author": "Craig I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-23", "description": "Maybe 4 1/2 stars. My first time at the restaurant, a midweek dinner. The host quickly seated me, took my order and my food was served promptly and pleasantly. Following everyone's recommendations I ordered the chicken tikka masala, which was tender and well but not over-spiced. The naan was freshly baked, hot and crispy. \nGood Indian food in a pleasant new restaurant at a fair price. And they do take credit cards at dinner. I won't be sad to go here and skip a trip to the TL.", "author": "Marilyn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "Great service!  Great Hefe Wiess yes German beer. The tandoori prawns were fabulous.  $12.95... are u kidding?", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-22", "description": "Great daily lunch menu at excellent prices!  I love the Chicken Tikka Masala.", "author": "John D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-08", "description": "For $5, the only expectation I have is that the food is filling.  BUT at Mehfil, their $5 to go lunches aren't just filling, but satisfying and tasty!  With their different menu everyday, I'm excited to see what's for lunch!  This place is great!", "author": "Joseph C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-13", "description": "I was dying for some killer Indian food, and even tried venturing to the Tenderloin by myself at night to get my fix. Seriously Mehfil did not disappoint, although the service was a bit slow. But seriously!!! So good - the Murag Sagwala to die for!", "author": "Simonne K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-30", "description": "Cheap and fast, but the food was flavorless, and I received the only naan I have ever not liked. Will not be back.", "author": "Kristine K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-06", "description": "The go to spot\n\nPlease note that I've only tried the lunch specials at this restaurant, so my review is based on that menu. Needless to say, everything that they offer for lunch is amazing, so I can only imagine how their regular menu is. The Tikka Masala is always on point and the chicken wrap is WOW! I have to say, I can probably eat that chicken wrap everyday of the week and not get tired of it. The prices for lunch are CHEAP considering the area at $5 for the regular plates and $6 for the Tikka. The wrap will run you about $6.50, but it is well worth it (I mean com'on! it's less that $10 in the Financial!!). If you come at 12pm then be prepared to wait in line and bring cash because the lunch specials are cash only. The location is awesome, right on Second and Market and the staff is generally friendly. Don't really understand what they are saying half the time, but I guess that's a good thing as they must know what they're doing. \n\nIt is a bit of a walk from where I work, but I never regret it after I inhale my chicken wrap in about 3.2 minutes like a pelican.", "author": "Javier G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "great food and an excellent price! not the best decor.", "author": "Beth W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "I had the rhum sauce lamb which was really good. I didn't taste too spicy (maybe I got used to spicy food?). It's also very affordable and the dishes come in large quantities.\n\nService is nice, it's a very good place overall. Peaceful though so don't go looking for hot ambience there.", "author": "Maximilien B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-10", "description": "We eat here at last 2 times a week as they are near the office. We love the staff and the food is great and reasonably priced. Once the owner even let me walk out for free and pay later because he only takes cash for carry out. Of course I paid the next time I came in but who does this today. Great place.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-13", "description": "I love the $5 lunch special! Its rare that you find lunch in the fidi for $5 bucks! The portions are huge and the price is right! I just finished a huge bowel of sag paneer and rice for lunch and it was only $5 bucks out the door. From what i hear they have a different lunch special each day of the week. I will definitely be back!", "author": "V I P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-30", "description": "This location just opened up and it is right down the street from my work. It doesn't get an better than a $5 lunch box of spicy goodness. The staff is pretty friendly. Saag Paneer is yummy and veggie curry is good. If you like your Indian super spicy like me you might have to ask for extra sauces.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-21", "description": "Satisfying.  Some different flavors that aren't so common on lunch-time Indian menus.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-02", "description": "Food was 3 to 3.5 stars, but I rounded up to 4 because of the good beer selection. I got the saag paneer and it was decent. The paneer was standard the usual restaurant quality (i.e. not very fresh or particularly flavorful). The saag was good. I was pleasantly surprised that it came a little spicy without even ordering it spicy. It was a bit creamier than the saag I'm used to, but it was good. Also, $10 for a dinner? Not too bad!", "author": "c h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-13", "description": "They definitely have one of the best Chicken Tikka Masala and at $6 this is a great deal for take out! In the beginning, I felt the portions were quite generous, however off late, it does look like they are much more controlled in their serving. The food still tastes great!\n\nTheir other dishes on take out menu are so-so IMHO.", "author": "Ravish K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-21", "description": "Centrally located, clean and delicious. The service is a little slow so I've knocked off a star. The food does not disappoint, though! Their mango chutney is delicious. I also think they have the best Chicken Tikka Masala in San Francisco. I am also a huge fan of their samosas and garlic naan. They also offer delivery on Eat 24 so if you want some delicious indian food brought to your door, don't hesitate to order Mehfil!", "author": "Shali N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-27", "description": "So after I posted the first review the restaurant called me and explained that there was a mistake with the online portal and they weren't even open when my order went through. They apologised and I reordered today for dinner for about 10 people. They were quick and efficient. (He told us it would take 45-60 minutes and it was delivered in 30). The food was excellent quality and hot. Will definitely be back for more. Appreciate them owning up and solving my problem. Kudos to this restaurant.", "author": "Rushi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-11", "description": "For $5-$5.50, you get a bowl full of indian goodness. The veggie lunch special selection I got a few days ago was great.  Takeout orders from regular/full menu are just as delicious!", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "I love this place!!! The food is amazing, the service is great and the staff are wonderful!! Plus they have red pakora sauce!!", "author": "Kelly N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "GREAT lunch spot. Its quick and cheap ($5 lunch special)  Indian curries over rice. The curry is not watered down and they are generous with the meat. Only down side is that it is cash only. The portion size is good. It definitely filled me up and gave me food coma after so I would imagine it to be pretty satisfying for a guy too. Check it out! The menu is updated daily I am definitely going back!", "author": "Tammy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-04", "description": "This place has great flavor and good quality. Excellent value with the lunch box. The chicken is always good. The naan is a bit dull and thick, not light and fluffy. They also have a great rotating menu with different dishes regularly.", "author": "Johnny B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-23", "description": "The food here is passable but not that good, but the food is not the subject this review about Mehfil. I live close by and for convenience I have ordered here a number of times (more than 10). After ordering a number of times I started to notice that the $ total for my order seemed to vary wildly even though I was often ordering the same things. I found this strange and started to pay close attention. To my surprise I noticed that they were frequently charging me for more expensive dishes than I had actually ordered.\n\nThe first time I noticed this I confronted the cashier who told me the charge was correct, when I picked up the menu to show him his error he looked like a kid caught stealing a cookie and didn't really even try to pretend it was unintentional.\n\nThe next time I ordered from the mehfil I was working late and my girlfriend picked up the food. When I checked to see what she had paid I was furious to notice that they had overcharged her.\n\nThe last (ever) time I ordered here I was again working late and wanted to pick up on the way home. I ordered the following 2 menu items totaling $23 dollars and when I got there to pick up the bill they presented me was $37.\n\nThese are people are not honest and will look to take advantage of you any time they think you are not paying close attention. \n\nLook elsewhere.", "author": "J W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-19", "description": "i want to like this place. i do. the food is decent. i have had better and plenty of worse. the 2 star is because twice ive been here to get there tikki masalasa lunch. for 6 bucks. great price. but once i got 2 pieces of chicken and 3 the second time. but everyone in front of me gets loaded.  i dont bitch about it to them cause i dont want to be the only black guy in there complaining about chicken. i just dont thjnk the guy likes me so fu k em. ill go some where else.", "author": "Kenneth S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-22", "description": "Awesome tikka masala, my favourite place for that!", "author": "Pol M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-23", "description": "Good price for the to go option for lunch.  Food is nicely spiced.", "author": "Abigail J. M. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-04", "description": "Best thing about the place is the yummy food!! The lunch specials give value for money as the portions are huge and tasty! In pricey SF where you sometimes pay 10$ for an entree, a 11$ meal complete with soup n salad is a blessing.  The staff are courteous and service is good. Overall I have no complaints about this place hence the 5 stars! way to go Mehfil! :)", "author": "Madura I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-25", "description": "I have tried almost every Indian/Pakistani restaurant in the city and I have no doubt in rating \"Mehfil\" as the best .  The amount which comes with each dishes are very good. I have tried almost every items in their menu and each of them are phenomenal. They offer a very traditional Indian dessert item RABRI which I didin' get anywhere else..Rates are very reasonable and service is also very good...I would highly recommend this restaurant to everyone who wants to try Indian/Pakistani cuisines..", "author": "Sunil K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-28", "description": "Today, when I ordered the fixed mixed vegetable combo for lunch, they brought me curried tofu (no vegetables).  After I was half way through my main course, I wondered why the lentil soup and salad had never arrived. When I inquired, the waitress said \"we ran out\"  They offered a sweet beverage as a substitute which I could not accept being a diabetic. After I finished my 2 item rather than 5 item lunch, they wanted to present me with the bill. I told the manager of my experience, but he should have known, because he was less than 8 feet away from my table. He agreed to comp me. I should have been informed from the beginning if they had run out of things. Seems the priority here is to turn the tables quickly and keep the register ringing.", "author": "blaine s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-14", "description": "Truly Authentic Indian food!!! Samosas are the best available across whole SF area... this is what i feel after my dinner at Mehfil:\n\n1. Ambiance: Peaceful. Not noisy at all. If you like relaxing environment while you dine, this is the place to be\n\n2. Service: quick!!\n\n3: Staff: cooperative. i changed my order in between and they happily changed the dishes without any extra charge\n\n4. FOOD: Authentic and GREAT in taste. Main course is as good as you can have anywhere else and samosas and pakodas are the best. \n\n5. Value for Money: totally worth it!\n\n6. Would like to come back? - Yes - Definitely!", "author": "Arpit J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-21", "description": "4 stars for food - no stars for service, so that gives you 2 total. Janky heffas working here must all be related to the owner and feel untouchable. Wow! Went here for a business lunch and was given a lunch specials menu, and a regular lunch menu. I wanted matar paneer, which I've had here several times and its always been good. The waitress was like are you sure we offer that? B, you asking me? uh uh..rude.\nThen I tell her yes, I've had it many times before. Unless you took it off the menu, it should be there. No, sorry, we don't have that. OK!\nSo I order the Tandoori fish lunch special. They bring one tiny salad for 2 to share, and we both ordered lunch specials. There is no naan....apparently they think we should be cutting carbs and we didn't know it. I asked for some tamarind chutney on the side and after 20 minutes, had to go up and ask for it. Lots of dirty looks from the waitresses too. The food was good and I will most likely order to go again, but damn gina, get an attitude adjustment please.", "author": "Royal S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-05", "description": "Don't dine in. This place is only good value if you get the daily 'to go special'.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-07", "description": "Given the diversity, variety and flavor of Indian food in San Francisco, I can only feel disappointed with the food at Mehfil. My colleagues and I came here for lunch a couple of days ago and ordered the lunch special - which consists of an entree, basmati rice, naan, cucumber salad and a small cup of lentil soup. They change their entree menu every day, which is pretty cool. But in order to do that, they only offer a limited number of choices (7-8 if I'm not mistaken). They've done a good job to make these dishes diverse - a chicken dish, a lamb dish, a fish dish, a prawn dish, a kabab etc etc...Nice for meat eaters, but sucks for vegetarians, since you get only 1-2 choices. Add to that misery, the food was pretty bland, lacks spice and salt. The only plus points for me were the ambiance, service and the freshly baked naan. If the vegetarian entrees were tastier, I would visit this place more often.", "author": "Srivatsan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-09", "description": "I would never recommend this place to anybody. We went to this restaurant thinking they would have really good food turns out that they do not know what they are doing.we ordered a shish kebab and it was taking too long to prepare and we suggested to cancel the order so we could leave on time then they told us that they would give it to us complementary and it would be ready in the next couple minutes but they did not tell us that they would serve it to us raw and uncooked. When we got the order and we told them that it was uncooked they simply told us yes it is complimentary and that the cook made it in a rush. I think this is very unacceptable and also the fact for us paying $61 and being treated like this. If I could have I would've gave them negative stars and I will never recommend this place to anybody they do not serve you well and they do not treat you right for the price that you are paying.", "author": "Davindet S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-15", "description": "Service here is the worst I have ever experienced... ever, period. And it affects not just your mood and spoils the meal or occasion but affects your food as well. For example, I had to wait 5 minutes before I could get hold of a waiter/server to complain that the chicken pieces in my dish were uncooked and even after that he just said \"oh, is it so,\" and disappeared for ever. I kept all the uncooked chicken pieces on the side in a plate to show them how much of it was raw but they did not care at all and still charged me the full price of the dish without even asking if I wanted a replacement or another dish. They just do not have time during the day to take care of the number of people that come in. And more importantly - they just don't care. In another instance they brought my wife's order a full 15 minute after they served the other two people at the same table. Think of her waiting and seeing others eat their food while she waits for her order (that was from their lunch menu so it did not need any preparation, they just had to get it from the counter). Having said all of this, I think a good value is to take out their lunch box whenever they have chicken tikka masala. That way you get to enjoy one dish that they are good at and not deal with their service.", "author": "Rasesh K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "This is honestly the best Indian restaurant I have ever been to! The place is always clean and the staff is always nice and always helpful. They have a great variety for vegetarians too! Their naan is always fresh and always soft! The eggplant in tomato sauce is THE BOMB! I'm not a big fan of tomatoes but that dish is just so good! It doesn't even feel like you're eating something in a tomato sauce! Also their mango lassi is the best! It has the perfect amount of sugar and is the perfect consistency! If you're looking for some good Indian food definitely GO HERE! You won't regret it", "author": "Reema L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-25", "description": "A decent curry house, reasonably priced. The decors not much to write home about but the foods pretty good. I normally order a take out and have a beer while I wait. If you're in town for business and fancy a good curry with no frills then this could be the place.", "author": "Mick C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-24", "description": "I have been this place many times, both dine-in and takeout. But I don't remember which dishes are better. For takeout, I usually go for veg curry rice box. You cannot go wrong with just 5 bucks.", "author": "Emmy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-05", "description": "the naan was straight fire. however the service was slow and when i ordered the main man tried to stare me down. they sassy but have good food.", "author": "Hailey L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-14", "description": "I am writing this review in less than 5 min i got the food...I asked for Plates & Plastic / silverware.....i did not get any.....i ordered authentic indian food and I myself can not recognize if it's the food I ordered.....anyways this place sucks BIGGGGGGGGG TIME........F T S", "author": "Sree P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-12", "description": "Started out ok. Over time you realize how little this tastes like Indian food. They use a lot of cream and a lot of color.", "author": "Jack S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-22", "description": "Cheap and filling.  Indian options in the area are not great so I'm glad there is a place I can go to for a quick take out lunch.  Both meat and vegatarian dishes are good.  Just wish they had some options for naan for the take out lunch when I am tired of the rice.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "We got off the bart from Oakland and wanted Indian. We walked right into this place and were immediately greeted with friendly faces. We placed a takeaway order of garlic naan, samosa, and chicken korma. It was all very delicious. We had a few blocks to walk and everything was packed up in such a detailed manner that nothing spilled or leaked. The korma had just the right amount of spice. And we had leftovers for another day. The portions were great and the price was appropriate.", "author": "Murray K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-07", "description": "We love this place when ever we come to San Francisco but today it was quite disappointing. They quoted time the food was going to be ready as 10minutes and took over 25minutes to get it done with out a single update as far as what was going on there was hardly anyone in the restaurant. I would understand if the store was really business but a dead day like this restaurant s should work on their customer service a littke better than what it was today plus there were so many peoplw working in the restaurant I dont really know why it took so long. Disappointing very disappointing", "author": "Farah I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-09", "description": "YUM!  Love this place.  I only come in for the Lunch Box.  Go in the doors and all the way back to the back counter where the cooks are.  $6 gets me a combo plate of two things (usually Chicken Tikka Masala and some vegi dish).  YUM.  Have tried almost everything they have to offer and have not once been disappointed.  FYI cash only for the lunch boxes so come with cash in hand.", "author": "Roberta W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-07", "description": "After reading reviews for Mehfil, a friend and I met for dinner at the Fillmore location. Perhaps I should have paid more attention to the fact that most reviewers were raving about the economical lunch specials.\n   Dinner at the Fillmore location was, in a word, awful.\n   First up, service. Our waiter seemed horribly chagrined that we didn't order alcohol. And he took our order with a table-wiping rag in hand. He utilized that rag, or a broom, for the entire time we were there. Much sweeping, much wiping, the drink dismay, then got our order wrong.\n   The food itself---veg samosas, shrimp with mango, mixed veg in ginger/garlic sauce, garlic naan---were all tasteless and heavy. But HOT! Is was as if cayenne were the only seasoning used. \n   Addendum: the garlic naan wasn't hot, just dry and tasteless.\n   In decades of enjoying Indian food in many cities and countries, I think this may be the worst I've ever encountered. \n   Next time, we'll spring for the $$$ and enjoy the excellent food at lovely DOSA down Fillmore at Geary.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-17", "description": "Easy to order online. Delivery had no problems and order was perfect. Chicken tikka masala was spot on in the spice department. I ordered plain and garlic naan and the plain was really just too plain than normal IMO. Garlic was great.", "author": "Alyssa A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-23", "description": "The service at this location was completely awful.  We ordered a light evening meal, a couple kachumber salads, bread, and chai.  The waitstaff didn't come back after setting the plates in front of us.  It took a long time to get some butter for the bread, and then we had to flag someone down to get our bill (and that came quickly).  The staff act as if they don't care about their business; no one checking in on the customers, no one even looking at the customers.  A man who seemed to have a relationship (owner, manager?) with the establishment sat in the corner, occupied with his cell phone and dressed wayyyyy to casually (rubber flipflops, really?)  If they want to be taken as a serious contender in a city of wonderful food establishments, perhaps they ought to act as though they take their business seriously.", "author": "Frankie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-02", "description": "We ordered delivery from here via Grubhub. The confirmation email we received said the food would be here within 1 hour.... It took 2. We called the restaurant twice and all they could say was that the driver had left... They couldn't find out where he was or give an estimate of how much longer it would be. The food itself was quite tasty so I'm giving it 2 stars and docking the other 3 for slow delivery and unhelpful service.", "author": "Andree S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-19", "description": "I've eaten Indian food all over the U.S.  I've eaten Indian food in London, Paris, and Singapore.  And this place serves just about the best Indian food I've ever had.   The location is fairly new and doesn't have a following yet, so it's easy to get into and the prices are very reasonable.  We have tried dishes from every section of the menu, and it's all been excellent.   The front section of the restaurant has a couple of TV's playing (with the sound off) which I could do without.  Otherwise, it's great.", "author": "Carl L."}
