{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Delicious food!\n\nStarted with the caprese salad, and it came with an amazing green house sauce - yum!\n\nThe carbonara was nice and creamy, almost like deviled eggs with pasta.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "Everything was super delicious. \nThey offer decent wine with reasonable price. We ordered an appetizer and 2 main dishes. It was just enough for 2 people. \nPasta was great, I thought appetizer could've been better. \nOverall 4.5 stars.", "author": "Stacy U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "I was looking for an Italian restaurant in my neighborhood, and enjoyed this one. Very good salmon. Also liked the spinach pappardelle.\n\nWell priced for this kind of restaurant. Somewhat noisy.", "author": "Jethro B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "Just went to their new location.  Been to their old one a few times over the years.  Parking a bit harder now.  Food still delicious.  Go early or else you will be waiting for a long time.  Veal is always my favorite.", "author": "Cat B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "SIMPLY EXCELLENT.   As a native San Franciscan, this is one of those hidden gems that can be found in the neighborhoods of the City.   Don't look further if you want an authentic taste of Italy.   Four different orders were all \"perfect to the palate\".  Don't skip starting with the Antipasta, a generous, real treat of a variety of items and flavors.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-02", "description": "So-so at best. Came at a bad time behind two large groups. Waited 1.5  hours for the food. When it came, it was just Ok at best. A few dishes weren't good at all. There was a pasta dish with lemon, not recommended and the chicken saltimbocca which also was not good. \n\nOverall, all the food was just OK. Certainly not worth a repeat. All the food was underwhelming.", "author": "Carlo W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "Beautiful and cozy Italian restaurant, made the perfect night in the city one to remember after strolling about Golden Gate Park. \n\n[The Restaurant] \nCozy, intimate Italian restaurant with homemade pasta and delectable dessert and wine choices.The Trevi Room, which has a beautiful floor to ceiling mural of the Fontana di Trevi adds a nice touch to a romantic evening as well as the red rose that ascents the table. \n\n[The Service] \nFriendly waiters that offer good recommendations. They give complimentary bread upon ordering with a single square of butter hidden under their fresh loaf of bread (I wished they gave more butter, but that's just because I LOVE Butter). The restaurant is very intimate so, it's not hard to get their attention if you need service/ \n\n[The Food] - WOWZA, it was DELICIOUS\n\n-Complimentary bread: crisp and chewy on the outside and soft and delicious on the inside. wish they had warmed it up though. \n\n-Spaghetti and homemade meatball special (it had a fancier name but since it wasn't on the menu, I don't know what it was called..it was a verbal special): Fresh tomato sauce was on point, loaded with delectable flavor and the meatballs were juicy and mouthwatering to the bite. The noodles were cooked al dente (Which I LOVED!) Price: 17.95\n\n-Linguine Alla Carbonara (with pancetta, cream, shallots, and garlic): rich, bold flavor of cream and pancetta with undertones of the garlic and shallots. Creamy texture topped with formaggio (Parmesan cheese). Price: 16.95\n\n-Wine choice of the night: Pinot Noir by the glass. Price: 8.95\nI decided asked for my glass to be split with my significant other so that we would each have half a glass, and it was just the right amount! I'm a light weight so when restaurants serve me full glasses of wine, I usually don't finish it on my own. \n\n-Dessert: Exotic berry fruit tart: LOVED IT! Beautiful presentation and wonderful raspberry chocolate sauce to complement the creamy custard and berries of the fruit tart. Very different and unique flavors compared to what I was expecting, but that's probably why I liked it. Price: 8.95\n\nOverall, a wonderful experience filled with flavors that made my tastebuds shiver. The ambiance was romantic and at the end of our meal, they gave us complimentary moscato shots. (I'm not sure if they give that all the time or because it was my birthday, but their moscato was delicious).", "author": "Emily T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-29", "description": "Very nice wait staff. The food was good but I have to say at North Beach Italian food is better. If you're looking for Italian in the Richmond district however, I think this is a good place for you.", "author": "Martie A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-08", "description": "This place disappointed me in many ways. It has OK food so I didn't want to give it one star. So two stars it is!\n\n1. Service was extremely slow. We went inside, ordered, and waited for a long time. Nobody served us the bread until we asked for it. The waiter was not very patient.\n\n2. Food flavor was OK. Not super impressive but OK. Just like the Italian food you can get at any Italian restaurant. The portion was very small. I don't think the calories  worth the money I paid.\n\n3. Rest room was very dirty. \n\nI'm not going back.", "author": "Fish T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-23", "description": "Let's start to say for a Friday date night place it's ok , we had seven o'clock reservations. Place was fairly empty. Two sides of the restaurant one side was reserved for what to look like a large party .  The other side was for I guess the regular dinners. Two waiters and I counted three busboys. One maître d'. Once seated handed the menus and left alone for one moment the waiter comes up to us with pad in hand asking us what we wanted to ordered . \nI don't like that give us a little time or just take a drink order.  Don't rush me. \nOur bread and two pads of butter arrive with glasses of water.  \nWe make up our mind what we want to order and make selections. \nOur food comes out delicious .\nNo complaints. Portions where worth what you are paying. \nWater glasses had to be asked to be filled. \nOur waiter I believe was working the other party, too. So he was no where to be found. Had to ask for dessert . Had to flag someone down so we can get our check. Had to get someone else to take our money . \nSo you can say food was good, services where kinda hit and miss.", "author": "Jesse S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "Solid Italian fare made here in this cozy little neighborhood place.  Friendly staff.", "author": "Angela B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "Don't let the location or decor keep from experiencing wonderful Italian food. The antipasta was amazing. We also enjoyed the seafood special, chicken and veal. Very happy with the food.", "author": "Theresa F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-23", "description": "Their pasta is really good! The staff is very friendly and it's a cozy small restaurant! They have good options for vegetarians! It was a cold night when we had dinner here, I just wished we had some hot bread served on the table! Nevertheless the main course made up for that!", "author": "Premila M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "Lovely, relaxing spot for a weeknight dinner to catch up with a friend. Very good food and service. Loved the music playing in the background. Grilled fig appetizer was fantastic. I'll go back.", "author": "Carol F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "Mescolanza is one of my favorite Italian restaurants, and not just in SF. I went to the one in the outer Richmond for years, and am so happy that they were able to re-open in a new location. We go every time we're in the city. The service is lovely, the prices are appropriate for high-quality Italian food, and we can always get a table. I strongly recommend the Pasta Fresca as it is simple and delicious, and the perfect serving size for one. Everything we've had at Mescolanza is delicious. Can't go wrong.", "author": "Gabby K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "I've been there several times. Last night the special Pasta Fresca was delicious.", "author": "Paul N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-24", "description": "We used to go to Mescolanza when it was on Clement Street.  I was a very small and intimate place with a full-on Italian wait staff.  Food was fabulous with daily specials that were subtle and tasty.\n\nA while ago we tried to go there and found they were closed - I thought that gone out of business and was sorely disappointed.  Fast forward to this Friday when, traveling back to SF, we looked for a place to eat and found they'd moved to Geary Blvd.\n\nFirst off, the new place is much larger with two dining rooms.  We were seated in the side room (early seating - about 6:30) and immediately made at home by our server.  The tables no longer had tablecloths, a step down from the old place.\n\nThe room quickly filled up so by the time our salads arrived the room was full.  In the back a very boisterous group of early 30s women (on a night out) were making so much noise that our family couldn't hear ourselves think, so I asked to be re-seated and they immediately  accommodated us\n\n3 1/2 stars for ambiance and  service.\n\nThe food, alas, had suffered from the move.  Where once it was consistently light and interesting, now it suffers from highly variable quality - in the same meal we had some delightful choices, coupled with disappointingly  ordinary and even heavy handed sauces.\n\nFor salads we ordered Insalata Mescolanza and Radicchio e Gorgonzola Salad - both were good, staple salads - the salad dressing with the Radicchio was delicious, the salad presented as a set of radicchio flower petals centered around a small bowl of the dressing and gorgonzola cheese nestled inside the petals.\n\nFor mains we went with:\nPizzetta Pere Bianche - interesting combination of mozzarella, goat cheese, pear, walnuts, prosciutto - a nice combination of savory and sweet\n\nPasta Fresca - a totally uninspired rendition of the dish\n\nRavioli Di Verdure - a lovely light olive oil and garlic sauce over hand made ravioli stuffed with artichokes - this one was scrumptious\n\nAn item off of the evenings specials - Ravioli stuffed with artichokes and fish, completely smothered with a heavy tomato and cream sauce and the occasional pea.  \n\nWe didn't stay for dessert. \n\nWe didn't get any alcoholic drinks - total tab before service was about $114 for four people.  A reasonable meal by SF standards.\n\nOverall, a few years ago I would have rated Mescolanza a 4 on the food, now they've fallen to a 3, perhaps a 2.75.\n\nIncome averaging the ambiance, service and food I'll give Mescolanza a solid 3 in their new location.  In any other city this would rate a return, but with so many places to chose from, and so little time to try them out, I doubt we'll be returning here again.\n\nA note on my rating schema\nRating system \n1) I wouldn't feed a dog I hated here\n2) I'll give it a miss\n3) Good food - I'll definitely go again\n4) Really good - I'll recommend to business colleagues and connoisseurs of this cuisine\n5) Completely worth a trip - I'd book airplane and hotels to go there again.", "author": "Andrew N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "The food here was great and the waiter was even better. We had a tall dirty blonde haired Italian waiter who got right in with my girlfriends family and mine. We came here on May fifth for my girlfriends birthday and everyone had a great time. The seafood pasta with the clear sauce is what I went for after a gracious suggestion and it did not disappoint. The only problem I had was that I left wanting more.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "This food is outstanding!  I have longed for a proper Italian restaurant with tortellini, gnocchi, and polenta is fungible. The famous Italian operas playing softly on the speakers, and Italian wait staff who are warm and friendly with regulars and newcomers.  This review is a bookmark reminder to me that we must return!", "author": "Soo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "Order the linguini - just do it! Mescolanza is now one of my favorite Italian restaurants! If I had to describe it in a few words, it would be \"fresh, homemade pasta and fluffy bread with warm butter.\" My sister greatly enjoyed her chicken linguini. In her words, every bite was \"perfect buttery goodness.\" I ordered the spinach gnocchi, which was made fresh and had a doughy consistency. It wasn't too heavy and had just enough flavor with the red sauce. My other sister order the lasagna and she was impressed with the fresh ingredients as well. For dessert, we got coffee and tiramisu, which was the perfect complement to our Christmas eve dinner. We will happily be back.", "author": "Joanne K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "We visited this little gem while in San Francisco. I am Italian, and can be very critical. It was one of my top 10 meals I have ever eaten. It will not be forgotten. Thanks for the great food and hospitality!!!", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "Ever since my sister discovered Mescolanza (by walking down the street years ago), I've been to it multiple times. It's my favorite Italian restaurant in SF!\n\nTheir Gnocchi Allo Genovese (pesto gnocci) is my favorite dish. It's not always on their menu, but you can request it. Their pesto sauce is rich with flavor and has the perfect combination of basil, cream and parmesan. I wish I could make it to that consistency at home but it's never as good as theirs. My mouth is watering as I'm writing about it.\n\nTheir food has always been impeccable and still is! My sister married last month, and she chose its new site for the reception. My relatives, who are major foodies and great cooks, raved about the food. The clams were in a beautiful savory tomato/white wine broth, salmon was cooked perfectly moist and tender, the pesto gnocci was fluffy, flavorful pillows...every dish was amazing. The chef and staff are very kind and accommodating. I'm grateful they made it such a memorable evening for my sister, and I can't wait to go back for the next occasion.", "author": "Tes Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-20", "description": "Overall a bit disappointing. \nThe wine was overpriced, the salad was below average and small.The pasta was good but not great. The pizza was tasty,  and if your a thin crust kind of person, (not me), you will like it.\nThe decor, and overall ambiance is not what you would  expect from a classy restaurant, but thats ok, as I dont believe this place is. \nCouple of pointers for the waiter.\n1. Wait till everyone is finished with the course, before collecting  the plates.\n2. Serve from behind. Usually  from the person's left. Never across the table in front of the person, or worse leaning over from the side.\nThe complementary desert wine was a nice touch, but by this time, I had made up my mind that this place is not worthy of a repeat visit.", "author": "Iain A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "Excelent Itialian food in a charming atmosphere. The owner is very experienced in Italian cuisine although he did tell me he was from Mexico. I have spent many years sampling Northern Italian cuisine on my visits their yearly and I feel this place mimics their dishes! Very relaxed Neighborhood place and great to stroll into after a walk in Golden Gate Park and walk home :)", "author": "Joni D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-06", "description": "Came here with my family (party of 12) for a birthday dinner. They accommodated the large party well and were attentive. \n\nI personally tasted 5 dishes and I thought the flavors were on for typical old-school Italian fare but there were just slight misses. The pizza was a bit thin and soggy in the middle. The linguine was a little over and soft without any bite. The salmon we had was quite nice and balanced with acid and saltiness. \n\nThe main reason for the two stars is that my wife discovered a quarter of an Oreo in her Linguine Alle Vongole. It was clearly part of an Oreo, it looked like an Oreo and my wife said it was chocolatey and sweet. We pointed it out to the server and they took it away and said they would comp us for a fresh dish (we were halfway through), which we appreciated. Then the server came out and said it was not an Oreo, but sand. It was a black clump the size of a half dollar! We told them it was an Oreo, and they insisted it was sand. Then they came back again and told us they had no idea how it got in there because there are no Oreos in the kitchen. Then they said it must have already been in the clam. THEN THEY SAID IT MUST HAVE BEEN SAND. \n\nLook, it was gross and obviously part of an Oreo. We didn't make a big fuss. We appreciated the comped dish. Just don't make excuses and don't try to insist we were wrong. It's insulting and it's better to just own the mistake and move on.", "author": "Francis C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-30", "description": "3.5\n\nEver gone back to a high school reunion and that girl you had the hots for ( the one with long red hair, freckles, wonderful curves....ahem where was I)....and there she is three kids latter and an extra 75 pounds, smoking a benson and hedges...puff boom there goes the dream.\n\nMescolanza is somewhat like an old flame. I remember wonderful times at their old location: Their killer pastas, pizzas and entrees.....but.\n\nThe pastas are still really good. Wonderful and light gnoochi, pappardelle, and linguine. \n\nMisses were the bruschetta with carpaccio....over powering horse radish.\n\nThe main dishes: My Chicken Saltimbocca was drowning in a weird and oily sauce with melted cheese....it was not very appetizing. Dito on the Veal.\n\nCalamari steak was done very well.\n\nPizzas looked great.\n\nAmbiance is wonderful with family members working hard. One of the waiters sung happy birthday ( with a wonderful voice) to a diner.\n\nPerhaps it was mind playing tricks from the past. Maybe I will have to go back with a less colored view and give it a second try.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "The food here is always delicious. I started going to Mescolanza when it was on Clement and recently rediscovered it in its new location. The ambiance isn't the greatest, but the food and service are very warm and hospitable. Definitely a favorite go-to neighborhood restaurant.", "author": "Jay E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-06", "description": "Walked in and we were seated right away, that was the only fast thing they were able to do. We sat for about 15 min before someone took our order, our bruschetta came about 10min after that. When when had been there an hour my boyfriend went to check the status of our meal with the servers, not one stopped talking to ask if he needed anything so we got up and left. \n\nI wish I could review the food but the only thing we got to eat was the bruschetta and that was over salted.", "author": "Angela F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "I like this place. The foods is same taste of original Italian food. Good service and very nice waitress.", "author": "Kay K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-21", "description": "Disappointed.  I had loved Mescolanza when it was back on Clement.  I hadn't gone back in a while, but was happy they hadn't closed down but had moved recently.\n\nI ordered the Chicken Parmigiana.  It was good, but the portion was ridiculous.  The chicken took up half the dish (other half was vegetables), but when you uncover all the cheese ladled over the chicken, it's perhaps just a little over half of what it was.\n\nJust wasn't as good as how I remembered them.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-17", "description": "I love that I can order delivery through GrubHub, and it tasted good, but...\n\nI paid $26 for a near-empty container of 6 lukewarm raviolis. It wasn't anywhere near worth it. I was so disappointed!", "author": "Katie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "We have been coming to this restaurant for 10 years!  Consistently delicious.  The service is excellent.  Nice atmosphere.  Warm. Newly relocated and redesigned.  \n\nWe had the tortellini and the gnocchi.  I like my gnocchi a little hard.  These were somewhat on the soft side today. Otherwise, it was an excellent comfortable experience, as always.", "author": "Emilia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "Made reservations for a party of 5. We arrived 15 mins late but they still had our table. On top of being 15 mins late we waited at least 45 mins for our last party member to arrive. They were nice the whole time. Didn't give us a hard time for waiting. \n\nI ordered the clam linguini with tomato base. It was delicious. Clams were great and there was a good amount. The dish didn't quite fill me up but I think it's because I skipped lunch and ate dinner late. I definitely will be coming back. I love the service and the food. Also the decor was great", "author": "Mary L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "delish gluten free pasta with a clear sauce with clams (which was also a kid favorite)\n\ndad had the veal and he is very picky and loved it\nquiet warm atmosphere \nfriendly servers\nwe have been there twice in one month and both times did not disappoint.\n\nbe sure to call in advance to make sure they have GF pasta in stock\n\nfamily friendly as well. \ndefinitely our new favorite italian place in the city.", "author": "Win H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "What a cute Italian restaurant! We were looking for an easy and casual Italian restaurant on a Saturday night and found the perfect place. While we did make reservations, the restaurant is quite large and can easily take walk ins. The service is extremely friendly. Our waiter was quirky and friendly and made sure that we were never wanting. We ordered the gnocchi bolognese and the linguine alle vongole and both were delicious. The gnocchi was pillowy and soft. My boyfriend said it was the best gnocchi he has ever had in San Francisco. The clams were extremely fresh and not overdone and the tomato sauce was just right and not too salty. For dessert we had the tiramisu which they make in house. Yum. We are definitely coming back here again.", "author": "Alice H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Italian restaurant has the best carbonara I've had. They have managed to keep the quality and staff intact.", "author": "Quinn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "We love trying out new spots for Italian food and were thoroughly impressed with this place. The food was delicious, the service was great and it had a nice atmosphere. We will definitely return", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-01", "description": "I really wanted to like this place given that it's one of the few pasta/pizza places in the area. The service was extremely slow all around. It took us (a party of 2) 2 hours to get our food. The pasta was bland and on top of that they gave us the wrong pizza to go.", "author": "Mariane B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "If you want a legitimate Italian dining experience in the inner Richmond this is your jam. I always get the pasta fresca and the hubby orders the gnocchi. Both delicious. I bring friends here all the time and everything they order is also amazing. They also usually give you some free limoncello for dessert!", "author": "Kim M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "First time and it won't be my last!  \nLoved the wine-the by the glass selection was small but the Zinfandel and Pinot noir were lovely. The artichoke and shrimp salade was amazing- the pesto sauce made it! \nEntrees were the chicken saltin bocca was lick your plate clean and the Pasta Fresha (spinach pasta) wa sooo flavorful- loved it! \nGreat little place- nice for a romantic night out. \nService was quick and sweet. I will be back!", "author": "Dangerous T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "Dear Mescolanza, we love you are back in our lives.\nOh how I dreamed of your Linguine alle Vongole while you were moving locations.\nMy wife is Italian and she only eats good Italian food and will not settle for less.\nMy Mom is a critical Japanese lady who will always tell me what ever dish she ordered needed this or that or less of this or that to make it taste better.\nI took them both to Mescolanza at your new location and still, you are the best and both my wife and Mom left very impressed.\nEvery sauce on each dish was perfect.\nThe noodles cooked to perfection.\nThe waiters and waitress charming.    \nWe love your restaurant and cannot wait to return.", "author": "Kai R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-19", "description": "Father's Day and my husband gets his choice of eateries.  He loves Italian, we were in Golden Gate Park, he read Yelp reviews and came up with Mescolanza.   It's been around for 30 years and has that old school feel.  It was packed and there was a large party but we got seated within a few minutes.   We ordered and waited and waited for about 45 minutes to get our salad.  My husband can be a bit short with waiters especially if he's hungry and there's an unusually long wait.  The waiter brought us a complimentary grilled eggplant appetizer and a second beer.  And then we waited another 45 minutes for the entrees.   The waiter said the kitchen was very backed up though the place now only had a few tables in use.   He knew we were not happy and he offered desserts on the house.  The food was very good, though heavy on the garlic.  Bread, salad, dinners all very good.   The desserts were excellent, even better having them for free.   We told the waiter he had turned this experience around for us....he did just the right thing.  He kept us happy with free food and a good manner.  We'll be back as it didn't seem from other reviews that slow service happens often", "author": "Laura S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-10", "description": "When I came upon the description of this place I was headed home on Geary to Marin and wanted somewhere nice, but not too far out of the way. This place sounded wonderful. \n\nAfter hearing from the wonderful older gentleman, then the nice wait-staff lady about the Osso Bucco being sold out and informed of the specials, I was delighted how nice they were! Mescolanza is one of those places whose venue was probably 15 other types of restaurants before it, but I'm used to that in SF. The venue is not special. It is very convenient. We got seated right away and felt very comfortable. \n\nI had the linguine w/ baby shrimp, fresh peas, a very light buttery sauce with fresh pasta. No wine, as it was a Tues. I also had a primavera salad (spring mix, goat cheese and a nice balsamic dressing) and minestrone soup which was great. \n\nI tell you, the food tasted wonderful and I heaped accolades to the staff on its perfection. The total for two w/ no wine came to $37. \n\nThen the not-so-fun began. I have one, exactly one criterion which I demand before I give any place more than one star: that I do not get sick. I did, we both did simultaneously within 20 minutes of finishing our food then leaving. It wasn't fun, and I stayed up all night dealing with it. \n\nI wish it didn't happen, but it did. Restaurants these days are heavily reliant on the back restaurant staff who have to touch everything. They work fast and accurately. Working fast, accurately rarely has no impact on cleanliness or hygiene, towels don't get changed, gloves don't get changed, hand-washing or using lots and lots of hot water and vigorous scrubbing goes by the wayside. Food preparers are often magicians when you are lucky to get a chance to seem them work, but they do have to go to the bathroom. One time I went to a restaurant and saw a food preparer who was wearing several pairs of gloves go in, do his thing, very quickly wash his hands, then quickly leave the bathroom w/out removing his gloves, or even the outer pair. I saw him go directly into the kitchen w/out changing at all and begin touching surfaces. That was not here. But, what I'm trying to say is I doubt if the food itself at Mescolanza had anything to do with me getting sick. I really hope to go back to Mescolanza some day, but it won't be soon.", "author": "Kevin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-17", "description": "My sister and I loved our trip to Mescolanza. The host was very nice and let us pick our own seat. Our server was very friendly and the suggestion of the Carbonara was spot on! We shared that and the spinich gnocchi with tomato cream sauce. I can say both were delicious. The gnocchi were some of the tastiest (and clearly fresh) I've ever had. \n\nVery pleased!", "author": "Cori N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Very nice non-touristy Italian restaurant in the Richmond District.  Authentic cuisine, nicely prepared and presented.  Cozy setting, but not sleepy, and it was perfect for our table of 4.  Sevice was attentive and prompt, but we never felt rushed to clear the table.  I got the artichoke ravioli (delicious) and 2 of my kids got the clam linguine (they finished it all).  Nice size menu - not too long, but plenty of choices for different tastes (even several options of ray vegetarian daughter).", "author": "Peter F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "living in the neighborhood, i've passed by mescolanza on my way home almost everyday for the past few years, but never tried them until this evening. not in the mood for my go-to burmese or chinese joints tonight, i called in my order on the bus, quietly whispering \"gnocchi bolognese\" as to not to embarrassingly announce my dinner to the packed 38R.\n\nspeaking only for the gnocchi--this might have been some of the best gnocchi i've had in recent memory--or in all memory, really. clearly made fresh in-house, these gnocchi were large and pillowy soft, almost like lightly whipped pockets of mashed potato that melt in your mouth. while i'd probably be happy just ordering gnocchi from here, i'm curious to try more of the menu to see if their other dishes are just as satisfying.\n\nplaces like mescolanza are what i love about the inner richmond--these hidden gems that offer superb food on par with other overhyped places with super long waits in more centralized areas in the city. i'm lucky that these are my local neighborhood joints that i can drop by on the way home. next time i call in, i won't be shy to yell out my order and recommend the gnocchi bolognese from mescolanza to the entire busload of people.", "author": "stefanie h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "Good food, very attentive service. We got the gnocchi which was very good, and the linguine with clams in clear sauce. The decor and ambiance needs a little more warmth.", "author": "Brianna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "My now husband and I have been visiting Mescolanza at least once a year since we first started dating over 9 years ago. They were first on Clement and now moved to Geary. Same owner, chef, and staff. My favorite dish is their pesto gnocchi. It is absolutely superb, like fluffy pillows of clouds melting in your mouth delicious!\n\nWhen they closed their Clement location, we were heartbroken. We had just gotten engaged and wanted to host our intimate reception there. So instead we had to choose a different restaurant. Then, in June 2015, I received an email saying that they will reopen in their now current location on Geary. We quickly canceled our reception at the other restaurant and spoke with Veronica and Ruben (owner and chef) to have our October wedding reception at Mescolanza. Everyone was so accommodating. We went over seating and lucky for us their new location had two rooms, one with a gorgeous backdrop of the Trevi Fountain. They even ordered white tablecloths for us and printed our menus on gorgeous stock paper. We were able to seat 20 people, had a 6 course menu, and wine and beer all within budget. My relatives, avid foodies themselves, were so impressed with the dishes, especially the salmon that was cooked to perfection.\n\nI just want to give a shoutout to all the staff. You guys are so friendly and so kind. Our server had just returned from Italy that day, and at night was busting out all the dishes for their first wedding reception.", "author": "Mel Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "Quiet, nice restaurant on Geary close to Golden Gate Park and the deYoung Museum.  About 4 blocks away.  We stayed at a motel close to this and walked to the restaurant.  Wonderful service -  the server offered us tastes of wine to see what we liked.  The food was well prepared.  I had the calamari - very tender, breaded - but nice.  Try this place - seems to have a following.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "No idea why more people aren't coming here in droves - the food and service is SO good. It's also super clean which is always a nice perk in SF. I got the carbonara based off the pictures and it did NOT disappoint. Can't wait to come back. So excited to have this spot in the neighborhood!", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-30", "description": "Always a pleasure to go there \nI have say they didn't 5 stars because their appetizers size is way too small barely enough for one person on the salad and with that tomato or the Caesar salad it's way too small", "author": "A. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "Great trattoria+++ \nWe had salmon and osso bucco entrees and more. Good sized portions, cooked perfectly. Mescolanza is not fancy but great addition to the neighborhood. We went before theater and they got us in an out promptly with attentive service.", "author": "Brent O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "A family favorite for many years! \n\nLove the new location. Delicious pastas, great Caesar Salad and Carpaccio. I always have a hard time deciding between the Carbonara, Limone, or Linguine with Clams. Generous pours of Vino. Good value. \n\nWonderfully kind, warm staff that make you feel like family. Cheers!", "author": "Shawn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "I love mescolanza! My family goes there once every few weeks. The staff is really great and its a very cute restaurant. They care a lot about their customers and their food. I personally love all of their pizzas because you can eat a whole one and feel full but not gross and bloated. The crust is super thin and it tastes incredibly fresh.", "author": "Carmel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-23", "description": "Little or no parking.  Very noisy room.  Food & service ok.  Not a great experience.", "author": "Kenneth N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-15", "description": "This place is a combination of great service and atmosphere with less than tasty food. My pasta dish was very bland and my uncle's salmon wasn't cooked through. We also had to wait about 45 minutes for our food after we ordered.", "author": "Jeffrey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "We absolutely LOVED our experience at Mescolanza!  We learned of the restaurant from the show 'Check Please Bay Area' and we're so glad we had the chance to try it out this past weekend.  The restaurant is attractive, the wait staff was very attentive and friendly, and with one exception, we thought the food was fantastic!  We very much enjoyed both the carpaccio and polenta appetizers (the polenta was off the hook!), a green salad and the house-made gnocci, which was the best we'd ever had.  I also ordered the Pizzeta Mescolanza which I cannot recommend - although the toppings all sounded great, it was a miss for us.   Oh, and we shared one of the flan-like desserts which was delicious as well.  I give Mescolanza two thumbs up!", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-03", "description": "I had the Spinach Gnocchi, it came in a red sauce. Plenty of little doughy puffs to fill me up. The first few were the best, hotter than H*** and smooth as silk. As they cooled, I just felt like I was eating raw dough. I couldn't really taste the spinach, and found them much better with heaps of parmigiana cheese. \nMy wife ordered artichoke stuffed ravioli, which I stole some of, and I couldn't taste the artichoke, but the fresh garlic on it was very dominate. I preferred these to the Gnocchi, though I didn't find the pasta covering all that great - it wasn't rubbery, the texture was acceptable, but not exceptional.   Wife said Bogle Cab was ok.   \nTried the Chocolate Flan for desert. More like loose chocolate mouse. The cookie on the bottom was soggy, maybe that is the way it was suppose to be. Otherwise tasty.", "author": "Richard W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-06", "description": "Went here with the bf and had\n\nprosciutto melone\npetrale sole\npesce del giorno (salmon)\nand tiramisu for dessert\n\nI liked the food but the bf was less impressed.", "author": "C L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "We're relatively new to the area and didn't really know where to go for Italian. Yelp reviews for this post looked good, it was a quick walk/bike ride away and the price point was spot on. \n\nHad no troubles getting a table for 2 on a Sunday at 5:45-6, they hadn't opened the second additional room yet. \n\nServer was very attentive and treated us well. We got our grilled eggplant quickly and it was great with the bread. \n\nFood was BOMB. BF got the Paglia e Fieno Alfredo and it was FRESH as F. The server explained that it's fresh pasta but they don't make it in house. I got the spinach gnocchi because it was the only one with a red creamy sauce. I later overheard the server telling another table that you can do a lot of mixing and matching with sauces and pasta - good to know. The gnocchi is made fresh from scratch in house and it tasted like it. Creamy tomato sauce had the right amount of creaminess and tang. But I'm not gonna lie, the bf's pasta was waaaayy better. That's what I'm getting next time :) \n\nHad Tiramisu for dessert. Yummy but nothing to write home about. We were in and out in an hour or so. Definitely coming back.", "author": "Victoria K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "Wonderful service, great food. Everything fresh and with a touch of original flavour or flourish. We had the angel hair pasta and the wide spinach pasta with chicken. Also a Caesar salad and Carpaccio to start. Gianduia Budino for desert was perfect. Very satisfying, we will make this a regular spot.", "author": "Peter R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "Well priced, much easier parking now, same wonderful staff, and a menu that never ceases to disappoint. I crave the pear walnut prosciutto pizza at least once a month. Their mushroom polenta is also excellent. The waitstaff and owners are so friendly. One of the waiters can sing a lyrical, operatic \"happy birthday\" that you will not soon forget. High quality family-run restaurant. Highly recommend it!", "author": "Shannon B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-12", "description": "Pretty disappointed with this place. Flavors were good but the gnocchi was very mushy, and the portions were very small for a $17 plate of gnocchi. Ambiance was like an American diner with some Italian music in the background. Staff was friendly and service was decent. \n\nWon't be coming back here anymore. Really felt like they overcharged and did not deliver.", "author": "Jabez T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Mescolanza rocks! My friend and I went there for our annual Christmas-time dinner and were served our delicious entrees with warm graciousness.  I had the spinach gnocchi with prawns - one of their specials that evening - and it was a wonderfully flavorful generous portion.  We also got the awesome radicchio salad, which is just as aesthetically pleasing as it is tasty.  Dinner ended with their creme caramel, which was a perfect ending to a perfect meal.  Hope you're able to make it there!", "author": "Eileen W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-20", "description": "There are several Italian restaurants I'd rather go to. Food was good but WAY overpriced!!", "author": "Kathleen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "I'm really glad I tried this place. Apparently it moved from another location but it's new to me.* I had a caesar salad, a rigatoni pasta special and a glass of wine. The food was fantastic and the service was excellent. They kept the water and bread full and were really friendly and attentive. I couldn't ask for anything more. This is my new favorite place in the neighborhood. I can't wait to go back and try more menu items. \n\n* If there is one piece of constructive criticism I would give the owner it's that the dining room seems a bit loud (acoustically, not the patrons). I would consider some acoustic ceiling panels that could absorb some of the sharp noise.", "author": "Isaac K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-07", "description": "My wife and I ate at the new location on opening night.  We recognized diners at the other tables as regulars from the former location.\n\nWe started with pizzetta - mozzarella, goat cheese, pear, walnuts and prosciutto - fantastic - perfectly baked and just as good as the former location.\n\nWe each had a pasta dish.  I chose spinach gnocchi and asked for Alfredo sauce.  It was really well prepared and I really was pleased I was able to get the Alfredo sauce.  My wife had pasta fresca. This spinach pasta is made with goat cheese, fresh tomatoes and olive oil. We think Mescolanza pasta is amazingly fresh with tasty ingredients.\n\nWe passed on desert - we were really full.\n\nThe new location is a work in progress but the new tables and chairs are a plus.  We will be back.", "author": "Peter M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-07", "description": "3rd visit  at new location\n\nGnocchi w meat sauce was delightful\n Potato dumpling pillow floating on a bed of\n    Tomato meat sauce\n The dumpling was light in texture and density\n     Filling enough but light enough to eat at\n       Late hours\n  Texture isn't gummy! Great gnocchi.\n\nThe custard dessert w hazelnut paste\n  A nice departure from the usual ...\n     Tiramisu\n     Panna Cotta\n     Creme Brulee\n  Kinda like hazelnut Flan\n\n-----------------------------\n15.07.07 - Second Visit\n2nd day for opening\n\nFood ------------------------- 3 1/2 to 4 stars depending on which\nService ---------------------- too new, no need for words, \n                                        to be fair ... will comment and rate it later\n                                        unless u always demand \"your highness\" service...\n                                             some yelper annoy me being \"FN Entitled\"\n\nVITELLO AL MARSALA\n   thin pounded veal, shallots, mushrooms, marsala wine\n   Seasoned sautéed carrots\n   Seasoned sautéed green beans\n   Either pan roasted \n   One of my favorite dish to try in the future\n\nSpecial BRUSCHETTA CON POMODORO  not on menu version\n   toasted bread, \n   marinated organic tomatoes\n   mozzarella \n   balsamic vinegar\n\n \nUsed to be on Clement St. Had to try it again. \nHad the pear, mozzarella, prosciutto pizza. \nIt was just as good as last time.", "author": "S.K. Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-02", "description": "This restaurant is probably the best service I've seen in the bay area. The owners and staff are extremely friendly and accommodating. They are pretty fast and the food is very flavorful! The only downside was that apart from wonderful service, ambiance and good food, I did not feel that they were generous. Generosity is one of the main factors for me or anyone to be going back to a restaurant. The reason I say that is ... for a party of 5 people I would at least expect a basket of bread for 5 people and not for 2 people. Also, I ordered the seafood pasta that was on the new years eve special menu, and while the pasta was quite expensive (around 29 dollars a plate) it came with clams and just 2 pieces of shrimp and scallop each. I have ordered a seafood pasta before and it was indeed filled with clams, mussels, shrimp, scallops and small octopus with a price tag a lot cheaper. My only advice is be more generous cause people do notice and appreciate that.", "author": "Roba Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-31", "description": "I never tried the location when it was on Clement, but I very much enjoyed their new location on Geary. \n\nI had the spinach gnocchi and a caesar salad that my boyfriend and I shared. The salad was good, your typical caesar salad. However, the gnocchi was amazing; light and fluffy. I would definitely have it again.\n\nMy boyfriend loves his spaghetti and meat balls, but they didn't it on the menu. He asked our server if they could throw something together and they happily made his linguine with bolognese sauce. It was very tasty and the noodles were perfectly cooked. The one and only thing we would suggest would be to add maybe a meatball or two with the bolognese, otherwise it was great service cooking that item up for him.  \n\nThe service was great; made you feel welcomed right away. Our server was friendly and attentive. \n\nWe skipped on dessert because we were full. We will definitely be coming back here again!", "author": "Ashley P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-28", "description": "Very good pasta, especially the linguine with clams.\n\nFriendly service.\n\nDesert is just average", "author": "Eric T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "This has become our new go to Italian restaurant. I say new because our other go to restaurant, the owners retired. We just have to have an Italian restaurant that's not in North Beach, and I'm half Sicilian, so...The owners here at Mescolanza are incredibly friendly, as are the entire staff. One of the waiters shall serenade on birthdays. The food is sumptuous, and not expensive, as some Italian establishments can be. On the weekends we tend to put in a reservation, as we never know how crowded it may get. But, that's a good thing. A favorite of mine has been the veal marsala. The pesto is quite well made, seeing as when I was growing up we had sole and pesto on Fridays for Lent. Their pesto passes muster. Ciaofornow.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "I went here with a few friends quite recently and it is another Italian restaurant gem!! The servers were so kind and efficient, especially this one man who sang happy birthday to other nearby customers and had the voice of an opera singing angel!! My friends and I were so impressed with the whole experience. The food was also quite delicious!!! I indulged in the pesto pasta while my friends experimented with the gnocchi and pizza; all equally delicious! yummy!!", "author": "Kirsten B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "Had an alone experience;not tragic. Ordered gnocchi spinache and pinor noir...if you are in a pinch and  hungry for decent food; I recommend.", "author": "Steph R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "My favorite restaurant in the Richmond District.  Everyone loves the food here, and we've tried just about everything. My favorite is Gamberoni Mescolanza-- prawns with a butter and shallot sauce. I not a big vegetable fan but I mop up all the sauce with every speck of veg on the plate.", "author": "Linda A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "We enjoyed a combo Father's Day/birthday dinner here with the whole family and it was just delicious.  Our family includes two young boys and this is the perfect family restaurant for a lively group of mixed ages... or any age.  Everyone really enjoyed their yummy dinners and salads.  (My dinner of Vitello Piccata and Insalata di Cesare was just so good.)  We were all so full by dessert that we had to share rather than order individual dishes.  The waitstaff is super friendly.  Yum we will be back many times.  Delizioso!", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "Carpaccio was delicious, as was the chicken saltimbocca.  Bread was good, linguine carbonara was good, prices are quite reasonable.  Service was decent, but entrees (almost all pasta) were delivered to our table of 7 with probably 8 minutes between first and last, in 4 trips by the same waiter.  Granted, they were fairly busy on a Saturday night.  Portions were reasonably-sized.  A solid 4 stars.  This was my first visit at their new location, but I had been to their old place several times over the past 10 years.  Note that they have only a single restroom, so there can be a wait if nature calls or you just want to wash your hands.", "author": "Martin G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-03", "description": "more like meh-scolanza...  \nthe main dish that i had was alright, the veal was pretty good, but the vegetable sides were unseasoned and just boring. my friend got the gnocchi, which was overcooked and mushy. \nthe staff wasn't very friendly, and the lady that seemed like the owner glanced away as i went to say goodbye on our way out.\nbut the biggest failure on their part was the pre-dinner bread. they served it uncut, without a knife, and cold. the butter that came with it was just a little cold foil-wrapped packet. how hard is it to serve warm/cut bread?!?", "author": "anthony g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "We had an absolutely wonderful pre-holiday dinner at Mescolanza. From delicious food to friendly, excellent servers everything was superb. We started with their beautifully-prepared radicchio salad with gorgonzola and fabulous dressing, followed by linguine with fresh clams and spinach gnocchi entrees. Dinner was accompanied by generous glasses of Sempre Vive sauvignon blanc. For dessert we chose flan with a Grand Marnier sauce, which was exceptional.  We topped our celebration with glasses of moscato and vowed to return soon!  The warm, outstanding wait staff helped make this a very special, memorable evening.", "author": "Ashley A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "We've been going here for, well, a really long time let's just say. The old location is missed but the New location is bigger more active and the most important part for us we get to walk there now!!! The food is exactly just as wonderful as it always was and there's a bunch of new specials, Ruben has gotten incredibly creative with the special salads. I have to order almost everyone. Also their Classics are fantastic...chicken cacciatore, fettuccine Alfredo, we have a vegetarian in the family and this is their favorite place to eat! Wonderful friendly family service, great place to come for a fun date night,!or with a group of girlfriends, or your parents for out-of-town. Thanks for well over a decade of feeding us like grandma used to.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-11", "description": "i was a frequent customer when they were on clement street. due to logistics have been to the new location just a few times. however, while the food is still great - sad to say the bread is just terrible", "author": "Liam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "Every member of our group ordered something different and it was all terrific. Best Tiramasu I have ever had!", "author": "Claire M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-25", "description": "Very disappointed with this place. The food was bland and overpriced. I ordered the Radiocchio e Gorgonzola Salad (the radiocchio was stale and the presentation was horrendous) and Capellini al Pomodoro (the tomatoes were flavorless and mealy).", "author": "Jenn F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "Fantastic! Some of the best pesto I've ever had. Excellent pizza starter too. Very nice, simple eggplant appetizer. The Alfredo pasta dish was also prepared perfectly. The service was fast and friendly. We will definitely return.", "author": "NEIL L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "Food and service still great!  Miss their other location.  It was cozier, elegant, and classic on Clement Street.  The newer location is colder and unexciting.  The prices are the same, just a few cents up.  Adequate considering the time gone by.  \n\nIt used to be my favorite go to gem...", "author": "Emily G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-02", "description": "I'm not a fan of places that overbook, which this place did tonight. \n\nWe call in asking if they have a reservation and they said yes. As I'm waiting in the restaurant I hear them taking more calls that they can seat. The callers, like the rest of us are come in and are told to wait. How long, Oh a few minutes.  After checking in every 15 minutes later, we're seated 45 minutes later. \n\nI totally understand the way restaurants work but waiting around for almost a hour sucks, especially when you already made a reservation and you have kids. \n\nThe food is actually pretty great, the service was super nice and made up for it, but it just leaves a really bad taste in my mouth when that's how you start your dinner. I was torn if I should give them a 2 or 3 star...but  they're service was fantastic and rounded them up.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-26", "description": "Very good food and good service, considering they were PACKED. A bit on the pricy side and portions a bit on the small side but we enjoyed it. We had the fish of the day (Grouper), the pasta fresca and the chicken cacciatore--all were very good with the fish being the best. Green salad had a fantastic vinaigrette and was very fresh. Amazing Chocolate Flan (don't miss it) and a good Tiramisu and Italian coffee.", "author": "Marc V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "Great service and delicious food. The Pappardelle Della Fattoria was fantastic! It was a little stuffy in the restaurant but not uncomfortable. Will be going again.", "author": "Adali M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "Excellent food and service, boring/plain ambiance", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-07", "description": "The place has a employee cafeteria like decor. Bright lights, no table cloths, stacked up tables. I thought the service was very friendly and nice. I would give five stars to service. Food was below average. I had Mescolanza salad. It was well done. I had carbonara pasta. It was truly terrible. It was overly creamy, not tasty at all. We love good pasta. This was shame from an italian restaurant. Then we had bolognese gnocchi. I thought it was OK at best. THere are too many other excellent italian options in the neighborhood. I will not go back. ONe more thing. I thought their prices were reasonable. We paid $130 for six people with two glasses of wine and beer for dinner. They need to fix the decor and especially the food.", "author": "bora o."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "I enjoyed my time there. Food was great! Took the lady out for her bday. They hooked it up with a free bday flan. Dropped them a nice tip. I ordered the chicken ravioli with crimini mushrooms. Nice serving. They were out of the chicken but asked if I'm ok with artichokes stuffed ravioli. I eat it all so it was all good. I'll be back.", "author": "Brent W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "Mescolanza in their old location in the Outer Richmond was one of our favorite restaurants.  Excellent food, pleasant ambiance and solid attentive service.  In their new location, the food is just as delicious but the service and decor need work.  The decor is more suited to a casual diner or cafe.  Our table was too small to hold the various dishes we ordered without shuffling glasses and plates around.  We ended up having to stack our empty dishes which our waiter took his time removing.  We had to ask for bread and our water glasses to be refilled.  Our waiter, while he was nice and made very good food and wine recommendations, clearly needs more training.  \n\nDespite these hiccups, the food was absolutely terrific.  We had the polenta and mushroom appetizer, insalata mista salad, pizza, linguine with clams, swordfish, spinach pasta with chicken and mushrooms, and almond torte.  All delicious.  We will definitely go back but hope that they make some changes so that the new place will feel more like the Mescolanza we knew and loved for so long.", "author": "Esther Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "Very good Encore!!\nThe food was excellent and maybe even better than Clement st.Glad to see that prices are still reasonable and the service was solid.They already seem to have the regulars back plus a new clientele to build on......they just need to make the space a bit more cozy and inviting with some interior decorating.great to see some familiar employees from the old location.welcome back!", "author": "james m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-18", "description": "I will say the calamari steak Dore` and gnocchi. were very good, although I felt the portion of the calamari steak was disappointingly small. Salads were also on the small side.\n\nThe gnocchi were delightfully light and fluffy as they should be, although the red sauce was rather bland. Portion was acceptable.\n\nOne thing we noticed when we entered your restaurant was the strong overpowering sweet odor of some sort of room freshener which is not at all appropriate for where one will eat. The odors when they eat. They belong solely in the bathrooms. The sweet odor lingered during the whole time we were there, and is definitely cause for us not to return,\n\nThe restaurant is pleasantly decorated.\nService to bring out our entree was very slow. We had to wait 1/2 hour after we finished our salads for our entree`s to be served and we were one of the first customers. Certainly made us antsy.\n\nThe next thing we noticed your bill receipt which gives examples of tipping percentages. This is fine, and helpful, however, they should not be figuring the percentages for tips with tax included in the calculations.  Tip suggestions should be based on the cost of the meal only. It is rude to expect a tip on taxes. \n\nDue to the sickening sweet odor, and the slow service is the main reason for us not to return. \nThe small portions are a secondary reason.", "author": "Girly Foodie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "We are so relieved that Mescolanza has reopened in their new location.  Can't say the parking is any easier.  However, the space is twice as large as the last.  The food, service, the same as always.  We've been  coming here since 1987, and they have maintained their consistency all these years.  Favorites,: Veal dishes, osso bucco( get on the call list when they have it available), Linguine vongole, carbonara, pizza,  For desserts, try their Chocolate amaretto,  or hazelnut flan.  Tiramisu is just as wonderful.  \nBut a true test to a kitchens abilities is in their salad dressings.  Yum.  \nOne more suggestion.  When you go, LIE and tell them its your birthday and you will be sung a wonderful rendition of Happy Birthday by their longtime waiter.", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "The food was spectacular.  Once it arrived.  Which took nearly two hours.  We asked for bread six times before they brought a one thin slice for each of us!  We were a party of 12 with a long-standing reservation.  At 8:00 p.m., the restaurant ran out of minestrone and any other soup.  It was as though they didn't expect any diners to show up.  Oh, you mean people are going to come here to EAT??  The service was dreadful, not because of the waiter, who was positively heroic, but because he appeared to be working the entire restaurant alone.  \nAgain, the food was great:  Flavorful appetizers, including truly excellent bruschetta; perfect, thin, white veal piccata; home-made pasta, red and white sauces exactly seasoned; fresh vegetables cooked just to the point of tenderness; tiramisu to die for.  \nWe are coming back to this restaurant.  We are assuming last night's problems were just a fluke - waiters called in sick, someone spilled all the soup, maybe there was a disaster.  Let's give it another chance.", "author": "Marcia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Stumbled upon this place when my boyfriend and I had just finished hiking the lands end trail. I have to say the service was great! They take walk ins, they are attentive, and their food was amazing. We ordered the radicchio salad which was amazing, we got the mushroom pizza which was also wonderful, we ordered the lemon pasta which was the perfect amount of sauce/lemon/Parmesan, and we got the tiramisu which was heavenly. Overall, this place had excellent food and great service. I would go again and I highly recommend others to go as well!", "author": "Reena S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-15", "description": "This place used to be on clement, now a bit more on the spot light on Geary. It really feels like family in here. It's a nice Italian restaurant with great food and comforting environment. It really takes you out of the environment in the city, and it gives the vibe of a restaurant in a rural neighborhood, with a splash of modern. We had the Gamberoni (prawns) and carbonara, with the polenta as a starter. It's what you expect when you think of quality Italian food. I took a star away because it took about 10minutes to get the menu, and we had to flag the staff down to do so. Beyond that point the service was on point. The environment was really relaxed, and patrons took their time with courses and wine. Prices are really affordable 15-20.", "author": "Elton F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "Amazing!! Amazing!! Just as we always remembered it. Exceptional service and each plate was tasty.. Very busy location however the waitstaff was good in keeping their rounds with the tables.. The spinach gnocchi was really good.. Can't go wrong..", "author": "Das M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-02", "description": "I loved the old Mescolanza, the intimate atmosphere and the beautiful decor.  The food has always been outstanding.  The new restaurant has the same excellent food, but is missing the ambience and warmth of the old location.  The cold blue color, no table cloths and high ceiling make for a lot of noise, the door opens and shuts or stays open as people stand there with the noise and grime of Geary coming in.  The new room is gorgeous, but the big window with no curtain makes for a lot of noise.  For people who like a loud and bustling urban cafe feeling its fine, but I preferred the intimate and quieter space of Clement street.  Curtains on the windows and to close off the door, tablecloths, and a warmer decor would make a huge difference for me.", "author": "Karen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "Had a delicious meal with my daughter the night before school starts.  I had the spinach gnocchi and my daughter had the pesto pasta - we both loved it.  So glad to have a nice Italian restaurant in the neighborhood.  Now if only we could get better Indian and Mexican food in the neighborhood I'd never leave!!!", "author": "Ketan D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-16", "description": "Terrible atmosphere, mediocre food, overpriced.  Felt like I was eating in a diner with not as good of food and 4-star prices. Only saving grace was the wait staff.", "author": "Beth B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-16", "description": "I might give it an extra half a star but definitely not three.  Had dinner there this evening and to summarize:\n\n Food overall nothing special or refined.  We ordered the spinach pasta, big and basic, the insalata mescolanza, ordinare, and the calamari steak plate was drowning in butter as was the tiramisu with rum.\n\nService was poor and the staff seemed very discombobulated.  Our food took way to long, I had to ask the waiter what happened to our appetizer.  \n\nAlthough new, the restaurant lacks  good design and the acoustics were completely overlooked...very loud!", "author": "Claud 9."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "Some of the best Italian food I have ever eaten! I cannot heap enough praise upon the wonderful staff and the delicious food.  Great ambience, perfect size.  It's small enough for an intimate feel, but big enough for groups.  I would specifically recommend any of their heavenly pastas!", "author": "Mikayla L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "Amazing food, great drinks, fantastic staff. We came with our \"energetic\" toddler and they were amazing with him even. Can't wait to go back!", "author": "Katie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "Excellent restaurant with friendly quick service. Average prices for a nice Italian restaurant. We made a last minute reservation that evening for 11 of us and they were quick to accommodate. Everyone in our large group loved their meals! We will definitely be back!", "author": "Eva M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-08", "description": "So far, I've been here twice.  As someone who used to love the older location and considered it one of my favorite italian restaurants in SF, I've been very underwhelmed with what I've had.  From a bolognese sauce that didn't appear to have any meat in one visit, to another dish that had woefully cooked gnocci, it hasn't been great. Will try one more time, they are fairly new to this location, so it's possible they're still settling into a groove.", "author": "Geri C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "Great addition to the neighborhood! I went here for the first time tonight and was not disappointed. My friend mentioned it's my bday in a couple days and Claudio made sure were well taken care of with an extra pour of wine and dessert at the end of the night. The carpaccio and linguini carbonara are both delicious!", "author": "M Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-29", "description": "The best thing about this restaurant was how easy it was to get in at 6:30 on a Friday. I'm afraid that was the peak of our experience and from there it went downhill. The food was nothing at all special and shockingly mediocre by San Francisco Italian restaurant standards. We had the artichoke and shrimp salad to begin. The shellfish we agreed was probably canned and the lettuce was soggy and wilted. For my main I had the tortellini in cream sauce with prosciutto and peas--not an inspired choice, I admit, but surely they could have made it less insipid. My son's pizza wasn't large but he couldn't finish it, which is also amazing considering an 18-year-old's appetite. \n\nOther things that put us off: we asked if they had San Pellegrino Limonata and the waiter said yes. What he served was soda fountain lemonade with San Pellegrino sparkling water added. Also, it took forever to get our food. At one point the waiter came over and apologized for the delay, which I took as a hopeful sign, but the food still didn't arrive after that for another 20 minutes.\n\nI went to Mescolanza at their old location 15 years ago and never went back and I won't return to this one. They seem to survive, though, so I guess we just aren't their target audience.", "author": "John P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-22", "description": "I called at 6 pm to make a reservation for 5 people at 7:30 pm. The reservation was accepted and confirmed.\n\nWe arrived at 7:30 pm and could see the place was busy. We were asked to wait a few minutes. Not a problem, we understood if things were running behind, but about 20-30 minutes later we could see that the tables were not going to free up anytime soon. The hostess explained that they had had a two large parties that were late or still waiting for members to arrive.  She was apologetic and polite.\n\nWe were hungry and had a young toddler with us, so we bailed on Mescolanza when we found out Bella restaurant down the street had an immediate opening. \n\nWe had been to the restaurant when it was previously located in the Outer Richmond so I am certain the food is good. But this review is a warning to let customers know that your reservation may not be honored.", "author": "S. H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "Their food is great and their servers are extremely friendly. I liked the ambiance as it felt more like a Mom & Pop run restaurant. In my experiences Italian food is best served and more traditional in restaurants such as this one, rather than large chains or overly fancy places.", "author": "Shahin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "Wonderful spaghetti vongale & spaghetti carbonara at Mescolanza last night! Rubin, the chef, deserves high marks for his delicious food! And the service is great and so personal. The staff beams big smiles and you just know that they care deeply that you enjoy your dinner and relish being with them.", "author": "Diana C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-30", "description": "Good to see neighborhood restaurants stay in biz w high rent etc.  Food was so so.. Best part was our waiter could sing happy birthday very well..", "author": "Eva L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-23", "description": "Wanted a great pasta dinner the night before we ran the half marathon. We started with the Primavera salad, which was delicious. We had the Capellini Al Comodoro and added chicken and the Bolognese Gnocchi. The pasta and gnocchi were cooked perfectly and the chicken was seasoned very well. Will be back next time we visit San Fran!!", "author": "Nichole K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-06", "description": "I was pleasantly surprised by the food and service at Mescolanza.  My party of three arrived around 5:30 p.m. on a Tuesday night.  We were seated promptly.  The server was quick to refill our waters and to check in with us about our dinner.  We got an antipasta platter, which was artfully presented and was decent; the salami was very good.  I ordered a gnocchi special with Italian sausage  The gnocchi was light and airy.  My companions ordered the linguini and clams (which she thought was exceptional, with a well-flavored, yet not overpowering cream sauce) and the veal (which he enjoyed).  I would highly recommend this restaurant to others.  The restaurant is not very big, so if you're going on a weekend, you should make reservations.", "author": "Laughing L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "Top notch italian food. My family have a myth about how it is a vampire resturaunt being as we're ten eleven and twelve but our family has a passion for food we go out alot. I had the pizzete my sister's had the gnocci and the spagetti. We love the caring atmosphere and how they treat you like youve known them forever. I'm so excited to go back very soon. I loved the flan. Definatly will go back", "author": "Rowan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "It was awesome in it's old location, and very close to it now in the new one.  I know there were some struggles to get the restaurant open on a timely basis, but all the kinks seem to have been ironed out, Ruben and his family are tireless workers who will not stop until the restaurant is perfect!  I have enjoyed every dish I have had there, the prosciutto and pear pizza is to die for.  I look forward to returning in a couple of weeks when I back up there!", "author": "Bob J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "This place finally opened and their food is just as great as it use to be back at their old location. Same great staff and extra tables! They get extremely busy very early so make reservations! The same gentlemen sang happy birthday to my father for two years now.. Haha love to see my father blush.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-26", "description": "We had a large party so I was able to try a few of their entrees. Was very impressed with the pillowy soft gnocchi paired with the yummy cream sauce.  Ordered a pizzete and it was crunchy and tasty. Veal was tender paired with a mushroom marsala sauce that worked very well with each other, a little salty but still tasty. Also had the other veal with this white wine sauce.  This one was lighter with a hint of lemon. The chicken parm was soft and juicy, not overcooked. The special was a salmon dish that looked really good but was unable.to get to cause it was at the other side of the table. Have previously been here but at the last location on Clement.  First time at this location, a much different feel but still comfortable, welcoming and tasty. Will definately be back!", "author": "Chocolate P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "Went here last night for a family dinner and had a great time.  The food was delicious and the staff was incredible.  I highly recommend it!", "author": "Siobhan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "Just had dinner at their new location and it was just as fabulous as when I first went for dinner in 1997.  Food quality and service is excellent!", "author": "Terri K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "The food was spectacular!! The service was great. Very personable. Tiramisu and the mousse were very good. I would recommend the ravioli verdue and tortellini all'emiliana. The Lasagna was amazing, but it was a special. Must try this place. We will be back.", "author": "Samantha E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "Thrilled that this restaurant moved to my neighborhood. Had dinner there this past weekend. The place was packed. Service was good. The food was delicious. Would have given them five stars but the bread was sub-par. With so many good bread bakers in this city, it shouldn't be hard to find a better one!", "author": "s b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "I'm a big fan of Mescolanza, both at their previous location and their current location. The food is always delicious and fresh! My personal favorites are the prawns served with fresh vegetables, the lemon pasta, the pizza w/pear & prosciutto, and the osso bucco (when it's available), chocolate flan, tiramisu. The service is always personable, friendly and it has a warm homey feel. The owners are wonderful people who always make you feel at home.", "author": "Jane W."}
