{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "Jeff& I have going here for 18 yrs. Jeff on the handle has been going for over 30 yrs. We get the best service ever. The food is healthy. The owners are so sweet kind. Great service.", "author": "Karen B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-24", "description": "The restaurant I wanted to go to was closed but was still in the mood for sushi so I decided to drop by. Not busy during lunch time. Ordered a sushi combination plate with Philadelphia roll. I think the salmon nigiri from the combination was the best part. Fresh salmon that was fatty. I didn't like how the rice was coated with a little wasabi on the sushi and only found out when I noticed the rest of the sushi pieces had wasabi in it also. First time a restaurant has done that and I'm not a fan. I maybe the unpopular opinion here but I don't like anything that takes away the taste of sushi and that's wasabi. Some fruit flies were hovering near my table and a roach kept on running back to my table.", "author": "Gerard Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-20", "description": "This is a small no-frills place with maybe 8 tables and a small sushi bar. I was pleasantly surprised with the value and tastiness of a recent lunch I had here: the $9.95 lunch bento with tuna sashimi and shrimp/veg tempura. (There were various other combos at this price). The sashimi portion was on the small side but fresh and yummy. The tempura was hot and crispy and flavorful-unlike some places that serve theirs warm and flabby. I also appreciated the hot green tea that came with the meal.\n\nService was great-fast and courteous young server.", "author": "Trish W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "I'm very satisfied with this restaurant! I rarely make a visit in this area because it's quite a ways from where I live but since San Tung was closed the day after Christmas, we decided to venture in to Micado as soon as we saw the big sign outside that said Teriyaki.\n\nThe restaurant is very homey feeling, it's not overly glitzed or glam but more of your traditional mom and pop's sit down restaurant with a mellow vibe. It doesn't scream hip but it's cozy and I liked that.\n\nThey have a selection of sushi and entrees but we decided on the chicken teriyaki because it's safe, and why not? It sounded like a great deal -- around $12 for a plate of chicken teriyaki, white rice, salad, and miso. They also served us tea free of charge and kept the refills coming!\n\nWhen the chicken came out, I was pleasantly surprised to find that it came out piping hot on a sizzling platter! The chicken was so soft and moist, the teriyaki glaze was the perfect complement. The white rice was perfectly cooked, and the side salad was dressed with traditional japanese miso dressing.\n\nI really enjoyed eating here, it's cozy and the food and ambiance is great!", "author": "Connie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-16", "description": "I wanted to really try this place. We walked for late lunch...not very busy and looked okay at first glance. When we sat down and moved the specials menu little roaches crawled out. That convinced us to leave right away. Not sure about the quality of food but I wasn't really willing to risk it.", "author": "Elizabeth V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-06", "description": "I had the California roll($4.50) and New York roll($4.50). It was good and I liked eating all of it, so I guess I was happy. It doesn't take too much to make me like sushi rolls. I'll eat the ones from Safeway and Walgreen's haha. Nothing fancy here, but good Japanese food...oh and Saiwei Ramen was too crowded.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "I would visit this place even if I did not live nearby. The family who runs it are most welcoming and sweet. The sushi is delicious particularly at this price point. Also, I absolutely love the seafood udon noodle. It has saved my life after happy hour drinks many many times. Try this place! That is all.", "author": "Anh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "I didn't realize I never wrote a review for this place. My husband and I have been coming here for at least 15 years. That's how long we've been married. Our daughter was born 9 months later. I'm getting somewhere with this! When our daughter was a baby, the lady owner would carry her so that we could eat. We never forgot it! Our daughter is 14 now and we still come here. \n\nThey have the best chicken teriyaki. I don't get the sushi often, but when I have, it's good. Prices are decent. The lunch specials are great value too. \n\nThis place is run by a Korean couple. Their adult son works there sometimes too. They are friendly and know their customers. It makes us want to support them. We've recommended this place to family as well.", "author": "Lani S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Very pleased with my overall experience. My food order didn't take very long, the tea is okay. Really liked the quality of the fish and overall presentation.", "author": "Edgar C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-31", "description": "This is a GREAT spot for sushi.  Korean Family owned.  They obviously take pride in serving their customers. I had the \"he- dop\" which is a spicy salad served with rice and raw fish.  This is A favorite of mine and hard to find.  We also tried the sushi and found it to be fresh and wonderful.  Try the hand-rolled spicy tuna!  We will be back...", "author": "Stephen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-06", "description": "I used to live in Inner Sunset, where we also frequently ate at a Japanese restaurant in that neighborhood. So while I was in the Sunset area today,  I thought I'd have lunch at the same place. Driving down Irving, I passed by Micado and I thought,  hmmm, maybe I should  try this place.  It could save me time,  otherwise I'd have to drive down 18 more blocks.  So I gave it a try.  \n\nMicado is a quick fix if you are in the mood for Japanese food.  But it's not authentic.  I ordered the bento box with shrimp tempura and tonkatsu. The moment my miso soup arrived,  I knew this was not Japanese owned because they served my soup with a spoon. I knew then not to expect much.  And I was right,  because the tempura dipping sauce was too salty, as well as the tonkatsu. \n\nLike I said,  it's a quick fix if you are in the mood for Japanese food.", "author": "Jake R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "I've been going here for at least 12 years. Admittedly, I am not a sushi eater so sorry...\n\nI always get the same thing...Beef teriyaki and tempura. It never fails. For the money, the best bento box in the city. And, there's never a wait!", "author": "Alan V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-14", "description": "Rule number one: Always listen to Nobu K. If he says its jive ass its pretty much is.\n\nThis place is neither good nor bad. It is okay. The fish is okay not stellar. The rolls were unimpressive and not very flavorful.\n\nI had originally wanted to go across the street to yumyum fish but after walking in I did not get the 4.5 stars...really funky place.\n\nI think if you go here for the teriyaki, udon, tempura or donburi....I think you will be okay as those dishes look fine.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "Avocado roll are very yummy!\nMy parents and I love their avocado roll here!\nThe server, he is very nice and professional!\nWe all have a very pleasant lunch here!", "author": "Mary K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "Really amazing service. We walked in around 8 pm and got seated right away. The lady gave us free tea and kept refilling the whole time we ate. Had the salmon and chicken terriyaki dinner. The terriyaki sauce is so good definitely not watered down at all. Soup was good. And when I asked for a to go box the lady packed the food right in front of me! So nice and really fast service.", "author": "Alison S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "Very welcoming place. Got the lunch special from 11am-2:30 and was pleased. The chicken teriyaki was tender and tasty. Easy parking around.", "author": "Jose I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-26", "description": "$12 for tempura udon??!\n\nI felt ripped off ordering take out from them. So sad when I opened my container. My udon only consisted of noodles, bean cake and spinach with two thin shrimp tempura. I could have easily made it myself at home or buy the udon soup from Costco?\n\nThat's what I get for craving for udon.\n\nSo sad.", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Our favorite Japanese restaurant, especially for the awesome lunch specials! The owners are super friendly and treat me and my family like their own family. The food is always fresh and plentiful, a real jewel in our Central Sunset neighborhood!", "author": "Paul B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-14", "description": "Had dinner here last week. Maybe there was a reason the restaurant was pretty empty. The service was ok, but not so much on the food. My sushi was made ok (including the wasabi between the fish and the rice), but the pieces seemed hard, like they were made a while ago and refrigerated.", "author": "June W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-29", "description": "\"Why not give this place a shot\", I thought as I walked by and saw the empty tables inside. As my party and I were seated, we looked over the menu. It had the usual bento boxes and rolls that you can find at any other Japanese restaurant. When trying to order the sukiyaki, we were told they were out, which would be fine, except that it seemed to have changed the mood of our server the rest of the meal. The service consisted of two visits to refill our tea and our check with an annoyed attitude, while she spent the rest of the meal sitting at the bar chatting with what seems to be other workers, paying no mind to our table. \n\nAs for the food, a few comments. The tempura udon ($12) looks like a $3 meal, the caterpillar roll tasted like they used old avocado, and maybe this is a preference thing, but the chicken in the chicken teriyaki felt over boiled rather than grilled like other restaurants (the outer part was pretty mushy). Their portions were decent, enough to fill us up. But the quality and service at this restaurant was far from making it worth ~$20/person.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "My review is long overdue.  This restaurant is the best hole in the wall sushi place in the bay.  I used to live in the city, but now reside in Marin.  My bf and I make it a point to stop by Micado if we're ever in the area.  I rarely eat raw fish.  If I do, it needs to be the freshest fish in town as well as sushi grade.  They always have a great selection of sashimi.  The Ama Ebi and Hamachi Kama are my favorites and they have the best shrimp tempura in the bay! This restaurant has quality food at a very reasonable price.  Sushi man and his wife are always so welcoming, accommodating and funny! My mouth is watering as I'm writing this review.  Hmmm...we may just drive out to the city for dinner tonight", "author": "V R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "49er roll is awesome! They put a little slice of lemon on it and it adds a unique gastronomic twist - a sour kick to the fatty, flavorful salmon", "author": "Morgan G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-23", "description": "Just aimlessly driving around looking for a spontaneous lunch spot after a workout...\n\nThere's soooo many places to eat on Irving Street, but decided to go here for lunch. \n\nI have always drove by this place but never tried it out... \n\nOrdered the chicken teriyaki plate with rice and it was definitely A-OK.\n\nGrill marks and everything but honestly felt like it was microwaved.\n\nI've definitely had better, ugh!", "author": "Sam K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-19", "description": "Got a Tempura Udon for $9.95 for lunch, which came with 2 shrimp tempura on the side.  The Udon was a bit chewy and tasted fine.  The shrimp tempura tasted pretty fresh and crispy.  For the amount of food that you get, it wasn't really worth it since it wasn't really that filling.  If you decide to eat here, then I suggest you order a lot more than just an order of udon.  The lunch box special for $8.95 with a choice of 2 items would probably be a better bet.  I wouldn't order udon from here again and probably would try out the lunch box special instead.", "author": "Gilda W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "Having tempura udan this time, not too bad I have to say. \nWill explore more some other day.", "author": "Kevin G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-09", "description": "Since Yum Yum across the street closed down I decided to try this place since they had a lunch special advertised. Two items for about $9. The food itself was salty, and the restaurant was empty. The owner/waitress was very rude. She never refilled my tea, didn't even say goodbye or welcome and I had to bring my credit card to her when I asked for the check since she didn't want to walk over to my table. With so many restaurants nearby I don't know how this one survived. Poor service and poor food, I won't be returning.", "author": "Jackie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "I have been going to Micado for 16 years and have never had a bad experience.  The owner and staff treat their customers like family and provide a warm and friendly atmosphere for lunch and dinner.\n\nIf you're going to a Japanese restaurant and complaining about having mediocre rolls and chicken teriyaki, news flash - you don't like sushi or Japanese food.  This is akin to complaining about Panda Express not having authentic Chinese food or Taco Bell not being a real Mexican restaurant.\n\nMicado provides consistent, fresh nigiri and sashimi with a full compliment of Japanese appetizers and entrees.  The sushi rice is better here than any place in the Peninsula and most places I've tried in the City.  Texture, flavor, and temperature are on point, and the amount of pressure applied when assembling each piece of nigiri is excellent.  The balance of the wasabi and size of the slices of fish used for each piece shows the depth of sushi-making knowledge and consideration for the customer that the owner has.\n\nRecommended starters are the fried soft-shelled crab and agedashi tofu.  These two are staples at most Japanese restaurants, but Micado does them better than most.  Lightly battered, meaty crab fried to crispy perfection provides a balance of sweet crab meat and savory innards, crunchy outside and firm, juicy inside.  The tofu is also lightly battered, served with house-made dipping sauce and bonito shavings, it is an awesome way to start a meal.\n\nThe sushi sashimi combination is my go-to meal, providing 5-6 slices of tuna sashimi, 6 pieces of California roll, and 10 pieces of nigiri.  This is the only place I enjoy eating a CA roll, because they use shredded crab meat instead of creamy imitation crab salad.\n\nIf you're feeling more American and want an entree instead of sushi, I would suggest the salmon teriyaki.  Served sizzling on a cast iron plate, it is skin-on, which protects the meat from burning while providing a delightfully crisp and fatty salmon skin treat.  Rice, salad, and miso soup are included, of course.\n\nThis place has been in business for as long as I've been alive, and I've been frequenting it for half that time, so far.  Even when I lived in San Jose for a decade, I would still come back home to eat here every other month or so, because the places I found in the South Bay just didn't offer the same quality of food or level of dining comfort.\n\nWell worth the trip out to Irving on any night of the week!", "author": "Eric L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-06", "description": "never go here the lady is evil and she made us pay more she also tried to ignore us many times when we tried to order, all of us even waved at her crazily and she still avoided to make eye contact with us we saw our food at the sushi bar ready but she waited like 10 min later to give it to us never go here i repeat never go here i would give zero stars if i could", "author": "Alisha C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-06", "description": "Empty restaurant. The bamboo design on the windows make more like a fence (so you can't see anything from the outside) and the closed door make this restaurant a little uninviting. Their banner outside with their popular lunch plates is what caught our attention - \"chicken terriyaki.\" Yeah, that sounds good for dinner. The bf and I took a look at the menu which was posted on their window on the outside before entering. The sushi chef was sitting down watching the wheel of fortune. A lady greeted us and handed us menus. We initially thought we in a hurry so we ordered everything to-go. As we sat down to wait for our food, the waitress came back with two cups of hot genmai tea - I thought it was such a thoughtful gesture since we had ordered to go! But the tea was good. So perfect. We watched some wheel of fortune as we waited for our order. \n\nFOOD\n-Katsu Donburi. Fried pork cutlet in scrambled eggs over rice. Hot and fresh off the stove served with salad and miso soup! Pretty standard, nothing to dislike. The eggs were a little sweet, I think that's normal though.The portion and price was fair ~$10. I took back leftovers. \n-Chicken Butteryaki. Tender chicken flavored with butter and lemon. Yummy. The bf ordered this but I think I should have instead. Also came with salad and miso soup. ~12.\n\nSETTING\n-Lots of tables, pretty spacious for Sunset.\n-Empty for a Thursday night, so in otherwords, definitely not crowded. \n-They have a sushi bar! Didn't try the sushi though.\n-One TV over the sushi bar. Something tells me that gameshows are usually on :)\n\nService was great and our food came out pretty quickly. I guess it helped that no one else came in while we were there. The waitress refilled our tea when we decided to stay and eat. It's your average Japanese restaurant (but is Korean owned). Nothing spectacular, but a decent and humble restaurant. If I were them I'd make the place seem a little more inviting so more passerbys would stop by.", "author": "Grace J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-12", "description": "This place was really empty and quiet. The sushi chef looked miserable and looked like he didnt wanna be there. \n\nThe sushi was so expensive. They put so much rice in the rolls. The radius of rice in the rolls was thicker than the little amount of fish in the rolls itself. No exaggeration.  \n\nThe green tea was so clear and diluted of water. The bowls of miso soup was filled up less than halfway. \n\nService wasnt friendly. Im used to cordious japanese people.", "author": "Cuc N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-06", "description": "I love this place for what it is. Best sushi you'll ever have? No of course not. They do however make pretty damn good rolls and there lunch bento has been a staple of mine for years.", "author": "Nick O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-09", "description": "this is a no no. food was ok but service was terrible there was hair in one of my friends food and we think its the lady because all of our hair was too long and too short. by the way, the food took so long we took an hour here and this place is expensive but we literally paid 70 dollars when the check was 40 are you crazy", "author": "Ivan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-16", "description": "Most of the time, I try to consult Yelp before trying a new place. I just hate going in blind. I wish I had done so before coming here.. \n\nMicado is not cheap, nor is it super pricey. However, for the quality, portion size, and overall experience I felt like my money was put to waste.\n\nI came with a friend. We both ordered the chirashi sushi, and gyoza + dragon roll to share. The gyoza came out first, and was actually not bad. Its hard to mess that up though. Then came the dragon roll.... I wish I had read the roll description before ordering, but wouldnt you expect a dragon roll to be, well, a dragon roll?! Their version only has shrimp tempura, wrapped with seaweed and rice, and topped with salmon and avocado. There is no crab, no unagi, no sauce, etc. I was shocked!!! The avocado on it was still yellow,  and it was $10.95 for such an unsatisfying 6 pieces.\n\nNext came the chirashi.... it was one of the smallest I have ever had, and was around $15.95 if I remember correctly. Some of the fish was decent, but some of it was also obviously NOT fresh.\n\nThe prices are not terrible, but for what you get it feels like a rip off. I will not be back, and would not recommend anyone to come here.", "author": "Munnie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-31", "description": "Extremely authentic spot with great food. Preparation is wonderfully done. The sushi is tasty. I have this spot bookmarked !", "author": "Bruce B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "My favorite place to eat Japanese food. People here are so nice and welcoming. Love their bento  box and soft shell", "author": "Den F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-13", "description": "3 Rs.\nRip off\nRude waitress\nRoaches ( Sounds Chinese doesn't it? Btw, yes!)\n.......\nDo you want to come here for sushi?\nListen to this.\n\nThey tried to make me go to the micado but I said, 'No, no, no.'\nYes, I've been black but when I come back you'll know, know, know\nI ain't got the time and if my daddy thinks I should not\nHe's tried to make me go to the micado but I won't go, go, go\n\nI'd rather be at home with mary\nI ain't got seventy dollars\n'Cause there's nothing\nThere's nothing I can eat there\nThat I can't eat from Mr Micado\n\nI didn't get a lot in class\nBut I know it don't come in a shot glass\n\nThey tried to make me go to the micado but I said, 'No, no, no.'\nYes, I've been black but when I come back you'll know, know, know\nI ain't got the time and if my daddy thinks I should not\nHe's tried to make me go to the micado but I won't go, go, go\n\nThe rude waitress said, 'Why do you think you're here?'\nI said, 'I got no idea\nI'm gonna, I'm gonna lose my money\nSo I always keep a bottle near.'\nShe said, 'I just think you're depressed,\nKiss me, yeah baby, and go rest.'\n\nThey tried to make me go to the micado but I said, 'No, no, no.'\nYes, I've been black but when I come back you'll know, know, know\n\nI don't ever wanna eat sushi again\nI just, ooh, I just need a friend\nI'm not gonna spend ten dollars \nHave everyone think I'm on the mend\n\nIt's not just my pride\nIt's just 'til these tears have dried\n\nThey tried to make me go to the micado but I said, 'No, no, no.'\nYes, I've been black but when I come back you'll know, know, know\nI ain't got the time and if my daddy thinks I should not\nHe's tried to make me go to the micado but I won't go, go, go\n\n......\n3 Rs.\nRip off\nRude waitress\nRoaches\nMuthafycka!\nDo you still want to go?", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-17", "description": "Came in because a friend was hungry and didn't order anything. The waitress then said \"3 people and 1 California roll??\" after putting tea we didn't order on the table. After we said we weren't eating she said she's going to charge us for the tea (remember we didn't order it?) and walked away.\nI think it's safe to say we won't be coming back.", "author": "Becca B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "The owner lady is not super welcoming in the beginning but she warms. I had the chicken donburi. Taste and portion were both good to me. Price reasonable. I will come back if I happen to be in the neighborhood!", "author": "Connie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-12", "description": "I never got to sit down and have an actual meal here just yet.  I actually only came here to get takeout because I was in a rush that day.  I ordered that lunch bento box to go where you can pick two items and also comes with rice and salad.  I ordered the terikyaki chicken and tuna sashimi.  The lunch special is $8.95, which isn't a bad deal.  I love the flavor of the chicken teriyaki and it also came 3 pieces of sashimi.  For takeout, it wasn't bad.  Food seemed good and everyone seemed friendly.  Would probably came back again for takeout when I'm in a rush especially because its a good deal with good food.  What's even sweeter is that I'm waiting for takeout and they even gave me a cup of time while I wait!", "author": "Teresa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "Great service! Good ambiance and love the sushi bar! Definitely, will bring friends along.", "author": "Calvin Nicholei L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-26", "description": "Roach found in my found today and food tasted old. The people are really nice but I don't think I will be eating here again. Finding a critter in your food is not fun.", "author": "Oni M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-23", "description": "I walked in expecting good food, walked out wanting to puke.  \n\nToday my friend and I walked into the restaurant excited to eat japanese food; we ordered two lunch box specials of teriyaki chicken and tempura and 2 sushi rolls.\n\nTeriyaki Chicken - Soggy and underseasoned.\n\nRainbow Roll - My friend ordered this, she ate one piece and didn't eat no more, the fish tasted off and she described it as disgusting. (Tried one, the california roll was as dry as sand, it was just little strips of imitation crab with no type of binder.)\n\n49ers Roll - Was average though they did go overboard on the lemon (they hid a few slices under the salmon which overpowered the entire roll.)\n\nThe worst part was the shrimp tempura, after eating all the vegetables I was about to eat the shrimp when I noticed a weird roundish brown shape fried along with it. I picked it off and it looked like a mouse dropping, my friend inspected it too (she works in the cooking industry) and she confirmed it was a mouse dropping. We lost our appetite and approached our waitress with it. The waitress seemed surprise and argued that it was a fly (it doesnt make the situation any better?) and was overly defensive about it; my friend and I kept insisting it was a dropping and the waitress walked away and gave us the check. Thankfully she took the lunchbox off. Won't be coming back here honestly.", "author": "Jasmine L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-22", "description": "Sadly I must give them one star...we went here on the recommendation from a friend after a long cold day in S.F. We were NOT offered any tea...most unwelcoming place! The neighborhood is a dismal mess. I've had excellent food in grimy neighborhoods so I was trying to stay positive. Two of us tried udon...my friend had seafood, I tried tempura udon bowl. Two of us tried Teriyaki chicken. The udon consisted of noodles in broth with chive floating..it tasted BURNED...there were no fish cakes as promised on menu..two long tempura shrimp that looked cold and greasy..I didn't eat them- my friend had the teriyaki roll that was very small but pretty. The interior was dingy and the bathroom in need of repair with a graffitied two by four running across the wall behind the toilet tank! I just wanted to pay my bill and get out of there..my bill was 86.00!!! Crazy! We don't eat out often and I was very disappointed.\nWe left and we all had tummy aches..such a bummer. They were nice enough people inside working..no other diners..my friend said that is never a good sign when a place sits empty? I left with that burned noodle taste in my mouth..ugh", "author": "Maddy W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-14", "description": "Went there for lunch and we were their first customers.  Ordered two Chirashi sushi bowls. The fish selection was fine: tuna, salmon, octopus, yellowtail. The hamachi was not firm, but mushy. It gets worse, the sushi rice under the fish was cold and it was obviously from the night before. Rice is cheap and they can't cook fresh sushi rice? It was such a huge disappointment.  I'm never going there again.", "author": "Lena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-22", "description": "Awesome lunch special.  Chicken teriyaki and sashimi for only $8.95.. Can't beat that!  Fun little sushi place!", "author": "T G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-03", "description": "They have a pretty good selection of specialty rolls and offer a lot of Asian cuisine options. I thought their seaweed salad was a little too sour. Perhaps too much vinegar or something, but it just did not taste right.\n\nThe service is good and it's a nice place to have a casual sushi lunch.", "author": "Sam D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-02", "description": "I have a great relationship with the owner and his wife. The owner is the man working behind the sushi counter. He gives the best suggestions and has the best personality which is why I love this place. It is more expensive than some Japanese restaurants but it is definitely worth what you are getting. My favorite kind of fish is salmon (sake) and they have the best tasting salmon sashimi.", "author": "Kristen W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-20", "description": "Decent Japanese place offering all the standard menu items you would expect - sushi, donburi, udon, tempura. Restaurant is never too packed, but I have seen regulars sit at the bar and chat up the chef. It's a quiet place, which can be an advantage if that's what you're looking for.", "author": "Sherry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Love love love this place! My boyfriend and I come here frequently. Friendly service and great food. Love the sushi and they have some pretty good entees too.", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-25", "description": "Lady who works here (possibly the owner) is super rude. I was not greeted or even acknowledged when I walked in, she was busy signing checks. I asked for a menu and she simply pointed at the wall and said lunch menu over there. Just because I came in during lunch time doesn't mean that I only want to order from the lunch menu!!\n\nUpon leaving, I asked for a to go menu. Again she said there's no lunch or to go menu. WTF? Again, just because I walked in during lunch time doesn't mean I don't have dinner. Does that mean that they're limited to only \"lunch menu\" items during lunch time?\n\nFood was mediocre. I ordered the chicken terriyaki and cali rolls but received the tempura and cali rolls. I didn't bother going back to exchange. \n\nProbably won't be back again. Yum Yum Fish has better sushi and they're always super nice.", "author": "Tiffany U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-08", "description": "I sat at the bar and ordered everything from the sushi chef, who was super chill. I rarely saw the waitress--she just came to pour beer and drop off the check. She also seemed to have rushed me to leave even though closing wasn't for another 30 minutes.\n\nI didn't order anything from the kitchen except for the Soft Shell Crab, which was pretty tasty. As for the rest:\n\nMiso soup: NO. So bland. Stay away.\n\nSaba nigiri: perfect flavor; not too vinegar-y, which I prefer.\n\nUni nigiri: this uni was FRESH. Had to have another order.\n\nIkura nigiri: just alright. I've had more flavorful ikura elsewhere.\n\nTamago nigiri: sweet and light.\n\nLobster temaki: the sushi chef recommended this and it was really delectable! Great way to end the meal.\n\nOverall, the sushi was really fresh. I've yet to try any of their cooked food though.", "author": "James M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-26", "description": "I've been riding on a good memory I had with my Grandma coming here when I was 8-9. The food tasted good and I had a good time, but it's faded fast since that memory and has been a dissapointment ever since in sme regard or another.  Something kept me coming back (once in a great while) but today was pretty much the last straw.\n\nThe problems this place had, other than just today, is the rude waitress who is unaccomodating, leaves you at the door forever before seating or serving you, and looks at you suspiciously when you come in--- as if you didn't come to eat lunch, but instead came to rob her--- or WORSE, order something to-go and not pick it up.  When you order to-go, they make you pay right away--- no trust here.\n\nThe food has had it's moments--- I like their teriyaki sauce, but in the end you are paying too much for the kind of meal your getting.   Their menu is simple and has nothing out of the ordinary.... but their sushi bar is pretty decent and the fish there is good and the sushi chef usually a nice guy who seems authentic.\n\nToday, though, I ordered Salmon Teriyaki to-go. Of ocurse I had to pay right away even though they've seen me there numerous times.    When I got it, they didn't give me my miso soup I noticed so I asked and they gave it.  When I got home, I was angry to see it didn't come with my pickled vegetables either.   I feel like they just don't care to put the effort intot heir customers---- If it comes with soup & pickled vegetables, wtf is wrong with you?? Why is half my meal missing?\n\nWorse--- my $18 salmon teriyaki meal was HALF COOKED.  This really ticked me off--- I was waiting all day for a good meal and I had a half raw salmon teriyaki meal that was overpriced, and was even robbed of some of hte items my meal was supposed to come with.\n\nI could oversea today if it was a one time thing, but like i said--- it was just the straw that broke the camels back. I will not be returning here.", "author": "James M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "I went on a day that the Outside Lands were going on so there was lots of people, and surprisingly enough the food itself was pretty good. Since it was a random place I tried I wanted a little variety, so I ordered a Bento Box. When it all came out I was shocked and it tasted pretty good to! I would like to go back sometime and try the Sushi itself, it looked pretty good. ( I like to look at other peoples food when it comes out lol). Enjoy!", "author": "Scott B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-10", "description": "Ugh.\n\nCame here for lunch one day with 8 friends. The waitress seemed friendly at first, when she seated us. Then she pointed out the lunch special and left. Only a few minutes later, she came back, expecting us to have our orders ready. Annoyed, she asked if we wanted to see menus. Wasn't she supposed to give us menus and THEN take our order? The place wasn't even half full and she gave us five menus for our party of nine. We ended up ordering our own boxes from the special, with one \"Pizza roll\" from the menu. It didn't take too long for her to give us the miso soup, and a couple of the boxes. However, she got three of our orders wrong and acted like WE got them wrong. She finally came back with the paper she wrote everything on, so she could check with us and clear up what she messed up on.\n\nThe pizza roll wasn't great. The \"special sauce\" on top of the sushi tasted too strongly of mayonnaise and mustard. The food in our boxes wasn't mouth-watering or delicious, but it wasn't inedible. The California rolls seemed cheaply made (think close to supermarket-quality), but the tempura was tasty.\n\nThe food was fine. Not exceptional. The service was mediocre. Never coming back here again.", "author": "Lissa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "My husband, children and I have been coming to this restaurant for over 20 years. My son loves coming here. The sashimi is always FRESH and sushi grade along with everything else we order. Sushi man and his wife are very sweet and accommodating. This is one of the best sushi restaurants on this side of town!", "author": "E. R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-03", "description": "Low quality sashimi and sushi for double the price. The prices are above average than usual restaurants. Speciality rolls and sashimi are awful. Not fresh at all and had a weird taste.", "author": "Erica B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Amazing chicken teriyaki!  For the dinner entree, it's even on a sizzling plate. Hamachi negi roll was nice and fresh. And tempura perfectly fried", "author": "Jean L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-24", "description": "I come here sometimes to get a teriyaki plate. The food is pretty good. Hit and miss sometimes but overall good. I like their tea they give while waiting for my food it's really good. I want to try their sushi it gets decent ratings do I might try it soon and update my review.", "author": "Krishna V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "I always get the beef teriyaki and the girlfriend gets the chicken as they both have a yummy yet slightly different teriyaki sauce on each.", "author": "David G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-16", "description": "ROACHES!!!\n\nDONT GO THEY HAVE ROACHES!!!\n\nI use to think this place was okay for Irving. But last and final time I went there I was sitting at the sushi bar and a ton of roaches started coming out from the cracks in the bar. I was busy watching the TV so when I looked down I noticed a few more on the sushi plate. The people acted like it was no big deal and just said oh sorry and went about their business. I was in so much shock and disgusted at the thought of my food.\n I will never eat there again. Anyone who does attempt to eat there be careful. The food health inspectors definitely NEED to check this place out!!\n\n\nTHEY HAVE ROACHES!!!!", "author": "Krystal D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-21", "description": "I love this place, and just like Lily, my boyfriend and I are frequents here, as well!\n\nI recommend sitting at the bar. We've always sat at the tables, but sitting at the bar gives you a chance to chat with the chef a bit and it's a bit more cheery than the dining table area. We had an all Nigiri night:\n\nWhite Tail\nUnagi\nSalmon\nRainbow roll\n\n...GET THE WHITE TAIL w/ GARLIC! This was a little suggestion not on the menu from who we think is one of the owners/sushi chefs. The combo is delicious, but make sure it's a small, small slice of garlic so it doesn't over power the fish. \n\nWe washed everything down with Sapporo :)\n\nIn general, it's a cute restaurant, very clean, fish is fresh, owners are sweet, and it's quiet so if you're looking for something intimate or private, this'll do it.", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-02", "description": "The food was yummy and the customer service was great. The server and the sushi man was friendly. My family and I would be back again.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-08", "description": "I've been here a few times over the years. I think I actually first ate here 15 years ago, and the place hasn't changed a thing about its decor since (and it looked faded and tired then). I'd be surprised if you walk by and see more than one table occupied. \n\nEach time I've been here I've had lackluster service. This last time, they made something completely different than what I ordered, forgot to bring the entire table soup (not to mention pickles), and tried to talk us out of ordering what we wanted. Still kind of stumped that this place is still in business. Barely passable Japanese food.", "author": "Casey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "Their combination platters are very good. A little pricy if you order outside of their happy hours (which I believe are 11:30-2:30.) Their incredibly fast though. There's usually very few people in there so even if you don't get take out, you'll be served very quickly.", "author": "Chuck D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-03", "description": "Seriously mediocre Japanese food.  The fish didn't taste fresh, the chicken teriyaki was just not good, and the service was slow and unfriendly.  I went with a Korean friend who ordered in Korean, and that still didn't improve the service.  \n\nThere's a lot of good sushi out there, just not much in this particular neighborhood.  This is my theory as to why this restaurant stays in business.  But despite the lack of choices in Sunset Parkside, I won't go back here - instead I hop on down to the Inner Sunset, where I can pick from at least five sushi restaurants that all serve much better fare.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "Very fresh and yummy hand rolls.\nVery polite and straight forward service.\nAte same sushi as we would in many other places\nAll for $100 And far better quality.\nI will return soon. Clean restroom. Clean atmosphere. Positive space. Positive host and servers.\n\nWhole in the wall to your right passing Judah line from 19th street direction.", "author": "Queen Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-19", "description": "Very rude service, I felt unwelcome and soon left the restaurant shortly after arriving.", "author": "Peyton S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-14", "description": "The food is incredibly overpriced with minimal variety. For example I got the chicken butteryaki, It looks like half a chicken breast with two lemons cut on top of it priced at $13. I also got the deluxe sushi combination plate it comes with just a single piece of each type of Nigiri and six pieces of bland California roll priced at $21. After-tax the entire meal was $40 and I felt like I had eaten half of a lunch. Bottom line it's overpriced for the quality of the food!", "author": "Magdalena G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "Amazing service! Just witnessed the waitress run out to the road to grab a customers credit card, then bring food and the bill out to them. She was the only one waiting tables at the time. Awesome!", "author": "Corey P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-01", "description": "I'm embarrassed.  Micado has been in my hood for a REALLY long time, and it's only now that I discovered this place!  Argh! \n\nThere are many neighborhood Japanese restaurants that are closed on Mondays, so I was pleased to find this one open.  It was a bit slow, but we weren't deterred.\n\nFor $13.95, I chose the combo special of tempura and sashimi.  It also came with miso soup, side salad, pickled cucumber, and rice.  I was actually quite impressed with the amount of tempura I got.  The batter was light and I had no complaints about that.  I got four pieces of sashimi - two each of maguro and hamachi.  (There was a tiny bone in my fish though.)\n\nMy dining companion ordered the Salmon Teriyaki Dinner ($12.95).  Upon the arrival of the fish, my friend exclaimed \"It's so big!\"  And she was right.  I have never seen such a large helping of fish and it was good!  The fish was moist and not overcooked a bit!  My other companion had the Saba Shioyaki Dinner ($9.95) and her fish was also good and tasty.  For rolls, we shared the No Problem roll ($8.50) and the Spider Roll.  We were all pleased with all of our choices.\n\nFor dessert, they only offered green tea ice cream.  Two of us each ordered a scoop and the waitress threw in an extra scoop for my friend who had initially declined.  We found this very sweet of her to do that!  \n\nService was good.  Because we are all heavy tea drinkers, we asked if she could leave the teapot at our table instead.  The waitress was fine doing that, but did come along and change the water when she realized the tea was no longer hot.  \n\nTotal bill: $60 for three, tip and tax included.\n\nI would definitely go back when I want a comforting Japanese dinner without all the frills.  I can't vouch for the actual raw sushi part since we had two sushi rolls that had cooked items in it.\n\nSidenote:  They also offer $6.95 combo lunches with choice of two items.  They have a small sushi bar and offer other Japanese meals like udon and donburi.", "author": "Teri C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-24", "description": "The service was good. The server came around to fill our tea and check in with us often enough and seemed sweet. Now to the important stuff!  The food is okay, nothing special. There is too much rice in the sushi and the fish is not fresh.", "author": "Adriana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-01", "description": "I wasn't sure how this restaurant would be when I walked in, but was pleasantly surprised.  It was a slow Sunday afternoon and wanted a relaxing linner.\n\nMy wife and I were pleased with the food, service, and value.  Next time I'm in the Sunst, we're getting some sushi at Micado!", "author": "Don G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-21", "description": "Even almost 24 hours later, I'm still debating if Yum Yum fish is a better place for dinner, or Micado. As far as taste, Yum Yum fish blows Micado out of the water, for if I wanted a more quiet, sit down place to catch up with a friend, I'd pick Micado. \n\nAnd Micado it was! My friend and I came here and it luckily wasn't too crowded for a 7:30pm dinner, and in fact, it was near empty. I arrived first and was seated by the female waitress. She promptly brought tea and two menus for me to look over. The price was a bit far fetch for me, like $15.95 for a two item bento box. I eventually decided on the chirashi bowl while my friend ordered Spicy Tuna roll, gyoza, and shirmp udon for himself. We also settled with a filtered bottle of sake. The wait wasn't too long. My chirashi was full of tasty looking sashimi. It included Salmon, Tuna, Amaebi, Butter Fish? and another two toned fish I forgot the name to. My fish were decent though not as fresh as I would have liked. My butterfish was even different than I expected, and not in my favor. The Spicy tuna roll comes in chunks of tuna rather than minced up pieces. The gyoza was mediocre. The service was attentive. \n\nThe food wasn't terrible as everyone else says, but its also sadly not one of the best, and to be located in the heart of Irving, Micado needs to offer more if its going to compete.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-20", "description": "You know how when you order edamame, they give you an empty bowl so you have someplace to toss the shells? And do you sometimes, in the midst of conversation, almost reach towards the wrong bowl, only to withdraw your hand in disgust at almost having picked up someone else's used edamame? Well, this actually happened at this restaurant to someone in our group. \n\nVictim's husband: \"Why aren't these cooked?\"\nUs: \"What do you mean? They're boiled.\" (They were warm)\nVictim: \"They're cold.\" And I see her holding an empty one in her hand.\nVictim: \"There's nothing in it.\"\nUs: \"Uh....\"\nV: \"OMG.\" Proceeds to hide her head in mortification at the realization of having eaten a used edamame. \n\nMeanwhile, the rest of us don't know whether to throw up a little bit, fall over in our chairs, or feel bad for the out-of-towner who's never before eaten edamame and probably never will again. Poor thing. \n\nThe Korean-owned sushi was pretty good. Had a variety of rolls and all were good. The tuna salad had dressing with a little kick and the fish was fresh. The place was not exceptionally big, but could handle large parties. The waitress took a while to bring us tea and such, and her reasoning was, \"I was too busy, but now I have time to bring you tea.\" Well, I don't think four tables, one of them being a large party constitutes being busy. I think place ranks about the same as Nagano on Geary.", "author": "Ming-Jou C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-10", "description": "Could be better. Me and a few friends came here the other day for lunch, hoping for something good to eat out of the blue. The place was basically empty so we got seated right away, about 9 of us. We all ordered the lunch boxes; I ordered the teriyaki and tempura. Our waitress came off as a bit strict and brought only about 6 of our orders correctly. So we had to wait for everyone else to get their food which took maybe 5-10 minutes. The food was relatively basic when it comes to teriyaki and tempura, not inedible while at the same time not mind blowing. But I do have a taste for Japanese food so that may be a bit biased of me. The cost overall wasn't too pricey considering there were 9 of us. Overall I'll probably skip this restaurant if I can.", "author": "Jeffrey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-02", "description": "Fresh sushi. Friendly service. Decent size portions. Couldn't ask for more. I never saw the bottom of my tea cup. The lady was so nice. She came to pour our tea every 10mins or so.", "author": "Serena F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-22", "description": "The fish is not fresh. the menu is weird and doesn't include an ounce of creativity and on top of that it was not cheap or delicious at all . Yuck. I'm never returning, and I hope i can find a good sushi place in my neibhorhood ;( \nIn contrast, we ate at cha ya the vegan sushi place in the mission tonight spending about the same amount of money and were full and absolutely astounded by yummyness.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-15", "description": "By far the worst sushi I've ever had in my LIFE. No joke. The fish was not fresh.and dry like sand paper, ordered the 18 pc sashimi combo and every piece of sushi were oon nigiri, on top of that part of the 18 pieces were 8 pieces of California roll. Since when did sashimi come on top of rice and in California roll form?! The agadeshi tofu was hard and the crispy part was doughy. Service was whack considering there was only 2 of us in the restaurant. Will not come again everr!", "author": "Marigold V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-06", "description": "I like it here. GREAT lunch special deals.. $6.95 for your choice of 2 items. Choose between: \nTempura \nChicken Teriyaki \nCalifornia Roll \nFish Katsu \nPork Katsu \nSashimi \nThe lunch special also comes with miso soup, a little dish of cucumbers, rice and salad! There is no other place on Irving that can provide such a great price. The food is also good. Its not OMFG good, but its satisfying. I haven't ordered the sushi here but my employer tells me its the freshest on Irving Street. (He orders the caterpillar roll) \n\nI have never been here for dinner, but I don't expect it to be different except for the cost. TBH I'd rather go elsewhere for dinner.. the decor is just suitable for lunch for me. (odd?)", "author": "Alice E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-08", "description": "Best spicy tuna I have ever had, no question. The tuna was big chunks, not mashed like some places do. More of a poke wrapped in rice. Also a very good wakame salad. Great service, our waitress was serious about keeping our tea filled.\n\nI'm definitely coming back.", "author": "Redd C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-30", "description": "Since I live far away, I usually show up late, hungry and sun-soaked. \nThe owners always recognize us, I travel with a distinguished character. \nFood and service, excellent. Quiet and clean. \nNo Problem roll, yumm. Sit at the bar and talk about what's good with sushi master. Take our time, add to order, No Problem. \nWe will be back.", "author": "Kate A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-22", "description": "My non-sushi loving boyfriend introduced me to this place after he went and had the teriyaki chicken plate.  Everytime I go (and I mean EVERTIME) I get the roll with the tempura shrimp on the inside, and sliced salmon and avocado on the outside.  Maybe it's called a caterpillar roll?  Anyway, it is soooo good! I can't bring myself to order anything else because it is delicious.  Miso soup is complimentary, it's good.  Not hard to mess up miso soup.  The BF has tried several of the non sushi dishes, like the teriyaki chicken, the pork cutlet, and a bowl with rice and egg (cannot remember the name).  He has been satisfied by all.  \n\nThey have a lunch box special that I've tried once and it was plenty of food for me.  My lunch box consisted of a salad, tempura veggies, cali roll and teriyaki chicken.  It was very good and super cheap!  \n\nThe waitress who works there is always so nice and remembers us, even though we only come in once or twice a month.  She continuously refills our tea cups without being asked.  The place is very nice on the inside, despite looking a bit shabby on the inside.  Very easy to find a table to sit at.", "author": "Lesliegh H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-21", "description": "Ok, I am officially done with this place. I would always return here once every month. I even tried their sashimi out which was ok. \n\nBut today's visit was just a bad experience altogether. When we entered, the lady seemed disappointed to see us(customers), when the place was already as quiet and empty as a cemetary. The chicken teriyaki was so tasteless I had to pour soy sauce with wasabi on it just to have a little flavor. While my gf tried to drench her teriyaki sauce and rice with her tempura dipping sauce. \n\nI don't know what has happened to this place I enjoyed before. I'm not sure if maybe I was starving the past times I visited which led me to be blinded. Or if they are just going down the tubes.", "author": "Tip S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-17", "description": "I ordered chirashi from the menu and it saids $10.95. When I picked up the order the lady said $15.95. When I asked her why is it different from the price on the menu. She said the menu is old so the price is different. I just picked up the menu last week I wouldn't mind paying for the difference if the quality is better. I should just stick with Yum Yum fish. $12.95 for chirashi with more varieties of fish and I like how they add flavors to the rice", "author": "Christina K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-17", "description": "Went there on Friday night at 7, hardly anybody there. I had sashimi and tempura combination and it was fine. My friend had seafood nabe dish, over $16, there were a few shrimps and squid there, but no fish, no other seafood. It looked nothing but vegetable soup, probably worth half the price.", "author": "Yoko S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-10", "description": "BEST SPICY TUNA EVER!!!!!\n\nI never really get anything else!!!  I always get spicy tuna and ask for spicy salmon!!!  HELLA BOMB....and actually spicy!!!!  Everytime i get spicy tuna from other places its never spicy!!!...this place is seriously the best!!!!", "author": "K L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "My boyfriend and I frequent this place lunch often since it's so close and convienient.  They also have a bento box lunch special for under $8 dollars, and they give a good amount of food. We usually go around noon and it's not too busy, we get seated right away. They start you off with green tea, pickeled cucumbers and miso soup. I really enjoy their miso soup, it's perfect, and not too salty. Their lunch special allows you to choose 2 items out of 6 for the bento box, i usually get the tempura and chicken teriyaki.  Simple and satisfying! delicious! i'll be back again when i want to get a japanese fix!", "author": "Lily S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-22", "description": "My review maybe a bit harsher than necessary, considering I went in as a take-out customer, at 9pm on a monday night. \n\n  I was greeted at the door by the pleasant hostess, who was quick with the menus and took our order quickly.  We ended up ordering a basic combo meal (sushimi, chicken teriyaki, miso soup, salad and steamed rice) which took awhile to cook, about a 20 min wait (but who wants uncooked chicken, so I was fine with it, just hungry!).  The sushimi was quite tasty, as was the salad (crisp with delish dressing).  \n\n   I wasn't however impressed with the sparing Miso soup (mostly just broth, not too much goodies in it...) and the chicken wasn't as tender and juicy as I would have expected, even for take-out.  I would try this place again, especially as a sit-down client, before I stay otherwise underwhelmed.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-18", "description": "Been here a few times, I like watching the sushi being made ^^ he works very quickly.\nI usually order the tonkatsu and spicy tuna rolls, the tuna is spicy \\o/ that's what I love the most about it.\nI only order out so I don't know if they make the Tonkatsu like this for in-orders but for me they mix the tonkatsu pieces with egg and put it on top or rice, and two sides of salad with awesome dressing, also comes with miso soup. I like that that soup is in a coffee cup, I can drink it while walking home.", "author": "Olivia O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-25", "description": "Seems like to everyone else Micado is mediocre....and they are correct..\n\nthe price of the food and the quality just didn't match..\n\nI probably wouldn't step foot in this place again...\n\nI dont see how this place has been around for so long..I thought it must of been good...what a waste of my time and money...\n\nI should always consult yelp before stepping into certain places....", "author": "phillip w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-27", "description": "I've been in for a quick meal a few times.  Had a good time at the sushi bar tonight and was the perfect place to catch up with a couple of friends last month.  Good raw and cooked sushi, no ridiculous gimmicks, and you can have a huge meal for $20.\n\nThe only bummer about this place is there's never anyone in it and their takeout menu is way out of date.", "author": "Laura K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-24", "description": "This is what I get when I don't consult Yelp first. Never again will I take such a chance! Especially with limited funds!\n\nThe Chicken Teriyaki was mostly skin, which was gross. Other than that I guess it is fine. I didn't have the fish but I probably wouldn't chance it.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-31", "description": "My boyfriend, Jordan and I frequent Micado at least once a month since he lives in the Sunset District and they accommodate to his vegetarian lifestyle.   \n\nWe always sit at the Sushi Bar and the Sushi Chef is extra friendly and humorous.   At first we weren't quite sure to make of his character but he seems to enjoy poking fun of my vegetarian boyfriend.   He keeps saying meat is good.   Or would make a sushi roll and tell him that it has meat in it.    I know it may seem unkind but we don't mind his humor and Jordan gets a kick out of it.   The Sushi Chef even added Sriracha to his tea.  And Jordan told him it was yummy!\n\nAbout the food, the sushi/sashimi is FRESH.  I just read a handful of reviews saying its not.   \n\nVegetarian thumbs up: \nChef Salad\nTamago Roll/handroll\nDeep Fried Avocado or Broccoli roll\nMiso Soup (it's vegetarian friendly which means no dashi extract)\n\nWhat I usually order: \nMiso Soup\nSake Sashimi\nSalmon Skin Handroll\nSpicy Tuna Roll (it truly is spicy)\nSpicy Lobster Handroll  (I recommend everyone trying this at least once!)\n\nI saw the other night that someone ordered a grilled fish (shioyaki) and it looked really good.   I was a bit envious of this patron.   \n\nJordan and I have been to other Sushi restaurants in the Sunset, but none have given him better service.  They never mess up his order and he hasn't gotten sick from the food yet.  So I give them 5 stars for making him a stuffed and happy vegetarian.   The prices are pretty normal for a Japanese restaurant. \n\nIt's definitely not fancy and I like the fact that it doesn't have techno blaring in the background.  I hope they stay around for a long time. It makes me nervous to see a restaurant I like look so empty.", "author": "Morgan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-03", "description": "cliff notes:  Decent food, NICE people, I'll go back for seconds.\n\nI really think this rates at about 3 1/2 stars, but every person we met while dining there was nice as pie, so, round up. \n\nI have lived literally down the street from this place for oh, just shy of 6 years, and yet..never went. The fact that it was almost always empty sort of deterred me.\n\nToday however, that changed. On a walk w/ my fantastic MIL, she said she'd eaten there before and we popped in on a whim, both hungry. Did I mention there was a 3yo and a baby in tow? \n\nWe got seated by a window, the lady waiting on us was delightful and right away brought us tea, followed shortly by some very tasty pickled cucumbers (I will eat cucumbers any time, any way, it's a surefire way to get my attention). So, right of, I LOVED that. So did 3yo. And the fact that they brought her water *with a straw* (easy to please).\n\nI ordered the lunchbox combo: chicken teriyaki and tempura. MIL ordered just chicken teriyaki. \n\nNo more than 2 minutes later, her salad was delivered and right after that, miso soup for all of us (including complimentary for my 3yo) and avocado makis (again, 3yo). \n\nOur meals were delivered very shortly after that, sizzling hot. \nI was a bit disappointed that the chicken teriyaki was made from dark meat...I hate dark meat usually, which is why I typically don't order chicken teriyaki. But I also have a rule about not ordering fish the first time I eat at a place (and glad I didn't now based on reports that it's not fresh).\nPleased to say - the chicken was pretty delish. It was WAY thinner  than thigh meat is usually, making me think they pound it into oblivion with a meat tenderizer...and then it was grilled. REALLY grilled. Dark meat eaters might have even said \"over cooked.\" But I liked it! And it was bathed in really tasty teriyaki sauce, that wasn't as thick and gummy as you find at some restaurants.\n\nTempura was good, but come on, how can you mess up batttered, fried veggies with dipping sauce? You cannot. It was fresh, hot and crispy. \n\nTea was good, miso soup was very good (probably laden w/ MSG and today, I really did not care). Service was fast and very warm hearted. And today, it actually wasn't dead in there at 1pm...there were probably five other tables filled when we arrived. \n\nI like places that have been around and are staffed by nice people. We'll be back. It's not the *best* Japanese food around, but when it's around the corner and I'm just with the kids, I'm sure this will be a go-to place when I don't feel like cooking. Will probably come back here to review takeout.  This is one of those places that's worth checking out if you happen to be walking by, but will probably never be something that draws people to the Sunset for it's own sake.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-29", "description": "I came here with a group of friends of 11 people after our graduation ceremony. When I walked in through the door I wasn't sure if this was a great place to eat since we were the only ones there. The lady there kindly seated us and gave us our menus. We took a long while to decide on what to eat so the waitress pointed our the specials. Between 11:30-2:30 there's a lunch box special where you get to choose two items with rice and a nice salad and some miso soup.It was pretty worth it since it was only $7.95.  The food preparation was pretty fast and we were soon munching. We spent a long time there eating but I enjoyed my meal. At the end we ended up only spending about $10/person which is a pretty good price. I'm definitely going back here again later in the future.", "author": "Maggie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-24", "description": "Micado is my favorite sushi place in S.F. I've probably eaten there at least 20+ times. You can't go wrong when the owner/chef Pak has 30 years of experience. Best spicy tuna roll I've ever had in my life since they use korean chili powder.", "author": "Colin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "First time today for lunch, very pleased overall with service, prices and quality of food.    I ordered the $7.95 lunch special and everything in the bento box was super fresh and delicious.  Lots of places will bring you a piece of fish or chicken that has been re-heated.  I was so happy the teriyaki chicken I ordered was just grilled, it was moist and tender with a lightly sweet teriyaki sauce, nice.  The salad was cold, crisp and the dressing was very tasty.  There aren't many Japanese restaurants in the outer Sunset, I'm glad I finally went into this place, will return.  The waitress brings ice COLD glasses for the beer.  This is a special touch not many places care enough to provide.  Very impressive.  The chopsticks are the kind that can have very sharp edges.  Next time I'll bring my own.", "author": "Rona M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-17", "description": "The first thing that you see as you walk in to this place is the cracked glass on the door. Hmmmmm... Not a good sign.\n\nBut it is quite cozy and homey although it is usually empty inside. I've been there several times and had the Chirashi most of the time. You get a bowl of rice with piles of raw fish on it. It's my favorite. The fish is pretty decent. The tempera is good too. \n\nI am basically happy with the food. It doesn't make me want to stand up and sing but it is good. The atmosphere is very warm and I feel comfortable there and the service is always good to me.\n\nI would most likely come here on a regular basis.", "author": "David P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-26", "description": "Mediocre.\n\nParty 2\nOrder: \nBeef Teriyaki  dinner\nTempura dinner A (shrimp, veggies, fish)\n\nDinner companion had the beef which she said was well done and not tender.  It tasted reheated and at $15 would've expected something better.\n\nTempura Dinner A ($12) was good but I like fried foods and you cant really mess up anything deep fried.  I do agree that the fish was not fresh.  \n\nBoth dinner came with miso soup (hello salt and msg!), iceberg salad with thousand island dressing (pretty typical)\n\nService was fine.  Our tea was always refilled however, I wont be back but I did leave them a generous tip.", "author": "Sun T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-14", "description": "We came here on Valentine's day around 9pm and the place was completely empty... We were kinda nervous but I seen the \"people on yelp like us\" sticker so I went in with hi hopes. The staff looked as though we were interrupting their movie (yes they were at the sushi bar watching tv) she told us (group of 4) to find our own seats... She came and brought us extra menus and a fork for the kid. She went back to her movie.\n\nShe came back and took our order we didn't have to wait long for our food. She then went back to her movie. We had tea, but I didnt like it so, I was trying to wait for her to come back she didn't so my boyfriend had to call for her and ask for water. She comes back with 2 glasses of water... There were 3 adults and one kid (she brought the kid water in the beginning). My cup was dirty so when she took a break from her movie she came back and I told her and she looked at me funny. She then stood next to the table and cleaned the cup with her fingers. We were just kinda staring at her then she left and brought back a different cup? We didn't drink the water in that cup after that. We finished up and paid and left. The food was bland. I had the spicy tuna roll and rainbow roll and it wasnt good enough. I won't be returning.\n\nOh.. And she went back to her movie...", "author": "Jo C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-26", "description": "More like 3.5 stars. The rolls were so, so. The California Roll were not good, the filling was dry and bland. What tasted good was the gyoza & the saba shioyaki (meaning salt grilled) was excellent. It was cooked just right and served on a hot plate keeping it warm. The five of us had\n2 Gyoza\n1 Sushi Combination\n1 No Problem Roll\n1 Catepillar Roll\n1 Hawaii Roll\n1 Saba Shioyaki\n1 Seafood Udon\nThe total was 80 w/ tax & tip.", "author": "Erica B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-06", "description": "We had take-out from here last week.  The food was average but the price, especially in cheap-o Outer Sunset is too high.  \n\nThe place never seems to be busy.  It's actually quite spacious, although the outside suggests otherwise.  The service is good and the rolls are average sized.\n\nWe would normally give a place like this three stars, but parking around this area sucks, so the cost does not outweigh the benefit.  It's too close to Yum Yum fish to give it a better rating.  \n\nBut if you want to support family-owned places, it's worth at least a take-out.", "author": "Kel S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-20", "description": "Micado was very mediocre. While the staff was nice, we were actually the only table here, and the food was not the best. Certainly decent for late night sushi, with Tuttimelon practically next door. The tempura seemed a little greasy, but on the upside there was no onion. Service was personal and friendly, but the sushi was unmemorable. If you're in the neighborhood during the day just go to Yum Yum Fish, but should they not be open or if you prefer more of a sit down experience, I suppose Micado would suffice.", "author": "Chelsea P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-14", "description": "first time here today have lunch with my co workers. the food isn't that bad. the most i like is this place is quiet. people can have a good time with friends", "author": "Yan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-30", "description": "Went here once in March 2011. Both the ambiance and the food sucked. The fish didn't seem particularly fresh =/", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-28", "description": "On a Monday afternoon, I was craving for some Japanese!\n\nSpotted Micado, and walked right in. At first blush, this seemed kind of a cold, sad place because of the shades and with nothing but the TV on. I asked if they offered take out, and they handed me a menu. I took a seat and ordered. I waited for a good 5-10 minutes for my food. \n\nI can tell the chef and the people who worked there are all heart when it comes to doing what they do. It's a shame there were only about 4 people eating at the restaurant.\n\nThey offered complementary tea as I waited. After having everything neatly packed, I thanked them and proceeded towards heading out as the chef opened the door for me. I wish him a good day. All in all, very nice on the service!", "author": "Jess i."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-01", "description": "Sat at the sushi bar and it was quite uncomfortable. I ordered a few nigiri and a tekka maki. They were okay I guess, but then came the \"white tuna nigiri\" that I ordered.... which was REALLY weird. This white tuna is different from all the other sushi restaurant's white tuna. It was actually white!! I think it was butterfish instead of white tuna. Most of the nigiri were almost $4 for 2 pieces.\n\nService was not so great. The chef was just mentioning what I ordered to the waitress, and she wrote them down. Then she gave me my check with the total written on it already, when I didn't even say I was finished. My tea was never refilled either.\n\nPrices were not so decent, and the sushi menu lacked options. I'm not sure there if they have any lunch deals either. But definitely not coming back.  I should've just went to Yum Yum Fish across the street and ordered to-go!", "author": "Allyson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-27", "description": "I like tempura and the Teriyaki Chicken i had here.  It was good. Right after I had my colonoscopy.  they were really nice.  The was not so expensive.  There was two other table there too.  My test a good the Doctor said I found out all the hot doctors work in this department.", "author": "John F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-15", "description": "This place is pretty terrible...overly crunchy chicken cutlet, one server that seems totally out of it and rolls were just mush...not exactly fishy, but not exactly well-made.\n\nNot a good selection of drinks, and stomach-ache inducing for the whole party that I ate with.\n\nOn the plus side, the sushi chef was very friendly, but that would not save the whole restaurant. How did this place get 3 1/2 stars??? The only thing I liked about this place was the comforting atmosphere without feeling dirty.", "author": "Anna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-27", "description": "This place is fabulous!  The food is amazing!  \n\nI stumbled upon this place when I was looking for a late night sushi place.  It is family owned, and the service is exceptional.  They keep me coming back.  \n\nI've had the albacore sashimi, spicy tuna rolls, a sashimi salad, chef's choice, spider roll, shrimp tempura roll, and much much more.  Everything has been delicious.  They serve edamame and miso soup everytime.  My favorites for sushi are albacore sashimi and spicy tun rolls, and they are very tasty and fresh.  The spicy tuna rolls are the spiciest I've ever tasted.\n\nI can't comment too much on prices other than generally stating that they have good prices because I tend to end up  ordering sake, soju or beer with my sushi.  \n\nBut I can't commend them enough for their customer service!  They are so welcoming, efficient, and have great humor!", "author": "MiYong E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-15", "description": "Great service.\n\nNot a large place overall and a little quiet,however we have enjoyed our meals here.\n\nThe people who work here have always been nice in the past.\n\nSushi was ok and overall this is a decent place.\n\nFresh food they provided.\n\nQuite happy with my experience here.", "author": "Dani D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-26", "description": "I thought this place was pretty good. They give you a good size salad. They put the dressing on the side which I like. Some places drench the salad with dressing. I also got the dragon roll. I liked it. The fish was fresh and found that I could real taste the different flavor. I now prefer the salmon on top rather than the eel. I would go back.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-14", "description": "I swear this place is a Yakuza front. Every time I pass by this place, it just looks shady. There are these blinds that block looking inside... and when you can look inside, it always looks empty with only a few people inside. And there's no picture for this place yet. Yakuza conspiracy? Probably. Probably not.\n\nOne day, my friend and I decide to go inside and give it a try. My thoughts didn't go away as I noticed the place was pretty empty for dinner time and the place was dimly lit. I didn't see any scary, tattooed Japanese men though, so I didn't bolt out of there.\n\nThe service seemed nice enough. The food wasn't that bad. I didn't think it was better than Shimo's or Fuji's, though. It was still pretty good and I'd probably go again... maybe to shake my wacky notion away. But if I see a suspicious-looking Asian man with sunglasses who could possibly be armed (and who's not a cop,) I'm walking out of there... hopefully alive :D", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-15", "description": "I was moderately skeptical at first because the place was empty, but iI've been back several times now for the delicious sushi and low key atmosphere. Love to go here with my husband. Not a huge selection, but the 49er roll is fantastic! Good miso with tiny mushrooms :) Nice little family run restaurant.", "author": "Brittany G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-02", "description": "Outside is not inviting but when you go inside it is clean and tidy. lady helps who sits at bar waiting for customers to enter watchhing tv. She serves tea quickly but never smiles. My grandaughter and I were the only customers in the late afternoon . The food was good, first served hot tea, soup and tiny dish of cucumbers. we shared 1  chicken teriyaki -sticky white rice shrimp and vegtable tempura.cost 16.85,  when we received the bill I gave lady a 20. and she disappeared..oh well I would have tipped that about that amount anyway. portions were right for us since we are light eaters. a big eater would be disappointed.price was a bit high for quaility and quanity.  I might go back again if I am really hungary in afternoon next time I will go b4  230pm when I can get the same menu item for $6.95.", "author": "Debi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-17", "description": "We went there last Sunday for dinner around 8 p.m. and parking was bad.  I guess I can't really complain since it is Irving Street after all.  We only had to do 2 laps to get parking.  Not bad by Irving standard.  =)\n\nI like the lady there, who served us.  She was a really sweet lady and kept refilling our tea!  LOVE that!  \n\nWe both got the combination plates -- which was $14.95 each and we also got their spicy tuna roll, which was about $5.95, I believe.  \n\nFirst, tuna roll!  I think it's PERFECT!  I am always looking for something spicy but not TOO spicy.  This was just right in the middle.  It satisified my craving!  But the spiciness wasn't overwhelming where you can even taste the food.  It was good!  My hubby to be, who doesn't really like spicy food, was only able to eat 2 of the 6 pieces.  More for me.  Ha ha ha!!!\n\nThe combination plates -- I ordered the sashimi and the chicken teriyaki combo and my hubby to be got the tempura and I think he got beef teriyaki.  I thought mine was pretty good....except it wasn't as filling since...I ordered sashimi.  I tried some of the tempura and it was pretty good as well.  It was crisp but not too over done!  Just the way I like it.  And chicken teriyaki wasn't too salty either.  It was good.  I do wish there was more chicken in there though.  I didn't give it a 5 because I haven't tried a lot of other things there....\n\nWe've been here a few times over the past few years..but we always seem to keep going back to their combination plates.  I'm sure there's more stuff for us to try.  We just need to venture out!\n\nI would definitely recommend the spicy tuna roll...just to try.  You'll be hooked.  (well..not if you're afraid of spice though..)\n\nWould we go back again....HECK YA!  =)\n\nDo we recommend this place...HECK YA!\n\nHave fun!", "author": "Joyce L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-16", "description": "I ate here with a friend earlier this week and unfortunately, we came after they stopped serving the lunch special. A combination order is $13.95 which is pretty steep for a bento box.\n\nI had the tempura and beef teriyaki combination, along with the standard salad, rice, and miso soup. I also ordered the 49'er Micado roll.\n\nOut of all the Japanese places I've eaten at, this is one of my favorites. The tempura was light and subtle and the beef teriyaki tender and flavorful. In fact, everything I had here is worth five stars. I especially liked the 49'er roll and how the slice of lemon placed on top of it kicks in at the end of every bite.\n\nThe service was also commendable. Our server kept the tea coming (which was also good, by the way) and she wasn't asking us if we were \"doing alright\" every five minutes but she was always aware if we needed anything.\n\nAt $13.95, it's a little pricey but worth it. I'm definitely going to try and hit this place up during lunch hours (I think it's only $6.95), which ends at 2:30 p.m.", "author": "Bon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-19", "description": "delicious chirashi! we both got the chirashi, and it was perfectly sticky rice, covered with slices of very fresh fish, flavorful morsels of seaweed, with some totally amazingly delicious white tuna. the miso soup was average but yummy, and the tea was plentiful and good. \n\nour server was friendly, appropriately attentive, and knowledgeable about the fish.\n\nthe physical atmosphere is the only thing that's less than great about this place... ugly window coverings, big awkward space with no table individuality. but the sushi and the service are so good, it really makes little difference.\n\n[and hooray for a woman sushi chef!! I've heard that in Japan it's believed that women's hands are warmer than a man's and thus affects the taste of the fish. Masa Takayama of Masa in the Time-Warner Building says :\"Asked about the virtual nonexistence of women sushi chefs, Masa said, \"Everything having to do with fish is man's work: catching, cutting, cooking, making sushi. It is very hard work, and women do not have the stamina to stand behind the sushi counter.\"]", "author": "Wren X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-05", "description": "I work in the Outer Sunset, so when its time for lunch(if I was to lazy to bring one) I head over to the other side, 9th ave that is.  But I have my days that I don't want to drive over there and lose my parking spot, so to Micado I go!  Its only a few blocks away from work and is probably one of the three restuarants that are decent between 19th and 25th Irving St.  Since I only go there during lunch time I get their lunch box special which includes salad, rice, two choices of either chicken, katsu, tempura, california roll and some other stuff.  I mainly order the chicken, california and/or tempura.  I love their tempura, it is cooked perfectly!", "author": "Cristina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-25", "description": "So far this is my favorite japanese restaurant. Its usually quiet inside but the food is great and the service is excellent. \n\nI ordered the salmon teriyaki dinner, it was delicious and i don't usually eat fish at all. I was never a big fan of salmon until i had it here. The big piece of salmon was perfectly cooked with was nice and crispy. It was served on an iron plate. I went through two bowls of rice. \n\nMy friend ordered the spider roll ( softshell crab fried) and beef teriyaki which was nicely cooked and tender.  \n\nThe waitress happily refilled our bowls of rice and was very attentive. \n\nGreat small little place and prices were decent, go here instead of kitaro or kiki's you wont be disappointed. Sure its a bit more expensive  then those two places but you get your money's worth and a satisfied tummy.", "author": "Eric N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-20", "description": "It was 1:00 on a Saturday and the skinny boy was starving. Have you ever seen a skinny guy have a food swing? Not pretty.  So its lunch time, all the Chinese places were packed and I wasn't in the mood for greasy food. Just then I happened apon Micado.\n   The place was just about empty, usually not a good sign. We sat at the bar and the service was great.Tea with out asking soup with out asking.\n   The sushi was great but the portions were a little small. Something cought my eye on menu \"No Problem Roll\".Its deepfried soft shell crab with cucumber, yamakobo, kaiware,  and topped with tobiko. Its hard to say how good it was with out  resorting to bad language. The radish sprouts were a great touch.\n   We were done with a good lunch,finishing up the second bottle of sake and the chef keeps giving us food.Some sushi here some steamed soy beans there.\n   When it was all said and done they only charged me for one bottle of sake, this is not unheard of so I left a fat tip and started day dreaming of coming back.\n   Ding one star for the sketchy bathroom.", "author": "Lance G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-08", "description": "3 of us ate there last night (a Sunday). We were served by a v. pleasant woman who was really into refilling our hot tea (which arrived on the table quickly after we were seated). One had udon soup -- quite a large pot of it; we shared the Phila. roll (salmon, avocado, cream cheese, heavy on the cream cheese). Another had the chicken teriyaki, which he said was pretty standard, but good. I had sake maki, which was perfectly prepared, plus a medium-sized salad. The salad arrived quite chilled, quite quickly, with cabbage, carrots, cukes, lettuce, and the dressing separate, just as I ordered. \n\nAll in all, I think ordering from the sushi menu (front page) is a better deal here than the combos. You can try more things (for $4.50 & up) than with the combos.  I'd like to try the lunch boxes. \n\nAs to atmosphere, the tv was on the entire time so the staff (2 people) could watch, which is a little much in such a small place; there was only one other table filled at 8 p.m. on a Sunday.  You can tell this place tries very hard to please, and yes I probably would go back if in the neighborhood again, but it's not a destination.", "author": "joyce h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-19", "description": "First of all, their teriyaki sauce is amazing! They also have a great deal for lunchbox specials. The food comes very quickly and I've never had to wait to be seated. It's a place you can get in and out of pretty quickly. Most of the waiters are nice. I went there for my birthday once and they gave me a complementary sushi roll that was shaped like the golden gate bridge.  I say it's a great place for lunch and birthdays.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-21", "description": "Meter running.  Please let there be a place that serves the Ubiquitous \"Rice and Chikkun\" that my 4 year old seems to never tire of.  Hmmh? Teriyaki Chicken posted in the window, a block away from my newly coveted parking spot. Why not? \r\nService is streamlined for the driving population.  My daughter was chewing happily on her \"Rice and Chickkun\" within 15 minutes after I placed the order.  I was happily savoring my Chirashi Sushi even before she received her order.  Not being a Teriyaki Chicken fan, I was pleasantly surprised to actually catch myself finishing her food.  The sauce is super yummy sweet.  The tempura was pleasingly crunchy, and not soggy at all. \r\nBy the time everyone finished their food, we even had more than 20 minutes left on the 1hour parking limit meter.\r\nThe sushi chef is really friendly.  The last time I went, my kids weren't the loudest there.  So, it gets an extra point for attracting other parents of kids who like to use their mouths for screaming at the top of their lungs, appropriate or otherwise.\r\nI hope there's parking karma next time I'm in the area.", "author": "brenda b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-12", "description": "Came here. Service was really bad. I mean we got seated immediately, but when it came to ordering, our waitress didn't come for almost twenty minutes. When we asked for some tuna sushi, we were denied, and yet I heard distinctively from another patron who ordered the same dish, and it was made available to them. I think the waitress chooses and picks who she wants to be a bitch to. I'm not ever coming here again.", "author": "Clinton L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-12", "description": "We were walking around Irving and decided on some Japanese close by. This place is run by Japanese people, so I'm guessing it's supposed to be more authentic? But it was really nothing special (we both decided). She ordered a don buri (pork) and I had a little piece (not a fan of pork to begin with, unless BBQ viet style). We also had the soft shell crab, which was alright (better than some, but not the best). I ordered the Philadelphia Roll (which I always order at any sushi place pretty much), and I think that there wansn't enough creme cheese (I love creme cheese). I ordered the 49s roll too, and it was alright. Their lemon slices weren't cut thin enough. The portions were small, but enough to fill me up. The service was good however, so I'll give it the average 3 stars. Bill came out to be almost $40.", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-15", "description": "Came here just yesterday because me and my friends were still hungry after CoCo's Crawfish . The sushi here was exceptional but nothing special .. there's a lack of creativity . We got the sushi deluxe which was okay . We also got the dragon roll and calamari roll which were decent . Lacked flavor , but at least it wasn't overloaded with flavor & really salty like a lot of other Japanese restaurants make their sushi . This was the first time I've had uni (sea urchin) sushi . Kind of creamy , suprisingly not that bad . The miso soup was alright . Giving this Micado an extra star because the lady that served us was super warm , friendly  & fun to talk to .", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-12", "description": "Im not too sure the place even deserves a star. The fish was not fresh, almost brown. And even better, we found hair in one of the rolls. Not so delightful.", "author": "Alyssa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-09", "description": "Had a unagi nigiri, ishitashi (cold spinach), oyako don, came with white miso and pickled cucumber. All very tasty except the spinach which was kinda tasteless. Service friendly if quiet. Not sure what the other reviewers are complaining about.\n\nOnly annoying thing was toward the end of our dinner they started using some ammonia-based cleaner, perhaps in the kitchen. My friend is really turned off by that (I would have been if they did it at a nearby table but they didn't).", "author": "Charles B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-22", "description": "I went in for lunch. i spent $9 including tip (small tip) and got a really good meal. you get 2 items in the lunch special, salad, rice, and miso soup. the soup wasn't anything special, the salad was fresh, the service was nice. the waitress refilled my water and tea without having to ask. overall, I think that its good sushi at a reasonable price during lunch.", "author": "Jay L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-21", "description": "I'm actually part of \"everyone who never knew about this place even though we lived in the area for years\" Somehow the lunch special on the window caught my attention one day, so I decided to try it out. To my surprise, the food was really good. Their lunch special has six items, but you only get to pick two of them. It also comes with cucumbers, miso soup, rice, and salad. Thats a deal for only $6.95. The only complaint I would make is that their calfornia rolls tastes kind of weird.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-17", "description": "Our favorite sushi in SF!  Mr. Micado is the sushi master.  Very fresh fish.", "author": "Al D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-23", "description": "i tried their udon the other day. the broth was really good. however, the noodles were chewy as hell! the noodles had a consistency of chewy candy. it was weird to me. everytime i ate it, i felt like i was eating gummy  bears! mMmm...gummy bears...MmMmm...LI HING gummy bears. i want some... \n\noh and  it also came with 2 shrimp tempura on the side. still not a fan of the tempura!  still taste gross to me! it  had so much breading, i couldnt even taste the shrimp! so i just peeled it off and ate the shrimp by itself.", "author": "B B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-25", "description": "I'm no stranger to restaurants on Irving St (West of 19th Ave) and for the only Japanese restaurant on that side of the street  (well, until you hit 41st ave) it's okay. One would normally be concerned as why a Japanese restaurant is ran/owned by Korean's but that's how the majority of Japanese restaurants operate in San Francisco. No biggie.  I'd have to say that as much as I think the food is mediocre, I think they have something going. I say this because every time I eat here, I feel like eating Japanese again and because of the lack of Japanese restaurants and the lack of time allotted (I work near here), I keep coming back again. Perhaps there's more than just MSG in the food...nah, probably not but despite my 2 star rating, I frequent this restaurant more than I like to admit.", "author": "Christopher T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-20", "description": "my wife & i have been frequenting this family owned restaurant for a great number of years.  the service & quality of the food still remains the same, great.  the waitstaff is friendly, quick & happy to see you.  the sushi chief is a great guy, always greets you & jokes with you when you walk in.  the atmosphere is pretty standard japanese restaurant fair, but the restaurant is a quite place to get away from the hustle & bustle compared to other places that we typically frequent.\n\nwe have tried the lunch specials on numerous occasions & no complaints.  typically dinner for us here is a combination teriyaki steak & tempura, udon, dragon roll & an assortment of fresh sushi.  the combination & the lunch specials come out to you in a bento box.  miso soup, cucumber salad & tea come with your meal.  \n\nthe sushi is brought out to your table, freshly prepared & placed in front of you.  the miso soup is light & flavorful.  cucumber salad is a favorite of my wife.  dinner is typically very light & appropriately seasoned.  not too much sauce or seasonings, just enough which still allows the flavors & freshness of the food to be savored.    \n\nlunch for us is typically under 20.00 & dinner about 40.00 depending on the amount of sushi we consume.  the service & food are always consistent.  the restaurant itself is clean, quite & welcoming.  there is typically no crowd so its a great place to sit, eat, relax, talk & unwind in a quite comfortable setting.  parking is terrible during the day but in the evening after all the shops are closed street parking is not too difficult.  they open fairly late.  take out is available.  they accept cash & credit cards.", "author": "larry s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-06", "description": "This is my favorite new sushi restaurant. It helps that it's within walking distance to my house - but I really, really love it! In fact, I almost didn't yelp it because I thought it could cause over-crowding and then I wouldn't be able to get my delicious spicy tuna roll. I decided to share the love!  The sushi chef (I can't remember his name) is always working. He's very funny and light-hearted and did I mention he makes amazing spicy tuna rolls! The price is fair depending on what you get. Somethings seem to be underpriced and some overpriced. I've left content and full every time.", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-28", "description": "We were first introduced to Micados via a friend's birthday party, where they treated us like royalty and even let us bring in our own karaoke.  The sushi was pretty darn good too.  I love their spicy tuna rolls.  Finely diced tuna, hunks of garlic and green onion, plenty of sesame oil and chili.  MMmmmm-mm!\n\nNot so sure about some of their specialty rolls which sometimes come with some kinds of sauces drizzled over them, but for the classic sushi fare, Micado is a great deal.", "author": "Andy M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-18", "description": "I've been here twice, and it is perpetually empty. Could it be a front for some other shady activity? Who knows. The first time I went and got the philadelphia roll, which is one of my all-time favorite sushi rolls. And for the first time, I didn't like it very much. The amount of cream cheese on the roll was very excessive; it was all I could taste. A surprising disappointment. Won't be ordering that again. This place is also very overpriced. Went there the second time to try their bento box lunch special, but of course...they double the price on Sundays and ripped me off. Any other day of the week it's  $6-$7, but of course it was about $15 on Sundays. Give me  break. The food itself was good, but there are so many places just like Micado who make it just as good if not better, and are way cheaper! Micado could be so much more. They have potential, but they need to lower their prices because they aren't outstanding enough to be charging as much as they do.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-17", "description": "I was surprised to see so many mixed reviews. The sushi and the tempura here are absolutely delicious! The sushi was VERY fresh, and contrary to what some others wrote, extremely tasty. The prices are better than a lot of the places in the inner sunset too. The people there are also so warm and friendly, they even brought me tea while I waited for my take out order. Definitely check it out!!!!", "author": "Laura W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-05", "description": "The spicy tuna is really good.  The ambiance on the inside was nice.  The staff was friendly.  For the price, you can't do much better.", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-05", "description": "Hands down best sushi West of the Mississippi...or East for that matter. The Maguro is like butter.", "author": "matt f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-15", "description": "i've been wanting to try this place since forever! yesterday (valentines day) came here with a couple of my friends for dinner. really nice staffs and good food.", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-26", "description": "If you're not looking for a fancy ambiance and want some good Japanese food, I would recommend this place. The  best bet on sushi is to ask for their recommendation on what's fresh that day. My favorites are saba, hamachi, and spicy tuna. If you want something cooked, their specialty rolls, teriyaki, udon, and tempura are good as well. If you're looking for a good neighborhood sushi restaurant that you can frequent often or take out, try this place.", "author": "Kate C."}
