{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "This is probably the best place for hot noodle in town. We ordered sukiyaki dinner which comes with prime ribeye beef in sweet broth. I really like it. It's so tasty! The other one is seafood nabe (basically is seafood udon in fish broth). A clear broth tastes good, but i still like sukiyaki one better.\n\nServers were nice and polite. I went there on weekday at night. It was not busy, seemed little quite. We got our foods pretty fast. Severs came in and checked us pretty often. \nOverall I gave 5 stars for this restaurant!", "author": "Romie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "I haven't come by to eat here in a while. I just found out they have two places in Japan town now. Mifune Bistro and Mifune Don. I need to drop into the other restaurant soon.\nI've been coming to this restaurant for almost three decades; when they were upstairs near the center of the peace plaza court. \nI've always ordered my favorite Niku Don buri, which is thinly sliced beef with caramelized onions over rice and this time I added a side of steamed cabbage. (I hardly venture out of on the menu). My son ordered the Yakitori dinner. He had a small grill and he happily grilled his yakitori. We also ordered hot sake and hot green tea. We enjoyed our dinner and enjoyed the service. Tanya was our server and she was awesome! Thank you for everything!\nWe both give four thumbs up and YOU need to try this place out for some delicious Japanese food!", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-03", "description": "It seems like this place underwent a renovation since the last time we were here; the restaurant size has been halved...I wonder why. \nThe food is okay but for adding a mandatory 15% service fee to the bill isn't justified at all. We weren't checked up on more than once the whole time and they didn't even bring us hot tea (probably because there's a charge for that too). \n\nWarning: they always add a service fee; even if you didn't make a reservation nor have a large party, you'll be charged what they call a mandatory service fee for gracing their restaurant with your business.", "author": "Brad P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Once in the blue moon! \nMifune changed their menu!!!! \nMy family and i have been mifune for more than 10yrs! Since the old mifune which was next to Osakaya is closed. Today i went Japan town with my friend, and we were walking to Mifune bistro accidentally. We found this mifune bistro where is located downstairs next to toys store. \n\nWe ordered 3 items from the new menu.\n1. I got Beef steak don that was very good! They used really good quality of beef ( prime ribeyes, i guess) served with miso soup $14.80. Price is reasonable!\n\n2. Agedashi tofu is also good. Light and yummy!\n\n3. My friend got yakiniku don. It looks good also. My friend said its tasty, but i didnt try some. Well, next time i'll get it for sure!\n\nTheir services are great. We will come back for sure!", "author": "VooZa A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-03", "description": "Came here because one of my good friends swears by the Ramen karaage here.\n\nThe thing is, he's never had karaage any other place before, so that's like when kids say that McDonald's is the best hamburger. It's what they know, or don't know.\n\nThis restaurant was mostly empty, just 3 tables-and we were one of the tables.\n\nSuper slow service. Super salty broth.\n\nSuper dry karaage.\n\nThe server was angry because I left her a $1.75 tip, but heck, that's more than enough when \n1) they were trying to kick us out as soon as they closed \n2) they didn't refill tea \n3) I had to grab my own napkins and chopstick set\n\nWith so many other places in Japan town, why come here?\n\nI'm giving this place 3 stars because at least the ramen was hot and the portion was okay.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-22", "description": "Slightly shocked at all the low reviews, but then again the low ratings are mostly about the ramen.\n\nFor my first visit I would have to say my UDON was delicious! Not only was it good, but the the portion was decent in relation to the price, $11.80 for chicken and shrimp Udon. The broth was flavorful even before I added a lot of the spices they offered on the table. The soup also came with lots of veggies which helped me feel not as guilty eating all that broth. I would definitely order this again!!! \n\nI also ordered the spicy chicken wings. These had a nice crunch to them with a more tangy, not spicy flavor. Although not as spicy as I thought, these wings were still pretty good. (Good price point too!) \n\nI really enjoyed their tea. I drank 2 hefty cups. Something about this tea is that it's super light and it doesn't have that strong after taste. Try it! \n\nAs far as customer service, it took them a few seconds to acknowledge us standing there waiting for a table, when it wasn't busy. When they sat us down, they weren't quick to take our order- there was another slight wait. \n\nWould I return for some yummy Udon? Yes.", "author": "Lene N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "Good food and good service, I really like this place. I've been here for many years, nice atmosphere and it's so easy to get ther.", "author": "Tharaya T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-02", "description": "This place has gone downhill since what I'm assuming to be new ownership because it's a drastic change. Portion sizes are smaller while prices get higher. Go figure. Used to be my favorite restaurant for the past almost 10 years and now it's completely different and sad. Won't be heading back until they fix this mess.", "author": "Rose Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-05", "description": "We stumbled here on a late Monday night. Everywhere else in the old run down japan town center was either closing or had a wait to be seated. \nWe decided to just have a quick bite here before our movie. \n\nThe place was fairly empty with just another table. They have a sub par menu, a little bit of everything from sushi rolls to ramen to curry, etc etc. they didn't specialize in anything in particular. \nI ordered the unagi don. It was fairly affordable and the portion was decent. It came with a really weird miso soup that had yellow chopped onions in it. I wasn't a fan. \n\nMy boyfriend had the curry. The beef curry would be rated at a 2/5. It wasn't your traditional Japanese flavors. Or perhaps it was just sitting there for too long. \n\nAlthough there was only two tables in the restaurant it still took like 25 mins to get our food. Which is really strange in my opinion. The waitress just seem antsy to clean up and go home for the night.", "author": "Kaily V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-14", "description": "You would think that a Japanese restaurant in Japan Town would have to be good in order to compete against all of the other establishments, especially a restaurant that has been around for ages.  Not!  There are better Japanese restaurants spread throughout the city and a further drive is worth the time and effort.\n\nThe food at MB was rather mediocre, sushi rolls were small and unimaginative, the Tenzaru Soba with Jumbo Shrimp and Vegetable Tempura (more expensive than the regular shrimp) was not chilled and shrimp were not really bigger than regular shrimp.  The size was so average that I had to ask to re-confirm my order.\n\nService was decent with refills of tea with minimal asking.  Nothing stood out in our dining here.  Still searching for a decent Japanese restaurant in J-Town - they do exist elsewhere in the City - why not here???", "author": "Scott L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-21", "description": "The food is consistently good, but alas not great, and they can always seat our large family group/s. Service tends to be mediocre which explains the so so ratings, but their wide selection of food is always done well and of good portions. Their location on the street side located next to the great J-town toy store makes visiting this place always fun especially for the kids.", "author": "Ron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Good ol' BS Mifune!\nWe used to go there for the udon.  Nothing special but it was a comfortable spot. \n\nThey don't have a restroom in the restaurant so you have to wash up in the one located in the hallway next door.  The last time I went there with my daughter (she was 4) we went to wash up before getting seated.  Some spider haired youth was being escorted out of the men's room.  He had a raging hardon, and I blocked my daughter's view of him.  I peeked into the restroom and he had smeared shit all over the wall and spilled yellowed toilet pater all over.\n\nWe didn't eat lunch there that day or ever again.", "author": "Ricardo O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-19", "description": "I used to patronize Mifune when it was at its old location but hadn't been by since it moved to its current spot on the lower level of the mall. \n\nUpon walking it I noticed it was only half full, unlike most of the other restaurants that night.  I decided to ignore the alarm bells going off in my head, again due to my history with the establishment.  \n\nWe were seated immediately and waited 5 to 10 minutes for one of the two waitresses to come by and take our order.  We ordered 4 sushi rolls and one bowl of Nabeyaki udon.  The food came in a decent amount of time, although not all at once, which was fine.\n\nThe rolls - caterpillar, spider, rainbow and a shrimp tempura filled roll, were okay.  I've had better and I've had worse but I had no complaints about these.  However, the udon noodles were not good.  The noodles are not fresh but rehydrated.   It came with an egg, a shrimp tempura (was it frozen?), fish cake, chicken thigh meat and some vegetables.  The broth was extremely salty and I could not take more than a few sips of it.  I was so thirsty the evening and subsequent morning following this meal.  \n\nService was fine, as we did not experience any notable issues.  We received our water and tea as requested, but they were not refilled.  We could see the waitresses were swamped and didn't request refills.  I do wish I had seen all the warnings here of the added service charge but since I didn't pay the bill I cannot speak to it personally.\n\nMifune is not what it was (at least in my head).   It's fine for a general all purpose Japanese restaurant but if you want great sushi or great noodles head to spots that specialize in those dishes only.  I noticed a lot of people ordering the curry dishes so maybe that's the best dish to order there.", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-04", "description": "Completely average Japanese food. I come here a lot because it's relatively cheap -- in my opinion. I usually stick to ten zaru soba and a roll of some kind. That gets me out the door for about 25 bucks including tip. There's always a table and I have not experienced re service problems other complain about. And I've been a regular here for about three years. \n\nIs it my favorite place? No. Do I go out of my way to come here? No. But I'm in the Japantown area a lot and refuse to wait 90 minutes for hipster ramen. \n\nAs far as the food -- it's hard to mess up soba noodles. The tempura isn't consistent. It's fine one time and kind of greasy another. Most recently I found the sauce to be too thick. But on this same visit the spicy hamachi roll I ordered was exceptionally good with a lot of fish.", "author": "Tim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "I like the food here, the beef shabu is so awesome and the server is pretty nice with good service.", "author": "Nawatida P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-13", "description": "Located in Japantown in a run down shopping mall. Parking was easy and restaurant was empty. \n\nOrdered a few apps, entrees and ramen. Food came out quickly and was hot and tasty. \n\nThe service wasn't very friendly or attentive but we were in a bit of a rush so it worked out fine. \n\n$150 with tip for four people (no alcohol) which is why I can't give it more then a 3-star rating. Way overpriced for what you're getting (small(ish) portions, junk service, and no ambiance).", "author": "Leah E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-11", "description": "WARNING: BEWARE CHECK YOUR BILL CAREFULLY BEFORE PAYING BC THEY RIP YOU OFF AND THE SERVICE WAS FUCKING HORRIBLE! Back then, this place was great but until today this will be my last time going there. Here's why: My friends and I went for lunch and having a very good time over there, but we waited for like 20 minutes for a server to show up to order our foods and that server lady was giving us a big fat attitude. Honey, I get it things can be tough and overwhelming cause I worked at the retail store in the past, but you need to suck it up.\n\nBy the end of the day, they charged us like almost $140 with 18% service tips without letting us know! One of my friends was asking the another server lady and said \"we charged you 18% service tip because there's 5 of you all\" but actually it's a lie. STOP RIPPING PEOPLE MONEY OFF!! NEVER COME BACK EVER AGAIN!!!!", "author": "Jamie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-20", "description": "What's with all the hate?  \nCome here if you want a quick and casual Japanese meal.  \nDon't come here for top shelf sushi.  \nThe food was fine and fit for consumption.  It's not going to be the best of anything but it serves it's purpose.  \nSapporo on tap, yo!  \nThey don't validate for parking.", "author": "Tommy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-29", "description": "I had to flag someone down to place an order. This took 20 minutes. We waited another hour and our food never arrived. Then I saw customers (who were sat after we placed our order) sitting next to us had one of their dishes finally delivered. That's when I finally spoke up. We ordered 3 combos of ramen or udon with a tiny chirashi bowl or eel. How hard would it be to get a bowl of sushi rice and cut a few pieces of fish to set on top while we waited for the rest of our meal? That's what it took for them to finally deliver our food. When it arrived it was horrible. Ramen and udon had no taste of just bad taste. The ramen you buy at the supermarket taste better. The rice bowl was decent but very average.\n\nI hate writing negative reviews, I probably write one only if it's really bad. I will never come back and I recommend you guys do yourself a favor and check Yelp for something better.", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-25", "description": "Mifune is an easy restaurant to go to because they always have tables and the service is very friendly, but the food is average at best. Nothing really stands out about the food here, but it can fulfill a basic craving for Japanese food. \n\nThe portions are pretty large and my favorites here are the Teriyaki Chicken Don, the Katsu Curry Don and the ramen.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-26", "description": "Japanese joint that does not specialize in any one dish.  This is like your Denny's of Japanese cuisine.  That means if you come here expecting for blow your mind Sushi, you should really get a CAT scan. \n\nIf you are coming here with a party that can't make up their mind on what to eat, this is a decent spot.  They have everything from soba to udon to ramen, with curry dishes, and raw fish dishes and tempura. \n\nIf you have ever been to Japan, if you want greatness, you go to a shop that only specializes in one dish and one dish only. If you want to appease everyone you go to a family joint that doesn't specialize.  It isn't bad, it isn't great.  \n\nReceived decent service here, the ramen was better than I thought it would be, I was a little surprised by the Kadone being pretty legit.", "author": "Robert G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-23", "description": "They seat you.\n\nThen you wait an hour in your seat EACH for:\n-water\n-menu\n- to order\n-for them to cook\n-for water\n\nStill waiting for food to arrive, but I can tell it'll be bad....\n\nThe only thing they're competent at, is seating you\n\nDon't fall for their fake food outside, check Yelp before you come in", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-02", "description": "Had a great experience with Mifune Bistro! Was initially hesitant based on some of the low reviews but was looking for a place that didn't have a wait -- and felt like I found a gem! Food was delicious with good portion sizes, and service was great. The katsu curry and beef don were fantastic. Also had the dragon roll, which was solid.", "author": "Liam R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-08", "description": "I never thought that anything in Japantown would be a disappointment when it comes to food. Unfortunately, Mifune Bistro takes the cake as my least favorite restaurant in Japantown (and that's putting it nicely).\n\nI came with a large party of about 15 people on a Saturday, and I would be understanding of slow service if they at least came by every so often to refill water glasses and if the food was at least decent. But nope, that was not happened. I ordered gyoza and soba, and this was by far the saddest and grossest gyozas I've ever had. How do you screw up gyoza? They were soggy limp dough bags with flavorless meat. And they were tiny. What a ripoff.\n\nAs for the soba, it was hardly filling. And they server(s) never came back to refill our water glasses.\n\nTo sum it up, there were terrible gyozas, saddening soba, and no water refill at all. There are by far so many better options in Japantown.", "author": "Jo W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "I went last week and order prime ribeye is best and the Katsu curtí spice the best in Japan town", "author": "Alberto C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Excellent food, food quality is great. Have been coming here for a few years ! Love the atmosphere. Service is always great and reasonably priced. Would give this place more stars if possible!!! Definitely recommend this place!!", "author": "Yvonne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "Mifune has been my go-to noodle stop since the old location across from Benihana. I miss the giant Daimo meal, but hey, that was too much food. Lately, I order the soba or udon with wakame and added tofu. I like the new location better, interior nicer, the place is easier to find when meeting friends, less confusing than wandering the row of look-alike plastic food displays. If you go during prime-time lunch or dinner, especially on the weekend, the restaurant is full-up with a waiting line of customers. That's the only time you grow a few cobwebs waiting for service, but the service and food are consistently wonderful. I've never been given grief for substitutions. So what's not to love?", "author": "Lynn F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-22", "description": "The Beef Curry was very flavorful, even though the beef was very tough. Chicken and Egg Soba was okay. Tempura was good, as was the Nabe. There was barely any unagi and avocado in Caterpillar Roll.\n\nSo overall, the food was just okay. Ambiance was nice. Service was friendly.", "author": "David W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-19", "description": "I'm torn between 2 and 3 stars here. I go for three because this place initially felt like it was in Japan. It is a nice, suburban style, but basic, Japanese eatery and the menu is extensive. \n\nHowever, considering its location, the rest was spectacularly disappointing. The service was awful, and the feeling of being in Japan quickly disappeared. My wife ordered sushi and a pork belly ramen dish; I ordered tempura domburi. The food wasn't bad, it simply lacked the authentic Japanese taste and style.\n\nThe miso soup was not hot, was way to salty and would have been better if it had been instant miso out of a packet. And that was very disappointing. To be honest it was crappy, and quite unforgiveable.\n\nWe later walked extensively around Japantown and were very pleasantly surprised by many things, including the numerous restaurants we did not see when we first looked. Our visit reinforced the need for us to research restaurants through Yelp before we make a move which may see us walking into a very ordinary restaurant.\n\nMifune is not very flash, not authentic, and the food is nowhere near as good as the prices would suggest.\n\nThere are many better Japanese eateries than this in San Francisco...do your research.", "author": "David F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "I probably I have tried the Nice Ramen Noodles, but the problem is that I order it before the groups of people who have arrived after me, and they got served first then I did and I ordered some appetite, it was brought all together with my noodles. I cannot lie that food was good but the service is bad when it comes to your appearance.", "author": "Luis V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-29", "description": "Long story short. DO NOT GO HERE IF YOU DONT WANT TO GET RIPPED OFF. If you do, then go ahead.\n\nI went here with a friend and charged $8 extra for a food that costs $12. When I checked my receipt and asked the waitress about it she rudely mock and said \"its because people like YOU cannot afford to give tips.\" People like me she said. People like us. This restaurant blatantly ripping us off in front of our eyes and if you do not check the receipt, she implies that we deserve to get ripped.\n\nPut it simply, don't go here. There is a reason why this restaurant is always empty.\nHope this helps.", "author": "Michael A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-29", "description": "I came here for the sukiyaki and left disappointed because of the service. I was waiting for my food for an hour and it still did not arrive.  The food was okay but upon paying the bills. Be forewarned THEY WILL CHARGE YOU 18 PERCENT NO MATTER WHAT FOR SERVICE CHARGE.  They charged me 18 percent for a party of two and when I confront them about it, the waitress said she will not serve us the next time. Just to keep in mind when you come here. \n\nPAY 18 PERCENT FOR SERVICE, OR ELSE NO SERVICE AT ALL.", "author": "Sunnu Luois H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-02", "description": "Came here on a Sunday night because every other restaurant in Japan Center was completely packed and we were hungry enough to give this low rates place a try.\n\nOverall: slow but decent service, be proactive in flagging down the few servers. Automatic 18% service charge added to bill no matter your party size (we had 3).\n\nFood: 2.5/5\n\nKatsu curry - 3/5. Egg and curry sauce were cold, but flavor was fine. Safe choice.\n\nNabeyaki - 2.5/5. Ingredients were low quality, broth was ok. Chicken had the texture of beef liver.\n\nChicken teriyaki - 2.5/5. Came with 2 different salads which was weird. Miso soup.\n\nService: 3/5 aside from forced service fee.\n\nWouldn't come here again but overall experience wasn't horrible.", "author": "Dani T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-30", "description": "We were so hungry that we didn't look at the Yelp review beforehand. The reviews are true. The food I would give it 2 stars, not anywhere near Japanese except the dinnerware. In the end, they forcefully charged us 15% service fee (we were only 2 people). Definitely will not come again.", "author": "Zhongjie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-21", "description": "I stopped by Mifune Bistro for a quick dinner before going to Festa.  Lately I've been kind of on a hunt for good beef bowls (niku-don), so I decided give theirs a try.  \n\nNiku-Don -- http://bit.ly/1UKNW1l\nThis beef bowl was okay but a little pricey for you get.  It was a little much on the salty side and seemed a little light on the beef side because I felt there was a ton of rice underneath.  It came with a small bowl of miso soup to justify the price.\n\nI'm not too sure if I'd go back to Mifune Bistro, at least not for another niku-don in Japantown.  I'll probably seek other options around the area.", "author": "Rodney H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-22", "description": "Pretty decent Japanese food place for a quick bite. I got to go because I was in a rush to leave they accept phone orders and everything. They also take credit card. The hostess was nice. Food was pretty good for the price. They give you a lot of curry when you get curry. I wish they would give a little bit more rice because it wasn't enough for me. Maybe I eat a lot? Seating is very spacious no tables right on your back. Kind of secluded. Hard to find if you don't know where exactly it is.", "author": "Derek P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-18", "description": "Was in a rush to have dinner and went into this place.\n\nThe service was amazing! From the beginning of our meal to the last bite, they were constantly refilling our waters and were easy to flag down if we needed anything.\n\nI got the Nabe Kimchi bowl and the portion size was huge! Almost a meal for two.\n\nWould of rated this 5 stars, but it was a bit on the expensive side - paid $15.00 for my meal.", "author": "James D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-27", "description": "Great lunch place if your in area of Japantown. I've eaten dinner here and it's great the portions served. They've do have great special luncheon menu items with combos. So you have a choice of many side dishes for additional cost", "author": "J H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-03", "description": "This place was the most awful Japanese restaurant that I went. I ordered nikudon, but it the mea tasted too dry like a box, and rice was old that it sticked all together. There are a lot of other Japanese place in japantown, and I would not recommend here", "author": "Brian C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-13", "description": "Oh boy. Where to start. \n\nUpon arriving, the wipes tables smelled bad.\n\nFair enough, we're hungry, so focus on the menu. Plenty of Ramen / sushi / sashimi / rice dishes. Let's go for Ramen and Donkatsu.\n\nBad choice. The Ramen ($9) came with Chinese noodles in a thick, undistinguished sauce, with half of an egg and pork. I ordered miso broth but couldn't taste any of it. It had more the texture of curry than a ramen broth.\n\nThe Donkatsu was also disappointing. Pork and egg mashed together on top of dry white rice. \n\nWhat is it that Japantown has great Japanese stores but the restaurants are such a disappointment? Drive a few blocks to Tataki on California and Divisadero - MUCH better food right there.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-07", "description": "I think this location was bought by a very under-staffed non-Japanese family, who are trying their best but are some of the most harried, disorganized, stressed out, slow service people I've seen in any restaurant. The food is basically reheated J-diner classics that you can probably buy frozen from Nijiya Market down the street. Eh, it's food.", "author": "Ken H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-31", "description": "I went here with my family just to get some sushi. The service was extremely poor. The staff were rude. We couldn't get any servers' attention, couldn't order anything extra and were very rushed to leave.", "author": "Peyton W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-17", "description": "Really not very good.  I hate to say it because the servers were so nice but the taste and quality of the food was...sorry, just not very good. We had the original ramen and the Donburi.  Ramen was salty with no real flavor (strange right?) and don buri had cheap quality meat ( tough) just a big chunk of cabbage and one big slab of carrot.  Not authentic Japanese.", "author": "Monica K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-11", "description": "I've been here twice. Theres no wait. It's sort of hidden in a small hallway so I assume less ppl know about it. The service is attentive. The food is affordable, pretty decent and quick. I got the tonkatsu ramen each time. I recommend getting the katsu chicken/pork placed on a separate dish to keep it crispy as you eat the ramen. It's filling and tasty.", "author": "Tes Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-23", "description": "decent Japanese food! \nThe food is yummy but nothing that will make you WOWED from what I believe. The combos here are pretty good with prices as well. You can get your money's worth with decent amount of filling food!!", "author": "Stacey M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-29", "description": "Disappointing from what it used to be! I used to come here (when they were upstairs in the mall) years ago and always enjoyed a huge steaming hot bowl of udon. Now, the bowls are super small, barely much broth and a handful of udon noodles. The spicy tuna roll was your basic tuna roll with only 6 pieces and some spicy mayo dressing on top. The staff was rude and the waitress was only nice to us when she delivered the bill. We left hungry and annoyed... we will not be returning.", "author": "Erin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-09", "description": "I was going to give them 2 stars but after they charged us 18% service charge up front for table for four, I have to give them 1 star. We should have walked away when we noticed that they are the only one that is not busy. We got our table right way but we waited 20mins to find someone to take our order. I love Japanese food but the food here was not that good. It was hard to get service if you want to ask for something. At the end I requested to remove the 18% service charge because they don't deserve it and the lady gave me an attitude. Over all we had a horrible experience and we will never bother coming back to eat here again. I won't recommend going here. Just go somewhere else, it's probably worth waiting for table.", "author": "Albert R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-23", "description": "Felt extremely rushed in an almost empty restaurant.  Table cleared and bill given without being asked.  Rude wait staff.  Avoid", "author": "Harm L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-04", "description": "I had the chashu ramen, which the menu specifies that comes with 5 pork slices. It came with 2 (very thin) slices. The food presentation is very poor and the flavor is mediocre. On top of this they forcefully charge you 18% service.", "author": "Rod L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-05", "description": "Very disappointed in both foods and services.\nMy Zara soba was okey.  Fried Calamari was too salty.  My husband didn't like his chan pon ramen, I don't think we will be back and I wouldn't recommend this place to anyone!", "author": "Ryoko R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-20", "description": "Love eating here.. the employees, were friendly... good food also, can't complain.. wish, there was one closer to we're I live... just happy that we beat the rush (for dinner)... wouldn't mind coming back here again to eat....", "author": "LeAza D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Great food, really tasty. I didn't expect much, that was a really good surprise.\n\nGreat makis and tempuras. Gyozas are great too. Even the wasabi was a good surprise.", "author": "Sylvain D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "DELICIOUS free garlic hot sauce. Good Service!!! The food came out fast and the ordering was easy. My Chashu Ramen was very very flavorful and my friend really enjoyed him meal too. Yes they include a service charge so don't be offended, I'm sure it's to ensure that their waitresses are respected.", "author": "Sydney L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "The Chasiu Ramen and California Roll was good. The service was pleasant and the food was fast.", "author": "Pauline F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-24", "description": "Overall:\n\nFood:\nOverpriced and not even good.\n\nCustomer service:\nI have never ever experienced anything worse than I have at this place. \n\nMy party, who consisted of 5 People went to this restaurant because Japan town was jam packed, and this was the only place without a line. They seated us in the secluded part of the restaurant which we understood that we wouldn't get the best customer service, but our party was blatantly ignored by the workers. The workers would never come to our table and I had to walk up to them to get their attention. What really pissed me off was that the table next to us constantly had a worker at their table, and even after all the \"excuse me\" that said to them, they never came to our table or acknowledged us. I had to walk up to a worker again, just to get a refill of my water. When the other table asked for napkins, they got it instantly. I really get that the restaurant was busy and we were closed off from the main part of the restaurant, but the customer service my table received was completely different than the table right next to us.\n\nThe food here is mediocre at best. My friend order the niku udon with the eel rice, and after the first bite of the udon, he didn't touch it again. My friends all barely ate their food. $5 for a sauce bowl full of seaweed salad is way overpriced compared to any other Japanese restaurants I have been to.", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-11", "description": "When I get a craving for tempura or Japanese curry I make sure to come out here. This is the sister place to Mifune Don and Mifune which are also located in the Japantown area. \nI'm usually torn between getting the katsu chicken curry or the tempura Don. Both are super filling and always hit the spot. \nUsually the side is a salad with yummy peanut dressing or miso soup with tofu or egg. \n\nBeside the main entree I get a scallop and crab roll with a spicy sauce, which is always tasty that my companions always try to eat all of. \n\nThe Gyoza, calamari, and house salad are also good items to get. \nUsually the people I'm with end up getting the chicken teriyaki don or the beef ramen which they always enjoy. \n\nI like the atmosphere here since its down stairs and a bit hidden. Which makes it pleasant to have a convo with your peeps.", "author": "Em C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-27", "description": "Tried it twice, never again. Service was slow and food was terrible. The chicken in my donburi smelled rotten and my stomach has been a mess for days since we ate there. Didn't even finish my food it was so bad, and I was really hungry! \n\nHad to go to the counter to pay, no one came by to check on us while eating unless we tracked them down. It's obvious why this place never has a crowd. It's awful.", "author": "Consumer S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-09", "description": "We came here on whim, partially because I was so hungry and partially because we mistook it for another restaurant. Our fault.\n\nThe food was OK. Nothing too special. It was food nonetheless. I ordered the Salmon Teriyaki Dinner that came with miso soup, salad, and rice. Well... it was OK. The salmon tasted like it was baked and then just had teriyaki sauce poured onto it. Miso tasted eh. Salad was just bagged salad with some type of sauce sprinkled on it. Then rice was... well just rice. \n\nMy boyfriend had the tonkatsu ramen and well... it was OK too. Flavors were there but kind of missed the mark. \n\nBut what we did like was the beef skewers. It had a tad bit more flavor. Had a bit of a grilled taste to it. \n\nSo in short-- the flavors of the food that we had was is OK. Nothing too special. I felt like I could have made these meals at home with a blindfold on. The price for the food? Too expensive for what I'm getting. Not enough flavor for my buck. \n\nThe service was good. It was pretty slow when we ate here that there weren't really that many customers to wait on... so... I'm not sure if the service I got will be the same for everyone else.\n\nTLDR; Food was OK. Wouldn't come here again for OK food that is kinda pricey. Service seemed fine. We weren't auto charged gratuity like everyone else has wrote in their reviews.", "author": "Steffi P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-14", "description": "Affordable and not bad. Stick to the donburi, tempura and bento. The ramen was just ok. Didn't order but chirashi don at the next table over looked pretty good. Service was prompt and place is kid friendly.", "author": "Jake L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-11", "description": "We stopped in for some lunch.The servers were very nice and attentive.The food was great.Sake and sushi were superb.Only thing it can be pricey.", "author": "Biggy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-04", "description": "The food was ok at best and for a table of 3 they charged a 18% service charge and nowhere did it state they did so, they haven't before and that's why we go and now they do, they just lost a regular", "author": "Vivi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-03", "description": "I've only been here once, but I was surprised about the mediocre reviews. I had the chirashi and tonkatsu, and both were very good. The chirashi had a nice assortment of seafood (fish, shrimp, scallops) that was fresh and tasty. The chirashi rice was excellent. It tasted like rice grown in Japan (not Japanese style rice) -- which is hard-to-find in the US, and especially in restaurants. The tonkatsu was dark meat (which I prefer for its taste), and moist. I'd put in my top 5 for the Bay Area.  Seating was fast and we had a long leisurely lunch with no rush at all to finish. Service was OK -- the waitresses were surprisingly not Japanese -- but still fine. Similar to service in an American restaurant.", "author": "Joe Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-07", "description": "The food was really good and was ready very quickly. However the service was otherwise very slow even though the restaurant was not busy. I would recommend if you're not in a hurry.", "author": "Heidi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "After coming here for years I want to say to all of the haters this place is amazing.\n\nKatsu curry and soba noodles are F#*× delicious.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-14", "description": "I have never hated my dining experience so much until I ate here. My go-to spot for ramen is hands down Suzu Noodle House (which is next door). I was craving ramen on New Years day and of course Suzu was closed so I decided to give this place a try.\n\nThe restaurant was full when we arrived but we were seated immediately. And this is where it starts to go downhill... We sat there for 10+ minutes, waiting for a server to come by or bring us water, and nada! After awhile, a group of Caucasian folks seated next to us, got their water immediately and ordered their food within 2 minutes. We had to flag down the waiter that helped the table next to us to order our own food! At this point, I was already irritated by their services and the wait. \n\nWe ordered fried soft shell crab for starters and I had the seafood ramen. I was a little disappointed with the soft shell crab, it only came with one, the decor around the crab looks better than the taste. My seafood ramen had no wow factor. The broth looked oily, dark, and the overall taste of my ramen was bland. After we finished, we sat there waiting another 10-15 minutes for someone to come by and check on us, still no one bothered stopping by. Once again we flagged down a random server to get us our check! He dropped off our check and disappeared again for another 5+ minutes!!! At this point, I was furious and almost tempted to walk out and ditch the bill. Once again, we flagged down the server to give him my card to pay the bill, we also made a verbal complaint that the services we had was terrible and unacceptable. The server didn't care to acknowledge our complaint. \n\nOverall, I would NOT recommend this place to anyone! The food was below average, but worst of all, the workers here are slow, and inconsiderate.", "author": "Katie N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-15", "description": "My and a couple of my friends (5people) Came here to try something new but we regret it. The food is mediocre and the service is incredibly bad. When we finished our food we automatically got an 18% service charge. I'm like what service charge?? There's nothing saying anything about having to pay 18% upfront. Also we talked to the manager about the 18% service charge, she told us that if we had more than 5 people they automatically get charged without your permission. Ironically there's more receipts on the counter, I saw the 18% charge on all regardless of how many people you brought with you. This is the worst place you can possibly eat at in Japan town. It's not even worth going to if everwhere else has long lines. You're better off waiting in line than going to this place seriously. Save yourself from some bullshit and of course money.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-15", "description": "Don't come here. Basic food that is charged over priced. I talked to the manager about why they charge us 18% for Tip. When Tip is optional. They told us they charge \"mandatory \" Tip. Which is I find it illegal to just say you have to rip this much. And said 18% is min 5 people. But I looked at other person table which is 2 people and still charged them 18%. Not worth unless you don't mind them taking 10 dollar for free from you. And saying have a good day", "author": "Temo L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-02", "description": "18% tip was included already and they didn't tell me or ask permission. It was only 2 of us. Feels scammy. Glad I caught it. Never coming again. Food wasn't even good. We ordered \"tokotsu\" ramen and got miso ramen with tonkatsu in it. Least authentic \"Japanese\" food EVAR!", "author": "Jin D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-15", "description": "So if you do not have any clue on how to spend your money correctly this is the perfect place for you. Service is slower than the traffic SF. The food is overpriced and taste like it was straight up heated from a microwave. I talked manager about the overcharged 18% (non optional tips) and in the manager's own words, \"We don't charge 18% to a party less than 5 people.\" But there were 2 recipts in front of my face that read; 2 guest charged with 18% service charge. DO NOT ENTER UNLESS YOU REALLY HAVE NO CLUE HOW TO USE CASH!!", "author": "Ian L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-14", "description": "Honestly, the only good thing about this place is that it is not so crowded, so one star for that. My friend and I went here for lunch on a Saturday. We both ordered ramen. However, she didn't expect her ramen to be spicy and I didn't expect my ramen to be bland with soggy noodles and an overcooked hard boil egg. The broth was also too thick and the beef was kind of too touch to chew. Please save your money and time and eat elsewhere.", "author": "Charisse M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-21", "description": "The food is ok, but the service is bad. After we ordered our food, our waiter brought the food to us and tou never see him again, i have to wait until i finish my food and waited forever to look for him, so i decided to call receptionist guy to give us a check.\n\nAfter that we have to wait forever again to let them take my money and give me changes back, i still gave 15% tips even my friend said not supposed to.\n\nWhat is a bad experience about this restaurant", "author": "Steve Vu N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-21", "description": "Compared to the other places in this area, food was definitely below average.  We wanted to try it because some places with low ratings sometimes are pretty good to us.  Sadly, this was not the case.  Pictures out front looked different than actual food.  The most upsetting thing is that we received the bill for 2 adults and 1 kid and they automatically added an 18% gratuity.  They then took that away and left us with the portion to sign after we gave them our card which included a place to add another tip with suggested gratuities.  Good thing we looked carefully af the first bill.  CHECK YOUR BILL!", "author": "Cherish L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-31", "description": "Good Japanese restaurant for the price. I was looking for something to fill me up and could be found in Japantown, SF (since this is the closest to Japan I can go at the moment). It was very good food for the lunch special and I couldn't even finish it. My only two issues with this place is that the bathroom wasn't even in the restaurant (you basically have to use the dirty mall restroom) and the bowl only had a tiny bit of sashimi/ had entirely way too much rice. I would be nice if they presented chopped sashimi mixed in with the rice.", "author": "Payal P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-12", "description": "Went on weekend evening altogether 4 guests with 1 baby included.  Ordered ramen, chicken katsu with curry, bento box and couple appetizers. Waiting for the food was pretty long ... guess what. Ramen and other foods came first then the appetizers. It didn't appear there's a lot of people having dinner but still takes pretty long. Food was OK; no suprise. Portion was small. Service was soso. \n\nWhen our check came, the service charge was automatically added with 4 guess or more at 18% of the bill. Really? For a party of 4 and they charges 18%? Wow. I think it's kind of expensive for this restaurant with service being soso and we had to wait a long time for our food.   We should have known, out of all other restaurant in Jtown. This one with the least people. Should have check Yelp first before enter. =)\n\nI will definately not come back again. Thumbs down.", "author": "Andy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-08", "description": "Service was quick and polite on a Sunday night.  Water served immediately.  Chashu Ramen with shoyu soup was very bland and uninteresting.  No flavors in either meat or broth.  Dragon roll was well-presented but depended way too much on being doused in sweet/sour sauce.  Little real flavor or texture going on here, so overall I'd call it grocery-store average.  The prompt service saves a star.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-22", "description": "After nearly three decades of eating at Mifune, which was never especially impressive to begin with but had a lot of nostalgia value, I wound up here upon discovering it had finally closed. Ordered the tanin don, and while the beef was of decent quality, what they did to the rice should be classified as a hate crime. Waterlogged and mushy, it was barely even identifiable as rice, and it was nearly $14. As mediocre as Mifune might have been, they at least knew how to fill the rice cooker semi-correctly.\n\nThe only legitimately Japanese eatery left in Japantown is the lunch counter at Super Mira.", "author": "Nicholas J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-27", "description": "Thought we'd try out a new restaurant. Unfortunately the experience was less than satisfactory. Within being seated for 5 min they wanted our order. Like can we get a minute to take a look at the menu please, geez.  Anyway 20 minutes later they decided to come back to take our order. Okay so food comes and it's nothing to rave about. Nor do they bother coming back to check on us. Really?!?\nHere's where the one star comes in. I came with a friend, yes there were only two of us. The bill comes and there's an 18% gratuity on it! I'm like WTF! Okay I figure I can always change it when I pay. Again, the final bill comes and they fill out the tip- with 18% and tax so we can just sign. WOW!! Way to entice your customers to return!\nWarning, check your bill before you pay. Tip is not an automatic thing, if I thought the service was worth it it then maybe, but it was not so... Just be aware peeps!", "author": "Betty H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "I am not sure why there is a huge difference between the Mifune Restaurant in the main mall or the Mifune Bistro next to the bookstore, but the bistro is a million times better. \n\nThe family and I went the there for dinner on Sunday and was pretty surprise it was pretty empty.  We tried the other Mifune a couple of months ago and had a really bad experience.  I was rethinking about it but my mom wanted to try it out so in we went.  \n\nThe service was way better than the other Mifune, which was really bad.  This place came by eventually to take our orders without.  They came by with food in a timely manner, and came back to check on us a couple of times.  Not great, not bad.  \n\nThe food was good.  We had a California Roll for the kiddies.  It's a California Roll, no complaints.  The spicy tuna roll was good, instead of chopped up tuna, it was large chunks with spicy sauce.  The Rainbow roll was also delicious, nothing special, but not bad.\n\nBoth my wife and I order ramen from here.  The soup was really soup, I think they actually made at least part of the soup, instead of powder form.  There was a nice think film on top, a clear indication of house made soup base.  It was nice and thick, with nice handmade noodles.  \n\nPops had the nabe beef.  Looks good, he didn't complaint.  It had a mountain of food in, soup, beef, mushrooms of all sizes, tofu, udon, stuff. Came with sauce and rice.  \n\nMoms had a Japanese ribeye, which was the highlight of her dining experience.  So good and tender, couldn't help but try a little of it.  Came with the cast iron plate with veggies with rice and dripping sauce and flavored salt on the side.  \n\nYakisoba with steak was good as well, just like yakisoba from other places but the difference was the huge pieces of beef it came with.  \n\nOverall,. good dining experience, service could have been better, meh.  The food compensated for the lack of semi good service. \n\nSo, tip of the day, two different Mifunes in the Kintetsu mall, one in the restaurant row, DON'T GO TO THAT ONE.  Another downstairs by the toy shop, called Mifune Bistro, go to that one.", "author": "Bobby W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-17", "description": "Waitress held my soysauce tray and cash in the same hand with money touching my tray!", "author": "Bo X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-08", "description": "Ugh. \n\nBad ramen.\n\nThe end.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "I would say 4.5/5 actually\n\nGood food, decent price, nice service \nMany options of food including ramen, don, sushi, etc. \n\nI came here three times.\nFirst time I got a katsu don. Huge portion of katsu ALSO the rice...totally can't finish it\n\nThe second time I had a salmon chazuke. Still, lots of rice with only a little salmon on top.\n\nThe third time I came and had a tonkastu ramen. This time the food is in the right portion. \n\n\nFood always taste good. I can come here again, but with not much desire. Food taste good overall.", "author": "Sunny L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-03", "description": "With so many little restaurants inside the Japan center we couldn't decide where to go, so decided to give this place a try. I ordered  the mixed tempura,chicken ramen and seafood nabe. No flavor at all, a cup of instant ramen has more flavor than what we ordered. First of the tempura batter was flavor less  and the dipping sauce was useless because guess what no flavor. Now the ramen and nabe   Where just disappointing, like I said a 50cent cup of soup had more spice and flavor than these two. The seafood in the nabe bowl was clearly not fresh. The carrot decoration was still hard which means it had just been thrown in there. I rather spend 50cents at home than 45dollars in disappointment.", "author": "David N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-06", "description": "Auto added 18% service charge. Please check your bill to avoid double tipping. They did not mention this at all, some customers might not check their bill and just paid and tip again, maybe that's what they want (extra tips) but this is wrong, after 18% being charged, there's also a \"tip guide\" at the bottom of receipt, trying to confuse ppl who didn't know the service fee was already added to the total!!!!", "author": "Jenn J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-31", "description": "Came here for lunch with my daughters and it wasn't as busy as some of the other places in the mall.  It took three waitresses walking by us at the door before the last one acknowledged us and sat us.  She was so kind to give us the salmon teriyaki rice bowl for my daughter although it was a dinner item.  \n\nThe Tonkatsu ramen is not at all comparable to the ramen shops elsewhere or the one in the same level of the mall Suzu noodle.  The soup and noodles were bland and the egg was fully cooked without the soft yolk.  The chicken karage that one of my daughter had was average as well as the Sushi rolls.  \n\nIt took us forever to get boxes and the check .  The one who gave excellent service was busy at the front; therefore, I asked the other waitresses and neither of them came back!  We waited for 30 minutes after asking for the check in which I flagged one of them again.  They really need work on their service,  and I notice on yelp now that others have the same complaints.  I saw a family next to us complaining about the same.  The three stars is for the food and the service with the exception for the one that sat us and took our order.  She provided great service which I would give her five stars.  \n\nOtherwise, the three stars is for the service of all others and the food depends what is the order but the ramen was not at all comparable to other Japanese places.  I did not think a Japanese place could get ramen wrong but a first for everything.", "author": "FG L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-08", "description": "Came here 2 days ago for a ramen take out, and boy was that a huge mistake. The ramen literally smelled like cow or pig manure! It was so bad I gagged just opening the lid. I will not be coming to this place again. There was so many other options, but I just had to pick the most convenient one.", "author": "Cheyna V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-26", "description": "I really liked their ramen somehow and came many times. We came for lunch 2 people and we were charged for gratuity. I don't mind paying tips coz I m server myself but I don't think the menu says that gratuity will be added to all tables. Just because I m Asian you automatically add tips? Never coming back again", "author": "Ben S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-04", "description": "I was \"devastated\" when I saw the old Mifune had changed hands after @ 30 years!  Relieved when I found Mifune Bistro for lunch today in Building One on the first floor.  I didn't have any of the problems mentioned below in other reviews.  I ordered a new (at least for me) ramen soup with shredded pork and lots of veggies.  I loved it and would definitely order it again.\n   Service was fine--it wasn't busy.  I was alone so no added service on check.  However I probably tipped 18% anyway.\n   Same ownership.", "author": "Nancy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "Went here with my husband and daughter because we were all craving ramen. While there were lines in other restaurants in Japantown, there was no line here (probably because it was downstairs and out of the way?) Anyway, service was fast and food was very filling.", "author": "Jackie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-27", "description": "I love Japanese food so I decided to go to Japantown for some authentic meal.  My son really wanted ramen so this place had some of those options.  He loved it while I for pork cutlet with rice and sushi.  For me it was just alright.  Nothing fancy but not terribly.  I wish there were more options out there like sushi and shashimi.  I would not go back.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-17", "description": "The old lady with glass service is very bad and they auto charge u tips on the total. Please, Check before you sign. I don't recommend people to come", "author": "Carrie O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-08", "description": "As soon as we walked in, I already noticed that something is wrong with this restaurant. I saw a customer got up from there table and went to the front just to grab there own menus because no one gave them when they get seated. Anyway there food was not that good and the Service was terrible. I asked for fork twice because my mom was having a hard time eating her food with chopsticks but the fork never came. So my mom ended up not finishing her food. When they gave us our bill no one came back to pick up the check. We waited and waited and trying look for a waitress but most of them was too far to be called. so we just got up and paid at the cashier. I noticed that they automatically added 18% service charge for 4 people and when I asked them they said because they are so busy that they have to add the tip automatically. The truth was we went to this restaurant just because from that entire Japantown, they are the only one that doesn't have line of people waiting, the place was not even full and we got a table right away. In other words they are not that busy at all. The food was bad, the service was bad and they have a guts to charge us 18% service charge up front? WOW! No wonder people are giving them bad reviews... I will never come back to this place again.", "author": "Jennifer U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-12", "description": "Food was really not that great. The tempura had a weird taste and my stomach is pretty upset today. I really do not think I will ever go back. Bummer.", "author": "Carrie A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-26", "description": "Do not go this place, the worst restaurant at Japantown center!!!! And if you are planning to go, please double check your check!!!! They are trying to trying to double Tex on you!!!", "author": "Xuehua H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-25", "description": "This is definitely the worst Japanese restaurant I've ever been in the US. Food sucked, poor service, and really overpriced regarding to its quality. My unagi beef don was cold, the unagi tasted like some leftover just taken out from refrigerator and hadn't heated through. My boyfriend's Yakisoba tasted liked soaked noodle soup. The miso soup, which you couldn't go wrong, had ONION inside! Can't believe it! Our server couldn't remember what did we ordered, and didn't bring tableware to us either. I felt shocked that this business hasn't closed yet. How did they even survive in Japantown? unbelievable. If you don't want to torture yourself, there are a plenty of choices outside, don't come here. Don't make such a stupid mistake like me.", "author": "Joy Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-02", "description": "Took my friends from Sac here few days ago. To be honest, it's an average rating food. The workers are nice.We got our orders quick but the taste doesn't amaze me. I ordered the tonkatsu ramen, my friend ordered the special ramen (I think?) and my other friend ordered the donburi. We also ordered the karage and the calamari and a salad. Unfortunately, the salad was not good. Maybe it's the dressing that killed everything. I couldn't remember what the waitress said but the dressing was disgusting. I think it was mixed with vinegar and mayo and something else that I couldn't remember. We were seated pretty quickly on a Saturday night which was nice. Overall, it was an okay experience and I think next time if my friends want ramen, I would take them elsewhere around the area.", "author": "Monica W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-26", "description": "I ordered a bit of sushi which was just ok, the hamachi was too \"sinewy\" and the spicy tuna roll was nothing spectacular. The seafood ramen...ugh...the smell turned me off at first, then pushed through and keeping an open mind and palate. Nope, can't do it. I asked what the broth was made of and the waitress said pork bone. What???!!! Seafood should taste like seafood. The broth was thick, cloudy, bits of ground pork could be seen with my 3 small shrimp and thin slices of the fishy something. Just couldn't get past the broth and the taste. Sorry, never coming back.\nService was good though...hence the 1 star. Bummed :(", "author": "Beebs A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-25", "description": "Not bad, decent ramen for me. My husband and I come here on Sundays since it's on our way home from church, sometimes we'll come early enough before the lunch rush and service is great. When it's during lunch rush that's when you can tell the servers are in panic mode and it gets unorganized. \n\nNo biggie, I understand. But really wish they would slow down, didn't even get to order a soda because the waitress just said she would get me a water before running off. Chill!! Haha", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-30", "description": "The food was OK not bad but not great. \nWould have given maybe 3 stars for it. \nHowever towards the end of our meal WE SAW MICE running around under the tables. Yuck!!!\nWe told our server a young woman and she seemed mortified but when she told her boss it looked like he got upset and then glared at us as if we did something wrong.", "author": "Jeremiah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "As always excellent food and service, bit pricey but worth it. I had authentic tempura and three types of sashimi as a combo dinner for approx $25.", "author": "Mini S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-06", "description": "I am very upset right now!! We (3 of us) went into Mifune to eat dinner. When we got our tab, there was already a 18% gratuity charge on there. When I asked about the charge, the lady said \"you had a party of 5 right?\" I said \"no, only 3.\"  I looked at the other receipts that were at the cashier and none of them had a gratuity charge. She then stated that they will put an 18% gratuity charge if they think the customer is a tourist. She said that tourists don't know how to tip. I explained that I am not a tourist, that I live here and I know how to tip. I told her that that is discriminatory and it is just plain wrong! California is a very diverse state and how would they know who is a tourist and who is not. If you decide to go here, please make sure they do not take advantage of you. On the second thought, just don't go here.", "author": "Kim C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-23", "description": "Let's make it 3.5 stars for the really good customer service. (And hopefully I'm reviewing the correct Mifune restaurant...my friend and I dined at the one right across from Maido and some toy store)\n\nI love the display of food just outside of this restaurant...makes you hungry and lures you right in haha.\n\nAnyway, customer service is really nice and attentive, but when it comes to the food alone, it's decent, but not the greatest...\n\nOur orders:\n-Appetizers: Just a note, they serve a pretty generous portion for appetizers...I pretty much made a meal out of it...we ordered the fried octopus and fried chicken...karaage, however you spell it.  The octopus was over cooked...the breading tasted good, but the octopus itself was tough to eat to the point where chewing started to make my mouth hurt...we didn't finish it.  As for the karate, the breading was good and the chicken was nice and tender...it's fine without the ketchup.\n\n-We ordered Tonkatsu ramen and Chicken Yakisoba as our entrees.  My friend's tonkatsu ramen okay, but the noodles were on point.  I ordered the chicken yakisoba...tasted good, but again, nothing to blow my mind with.\n\n-The highlight of this lunch was when we were about to leave the restaurant, my friend decided to take home a bottle of Sake, so we bought a bottle for $10.  It turns out that the sake was to be purchased as part of your dine-in, but she was nice enough to tell us that since we already dined in and paid for our food and sake, we could just take it home.  How nice of her!\n\nThis lunch was a great start to our hours-long journey around the mall lol...", "author": "Zerrilyn P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-17", "description": "I think others should be warned off this mediocre eatery. My husband and I just had a unagi beef don (a specialty here) and a oyako don. Both were edible, but no better than that: soggy rice, nasty-looking beef, ditto, the chicken. The miso soup had such a strange taste that one sip was all we each took. \nIt is also not very clean and the help seems disinterested.\nWith so many choices in Japantown, this place is, unfortunately, not worth trying.", "author": "Melinda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-21", "description": "I've been here several times and I've always had a good experience here. My favorite thing to order is the sukiyaki nabe (udon). This noodle soup is flavorful and delicious and comes in an iron pot. We also had the chicken katsu curry and the chicken was perfectly fried and it went well with the curry.\n\nThe sushi rolls are a bit pricey. I've never tried their ramens.\n\nOrder right and you can't go wrong!", "author": "Ali F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-15", "description": "Scam charge. Presented as service charge 18%. Credit card slip comes and has a line for tip w suggested tip percentages. Deceptive. Waiter was not very upfront explaining charge when asked. Food was good but very disappointed with this tricky practice. No respect for customers. Not going back.", "author": "Marta M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-27", "description": "No! Sushi has to be fresh otherwise it will not taste good. Simple! Too bad because it is in a great location.", "author": "Kajal P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-06", "description": "Since this restaurant had so many locations within the same mall, I thought it would be a good choice to try. And they had some pretty decent lunch specials prices. \n\nService:\nThe service was professional and attentive. But seriously lacking in the friendliness department. Would a smile kill you?? \n\nTHE GOOD:\n-Ramen -- Soup -- The soup base was flavorful and pretty standard with other ramen dishes. \nCurry - The side order of rice with curry was pretty good. Although, it could have been a little spicier. \n\n\nTHE BAD:\n-Ramen -- Noodles -- I felt like the noodles were overcooked. It didn't give that satisfying chew and bounce on the tongue. \n\n\nOverall: \nI would recommend this place. Prices are decent and on par with their dishes.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "Testy noodle with soup. I ordered a steak with noodle soup. It is so good. The service is ok because it was peak hour when we walk in.", "author": "Kenneth D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "Mifune Noodle has been perhaps the most popular ramen noodle go-to place in Japantown.\nThey have had the two modest sit-down casual restaurants for a long time, and it's very good - and very inexpensive.\n\nNow, they have added a third unit, which is still in Japantown, but much nicer. The decor is upscale, and for those who enjoy a better ambience with their noodles, now you have it!\n\nWe like the hot soups, and they are all very tasty and very filling. Also the appetizer Chicken Yakitori was really good.\n\nSome reviewers put down the Mifune group for poor service or not-so-tasty noodles. For me, over 20 years, I've found Mifune to be a great resource for a tasty large bowl of delicious soup!", "author": "Richard T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-01", "description": "Mifune has a good variety  of dishes, including  sushi. \nPleasant  environment.  The service  is extraordinary,  and I enjoy   their  dishes.\nI recommend  Mifune. !!", "author": "Adrian S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-17", "description": "It was Christmas night and there weren't many options available so we settled for Mifune Bistro. Tried their Nabeyaki Udon which was served in an iron pot and it was pretty bland and disappointing. Overall the food was meh and the meal was pricey.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-07", "description": "The service was mediocre at best. Slow service even though I am sitting right in front of the register. The table next to our gets their refill of water of they dont even bother to ask if I wanted more tea. Completely ignored. They even charge a 18% gratuity. If they want tips they should work for it. Nothing is given to you, especially not this quality of service. Ramen was edible that was it", "author": "A A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-25", "description": "The one called beef shabu, it was horrible.\nBeef was stinky. I can just tell when they served us it smelled that something was wrong.\nBroth flavorless. Wonder how can they even make that broth. Noodle was worse. \nNevertheless service was awful.", "author": "Iris C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-03", "description": "Home made curry? \nThat's totally BS because I can make better curry than this shit.\nCya-Soba? BS too, because I can make better curry than this shit.\nI think that's enough for my BS review.\nBut, I do wish the place gets better.\nI really do hope so, for J-town's sake.\nI've heard the owner is an AH.\nWTF?", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-06", "description": "The food was o.k. The portions were huge. There is nothing really special about the place.  The customer service was good.  I was seated quickly and they refilled my water glass. I had the hiyashi (cold) ramen. I also had the vegetable tempura. Both dishes were well made. The portions were huge. The food tasted O.K.  They have a large menu, the interior design of the restaurant is nice. However, there is nothing special or unique about the food. Typical average mall restaurant.", "author": "Hiroshi K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-06", "description": "First time trying here was during the Jpop/Ramen festival event happening in Jtown. Ramen here is alright but I really do believe that I had better ones. We came here when it was 15 minutes before opening and there was already a line due to the festival. We got the window seats and proceeded to choosing our order. \n\nIt took them a while to check up and take our orders (we were one of the 3 parties that came in first from the line). Now, I don't know if it's because of the sudden influx of customers due to the events or that they're just warming up for opening but it took them a good 15-20 minutes to get us our food on the table. The waitress mistakenly gave me the wrong ramen bowl. No one on our table ordered it but the correct order was promptly given soon after. I ordered the Chicken Teriyaki Ramen w/ broth soup and while the soup was good, I felt like it was nothing too special. I was able to finish it towards the end and enjoyed most of it. Lunch specials there were kind of pricey as well.\n\nService was below average. Water was brought to us once and they never came back. We had to flag them down and play the waiting game. Waitresses didn't look friendly, no smiles. Tip was already on the bill I believe (not too happy about that). Overall, it was a slow service and an average ramen restaurant. With their price of $10 - 11ish ramen, I think there are better options in the area.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-30", "description": "We've been going to Mifune for years!  The Bistro and other locations are just as good.  Flavorful soup, generous servings, and attentive and friendly staff.\n\nMy son has been ordering the bullet train since he was a little one, but now he orders it and more items on the side to satisfy his 11 year old basketball and football playing appetite.  He ordered a side of gyoza and chicken kaarage along with his udon bullet train.  I thought this would have slowed him down, but it sure gave him energy for practice that night. He burned all the calories he consumed!\n\nMy husband and I ordered the nabeyaki udon.  It was delicious and flavorful.  So much noodles that my son ate some of mine as well!", "author": "JJAMZ C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-04", "description": "Casual Japanese bistro in the Japantown Mall Restaurant Row; this place really reminds me of tiny packed depachi-ka restaurants in Japan. Expect small tables close together and dependable mid range food. \n\nThe service was fast but a bit variable, I can see American diners being put off by that, however we stopped in for a quick bite before a movie at the Kabuki and loved it. Great soba, udon and tempura, croquettes are top notch. Ramen and chicken dishes seem to be avoidable.  \n\nThe place is packed on the weekends so if you want to eat here on a Friday/Saturday I suggest getting here very early. Probably not a great choice for a date you're trying to impress, sticky tables, loud background and super fast service don't leave much room for romance. For mid week / dinner with friends this is a reasonably priced fun stop in with comfort food favourites.", "author": "Amaya B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-08", "description": "Before I go into my brutally honest review, let me first say that my friends and I have to take partial responsibility for the poor service last night. For had we adhered to common sense and decided against dining at a restaurant that was more than half empty on a Saturday night, then this experience would not have even occurred.\n\nFive of us opted for the $20 AYCE shabu/sukiyaki. They brought out two pots (one shabu and one sukiyaki) for us, along with the typical meat, udon, veggies that come with it. The food was fine, there was nothing that was horrible, nor was there anything that was good, it was average. So why the one star? \n\n1) shortly after we started eating, the waitress asked for last requests as it was last call (partially our fault for going in near 900pm), we felt extremely rushed. \n\n2) We had to ask for our pots to be filled with water, we had to request a couple of times for our butane to be swapped out. \n\n3) our water glasses were refilled a total of one time. \n\n4) I thought the standing policy was a party of 6 or more for a restaurant to charge an automatic tip, when did it become 5 or more?! \n\n5) to charge a tip, you'd have to actually provide service, which was NOT the case at Mifune Bistro.", "author": "Long C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-11", "description": "Mifune is a hidden gem downstairs of the Kinokuniya building. The food is good and the wait is never too long. DO NOT get this place confused with the Mifune next to the garage entrance! This one is much better!\n\nThe food has great taste and doesn't burn a hole in your wallet either. My go to dish is either the Chicken Katsu Curry or the Chasu Ramen. The beef curry has a great consistency and isn't too spicy or powdery (if that's even a word?). It comes with half an egg and veggies. The Chasu Ramen is also pretty good here too. The broth comes out hot and the noodles are cooked great! Great taste for a great price.\n\nOverall, Mifune is a great restaurant! It's clean and the food is good.", "author": "Adam Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-01", "description": "This place sucks.  The food tasted horrible. My gyoza fell apart when I picked it up.  Wth???\n\nAfter eating there, I felt so sick.  The grease sat in my stomach.  \n\nThe service is so so.  \n\nThere are so many other choices in Japan town.  Go to any of them.\n\nSeriously, ugghhh.", "author": "Emma C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-10", "description": "I was surprised when I read the reviews of this place. I didn't have a horrible experience so 4 stars! \n\nMy boyfriend and I came on a Friday night around 8:40, it was empty so we got seated right away and service was attentive. \n\nWe ordered 2 miso soups and sashimi. The miso was really thick. Had a hard time getting it down. I liked how their miso isn't salty, but it lacked flavored. \n\nThe sashimi was so good and fresh! Melts in my mouth. And it was affordable!\n\nI liked how they had lots of food displayed outside their restaurant. That is what drew me in here!", "author": "Linh V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-08", "description": "I've been coming to Mifune for three years now.  It's always delicious and I would recommend anything from their menu. However, their wait staff can be quite rude some times and the wait on your food varies.  Sometimes it's comes right out, sometimes you're waiting half an hour.  \n\nOverall, for a place in the J-town mall, it's not bad. They also serve Japanese beer and sake.  If you want a sit down restaurant  inJ-town you can actually afford, come here.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-07", "description": "First time eating here.  The ramen was ok, had a slightly strange aroma, but tasted ok.\n\nTwo stars because as we were going up to pay up front, the cashier said as she handed me my change: btw that did not included tip. Tip! A tip is simply not given to everyone, rather one must earn the tip for the duty they perform. The cashier must have had the expectation that everyone should leave a tip. What she did not know was that I left my tip at the table. Anyhow, so the server ran to catch up with me and the cashier and she told the cashier in her native tongue (not Japanese btw) that I had already left my tip. The cashier then had a humiliated look and began to thank me. I think that it  is rude to antagonize someone about leaving a tip. If one does not get a tip, they should maybe reflect on what they did not do that did not earn them the tip. I may have to scratch this spot off the list.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-14", "description": "They accommodated Twenty five+ of us after 8:30pm on a recent Saturday night.\n\nOur immediate table of eight ordered miso ramen soup with the exception of one who ordered chicken teriyaki donburi.   Our ramen soup order came fairly quickly.  The donburi didn't.  \n\nWe were half way done before it finally arrived.\n\nGeneral consensus that the chasu miso ramen was good.   The chasu was very tender and generous slices of it.\n\nService was adequate for the large party size.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-12", "description": "Terrible service, below average food. Try the one upstairs (Mifune Restaurant is much better.) \n\nThe service at this restaurant was not only slow, but inconsiderate.\n\nI came here with a group of friends. We were seated very quickly, but the service just dragged on after that. I remember sitting there for at least 20 minutes before waiter came to take our order. I ordered a donburi, which is usually a safe option in my opinion. By the time my friends actually started getting food, I had already lost track of how much time we waited. When I got my donburi dish, almost all of my friends had finished eating (and they are not known for being eating quickly). In addition, they forgot to give me the miso soup that was included with the dish. I had to flag down a staff member to remind them. \n\nThe worst part of my experience had yet to come. I was about a third of the way through with my dish when they pushed a check onto our table. They expected us to leave after giving me my dish approximately 5 minutes ago. Also, they automatically calculated an 18% gratuity into the bill. I know this is standard practice for larger groups, but I do not believe this level of service deserves it. We paid the full amount anyway.\n\nI was so disappointed with the service. The food seemed to be cooked in a rush and the staff was very neglectful of its customers. Don't come here. I had way better food and service at Mifune Restaurant, upstairs.", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-19", "description": "I haven't come across an establishment with reviews that seem to be all over the place as much as Mifune Bistro. There seems to be an even number of 1,2,3,4,5 stars all with different experiences with service and food. \n\nMy dinner here wasn't bad. At all. My bowl of ramen was actually pretty decent: chewy noodles, good broth, nice sized portions, our water bowls were constantly refilled and servers always seem to be available. We arrived somewhat early for dinner so that may explain the attentive service we received that evening. \n\nThey also offer shabu shabu and a variety of other Japanese fares which I may try on another visit.", "author": "Esther A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "We are regulars here because we get great service from the staff of Thai women who take orders and bring the food to the table. The comfort food at this restaurant is very flavorful and the surroundings are very clean. The cooks do a nice job but I think the strength of this bistro is the terrific teamwork among the women staff in sharing work duties and interacting with customers. They deserve  a grade of A versus a D or F at the sister Mifune restaurant upstairs in the mall.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-18", "description": "The lunch time noodle sets served till 5 PM are a good deal. Choose your noodle (udon, soba, ramen) and a side dish for $10.95 - $12.95. Green tea is complimentary. The regular menu has various hot and cold noodles.\n\n* Chasu ramen with curry rice ($10.95) http://www.yelp.com/biz_photos/3EY5OUzqoUPln2IRlXvmzQ?userid=NOUfyJW-BAo_-Cbfo8edww#xg3Ma12RalK0L34EO26HMA: With the ramen, you have a choice of broth, miso or shoyu. The miso broth was piping hot, creamy, rich and surprisingly not salty. The noodles were firm and straight. I liked the broth but the toppings were mundane - 2 slices of chasu (lean, somewhat dry, not that flavorful), half a hard-boiled egg, bamboo shoots, bean sprouts, cabbage, scallions, and 1 slice of fish cake. \n\nThe curry was thick, creamy, smooth and had a sweet, fruity flavor. The pickled onions were an interesting touch. The set also came with a small dish of pickled vegetables.\n\nThe décor is soothing with dim light, red and black, a fountain and lots of partitions for privacy.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-08", "description": "I went to eat here with my family after shopping around Japan town a couple of days ago and I was excited to eat here because they had legit ramen. I ordered Ramen that has shredded beef and one tempura shrimp and when I go it, the broth looked colorless like it seem like it tasted good and the ramen I self didn't look appetizing. I finished it and was just disappointed about this Ramen. I expected this to be better than top Ramen but I honestly would rather have top ramen cup of noodles over this.", "author": "Ben Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "Nice place in Japantown and reasonable prices.\n\nFood was delicious.  Enjoyed the sushi and the miso soup.  Also good Ramen Bowls.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-08", "description": "Food was not good. I order the lunch special combo. I ordered the ramen with a side chirashi bowl. The fish in the chirashi bowl was not as fresh as I wanted it to be.\nThere was scallop in it and it was weir and slimy. It just didn't taste right. I also ordered an appetizer of croquette. It was $7.50 for two freaking deep fried mash potato things. I was expecting there to be a bigger proportion. Service is very slow. Worst of all they forgot to bring food for someone else that was with me. They were not being attentive. They barely checked on us and they did not even realize we were missing a plate. It took at least 20 minutes to flag down a waitress to inform her. She was not urgent about getting us the food either. So my friend just had to cancel the order because the rest of us were done.\n\nNot good food plus terrible service= never coming back", "author": "Dilys Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-15", "description": "Miso soup very fishy. Spicy tuna roll did not have much tuna and not great. Tempura and chicken teriyaki decent. Also pricey. I would try another place in the mall next time.", "author": "Loretta M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-04", "description": "The wife and I were visiting SF and craving some ramen. We ended up here, ordering an order of gyozas and a California roll to go with. The ramen was alright - yes, just alright - but the kicker was the gyozas and the service. Took a long time to get the order placed, even though the place wasn't busy. \nThe ramen and roll come out, followed by the gyoza appetizers about 8 minutes later. The gyozas were obviously frozen, slapped on the grill as a stack, grilled until they developed a blackened char on one side only, then served. The appearance was questionable, but we pressed on with eating it. Never would we send food back for replacement, so we left all but the 2 pieces we tried and when the check was brought (the next time we saw our waitress after having been served!) we advised of the issue and asked that they be removed from the bill due to the inedible nature of them. They provided us with a 10% discount instead, a whopping four and a half bucks, which was only half the price of the gyozas. \n\nOverall staff wasn't friendly and it wasn't clear why they're in business - it didn't seem to be to serve good food to satisfied customers. If I were a local, if not come back. Since I'm not, I caution you to find a friendlier place with better food.", "author": "John F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-31", "description": "MY GAWD. Alright, first off, I am assuming the reviews above two stars are only written because they've confused the BISTRO with other ramen houses in the area. This is honestly the worst place I have ever eaten. Just look at my reviews! I'm a pretty damn positive person, who has obviously worked in the service industry in the past....Not  that it qualifies me in anyway, but I do have compassion! The waiting list is a joke, and totally unorganized. They are constantly short staffed- if youre gonna work in Peace Plaza (its a bit more touristy than you think) you need a better game plan. \n\nAfter finally being seated, no one even acknowledge us after 15 minutes You bet I waited patiently-even after a few tables that had been seated after we were, had their orders taken. The food arrived in a timely matter, the only positive point I get to leave. \n\nThe food was horrible. Kebabs were alright, but even my six year old can dump a bottle of teriyaki on some burnt chicken thigh. The ramen was disgusting, with sloppy mushy noodles, The cuts of chicken, in the egg soup, and \"meat\" in the pork ramen were questionable, as were tastes. I found a total of three hairs (not from my head) near my seat alone. \n\nIts a pity, the atmosphere/ambiance is so nice, I wish they would take more pride in their cooking. I hope to never ever have another experience like this again- trust in Yelp!", "author": "Rosemary W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "Just had lunch here it was pretty good. Had a ramen lunch special. Service was good. Server came by every 6 to 10 minutes to ask if everything was okay and to refill our waters. The food price was also very good.. got two lunches in under $30.00.", "author": "Benjamin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-24", "description": "shabu was very very bad. \nthe soup base was just hot water.\nthe beef tasted like cardboard.\nthe Napa cabbage had a bitter taste.\nservers never checked up on us.", "author": "Ken T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-27", "description": "Waited for more than an hour for our food and is still not here. I think the waitress was biased to other people because the people that just came already finished their food. Poor service!", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-24", "description": "I ordered some chicken dish with noodles. I figured that would be safe. I'm not really a fan of Asian food. It tasted gross. The broth had a strange flavor and the chicken was even worse. Unfortunetly, Benihana was full.", "author": "Suzanne D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-16", "description": "The waitstaff are pleasant, so this review excludes their sincerity. The health score is 83, the paper is hidden down low behind the cash register. I wish I saw that before I ordered some sushi, but then again, I don't really know what got into my head for even thinking about ordering sushi here. This place serves run-of-the-mill Japanese dishes of which most are mediocre at best. Yes, some dishes are good, many of so/so, but the sushi was some of the worst I've ever had in my whole life. I guess it's better than the empty space that use to be here, but not by much...", "author": "Brian J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-10", "description": "Lunch specials here are very decently priced -- about $8 or $9 for a bowl of ramen or udon noodles. $11 for noodles with either unagi rice or California rolls. Service is a little slow but generally a good deal. Would recommend coming early or late to avoid the lines.", "author": "Shirley L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-27", "description": "Cold tired and hungry, i walked into mifune bistro bc it is centrally located in japan town w signs referencing its history of making their own noodles for 90 years + a wide selection of appetizers, sushi, dons, ramen, etc.\nI asked the server what i should get between the chirashi bowl n their charsiu ramen n she said definitely the latter.\nBig sad face.\nI've never had charsiu ramen with hard to chew/dry n harsh pork slices. \nBland but oily ramen soup. \nUgh i am sad for having consumed so many calories that were hard to chew n unsatisfying. \n\n2 stars only bc ive to sit here for another half hour til my friend gets off work to meet me.", "author": "daisy k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "Pleasantly surprised by the quality and value at Mifune Bistro. Lunch special $12.95 your choice of ramen/udon/soba + gyoza/calif rolls/curry rice. Service was good. Decor, updated/modern. All in all, well executed.", "author": "Stephen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-08", "description": "I only come here for the Coffee & Cake special and sometimes I'll order a side of a small bowl of donburi. You get a pot of tea or coffee with a dessert of your choice and it's something different every time but I came here so many times already I know practically everything they have.\n\nNot a fan of the regular menu though--doesn't taste authentic at all.", "author": "Glo D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-20", "description": "When I first walked in (we came from the street side) I was a little confused as there was no one there to greet us. But eventually someone came out and we were seated.\n\nWe came here because I was in search of a schnitzel, however since all the German brunches were closed and we couldn't find any schnitzels, Katsu had to do.\n\nI ordered the Katsu Curry (pork) and it hit the spot. On top of that, the portion size was pretty good. It came with a salad and miso soup along with the Katsu. Overall this restaurant wasn't bad, and I had no complaints. But it's not somewhere I would go everyday. It was a nice snack place and onto the next spot that wasn't so memorable.\n\nI do want to mention though, inside the decor and ambiance was very relaxed and decorative.", "author": "Bruce K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-03", "description": "I think this place suffers from the same mall syndrome as every other place in the building, they know as long as they seat people quick enough, they'll have customers all day long. It doesn't matter if the food is good, they just need to turn tables over. \n\nFood: What they lack in flavor they definitely try and make up for in portions. We ordered a chicken ramen and a curry pork katsu ramen. The chicken in the chicken ramen was a smoky and grilled, but had no seasonings whats so ever. The noodles were a little thin, not quite springy or chewy like good ramen. broth was decent. The pork katsu was the best thing, with a  good vinegary katsu sauce. The curry was watery, and far from spiced. \n\nService: pretty much the only reason this place gets their stars. We were seated super quickly even though there was a wait, water was magically filled every 5 minutes, and there were plenty of waiters.  \n\nConclusion: If you absolutely must eat in the mall, on a Friday night, in the next fifteen minutes, you could go here. Maybe.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-24", "description": "I'm hardly a ramen connoisseur, but I'll rate Mifune on what I know.  \n\nChashu Miso Ramen:\nNoodles: Chewy and pleasant\nBroth: Tasty, but not overly salty.  Did not leave me feeling thirsty in the hours after eating.  Also arrives without any spiciness.  Chili oil and seasonings are available on every table, so add to your own desire.\nMeat: The most soft/tender slices of char sui I've ever eaten.\nBowl size: Perfect. Was large, but was still able to polish it off, albeit leaving me with a big food belly.\nPrice: $8.50. Pretty damn good for a Japantown establishment.\n\nWe were seated quickly, served quickly and were out of there in no time to catch a show at the Sundance Kabuki Theater right next door.  No gripes about this meal!", "author": "Heidi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-16", "description": "I decided to check this place out while walking by on Sunday at 1:45, and the place was completely packed. I wanted to make sure to eat somewhere good so my boyfriend and I decided to wait in line for a table. I'm glad we did! Their service was a bit slow, but the food was very good! I will definitely be going there again.", "author": "Amanda J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-22", "description": "Quick service ... Very impressed at first. But after trying lunch meal  ramen soup combo, threres an unusual smell and taste . Kids never bothered to finish meal. Donburi meal is dissapointing too. You know meal is freshly made and good when they take time before you get your order. Not very satisfied and will not come back. Just an honest personal opinion and experience.", "author": "Ivan V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-22", "description": "I've only eaten here twice, and NEVER AGAIN will I pay good money for shitty service and food to match.\n\nThe first time I came here with 3 friends, and we were seated right away. It wasn't too long a wait for our orders to be taken, but the wait for our food was ridiculous. Without exaggeration, I believe our wait to be near an hour for our food. Another family was seated next to us about 20 minutes after we arrived, and they received their food probably 15 minutes later. Um... seriously? Well, was the wait worth it? I guess. Or maybe I was too hungry to attempt to taste my food properly. Well, the gyoza was atrocious, anyway. We had fun chatting while waiting for our food, so the first experience wasn't horrible.\n\nSecond visit.\n\nI came with a party of about 8 people. The same waitress that took our orders as last time was our waitress again this time. I was sitting near the end of the table while she was on the opposite side, about 2 people between me and her. She was waiting for my friend next to her to order, and since he was still undecided, my friend beside me asked if he could order. This b*****, WOW. She gave him a dirty look, then pointed at my friend who was UNDECIDED on what to order, then went back to staring at my friend. WHAT. Can you be anymore rude to a paying customer? \nI ordered niku udon. Okay, so at the expense of sounding conceited, I can whip up a niku udon that actually tastes good. Well, not to say this was BAD, but there was something a bit... off about it. I can't quite remember what it was, since this was several weeks ago, but I really don't want to go back to try. \n\nThey separated all the checks for us, but I should've questioned mine, since it looked like it was about $3-4 more than what I ordered, but I just wanted to get the hell out of there. I really regret leaving a tip as well. I will always leave tip, even for carryout if the employee is nice, but WHY I decided to leave a tip this time was beyond me. Maybe because the lady was standing there watching me write on the receipt to see if I'd leave tip or not. Whatever, I only left her a dollar. \n\nI HIGHLY suggest to STAY AWAY FROM THIS RESTAURANT. There's 2 other Mifune restaurants in Japan Town. Visit either of them for even an ounce of decency from the staff. I will NEVER come back to this restaurant.", "author": "Katie F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-11", "description": "This place has bad customer service.  I wanted to order more drinks and food and they came to me with the check.  They then had to redo my bill and didn't even give me refills for my tea.  The place isn't even that busy or packed.  The waitresses don't even make any eye contact with the customer.", "author": "Ro O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-11", "description": "I'm not sure why this and the other Mifunes have generally low reviews. I think it's a solid place to get a light, tasty meal for a reasonable price. I ordered the cold soba chirashi. I love chirashi but have never seen it over anything but rice. Over soba is a genius idea! Great noodles, and the chirashi variety was great - tuna, salmon, scallop, shrimp, squid, egg, all cut pretty thin but there was definitely enough of it. There are a couple of other interesting and appetizing menu items I'd like to try next time.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-18", "description": "Love this place. Come here randomly after hiking. Craving for some Japanese food. We had the daily special seafood ramen with CA roll. Yummyumm ^.^", "author": "Sharon L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-08", "description": "I've been here occasionally over the last 5 years or so. Today i was really disappointed and will not come back. The servers were not friendly and did not check on us. The rainbow roll only had 2 thin slices of tuna that were not flavorful or fresh. They forgot the shrimp tempura on the udon. When we told the server, she didn't apologize or offer anything changed the shrimp tempura was brought out but that was it. The soup was too salty too. It's too bad the service and food quality has gone down.", "author": "Leana L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-06", "description": "Food was alright. I got chicken katsu donburi w/ egg & onions and my boyfriend got cold soba. Nothing special. I could've made that at home... Service was slowwwww. I understand that it was busy but that's no excuse for the lack of service. Probably won't be back. There are better places to eat in Japantown", "author": "Lydia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "Was originally going to dine at their upstairs restaurant Mifune in Japantown and saw that there was a bistro version of the restaurant on the first floor \"under the bridge\".  The menu had a lot of choices and the service was great. The server was very courteous and always checking on us to make sure we were pleased with the service. Had the Nabe noodles in the iron pot and the food and broth were great. Only thing I wish they had was a bit more selection on spices, sauces to add more flavor. Would definitely eat here again next time we visit Japantown", "author": "Richard F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-18", "description": "Reading a few of the bad reviews I will admit the service was not that great but I'm used to bad service in Asian institutions, but ultimately food conquers the senses and that must be the most important criteria for any FOOD place.\n\nIf you could get pass the subpar service which seems like many people cannot get passed, note to them: shut up and eat, in the Asian culture we give less emphasis on service and more on taste! These people would not make it  5 minutes in a good pho place.\n\nI ordered the beef/tempura ramen, and my GOD it made me see colors! It was served in a molten hot cauldron to insure the longevity of flavors. The broth was rich but not thick, the noodles had a nice chew, the tempura was amazing, the fish cakes sublime and the balance of vegetables was spot on. I loved the idea of a hot metal bowl because ramen changes flavors when cooled down, almost bitter so I liked that idea and wished more places did that. \n\nReally great place, I wish they had one in San Jose, because they would make a killing.", "author": "David N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-21", "description": "The plan was to go to Ramen Fest but seeing the line that wrapped around the block at 10:30, we went with plan B. After passing the food trucks, which were temping, we ended up at Mifune. Pretty good lunch combo of  miso chasu ramen with gyoza. The meal was much larger than it looked.  The ramen broth was nice and rich without being greasy and fatty. There was a lot of ramen in that small bowl. I ended up only eating one of the five pieces of gyoza since I was already stuffed.  Not bad for $12.95.", "author": "Heather G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-28", "description": "Okay service, bad food, okay atmosphere. Our waitress was placing our dishes on our table, and she couldn't reach my friend at the end of the table, so she asked him to take it and set it down himself. I understand that she was in a tricky position to properly set down the bowl, but we were all shocked to be asked to \"take it and set it down [ourselves].\" I orders the spicy tuna roll, which was okay. My friend's tempura don was all soggy without a trace of crispiness. My other friend's unagi don only had two slices of eel on it. And don't even get me started with the miso shiru..... It was SWEET and tasted like yam with a strange, dung-like aftertaste. I hate to say it, but spare yourself the trouble and please find a better place to eat!", "author": "Taehyun P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-03", "description": "I've eaten here several times when my favorite restaurant is closed or if I just want a quick bite to eat.  Mifune offers the cheapest ramen in Jtown.  The location is not that obvious and it is seldom crowded.  The food is ok; not awful, not great.  Most recently ordered a chicken terriyaki ramen.   The chicken was overcooked and did not have any sauce on it.  The miso broth was flavorful and had enough other \"stuff\" (including a hard bowled egg) in it to fill me up. Mifune is a good place for a reasonably priced Japanese meal if you are looking for a quiet and uncrowded place to eat in Jtown.  I haven't tried the sushi here.  There is no sushi counter visible and I would never eat the sushi unless I could see if made.  Do so at your own risk.", "author": "Martin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-09", "description": "-same excellent decor & service\n\n-This was an after-Asian Film festival (There Once Was an Island) nibble:\n\nSpicy ramen in Miso broth, the komoboko still tastes like real fish cake.\nCurry Beef  Stew on ramen, no broth\n\nYUM.\n\nHowever, the new discovery on Irving Street is now in #1 position.  .  .  pork belly always wins!", "author": "Clifford L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-10", "description": "I scarfed down a quick dinner before a massage appointment nearby.  I scored with the special menu they have before 5PM and had the wakame udon and gyoza.  The udon noodles were so tender and fresh (I understand they make the noodles onsite), and I loved it with the seaweed.  Very comforting!  And the gyoza hit the spot, steamy, tasty good.  Thank you, Mifune, for taking my order, feeding me and bringing the bill by so quickly so I could be in and out in time for my appointment.  I will be back for a more leisurely meal soon!", "author": "Maile N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-06", "description": "My friend and I went to Japantown because I was craving ramen. We looked around and even yelped ramen location in the area. Eventually we settled for Mifune, I ordered ramen while my friend ordered sashimi. We had edamame because they're my favorite. Overall good service because the staff was very attentive. Food wise, I felt it was alright. I meant my ramen wasn't spectacular. My friend's sashimi was good, I didn't really get to try much of it so I can't really say.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-19", "description": "Ate here today for lunch and really, quite excellent service and good value. Portions are quite large and the food quality is good. I had the ramen lunch special with California rolls.\n\nEnvironment is nice also.", "author": "James W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-08", "description": "Horrible service and mediocre food. Had to ask for everything ... even to order. The people in here are not excited to be at work.\n\nJapan town really doesnt seem to be the best place for Japanese food.", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-21", "description": "terrible food. unfresh and stringy fish. the worst excuse for a squid ink pasta i've ever had. the noodles were gray and tasted sour. the hamachi sashimi had veins running through every slice. and it was not cheap for the poor quality served. the service however, was very nice. now i know why the restaurants next door have lines out the hall and this one is rather empty. i would avoid, don't say i didn't warn you.", "author": "Charmaine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-18", "description": "I got the vegetable mountain ramen here, and it was pretty good.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-25", "description": "Food is below average. Service is terrible. Waitresses are not helpful, friendly, or welcoming.", "author": "Clarice L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-19", "description": "The food is okay. It's kind of like an average lunch place you'd go to satisfy your hunger. I would go back to try more of the food, but I've had better.", "author": "Jenna R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-19", "description": "I ordered an unagi donburi and I wouldn't say it was the best. It had a tinge of fishy taste to it but when I had spread the garlic all over it eliminated the fishy taste. As for service, I couldn't really complain as we were the only ones eating in the restaurant. All in all I gave this place a 3 stars. Not that bad of a place to dine in.", "author": "Rajee S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-10", "description": "***DECENT JAPANESE RESTAURANT, NOTHING SPECIAL***\n\nI have been here for business lunch meetings and I have not been impressed.  I was disappointed the first time and I thought if I came back a second time things may be different but I was wrong. \n\nThe green tea is water down and flavorless.  The sunomono is supposed to be a mix of seaweed and octopus.  I could count the pieces of octopus in the sunomono on one hand. \n\nI have not had any rolls but I have tried the various nigiri pieces.  The fish is of average to slightly above average quality, and the cut is not generous by any standard. \n\nAlso, and this is mind boggling: Mifune does NOT validate parking for the garage which is underneath the Japantown Mall where this restaurant is found.  \n\nI would not recommend this restaurant.  If you can settle for a quick snack, go one block over on Post to Nijiya Market and grab some pre-made food.  If you want a hot, fresh meal, head upstairs in the Japantown Mall and go to the restaurant located on the bridge.", "author": "Ravi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-26", "description": "Pretty good meal here, above average.\nThe soba was good which they are known for. \nThe salmon terriyaki was a very small portion for the price they were asking.\nI will come back as JapanTown doesn't have any restaurants greater than 3 stars except for Dosa which is 4-5 stars.", "author": "M E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-30", "description": "When the main Mifune restaurant is packed with a line out the door, come to this one.  I've been here twice, and never had to wait.  They have a nice lunch combo.  The udon is quite good, and I ordered it with a mini chirashi.  My main complaint is that I have never had a piece of sashimi that has been sliced so paper thin before.  I suppose you get what you pay for, but it would have been nice if the sashimi had a little more substance to it.\n\nOverall, seems like a good place for a light afternoon snack.", "author": "Jimmy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "It's a bit overcast in San Fran today. And there's a street fair here in Japantown. Wife and I weren't turned on by the street vendors so we stopped in here to Mifune bistro. Glad we did. Lunch special $13 each with more food than we can handle. And it's so delicious. Soup and a choice of a side. So so sooooo yummy. Love every minute. We will be back. In fact... I can't wait to come back here!", "author": "Ralph A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-22", "description": "It was just OK. The food was decent but nothing great. \n\nThe waitresses were not very happy or helpful. The price of the lunch special was reasonable but the food is forgettable.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-26", "description": "tl;dr: good food, good value and good portions, but terrible service makes it not worthwhile.\n\nCame for lunch on a crowded Saturday in Japantown.  We came here because there was no wait, and the food looked reasonable enough.  \n\nOverall, the food was pretty good, with a fair price and sizable portions.  I liked the chicken teriyaki ramen here - the teriyaki flavor was a good combo with the rest of the ramen flavor.  \n\nService was awful, though.  It was impossible to flag a server in the back corner where we were sitting.  One of my lunchmates physically got up to get a server to take our order.  They were even quite slow serving us our one drink (which was a Coke out of a can!).  Then, at the end, gratuity was already included for our party of five.  That seems like a fairly small group to get pre-included gratuity. \n\nWouldn't recommend solely because of the service.", "author": "S L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-10", "description": "OK, the breakdown is 2 stars for the food, but an extra star for the service and ambiance. It is serene and easy to get a table. The service is prompt and courteous.\n\nI can always count on being able to get a table and basic food quickly and efficiently. However, there just isn't anything that special about their food. There is something missing in the soup broths--can't quite figure it out. Maybe not enough soy sauce, or the dashi is a bit thin? The noodles are clearly packaged, the same kind of stuff I throw together at home. If you want handmade noodles, go to Sanuki on the other side of the mall. The ramen and croquettes are passable, but there are plenty of places that do it better for the same price or less.\n\nI like the greens salad served as a side to various dishes, though. Other details like the side dish of pickles was odd--julienned namasu (carrot and fresh daikon radish pickles) was mixed with julienned takuan (the yellow radish pickles), the water used to brew the tea was too hot so the tea ended up a bit bitter.\n\nI can say that this Mifune is better than the one upstairs.", "author": "和子"}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-22", "description": "Very happy with every experience I have here. Nice quiet setting and good decor. Servers are all very gracious and give you plenty of time to decide and privacy, but also just attentive enough.\n\nI usually come here for ramen. I get the vegetable ramen. Fresh veggies and noodles, and a broth to thoroughly enjoy!! One of my favorite places because of the broth. Wish they had thinner noodles, but that's alright. A great amount is provided too. A lot, but if you have time, worth finishing.\nFriends I've gone with said the meat dishes and sushi is fairly good too! The plating here is so pretty and elegant for a simpler place. Everyone here is nice, be sure to ask questions, they will help!\nThere's also a separate section that's a bar, more lounge-y I suppose. Wait is never too long. Get a pitcher here! Decent beer, light and will definitely help with spicy ramen. (:\n\nKitchen closes at 9:30, servers are very nice at making sure you get a chance to order enough food before then.\nThey also have shabu-shabu, which I haven't tried yet.\n\nOverall just a nice place to eat some ramen. See a movie at Kabuki close by, or look through the Japanese bookstores and stationary stores in the building.", "author": "Sophie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-26", "description": "Ordered a chicken katsu curry and found chunks of beef in it?  Just found it a little strange, since it's supposed to be chicken.  The curry was decent, but the service here was almost non-existent.  They didn't refill our water cups, and I actually had to get up to ask someone for tea. They also didn't clear out any of the plates so the table was really crowded and messy.  We actually walked by the restaurant 30 minutes after we had left, and the table still wasn't cleared.  I guess there's a reason why this place was empty compared to the rest of the restaurants in Japantown.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-31", "description": "Food was just ok. Oyako Don was reasonable. The Miso soup was a downer - one of the worst I've had. Wouldn't go there again.", "author": "Anwar H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "Walking around Japantown, we saw a sign for all you can eat shabu shabu, which our group totally is in love with.  We decided to go there, and fill our bellies with tons of meat (and some veggies too).  It was a lot of fun, we all miss the shabu shabu in Japan, but this sufficed for the time being.  We got all you can eat beef, all kinds of veggies, rice, and edamame.  Awesome.\n\nIt was pretty decent, especially for only $25 a person.  I really liked how many other little things they gave you besides the beef and basic veggies.  I'll definitely be back.", "author": "Jenna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-21", "description": "I've probably been to Mifune Bistro nine or ten times in the last year, and I like it. The food I order is usually pretty good (not the best I've ever had, but it's solid). \n\nI usually order the same things -- ramen (spicy or miso), katsu curry, gyoza, or hiyayakko tofu. My favorite is the hiyayakko tofu. You get four cubes of cold tofu, two with chopped tuna and tomatoes and two with shiso paste and seaweed. \n\nI don't like the miso soup (they put carrot in it and it's kind of weirdly sweet) or the seaweed salad (too slimy). \n\nI've never had to wait for a table, there are partitions so you have plenty of space, and it's a large restaurant so it's good for groups. When friends come to visit me at work (I work in Japantown), I usually bring them here for lunch or dinner.", "author": "Annie K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-18", "description": "First time here and was seated right away. Had their lunch special for $11.25 which came with a side that was Niku Don with my Chashu Ramen. My ramen was pretty typical, the egg had no flavor but was still filling. My sister had their beef shabu for lunch for $14.95 and it was basically an udon bowl with the beef already inside, which kinda ruins the fun of shabu where you cook it yourself. The soup base was really plain and my sister wasn't happy with it. If we were to ever come back, we will try something else but the ramen and beef shabu is a no for us. Otherwise, the staff is attentive and the restaurant is very spacious with our own booths, but the food isn't anything too special.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-05", "description": "Too expensive. For an example: The bento box is like $21.00. I'm used to it being like $15-16 elsewhere.  The waiter/waitresses didn't come often to collect empty/dirty plates.  The food was good, but still not a place I will come back to.", "author": "Jocelyn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-08", "description": "Don't do the shabu here, they're not experienced at all! PROs: good sauces, good meat and fresh enough veggies. CONs: slow service, no flavored soup base, pot never boils, you offer ponzu sauce but you don't have garlic, cilantro etc. Mifune, you're like giving a feening person a cigarette but then you turn around and tell me there's no lighter", "author": "G L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-31", "description": "Try to find an affordable, good japanese resturant in japan town.  Then we came across mifune bistro.  Service was average.  No real, greeting or suggestions on food selection.  We had katsu donburi, sukiyaki, and seafood ramen.  Very fast service which scored a lot of points.  So after we dug in, the sukiyaki and ramen were very good and tasty.  The katsu was good but not great.  The miso that came with the katsu was below average.  Over all it was very good but could improve on the service.", "author": "Gregg P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-05", "description": "I've tried all the mifune restaurants in Japantown and they're pretty descent. But this one, wasn't as good. The food just taste weird or different. Sure, it looks nice and fancier than the other mifune's. But the food isn't as good and the service. You have to pay for tea and worst part was the waitress offered us tea at the end, when we asked for the bill. I was really thirsty, I don't know, maybe they do charge for water as well...", "author": "M L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-09", "description": "I love this place, I mixed up with the spicy beef steak ramen, so good! Resturant was nice and clean, customer service was good. Will have to come back again.", "author": "Jerry G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-09", "description": "I was starving and was in need of food. It was past 3 and I happened to be in Japantown and saw this place. Thinking it would be like the other Mifune I walk in and ordered a bowl of what looked like seafood ramen and a plate of gyoza. The gyoza were to die for. Tasty and juicy and full of flavor! The bowl of ramen, not sooo much... The noodles were fine but the broth was swimming in MSG. The fish pieces were broken up. The squid was over cooked and rubbery. The shrimp were chewy. But I was really hungry so I took care of that bowl and finished it. Not sure if I want to come back. Maybe I should come back at an earlier time. Not sure...", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-14", "description": "stomer service was trashy. Come with 8 friends and had to wait a while to order. The waitress was pushy and impatient. Then we only get 3 cups of water and then they completely ignore us. Then they proceed and give us only 4 tiny cups of water. WHAT KIND OF A RESTAURANT RUNS OUT OF WATER CUPS?!?!! They don't even give spoons for miso soup, and to add onto that they tried to give us the wrong order. Clearly they have no organization. All in all, the food was okay, but the service was really trashy and disappointing.", "author": "Vincent T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "This place is pretty good! The lunch special they have is pretty decent. Isn't that expensive. You get a choice of what you want and there's a lot of variety. The customer service is pretty good. They are polite and well-coming. The restaurant itself is pretty quiet and calm creating a peaceful atmosphere which is pretty good since the time people eat should be relaxing and calm. The decorations are unique and someone elegant.", "author": "Stella L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-27", "description": "Average. Had a bowl of udon and an order of kaarage chicken. Neither were horrible, but neither were great.", "author": "Brandon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-28", "description": "It's really just an average joe when it come to Japanese food. There could be better, there could be worse. I got the tempura don with came with vegetable tempura and two shrimp tempuras. I noticed that the tempura was not crispy and was actually quite soggy when I got it. And no, it's because I was on my phone. I always fidget with my phone after food! I tried it anyway and yes, definitely not crispy and wasn't the texture I like my tempura to be but the taste wasn't bad at all. It wasn't great either. My mom got the niku soba so we traded plates after eating half and I must say, I was very dissappointed at the niku soba. The noodles were overcooked and the taste of the broth was very bland. I wouldn't recommend eating here unless you have to but that's just me being that I'm a huge Japanese foodie and my family is Japanese. If you know of anywhere better, go there instead, we tried it because we were on vacation.", "author": "Phillip K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-10", "description": "Horrible. I ordered the chirashi and it was awful. One of the sashimi tasted all weird and slimy. It was disgusting. Never coming back here again. Plus, service was horrible.", "author": "Jonathan J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-11", "description": "We selected this particular restaurant at random. When you're walking down the hallway the restaurants don't really distinguish themselves too much. We knew we didn't want Benihana because we can get decent Japanese steak house at home. \n\nWe weren't terribly disappointed, but the food didn't have a wow factor either. I will say that the service was fast and courteous. We don't live near any kind of ethnic restaurants whatsoever, so our experience with certain types of foods is somewhat limited. We had shabu once before in NYC where we prepared our own. Our 10yo was looking forward to having it again, specifically making it. However, she was disappointed when they brought it out fully prepared. It was flavorful, but again, not particularly exciting. \n\nOverall, not a horrible decision, but not anything that leaves me thinking \"I have to get back there.\"", "author": "pathic d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-02", "description": "I agree with a previous review, it's decent, but nothing special. You can find some cheap items which is great. I've been here twice and have ordered-\n\n-beef curry rice, i'm not too picky and it tasted good to me, a smoother consistency than some of the other curry's in the mall. I would order again.\n\n-lunch special chasu ramen+niku don $10.90- the ramen was bland, and i'm not too hard to please, but it was bland, the niku don was a small side, and was ok too.\n\nBoyfriend has ordered the -curry udon good, but small portion, i believe it was $8.50..\n\nService during the week-night was fine, but when we went on new years day it was packed, and it was not so great.\n\nI'll probably go again, and will stick to a week night!", "author": "vanessa g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-23", "description": "We had the Chicken Katsu with Curry Rice. Both items were so bland if I closed my eyes I seriously wouldn't know what I ordered. Chicken/Pork/Beef? The curry could've been oatmeal for all I know. Just too top it off at the end when our bill came, I noticed the servers added a tip percent onto my total bill. It was hand-written to the total but that annoyed me even more since we waited so long to place our order. The table next to us got served before we did but we sat down earlier. For the price of the food the quality of service does not match. There is no \"Bistro\" factor at this location. Better to go to either of the other two places.", "author": "A M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-21", "description": "This service here was very nice. I didn't like something and I told waitress and they were willing to change something else for me!! Thank you :)", "author": "Pat P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-05", "description": "We had noodles and teriyaki chicken with rice.  Ehhhhh, nothing special at all and you can definitely get the same quality of food elsewhere for a cheaper price.  I suggest going to another restaurant instead of this one.", "author": "Sw H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-23", "description": "The food was decent. The service was minimal. What made me give a one-star review was when the check came. My friends and I ordered food coming to about thirty something dollars. We expected to pay our individual checks and didn't mind very much when only one check came. But then we saw final total of $43. Allow me to explain. They charged us $5 for gratuity (which I think should've been up for the customer to decide because I don't think that we should have had to give $5 for someone to bring over my food and refill my cup once.) Now here's the thing that pisses the hell off. So the $5 tip was ADDED to the total. AND THEN COMES THE TAX. THEY TAXED THE TIP. THE HELL. WHY ARE YOU TAXING THE TIP. THAT MAKES NO DAMN SENSE. Okay, so you're a restaurant restaurant and I've been to plenty of those. NONE OF THEM TAX MY TIP. WHY ARE YOU DOING THAT. YOU ARE CHEATING ME OF MY MONEY. WHAT EVEN. I'm never coming here again.\n\nAlso, there is no bathroom in the restaurant itself. You have to exit the restaurant, take a right, and use the public bathroom around the corner. This saddened me greatly.", "author": "Cara C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-22", "description": "the food was fucking nasty, i normally dont write bad reviews but wen i do im going to be blunt. the food tasted old, nasty, not fresh, and like shit. this restaurant is a wasted space. they either need a food makeover or close down for heaven sakes. the best mifune is the one on the east plaza lol even the one inside the west plaza is ok... yeah this is the worst one", "author": "Linda A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-29", "description": "The Tempera Udon I order was good and so were the fried octopus. The salmon was a little overcooked and dry to the taste for Salmon Teriyaki my sister ordered. They served cold water instead of hot tea unless ordered. For the Tempera Udon, the sauce does not come with the tempera unless asked for unlike the other stores. Price is rather decent tho. waiter disappears a lot and took some time to get to our table which is four tables from the door. There was only about 10 people not including my sister and I.", "author": "Angel H."}
