{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "Great little Thai place. Stayed at the Hilton and a coworker recommended this place. I ordered the Pad Thai with chicken and it was delicious. It was fresh and flavorful. Only wish the portion was bigger. It was a little small. Also the server gave us a rude face when our party of 3 asked for separate checks. She was reluctant to split it at first so things got awkward. \n\nThis place is close to a bad side of town so just be careful.", "author": "Lina F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-15", "description": "For our weekly office lunch, one of my coworkers ordered from Million Thai. Her delivery order arrived via Caviar on Friday, May 11th a little after 12 noon. Since I was starving, she offered to share her lunch.\n\n*Vegetarian Crispy Rolls: Deep fried vegetarian egg rolls stuffed with silver noodle, black mushroom, carrot, and cabbage served with sweet and sour sauce ($7.95)\n*Pad See Ew: Stir fried flat rice noodle with egg and Chinese broccoli in sweet black soy sauce, Chicken ($10.95)\n\nI just tried the noodles. I enjoyed the chinese broccoli as I adore my veggies. It also retained a nice crunch as the broccoli was not overcooked. The noodles I found a touch too mushy. (But I tend to favor dry flat noodles.) The chicken was fine. Just your standard chicken breast pieces. I didn't try the egg rolls, but they looked tasty. I believe the order came with three (instead of just the two pictured) and she finished the whole thing. Who doesn't love egg rolls though?\n\nDecent place for Thai food. I tend to like really strong Thai flavors, so overall I found their offerings a little muted.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-08", "description": "Good quality, high flavor.   Great spice level.\n\nI had hot chicken basil and pad kee mao.\n\nboth were delicious.", "author": "Chester H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "holy buttwipe this was spicy as heck\n\nI'm always underwhelmed by stuff marketed as spicy. This was SPICY.\n\nDelicious! (I think... I was a little distracted wondering why I ordered every single item at the spiciest level. Past me, wtf.)", "author": "C E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "I read the reviews about service.  Mine was outstanding.  The food was good although I've had better Tia food.  Clean restaurant and very friendly staff", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "I picked up takeout twice during my stay at the Hilton. Friendly, fast service. I really enjoyed the Green Curry Pork and Thai Basil Tofu.\nReasonable prices.", "author": "April S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "This small eatery was near our hotel and opted to give it a try. It did not disappoint! We enjoyed several entrees; Thai chicken salad, pumpkin curry chicken, fried rice and a delicious coconut broth based soup. Although service was a bit slow, the meals made up for it in taste and serving size. Would definitely stop in again when visiting San Francisco.", "author": "Luisa J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-14", "description": "The experience here was all over the map. I ordered from the website for takeout. They recommend 20 minutes, and I got there a little early, so I had to wait a couple minutes. No biggie.\n\nThe service was brisk; not unfriendly, but not super welcoming. \n\nThe food was just \"OK\" -- I wasn't blown away, but it wasn't terrible either. I ordered pad thai (I know -- how pedestrian can I be, right? But it's a good base to judge a Thai place). It was lacking the seasoning I would expect. Edible, but on the bland side. Portion size, as is the norm for pad thai, was huge.\n\nI'm going to agree with my brethren (and sistren(?))... this is a 3-star place. It's not overly priced, the food is acceptable and probably what you would expect. Bonus note: There was a chalkboard inside that looked like \"off menu\" items or specials... but they were written in Thai! So there may be some really good things waiting... I just didn't get to experience them.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "Had a very good experience at Million Thai. Was at a conference at the Hilton and saw this across the street. Since it was really cold and rainy, thai curry sounded so good, so I dragged my co-worker with me for dinner. \n\nThe place was pretty empty, so we were seated immediately. The servers were very friendly and nice, they answered all our questions with a smile and they were very prompt. They always came around for refills for our waters, overall excellent service. \n\nNow for the food: we ordered the vegetable gyoza and got 6 pieces, which was good to share for 2 people. These were really crispy and I liked the fillings. Definitely would recommend these if you're interested in sharing an appetizer and are looking for a vegetarian option.\nFor my main entree, I ordered panang curry with vegetables. I LOVED this dish. The curry was so rich in flavor and there portion was awesome. It came with a side of rice, which is really nice because many places don't include rice for dinner menu. There was a wide assortment of vegetables and overall, this meal will always be memorable. I highly recommend the panang curry if you're craving thai. \n\nMy co-worker ordered the vegetable noodle soup, which he said he really enjoyed the broth. He is vegetarian but didn't enjoy the vegetables too much (he's picky), but he liked the broth. He also ordered an entree but I don't remember what it was and he said it wasn't as memorable. I personally liked everything I tried, including his soup which actually was really nice, including the vegetables. \n\nOverall, I loved my experience at Million Thai and I regret that I do not live close enough to come here often but if I'm in this area of the city again, I will totally come back. If you have the opportunity to be in this area, then definitely check this place out! Highly recommended!", "author": "Payal P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-19", "description": "I've been ordering delivery from this place for a long while. Today, I found a cockroach in my pad see ew. This is the first time I've ever had that happen to me - I'm grossed out. Never again!", "author": "Tim M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-05", "description": "Small but cozy restaurant.  \nVery hard to order. Had a hard time understanding the waitress who was very sweet.  The food was ok but I thought a little pricey for the small servings.  Did enjoy the Thai tea however!!", "author": "Diane M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "The food is not  authentic, and the fried rice was watery! \nThe waitress is so rude! She was rushing us out, by standing right next to us and clearing the table rudely... I realized that it was 15 mins before their lunch break... the first time sh She Also they charge the tip automatically for 18% without telling the costumers!", "author": "Muchen Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-25", "description": "Pretty good Thai food in the city within walking distance to Union Square! The restaurant itself is really cute, a bit cozy and can get kind of warm inside. I got the pad Thai, while my boyfriend got the panang curry, and both were very tasty! The waitress was extremley kind, and we were in and out pretty fast (not rushed, just fast service!) Not mind blowing Thai food but still a good experience none the less!", "author": "Briana N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-25", "description": "Terrible Food. My husband and I love Thai food and order Duck fried rice on a regular basis. Our food arrived very late and The Duck Fried Rice that arrived from this restaurant is completely inedible. the rice is overcooked and the Duck is not Fresh. \nDon't waste your money or a meal on this place.", "author": "Lana D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-20", "description": "Easy access from the Hilton. Great customer service and delicious traditional Thai dishes at reasonable prices. Thanks Million Thai for a great dinner!", "author": "Kai W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-10", "description": "I really like this place.  Just beware. If you ask for extra spicy. They mean spicy!!  I love spicy food so I eat here every time I come to SF. It's a small quick place with very kind servers. \nI have had several meals but the pad Thai is my favorite so far. \nEvery time I come I try and see how spicy they will make it. \n\nSo good", "author": "Joshua H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "OMG the pad see ew is the best! Here at least once a week now. Quick to order time and pickup is easy. Deliveries are pretty quick from what I've gathered", "author": "Sodro K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "It was great, I tried coconut soup, my colleagues had noodles. The place is not super fancy but everything tastes great", "author": "Elena P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "Delicious!!!!! Great food for Lunch and Dinner. I went there a couple times per month. I always order shrimps rolls and soft shell crab for appetizer. BBQ beef short ribs, roasted pork Knuckle and one more thing I highly recommend Million pad thai. It's so yummyyyyy!!! \nBut today they have a special menu for this month. \n\"New York steak with spicy thai sauce \"!!!!!! \nSo yummy with that sauce.  \n\nGood food, Good price and great service as well. \nAbsolutely I will be back again and again. ^^", "author": "Patnaree S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Convenient for lunch breaks and dinner with small groups.  Love their pumpkin curry and crispy basil tofu entrees. Its a smaller dining area, wouldnt bring more than 3 people with me. Very delicious.", "author": "Pam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "Some friends of mine who are staying at the Hilton across the street recommended this restaurant. I love Thai food so I was excited to try it. I ordered without looking at the menu. My favorite is Pad See Ew (which means \"stirfried soy sauce noodles\") and at first I was just going to eat half of it, but I cannot stop eating it was so good! The presentation was wonderful as was the service.", "author": "Frank L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "Possibly the best thai food in the neighborhood.\nThe staff is nice. \nThe head lady is sweet and accomodating.\nThe food was tasty and authentic.\nThey charged me $1.00 extra to add chinese brocoli to my entree which was reasonable. \nThey let our group of 7 have individual checks.\nThey did include tip in bill but receipt has slot for more so beware.", "author": "Dude Food G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "Authentic Thai food is here!! \nI have been here so many times but never get bored because The chef always create special menu that you barely find in other Thai restaurant.", "author": "Wirunna W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-25", "description": "Got takeout here. Fried rice was good, and had some great flavor, however it was too mild! I asked for Thai spicy and it was just lacking in spice.\n\nThough I feel like if they just upped that this fried rice could have been very good!\n\nWill try this place again later.", "author": "Altair T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "Great Thai. I had both the papaya salad and the pad Thai. They were both very representative and true to  what you would get in Thailand.", "author": "Trent A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "Pork knuckle. Nuff said. \n\nI go there just to get drunk while eating this. The owner and staff are friendly and amazing. \n\nThey have a spicy pork rib soup that's also worth a try. Ask for the secret menu.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-03", "description": "My rating is 3 stars because it is solid but nothing to go wild over. \n\nI got the shrimp rolls and a curry. The rolls were fried with one long shrimp in it. The flavor of the shrimp was good. The presentation of the plate - spiraled orange and flower - was cute. \n\nThe curry is solid but nothing to go wild over. I got the red curry and she didn't ask was heat level I wanted it and it was served mild. It was very mild at first but the aftertaste had some heat to it. With chicken it was an extra $2 and the curry was in a fairly small bowl with a lot of rice. Normally I can never finish one curry order in one setting but this was not a problem due to size. Since this is located around hotels, that is probably a good thing. The thing is, it was just decent. A solid taste. Nothing for me to get excited about and I will soon forget this meal. \n\nThe restaurant is small - intimate. Lots of two-person tables and seated close to others. It get noisy at lunch. The decor is nice and the wall was decorated very well. \n\nThe prices were high considering how everything tasted. I know it's Union Square/Tenderloin and there are conventions and hotels but there were more affordable restaurant options nearby so... *shrug*. \n\nAt least the service was quick. Our lunch was in and out in less than an hour. This could be a good option if you're at a conference.\n----\nUpdate 7 hours later: yeah, an hour after dining here I began feeling sick. I still feel sick. I only had a croissant for breakfast otherwise so I know it is this place. I had the red curry chicken SO don't be like me. I feel miserable. :(", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "Definitely a good place to grub, tasty food and friendly service!\n\nCame here for dinner one night with some friends and purchased a groupon deal. Normally I would be very cautious of places that are advertising with groupon but this place turned out to be quite wonderful. We ordered 3 dishes to share, each one was very tasty and had good portions. The pan fried noodles with seafood was loaded with meat, shrimp, veggies and quality ingredients, the flavors were just right, not too heavy and not too plain. The yellow curry was also very thick and had loads of meat and veggies, very flavorful and delicious. Rice is however extra $1.50. We also got the Tom Kha soup with coconut milk, amazing.\n\nService was very nice and friendly, our waitress came by often to refill our drinks and check in us. Very nice. Tables were clean. They do also accept credit cards. The prices are ok reasonable for being right next to Union square. Parking was kind of a pain but we eventual found a metered spot 3 blocks away. Definitely recommend.", "author": "Dani S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-27", "description": "Dropped in before the play. We had the spicy shrimp salad. At least 6 shrimp nicely cooked mixed with greens mint and other veggies. We also had the angel wings. Not bad. Decent portion size. \n\nService was very good 4 stars. Short but decent wine list.", "author": "Frank T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-29", "description": "Consistent. Authentic. Thai in the city.\n\nCan't go wrong!\n\nGreat place to watch a basketball game and enjoy dinner.\n\nThe restaurant doesn't rush you and service is great.", "author": "Jackie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "We were using a Groupon and in the area for a conference. The location is convenient to Union Square. The location is very small but quaint. The tables are close together. The service was great. We received our food very fast. Although, we ordered an appetizer. I wish it could have come out before our entrees.\n\nI like spicy food! Of course every restaurants spice level is different. Therefore I ordered a moderate \"5\" in spice level. Unfortunately, it was almost unbearable hot. My mouth was on fire! My husband ordered a 6, he didn't have any issues so maybe it was just me.\n\nOverall pretty good for Thai food.", "author": "Wende' F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Great vegan options. The basil tofu was amazing. I went for the Pra Ram for the main course and it was very delicious. We had the Spring rolls as well. And every thing was served with beautiful flowers.", "author": "Zlil L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-10", "description": "Million Thai does not have the greatest Thai taste food and one of those places where I could not finish the full food. I found the food very greasy and the taste was nothing great.", "author": "Arijit C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "We eat Thai food all the time but this place offers numerous authentic dishes we've had nowhere else.  We were a group of 5 and we probably ordered 8 dishes on a Saturday afternoon.  All amazingly good!\n\nThe employees were very pleasant and accommodating.\n\nYou know a restaurant is good when you and your spouse keep talking about it for a few days afterwards.  We are looking forward to a return visit!", "author": "Yelp R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "This is a place you'd walk right past if you aren't looking for it. However, you won't regret coming! Service is always decent, food is flavorful, and you can usually find a Groupon deal for this place! \n\nI recommend the pad see ew and pad kee mao. Do ask for their spices. For dessert, do order their roti with ice cream. Sweet and savory pairing is absolutely mouthwatering!\n\nI recommend taking Uber/Lyft/public transport here, as parking is difficult. This is located only a couple blocks west of Union Square, if you are coming from Powell. Definitely check Groupon before coming! They usually have deals that will save you 40%-50%.", "author": "Kristi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "Been coming here for about five years. Seriously good vegetarian options here. The Tom ka with tofu and vegetables is really well done. Pad kee mao is my go to standard, usually with pork. It's spicy without being deadly. Same for the papaya salad which has more bite than some places. My friends raved about the pumpkin curry as well.", "author": "Tim P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "It look completely different inside than it does from outside. It's so cute and beautifully decorated inside. The food is so yummy and the presentation is beautiful. Huge portions for the prices. I got the fried chicken over a substitution of pineapple rice. The rice was so soft and delicious and the chicken was so crispy.", "author": "Ria B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-02", "description": "I had the Pad Thai, because I always have the Pad Thai. It was okay, not the best I've had but good enough. Beware the spice though... I ordered to go through the Yelp Eats service and it had a star rating of 1-10. Normally I order my Pad Thai spicy, but I didn't want it particularly spicy this time. So I chose a 6. OMG, it tasted more like a 16... my mouth was on fire. The take out receipt said \"medium\", I don't think I could handle their \"hot.\" If you are sensitive to spicy foods proceed with caution here!", "author": "Carl O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "It was the best panag curry I have ever had! I just forgot to take a photo of the curry. But highly recommend it!", "author": "90sujeong .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-24", "description": "I'm not sure what star rating you should give when one of your items was soooooo freaking good but the other one really sucked. So 3-stars felt like the average of the two.\n\nI ordered take-out and got my food very fast, so that's always a plus! The Thai Fried Rice was very flavorful and had a good protein/egg/vegetable ratio! And their Yellow Curry is some of the best I've had in San Francisco. The curry was thick and had bold spices. Other curries I've had are watery and bland, but this one was 10x better than the rest! However, the Roti was a huge let down. Instead of having buttery, fluffy roti, mine was WAY overcooked and just soaked in oil. I felt like I was eating super greasy tortilla chips. \n\nSuper bummed about the quality of the roti. Wouldn't order that again but I'll be back for their curries.", "author": "Chisholm T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-27", "description": "My boyfriend and I are visiting, and this restaurant is right across from our hotel. We called in and ordered Thai Fried Rice and the BBQ Beef Shortribs. A minute later, the restaurant called and said they didn't have any short ribs but could make BBQ Beef (apparently their typical substitute when they run out of shortribs). We paid the same amount for the \"BBQ Beef\" as we would have paid for the shortribs, and be warned, it's plain flank steak. We ended up walking down to a convenience store and getting teriyaki sauce and soy sauce (neither were available at the restaurant) in an effort to salvage this $16 dish. Didn't work. The meat was bland and most went uneaten. \n\nThe fried rice was the only reason for the 2nd star.", "author": "Kim C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-16", "description": "The food was good. I love spicy sauce here so bad. \n\nI gave only 3 stars because the service was so bad. I went there on Sunday night. I asked her \"what desert do they have?\" She told me \" we have the same\"", "author": "Pinarat S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-24", "description": "Never given a one star review until now. \n\nI was really craving thai food last night and decided to order from Million Thai via Uber Eats. I ordered Chicken Pad Thai and Egg Fried Rice. The food surprisingly arrived very quickly (25 min). I was so excited and hungry when the food arrived. The Pad Thai didn't look or smell good when I unwrapped it, which was red flag #1.\n\nI took one bite - it was completely dry, flavorless, over cooked noodles, clumped together. I have never had such bad Pad Thai in my life and this is one of my favorite dishes. The Egg Fried Rice was also completely bland, basically white rice with a weird taste to it. \n\nI was so excited about having leftovers for lunch the next day but nope, had to throw it away it was so bad (which I never do, I hate wasting food). I also had a bad stomachache after finishing what I was able to swallow. \n\nSafe to say I won't be coming back here, especially after reading reviews about how terrible their customer service is as well.", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Location is fairly close to union square, which is perfect for a bite after shopping. I have to say the food here is the closest to true authentic thai food. I've travelled to thailand several times and could not find anything the resembles the fiery flavours of the cuisine anywhere in the US however this small food joint is definitely the place to go if you're looking for delicious thai soup, salads, main dishes with a wide selection of meats (fish,meat,chicken,pork,vegetarian). P.s service is fast and amazing. We barely waited for the food to be prepared. Our server, Mai  was lovely and had amazing recommendations!", "author": "Tanya N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-03", "description": "3.5\n\nI ordered the fried chicken over rice via Caviar and it was very filling.\n\nI opened it and poured the sweet and sour sauce all over my chicken and ate it with rice. There was an abundance of rice so I didn't finish it, but it definitely got me full!", "author": "Aj C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-03", "description": "This is a great little Thai restaurant.  It's located beside Mark Twain hotel which is where I last stayed in San Fran, but I don't remember this place! \n\nWe went in to find 5 or 6  tables occupied but there were a table for 5 right beside the open window.  Good thing it was a warm night, otherwise it would be too cool.  There was a TV that was above the next table to us for those that are dining alone or can't miss the episode of Big Brother that was playing.\n\nAfter ordering fried rice, beef Pad See Ew, Pad Thai, and a curry dish, we sat back and enjoyed the night activity on the streets of San Fran.  The server came out to apologize that our food didn't arrive yet as there were a mix up in the kitchen.  It took over 20 minutes but when we did finally get our food, the dishes came out looking pretty and looking big sized too.  \n\nThe taste was good, and a little greasy but not slipping and sliding in my mouth.  Lots of food for the 4 of us to enjoy.\n\nIt seems to be popular for take out and for singles.  A few singles were asked to share a table with another single but he/she didn't always want to and left.  Glad we got a Groupon for this place!", "author": "Violet P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-18", "description": "Howdy!  I ordered delivery from MIllion Thai on Saturday and have been suffering the consequences of food poisoning ever since! There's nothing like ending your Saturday with your head in the toilet.  That being said the food tasted good while I was eating it.  I don't recommend eating here!", "author": "Allison W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "I always come here for thai food because i feel that this restaurant cooks food like my mom used to cook when i was in Thailand. It is a small restaurant but i always usually come at night when the dinner rush over. I love spicy food and this place always meet my expectations. They always have some new menu every month or two but i usually stick with basic thai food ( papaya salad with fermented fish) (spicy sour chicken feet soup) (salted chicken wings) \nWill keep on coming to this place. Thanks mak mak khaa Million Thai :)", "author": "Pin P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-13", "description": "This place has the worst customer service I've experienced. All of the plates are ordered were incomplete: the noodles cames with ONE piece of bell pepper (for an order for 2), the lettuce wraps where sent with cabage roots instead of cabbage. On top of everything I call to complain and the manager said that it was impossible and called me liar before hanging the phone. Terrible service, I do not recommend this place.", "author": "Maria Fernanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "I'm really conflicted. Every time I've ordered Pad Se Ew togo, it was amazingly good. Maybe because I was super hungry by the time it arrived? Well, a few months ago, my friend and I decided to venture off to Million Thai Restaurant and eat there for lunch.\n\nUnfortunately, it wasn't that great when we got there. The seafood meat was significantly less compared to the take-out option. Also, it didn't taste as fresh either. Maybe I came on a bad day? \n\nOverall, did this dine-in experience prevent me from ordering future Pad Se Ews togos? No. I still love it as it's my guilty late-night pleasure. \n\nI'd recommend the Pad Se Ew + Seafood option (+$3.00). It's super good.", "author": "Chinsin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-05", "description": "Ugh... awful. ordered through Uber eats for delivery. Was delivered right away but food was not good. Cashew chicken so salty; inedible. Other food served cold. Ordered peanut sauce and when it arrived it had separated into grease and a gritty peanut sauce", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-28", "description": "Tried the beef noodle soup, seafood noodle soup and was quite disappointed. The beef broth was bland, a little sweet and the meat was thick and flavorless. The seafood broth tasted like chicken soup. Condiments also had to be requested (we're Asian, just bring them!) I wanted to like this place since I'd heard about it before and its quite close to my home but I don't think I'll be going back. Other restaurants in the TL like zenyai and Paknam serve similar items that taste a lot better so I'll stick with them.", "author": "Ozzy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Best Thai Basil Chicken I've had since I first tried that dish in Ko Phi Phi 30 years ago. Great service. As close to authentic Thai food as you will get.", "author": "Nic M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-22", "description": "Food was super bland. Soggy noodles, no flavor. Spring roll was awful and served with some kind of teriyaki sauce. Very disappointing for Thai in SF.", "author": "Brandi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "The food here is top notch and portion size good as well. The service was fine and it's a great hole in the wall restaurant. This is not a fine dining experience. But it is perfect for good food on the fly.  Don't use the bathroom. That was in itself a nightmare. When you are washing your hands, look right and you're guaranteed to gag. The toilet side, floor have streaks and layered on gunk. I don't want to describe fuller. \nIt was perfect for us because we got to the theatre just in time.", "author": "Angie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "This is a hidden gem right here in the TL!\n\nThai restaurants are a dime a dozen in the downtown area (and all of SF too really), so it can be really hard to stand out.\n\nBut when you don't want to deal with the crowd at Lers Ros, just walk a few blocks over to Million Thai!\n\nThey have lots of vegetarian/vegan options-as usual with any Thai restaurant. But thy also have a lot of seafood specials for those who eat it. They have beer on draft and a small, but decent wine selection.\n\nThe food is the shining star here. Beautiful and immaculate presentation. Everything is fresh, vivid, colorful, and beautiful. The noodles are soft. but not soggy. The flavors rich and bold. I always lick my spoon clean and wish I had more!\n\nThe restaurant itself is tiny and only has about 10 tables. So I don't recommend going in a group larger than 4. I usually get lucky and find a table, but they can get busy during weekends and right in the middle of dinner rush. Also, they've been promoting a lot on Groupon, so they've been having more traffic than usual.\n\nThey're open late (like midnight I think), so I like to stop by after a late shift.\n\nThe only thing I advise against here is do NOT do takeout. I've always been disappointed in the takeout quality. Boring, bland, and lacking the perfected details they put in if you had dined in instead.", "author": "Lanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-14", "description": "I'm Thai. So I try to find Thai restaurant and I found here. This restaurant made me feel like eat at home. Food is Thai style not American style. Staff are nice! And foods very very yum!!!\nEverything are Awesome!", "author": "Shalilynn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-28", "description": "Stopped here on my lunch break to try a new spot. I ordered the Million Pad Thai and ate there since I work about three doors down. I wasn't very impressed. The dish was lacking in flavor and my water had floaties in it :(. I'm willing t give them another, shot however, but I'll try a different dish.", "author": "Ursula R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "My boyfriend and I ate here for lunch since it was right next to our hotel (Mark Twain). We were a little hesitant since we were the only ones there and the menu looked a little pricey - but we were really hungry. I am so glad we stayed! We ordered the prawn fried rice and it was the best fried rice I've ever had, their pad Thai was delicious and their Thai tea was amazing! My boyfriend said it was probably the best tea he has had so far. They gave big portions and we were so glad to have leftovers to take home :) Can't wait to visit SF and come to this place again!", "author": "Jaclyn M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-09", "description": "If you love food poisoning this is totally your jam. Pungent smell when you walk in to pick up your lunch order? Check! Zero people eating there? Check! Super bland chicken pad see ew? Check! 24 hours of feeling like you're birthing a Gremlin? CHECK!!! And I'm not talking about Gizmo either. I mean the evil fvcker with the stripe on his head. \n\nFood poisoning. It's what's for dinner!", "author": "Griffen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Though my taste buds is still trying to adjust its expectations on the caliber of Asian food found in the Bay area. My two Bay area thai experiences had been nothing short of amazing. Million Thai being one of them.\n\nThe unassuming store front of this restaurant is directly across from the Hilton where we were having our conference. It was the convenient lunch choice. The staff was attentive and sweet. I decided on the Kao Prik Sod with Duck [and very spicy].\n\nPlenty of tantalizing scent strayed to our table as we were sitting next to the open kitchen, when I got my food, I couldn't wait to have that first bite. And wow, the duck was cooked to perfection, the skin of the duck had a layer of crispy texture, which soaked in all of the flavorful sauce while being sauteeded with thai chili and onion. The meat was extremely tender, but still maintaining the integrity of the meat texture., absolutely brilliant contrast with its crispy exterior. The flavoringly was fantastically complex and properly spicy. Did I also mention that the dish was also pleasing to the eye - with beautifully saturated colors of its ingredients.\n\nGorgeously memorable and satifying thai experience. Looking forward to coming back to try their curry.", "author": "Sharon Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "This is a good Thai restaurant. Their menu is pretty standard. They serve the same food as other Thai restaurants. This place attracts a lot tourists. The food is very good. The presentation of the food is very nice and elegant. \n\nI have been to the restaurant a few times. The Pad See Ew was very good. It was similar to Chinese Beef Chow Fun with Black Bean Sauce, except it was sweeter. . It was well cooked and had a lot flavor. It was not greasy.  I really liked two of the desert items on the menu, Mango with Sweet Sticky Rice and Roti Ice Cream. Both items were delicious and well made. The Pineapple Fried Rice and Spicy Eggplant were also good. \n\nAlso, I would highly recommend the Hot Thai Tea. It has a strong sweet fragrance and tasted good. It is also unsweetened and low in calories.  The Thai Ice Coffee (sweetened with condensed milk) is also good.\n\nThe customer service was very good. The interior of the restaurant was small, but looked nice. It had a nice ambiance. I will definitely visit the restaurant again.", "author": "Hiroshi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "What a great find!  Everything was delicious and service was quick and attentive on a busy night. There were so many recommendations for the papaya salad that we had to try it - and it was awesome.  The tom ga coconut soup rocked too...can't go wrong!  Enjoy!", "author": "Karen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "You can't go wrong with red curry chicken and rice.  Seriously it's the same wherever you go and Million Thai does a good job with theirs.  It was plate scraping delicious!  Who doesn't love a good meal with an orchid?", "author": "Wendy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-26", "description": "Great food, very friendly staff. Presentation is great and the prices are reasonable. Will definitely go back for more!", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "clearly on a thai streak this week! we chose this place for girls night and i was really surprised at the quality. not in a great area, but this area is FULL of delicious ethnic restaurants. service was fast and attentive too :)\n\nwe got - angel wings, papaya salad, pee kee mau, and pumpkin curry with duck.  the angel wings were pretty disappointing - alll sauce and really no flavor in the chicken itself - wont be ordering this again. papaya salad was a good size with good flavors, super refreshing, but my friend definitely had another dish in mind when she was ordering (the one that's really pretty in all the other yelp photos that you can mix yourself)...\n\nnoodles and curry, however, were delicious - and very reasonably priced.  so are the beers and wines. i'd def be open to come back here!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "If you're in town visiting and in the Union Square Area I would really suggest any lover or Thai food to come visit Millions! I haven't had Thai food in awhile but I love how fresh and spicy the food was! \nI loved the food but the service was sub par. I loved how spicy the food was! (I'm a spicy lover) When I asked for extra spice they came in with 100%!! I loved it! Everything is reasonably priced for the quality and quantity of your entree. The only reason why I gave four stars is because of their service. It took awhile to get our order in and there wasn't even a full room. The staff isn't as observant for a small restaurant. Over seeing this small detail the food preparation is top notch! The cooks really know what they're doing back there!\n\nI ordered the Larb Beef with a side of Brown Rice and the Papaya Salad! I wasn't disappointed! The Papaya Salad was 15$ and was huge and had an assortment of noodles chicken and other delicious sides!! With both entrees they could feed 4+! The food came quickly and the spicy level was amazing! They do ask how hot you would like it and they do put it on the side as well, if you're new to the spice level.\n\nTheir desserts are delicious! I am in love with the mango and sticky rice but then again you can't really go wrong with mango! They do have an assortment of different Thai desserts like fried banana and ice-cream, and fried ice-cream!", "author": "Rosellini V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-19", "description": "Want to try authentic Thai dishes? Come to this place.  Kind of hot inside the restaurant, more people are doing to go than dining there.  \nDidn't stop to the restroom so don't know how it is in there or anywhere else other than the spot we were sitting at which was not too bad. \nI love the authentic dishes we ordered.  \nBut I think $3.50 per order of stick rice was a bit much.  Other than that very good authentic Thai food to dine!", "author": "Warunee G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-31", "description": "If I could give this place negative stars I would. The food was TERRIBLE and the service seemed to be nice until you realize that they are overcharging you with an angelic smile on their faces. \n\nI WOULD ALSO LIKE TO MENTION THAT THE OWNER AND THEIR FRIENDS HAVE BEEN VERBALLY HARASSING ME EVER SINCE I PUT THIS REVIEW ON YELP* \n\nI got a Groupon for this place while I was visiting SF so nothing could really go wrong since I was already saving money on the great deal they were offering, right?? Wrong.\n\nFirst I will tell you that the service was seemingly nice on the outside but actually was horrible when you understood what was happening. Second the food was really really really bad.\n\nWe got the fried pork belly, cashew chicken, and an order spring rolls.(which were forced upon me - you can read about it below if you have the will to read through it all)  The fried pork belly was inedible. The posted photos are of the entire order which was thrown away as-is. Why were they so bad you ask? They were so dry that it was actually worse than eating beef jerky or any type of jerky. The skins were left on the outside but were not cooked enough so they were like trying to eat a leather wallet. Cashew chicken was so oily and salty that it was about 20% eaten and also thrown out. I have NEVER thrown a dish out like this before in my entire life. I hate wasting food also but it just was not edible. There was orange-colored oil at the bottom of the container that was like 1cm high. I am not kidding. It was not just a little bit like any ordinary dish that may have been fried twice. It was like eating rice with oil soup and chicken chunks here and there. The spring roll was also very gross. The noodles inside were so mushy they tasted like Chef Boyardee, and the veggies were not fresh nor was the rice paper on the outside soft. The sauce it came with was way too salty and tasted like soy sauce with corn syrup mixed in with it. If you can stay away from this place, please do.  If I could I would stand in front of the place and redirect people to a better place down the street but unfortunately I don't live here so I can't save you all!! \n\nThe stuff written from here on out is my rant from what all went down to prove how horrible this place is. The employees and the whole story behind it is just still so mind boggling to me I am losing sleep over what happened and writing this review at nearly 1AM on a Sunday. If you have the will or need to read on then please do so. I won't be sad if you don't, though. No pressure :)\n\nMy Groupon deal was for $20 worth of food so I ordered two dishes and asked if any one of them came with rice since my dishes were meat dishes. They said no so I asked how much it was to get a side of rice. They said it would cost a $1.50 so I went ahead and added a side of rice. I get there to pick up my order and when I give her my credit card for the extra couple of bucks I owed, she says they don't take Discover. Then I get out my other card and she now says they don't take credit card for anything under $10. I say \"but my order was over $20 technically\" and she looks at me with angelic eyes and says \"oh sorry ...\" and just stands there and stares at me. Then I say I am sorry but I don't have cash. She then points at a nearby ATM saying it only charges a $3 fee for me to pull cash from it so I can bring it back to her that way. I say \"no thank you\" and say that I will leave the food and then she says \"ok I can take it ok ok.\"  At this point ... I am so exhausted from my day and hungry from waiting for my order for so long that I accept the \"new\" terms and give her my card to be charged under $10 on my card. Another employee shows up and says repeatedly that they don't take credit cards under $10 AGAIN. SIGH*  At this point I am so irritable that I give in and just buy a small appetizer that they suggest to me which is the cheapest for $9.  After they put the order in, I take a look at the menu and it turns out that the appetizer was $7 ... not $9!!  Folks .. this is NOT the end of it.  I finally get out of this hell hole(sorry for the language) and come to my hotel room to find that the initial dish that they said did NOT have rice actually DID come with rice.  WHAT DOES THIS MEAN??? This means folks that I did NOT have to buy the extra rice for the order, which would have not ended up being over the initial Groupon amount, which would have kept me from using my credit card, which would have not made me order another dish just to be over the $10 limit!!!!!!!!!! THAT is what it means!!!", "author": "Jennifer Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "Enjoyed the fast friendly service.. went around 530 with no wait. Enjoyed the shrimp roll as an appetizer and their Gwey was fab!  only wished my server spoke better English to ease communications... However it was really a delicious meal!!", "author": "Zanthia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-01", "description": "3 star cause our food came out fast. No condiments hot sauce nothing for noodle soup.  Very Small dining food is good but when we say spicy they have dry chili instead fresh so was not spicy at all.", "author": "Champaigne M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-15", "description": "This used to be our go-to order-in food. Their parang curry has become my comfort food (and my boyfriend dreams of them Thai Roti). . But the following tragedy has happened TWICE now and has made us disavow Million Thai going forward:\nWe order our faves via UberEATS. The ETA comes, status still shows \"order being prepared.\" The ETA continues to be pushed back while the status remains unchanged. Finally, at the 1.5 hour mark, the restaurant cancels the order. \nThat. \nSucks.\n\nHere's the thing, if the restaurant cancels due to volume or whatever soon after I place an order, I understand. But when I've waited 1.5 hours for the food you say you're preparing, and then you cancel? Unacceptable. At 7 pm I could've changed my order and still had a normal night. But at 830 you've pushed back my meal time to 9 pm. Absolutely unacceptable. \n\nTheir food was good when it actually showed up. But it's so unreliable that we can't bring ourselves to gamble again. I'd give NO stars if I could.", "author": "Lindsay M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-09", "description": "It's next to your hotel!\n\nThis is the great advantage of Million Thai. Other than that, I can't really imagine why you'd want to eat here, unless you've never eaten Thai food before.\n\nSure, it's a pleasant enough room (though the auditory combo of Thai pop music & TV sports is a bit overwhelming). And the service is friendly and prompt.\n\nBut the food ranges from meh to not good. The pad thai is ketchupy, the satay is dry, and the Thai roti is so greasy as to be inedible. If I *had* to eat here again I would order the vegetarian salad roll, which was the only thing we ate that was totally unobjectionable. \n\nSo if \"next to your hotel\" is the key criterion, then go for it. Otherwise, pass.", "author": "Alexandra S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "Loved this place!  Bought a groupon so we could try it out while in San Francisco.  We arrived around 8 pm thinking the dinner rush would have calmed down but when you are in downtown, I think most good places would still be busy.  The restaurant is not large and there were still two empty tables.  \n\nThe staff greeted us and asked which table we preferred, we sat next to the open window.  The seating is a little tight but still comfortable.  We order four dishes and the presentation was nice and they were all delicious!  The pad Thai had big pieces of chicken and tofu and spiced just right.  The pad sew was also just right, the noodles cooked to perfection.  The yellow curry with beef contained potatos and some carrot pieces and the beef was not tough or chewy, the sauce was nice.  The Thai fried rice had a light flavour and was great with the curry sauce.  Each dish was around $10 and the portion size was very good.\n\nLots of people were coming to the restaurant and since there were no small tables available, customers had to sit with others unless they wanted to wait.  I would definitely go back to this place, it is located close to many hotels so very easy to find.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-07", "description": "If I could give 0 stars, I would! I ordered the Pad See Ew, but I ended up getting the Pad See EWWW!! \n\nIt had been a long day, and I was very excited to enjoy some delicious Thai food, but after the food took an HOUR to get here, I was completely HORRIFIED to find a COCKROACH crawling around inside of my dish.\n\nThis is ridiculous, a restaurant should ALWAYS include every ingredient on their menu. If I had wanted COCKROACHES in my food, I would have gone to Blondies.\n\nLOOK AT THIS SHIT:", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "The food is amazing same as always,The flavor of the original authentic cuisine....feel like in", "author": "Safiah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "First of all, this place is a restaurant and not a public restroom....according the the sign on the door lol\n\nMy favorite dish tonight is the papaya salad with slated crabs. Best I've had in a long time. \n\nOverall everything we had taste really good but I was impressed most with the papaya salad. \n\nThis restaurant is highly recommended.", "author": "Lam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "I really enjoyed the food here.  I picked it up to go after work.  I got a pad se ew and pumpkin curry and it was damn delicious.\n\nI can't wait to order again soon.  I might have found finally my replacement of king of thai down the street.\n\nI highly recommend.", "author": "Raja D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "Paey thew lord is really delicious especially if you add some chili paste like I did to add more flavor and neutralize the sweetness of the black bean sauce\n\nSimply a must try! \n\nI've tried the combination fried rice at another time and it is definitely more flavorful and less dry that other Thai places\nThis is officially my go to spot whenever I'm craving Thai in downtown", "author": "Vikas J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-08", "description": "I was in SF on business and was looking for some good Thai food. I read the reviews so I was expecting some really good traditional Thai food.  I ordered the BBQ pork with green salad, a cup of Tom Yung Gung soup, and mango sticky rice for dessert.  The food to me was just okay and the soup was underwhelming.  I just couldn't understand how all these reviews could be so off.  I'm not a Thai food expert, but I have spent quite a few years visiting several parts of Thailand so I think I'm pretty familiar with how traditional Thai food should taste.   \n\nI noticed that most of the patrons were white American so I was just about to write it off to them not really knowing the difference.  It was just then that a Thai couple came in and the staff seemed to recognize them.  They were seated and given different menus than the one I had ordered from.  I asked the waitress and she said that was the Thai menu and had traditional Thai dishes.  Apparently you have to ask for that menu as those dishes are probably more authentic.  \n\nFor now, I'll give them 3-stars because the food was decent but the service was great.  Next time I come by, I'll definitely order from the traditional Thai menu and update my review then.", "author": "Jason N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "As my last dinner in San Francisco on my summer vacation, I ordered hot tea because night wind between buildings made me little bit chill. They have only one type of tea: Thai tea. It was a good warmer for my chilled throat and stomach. \nMy second choice was a Tom Yum soup with sea foods, which is the all-time favorite Thai food. It was beyond my expectation.  My third was Pad Thai, a fried rice noodle with pork, various vegetables and tofu. This was just good enough, but the portion will be for more than one person:)", "author": "Taekgoo K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-15", "description": "I've tried a few Thai restaurants in SF, but this place is by far the best. I usually get the pad kee mao with the tom kha soup. The portions are large enough to satisfy big appetites. They use ground chicken/beef in their pad kee mao, so maybe ask for a replacement if you're not into that. The tom kha soup is perfect and I don't have anything else to add. \n\nIf you order from an app, you may be prompted to choose a level of spiciness when you select an item. The levels range from 1-10. I like my food mouth-numbing, sweat-inducing spicy and an 8 is a comfortable level of spice for me. \n\nThe prices are also super reasonable by SF standards.", "author": "Melody Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-03", "description": "Food was great. Well cooked and spicy level as requested. Out waitress was very helpful and nice. We just came here for dinner after a very long day of SF tour, though the ambience was not very great, we were happy about the people!\n\nWould recommend this place.", "author": "Swathi J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "My hotel across the street had minimal food selections so I ventured over to Million Thai. I was pleasantly surprised. I ordered a few appetizers and the drunken noodles and I really enjoyed it. It was affordable and my take out was ready pretty quickly. They were also super nice when I went to pick it up. I love Thai food and they didn't disappoint.", "author": "Joie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-07", "description": "I really wanted to like this place. I love Thai food and this place is close to my apartment. I didn't let the three star rating deter me as some of my favorite restaurants have three star ratings on yelp. But this place is honestly just a three star restaurant and that's it. The food was very greasy and bland. Just ok. Not the best or most authentic Thai food. Three stars for the fast preparation of my order and the thai iced tea.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-29", "description": "This is a review of an online order. Watch out - I don't think Million Thai pays much attention to how their food shows up on third party apps. When I ordered on Uber Eats, the layout strongly suggested that I needed to order rice. So when a lot of extra rice showed up, I felt cheated. Especially since the balance of rice to entree was pretty skewed anyway - about 70/30 rice/entree. And my beef was dry. Overall, disappointing.", "author": "Jeremy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Very fresh and good . Tom yum soup with sea food mix was excellent. Thai hot tea was Amaizing I had three cups. Great service. We bought the groupon .", "author": "Johnna G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-24", "description": "My husband got sick after eating their food and when we opened the sweet and sour sauce we found a long hair in it. No thanks.", "author": "Carla P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "Excellent little restaurant.\n\nI asked the waitress if they had a pork belly dish and she brought me a separate menu that had no english and pointed to something. Being an adventurous eater I ordered it and am very glad I did. I have no idea what the name is, but it was pork belly with thai basil and green beans (cut up very small). I feel like the worst Yelper in history, but this is the best I can do.\n\nMy wife had Pad See Ew (standard fare) with beef and it was average.", "author": "Shannon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "Been Passing this Thai Restaurant for the past week . Considering its prime location .. I decided to try it .. Below me down .. I don't need to visit Thailand for its Authentic exotic cuisine coz I can find it right in San Francisco!!! I'd say most are at par close to its taste from their mother land. Try their salad but Huge serving ..I'd definitely will come back here since it's proximity to union square .. Kudos to this place", "author": "Donovan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-10", "description": "I'm torn because the food is really good, but it's not consistent. One time the level 6 spicy was perfect, the next I couldn't touch my dish my mouth was so on-fire, and another time it wasn't spicy at all.\n\nThe delivery is also always about 30 minutes later than they'll tell you. Can get really frustrating when you're ordered for a group of hungry people.", "author": "Liz E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "We found this place on Groupon, and decided to try it, because it looked so elegant in the Groupon photo. The photo shown is NOT the restaurant itself! That was a disappointment, because the actual restaurant is closer to a dingy little hole in the wall. I'll show you what I'm talking about with a photo. I have to say, the food was good though. We ordered your basic Thai dishes, nothing unusual, Red Panang Curry, Pad Thai, and an assorted appetizer. The Pad Thai was overly sweet, but the curry was delicious! The table next to us had some interesting looking cocktails served in the coconut itself and complete with a colorful umbrella. I'll have to try one of those on a date night without the kids. Four stars were earned for good food, good service, and very reasonable prices. We'll definitely return for a casual meal. Just don't expect the elegant restaurant you see in the Groupon photo.", "author": "Jameela G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "Nice Thai restaurant with good looking and tasty plates + happy hours on drinks till 6pm\nThe staff is also very kind.", "author": "Sophie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "We love to eat here on weekends for Somtam platter which aka papaya salad. The taste was so authentic Thai and even better with a glass of wine. \n\nThai iced tea is recommended!", "author": "Pat R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "Chicken Basil Extra Spicy with Sticky Rice and a Thai Ice Tea!\n\nTasted great.  A bit spicy but that was expected as I asked for Thai Spicy :-)\n\nExcellent service staff.  Helpful and friendly.", "author": "A J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "Came for a quick pre-show dinner, and ordered the veggie spring rolls and the panang tofu curry. They were courteous about asking my spice preferences and brought the dishes out quickly. The food was flavorful - piquant curry, and little extras like crispy rice noodles served with the spring rolls. A pretty flower adorned each plate. The ambiance is only so-so, but in all, a solid good meal.", "author": "Geri W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-06", "description": "Great food, but -1 star for the long wait for the food. Definitely recommend the pumpkin curry - it comes packed with veggies and chunks of kabocha. Others in the group also enjoyed the pad thai and pad see ew. \n\nI think this place is probably better for takeout or delivery due to the wait - the food itself is probably the best Thai I've had in the city so far!", "author": "Abby S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "As excellent a plate of Spicy Thai Basil as I've had. Just excellent. Had it with seafood and 7 out of 10 on the heat/spice meter. I wish I would have just gone to 10. \n\nNice, cozy place. Portion just right. Thai beer $3.95. Out of here for $23. Excellent. Staying at the Hilton on O'Farrell. Would definitely come back to try other dishes.", "author": "Van P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "Well here we go, this is pretty a small place but apart from that everything was perfect. I had the yellow curry chicken which comes with rice. The portions were perfect along with the flavor. The curry was good, it was flavorful and i really liked the side plate decor with the flowers and fruits. I also ordered the thai iced tea which was great. The price with the service and food was very reasonable. I have been having thai other places but never tried this one but after having a shot at this place, i will absolutely be back for another.", "author": "Yada N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-10", "description": "I got up early and flew across country from Alabama and only had a smoothie for breakfast and no lunch. I checked into the Hilton by this restaurant and was starving by 2pm Pacific (4 Central) time. I asked the very sweet waitress for a recommendation and as a result had the Pad Ew. It was delicious and a perfect portion size. The food was out hot and fresh only minutes after I ordered it. A very good experience. I would go back.", "author": "Derek B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-08", "description": "-Fresh spring rolls\n-Pad see yew with duck (spice level 6)\n\nOverall, very mediocre. \n\nThe spring rolls were packed with iceberg lettuce... to the point where it was all I could taste.\n\nThe pad see yew was not bad, I was more disappointed in the non-existent spice level -- I chose 6 out of 10, to be on the safe side, but either they disregarded this part of the order or their spice levels are super weak.\n\nThere's much better thai in the city that I'd recommend checking out before you come here.", "author": "Britt M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-19", "description": "Don't do it. My order on a Saturday night at 7 pm took 90 min to arrive. And it was the wrong item. Annoyed.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-03", "description": "Ordered delivery with an estimated delivery time of 45-60 minutes. Unfortunately it didn't arrive until 2 hours later (ordered at 8:08pm and it arrived at 10:10pm). At that point I was half asleep and had already snacked enough to call it a night.\n\nI had been looking forward to the meal so it was very disappointing. I won't be calling or recommending their delivery service again.", "author": "Hailey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "Glad we returned.  People were so friendly.  Ordered pumpkin curry.  I hate curry, hubby hates pumpkin.  We liked it.  One caveat, we were asked for spiciness on a level of 1-10.  We said 7.  Tears were rolling, nostrils clear.  I like spice but maybe next time a 4.", "author": "Vickie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Party of 5: \nWe each order different dishes and were all very pleased with the authentic ambience and the beautifully prepared dishes. Everyone all agreed that this restaurant deserves 5 stars would highly recommend it. The service was excellent!", "author": "Angela H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "I've had several dishes here, all really tasty. I've done take out, and eaten in the dining room. Quick service and always good!!", "author": "Dale H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-22", "description": "It's an OK Thai place.  Not great, not horrible.  Service is fast and friendly.  Portions are a tad small for the price.  Duck plays a prominent role in their menu choices, which is a nice touch.", "author": "Lxs S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "Great service, beautiful presentation and food was awesome. We loved Chicken Satay, Beef Pumpkin  Curry over rice and Pork Pad See Ew.", "author": "DeAnn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-15", "description": "Update: ordered a veggie green curry a la carte, and it is legit! Full quart container with plenty of veggies and great flavor, including heat. A bit pricy at 13$ (I had a Groupon for takeout), but pretty worth it.", "author": "Shendi X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-29", "description": "Nope. Just nope. Not gonna waste more words. Mediocre food. Undercooked or stale meat. Not worth the prices they charge.", "author": "Marcus W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-17", "description": "The soup tastes pretty bad. It cannot be called a soup. It's like seafood boiling water with a few slices of mushroom floating on the top. Curry tastes ok...", "author": "Xin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "Very tasty! I got Thai fried rice with pork. Pork was tender and rice with onions and hot peppers was flavorful.  I got a little spicy and do recommend adding some extra heat.", "author": "Dani W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-23", "description": "When I did a search for Million Thai in order to jot down my review, I came across 3 business profiles.  Are they a chain, or did they move around a lot?  No idea, but I'm no local, so take that as you will.\n\nWe ordered one appetizer and three entrees between three adults and a toddler.  The Papaya Salad $7.00 (Shredded green papaya with tomato, green bean, ground peanuts, and dried shrimp in spicy lime dressing. Served with sliced iceberg lettuce.) wasn't my choice, but it was interesting, and not too spicy for this spice wimp.  The Pad Thai $11.95 (Stir-fried small rice noodles, shrimp, dried shrimp, egg, ground peanuts, tofu, and bean sprouts with red paprika powder and lime juice.) with chicken was my choice, but I didn't really like their version of my favorite sweet carb dish.  The Pad See Ew $9.95 (Stir-fried flat rice noodles and your choice of protein with egg and Chinese broccoli in sweet black soy sauce.) with pork was way too saucy, although it was nice of them to swap out the Chinese broccoli for the western stuff upon request.  There was also some kind of steamed vegetable with peanut sauce and rice that was okay, but a sorely less tempting vegetarian version of the Chicken Rama Garden I've loved at a restaurant in Boston.\n\nThe Thai Ice Tea $2.75, however, was good.  Service was fine.  And the kitchen was open along a counter.\n\nBefore we left, I noticed a sign posted on the wall offering their gift certificates at a 20% discount.  Please note that this was in early January, so it might have been the remnant of a holiday discount.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-29", "description": "Good kinda too expensive because they ll charge you if you bring one or more person :/", "author": "Yoshi-San T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "Stopped by Million $ Thai for a Wednesday night dinner.  Very small restaurant but most of the tables were occupied.  Started with the chicken satay and a glass of house red.  Chicken was tender and juicy with a spicy peanut sauce.  My main enter was the basil chicken with another glass of red.  Ordered a 7/10 spice level and didn't disappoint.  Spiciest 7/10 I've had but everything was great!!!", "author": "Bradley B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-18", "description": "They had much better service at their original location. There were two employees who assisted us and they both have some kinda attitude. It looked like they were there against their will. One time for less than a decade fake smile and foot dragging while walking. \nThere are hundreds of thai restaurant in town so try another one..,", "author": "Ali C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-06", "description": "!!!GLASS SHARDS IN MY FOOD!!!\n\nI recently ordered delivery for chicken green curry and there were shards of glass in my food.  I called the restaurant and asked to speak to a manager; the woman said that here was no manager in and told me to deal with it with EAT24. She did not apologize or try to rectify the situation in a humane manner.  Let me be clear, she understood that I was angry and that here was glass in my food and did nothing to help or console me. I am not sure what I'm more horrified at: the glass in my food or the way they handled it.", "author": "Thomas P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "Overall Impression: Worth it with a Groupon and convenient for take out / delivery. Definitely can satisfy your Thai cuisine cravings.\n\nCost: Close to 12-15 per plate. The Groupon at the time I bought it was 12 for 20 for take out / dine in.\n\nTaste: We got the Guay Tiaw Lord and Panang Curry, and specifically asked for spicy. It wasn't, and the hot pepper they served on the side was pretty weak. That being said, the curry has ample amounts of chicken, and the Lord had a lot of seafood. So thumbs up where it counts.\n\nCustomer Service: The cashier accepted credit even though we didn't meet the minimum (after the Groupon was deducted from the total).\n\nAmbience/Atmosphere: Not applicable since I ordered take out.", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "Up for the world series and first we went to a super yuppie bar with 27 dollar hamburgers.  Not our style.  We wandered down the street, saw that the game was on and thought, what the heck!  \n\nThe service was great, the food matches!  We asked for medium spicy,  and im still sweating.  But the taste was awesome.  We had something called Lard Salad that was wonderful. \n\nHayley had an icy desert that cooled her mouth perfectly. \n\nThe best part, dinner, drinks and desert, less than the hipster burger down the street. ..and no attitude! \n\nWe will be back!", "author": "Timothy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "This restaurant is the closet tastes of Thai food that you can find in San Francisco. The restaurant is very small and the parking is hard to find. Overall this is a good place to try.", "author": "Angkana P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "Excellent! Curry, fried rice... All!\nThe service was really fast... And kind! Good place for a conversation or a nice dinner! Near to my prefers hotels! Recommendable for a Thai food lookers!", "author": "Leandro L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "I love all the dishes here. Whenever I get thai, I always get the Tom kha gai (the sour soup with chicken) and crab fried rice... And then anything else that sounds good. So here at million thai, these dishes were the best. There is a lot of crab in the rice, and the soup is very flavorful but not overwhelming. And all the other plates were good too, no complaints. They always have a groupon deal, which is how I discovered this place. Only downside is parking of course. But expected. THe waitresses are aright. They aren't super nice but aren't rude. They do check up once in a while, it's a small restaurant, so why wouldn't they. Go here with a groupon. :)", "author": "Jamie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "Probably one of the better thai restaurants in the city! Great food that taste authentic and great portions. \n\nThe only thing is that parking may be hard to find so plan ahead.\n\nI will definitely recommend!", "author": "Arda S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-13", "description": "Was in SF on business and decided to try someplace new. Wasn't dissappointed, exactly, but not sure I'll do it again next time I'm there.\n\nThe Pad Thai \"Spicy\" was anything but. It was ok for sure, but not spicy at all.\n\nThey used small noodles, and at least my dish (my friends seemed to not suffer this problem) had clumps of noodles that had stuck together and not gotten stirred up, so there were bites that were just a ball of un-flavored noodles.\n\nThe staff was super friendly and attentive, but yeah overall an underwhelming experience.", "author": "john W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "Wow Im impressed. The pad see ew was amazing! Well seasoned and delicious. The noodles were fresh and smooth while the chinese brocoli was crisp and green. It tasted very authentic and ill come back here in a heartbeat!", "author": "Amanda T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-31", "description": "Just ordered delivery over eat24. The veggie egg rolls and veggie fried rice with tip for $22. \nWait was pretty long, the sauce package had opened up and was all over the spring rolls (thank god I like them soggy with sauce) and the rice was meh alright. Didn't have too much flavor, I'll order somewhere else next time", "author": "Caroline K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "Favorite delivery Thai place in SF. I always order the pumpkin curry with chicken, and it's always awesome.\nFor all of you spicy food lovers, this place is perfect since they don't play around when you order it \"spicy\".\nGreat pad kee Mao as well.", "author": "Sara C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-25", "description": "3 for food... 2 for Quality Assurance. There's specials are great, except our sea bass was still wrapped in Saran Wrap. I was trying to cut into the fish and I couldn't understand why so rubbery.. ahh, still wrapped in plastic. Waitress took it back and gave us 50% discount for the dish. I have had better.. they only had 2 tables including ours and how would the kitchen forget to remove the Saran Wrap.. tsk tsk...", "author": "Angel E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-20", "description": "Had the papaya salad and chicken pad Thai. Salad was underwhelming, papaya was not crispy, and it was overly spicy for \"medium\" spice. Pad Thai was also just okay, not particularly flavorful. I probably wouldn't return unless I happen to be there in the TL; and even then there are plenty of solid/good Thai restaurants throughout SF.", "author": "Will H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "This was some damned good Thai food!\n\nThe three of us came here, we were the only ones in the place, and for me that kind of makes me a bit nervous, but oh well. The service was attentive, and not at all rushed.  We placed our orders, with mine being the garlic/pepper pork, and my friends having some kind of curry dish, the only difference between theirs was the heat. One wanted +7 and the other got theirs at a +9.   I just boggeled, because I'm a whimp when it comes to heat, and get mine at a 0. \n\nThe food was absolutely delicious, they made sure our glasses were never empty and the tea (i had hot tea) was simply tasty. I will come back here before I leave!", "author": "Dianna B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-15", "description": "Food was okay, service was okay.Make sure you tip well or else your server will come back and show the \"tip guide\" to you and suggest you \"tip more\"", "author": "Melanie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-11", "description": "I had the panang curry chicken( red colored curry)  which comes with a side of rice so worth for me. I ordered spicy level of 5 which i thought will be a medium but it was far what i expected. I was feeling so hot in my mouth that the waitress asked me that i was ok ? I asked her weather could she bring the spice level down a little bit and glad they did it. I like their thai iced tea where they put flowered shape straws cover. This place is pretty small but for the food they offer, i will be willing to wait in line.", "author": "Alan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "As we were walking around town, the rain started coming down so we just walked into this Thai place go eat. It was pretty empty so we were greeted immediately. The place inside was nice and cozy, great food selection. We ordered the Pad Thai, and Thai iced coffee. The food came out very quickly, and the presentation was great. The food was very delicious, not too spicy. I would definitely recommend this local place.", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "Got 5 stars easily for TamTaad! Also my husband got the  soft crabs pad Kra Paow. I am Thai people  from Seattle still miss its all the time.", "author": "Jaywaleey V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "First time in SF, and first restaurant here! The staff is super nice, even showed us where to go and what to do! The beef soup bowl was bigger than my head! But it had too much of this one spice I don't like in it...(Anise? Cardamom?) so it sweetened it up a bit (and I am more into umami ^_^\n\nThe nam pork spare ribs are delicious! And my mom ordered this HUGE plate of papaya salad with different fixings which I've never had before (the fixings as a side) so maybe it's from Northern Thailand? It was SUPER spicy for mom--and she usually can take the ultimate amount of heat xD \n\nOverall great time so far and will be back again!", "author": "Kat K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-08", "description": "Excellent Thai food, plenty of seating and easy for a solo business traveler to get in and out. Loved the Panang Curry and Tom Kha soup.", "author": "Wes W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "Yummy yummy in my drunk tummy!\nPut some Spice in that Rice!\nLots of Food Puts me in the Mood!\n-Roselle's Bachelorette Crew", "author": "Ellen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "Another perfectly decent, tiny Thai restaurant in downtown SF. Like others, the interior is tiny and packed and there is often a wait. It is right across the street from the Hilton, so it seemed to be packed with tourists and local business people on lunch break. The service is quick and a bit impersonal. We ordered standard Thai options and were happy with the results. Tom yum soup was a nice spicy-sour blend. Good ingredients, identifiable chicken parts. No complaints. Overall, a good option if you happen to be in the area and avoid the lunch rush.", "author": "Angela P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "Wonderful food and really close to our hotel. Had the seafood spaghetti. Would recommend it.", "author": "Gabriela F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-31", "description": "Ordered delivery through EAT24. The food arrived in less than an hour but we were less than satisfied, especially after having read all of the positive reviews.\nThe Duck Fried Rice was tasty but the rice was steamed, not fried. The Tom Ka Gai was  okay but it was almost all broth and the Papaya Salad was just okay-nothing to write home about. The Pad Thai and the Pumpkin Curry were definitely the best dishes we tried. \nWe will definitely dine inside next time.", "author": "Sasha A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "Soft shell crab basil.... Simply fabulous! A nice little jewel near the Golden Gate Theater", "author": "Marcie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-05", "description": "I get takeout here almost every day lol, love the food and they are really nice :)", "author": "Christine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-07", "description": "I really like this place. Good pad see ew and cashew but chicken. Our waitresses were really kind. \n\nNo wait, great and fast service, authentic taste.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-18", "description": "I was staying at a nearby hotel and decided to drop in for dinner.  I had the fresh spring rolls which were OK, they slice them in pieces rather than in half I suppose to look fancier, but what they don't realize is that this make all of the stuff fall out. They have a sauce which they described as a \"sweet brown sauce\" (tasted of hoisin) but then they make a happy face with YELLOW MUSTARD in it. This is wrong for so many reasons other than it tastes like crap. I'm not a huge fan of peanut sauce, I prefer sweetened fish sauce with fresh rolls as this is what I had in Bangkok, but yellow mustard happy faces in \"sweet brown sauce\" is just wrong.\n\nFor my entree, I had the pumpkin curry which was pretty tasty although a bit sweet. The service was good, very attentive. The interior is pretty small and you will find yourself sitting toe to toe to fellow diners, Somewhat expensive - 2 beers, curry and spring rolls were $30 less tip.", "author": "Randall D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "A really nice find. Unassuming, comfortable vibe with a no-frills, vanilla menu (phad Thai, \"spicy hot basic leaf\" - etc. etc.). Very high-quality produce, though! It's not often that I see a $10 plate of Thai food cooked with actually-fresh holy basil, fully-colored (no blackening) bird chilies, crunchy cabbage - and so forth. A wonderful meal with surprisingly-good flavors - I'll be going back to this hole-in-the-wall next time I'm in town.", "author": "Erin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-13", "description": "Did they changed ownership after relocating from 5th and Mission? It sure felt that way to me because the quality of food has gone down drastically. I used to always order my lunch from their 5th & Mission location and had loved the food, the portions were great for the price. \n\nCame here for an early mother's day brunch with my family and the in-laws on Saturday and I am bummed to see all the changes they have. The food portions are small and it doesn't taste as flavorful as before. I ordered the Thai Roti and it was over cooked to the point where it was almost burnt. My husband ordered the Pad Thai and I took a few bites, it doesn't have any flavor... \n\nThe new location is a lot smaller by comparison but everything else is also smaller.. Sad to say all King of Thai chains are pretty much out the widows these days.. If you want authentic Thai food make a trip just outside of Downtown area and go over to Thai House Express on Geary and Larkin. Now that is authentic, tasteful, and flavorful Thai food.", "author": "Jenny G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "Authentic Thai food and great service. My family always come to this restaurant every time we gather in the city.", "author": "Namtan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "Great food and service. Very accommodating to dietary restrictions.\nThe atmosphere is very cosy and its a great food deal for sf.", "author": "Siatta A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-31", "description": "We had the pad Thai and the Thai fried rice.  Solid on both counts.  Would've been three stars but it was pretty cheap so I popped it up to four.\n\nService leaves a bit to be desired but it flew.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "We had pumpkin curry, spicy eggplant & larb. Great food. Nice quiet place w/ good service. Don't be throw off by the neighborhood.", "author": "Toi E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "I had Vegetarian spring rolls and vegetarian Tom Kha Soup.  I ordered delivery, it took an hour, but when it came it was very hot and fresh!  The spring rolls are simple with more sesame flavor than fresh mint, but still good.  They didn't give me a napkin or silver wear so if your ordering delivery to your hotel like me keep that in mind.", "author": "E C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-26", "description": "It was not the best Thai food I have ever had.  However, the bowls of soup were huge and enough for a meal.", "author": "Marcie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-18", "description": "Great food and Thai tea. Service was a tad slow for the ordering process but they made up for it with the delicious food. We ordered chicken satay, panang curry with chicken and yellow curry with chicken. Groupon worked great and it's right next to Hilton Union Square which was very convenient!", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "Had the Sweet and Sour Shrimp and Chicken.  The vegetables were nice and fresh, the volume was plentiful and overall it was a great meal.  The service was prompt and attentive, especially when I added too much hot sauce and started to tear up they were promptly refilling my water.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "Pumpkin curry mmmmmmmm! Best pumpkin curry I've tried anywhere. Rich and had variety of veggies. \n\nThai tea is not pricey. \n\nI would come back to try more items.", "author": "Veranna N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "The sauce for the Tofu in the appetizer platter was phenomenal.  Singha, Thai Beer was served in a ice cold mug, fantabulous!  The rice in the dishes were shaped like a reverse snowcone - cute.  Service was great, fast and accurate.", "author": "Jim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "I had Thai iced tea, fried rice, & coconut soup inexpensive, quick service, nice waitress! Food filled me up and tasted fresh.", "author": "Victoria G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-21", "description": "Very good food. Big portions and everything is fresh. Would recommend it.\nPrices are fair, enjoy your meal.", "author": "Lorraine N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "I have to give everything 5 stars! The shrimp in the shrimp rolls tasted amazing! Medium spicy Panang curry pork over the white rice was delicious. My boyfriend had it over the pineapple fried rice, which was to die for on its own. And last but certainly not least the soft shell crab basil! Mouthwatering!! I would definitely come back", "author": "Angie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-25", "description": "The worst restaurant experience of my life.\n\nThe yellow curry was not good. It was mostly potatoes. WHERE WAS THE CHICKEN?\n\nEverything was terrible.", "author": "Leslie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-17", "description": "Definitely a fan.  Not a big place, but they were very quick and the food was great. I really enjoyed the Beef Pad Se Ew, my coworkers who dined with me all enjoyed their meals.", "author": "Alicia M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-08", "description": "First of all food, is just decent. Nothing spectacular but nothing bad. \n\nNormally I don't give a star for bad service but this was bordering on malicious. Four of us come in, we order our appetizers, drinks, and food all within 10 minutes. We then wait about an hour for our food to arrive, everyone else gets their food. We ordered fried rice, yellow curry, and lemon chicken. Nothing complicated and our ladies next to us get an entire roast something that looks complicated to cook BEFORE US. \n\nAfter all that, for a party of 4 there's a mandatory 18% gratuity. \n\nI CONDEMN THEE MILLION THAI RESTAURANT!", "author": "Rohan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "Million Thai is ALWAYS on the itinerary when we're in San Francisco! Their fried rice is to die for. The dishes come out looking so beautiful and everything we've ever gotten was spectacular! Fried Chicken and Fried Rice as well as the Roasted Duck and Fried Rice are two of our favorites. Also, try the Shrimp Rolls and their Thai Iced Tea!!!", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "Four stars for exceeding expectations on both the food and service front. If you are looking for a romantic dinner place, look elsewhere, but if you are looking for some very good Thai food in this less than stellar food area, delivered by very attentive and sweet staff, then come on in. The panang curry we well executed with good flavor, heat and mix of protein and veggies. The thai iced tea was not too sweet, but flavorful. Good place for a lunch or quick bite on the run.", "author": "Jason M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "The place is nice and clean, though not big. Food is very good and inexpensive. The only reminder for ppl is that the curry is very spicy even I selected mild.", "author": "Angela J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "One of our favorite places to come when we are in SF. The food is always so good!! The Pad See Ew and the BBQ beef is amazing!! And of course you always have to have dessert -- mango and sticky rice!!", "author": "Jenn R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-23", "description": "This restaurant is serving fucking bullshit food plus bad service. I ordered pipapple fried rice tonight. The taste was horrible. It was too plain and I didn't taste curry or anything at all. I was eating like a just plain rice. When I came here for the first rime, they charged18% gratuity for only two people. Second time I orderd vege fried rice and they put too much pepper and I didn't taste anything except pepper. WTF.\nI won't go back any more. This place is hopeless.", "author": "Pefy J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-09", "description": "Other than the food is too salty, I saw a little cockroach busy crawling around right next to my right foot as I was signing my check. Kinda regret didn't speak up then...", "author": "C C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-29", "description": "I'm so disappointed! I came to this place coz of the reviews on Yelp but since the first second walked through no one talks like they don't want to sell foods. I'm not leave in this area. I'm on vacation and need to eat a good food. That why I came to this place. I'm not asked for free food! Please talk to costumer more nicely. Actually I'm not a picky who like to complain everything. Just give anyone and ideas who you want to come this place!-thanks", "author": "Panvira T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-24", "description": "Their pad thai is really not the best. It tasted un fresh, not flavorful, just a huge amount of noodles all stuck together and too thin. It didn't taste like pad thai. I went after seeing good reviews on Yelp but i am super disappointed. Really never going back.", "author": "Jane C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "I have been here so many times and never be disappointed at all. Food is very delicious. I order crab meat fried rice and I love it!!! Service is very good as well. The waitresses are very nice and smile all the time shen they talked with me. I recommend this place and will go back for sure", "author": "Ami P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-14", "description": "This place is good. We here for papaya salad and pork liver salad and fried fish.", "author": "Saranya P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "I've eaten at Million Thai Restaurant twice. Both times the food was excellent. I had got Thai tea which is a Ceylon or Assam tea-- a little smoky and very good. I had shrimp roll appetizer which were shrimp wrapped in rice paper, fried and served with a delicious dipping sauce. I've tried two entrees: the fried chicken over fried rice (delicious crispy chicken and fantastic fried rice) and pad khee mao (wonderful flat fried noodles with green beans and bell peppers). All items are beautifully presented with fresh flowers and artistically cut fruit and vegetables. The pad khee mao had an option of choosing a 1 to 10 level of spiciness. I had a 3 and it was still very spicy.  \nThe staff were friendly and helpful, frequently checking on us and refilling drinks. I definitely recommend!", "author": "Julie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "I've had a lot of Thai food since I lived in NYC and I have to say that the food here was really good.  The ambiance is 3 stars, but the food and service was 5 stars, so I think the place deserves 5 stars.  I came here with my family and we had pineapple fried rice (really delicious), pumpkin curry (really really good), pad thai (good, but nothing stellar), pad see ew (good).  Great place to go for a low key dinner.  Excellent food", "author": "Michael S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-23", "description": "I'm torn. I recently ordered delivery from Million Thai through Eat24 and had a mixed experience.\n\nOn the one hand, the pumpkin curry (got it with chicken) was really delicious. However, the pad see eew (got it with beef) was REALLY bitter - it didn't taste right.\n\nAdditionally, I had to send back my order and get a new order because there was a  hair in my curry and shards of shattered plastic in the pad see eew. There was still shards of plastic in the second pad see eew I got - they need to figure out their packaging. It would have been nice if they had offered some type of refund... It's quite disturbing to find foreign objects in your food.\n\nI'm thinking the dine-in experience would be better, but I think I'll stick to other local Thai spots for delivery.", "author": "Rachel O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-21", "description": "Horible service with nasty attitude. Food was ok, but the thin short hair waitress \"Ning\" had everyone's food mixed up. I asked for extra ice since the water jug was room temperature and she gave me a dirty look. Then when asked for a copy of the receipt she practically tossed it at me and made a sweeping motion with her hands telling me to go away now. Poor poor poor service! I will never go to this place again!!", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-14", "description": "Great food (what the rating is for). Uber Eats totally screwed up the meal by forgetting an item.  You should cancel your relationship with them as they are screwing up your reputation.", "author": "Scott V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-01", "description": "There's a multitude of Thai restaurants in the Union Square area for reason and we ended up here just out of convenience. We tried Chabaa but that place was tiny and we had to wait for a table.\n\nSo at Million Thai, no wait needed. Interior was small but relatively nicely decorated (less of a hole-in-the-wall like Chabaa). Wait-staff took our orders promptly and we were soon munching down on stir fried beef and egg plant over rice along with a large bowl of tom yum.\n\nBeef with egg plant - sweet tasting for American tastes but nothing spectacular - Average\n\nTom yum - mushrooms and chicken floating the soup. Not robust and tart as usual. Soup also tasted sweet and ingredients were a bit sparse. Below average.\n\nConsidering the sheer number of Thai restaurants in the area, Million Thai doesn't make the cut.", "author": "Norman S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Food was delicious - we got a pad see ew and an orange curry, and both were so flavorful! Delivery was fast too.", "author": "Michelle A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "Great taste papaya salad \"Tum Tard\" A Must Try!\nThis place has authentic Thai food.\n1-10 level of spicy you can choose, 7 is pretty hot and good taste for me.", "author": "Mewadee R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-25", "description": "Used a Groupon to order takeout, Pad Kee Mao and Thai Chicken Satay, order was ready in the 15 minutes it was promised, food was tasty, chicken was not tender but was ok.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "Some of the best Thai food I've ever had! Everything was so fresh and tasty! We waited a bit long for our food which is the only reason I didn't give it 5 stars but it wasn't a big deal. We will be back for sure!!", "author": "Tristan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-19", "description": "I ordered a chicken dish (garlic pepper I think) with brown rice. The rice tasted like it was 2 months old and was made of plastic. I asked for a fresh batch and they said they were out of brown rice - which probably means they initially dumped some leftovers on me. I got white rice instead. After tasting a couple of chicken strips I felt like my mouth was on fire. Incredibly spicy dish, not flagged in any way on the menu. I decided to pay and leave without finishing, will never go back.", "author": "Catalin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "Came here the other night with a Groupon. The husband and I arrived 2 minutes before the kitchen was closing, however the staff was very friendly and let us stay to eat in. I ordered a tofu yellow curry, and the husband ordered the yellow pumpkin curry. Both of our dishes came out quick, hot, and to our liking. We will definitely come back.", "author": "Tracy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-18", "description": "The food tastes pretty bad. Went there just because I saw 4 stars from Yelp. Really have no idea why they have 4 stars review! I would never go back! Don't trust the review here!", "author": "Grace C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-06", "description": "Be careful with this restaurant they try to robe you. Pay attention carefully with your receipt.!!!!!!!!!!!!!\nI went to this restaurant few times the food was pretty good\nAnd little bit pricy. I don't mind as long is good.\nIn front of the restaurant there is the sign pat thai lobster $14\nSo I older fried rice lobster substitute pad thai with fried rice with thai ice tea.\nThe food was good but all the lobster is just bull shit they just give me the empty lobster shell and they charge me $26 after finish my meal in my receipt $26 for the lobster fried rice and $2.75 for thai ice tea.\nAnd they charge me with gratuity $5.18\nWhat in the world, I make a complein with the waiters you not suppose to charge with gratuity becouse gratuity is for party of 6 not for one person  and she said is because the tourist area. What the hell that is tenderloin what she mean tourist area. \nNever ever return to this scary restaurant.", "author": "Susan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "There are gazillion Thai restaurants in my neighborhood, but I discovered this cute place in the Union Square area through Groupon, and it has become my favorite takeout ever since. The Pad See-Eew(sp?) and Green Curry are some of the finest I've ever tried, among other dishes like the Papaya Salad and Satay, and the staff is always welcoming and friendly. I'd like to return for a dine-in experience to enjoy the tropical decor and a very casual ambiance in the near future, though street parking in this area is a challenge. Thanks to Groupon for introducing me to this hidden gem!", "author": "Yumi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "Great food and great service!!!!!!! Attentive servers... Deliciously prepared and beautifully presented dishes!", "author": "Ella H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "We relied on Yelp to choose this restaurant.  The yellow curry with chicken was excellent as was the Thai fried rice with pork.  The service was efficient and the food came quickly.", "author": "Jerry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "Staff was friendly and fast. Food was tasty and a deal for its quality. I recommend the calamari salad and one of their curries.\n\nThe shrimp rolls were also very good.", "author": "Chele D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "I've got somewhat mixed results ordering here. First time I got hot thai tea, pad see ew, and panang curry. At first I thought the pad see ew was kind of tasteless, but it turns out it was just because the sauce had kind of all fallen to the bottom, so the lower noodles were quite tasty. The curry was also delicious. The rice both times also tended to be kind of mushy, which was sad.\n\nUnfortunately, the second time I ordered from them the results were no where near as good. I ordered green curry, pad thai, and hot tea again. The green curry was ok, but the panang was definitely better (I generally prefer panang anyway). The pad thai was kind of meh. Worst of all, the \"hot\" tea was, at best, luke warm. I mean, they put it in a plastic cup (previously it had been in one of those cups you often see for coffee to-go), so it clearly couldn't have been that hot to begin with. It also tasted like barely flavored water more than tea.\n\nI'll probably give them another chance, so I guess I'll see what the final verdict is.", "author": "Emily F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "Great food and service. Had the Pad See Ew and it was delicious. This is my gauge dish when I first eat at a Thai restaurant. Nice people and pleasant decor. I will be back for sure!", "author": "R M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "This is the first place I have dinner when I come to San Francisco. It's almost like coming home. It's an tiny unassuming place. But the staff are lovely. And then they give you a hot towel to wash your hands. The fresh prawn rolls are excellent and look like a simple sushi roll. \nPad See Ew with duck is amazing.", "author": "Eric J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Million Thai is a quaint friendly restaurant. You can relax with a beer or wine and not to mention delicious apps and meals. Even tho I saw amazing meat Idishes, being vegetarian i was impressed with vegan and vegetarian options. And the sweet pretty waitress let me know they were more than glad to substitute tofu for any dish. Also located in a terrific location.", "author": "Laura Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-27", "description": "The delivery was over 40 minutes late. I called several times to ask what the status of the food was, and they just kept saying that it was \"on its way with the delivery person\" - clearly not true. To add insult to injury, one of the plastic food boxes was smashed when we received it, and the food was filled with small plastic shards. The food was marginal at best. Would not order again.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-15", "description": "Awful.  I've been here twice and both times were bad experiences; I honestly don't know how the reviews are so positive.  Tourists perhaps?  Tonight I called in an order for Salmon curry and when i arrived my bill was almost $20.  WHAT???  I have ordered this dish at almost every Thai restaurant in the city and never paid over $16 for a tiny dish of curry (I didn't even get rice!!!)  On top of that I was very emphatic that it be cooked medium rare.  What did I get?  The driest most crusty piece of fish imaginable with two slices of squash and... oh wait I just found a single mushroom, eureka!  Never again.", "author": "Alicia B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-16", "description": "Wow. Absolutely wow. This was a first. \n\nMy order came 1 hour and 25 minutes after ordering. I was told it was gonna be 45 to 60min. But whatever mistakes happen. \n\nHOWEVER when the driver came he immediately said \"hey so you didn't tip enough on the order.\" That was the first thing out of his mouth. When I complained for being unwilling to tip more he reacted horribly. Wow.", "author": "Sam P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-22", "description": "The service was alright, I think it could have been better. The noodle was a bit bland. Other than that everything taste great.", "author": "Bebe P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-01", "description": "Just ordered delivery from here at work. I got fried egg rolls and pad see ew.  I asked for medium spicy and it tasted like no spice, but luckily I had some SriRacha.  Otherwise the food was very tasty.", "author": "Angela R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-14", "description": "The servings were especially small and not worth the wait or the money spent. There was less that a cup of basil chicken and more sticky rice than necessary. The green curry chicken had good flavor with not much chicken at all.", "author": "D J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-23", "description": "The food was really good , but they are not sanitary at all. I saw the lady sneeze all over, didn't cover her mouth, then she came out of the bathroom with her disposable gloves still on gross. Now I have a horrible stomach ache.", "author": "Denise R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "Great food.  It's my favorite go to place when I'm staying in town. Fresh Rolls are very good and green curry is excellent!", "author": "Jim M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-12", "description": "Nearby my hotel, easy to find. Service was good and food was good. You can never go wrong with Tom Kha or curry. My daughter likes noodles so the noodle soup. There isn't much room but anything with a party of 5 or less is good.", "author": "Sally K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "10% discount! Yaaaaaaaay! The food is good and they actually make it spicy for you... just like Thailand.", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "So good, the food takes a bit of time (because they are so busy) but it is worth the wait! The yellow curry and pad tai were fantastic, some of the best I have ever had. I highly recommended this place if you are in the city and not in a huge hurry!", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-18", "description": "Tried a new dish and the Guay Tiaw Lord is amazing! Glad to know last time was just an off day. Great food and service!", "author": "Bradley V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-11", "description": "If you are visiting the downtown area and need a break from your shopping, then I really recommend coming to this place. There are many other thai restaurants nearby but this is far my best place to go. My bf had the bbq short ribs and I had the pad thai beef. I tasted the short ribs and they were okay but I really loved the pad thai beef. I also order the chicken satay which was a good portion ( 5 skewers ).", "author": "Maria T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-23", "description": "Ordered for delivery. Beef in the pan fried noodle dish was ground beef and unappetizing. We got a 3/10 for the spice level and it was so incredibly spicy our lips were burning for a while. Also tried the garlic chicken with white rice. Dry chicken and it was pretty bland. Overall, very mediocre Thai food. Would have give a 2.5 but that's not an option.", "author": "Tal A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "This was by far some of the best Thai food I've ever had. And I live in NYC. We've got some good Thai. But this food was so fresh, spicy, and delicious. I got the pumpkin curry and had to wait a while for my take out order , but it was well worth it. Plus, it's a family business with mom cooking everything up fresh, so you know you're getting something good. The next time I come to SF, I will be heading straight to this place. Yum!", "author": "A H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-25", "description": "Tried this place a couple times. Don't waste your money. Food is okay but the customer service is atrocious. Almost every dish was not as ordered and they tacked on gratuity for a 3 person bill (I suspect they knew we'd tip poorly for the sub par service). My friends decided we shouldn't say anything about it, but honestly I felt robbed after I left.\n\nInstead, checkout katana ya. It's sort of close and they have great dishes.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "So far this is one of my favorite places to go for curry. I had the yellow curry, my friend the pumpkin curry, and another the roasted duck soup... All the dishes were great! The curry flavors are well developed, the duck broth was amazing! Also the staff is super nice and super friendly. I totally recommend  this place!! Oh and their Thai tea is awesome, hot or cold!", "author": "Cassie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "i am hanging out with my friends here.  we really enjoying the meal here.  Angel wing is really nice!!!!!", "author": "Secret L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-17", "description": "Today I needed a quick bite, was in the mood for Thai food and remembered my fave Thai restaurant on the corner of Taylor @ O'Farrell only it's gone now, the new place is called Million Thai. I gave it a try and glad I did. My favorite dish is the Kao Gra Prow with sautéed ground chicken, bell pepper, thai chili and basil served over steamed rice; it's all about the basil and chili! I started off with the cucumber salad, perfect sweetness and tart flavor with red onion. They have a special right now, free Thai Iced tea with your entrée' order. \n\nThe staff was pleasant, the food was easy on the eye to look at and tasted wonderful, I'd definitely go back.", "author": "David P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-30", "description": "During our recent dinner visit the dining room temperature dropped like 30 degrees as new guests arrived or exited making for a less than pleasant experience.  We ordered soup first with the request to bring our entrees after.  The  entree's arrived before we finished the soup against our request.   We requested chop sticks which required a second request.   Though it wasn't described otherwise on the menu, the almond chicken was served fried (and rather greasy)  rather than sauteed as we have had it elsewhere.  The pumpkin curry was very good.", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "Amazing Thai food!!! We ordered delivery, we had Tom Yum Gia, Yellow Curry Chicken, and Veg egg rolls! Delivery took exactly an hour. When it arrived I opened the door to find a young man with a bicycle and helmet holding my bag full of food and the biggest smile, he immediately apologized for breaking the container for my soup, but reassured me the continents were contained within a bag and instructed me to just pour it into a bowl. After sorting out the bag we took our first bites....I fell in love! I told my husband I didn't care if my soup would have come in a shoe, it was amazing! How that kid managed to deliver hot  delicious food and crispy egg rolls on a bike in the cold is talent!", "author": "Krystal T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "Got a groupon $12 for $20 worth of food. Service was fast and friendly. Food was delicious and they had beautiful orchids on every dish!", "author": "Sierra R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-05", "description": "Tried the yellow curry and it tasted delicious, though it was more watery and less coconut milk than I'm used to. But again, still tasty. Also the staff was very nice.", "author": "Sophia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "We happened to be staying right down the street from this restaurant, so by the end of our trip, we had dinner here. What stood out most was their presentation. When you order a Thai iced coffee, they present it to you with a rose made out of the straw's wrapper. When you order pineapple fried rice, half a pineapple is hollowed out to act as your bowl! It is a very enjoyable experience!\n\nFood highlight: pineapple fried rice", "author": "Ashly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "So good yummy my favorite food tonight Roasted pork nuked A+++ .1-10 I will rate them 10++", "author": "May B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-17", "description": "It was delicious! I like the duck curry! \nThe Padthai was good too! Try the Thai roti! \nEverything was good! Like it! Like!", "author": "Jing W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-05", "description": "I order a Thai style rice(chicken). The rice taste pretty good but the chicken is a bit old(?). I will definitely come back and try something else. It's a good place to eat and pretty connivence if you shop around downtown.", "author": "Chris Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-15", "description": "My favorite Thai food downtown. The staff is great. The food taste just like it does in Thailand. Make sure you order the laab ped", "author": "Daniel N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "Came for the pumpkin curry because we heard it was good, and it WAS! Loved everything we had!!!! The pineapple fried rice was a group favorite, as was the scallop and avocado curry! Thai tea delicious Yum! Would definitely recommend this place, service was great :)", "author": "Madi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-15", "description": "Had the pad Kee Mao. It was amazing. Nice large portion. Had the mango sticky rice, always one of my favorites. Right next to the Serrano hotel. I would recommend this to anyone wanting good thai food in the area", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-12", "description": "The food LOOKED good but...\n\nSmall portions, everything was overpriced\n\nThe pad thai was bland--the waiter recommended we get it with prawns. There were no more than 3 prawns.\n\nSeafood fried rice was also bland.\n\nBBQ beef was DRY and overcooked.\n\nservice was meh... waiters/waitresses were not attentive, they were too busy chitchatting with each other and playing with their phones.\n\nDefinitely will not be back.", "author": "Carrie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-02", "description": "Ugh. Not so great. I ordered delivery via Eat24. Through the online order, I specified EXTRA TOFU in the soup. The food took well over an hour to arrive. The main reason for two stars: there was no tofu at all in the soup, despite specifying extra tofu (and being willing to pay a bit extra for it). The vegetarian fresh rolls were good.", "author": "Karen R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-29", "description": "Found out that they charged me full price even after I showed them Groupon. \nWorst experience.", "author": "Steven L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "Excellent Pork Knuckle and real Thai style Papaya salad. I am happy to have stopped in on a cool fall evening for a tasty Thai meal. They have plenty of beers on tap to choose from, along with spicy papaya salad.", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-13", "description": "Million Thai used to be around the corner from my loft, and I ordered from them all the time.  I loved their food, even though in truth it was totally overpriced.  So I was kinda bummed out when they moved locations.\n\nTonight I wanted to order Thai, and decided to use GrubHub to order dinner from them.  We ordered $80 worth of Thai food at 7:30pm.  It is now 9:28pm.  They have updated their delivery time 3 different times, and then claimed that they tried to deliver to this address 30 minutes ago (which still would have been over an hour later than their original estimated delivery)  but that when they called my number, someone in NY answered.  Clearly the delivery driver doesn't know how to use a mobile phone.\n\nI just got off the phone with both GrubHub, and Million Thai, and they said \"15 more minutes\".   I told GrubHub to GFY & that I'll be charging back the order, and they said I will never be able to order through them again if I do that.  So *if* the delivery driver arrives with my order of thai food that sounds like it's been sitting in a car for over 2 hours, I'll still get to pay $80+ for what has essentially become well traveled leftovers.\n\nNo wonder the name Million Thai.  This business clearly wants to make a million based on poor customer service.  \n\nAnd ruin my Saturday night.\n\nThanks *ever* so much Million Thai.", "author": "January S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-06", "description": "To be honest, my girlfriend and I was looking for Osha Thai for thai food. It was a date, so I wanted to take her to a fancy place. Unfortunately, Osha was closed (Christmas), and I decided to give this place a shot. \n\nAs we stolled down the block towards this restaurant, we became more and more distraught as the buildings became shittier and the streets dirtier. My stomach clenched. I thought I was about to take my girlfriend to another shitty place. How many bad dates can she handle? I cried a little inside.\n\nWhen I opened the door, the place sparkled with fancy wine glass and the waitresses greeted us with smiles. The place was sparkly and inviting, I felt like I entered a new world. We sat down, looked at the menu, and ordered.\n\nMy girlfriend ordered beef stew. I munched on her beef and slurped her soup and it was really good! What really blew me away was their Roti Prata with curry (appetizer). It was really really good Roti Prata, unlike any I've ever had. Most stores sell thin and crunchy Roti Prata, but this store's roti prata was thick, chewy, and I enjoyed my little slice of heaven.\n\nI ordered green curry with rice. How spicy (1-10)? 8. It was very spicy. These people are not afraid to put spice in your dish, so if you enjoy spicy food you will love this place. With sweat dripping down my face and mouth drooling with chilli, I looked my girlfriend and she was happy.\n\nIt was a good date, we walked out of this restaurant bloated with happiness.\n\nP.S. At the time, there was a coupon on YELP that you can buy for a discount. After the meal, we bought the coupon, showed it to the waitresses, and they knocked a hefty chunk from our receipts. It was probably one of the tastiest, cheapest date I've been on that month.", "author": "Song Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-02", "description": "Got my delivery order wrong. Incorrect noodles, none of the dishes were spicy (we only wanted one of the dishes to be mild), and they forgot the chopsticks we specifically asked for. Even if they got it all right, the quality and portions do not justify the price.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-30", "description": "My husband and I were traveling in San Francisco and decided to try this little Thai spot. The staff was friendly, attentive and the food was excellent! The perfect amount of spice, beautiful presentation and very reasonably priced. The restaurant is clean and quaint. As in all of San Francisco, parking is tough, but the restaurant is just steps away from the muni lines 19 and 38. Made for an easy ride to and from our place of stay. I would definitely recommend!", "author": "Trina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-29", "description": "Lovely food. Quick service. Everyone is really warm. A must go Thai place if you're in this area", "author": "Tanya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "The food at Million Thai is absolutely fantastic. Some of the best Thai food in SF. Don't let the location or the small, informal dining setting concern you. Everything on the menu is fabulous. My favorite is the lemon chicken (it's grilled to perfection).", "author": "Kathleen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Very good Thai food! Run by a Thai family husband and wife. Small dinning area and only one waitress on the flood. But is still very busy even at 2 o'clock in the afternoon. Will come back next time and try something else!!", "author": "Kristine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-22", "description": "This place was right next to the hotel we were staying at in SF, and we walked by, the greeter offered us a 15% grand opening discount--well, who am I to refuse a deal?\nThey offer free delivery too.  And we ordered that the next night, if that tells you anything about how much we liked this place.\nAt the restaurant, the service really shines--a washcloth brought for each person before your meal is a very nice touch.  As are the fresh flowers in each dish.\nThe food is solid.  I can't say I'm a Thai food expert, I just know what I like, and I like Million Thai's food plenty.", "author": "Ken V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "This is my 2nd time eating at this place and again.. we all enjoyed our food, We were lucky to be visiting SF again and since our first visit to this restaurant was very nice, we made sure to come back again. We did not make any reservation and we were a group of 5 and they managed to sit us immediately. The only issue, the restaurant is very small and they get a lot of take out orders being picked up. And the fact that SF is very windy, every time the front door is being opened, you get cold air coming in and your food gets cold very easily. Other than that, I really like the food at a decent price!!", "author": "Mauritz N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "Awesome authentic thai food! Its hard to find good spicy thai food but this place was delicious. Thai iced tea and pad kee mow was delicious!", "author": "Tori J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "Be awesome Thai restaurant. Today, I tried duck noodles soup that it was great. Let's get it", "author": "Aooair A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-07", "description": "Pad Thai was flavorful and delicious, I went for lunch and sat at the bar chatting with the staff, so that may have helped.\n\nVery friendly staff. \n\nThere seems to be a prolifriation of Thai food places in the area with good reviews, but I think you should try this one as well, clean, friendly and delicious.", "author": "Scott P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "i am thai and to be honest, million thai has the best option for thai food. they provide alot of variety and the flavor is closest to the food in thailand. i like to order thai salty crab papaya salad (som tum poo plara) and bbq pork (khor moo yang). i come here very often for dinner with my friends. i always have the soft bone pork soup (tom zaab kradook moo) which has a different flavor than other restaurant. \n\nas a regular customer, i will be back again.", "author": "Chuthamas W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Best Thai Place in San Francisco! OMG their noodles are amazing and I love the Thai tea as well. The service was exceptional and they really attended to our needs. I definitely recommend this place and will surely be coming back next time I visit San Francisco.", "author": "Oscar R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-03", "description": "I like this place since it is very close to my work. The three times I have been here I have stuck with the Pad Thai. Their service is good. I have heard mixed reviews about the Duck Noodle soup. The last time I came here and tried it, it was wayyy too sweet. Guess I'm just gonna stick to my Pad Thai.", "author": "Vanessa Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-22", "description": "This place was awesome the pad Thai was amazing and the fried rice was good but it was too much.the Thai tea was like the best I have ever had . The shrimp rolls were really fresh", "author": "Mustafa R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-01", "description": "This location is very different from when they were located on 5th St. near the Westfield Center.  If you like authentic Thai food, go to their Van Ness location.  If you like bland Thai food, than this may be the spot for you.\n\nSeriously, I ordered Som Tum Poo Pla La (Papaya salad with raw crab and fermented fish sauce) and I could barely tell there was any sort of fish sauce in the dish.  In fact, I think it was regular fish sauce diluted... not even the fermented kind.  I also asked for Thai spicy and it came out falang mild!", "author": "Dennis Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-16", "description": "If you are in the area for conference or work this is a good spot for Tasty freshly cooked Thai..its not a fancy place but doesn't need to be food is excellent. Prices really good. Spice levels on 1-10 for any dish so you can have it as mild or spicy as you like.. I did a 6 and was as spicy as I would go whilst still retaining taste.. Fresh rolls, softshell crab and the curries are great..  I'm sure there are fancy places in SF.. But my feet were killing me after DF14 and it was opposite my hotel . Staff really polite. Food excellent. Good value for money.", "author": "Trevor A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "So I couldn't help myself. Brought some friends for round two here!! Everyone loves it. Servers are nothing but kind and attentive. The only warning I would say is be careful rating how spicy you like things. Five really means a 10. ;p I would recommend a 2-3 when they ask and it will taste perfect.", "author": "Alana P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-21", "description": "Waitress \"Ning\" was not friendly and could not get our order right. Food was ok but very slow coming to table even though it wasn't busy. Then the orders were mixed up when it got there. No refills, bad service, and negative attitude resulted in a low tip. \"Ning\" saw the low tip as we were walking out and directed a negative attitude and comments to us. We won't be back.", "author": "John A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "Enjoying some awesome Thai food on Valentines day. The Thai soup was just delicious with such great flavor..", "author": "Jose P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-28", "description": "Not a bad place considering we stumbled on it walking around union square. \n\nWe ordered Tom Kha soup, Red Curry and vegetarian Thai fried rice. All of them tasted pretty good and flavorful. In addition we ordered a bottle of 2010 J Lohr \"Seven Oaks\" Paso Robles Cabernet Sauvignon which paired with the food pretty well. \n\nTom kha, though tasted good, didn't taste like tom kha may be it's a different spin on it. Definitely a place I would go another time when I am in the neighborhood\n\nThe service though not consistent was adequate.", "author": "Ravi C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-19", "description": "I saw one chef didn't take his gloves out while smoking outside and still using the old one when he got back to work. So.... disgusting.", "author": "Lovely B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "I love this place so much, this's my second time here I'd like to say everything's amazing here. Here's my favorite Thai restaurant in SF.", "author": "MD G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-14", "description": "Terrible pad thai - bland, flavorless, and with fewer prawns than I've ever seen in a dish with prawns (3? really?). \n\nIf simple pad thai can't be done well, what does that say about the rest of the food?", "author": "Gleb P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-24", "description": "Good food with free dessert :) i will recommend frds to come back again. I love somtam and plakung! They are awesome. Free dessert is the plus!", "author": "Mandy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-17", "description": "I remember when It was hard to find bad Thai in San Francisco. Thank you techies. Oh and did I mention muuuuch cheaper", "author": "Joumana J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "The oyster was really fresh. The food was really good. Pad Thai was delicious. Desserts were also good", "author": "Busay W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "Love the fried rice here especially the crab fried rice and the chicken fried rice! The prawn fried rice is also extremely tasty. This is the last meal before we fly home and this is definitely one of the food places we gonna miss here.", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-11", "description": "I haven't physically been to this restaurant but I have ordered delivery multiple times so my review is based solely on their food  since I have no experience with their service but let me just tell you, their food is THE BOMB DOT COM. especially their chicken wings which they call angel wings (& i personally don't believe that's an overstatement because they are TO DIE FOR.) It's just as mouthwatering as the famous San Tung wings (about $12) in the sunset but for almost half the price ($7) which is always a good thing am i right????? Their pad thai & pad see ew is pretty good too but it's the angel wings that got me consistently ordering from Million Thai. IT IS A MUST TRY YOU GUYS.", "author": "Jowee Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-19", "description": "This thai restaurant nice food and very delicious. Whi come san francisco must come here.", "author": "Noom B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "A calm cool refreshing experience in the Financial District.  After the server brought us drinks she brought each of our group of 7 warm moist hand towellets to wipe off the grime of the city.  All of the food was excellent and served warm in a timely manner. It was not all served at the exact same time, the food is prepared and a relatively small open visible kitchen, which I like.", "author": "Jewel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-03", "description": "Really nice and flavorful! I had the Tom Kha soup with tofu, is was really rich in flavor, with a sour side and just a little sweet. The vegetables could have been a little fresher, but very good. The combination appetizer platter was old, the tofu had the best flavor and texture. The satay was marginal.", "author": "Marshall H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "I am giving 5 stars not for the food although it was good but the great service and responsiveness of the sweet waitstaff thank you little gals!", "author": "M S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "I love this Thai Restaurant cause the food taste really Good , especially Thai style. For example like Som Tum Tard Mmmmmm loving it", "author": "Jirachaya P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "Awesome and authentic. Came in on a whim and we were pleasantly surprised. Food was decently priced and we were seated immediately. The staff was quite friendly. Portions are for sharing. The restaurant filled quickly during lunch. Limited seating available.", "author": "Susanna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "They present really great Thai food. Especially green curry , I feel like back to hometown Bangkok.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-07", "description": "The food was okay but I was pretty disappointed in the service. I admit, we are kind of picky eaters (my hubs is vegan and I'm vegetarian). We ordered noodles with tofu and I wanted the pumpkin curry with tofu. They messed up the order soooo bad. First, the noodles had no tofu (fail).  Second, our curry came with chicken (fail). I sent my dish back because I didn't want chicken. When they brought my food back, it wasn't even pumpkin. It was potato curry. Wtf!? Not worth it. Can't even get orders correct.", "author": "Stacey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "In San Francisco last week again ate three times while there with friends, always great food and friends are just amazed how good this place is. Thanks again for great food!", "author": "Mark Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-02", "description": "this opened recently up the street from my work and I saw the 15% soft opening discount sign on their window. After the 10th time I walked by I finally grabbed a to-go menu that were placed outside the door and promptly made lunch plan with my coworker as we looked over the menu. We went today an ordered the duck fried rice (which we had set our hearts on the second we saw it on the menu), the pumpkin curry with chicken, and pad see ew with beef. We didn't even realize there was a lunch menu until after we had ordered. But we didn't mind since we were set on that duck fried rice. \n\nMaybe we had our hopes too high, but the duck fried rice didn't blow our minds. It's not bad, but it's not something we will order again. It just taste like good 'ol regular fried rice from my local chinese spot with slices of duck in it. The pad see ew was not bad either. I usually like my noodles cooked more so they're not sticking together. The pumpkin curry was the best. The flavor was excellent and the pumpkin was cooked just enough so it's not too mushy or too hard. \n\nOur eyes were definitely bigger than our stomach and we totally had left overs. I'll definitely come back and try out the lunch specials. But if those fail me, I'll always come back for the pumpkin curry.", "author": "Janny N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-02", "description": "Terrible.. The van ness location is slightly better.\n\nBeef stew soup was tasteless.\n\nZen Yai / Lers Ros is way better.", "author": "Koalie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "One of my favorite places. Food are authentic. Service is always nice. Affordable and reasonable too. Love it", "author": "Warut B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-03", "description": "Very overpriced food for the small size of kao gao tiam. Very little meat Nd the beef was tough as hell!!!!!!!!!!!!!!!!!!!!!", "author": "Angelo P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "Million $ Thai has always been my favorite Thai restaurant in San Francisco. Always worth a stop.", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "We had the pumpkin curry and the seafood noodle soup. The food was prompt and delicious. The service was great and very the servers were very kind. I would recommend this to anyone.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-26", "description": "The pad Thai tastes like noodles with ketchup. The chicken satay tastes like plain tenders cooked on a George Forman grill. Nice enough people. Shame they apparently lost their tastebuds in an industrial accident.", "author": "Brad P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-11", "description": "First  time I had eaten at this restaurant, its very small but the people seems friendly, I ordered the Red curry seafood dish and Thai iced tea, the tea was good,but the seafood Red Curry was total garbage food, this is what the seafood had inside a small bowl, one shrimp, 2 small fish balls cut in half, one artificial crab leg 2 small pieces, one small slice of squid ! Worst seafood dish in the world !!! It came with tofu but there was no salt on the tofu just a red sour peppered sauce ! I will never eat there again for sure !! The bill was around $17.80 ! Maybe the other dishes might be better but I have lost interest in returning to this place !", "author": "KC L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-29", "description": "Friendly enough service.   The flavors in the sauces were a bit ordinary, nothing really stood out.  We ordered the Pad Thai w/Shrimp & Scallops special (not much in way of shrimp or scallops), Chicken Satay, Panang Chicken Curry, all standard dishes for places we want to test out.   Pricey relative to ambience & portion & location.  There are plenty of places I'd try out before returning.", "author": "K N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-26", "description": "Service was not the greatest, the waitress seemed new but loved food! Duck fried rice and roasted duck noodle was great :)", "author": "Tasha C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-23", "description": "I liked the pad see ew, thai fried rice is good too. Portion is small in the price. Restaurant is clean only the waiter comes too often to disturb us, taking our plate away even we are not finished...the restaurant is 80% empty on 1pm Thursday. What's the hurry??", "author": "Shin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "I've eaten here a couple of times in the week I've been here and it's incredible!!! Authentic Thai cooked impeccably!! Everything is so delicious and complex. And if you're looking for standard staples, they have that too. I would eat here on a weekly basis if I lived here!!", "author": "Karin M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-30", "description": "Writing this review as i sit in the restraunt....portions are on the small side and a bit bland.....disappointed....then when i went to use my groupon they were not happy...wanted me to pay the ballance in cash....the only reason i came was to use a groupon to try a new thai place....always looking for my new favorite....this place aint it!!! If you dont want people to use a.coupon dont put them out there.  I will never be back!!!", "author": "fred h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-03", "description": "Yum!  Just got done eating this here at my office by City Hall!  Panang Curry, Thai Iced Coffee and fried banana ice cream.  The best part was that they actually deliver.  I love them! Most definitely one of my most favorite places in SF!!  =)", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-30", "description": "Struggled to put my household's order together.  Finally placed it.  Went about our business.  Eventually this terrible company let me know that they did not feel like delivering any more today.  You know, like long before they close.  No.  I'm not going to eat anything provided by people that behave like that.  Food safety is far too complex to put your health at risk with people like these.", "author": "James R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-05", "description": "We had ordered a \"Thom Yum\" soup, crab fried rice and a thai style fried rice.. the soup had stale chicken  (inedible) and was too sour... despite repeated instructions to make the rice extra spicy.. (thai hot),  we received a white rice with crab meat and shrimp... needless to say the food was bland and tasteless.... we did not like the food at all. For all those who expect a flavorful THAI food, This may not be the right place.", "author": "Swanand J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-30", "description": "Delivery was quick, food was hot but key parts of the order were missing like rice and sodas.", "author": "Yia Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "Just ordered simple chicken fried rice and pad Thai. Stunned by both flavor and simplicity. Wondeful dining experience", "author": "Lee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-11", "description": "I went in for a quick lunch, because it was near my hotel and on my rewards program. I expected decent. I got excellent.\n\nThe food was really, really good, and the price was amazing. Their lunch special was huge, I had Green Curry, Fresh Rolls, Hot & Sour Soup, Salad, and Thai Tea for less than $12. \n\nIf I had to give any constructive criticism, it would be that the plates were interesting but not the most functional for serving the meal.", "author": "Jeremiah S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-23", "description": "I would give them a negative 10 in stars!!!!!! The worst customer services in the world!!!! Along with the horrible services that I received from the useless app of EAT 24. I received my order 2 hours later, when they said it would be about an 1 and a half. Gave them a call, and asked them about my order. The lady on the phone was the rudest person I have every talked to. Snapped and me and said that they were busy, and that's why your order is taking so long, then  hung up. When my delivery finally arrived, the sauce that came along with the dish was spilled all over inside the bag. Then when I opened the order,it was the wrong order. I called and complained, and the same lady answered was rude as ever. I told them I just wanted a refund, have someone come pick up the food, because I no longer want it. Having someone come get their food was faster then getting my food delivered to me. Once they recieved the food back, the rude lady had the nerve to call me and tell me that it was the right order. Who cares if it is or not. YOU WERE RUDE ON THE PHONE WHEN I CALLED, MY DELIVERY WAS LATE BY 2HRS, FOOD WAS SPILLED FROM INSIDE THE BAG, AND MY ORDER WAS NOT WHAT WAS PRESENTED IN THE MENU. DO NOT EVERY ORDER FROM THIS PLACE OR EXCEPT EAT 24 TO HELP YOU OUT! I did get a refund for my order, but what a waste of time!\n\nDO NOT GO HERE!!! All these stupid great reviews, are people who don't know Thai food at all. There are tons of places that have amazing wonderful service and food. Go to anywhere except for this place!!!! If you're looking for a Thai restaurant, just go down on Polk or Geary, there are tons!!!", "author": "Veresa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "Owner was nice enough to open late on new years! Ordered pad thai and pad see ew. Both dishes were well spiced and delicious. The meal was the crown jewel of the night.", "author": "Justin Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-28", "description": "Don't order from this place.  Food was bad and service left a lot to be desired.\n\nI ordered Pad Thai with Shrimp, Fried Bananas w/Ice Cream, and a Yellow Curry delivered to my place.  They delivered on time; however, the food had some issues.  The ice cream was totally melted (okay, I'll forgive them since the delivery guy was on his bike), but the bananas were also totally soggy.  What really topped it off though was the Pad Thai tasted like fish like it was bad.  I've had plenty of fish sauce, but this tasted a little off and not like any other Pad Thai I've eaten.\n\nI called them up to work something out.  I let them know what happened and just wanted a refund on the Pad Thai (figured I'd let the ice cream slide).  They wouldn't do it.  She told me, \"10% off your next order. That's all I can do.\"  Excuse me? \n\nI said, \"No Thanks\", got off the phone, and started writing this review.  They actually called back to offer 50% off next time.  Still no go.  All I asked for was a refund on the Pad Thai.  The only saving grace for them was they called back two times upping their previous offer but still no refund.  Had they not called, this would be a 1 star review.\n\nI hope they figure out that this is no way to gain new customers or keep those they already have.", "author": "Justin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-06", "description": "This place is a scam!! Waitresses were mean. Food was indecent. They put hidden fees in the bill. Be on the lookout that they sneak in gratuity fees on the bill. I consider that very bad business practice. Never going back and I warn that you shouldn't be going there too!!", "author": "Alik H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "Best panang curry of my life. I usually get medium spice so i got 5 out of 10 stars and it was perfect.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-10", "description": "Do NOT double tip:  We have a party of 3 but automatically being charged for \"service fee\" of 18% on the check!   Also, the restaurant may think that is not enough, they wanted me to fill out section called \"gratuity\" again!!  They think I am stupid/careless that do not proof read the check ?!\n\nAlso, although the food appearance looks \"fancy\"; but the food quality is not good at all.  Pad Thai is mostly has sour noodles; Duck fried rice is mostly just rice with duck skin without taste.  \nI thought about giving 1.5 stars (instead of 2), but thinking about they seemed to trick me to double tip plus; charging us extra tips automatically even just party of 3, that made me feel upset.", "author": "Felix C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-30", "description": "Mediocre service and mediocre food. Ordered the pad Thai and I have to say it was the most flavorless pad Thai I have ever had.", "author": "D G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "Do not be put off by the location or the tired exterior.  The inside is cozy and clean.  Million was fantastic!  We chose this restaurant by chance, had not looked at any reviews, and didn't know what we were in for.  What a great \"discovery\".  I really enjoyed the Panang Curry.  Would be very happy to have another meal there on my next visit to SF.", "author": "Tom E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "everything I've had so far has been great. i've gotten the spicy eggplant with chicken, which was great, not too oily, and one of the chicken curries. i made the mistake of ordering something \"spicy\" and it was so hot. i love spicy but for this place ill be sticking to medium spicy haha. still delicious though.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "The food was tasty and very reasonably priced.  We had a party of nine and they quickly seated us.  The service was a little slow but the restaurant was packed.  The servers were friendly and helpful with many choices.", "author": "Rick B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-28", "description": "Staying in the Hilton nearby, and needed a quick meal after a long flight.  Unfortunately, I ended up throwing out the shrimp pad thai.  After the third bite containing a random \"crunchy\" bit (one looked like a sliver of plastic, others must have been bones? not sure), I was quickly grossed out.  Even if there were no unidentifiable objects, the flavor was just not there--very bland, not even any lime wedges included to liven it up.  A very disappointing meal that wasn't even that cheap--considering the restaurant is a small spot mainly focusing on take out with no ambiance, I might have expected better prices.", "author": "Christine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "The larb was spicy and amazing, as were the our entrees.  The service was perfect. We appreciated the late night service. Will definitely be back!!", "author": "ishai m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-30", "description": "DON'T order delivery !! Super slow, and when I called them, they just say it is on the way and hang up my call !! It was already 20 mins passed the estimated delivery time !!", "author": "Jie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-22", "description": "The duck soup was really good and the service was quick.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-02", "description": "The first time I got there, they rejected me because they said there will be a tour coming soon, so we got home after looking for parking for 30mins. The next day we went there again, because my bf wanted some Thai food(we was around that area so we come back again). The service is ok, nothing special. The place doesn't look romantic as the picture posted on groupon website. (I saw this restaurant on groupon, it looked pretty and romantic, that's why I bought the deal). Foods are not bad, but not as I expected, and the combination fried rice had some squids get stale and smell. Then at the end, when we paid the bill, we gave 10% of tip instead of 15% as they recommended on the bill, the waitress came and asked us to change to 15%. And she insisted, we didn't want to argue nor ruin our night so we gave little more tips. I swear will never come back. That made my bf upset because that was his BD celebration. I picked the wrong restaurant to celebrate. I felt bad.", "author": "Surgery S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "The perfect quick lunch spot, specially if you're here for conference at the Hilton. It's a pretty small place but they seem to be able to get people in and out. Few years ago they have lunch special menu but now it's just regular menu. Good vegetarian selection.", "author": "F.H. H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "Pad Thai was yummy, soft shell crab was crunchy, and the amazing Thai Tea washed it all down!", "author": "Tee S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "My husband and I split the green curry with chicken and it was really good! It was one of our favorite meals in San Francisco. Very tasty. #nailedit!", "author": "Tamara G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "Super awesome spot for great Thai right across from the hilton. Recommend the penang curry!", "author": "Cole H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-20", "description": "Ok but not great Thai. The pumpkin sauce was good but don't get the sea blend as the meat with it - it has fake crab and even fake scallops (fish meal). The Angel wings appetizers were really bad. Every Thai restaurant I have had that they are a chicken stuffing fried mix on a bone, here they are plain old Buffalo wings cooked badly (like rubber) with a thai bbq sauce on them. I have better Thai all around me back home in Monrovia/Pasadena.", "author": "Brian U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-08", "description": "I make it a point to eat here every time I visit the Bay Area.  Among my favorite green curry anywhere on the planet.  A five-star  Thai dive find. A winner every time...", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "Great food and service!  Noodle soups and papaya salad are excellent!  Friendly fast service.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-27", "description": "Fast & efficient service. Lots of good options to choose from. Overall spice was more than the average. I ordered medium and it was pretty spicy. Go lighter than you would normally order.", "author": "Christy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-03", "description": "Had appetizer platter, green curry, and fried banana and ice cream.  It was great. Go.", "author": "stevan w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-01", "description": "The service was terrible, every entree brought out didn't have a serving fork or spoon.  It was impossible getting the wait staffs attention as they were either texting on their smart phones or talking playfully by the dining counter.  We had to send one dinner plate back for being dirty with food residue.  The table of 3 ladies adjacent to us had the same problem...they also sent back a dirty plate.  The food was decent but they need a manager to maintain basic sanitation and service standards.", "author": "Doug W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "This place continues to impress.  I ordered crab fried rice and chicken satay.  The crab fried rice is just wonderful, with good-sized chunks of crab.  The satay is high quality meat and comes with a fantastic peanut sauce and a little cucumber salad.", "author": "Shana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Absolutely delicious food! Very hospitable! When in Union Square, this Thai Restaurant is a must!", "author": "Nina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "Great servic and, great food!!!  Totally recommend it if you like Thai healthy food...", "author": "Celia I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Great place to go late, everywhere else round here was shut. This place was an awesome find, with friendly staff and a nice atmosphere. I ordered the seafood noodle soup, with a choice of various noodles :) I got the flat ones, my favourite! I will come back next time I'm in SF :)", "author": "Katie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-30", "description": "Bf works down the street and goes here all the time. Today I went with him and didn't have high hopes because he thinks pad see ew is perfect anywhere. I got the pumpkin curry with duck. OH MY GOD. So so so so delicious. It's yellow curry mixed with pumpkin, so its very mild and creamy. I got level four heat which was the perfect amount of spice. The duck tasted so good, it was ridiculous. Even the chunks of pumpkin were just melt in your mouth butter type amazingness. Bf got pad see ew and it was a level six, which made him sweat lol. It was good, just a little bit too much...flavor...in the sauce. I don't know, he said soy sauce but I don't know the ingredients. \n\nPad see ew, pumpkin curry with duck and white rice for $25. I see why he loves it here.\n\nThere were like five workers in a small restaurant so that was a little overwhelming. I also asked for what I couldn't eat to go and with only two other customers and five workers, it took ten minutes to get my food packaged. No worries though, food was worth it.", "author": "Heather M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-17", "description": "Delicious Red Curry. I loved the presentation of the food. They added a little jasmine flower to the plate. Would deffo return. I asked for Level 6 spice on a scale of 1 to 10. I would recommend asking for a 3 or 4, even if you think you can handle your spice.", "author": "A B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-14", "description": "Good food and good service. However, I asked them to remove a vegetable dish out, which they forgot. That meant I had to wait some more. I have eaten much better Thai food.", "author": "Jesper H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-23", "description": "This is among the best Thai restaurants in San Francisco with regard to authenticity. This is no \"Americanized\" Thai place. I lived in Thailand for number of years and my friend, a Thai national who works at another Thai restaurant had ordered some of the \"authentic\" items and those ere just like how we have them in Thailand. \n\nIf you're one those that believes you can judge a Thai restaurant by its Pat Thai (which is as asinine as judging a Japanese place by its edamame), don't bother going here. If you're looking for authentic Thai food, this is the place. \n\nLocation is on Taylor right next to the Hilton San Francisco and Glide Memorial Church. It's open past midnight.", "author": "Flynt I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-24", "description": "Sweetest delivery service, and quick. Food was pretty alright for a quick online order. Soups/curry very flavorful and servings sizes were good.", "author": "Mahsa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "Delicious! Had the pumpkin curry and seafood noodle soup. Both were great! Had thai iced coffee which was also good. You can see all the cooking action going on in the kitchen.", "author": "Charlie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-21", "description": "I ordered combo papaya salad. Really love the laotian style papaya salad here.", "author": "Sunisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "This is my favorite thai restaurant in sf! Great atmosphere clean quick and excellent service. They have wonderful options for vegetarians.  A must if you are in downtown. We always go after enjoying the theater.", "author": "Sandra H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "Close to downtown, delicious noodle. Try beef noodle soup - very delicious hang over dish :)", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-06", "description": "The food was great! Especially papaya salad platter. The servers were nice and attentive. They also gave desserts on the house!! I will definitely come back.", "author": "Emily R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-23", "description": "OK...so they moved to Van Ness....Everyone starts off slow, but the servic e was still just as good as it was on 5th ave.  Tried the food over here and loved it.  Keep up the good work.", "author": "Kenneth G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-01", "description": "Just ok Thai food. We are from Atlanta and were expecting far better. Did not seem inspired or much different than what we can get at home at low end Thai places .Tried pumpkin curry and it was just soso.", "author": "Jann J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-24", "description": "Just had the pineapple fried rice that supposedly comes with shrimp and chicken...I searched for the shrimp & found just one. The dish was a bit tasteless and chewed on something that might have been an egg shell. Price is a bit ridiculous for the dish. $14 for a tasteless and meatless dish, not cool.", "author": "Ann S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-11", "description": "The worst pad thai I've ever had :-（Rice noodles are very dry and tasteless. Too few shrimps! Only 3 shrimps in my order. The good thing about this place is that it takes online orders.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-30", "description": "We Had Pad See Ew and Yellow Curry with chicken. Both were delicious. Our server was Mewmew. She was super prompt and attentive. Great service!", "author": "Leslie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "Presentation was amazing....food delicious and service impeccable ..... Definitely a taste of Thai.", "author": "Helen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-24", "description": "The pork rice and chicken rice are really delicious. I would definitely come again .", "author": "Xiaoting C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "Hubby and I stayed at the Hotel Monaco and walked here to eat at 9ish. Small place but attentive staff. Food was good. I ordered the soft shell crab basil and it was yummy! Great place to eat if you just want to have a quick late dinner.", "author": "Van P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "Great place. Had a Curry and soft shell crabs. Both very delicious. Water was for free. The place is clean and has a nice atmosphere. The waitress was also very friendly. I immediately felt welcome.", "author": "Mathias W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-25", "description": "wow & holy shit. super good! first time in a long time i've had tasty thai food. ploy II, osha, etc. - all fine. but this place? damn good, and at a reasonable price. i walked out thinking \"5 stars easy\". we ordered pumpkin curry (best tasted to-date), panang, basil beef, and mango sticky rice. while all the food was kick-ass, and the service fine, there were little unexpected touches that ramped-up the experience - e.g., creative food presentation (creative with regard to what's expected when you approach the restaurant from its tenderloin location), quality dishes and stemware. totally great experience eating at Million Thai.", "author": "Patrick W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-17", "description": "I ordered papaya salad the best.   Pad thai and pad see ew better than the last time close by my home. Price is not bad in down town San francisco.   They are so friendly", "author": "tata c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-22", "description": "Rocked it! Tom yum--- 2. Chains!!!  Soft shell crab, must have. The green chili sauce it comes with is epic. Beef Penang won't let you down. Post script, if you like spice, 7 is not enough.", "author": "Inn G."}
