{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "3.5 stars. \n\nGood comfort food! Love their porridge, but I've had better elsewhere. Their preserved egg with pork porridge doesn't seem to be cooked WITH the porridge, so the egg actually remains whole/harder than most places. If you're into that, great! If not, don't order it!\n\nTheir won ton/dumpling egg noodle soups are good, too.", "author": "Leslie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "This place gets busy by 9:15 am on week days. Don't forget to put your name on their white board by the door. \n\nI really like this place even though it is a drive from my house, I'll drive down here to just eat their Won ton! They also have great combination breakfast from 8-11am for $6.25 or $6.55 depends on what you chose. My favorite picks are A. Fish Congee and C. Stir fried sticky rice with Chinese sausage and peanuts. \n\nWon Ton: \nSolid Hong Kong Style. Consistently delicious every time. The thin velvety skin, the flavorful pork and shrimp filling, the bouncy chewy noodles with the light but soothing broth...I cannot stand \"American Style\" won ton with tick and doughty skin! \n\nCongee:\nGreat consistency. I order their Fish Congee and it is delicate and flaky without any funky aroma.\n\nService:\nI don't know what everyone else is talking about! They are friendly, efficient and courteous. I feel welcomed every time. May be I give 25-30% tip? Why not?Their food is priced so reasonable, and waitress work as hard as other establishment with much higher price point.", "author": "Chie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "I LOVE the food here! \n\nDon't be deterred by the reviews about bad service. It's just your typical Chinese restaurant where the employees are always in a hurry. They might not be going above and beyond to make you feel like a king, but they get their job done. \n\nWait is not too bad. Came here at noon on Labor day, and there were 5 parties ahead of us. Was seated within 20 minutes. \n\nFood is amazing and cheap. I've tried a variety of dishes on their menu, and they were all pretty good! If you want cheap congee/noodles/dim sum dishes, this is the place to go. A thing to note is that they can run out of congee (they were out one time in the early afternoon). \n\nI'd recommend coming here with a group (but not too big), so you can try more items!", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Great food just like Hong Kong\nSmall space so you will wait I. Line go early or later", "author": "Paula O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "Cheap good quality food.. it brings the Hong Kong flavors to San Francisco. Expect a wait but it goes quick. The average table turns in about 30 minutes. \n\nNot sure how they do it but the food here is excellent; their won ton and dumplings are made with shrimp and very flavorful. Vegetables are snack size and their coffee milk tea brings back some good memories.\n\nAnd, just like Hong Kong, the staff here are not the friendliest but they do work hard. They won't chat and will ask you to hurry up and order as they're constantly on the move. There's only one restroom so all it takes is one person to create a Disneyland line.", "author": "Eric T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-02", "description": "I haven't been here for years but I do love their wonton noodle soup. Today I found a new love for their chicken wings.... some reason their chicken wings brought back childhood memories but we can't remember where and when. Best memorable chicken wings ever! I can't say it's the best for others but to us because of this childhood flavor it gave us! 4 Star!", "author": "Christy V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-19", "description": "The service is the worst ever in my 40 years of life as a human being. I am so made at their waitress (so lazy) that the food became no taste at all.\n\ni come here at least once a week because my child like the noodle soup so I have no choice. \n\nThe owner does not care about his customer or he should have fired more of his floor staff.\n\nreally unless you do not have a choice (wait time elsewhere) this is not the place to go.\n\nyou will see a 1 star review from me once a week for this place.", "author": "Wai C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-12", "description": "I had high expectations for this placed based on their reviews for their Wonton Noodle Soup but was disappointed by their food and service. I think \"authentic\" is a reach for this place. Servers always had this \"annoyed\" attitude - ie. like they didn't want to seat us (2 adults, a preschooler and infant in car seat). \n\nThe Wonton Noodle Soup was too salty. There were only 3pcs of Wonton, but they were large. The noodles were a bit too hard. They just dropped a few pieces of iceberg lettuce in there without even slicing it up or separating them. \n\nWe ordered one of the steamed rice pots (beef and egg) and it was SAD! The rice wasn't flavored, they just gave us a bowl of sauce to pour in. Looks like they just scooped white rice in the pot and served the sliced meat on top of it. They even forgot the fried egg and just gave it to us a on a small plate. \n\nThe rice noodles were good. Very fresh and well flavored. \n\nThe iced milk tea was too sweet and the iced coffee tasted watered down. \n\nReally disappointed, not sure if I would go back. The service alone would keep us from returning. We had to ask for water multiple times. They didn't even give my kid utensils, water or a plate, even though we ordered him a dish.", "author": "Anyta L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "BRUH. Wonton here ain't no joke. Definitely some of the best wontons I've had. Skin is silky and thin, filling is meaty and very shrimpy, just the way I like it. The shrimp is tender and juicy. Perfectly cooked. The broth in the wonton mein is perfectly salty and shrimpy, and goes with the plentiful al dente egg noodles. It's a TAD on the salty end, but you can add some vinegar to cut the saltiness.\n\nI got the $10 lunch set that included 1 LARGE bowl of wonton mein, 2 pieces of bbq pork cheung fun, and a hot drink. God, I miss Hong Kong and being able to get set meals and a hot lemon tea/Horlick's/Ovaltine with everything.\n\nI was also pleasantly surprised at the cheung fun! SUPER silky and thin. A lot of places don't do it right.\n\nDefinitely stop by if in the area. Nice, but clean hole in the wall on Noriega with decent service.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-07", "description": "Small restaurant with limited tables. Parking is easy here but it's all street meter parking. Got here at 1pm and there was a wait so we put our name on the board. Don't come here with big groups because it's not going to work out. We order the wonton/shrimp noodles and congee. The wonton soup was alright and I thought the congee was good. Customer service is alright, don't expect much since it's a Chinese restaurant. I wouldn't return to this place though because I've had better wonton noodles out there.", "author": "Tina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-22", "description": "A small, hole-in-the-wall spot for traditional hong kong cafe style food. The seating area is small, but the food was definitely worth the cramped restaurant. \n\nI ordered the bbq pork and shrimp wonton egg noodle soup and I really enjoyed it. The wontons were plentiful with shrimp and the bbq pork was moist and meaty. The noodles were also perfectly bouncy and the broth was very flavorful. We also ordered two rice rolls--the beef rice roll and the dried shrimp rice roll. The rice rolls were a little undercooked, and they did not have the silky texture of most rice rolls. However, the rice paper was very thin and the fillings were good. \n\nHowever, the service was not very good; the staff was unfriendly and it took a long time for someone to serve us water and tea. Also, the waitress seemed nonchalant towards us and ignored us most of the time when we tried to order.", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-01", "description": "The food here is 4 stars - one of the more authentic tasting HK-style cafes in the city. I love their wonton noodles, congee, and HK milk tea. However, their customer service is consistently lacking. \n\nDuring my most recent visit, we had been waiting in line for about 30 minutes and were ready to be seated after seeing 3 tables free up. The tables were clearly bussed and ready for the next customers. One of the waitresses came to look at the line and the names on the waiting list at least 3 times, but failed to seat anyone in line, or even acknowledge the presence of the customers. Instead, she slowly walked away, then around the restaurant slowly looking for other tasks to do, completely ignoring the line. Customers were left standing there looking awkwardly at each other and confused about what had just happened. \n\nWe were finally seated only after a customer flagged down another waitress to ask about why the line was being held up. \n\nWe've been here several times before and experienced their painfully slow service. We really only come here for the food, but after this experience, we will definitely be considering other options before coming back again.", "author": "Jennifer X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-30", "description": "We came here for lunch on a Sunday around 1:20pm and there was still a waitlist going with 4 parties of 3's and 4's before us, but our party of 2 was seated in about 15 minutes.\n\nI had meant to go to Tak Kee Lee to give them a try and didn't realize that I was at the wrong place til I saw the restaurant name on the menu and looked at the addresses on yelp, lol! My bad. Tak Kee Lee is to the left of TJ Cups, oops.\n\nWe decided to eat here anyways, and I ordered the set B combo (shrimp wonton noodles+bbq pork cheung fun+free hot beverage) for $9.95+tax. The noodles come with three wontons and I was a little disappointed at first because usually wonton noodles come with 6 wontons, but these wontons are LOADED with shrimp. One of these equals two basically. The soup was okay, I can taste white pepper powder and drinking the soup made me thirsty. The noodles were a bit thinner than other egg noodles that I've had before. This dish also came with a few pieces of iceberg lettuce (bland, probably was added last right before serving). \n\nThe bbq pork cheung fun was nothing special. It had cut up pieces of bbq pork wrapped with the flat rice noodle, comes with soy sauce dip. The rice noodle was firm but not as smooth as ones in dimsum places. \n\nFor the hot beverage, I asked for the hot HongKong style milk tea (usual price $2.90 here without the combo set) which was strong but needed a bit more condensed milk. \n\nThumbs up for the stuffed shrimp wontons and strong milk tea but otherwise nothing special.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-18", "description": "Why is Ming Tai Wun-Tun perfect for SF?\n1) The weather is nearly always appropriate for a steamy bowl of wonton noodles.\n2) Everywhere else in the city is $$$... It is no exaggeration that a meal at Ming Tai costs about the same as an appetizer in trendy places.\n3) Because HK native aka me approves.\n\nAs the name implies, Ming Tai's most popular item is their wonton, though they do have a good selection of other eats ranging from congee to Chinese donuts. They also have combos of a main dish, a side dish, and a hot drink.\n\nI highly recommend the heavenly wontons. The filling is meaty with generous portions of shrimp and pork, and the thin skin is cloud-like--true to word origins of 雲吞 meaning cloud-like dumplings. Devouring the wontons whole give the same satisfaction as eating sushi in one bite. Note that there are several options for wonton dishes: the basic wonton noodle soup, the wontons only (for low-carb noodle-phobes, I guess), or the wonton lo mein (撈麵) which consists of noodles with soup on the side (similar to tsukemen, good if you don't want your noodles to get soggy). The broth was satisfying and flavorful, though I would have liked the noodles more al dente. In traditional standards, the noodles should be \"bouncing off the teeth\", and it had a ways to go. \n\nAnother commonly ordered item, the Chinese donut rice noodle roll (炸兩), is Canto comfort food. The combination of crispy golden fried dough, attenuated by the rice noodle skin, and augmented with the peanut sauce and sesame seeds, is addicting no matter how hodgepodge-y the idea may seem. The dough was a tad too dry, but I liked how it wasn't greasy. Mmm... Chinese donuts :3\n\nAlthough the chicken mushroom clay pot rice is a road-less-traveled dish here, it turned out legit and quite satisfying. The chicken itself is decent, and the rice is on point--baked to a mild crisp and very umami in soaking up all the chicken flavor. The steel pot they use is non-traditional and you don't get the magical burnt crispy rice at the bottom. I guess it's also healthier that it entails less oil, and that steel is technically more sanitary (...though I really doubt anyone else cares besides me). \n\nAnd the BBQ pork rice noodles. The filling was scant as expected; we ordered it because it came with the combo, and I really only wanted the combo for the milk tea. Hot HK milk tea always hits the spot in SF, where the weather is chilly and you could always use some caffeine. Ming Tai's version was too milky, but it was a nice way to end the meal on an authentically HK note.\n\nMing Tai is a small space and gets busy during peak times, but the wait isn't impossible. The kitchen is fast and the diners don't take too long to inhale their wonton noodle soup.", "author": "Edna C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-10", "description": "Don't expect the waitresses to be very kind. They will ignore you even if you say something to get their attention. So I ordered the lunch combo of wonton noodle soup and bbq pork roll plus a hot drink. It was only $9.50 so it was totally worth the price let me tell you that. The wontons were huge, the wonton skins weren't too thick or too thin or falling apart. The bowl was kind of small though but you can always add more noodle. The bbq pork roll plate only had two pieces. (Lol it was whatever, I wasn't expecting a big portion) Overall, food is good but the service sucked ass.", "author": "Kristi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "My go to won ton noodle shop!\n\nFrequent this place often with my parents, who equally love Chinese brunch meals with me. On the weekdays, they have combo meals ranging from $8-10 that include a dish with a side (of veggies, BBQ pork rice noodles, or pickled veggie rice noodle) and drink. \n\nI typically opt for a bowl of won ton noodle soup, veggie (to feel slightly healthier- though suggest sharing since this portion is a lot for 1), and iced milk tea (strong and so good)\n\nCan get crowded during peak lunch time. Don't be afraid of the mob of older Asian individuals. Push through to write your name on that list!! Or make sure the waitress sees you. \n\nKeep in mind, staff isn't the best with English. Frankly, I haven't heard anyone speak English at this shop. Oh and cash only", "author": "Carissa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-22", "description": "Had the 4 treasures fish/meatballs soup noodles lunch set.  Came w/ hot drinks. Filling, taste good and a real bargain.", "author": "Denis Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-24", "description": "Yes, the reviews here about the bad service are true.\nJust came back from HK couple days ago and craved for more Cantonese food.  Found this place on Yelp and decided to give it a try.  I was here yesterday and ordered minced beef jok and BBQ pork noodle crapes.   Came back and am having fish noodle crape and beef stew and dumplings right now as I write this review.\n\nThe beef stew is decent, tender and got some flavor.\nThe noodles are ok, the texture is acceptable for SF standard.   The fish noodle crapes are ok, not particularly tender and smooth.   The dumpling are large size and taste alright.  Nothing spectacular, this is U.S.\n\nThe servers have typical Chinatown attitude and could careless about what you think.\n\nI would come back for the food for this kind of Cantonese noodle shops keep disappearing in SF.  They are taken over by the Sichuan, Shanghai and other Northern Chinese food.  This is not Vancouver so take it as it is.  If you don't want want to be treat badly, don't bother coming.", "author": "Sfscubaman T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "Cheap, HK dive with killer wantons in springy egg noodles that are spot on in a mild clear broth.\n\nThe plump, snappy prawn dumplings (Shoi Kau) were wrapped in thin wrappers. But it was the decadent 5 spice braised beef (Ngau Lam) with melty, luscious tendon pieces that make your lips gummy. Dip egg noodles into the braising liquid for a superlative mind-expanding slurpy mess.\n\nThe congee is bland, and the chee cheong fun is tender. But mash up the congee with chee cheong fun sauce and dribble some chili from the tub for awesome results.\n\nThen factor in the low price and I understand why this place is a great lunch spot to pig out with ravenous friends. \n\nChallenging to find space during the steady lunch crowd. And parking is tough to find outside.", "author": "Lu-Shien T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-26", "description": "Me and my girlfriend went there for lunch ! My girlfriend love noodle with three sauces! I like steam pork ribs over rice clay pot!", "author": "Marie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Awesome wonton noodle soup. Their congee is ssoooooo good, and the chinese donut is excellent!!!", "author": "John N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-09", "description": "You will appreciate this place if you came to San Francisco from Hong Kong and you like congee 粥. I've been in San Francisco steady state for about four months now from Hong Kong and this is the closest I have found to Hong Kong style congee set breakfast.  A choice of eight different kinds of congee in combination with seven or eight other breakfast foods for $6.50 so about $8 with tax and tip. Incredible for SF. Service in the morning can be kind of slow. The place was packed and they are understaffed.", "author": "Leung T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "水餃 (sai gow) is very good, although the broth is a tad salty. The won ton is very good also. Breakfast specials are very reasonable although all in Chinese. Because the menu is printed, it is easily translated on the fly with Google Translate. The congee is a tad better than mediocre.\nThe waitress staff are extremely rude and curt like most restaurants catering to Chinese. Glad I don't speak Chinese. My cantonese fluent wife disdains going there because of their obnoxiousness. Ethnic, but not SF friendly", "author": "Doug"}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-14", "description": "The congee portions here are massive. The woman who took my order was kind enough to ask if I wanted to make it a combo instead as it would be less money so I did. I had the pork and century egg congee with turnip cake and fried dough with rice noodle wrapped around (zhaliang). The food was fresh and authentic and I didn't feel like they put msg in the congee!", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-04", "description": "Went here on the recommendation of some friends that are Won Ton connoisseurs. This place definitely has an edge when you order their Shrimp Won Ton Mein. The dumplings are stuffed and are full of flavor. Even the noodles have their bite to them. Surprisingly, the bowl only comes with 4 dumplings. If you're really hungry, ask for more. But you'll be pleasantly full with a standard order.\n\nAlong with the Won Ton Mein, I also ordered a plate of the Fried Doughnut Rice Noodle (Ja Leung). It was kinda soggy, so I wouldn't order it unless you're having a serious craving. Anyways, stick with the Won Ton Mein, you won't go wrong!", "author": "Nick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "legit wonton noodles very close to HK style. Small place clean good service despite previous reviews. Cash only. Lunch sets are good deal and cheong fun was on point! soft and good ingrediants. Wonton noodles had a good chew and wontons had good ingrediants and not rock hard like other places. Broth could be a bit less white pepper but overall solid.\nGoing back today!", "author": "Petri Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-25", "description": "Small place, always busy but this has the best Cantonese style Congee, rice flour rolls, will n tun and fried dough sticks or as the Cantonese say \"oil fried ghosts\" in the city. \nService is fast and friendly. Street parking can sometimes be difficult. But I'll be coming back often.", "author": "Lawrence N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "CLOSED TILL JUNE 29, 2017\n\nI hope this information saves other people from making the long pointless journey I made yesterday!\n\nWhen it's open, it has the very best wonton noodle soup I've found so far in SF.\n\nCash only + no beer  :-(", "author": "Tristan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "Very good! We got the shrimp wonton soup, abalone and chicken porridge, turnip cakes, shrimp rolls and hongkong milk tea, all were very delicious! Service is good too.", "author": "Nikki V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "It has been several years that I've eaten at Ming Tai.  Since I was in the area, I met up with my sister here for lunch one weekday afternoon.  The restaurant has been remodeled with nicely colored walls and bench seating on one side of the room.\n\nFrom the past, I remember that service can be slow when it gets busy.  But since it was midafternoon, the restaurant was not full, so we had attentive service.\n\nWe started with an order of shrimp rice roll (Cheung fun). Order came with three rolls each consisting of three large shrimp with some dipping soy sauce. Impressed with the large shrimp and it was tasty. Just thought the rice roll (fun) was a little on the mushy side. \n\nI've always was impressed with their huge shrimp wontons. So I ordered a shrimp wonton with thick egg noodles. The order consists of four large wontons filled with shrimp. The noodles had a nice springy bite to them. Same good quality here.\n\nOverall, the shrimp wontons are still the quality product as I remembered. The rice rolls are good but could be better. The prices have gone up since I last visited, but still reasonable considering what you are served.", "author": "Al L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "Worst service ever! I entered the restaurant and found that it was full. I saw a paper right in front saying that please wait to be seated so we waited. We waited for over 20mins and no waiters ever say anything, and that's fine. Then, there was a table and the waitress asked how many ppl in my party, and she seated us. A few minutes after we seated, another waitress came over and asked if we put our name on the whiteboard! I said no and I did not even see a whiteboard! Then, she said we were supposed to do that.........! Whatever, we ended up leaving without eating anything. Will never return.", "author": "ivy y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "Pretty good wonton noodle restaurant located conveniently in the Sunset district of SF. This is my go-to wonton place and I often come here with my family for brunch.\n\nI usually get their wonton noodle soup, with the thick white flat noodle. Unlike other wonton places, the wonton noodle soup comes with 4 large wonton dumplings generously filled with meat and shrimp, along with a good size portion of noodles and lettuce.\n\nThey also have set meals at certain hours, where you could order a dish on the side (rice noodle rolls, sticky rice, etc). I've also tried some of their porridge dishes which were decent but not particularly memorable.\n\nThe place is a bit small and cramped, but the service is pretty fast and the food comes out pretty quickly. Highly recommend a try!", "author": "Alvin W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-22", "description": "Initially, I was going to give this place four stars, but soon came to a realization that this place only deserves two.  The food is definitely 5/5.  The price is unbeatable; you get so much value for what you pay.  However, the service is 0/5.  I say zero, simply because there was lack of service.  \n\nThe GF and I came in at 10:30 am.  Upon walking in, there was a tiny dry erase board, which one could only assume is their wait list sign up.  So, we put our names down.  But, we soon figured out that the workers do not pay attention to the list.  They just ask who was here first.   This type of confusion is unnecessary and caused lots of anger and frustration towards the people waiting to get seated. \n\nTurnover is fast, but at the same time, slow.  Let me explain.  The two workers could not keep up with the orders, seating people, cleaning the tables, and dishing out checks.  I cannot express how much confusion there was.  So, what they did was simply wait for everyone at all tables to leave.  Then they cleaned all the tables at once.  Next, they sat people at every table.  After that, they took all the tables' orders.  They took the orders based on which table they were closest to, not by which persons got seated first.  I thought that was highly irregular and very irritating.   \n\nThe only reason why this place salvaged an extra star was because their food was too good.  The soy sauce chow mein was fresh and crisp.  The porridge was full of flavor.  The rice roll was soft on the outside and crispy on the inside.  The turnip cake was salty and savory.  All this for $18 was a steal.  \n\nI would be willing to give this place another try in the future.  I just wish they would hire more staff.  Yes, it would cost more money, but it would benefit everyone.  Service would be quicker and less stressful for employees, and diners would not have to wait as long.  \n\n\nP.S. It took 30 minutes to get seated, 15 minutes for the food to come out, 30 minutes to eat, and 15 minutes to get our check taken care of.  I filled my meter outside three times because initially i thought breakfast would only take 20 minutes.  I was drastically proven wrong.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "cheap and quality food! love this place for the longest time. I love their mOnday to friday menu, it always comes with a small dish..I wish they would let me pick all the small dishes instead of picking from A and B selection. All their small dishes is on C selection.", "author": "Elsa Mandy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-30", "description": "Looking for some quick Chinese comfort food for Sunday lunch with mom and pops? This is a cool spot to take 'em.\n\nIts a really small restaurant, but don't worry, table turnover is usually high, especially if you're just a party of 2. They have wonton noodle soup, congee, steamed rice in hot pot, rice noodle rolls, ramen, and simple club sandwiches.\n\nWe started off with a plate of Pork Liver with House Special Sauce. You know you did your parents proud by maintaining your Asian taste buds when you can still eat animal organs. It was dressed with tons of shredded ginger and spring onions served with a side of soy sauce. There wasn't anything special about the sauce, though I enjoyed this dish. My dad and I got the Beef Brisket & Tendon with Wonton Noodle Soup while my mom likes it simple and ordered the Shrimp Wonton Noodle Soup. I was expecting a more intense flavor, but the beef brisket was a little lacking in flavor. The wontons were really plump and shrimp tasted fresh, noodles were thin, just how I like them. I also ordered a Hong Kong Style Milk Tea with was okay, though my stomach didn't agree with the milk this time. I have become selectively lactose intolerant over time.\n\nWill definitely come back, but only with my parents because they seemed to enjoy it. I'd like to try the congee next time. Stay tuned for an update!", "author": "Janny S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-11", "description": "Not recommend at all. I am working at this neighborhood. Every time I order a pick up food from this store has a problem... \nThe customer service there is server bad...  they don't even talk & listen to you.\nThere are couple time I was there waiting for pick up my breakfast. I try to ask if my order is ready.  But they just ignore me like a walking dead.  It happened to me again this morning and I had to wait at the cashier more than 10 mins and nobody help me.", "author": "J Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "I had breakfast there and it was decent.  Usually a small line even on a weekday.  I usually go there to get take out before they close - they close at 5pm.  I had their porridge, won tun noodle, beef brisket noodle soup and some small dishes, dry shrimp crepe and turnip pan fried cake.  They have been all pretty good.  The only down side is they close early at 5pm so they tend to run out of stuff around 4ish.", "author": "C S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-22", "description": "Has the Chinatown vibe frequented by locals.  CASH ONLY, but the bill is under $12...just carry some cash in your secret stash.  Food is well worth it.", "author": "Marie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-10", "description": "Porridge is a staple for a hangover. It can literally bring you back to life instantly.. which is why I found myself at Ming Tai. There was a bit of a wait because the place is super small, but it wasn't too bad. I had the pork and preserved egg porridge. We also got an order of the shrimp rice rolls. The porridge was piping hot and life saving after a long night of drinking. Rice rolls were good but not enough sweet soy sauce was served with it and I didn't want to be annoying and ask for more. I'd come back, but ABC across the street is also a great option for porridge!", "author": "Tiff C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-27", "description": "Ok hk style street food. Small place. Old waitress is a bitch though. Tak kee up a few stores is better - there's a reason why that place always has a line and ming tai doesn't. TIL the diff, but note this is for their breakfast though", "author": "Gordon Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "This is my favorite wonton place! I'm honestly at a loss for words by how good the wonton ho fun soup is. The noodles are so soft and chewy, wonton is juicy, big and flavorful and the soup itself has a hint of pepper making it a lil spicy. A great combo right there!\n\nI also tried their chicken wings and it has MEAT in it not just bones. Crazy right?\n\nOnly reason I gave them 4 stars is because customers service. They're so rude and slow but the food is good so screw everything else (;", "author": "Kathy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-27", "description": "As far as deals go this one is one of the best on Noriega Street. A bowl of congee and rice for around $6. Taking away one star due to the very poor and slow service. The set menu comes with tea, or else you wouldn't have anything to drink because they always forget to bring water here to their customers. They even forget napkins.\n\nThe congee is hot and fresh and the gluten rice has nice flavors. \n\nGreats eats and low prices.", "author": "Jackie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "The foods are good especially their porridge and rice rolls. But the customer service is pretty bad.  They are slow to respond to your request. And when they do come, they seem to be impatient.   There was a Hispanic customer sitting next to my table and he probably didn't understand the different between wonton soup and wonton noodle soup.  The waitress impatiently pushed the question \"so do u want noodle or not?\"  to him.  It's not the problem of the question itself; it's more about her attitude.  So I take a point off.  I guess the waitresses don't really care as there are always so many customers coming for the good foods.", "author": "Shirley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "I've learned to call ahead early for take out cause it takes a while, but their food is really good. My favorites are their porridges, rice rolls, won ton, egg and ham sandwich, sticky rice, and milk tea. Their weekday breakfast specials are a great deal.", "author": "Ellen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "The best milk tea and Wun Tun I have ever tasted in SF! Go try it", "author": "Chenyi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "Good for wonton noodles and congee rice soups you in the area. This restaurant is small so there will be a wait. Food cane out a little slow. Parking is an issue any where in San Francisco.", "author": "Marie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "Cash Only !!!!\nFood is pretty good. The store is small so u need to get here early to get the table. And the store close at 5 pm everyday. \nOnly 4 start because of the space.", "author": "Kaung N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-21", "description": "Actually I don't like go this place, because the service very terrible! Worst than ABC restaurant!! I went there today because my parents in law like that place, the food so so, they order the shrimp rice noodle, the shrimp taste not fresh and looks kind a raw!!!!! The short hair server attitude really really bad!!!!!! If I can, I don't want put any tips on it.", "author": "Emily W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-21", "description": "Large whole shrimp dumpling or wonton soup... Not mystery meat or filled with fat.\nCheap $7\nmsg however can be found \n\nQuality not found in most wonton shops in SF.\nClean hole in the wall", "author": "David H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-21", "description": "The food is decent - but the take out service is extremely slow. We order two soups and it took over 30 minutes...", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-21", "description": "A pretty legit HK style cafe!\n\nCame on a Sunday afternoon around 3ish with a friend. The restaurant was almost empty. We went in and saw the \"cash only\" sign so we had to walk all the way up to BOA and get some cash before finally sitting down.\n\nPig Blood Fish Filet Porridge: A.\n(Disclaimer: I'm a big fan of pig blood; the description would be kind of strange so please skip if you are not comfortable with it)\nOh wow the pig blood was definitely one of the best I have had in US. I guess usually restaurants use frozen pig blood which makes it completely lose the original blood clot taste. But not at this place. It really tasted like the ones I had in Asia. And texture too. It's a bit firm on the outside and super soft inside. I wish they made it in larger chunk instead of thin slices though. \nThe fish was good too. Again it tasted pretty fresh. Porridge was also surprisingly good. They put a lot of ginger inside and the saltiness was at the perfect level.\n\nShrimp rice roll: B.\nNothing special. Shrimp was okay, while the rice roll skin was kinda thick. Wouldn't have ordered it.\n\nSoy sauce fried noodle (豉油王炒面): B+.\nIt's not the hard crispy type that I was expecting. But it was still good. Strong bean sprouts taste and green onion taste.\n\nDumpling (水鮫): A-.\nIt was pretty nice. Big shrimp in each dumpling, thin skin, and they put a lot of mushroom inside which further enhanced the taste.\n\nAfter all, this place is called 海皇粥面 and they do live up the expectation on the porridge side. Will be totally down to try some other items on the menu too.", "author": "Simon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "My wife and I call this the purple place as it used to have a purple interior and still has a purple sign. We have been crossing town for years to come here. It is a restaurant run by women who are dedicated to the mission of great Cantonese breakfast. We've had just about everything on the menu at this point and I can assure you it is all good. I generally am not a fan of congee, Chinese savory rice porridge, but I really like it here. They also have my favorite, Chu Cheong Fun, in a couple of formats - rolled rice noodles with a plum sauce, a peanut sauce, and a spicy sauce. Also try the \"ngau lei sou\" - I am butchering the Chinese here, but it is a slightly sweet, football shaped donut. And, of course, their Hong Kong milk tea is great.\n\nService is brisk here because it has to be. The line is long. Be decisive even if you don't know what you are doing as we are probably waiting in line. You can't really go wrong.\n\nThis is one of these reviews you are almost reluctant to write as it is just going to make the line even longer, but these ladies deserve a shout out for their labor of love - the pursuit of the perfect Cantonese breakfast - and their fantastic results.", "author": "Ken P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-01", "description": "I don't know how to describe their attitude, all I know it's bad.  I called few times of ordering, and they just ignored me.  I was thinking just get the hell out of this restaurant and leave.  I hope they will change their attitude.  That's all!", "author": "Jo Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-08", "description": "Count your blessings and hold on to your belongings for your dear life if you'd have to step foot in here. Because if you were so unfortunately having any of your personal items out of sight even for a second here, they would most likely be gone FOREVER! \n\nMy mom put her Rolex watch down (stupid, I know, but hear me out) on the table for a minute after accidentally spilling some tea on to her sleeves and didn't realize that she had left it there. Since my mom realized that her watch was missing the following morning, she and I had gone back to the store, separately on different occasion, wondering if they'd have seen and kept it for lost and found. First encounter I had to explain to staffs that weren't working the day of our visit. So I left them with my number for when they inquire with the staffs from different shifts. Days went by and I got zero ring. So my mom went there again to inquire about it. She was greeted by the same lady who had served us that day and the lady immediately recognized my mom, which my mom thought was a little odd already. Upon talking to her, the lady said that she hadn't found anything as she was cleaning after us. But also said that it was hard to say since there were always people walking in and out all the time. Note that during our visit, my mom and I were the last patrons of that late afternoon before they closed. Definitely not busy with us being the only table left when we dined there. There weren't anybody else there besides us and the staffs that work there. So unless the lady meant like the staffs walking in and out of there WITH my mom's watch, why emphasize that!?? I can't see how it would just magically disappear in thin air. I understand that I got no proof of any of them physically having my mother's watch. But just beware of leaving ANYTHING behind, even in tiny little family-owned-type restaurant. Can't trust anyone these days. \n\nIn terms of food, porridge and their rice noodle rolls are the only things I had kept going back for. But I was fed up with the staffs' horrible attitude and service even before this incident. Also they often run out of simple items, regardless the time of the day like it happened in the mid morning too, such as Chinese doughnuts, which is a pretty essential pairing to porridge. I guess I'd just drive a little further to Fat Wong's near Millbrae. At least parking would be easier there. \n\nConclusion: okay food, terrible parking, and most importantly staffs with horrible services and questionable ethics. Seems like the usual suspects you'd find in most Chinese restaurants. You've been warned.", "author": "Pearl T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "Came here for brunch on a Sunday morning and there wasn't any queue! The food is very yummy. I ordered the sliced fish and pork ball porridge which was much better than I expected. The fish was very fresh so there wasn't any fishy taste. My friend ordered the beef tendon noodle which tasted not bad too. Would definitely go back again. Very affordable too!", "author": "Qianqi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "I've been searching for top won ton soup in SF and finally found it at Ming Tai!  The place is very small but popular so it can be a bit of a wait depending on what time of the day you go.  Lunch crowd seemed to die down around 2pm.  The bbq pork and shrimp won ton noodle soup was so epic that we went back the very next day to try other dishes, as well as more noodle soup.  =)  The won tons are nicely packed, broth is non-greasy/delicious, and the noodles were perfectly chewy.  Service wasn't amazing per SF standards, but definitely good for small Asian place.  Even though I would normally knock it down 1-2 stars since it's cash only and seating feels cramped, I'm still giving them full 5 stars because the food is so delicious that it trumps any other shortcomings.  I'm going to be a regular here and become chubby from this new addiction.", "author": "Lara H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-24", "description": "This place is good except they don't care if you are waiting for a table.  They just walk by you several times without looking at you.  You are invisible.", "author": "D F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-25", "description": "What do Chinese peoples eat when they aren't feeling well? Rice porridge, congee, jook! This is our comfort food similar to having chicken noodle soup as a remedy.  The bf was bit under the weather and I knew that he'd only be in the mood for some HK style jook.  We walked down the street headed over to Ming Tai.  It is a very small little eatery with about 8 tables and Jade channel playing on the tv overhead.  Nothing fancy but it was clean inside. \n\nThey have a decent menu of HK style dishes and your standard noodle/rice dishes and soupy noodles as well as certain types of dim sum.  Of course, we were mainly there for the congee.  Bf got the fish and beef congee.  We also got a soup dumpling without noodles.  The food was quite authentic and perfect for an afternoon snack.  I sampled a little of both selections and approve.  Prices are very affordable.  Our tab was about $13.  Waitresses were very sweet and gave off that motherly vibe.  \n\nI'm not sure why we haven't discovered Ming Tai before.  I think it's bc it's such a small place and we always just walk by not having noticed it.  We will be back again! I would love to keep trying other dishes on their menu.", "author": "Liv A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-12", "description": "A great place for a Chinese Breakfast! They have these \"set\" menu items. I got the Beef Congee along with Pork \" Cheung Fun\". The Congee set meal normally comes with sweet donuts, but you can mix and match with other items on the set menu.\n\nFood was good, service was good!  Often there is a wait on Saturday mornings, but if you get there right when it opens at 8:30 am you should be fine! The staff is very nice, but can seem overwhelmed on busy days!\n\nI've mostly eaten there mostly for breakfast, but the lunch menu is good too!  Won Ton and Noodles are delicious!", "author": "Steven L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "This place has good food. Their porridge is one of the best in the city and their rolls are yummy as well. They get 4/5 because their service is very slow and some of the waitresses just lack enthusiasm. There was a table available but all 4 waitresses was in and out of kitchen. We waited a bit longer and nobody came to sit us so we just sat down. They saw use and nobody came with menu so we went up and got a menu ourselves as well. Then we had to flag one of them to take our orders.", "author": "H H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-10", "description": "I'm writing this review while seating at this restaurant waiting for 10min for our check.\nMy boyfriend and I use to come here because they had good breakfast for a very decent price...even though they had bad service. However today, the service is just beyond ridiculously bad and the food is also blend and the noodles are soggy. Not to mention, they also raised their price. We waited 10min for our tea and had to ask many times for it, and it took the food another 20min to come out. All the people here are pissed off at how slow the service is. \nDon't come here unless you have at least 30min to wait for your breakfast!!!!", "author": "Em Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-30", "description": "Seem to be intimidated by English speaking clientele. Old Chinese ladies pushing to the front of the line and getting seated ahead of us civilized folk who write our names on the waiting list. I guess we should do the same??!! Note, these old ladies were still observed experiencing lengthy wait times once seated.", "author": "Eric O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "It's my favorite \"jook\" place in the city.  It's a clean hole in the wall with a friendly staff. The fish or beef jook is tasty and the dumplings with beef brisket is also very good.  The negative is that this place can get crowded but they do a good job getting everyone in in a short amount of time.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-30", "description": "Terrible, lazy, apathetic service. Waitresses look like they do not want to work here and have an extremely bad attitude. Sat down for 15 minutes and was completely ignored. Finally asked a waitress to take down our order but even then still continued to ignore us. Friends and relatives have told of similar experiences so this is not a one off. \n\nTo top it all off...when food finally arrived it was delivered lukewarm. \n\nWill never ever go back to this place again!!!", "author": "John R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-08", "description": "Small hole in the wall, that offers good no-nonsense Chinese comfort foods...  Portions are perfect, and ingredients are super fresh, and they do not skimp on the quality ingredients either...\n\nWon-tons have plump full pieces of fresh shrimp, porridge does not disappoint if you like lots of preserved duck egg and pork,\nShrimp rice rolls are made with fresh rice noodle and more of that plump shrimp.  I cannot complain about this place, as you get a lot for your money here!  Yummy for my tummy and very easy on the wallet.\n\nSpace is cramped and is good for small\nTables of 4 at most.  Although they can combine tables for slightly larger parties, but I would highly not recommend big parties.  Expect a line, but bits worth it!", "author": "Lawrence L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Came here to eat with my wife and kids and this is awesome.  Customer service is great, the food was delicious and the place is clean. My favorite spot now!", "author": "Jason L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "one of the tastiest congee and one of the best canto breakfast  in the bay area.", "author": "Tracy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-17", "description": "To be honest, they have good food.\n\nHowever, I would rather order to go since the servers were not paying attention to all kind of requests such as asking for water and check. Had to ask for several times to get what I need. \nKind of speechless for their slow service.\n\nNot a friendly place.", "author": "Yingmei C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-27", "description": "Was referred here by a friend from brunch on Monday and was really excited to try it out. The three of us shared, minced pork over the hot pot rice, , their beef brisket with wonton and egg noodle, a jook with Chinese fried doughnut, and another fried doughnut but wrapped in their rice noodle. The doughnuts came first , then some water . The rice dishes were pretty good, just remember it'll take a little longer than the soups and appetizers. The wonton broth was one of the best I've had, it's better than your typical watered down broth and had a meaty richness. The main thing that bothered me was the Chinese fried doughnut in both our dishes, it was just stale and over fried which ruined the rice noodle wrap that is supposed to compliment the dish as well as the jook . Hopefully they can work that out as it seems like I'm not the only one noticing these issues, but the food is affordable and there are a few dishes that really do stand out !", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-19", "description": "This place has the most authentic HK food I have ever seen in San Francisco. When I first walked into this place, and saw how small it was, I was half expecting this to be only decent.\n\nTo my please surprise, this tiny hole-in-the-wall joint serves the most authentic wonton noodles, congee, carrot cake etc. Unlike most other great restaurants where they serve one or two things very well, everything in the menu in this place is truly awesome and 100% HK.\n\nI have been coming back to this place over and over, and will definitely continue to come back again and again.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-02", "description": "This place was all right. Definitely not what the reviews hyped it to be. We ordered three things: fried doughnut rice roll, spicy meat sauce noodles with veggie and soup (from lunch special menu) and beef and tendon wonton noodle soup. The fried doughnut rice roll was stale. Tasted like they were leftovers from yesterday. The spicy meat sauce noodles tasted like spaghetti sauce mixed with minced beef. The only semi good meal was the beef and tendon wonton noodle soup which was decent compared to the two other dishes. Overall, I would not come back here again. Don't let the Yelp pictures persuade you! There are better noodle places nearby than this.", "author": "Yliana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-02", "description": "Bigger wontons than Hai Gy Mi Giia on Larkin..\n\nA little cheaper and smaller portions...\nThe Chinese doughnut noodle roll is a smaller softer equivalent than Koi Palace...\nBut the broth is heartily warm and light on the salt...thin noodles cash only\n\nIf you on a budget . Come here", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "In short summary:\nHole in the wall? -Absolutely\nDelicious Chinese/ Hong kong Style breakfast? - You bet\nDecent Priced? - Cheap, for less than 7 bucks you can get a combo breakfast.\n\nThis place has congee (porridge) down to a science with the perfect ratio of rice & water (some people prefer their porridge to be on the thicker side), but I like mine semi liquid-ish with a certain amount of grains still visible & for texture purposes. Sounds rather complex, hence I believe this place has it down to a science. The congee is neither tasteless nor overwhelming with salt or MSG. Not to mention, the amount of substance that comes with each serving (really, a bowl is enough to share among 2 people).\n\nFor example, the preserved duck egg & pork porridge comes with a ton of pork and thick chunks of eggs. What really sets the porridge here apart is the additional toppings of Chinese fried doughnuts and green onions it comes with (mmMmm).\n\nWith a whole review solely dedicated to just the porridge/ congee, one can only surmise that I am definitely a fan.\n\nBe sure to bring cash since it's cash only.", "author": "Ada C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "Bustling little wonton place with a nice range of variety. They pay attention to and time their noodles like a good ramen place would, and the noodles have a great snappiness to them. There are great lunch combo offers and a good variety of drinks. Since this place is smaller than the nearby and similarly HK-styled ABC Bakery, the quality and service is much higher.", "author": "E. W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "As a Honger,  i am confident to tell everyone, this is the best place to have 炸両，congee and wonton noodle in  San Francisco!! Very traditional Hong Kong style! Small nice and clean neighborhood restaurant! Suggest to order the set meal on the menu, better deal !!", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-16", "description": "Another cha chan teng review\n\nInterior looks renovated.\n\nChinese menu on the back with combo plates (I got the porridge with soy sauce noodles).  It was $5.50.  Add $1 for HK tea. No condensed milk, only white sugar. \n\nI would come here again.  No more Tak Kee Lee as I think the porridge quality went down and so did the HK tea.", "author": "Jboogie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-03", "description": "Came by for brunch and ordered the wontons and shrimp dumplings that Yelpers suggested.\n\nThe wontons were huge and had plenty of shrimp inside them...definitely worth the hype on Yelp.\n\nThe shrimp dumpling were bland and not too spectacular.\n\nOrdered a beef congee as Yelpers suggested trying out the congee. The congee itself was relatively bland. After adding in the beef and some pepper, the congee was then edible...\n\nWe ordered the rice noodle w/ flour crisp...skip it. The rice noodles were too thick and came out soggy. In addition, the flour crisp was merely mediocre at best.\n\nAs the restaurant is tiny, do come early to avoid the wait. Parking is also a challenge in the area.", "author": "Derek S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-02", "description": "A good place for some traditional Chinese comfort food in the area. Congee, wonton noodles/soup, dim sum side dishes, rice rolls and macaroni noodle soups. The food is not amazing by any means, but it gets by and portions fair for the price. \n\nMinced pork with preserved duck egg soup. Doesn't seem like the porridge was super flavorful, like normal pork stewed congee goes. Taro cakes, were simple and fried fresh. Ordered the Chinese donut rice roll, but they ran out. Sounds like it is one of their more popular items. \n\nThey have a lot of servers for the amount of tables. This is a small restaurant with about ~10 tables. Be prepared to wait. Not a place I would suggest if you have a group larger than 4-6. They seem to work pretty quickly to get people in and out though. \n\nOverall: Decently priced food for quality and portion. Service was quick and attentive. Small, clean restaurant.", "author": "Christy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-15", "description": "Our house decided to make a trip way out into the boonies for this place. It was worth the drive.\n\nYummy jook and tons and tons and tons of meat in every dish.  Super cheap too!\n\nCash only but hey, it's a chinese place, what do you expect.", "author": "Tu T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-26", "description": "The rice porrige and won ton are delicious.  If you have time to wait this is your spot.  Great food but horrible service.  I've asked 5 times for tea but never got a cup.   The waitress gave me the check so I guess she is not going to give me any tea.  Despite the bad service I will still come back for my jook.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "I'm glad I finally found a decent Hk cafe type food. The porridge is smooth and tasty. Their rice rolls are fresh with good consistency. Service is fast and it's the classic rude Chinese service but that's normal. Their soy sauce noodles are decent so are their prices. The milk tea is pretty good. Prices are decent. I'm looking forward to trying their wonton noodles!", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-30", "description": "If I could give it zero stars, I would. Worst service ever! Plenty of empty tables, which they did not offer to us. Although they did manage to offer a table to another group that came much later. Unless you want to waste your time, I wouldn't suggest going.", "author": "angela z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-27", "description": "When it comes to breakfast, there's often nothing better than a hot bowl of Chinese wonton soup. My bro and I agreed and we dropped into a popular joint on Noriega for a piping hot bowl of noodles.\n\nI ordered the shrimp wontons and dumplings and we shared some of their popular fried dumplings. I found the wontons tasty but the dumplings were way too big for this dish. The fried ones were basically identical but were far more delicious (frying makes everything better). The soup was ok but a tad bland, but the portion sizes were huge for only about $6/bowl. Their congee looks really good too and I want to come back to try it.\n\nService was just ok, but nothing to write home about. The restaurant is small so not great for groups. If you're just looking for something simple or in a hurry this is a great choice and very affordable. They're open early so it's awesome if it's too early for lunch. I'll be back for the great values!\n\nFood: 6/10\n\nService: 6/10\n\nPrice: $\n\nAtmosphere: 6/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "in our last visit, things turned sour a bit\nlong wait... and the coffee didn't arrive until i finished my food\nthe 炸兩(crispy chinese donut in white noodle cover) tasted stale, and very obvious that it's left over from yesterday\n\ntaking away one star... hopefully this is just a one time thing.", "author": "gswfan .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-16", "description": "Porridge, \"cow tongue mustache\", steamed noodles (cheurng fun), and stir fry noodles are typical HK breakfast dishes, and this place does it well.  With the exception of the watery porridge, the \"cow tongue mustache\" and cheurng fun were fairly decent.  The sweetness of the \"cow tongue mustache\" pairs well with the porridge and reminds me of a typical breakfast day in HK.  The steamed noodles were also well made, not too soft and not too hard with the right amount of texture.  I would try another porridge next time, mine was just too watery and tasted more like soup than porridge.", "author": "Harrison L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-27", "description": "Stick with the wonton noodle. Milk tea was bland. The Chinese donut roll (炸兩) was just so-so. Again, stick with the wonton noodle.", "author": "Lance K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-04", "description": "They never have enough staff working here.  The waitress ia always grumpy and slow.  No service AT all.  the food overall is Okay, but not the Best choice", "author": "Terry L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-12", "description": "Awful awful awful service. I'm not that high maintenance- if the food is good then we good. Unfortunately after a very long wait - 30 min just to get food (on top of a 10 min wait to get seated)- the food was exceedingly average and flavorless.\n\nDumplings are large and generously portioned but the soup and broth are painfully bland.\n\nChinese donut roll was surprisingly flavorless (it looked so good- see the pic) and the texture of the rice roll was very gummy.\n\nNot a lot of redeeming qualities here- won't be back.", "author": "Kim T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-23", "description": "The food was average and so was the service. The server didn't seem like she wanted to be there, but I understand that she probably just needed a job. As for the good, I would say that the portions are alright, but the second dish for the deals is kinda small. The only dishes I liked for the most part was the almond milk and the green veggies.", "author": "Katrina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-04", "description": "Finally made it there on a weekday shortly before 11am for breakfast.  Ordered the porridge and chinese donut wrapped in rice roll(炸両).  The 炸両 is really good!! The donut is crispy and the rice roll is just thick enough to wrap it around nicely.  The texture of the porridge is good.  However, it seems a bit too much MSG as I felt very thirsty in next few hours.(Oh well...it's part of the deal in eating out...)\n\nThe food is average overall but I want to point out this place is clean.(relatively speaking)  Table is not greasy and service is good.  There are other things I want to try on the menu but I will avoid porridge as my body doesn't like too much MSG.", "author": "Penguin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-22", "description": "I love this place. I would eat here every morning if I could. \n\nmy bf and I call this the \"big wonton place.\" the wontons and dumplings are HUGE. and each wonton has so many shrimps! the congee is delicious, the wonton noodles, and the rice noodles with scallions and dried shrimp are a few of my must haves. \n\nvery inexpensive, delicious comfort food. cant wait to eat the big wontons again!", "author": "Serena L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-21", "description": "I liked that they had combo meals. We ordered wonton noodle soup with fish rice noodle roll, assorted meatball noodle soup with bbq pork rice noodle roll and a side of chinese donut wrapped rice noodle roll. I think they make their own rice noodle rolls, which is nice, however it tastes like the ones you get from those dim sum to go places, which they never tastes as good as the actual dim sum restaurants. They were a bit dry. The chinese donut is smaller than average. The wonton soup you just get 4 wontons, and the broth was just ok. The assorted meatball soup broth was bland, but I guess if you like to squirt a ton of hot sauce, then it doesn't matter.", "author": "Vinkin Ken T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-29", "description": "(See pics)\n\nReview #1065.\n\nOh wow the quality here is incredible. The food is so Hong Kong style fantastic that it's nostalgic.\n\nFrom outside you'd wonder a big closed brown door with semi sandblasted floor to ceiling window with big signs of an eatery. At the corner of the wall you get a glimpse of menus and some pictures. I thought, hmm, pictures always look better and was skeptical.\n\nThe combo was less than 8 bucks with very, very soft rice roll that had all the giant chunky prawn style shrimps in them, excellent texture and with perfect sweet soy sauce. The wonton noodles were with these big mostly shrimp dumplings. More than you can imagine kind of deal.\n\nThey also made the ox-tongue bun (sweet dough) and it was amazing too as it's hot and soft.\n\nThis little shop also has a TV playing some Hong Kong style TV show and I know, I'm home.", "author": "T L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-03", "description": "One of the best wonton noodle places in the City. The noodles are what brings me back here about once every couple weeks. The wontons are above average, even though they include full shrimps inside.\n\nThe jook is also pretty solid. Pretty cheap too for SF. Definitely a hole in the wall, sometimes there can be a line but usually won't have to wait long for a table.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-24", "description": "Oh Ming Tai, I thought your name was Hai Huang for the longest time. Oh but wait, your Chinese name is! Well it doesn't matter what your real name is, because you never fail to make me feel better.\n\nI don't think there is another place in SF that I know of that sells porridge like this. No, it's not like the cheap bland disconnected porridge that you can get at any hong-kong cafe. This is legit, creamy, flavorful, made to order porridge. Unlike a lot of the hong-kong cafe porridge that taste like precooked the meat carelessly thrown into a stock of salted white porridge, Ming-Tai's porridge has a continuity between the taste of the white porridge and whatever ingredients you decide to put in there. So if you order a chicken porridge, not only would the chicken taste like chicken (duh), your porridge would actually have the chicken taste too (no, I don't want my porridge to taste like just salt!). \n\nDefinitely take advantage of their weekday breakfast special that lets you combine a porridge and noodle entree with a side dish for a valued price! I recommend getting the glutenous rice dish (糯米飯) or the fried chinese donuts wrapped in rice crepes (炸兩)! \n\noh gosh, I don't even dare to count how many times I typed porridge in this review. *stomach rumbles*", "author": "Alice L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "The boyfriend ordered the Bbq pork and dumpling won ton noodle soup and it was awesome!! The broth is flavorful and the dumpling was huge. The bbq pork was super crispy. I ordered the shrimp won ton noodle soup and the shrimp won ton was filled with shrimp. Five stars for service and for food. There was a little bit of a wait but it's because the food is delicious.", "author": "Patricia I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-25", "description": "Came here after looking at what local restaurants were around the neighborhood. So I came across this place which had beautiful pictures of Won Tons. I bookmarked it and did a little more research. The place looked nice. So ended up coming here on Thanksgiving day. \n\nBefore noon, there were plenty of tables to choose from. Soon all the tables were filled. I had ordered the B lunch special and waited. The free tea was watered down to the point that it tasted like hot water. The steamed beef noodles tasted funny because they used a meat combination found in dumpling instead of marinated beef like how it should be. The shrimp won tons and noodles arrived before my milk tea which I was still waiting for. \n\nThe won tons were larger than normal and very tasty. It kind of tasted like a Har gow. Both the steamed beef noodles and the noodles in the soup were bad. The steamed noodles just didn't taste right. And the soup noodles tasted kind of raw.", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "Hey! as of now, they have renovated the place. More mirriors,  slightly less seating and more organized now as well. Their service is still great, no wavering on that part. Some of their items in the menu have either been changed or omitted in the new.", "author": "William L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-24", "description": "Service sucks balls here even when the restaurant is nearly empty. The only good thing about this joint is their combos. My friend and I were sick so we wanted something hot and soupy for lunch. Since he nixed my pho idea, we decided on wontons instead. The combo I ordered came with a shrimp and pork wonton noodle soup, BBQ pork rice rolls, and a drink, all for less than $8. The food is decent and there's no denying that this is a good deal, but service is horrible. I think we spent more time waiting and trying to flag down a waitress to take our order than we did eating. A shame because this would be a solid 3 stars if service improved.", "author": "Audrey T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-18", "description": "So just a warning -my parents and in-laws tried this place at my recommendation but they went past prime lunch hours. While the food was excellent the service was essentially shut down -my father in law got so upset at the slow service that he ended up walking to the kitchen to complain-apparently it must have been everyone's break time!", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-30", "description": "arggghhh after losing our Ramen Dojo seat, then realizing we wouldn't hit the 2pm Santa Ramen time frame we headed back to the city tail between legs and starving!\n\nThank goodness for my memory bank of quick cheap fast noodle houses that also have comfort sides like gai lan, char siu cheong fun, char siu, chicken wings.... on and on. The won tons are huge and filling and noodles are to the tooth and chewy and the broth is perfection. \n\nI could eat here everyday!", "author": "Jade W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-30", "description": "Plain, really not that great. Noodles like instant, broth was watery and one leaf of cabbage. I have to say the won tons are huge and tasty but that was it.", "author": "Mario A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-26", "description": "4 stars- cash only, 10 cent for each to go box, slow service\n4 stars- best spare rib hot pot rice in SF), very tasting Yuen-Yang (coffee & tea) drink ($2.50) \n4 stars - breakfast special is super cheap (choices from A (egg & ham sandwich, porridge, or noodles) and a choice from B, side dish( flat noodle, sticky rice) and a drink, all for $3.95) BUT must be able to read Chinese because there's no English translation -4 stars rating", "author": "Spike P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-28", "description": "This is the spot for Wonton. Don't bother getting the noodles because it's not worth it, just order of the bowl of wonton.  I think it comes with 5 of them. They are HUGE, but if you tend to eat a lot, then order 2 bowls....but I wouldn't recommend eating all that shrimp for one person anyway, might make your cholesterol level increase a bit.  Other than that, their food isn't all that great.  They are usually full, but their turnover is quick so you don't need to wait long for a table.", "author": "Stacey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-19", "description": "The wontons and the congee are very authentic, I like their radish rice cakes and clay pot with steamed sausages & duck over rice. It makes me feel like I was in Hong Kong.\n\nThe service can be a little sketchy, but it's a family run small restaurant! Doesn't that remind you of Hong Kong too?", "author": "SJ L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-20", "description": "My bf wanted me to have some soup for dinner after being numbed up at the dentist a few hours prior.  I couldn't remember what won ton restaurant my dad used to take me to as a kid, so I narrowed it down to Won Ton House & Ming Tai & we chose Ming Tai due to it's slightly more convenient location.\n\nWe ordered my won ton noodle soup & his beef brisket ho fun (dry) to go & were out the door fairly quick.  With tax our food was under $14, so at least the price is right.  His beef brisket is more beef stew/tendon like (gnow nam), lost in translation on the menu!  He thought it was okay, but didn't care for it so much.  I liked how big my four plump wonton were and the noodles were cooked perfectly.  The broth however could have been more flavorful.  \n\nOverall, an okay place to choose for wonton mein in Sunset, but I still love Fat Wong's in San Bruno the most!", "author": "Cat C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-28", "description": "Never have I taste something so bad before in my life. Come on this is the easiest thing to make for a restaurant business. Is very true that wonton and dumplings are huge but u gotta be eatable also.Soup aroma was very good thats what attracted me and my friends to eat here in the first place is the aroma. one day I was passing by the place with a few friends of mine and these wonderful aroma sucker us in to the restaurant. one I order wonton noodle and some dumplings and my friends they all order brisket with wonton. waited 15 minutes for the food but again as I explain on some of my post on yelp good food worth the wait. so the food arrive and as usual I always aime for the soup 1st because if the soup does'nt tast good then there is no use to continue eating. Again I was disappointed just one zip of the soup I almost jump up and ask for the check and leave. luckly before I had the chance to do that one of my buddies did it so we took off.So to let you people know is not the size or quantity of the food but the quality of the food that you people should aim for.", "author": "Tommy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "Ming Tai has some of the best wonton noodles you can find in the city. Their assorted Chinese/HK style snacks hit the spot as well. In all, you'll be hard pressed to have a bad meal here. The service is a bit spotty sometimes but nothing out of the ordinary for a mom and pop Chinese joint.", "author": "Denny C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-24", "description": "Would give no stars if that was an option! Tried to order chinese donut rolls togo & was told we had to order other stuff too. We didn't want anything else. When we asked the waitress if that was stated somewhere she didn't know how to answer. Another guy came over and pointed to the \"right to refuse service\" sign! Seriously?!?! Not going back there again! \nIt's not like they have great service or anything!", "author": "ivy l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-22", "description": "In a city full of excellent Hong Kong restaurants, this place stands out for their noodle soups and somewhat for their jook, or congee, or porridge, whichever name you prefer. Some of their dishes are definitely lackluster, if not downright bad, such as their cheung fan, but you can't go wrong with their noodle soup and jook. Today we had:\n\nBeef Jook: Great jook and pretty good beef. Very simple and well made, tastes just liek what you would get for breakfast in HK. Not a lot to say except that it's definitely one of the better and more authentic jooks in SF.\n\nPork Ball Noodle Soup: My personal favorite addition, though really all their noodle soups are good. Noodles are nice and firm, with just the right flavor. Their pork balls are the best in the city, though I know pork balls aren't everyone's favorite. The broth is what makes it so amazing though, it's certainly the best I've had in SF and very comparable to an above average one found in HK.\n\nNiu Lisu (sweet chinese doughnut also known as Ox-Tongue Pastry) - I never actually tried this while in HK, so I'm not certain how it compares, however it seemed pretty solid and my dining companion said it was pretty good compared to back home. It's basically a deep fried doughnut that is slightly denser and has a crispy sweet topping on both sides. It was just ok for me, but I'm not much of a doughnut person in general.\n\nCheung Fan - I don't really remember what filling we had this time, but I have tried several different ones, and they were all bad. Usually overcooked and with little flavor. I'd recommend giving this a pass, you can find much better at most other restaurants, honestly.\n\nCome here, get your noodle soup and jook. You can try other dishes, but they can be hit or miss.", "author": "Joshua B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-03", "description": "3.5* I ate here a week ago and the dumplings are still good but not as great as I remembered.", "author": "Kimberly C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-19", "description": "I've heard great things about this little place, how they serve good hk style cafe dishes. As a matter of fact, I've had take out brought to me from this place before which was good.\n\nWhen I arrived, they decided to inform me after I started ordering that they were out of rice. Well I guess that doesnt really leave me much of a choice.\n\nSo I ended up ordering a wonton noodle soup, I dont want to recall what it was I ordered. The meat which was supposed to be char siu was bright red and somewhat dry. The wonton fell apart and the noodles were too chewy and the soup had very little flavor.\n\nWorst of all was my milk tea, It was overly sweet and had no tea taste. I requested for another not so sweet and with more tea but to my dismay it was done the same way. \n\nsorry I'll head over to Tak or ABC anyday.", "author": "phillip w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-20", "description": "Been here many times.  A little hole in the wall kind of place but the won-ton and dumplings are biggest, freshest I have tasted.  The all female chef and service staff are friendly and the price is right.  Definitely will come back often.", "author": "Frank C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-09", "description": "I can tell this is going to be my new addiction.  Three essential criteria are met for my frequent consumption requirement; close proximity to my residence, cheap, and delicious.  \n\nThe food comes out super hot, the dumplings and won-tons are huge, the ramen is al dente, and the chili oil has the flavor and heat that I like.  All of the pros of this place negate the one con that they only accept cash.", "author": "Sandy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-31", "description": "If you are a Hong Kong expat or at least have that kind of street eating attitude that doesn't give five $hit$ about decor, tablecloth, service, hipsterness, Michelin $tar$ and trend$, you will love this place long long time.\n\nIf you are not a HK expat, you might end up here for some golf ball sized wun tuns and congee (given how these appears to be their supposed signatures), get totally sidetracked by the fact that there is \"ramen\" on the menu, and then go absolutely ballastic (until that is, you try it and find out it ain't the Japanese kind, and suddenly that dried tilefish style wun tun broth or murky dark brown broth if ordering with beef brisket, doesn't look as sexy as the white fatty oily skanky pork bone broth from your favorite JP or pseudo ramen joint you are more familiar with that requires an hour wait because you couldn't get your ar$e in line at fir$t $eating). And when you somehow feel an MSG attack going on like an anxiety panic attack because of uhm... hypochondria.... it can get messy.\n\nHad to retry the shui gow (\"shrimp dumplings\") here because they were quite sexcellent at one point back in time, and wanted to see if their rendition still rises above the rest, one shui gow to rule them all.\n\nFile this one under \"greasy hole in the wall\". It's small, somewhat cramped, and gets filled up real quickly kind of joint by the local Cantonese speaking community. Ca$h only but for what you get it's cheap comfort fare in a super downscale environment.\n\nOne small piece of paper in Chinese on the wall, \"pork blood congee\". If you are familiar with Cantonese Chiu Chow cuisine (marinated pork blood cubed gelee) or the Vietnamese bun bo hue noodle soup that has these cubes, then this won't be foreign to you. But otherwise probably not recommended for the casual congee eater.\n\nOn the table, at least the one I sat on, very grimey and worn looking over the ages. One specials plaque advertising old skool \"cow tongue pastry\" that formerly only Taiwan Restaurant on Clement (I think?) and Hing Lung in SF offered. MT only has this on weekends.\n\nOn the flipside, curry fishball skewers, and honey bacon wrapped sausages. Loved the logo, but very out of place for this hole.\n\nAppetizer plain cheung fun with soy sauce, sesame sauce, and some hoisin looking paste for dip n' mix on the side...get your carbs on while you wait painstakingly for your main course. Pre-steamed CF? Made in house? Well for the price I'm not expecting anything so long it hits the spot.\n\nHot milk tea - on the weak side, not as good as Tak Kee Lee next door. Now if only I can order true dai pai dong style (ie mix and match my meal from different eating establishments), i.e. pick up a cuppa hot milk tea from TKL and bring it into MT, that would be freakin swell.\n\nShui Gow Noodles - Maybe I should have ordered plain bowl of shui gow in broth, no noodles....perhaps I would have received 6 to 8 pieces of shui gow. SGN came with only 4 dumplings, guess they could only fit them across the width of the bowl (I'm used to getting 5, maybe that's the # of their golf ball inauthentic style wun tuns). Appearance wise they are as huge as ever, with excess slacking dumpling skin the way they should, form fitting...and if you are a bit of a food pervert, like skin tights. The interior... hmmm mostly fatty pork and some shrimp that lacked that crunch, but pseudo compensated with slivers of woodear funghi. Missing were bamboo shoot slivers and shitake mushrooms in the traditional receipe...DOH. Overall still not bad, and better than Cooking Papa and Champagne (Millbrae) lumpy SG. Broth and noodles you ask? Broth was actually not bad, not as sharp as Cooking Papa's dried tilefish + shrimp won ton broth, and noodles had decent crunch, but if only they used bamboo pole noodles like King of Won Ton on Irving on their best day.....oh well can't beat em all.\n\nService was actually not bad from a Cantonese speaking perspective, which is not saying much if viewed with a set of Westernized eyes and ears and nose. Didn't this place used to have dudes in the kitchen? Spotted two female waitstaff and another female in the kitchen. Changed hands (and gender)?\n\nCome for the shui gow. But set your expectations accordingly.", "author": "Ken K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "After frequenting Wonton House way too many times, I decided that I needed to venture out of my comfort zone. Don't get me wrong, I love Wonton House, but I wanted to be adventurous! So I went to Ming Tai. Which is really similar. So much for adventure. \n\nI ended up loving the rice porridge/congee/jook here more than Wonton House's version, sorry! The broth they use is more flavorful and the porridge is piping hot. There's also extra ginger and the meat is less fatty. I like getting the porridge with the preserved duck egg, so yummy! The Chinese donuts (the long kind) are crispier and crunchy. They go so well with the porridge. Absolutely delicious. Oily too. But delicious! I'm not a huge wonton soup person, but it's pretty good here. It's definitely not my go-to food though.\n\nPrices are pretty low, $5.95 will get you a decent meal. The restaurant itself is small, maybe not so good for groups. It can get busy on weekdays too, so try to get there early if you don't want to wait. On weekday nights, they close pretty early too, around 5, which is a bummer.\n\nService is standard Chinese restaurant service. Please, please don't expect attentive service and get annoyed when you don't get it. They're friendly people, but chill out for a minute and remember that you are at a Chinese restaurant where you will most likely pay less than $7 for your meal. So suck it up and finish your delicious wonton soup.", "author": "Viola L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "3.5 stars, but I'll round up for the friendly customer service.\n\nHad a sudden craving for won ton noodles and/or shrimp dumpling won ton noodles this morning. Looked up a couple places on Yelp, and decided this was the place to try.\n\nDinky place. Pretty clean with semi-new furniture, which is rare at a won ton shop. The sign is easy to miss, because it's pretty faded. It's diagonally across from ABC, a couple buildings next to the grocery store.\n\nI ordered the dumpling noodle, but it came with 3 dumplings, and 3 or 4 wontons. That was actually better, since I wanted to try both but thought I had to choose. I'm more of a dumpling fan, but this round goes to the won tons! They were HUGE, and YES, with a ton of shrimp like my fellow Yelpers mentioned. The won ton noodles itself however, was not that great. I enjoy chewy chewy, and this was definitely more like thin egg noodles. It didn't have that bouncy texture to it, unfortunately. \n\nI'll come back for the won tons, and potentially the dumplings too, but not so much the noodles.\n\nCASH ONLY!", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-31", "description": "A great little place for inexpensive, tasty meals. I recommend their milk tea with anything you choose to eat.\n\nTheir won tons are the biggest I've ever seen!", "author": "Joe Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-19", "description": "When I normally come here, I get the beef stew.  Since it was just my (picky eater) 20 month old son and I, I ordered the chicken noodle soup and added fish balls for an extra $1.45 (since he likes fish balls but I still wanted to try to get him to eat some chicken).  And I asked for rice noodles instead of the egg noodles.\n\nWhen I got my bowl, I saw it was egg noodles right away, but didn't bother telling them.  I gave my son some noodles, fish balls, and some chicken.  Luckily he didn't go straight for the chicken, bc I started eating, swallowed my first bite and told him \"this chicken tastes funny.\"  I put one on a napkin and opened it up.  It was RAW!   I decided to do it to another piece of chicken.  That too, was RAW!  I took back my son's chicken, called the waitress over and told her it was raw and showed her.  She said sorry and took it back.  I'm not sure how my son's fish balls were, but he kept on eating them.\n\nShe later came back with a new bowl and all I ate were the noodles.  I was pissed and didn't want to eat my chicken.  I swear the cook just put raw chicken in my bowl and assumed the 'warm' not even hot, broth would cook it.\n\nIn the end,  they still charged me for the fish balls.  I left them NO tip for giving me the wrong noodles and raw chicken.  If I wanted only noodles and fish balls, I would've gotten the fish ball noodle soup for $2 less.", "author": "Jen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-07", "description": "I have very fond memories here since my dad used to take me all the time. Plus the food here is pretty yummy!\n\nLast time I was here, I ordered the shrimp dumpling noodle soup. There are 4 dumplings in the soup but since they're huge, that's all you really need.\n\nIn the past, I've also gotten the beef stew noodle soup which is also good. Not too much fat hanging off the pieces (unlike some other places). \n\nThe place is pretty small (only 9 tables) so there is a wait especially on weekends during lunch time. The service is good tho. There are only 2 servers so they do their job as quickly as they can. \n\nI always go here whenever I want a good bowl of noodle soup. *thumbs up*", "author": "Jean T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-20", "description": "Not entirely sure about this restaurant. The wait staff was very slow in service. I almost left in my frustration. The upside to my review is that their food was actually very good and was fresh. I have nothing bad to say about their food because I really enjoyed it when it finally arrived to our table. I had order porridge with duck egg and the doughnut.", "author": "Patrick W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-09", "description": "SOOO CHEAP! Dumpling SOOOO BIG!!! \n\nAs expected in Chinese restaurants, there are typos on the English menu: you can buy sandwishes.\n\nPreviously, they would only open until 2pm and there were lines in front every time I drove by. Now they open later and I don't have to wait as long. You can get wontons or, my favorite, dumpling. The dumplings are a combination of the wonton meat AND an individual shrimp, which makes it huge! When you bite into the dumpling, you get a thinly sliced mushroom that adds a nice fresh crisp to the dumpling. I always get noodles and drink all of the soup, even though my tongue is dry afterward. \n\nOn the weekdays between 11am-3pm, if you order two or more items from a certain part of the menu, you get an item for free! There's a picture of that menu on the photos portion of this restaurant.\n\nAlso, the head chef in the back is very nice. She's the only one that speaks perfect English and, once in a while, comes out. When she does, she gives the best service, and with a smile!", "author": "Vanson N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-31", "description": "Nothing beats a bowl of silky, smooth porridge. Call me an old man, but I absolutely love eating this stuff! :O\n\nThey added Pork Blood Porridge to their menu. Well, it's on the wall (in chinese), so we decided to try it. We also ordered a beef stew lo mein. The blood was really soft, but lacked taste. The cilantro and ginger over powered the delicacy of the blood; a bit of a disappointment. The beef stew lo mein was so rich. Few bites in and I felt full. There wasn't much meat either; most of the piece were tendon. \n\nOverall, today's experiences wasn't the greatest, but the porridge is what gets me! I've eaten here a many times and I'm never too disappointed was I leave. I guess stick to my regular order (Sampan porridge and Chinese donut rice roll) would of been better than being adventurous today.", "author": "Derrick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-04", "description": "This hole in the wall may be missed because of this tree in front of it. It is next to the okazu-ya sushi restaurant and the black building that is the firefly lounge and bar.\n\nI go to this place because of the ginormous fricking dumplings(won-tons). They are pretty huge sized and I usually find more than 1 shrimp in each one! The beef brisket is always pretty good as well but the noodles are just mediocre. The other food I always get here is the \"JAH-LERNG\" which is chinese doughnut with rice roll wrapping. It comes with a sweet hoisin-like sauce and some peanut sauce which makes it much more appetizing.\n\nProbably the only drawback:\nIt is somewhat expensive for won-ton noodles\nSometimes, the service is especially slow too.", "author": "Wilson T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-29", "description": "I love this place! Walking inside, it definitely has a hole-in-the-wall cozy feeling. The restaurant primarily consist of noodle soup dishes which is perfect for cold weather. We had the cha siu & won ton noodles which were great. I would suggest ordering egg noodles over their ramen just because I think the texture provides a better balance. Their cha siu is  very flavorful and fatty. The won tons are huge and stuffed with yummy filling. AND, if you go during lunch time and order two dishes, you can get your choice from three items (choy sum vegetables, cheung fun, or...something else...i don't remember) for free. \n\nIf you're health conscience, I don't recommend coming here as the broth is pretty oily. But then again, I don't normally suggest Chinese food if you want to eat healthy. If you don't mind the fatty goodness, I would definitely check this place out!\n\nCash only! Bring the bills.", "author": "Jonathan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-09", "description": "A gloomy and rainy day led us to get won ton soup for lunch.  We walked in at lunch time and were seated right away.  I think they get busy because they have a wait list hanging on the wall.  \n\nDon't expect ambiance cause there ain't any here.  4 huge shrimp won tons floated in my broth and they gave me my BBQ pork on a side plate, (thanks!) so it didn't get soggy.  My bf got the BBQ pork ramen dish.  We couldn't figure out if they used fried ramen or the fresh kind.  If it's fresh then thumbs up for them.  \n\nThe staff was friendly and understood my sorry-ass mandarin.  I'd come back here since it's close by and if I craved won tons again.", "author": "Rosalind S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-08", "description": "We hadn't yet eaten in the Sunset District, and a friend from China said it was her favorite restaurant in the city; a little hole-in-the-wall with amazing wonton soup that wasn't oily, so it would seem nice and light, though a decent portion.\n\nI have to admit, the shrimp wonton and dumpling soup I ordered was quite nice. The wontons and dumplings were both huge, and tasty, and served crazy-hot. The vibe of the place is definitely a little dumpy. I like hole-in-the-wall actually, but there were definitely some easy, cheap/free things that they could have done to improve the aesthetic... such as cleaning up a bit better... that would have gone a long way.\n\nBottom line: I'd go back. But I wouldn't drive back. If I were in the neighborhood and in the mood for soup, sure, why not. But it didn't invoke the type of cravings that cause me to make a beeline for the nearest parking spot either.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "Great portion of conjee & portions of meat in the conjee. A good neighborhood hole in a wall go to place for conjee & dumpling noodle soups.", "author": "Katherine V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-27", "description": "There are so many good things to eat at this place, especially if you are looking for chinese food that you never find at more \"Americanized\" places. \n\nMy favorites are: the fish wrapped in noodle, the chinese broccoli (it's perfect: still crunchy but not bitter), the bbq pork ramen, and the spare ribs. Everything is succulent and delicious, and it's all so cheap! \n\nTwo things I have had are a little meh: the tea quality vaires greatly, I have been there twice, once with horrible, bitter, over-steaped tea, and the second time with perfect, light tea. We also ordered the \"Tofu chili lettuce\" which turned out to be soft lettuce with something that looked like thousand island dressing on it, no tofu in sight. It was very salty, but after added chili sauce was ok. \n\nAnyway, delicious and cheap, and you should try it!", "author": "Leslie I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-05", "description": "I've been here years ago, but am not certain it's the same owners. It was so-so then & hubby recently looked at the menu & noticed ramen & wanted to try it. Let's put it this way, don't expect \"ramen\" like you would at Santa Ramen's in San Mateo. This is ramen noodle but cooked Chinese-style. His brisket as stated by a Yelper, was mostly tendon, not so much meat. He liked it, nevertheless, $6.50. \nWe tried the fried chicken wing, which was lightly dredged in flour and crispy, very good and I'd order it again, $5. \n\nI was disappointed by my abalone/chicken congee, $6.50. It arrived hotter than the seat heater in hubby's car and took awhile for me to eat. The porridge was watery & bland. Big chunks of chicken, slivers of ginger and 5 slices of abalone were mixed into the congee. I tried one of their Chinese donuts, which was skinny, crunchy and hard on the outside and bland. Hubby thought it was too oily. \n\nIn the middle of the nite, I was awoken with stomach cramps, something which rarely happens to me after dining in restaurants. Hubby even said it was probably the congee. \n\nThe place is small and at senior dining hours, 5:30PM, there were many tables filled and everyone cleared out quickly, leaving only a couple when we were leaving. The most popular dishes ordered seem to be the rice dishes in metal pots, won ton noodle, turnip cake, dumplings. The tea came in a mug and tasted like those cheap tea bags you'd find at a Howard Johnson's. Service was OK, just one woman taking care of the whole room, typical at small, indiscreet, local restaurants. Whether I return for another visit remains to be seen.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "Pretty good porridge.  Everything is fairly fresh too because they always have a crowd.", "author": "hannah t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "This place is good for some breakfast takeout, lacking the last star because it takes them a while to get the food ready..", "author": "John M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-25", "description": "Not bad. Not bad at all.\n\nThis place is tiny but food is pretty good. I know they're known for the wonton but I ordered the fishcake/seafood noodle soup and it was delish.\n\nThis is a good place to go on a cold day when you're craving porridge or something soupy to warm you up.", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-18", "description": "I HEART THIS PLACE!!! Another one of my favorite Chinese Soul Food places.\n\nI always get the Spam and Fried Egg Macaroni Soup and the perfectly pan-fried turnip cakes. SO GOOOD! The soup is perfect for a cold foggy Sunday morning after you drank too much the night before.  Usually these two dishes fill me up nice and good but since everything is so cheap I also get the deep-fried dumplings chalk full with shrimp, those black string mushrooms, and veggies. *!!!!!!!!!* Usually they are paired with a mayo dipping sauce but that last time I went they gave the sweet and sour sauce. Boo!  And you can't forget the lemon honey hot tea. So yummy. :)", "author": "Rose J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-23", "description": "This place is tiny and a quintessential-mom n pop-(without the pops?) -hole in the wall-restaurant! That sure is a mouthful and with that said, let's get on to the goods! Speaking of mouthful, you'll be sure to get stuffed with the portions they serve here. The sweet waitress lady happily seated me and took my order even though she was on her lunch break:) I heard about people finding 4 whole shrimps in their wontons and I definitely wanted to know if that was just a lucky find or if this place really is just that generous. I ordered the wonton noodle soup with ho fun. The place was actually fully seated and service took longer than expected. \n\nMy order took a while to come out but they only had one guy in the kitchen making the food while another lady was making all the rice rolls (i'll definitely cut them some slack and you should too!) When my food finally came out, I was excited to dig in! I noticed that the rice noodles were thinner than the ones I'm used to, so I can't even really say if its homemade or the dry kind that you get at the store:( minus one star for ME not knowing the difference! I would hope its homemade since they make their own rice rolls and the consistency is the same! \n\nI dug into the soup and that's what either breaks it or makes it for me. Sure enough, its delicious! Light, tasty, flavorful and perfectly compliments the noodles and wontons. I continued on to test the fact or myth wonton and thank goodness I found 4 shrimps in my wonton! HURRAY for Ming Tai, because you're a WINNER in my book just doing that alone. \n\nI'll be sure to come back, no wait, this is my TOP choice in the area and it just so happens I frequent this area a lot. Thank you yelpers for helping me find this little hidden gem. \n\nBy the way, they make ja leung here! (chinese donut wrapped in rice rollss!)", "author": "Connie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-11", "description": "Still a solid four! \n\nI love the turnip cake, its seriously as good as my mother's. This place also serves chinese donuts! I also usually don't like congee but we got the duck egg/pork one and it was REALLY good. Dip the donuts in it, tastes awesome. \n\nThe shrimp wontons were good as usual. I don't think I'll ever get the wonton noodle soup because the noodles look awful. Wonton noodle soup should have soft squishy wide noodles (similar in texture to the wonton skin), not weird wiry yellow noodles that look like anorexic ramen. \n\nIt seems like they might have cheap delicious Asian breakfast combos, but I couldn't read what was on the menu.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-19", "description": "I got a bowl of BBQ pork/won ton soup...came with 4 medium sized won ton, and a good amount of BBQ pork...I thought this place was all about the won tons,  4 of them???? $7.45 plus tax, $8.11. I was still hungry when I left...I could get a bowl if won tons/BBQ pork, larger portions for $5 at  many places...not worth it. I gave it 2 stars cause the won ton were tasty.", "author": "Gene K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-13", "description": "Breakfast combo for $3.95 from 8-11am. Includes assortment of congee, noodles, and sandwiches.\n\nTeeny, weeny with just a few tables, this is my new favorite, local, Asian breakfast place. The wantons are loaded with shrimp and HUGE. The broth is delicious. The service is friendly. The congee is great as well.", "author": "Sue Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-04", "description": "Small clean noodle place that probably can fit no more than 25 people. Its a good place for lunch as they also serve a bunch of noodle soups. they also have a lunch special where if you buy 2 noodle or rice entrees, you get a free vegetable side dish or another rice dish. Available from 11am - 3pm. The noodles themselves are about average. Dont get the ramen as its not very good. The egg noodles are good until they soak up the msg ladened soup. Dishes range from $5-7 a pop so pretty cheap.\n\nBottom line: good place for lunch if graving noodle soup. CASH ONLY though.", "author": "Robert Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-05", "description": "I used to like this place. I don't think they served jook (rice soup or congee) like they used to. Other special items took a turn for...the cheap side like their Zah Leong (rice crepe wrapped chinese donut). Usually I like my chinese donut with a crispy outer shell with a crispy light and airy core. This makes the rice crepe the perfect match giving the Zah Leong a crispy inside and soft outside. What they had served was too doughy inside and when it's doughy, it's not expanded and thus not airy. The jook was good, but I felt like there wasn't a whole lot of content in it and I would like to have more than 2 slices of chinese donut on top. \n\nI hope the noodles are still good...", "author": "Jeremy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-23", "description": "I was around the UCSF area recently and called up my parents before my flight  back to SoCal.  What do Asian parents do when they only have a couple hours with their kids?  EAT!\n\n I won't be hungry, but I will always eat(and enjoy) if there is food in front of me.\n\nMy parents called up their friend who knew the area to get a recommendation for good won-ton noodles and this was the place he suggested.\n\nWe ordered: \n.won ton noodles\n.won ton only with soup\n.Zah Leong(sp?) - thin white doughy layer wrapped around fried long chinese 'donut'\n.salted pork w/preserved egg porridge.  \n\nI found their won ton soup well balanced. Just the right amount of delicateness and satiating mouth-feel.  My mom was amused by the size of their 'huge' won tons(just smaller than a ping pong ball).  One bite and I can visibly pick out four individual shrimps nestled in a cushion of meat enveloped by thin won ton skin. \n\nI recommend their won ton noodles/soup.  The porridge was good.  The Zah Long was palatable.  Not miserable, nor extraordinary.", "author": "C. S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-03", "description": "This is based purely on the food only. If you can overlook the service and cleanliness, this is a great little place for a quick bite at a reasonable price. \n\nI came here with a buddy of mine and we always like to compare wontons or Chinese food to that of Vancouver.  Vancouver, next to Hong Kong, has the best Chinese food out there today.  Using that as our guideline, we start to rate Ming Tai Wun Tun Noodle.\n\nThe wonton noodle soup is great. It's not the best I have ever had but it's pretty damn close to being one of the better wonton houses in the city. I personally believe if they had a higher turnover ratio in their dining room then I believe their wontons would be a little fresher making it honestly a 5 star wonton house. The shrimps in the wontons aren't bad but they aren't exactly the freshest either. The soup base was good, the noodles had that crunch that you would like in a wonton noodle soup. A great combination. \n\nAs for the rice roll, it's probably below average. It's definitely home made and the ginger on the beef rice roll was just a little overwhelming, they weren't julienned properly.  It was almost the size of a toothpick\n\n2 beef stew wonton noodle soup \nchinese broccoli (free, part of their promotion) \nbeef rice roll \n\n18.50", "author": "jason g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-05", "description": "refer to Candice L's review. \nit captures the essence of the dining experience you will get here. the only thing i want to add is that is opens early for breakfast too.\n\nthe BEST wonton in this part of town.\nclose second is Win's on Taraval\nC-town = Hon's on Kearny", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-16", "description": "Almost had lunch here today.\n\nWe were seated and as menu's were dropped off at the table, the server mentions to us that they are out of Ox Tail and Jook (Rice porridge).  Not a problem, I don't eat Ox Tail and I wasn't looking to have Jook for lunch any way.  Dad was here for noodles. \n\n( FYI, there wasn't a Hello greeting, the first words out of the lady's mouth were \"No this, no that\" for our greeting...I felt so welcomed! )\n\nAfter a quick run down of the menu with reasonable prices, for noodles and rice plates, I decided on something down-home and hearty:  Minced Beef with Raw Egg over Rice.  \n\nAs I gave the server my order,  she tells me they are out of RICE!  What?!? Out of rice??\n\nLady, you should have told me you were out of rice in the first place instead of telling me you were out of Jook, I would've completely understood, no rice, means no Jook.  \n\nAgain I ask, how can you be out of rice?  Granted, you specialize in won ton, but still.... how can you be a Chinese restaurant and be out of rice?  Is it that much of a hot commodity?  You might as well close the door!\n\nNeedless to say, we left.", "author": "Cass J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-15", "description": "I always thought the shrimp wontons here were the best; they still are but after I ate here today with my boyfriend we both did not feel well. I think it's the MSG? Or it could be the noodles. My stomach is still cramping from the food that I had. I had the shrimp wonton with dry tossed noodle and my boyfriend had the shrimp wonton noodle soup. This place will always lack good customer service (they are lazy and inattentive), they look like they don't even want to work. Although the shrimp wontons are delicious, I wonder what goes in them. I am not coming back to the place with the delicious shrimp wontons and below average customer service.", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-16", "description": "My mom's friend took me here and it was great!!\nWe all ordered the Shrimp Wonton & Dumpling Soup.\nit was only $6.25.. \nThe soup was subtle but the dumplings were full of flavor and shrimps\nplus the noodles were wonderful... slightly chewy\nIn fact the wonton soup so delish that.. what would you say...\nI felt like I was in China??", "author": "Jane J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-24", "description": "1. From open to 11am, $3 something special for fish or preserved egg congee + small side dish. Not sure if weekdays only. Super cheap breakfast/brunch.\n\n2. Congee is watery but comes in huge bowl enough for two. Unless you're one of those big eaters. \n\n3. Service is a one woman show. Slow service. Be assertive. \n\n4. Food is good.\n\n5. Small place. May be a 10 minute wait. Come before 10:30am if you want the aforementioned daily special. \n\n6. The other dishes look good too. Not $3 cheap but quite reasonable at $6-7\n\nConclusion: Good super cheap food, with slow service.", "author": "David N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-02", "description": "A bit background to the review: I am Cantonese born and raised in Canton. So my taste preference is typical Chinese. My  Chinese friends think i am a foodie and good cook. This place has the best steamed rice noodles, or Cheung Fun, in the United States as far as I know. The braised beef tripe is decent. Customers here is 99% Chinese. So come here if you want to try the real Cheung Fun. But congee, noodle soups, and other dishes are more 3-4 stars. But ultimately, we come here for what? Long live Cheung Fun!", "author": "Feng Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-06", "description": "I've dined here several times.  The won ton and dumplings are about average. They do make them large compared to other places.  Broth and noodles are similar to other won ton restaurants.  (Although the ramen isn't like any I've had anywhere else.  Nice for a change of pace) No surprise there.  During the week at certain hours, they do offer a nice extra with a minimum order of two noodle or rice dishes: a choice of greens, Chinese beef stew, or rice noodle crepe roll.  It's a small place, so don't go with more than four persons.  \n\nFunny side note:  They always have a HK game show on TV, which my wife and I find hilarious, even though we barely understand Cantonese!", "author": "Stephen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-03", "description": "Very nice and hospitable family restaurant.\n\nThis place has really good porridge, one of the best in San Francisco.  Some other notable dishes are their deep fried dumplings and Chinese donuts.  Everything here taste extremely home made especially their porridge.  I think the dumplings can be a bit greasy at times but make sure you eat it slowly, otherwise you'll burn your tongue.  The food here cost a buck and a nickle so its always helpful on the wallet.", "author": "J Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-09", "description": "Haven't ate here for a long time, so I thought to give it another try...MAN! It was HORRIBLE!!!\nFOOD was TERRIBLE; SERVICE was TERRIBLE!  1 star was already too many!\nI went there (table of 3) on a weekday for lunch, the place was less than half filled, STILL, they missed my order of pork liver porridge.  The porridge finally came after my other guest finished their food.  The waitress did not apologize or even say anything about the delay.  The porridge was even worse, it was so watery that pretty much the rice and water was separated.  It was also tasteless, no flavor at all, they didn't even bother to put some chicken broth in it to enhance the flavor.  That was a complete waste of $5.50.  This place was supposed to be known for their porridge and noodle?!?!   Tak Kee Lee a few doors down & ABC across the street are WAY better!", "author": "Jen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-26", "description": "When it comes to making an attempt to satisfy my \"tastes of Hong Kong\" cravings this place will makes for a temporary fix. The won tons are huge with 4 shrimp inside. The noodles are a bit on the soggy side as they don't yield a crunch to them that good won ton noodles give. Their \"sui kau\" dumplings are good too with lots of wood ear mushroom filling and pork as well as shrimp. \n\nMilk tea is decent but you really have to suck if you can't make milk tea pass. \n\nTheir porridge isn't bad also due to the fact that it actually has a consistency like porridge is supposed to have, which isn't too watery but not too thickened. \n\nOne thing I really do enjoy here is their steamed pot rice. You can have a choice of what you want on it. My gf usually gets the mushroom and chicken while I stick to the classic preserved meats one. It's a bit of a wait for it, but always satisfying after.", "author": "Derrick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-13", "description": "Their wonton is really one of the best around. All their other foods are just run of the mill Chinese soul food. Their service is not very great and it seems like that they are doing you a favor serving you. Go for the food, just don't expect any service. They have very odd hours and sometimes they are not even open when they should be.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-29", "description": "Ambiance. Hole in the wall. Waitress with an expressionless face. Think Chinese zombie. She looked so tired as if she woke up at 6a.m. from the rice paddy field. Come here for a taste of Hong Kong breakfast and atmosphere.\n\nFood. For lunch, the won ton noodle soup (~$6) features a few meatball sized won ton and noodles in a broth. For breakfast, I tasted four dishes. Lacking salt and seasoning, the seafood porridge were showered with a few rounds of Chinese fried donuts. With a better savory touch, the preserved egg porridge was a better choice. The rice noodle with dry shrimp was nominal. The fried doughnut wrapped in rice noodle stole the show. Contrasting soft rice noodle, the crispy fried donut. A quick slather of the hoi sin sauce added needed sweet flavor.", "author": "Rayfil W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-18", "description": "I went here years ago and loved the congee.  It wasn't as good as Hing Lung's but it was my second favorite in SF.  The place was constantly crowded too.  And you could order a side of preserved egg for any congee (yum).  I returned again recently and something happened over the years though; Ming Tai isn't what it used to be.  \n\nSo I ordered my usual, the pork and preserved egg congee ($4.75).  The pork pieces were too large & bland.  I don't think big pieces of meat belong in congee.  I don't want to chew anything while eating Cantonese style porridge.  The egg quality wasn't up to par.  However, the consistency and flavor of the congee were very good and I liked the slivers of fresh ginger very much.  Also, you can get the fried Chinese donut and even the kind that is wrapped up in a rice roll.  I had the latter and it was good but the donut was served COLD (not good).  \n\nMaybe their dumplings are still good, I don't know.  I've never had them.  I'm a congee/porridge girl.  This place also has a Chinese diner feel but not the family run charm of Won Ton House.  Cash only.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "I absolutely fell in love with this hole in the wall. Reminded me of Hong Kong especially with the bad service and cheap tasty noodles part. The best thing is the won tun noodle soup and the up to date cantonese game show playing in the background. I will be back for more wun ton noodles!", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-01", "description": "The congee here used to have the perfect consistency.  It appears that they tinkered with the recipe sometime within the past year, and it's now slightly more watery than it should be.  Perhaps they're trying to stretch each grain of rice?\n\nService here has always been the pits. Rayfil W.'s description of the \"waitress with an expressionless face...Chinese zombie\" is perfect! If it's so tough for them to refill tea, why not just set up a small station where customers can help themselves?", "author": "Eating Sleeping T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-12", "description": "The best dumpling and wonton!  They use large shrimp and flavor them well. \n\nThe broth is a bit bland but as a little soy and it's good to go.\n\nAlso like there rice rolls with shrimp.\n\nThere is usually a short wait on Saturdays and Sundays around noon time. Me no like lines!", "author": "Bob S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-18", "description": "\"Meh. I've experienced better\" is the perfect way to sum this place up. The broth was okay I guess... but the beef was weird, and I was never sure which part of the cow was in my bowl. The same goes for the chicken soup that my friend ordered. I don't think I would bother returning here. The only reason this place is getting 2 stars and not 1 is because it's so cheap, so it wasn't an expensive mistake.", "author": "Beatriz A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-06", "description": "they might as well post up a sign in front that reads. \"We dont serve your kind\"\n\nmy entourage of 5 and i were basically the only ones in the restaurant on a saturday brunch. \n\nso it took the waitress about 30 minutes just to give us menus, than another 30 minutes to place the order, than an hour to get our food, than another 30 minutes to get the bill, than another 30 minutes for her to collect the bill. no exaggerating. we asked for assistance a couple handful of times but was rudely ignored. and for what reason? no one knows.\n\nmight be the worst service ive ever had. she didnt even want to collect the tab. \n\nBasically, we were Unwanted here and step into the wrong restaurant.\nFirst and Last visit. \n\noh and the wontons/ dumplings were pretty good. but the service out weighed it all.\n\nONE STAR.", "author": "Rudy R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-28", "description": "Pretty good wontons and Shui gow. I would advise anyone with allergy to MSG to not eat here since I had to drink 3 glasses of water as soon as I got home, due to the effects of MSG.  The service here is apathetic.  1 star for the lousy service.  I basically had to walk over to the waitress twice to get the check.  15 mins after I asked for the check I had to walk over again and stand over her to make sure she gives me the check.  The table next to me saw this and asked for the check and takeaway box as soon as they brought the food.  :-) Nice to know my misery has benefited someone.", "author": "Jim J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-11", "description": "A local gem I like for their won ton noodle soup, tza leung, a dish of Chinese doughnut wrapped in rice noodles, and most of all for some of the best jook in the city!", "author": "Loraine T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-29", "description": "This is the best wonton noodle I have ever had. It's very out of the way for me, but well worth it since we just drove to Fort Funston after we finished.\n\nI had the wonton noodle soup and my bf had the beef brisket dumpling noodle soup. The portion sizes are more than fair and it definitely won't leave you hungry. The wontons are basically 4 little shrimps wrapped in a thin, soft, delicious wrap. The broth wasn't too msg tasting and the chili sauce was some of the best I have ever tasted.\n\nIt just hit the spot on a cold winter day in San Francisco. Also, the $13.50 doesn't hurt your budget in this lousy economy.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-30", "description": "Not what it's all hype to be. It's an ok Wonton house with over-sized wontons. So it has bigger wontons, but doesnt make it special. Almost $8 for the beef brisket wonton noodle soup and only comes with 3 wontons. \n\nThe wontons is just big, that's it. Nothing special at all. A lot of MSG and no taste to the broth. Not worth it in my opinion. Go up the block to Menkee or Wonton House on the same street, Noriega street.", "author": "U L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-29", "description": "Great won tons! Everything on the menu is super affordable! Rice plates, noodles/won ton dishes for $6.00 and appetizers for anywhere b/t $3-$4. Super delicious. You would never think this dingy little shop squeezed b/t a sushi restaurant and a bar was worth while. Don't judge a book by it's cover?", "author": "Lily W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-06", "description": "This place is a bit small, but I love the won ton noodles here, and the beef brisket! It's delicious! And sometimes they even give you a free rice noodle dish for some reason. I don't ask why, but hey its free why not. My new favorite wonton noodle spot.", "author": "Terry S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-26", "description": "My friend kept raving about the porridge from this place so I really wanted to try it out . We were finally able to wake up kinda early today and come here . The iced lemon tea was not bad . The abalone and chicken porridge was not bad but failed to impress me ... probably because I'm really picky . The porridge had a lot of chicken in it . The pieces of chicken were alright ... they were pretty smooth . The wonton noodle soup with beef haslet wasn't that good . The beef haslet tasted like it was overcooked . The wonton and the noodles didn't taste that good either . However , what really impressed me was their BBQ rice noodles . They were so yummy and full of flavor !!", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-03", "description": "Worst fried chicken wings I've ever eaten! But other than that I guess their food is pretty decent.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-03", "description": "I found this place on Yelp when my boyfriend wasn't feeling well and needed good 'ol Chinese comfort food, i.e., porridge. We just wanted take-out, but were left standing for quite some time before anyone came to see what we wanted. It took a while to get the food, as the parking meter ran out. I was skeptical about the porridge, but the beef slice porridge and the duck egg with pork porridge were both delicious. There was good flavor and the rice was also of a good consistency.\n\nI think we'll come back to try their won ton noodles or other dishes and dine in.", "author": "Ellen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-13", "description": "Good homemade style wonton for a very decent price. Most dishes are around 5 bucks and come out pretty quick within a couple minutes. Great for when you need something warm or to cure a hangover. This place may not look like anything special, but the food is delicious. Always satisfied after leaving this place.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-20", "description": "Huge dumplings and won tons.  If you come for lunch during the weekday with a friend, you get a free side of greens, beef brisket stew, or rice roll. I like that they don't skimp on the shrimp.  Each won ton has at least one full-sized shrimp.  Just be sure to bring cash.", "author": "Marleen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-01", "description": "I think this place is great.  pork lard in shrimp dumplings?  if that's what makes it taste better, then so be it!!\nanother plus is that it's right up the street from me so add a little spicy sauce to the soup and you have the best cure for a weekend hangover.", "author": "Rio K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-01", "description": "It's Friday night and that means, I don't want to cook.  And it's also raining.  And I'm hungry.  Let's go get some noodle soup!  Yay...!!\n\nAfter yelping, we decided to go to Ming Tai Wun-Tun Noodle place on Noriega Ave between 31st and 32nd Ave.  The good thing about 8 o,n, ib a rainy Friday is that we found parking right away.  And the place only had 2 other customers.  Just the way we like it.  Nice and quiet dinner on a Friday evening.  After looking at the menu, we decided on Beef Brisket Noodle soup and BBQ Pork Wonton Noodle soup.\n\nMy fiance's beef noodle soup came out first -- it smelled really good and had lots of beef on it.  And not chucks of fat, just the way he likes it.  And my noodle soup came out and it had 3 BIG pieces of wonton and about 6 slicesof BBQ pork.  Each of those wonton had FOUR shrimps.  Yeap..FOUR shrimps.  I was amazed.  The soups were delish!!  We didn't taste much MSG.  I don't even think they use MSG.  But who knows.  The proportion was just perfect too -- not too small and not too big.  It was just the right amount.  And the red chili that they had at the table?  Well, it was wow!!  It's so darn good.  I think they may have added vinegar to it?  Or something.  Damn..I long for it now.  ha ha.  For both soups, we paid ~$14.  No complaints from us what-so-ever!  We'll definitely go back!\n\nI do agree with other people -- the place is kind of small.  I think it may fit about 20-25 people.  But it's definitely clean.  And they only accept cash.  \n\nHave fun visiting this place -- it's so good!", "author": "Joyce L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-19", "description": "Fun and jook is my livelihood. Whenever I head over to Hong Kong or China, the first thing I do is run into a wonton joint and get my fill. Back here at home, I try to replicate that experience any chance I get.\n\nMing Tai does the job better than most places in SF, but that isn't saying much. The service staff faithfully carries the attitude of a Hong Kong jook joint. They are dismissive, rude, but generally pleasant.\n\nTheir menu has all the staples you expect: assorted jooks, dumplings, funs, and braised noodles. The jooks work; its consistency and flavor warms your soul like any jook should. Try the Sampan if you're into seafood, or the Thousand Year Old Black Egg and Lean Pork if you're, er, into that. Be adventurous, people.\n\nThe dumplings are tasty and huge, but the broth and noodles they sit in are unremarkable. And that basically sums up this place: pretty good food, but no wow factor.", "author": "Derek L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-02", "description": "this place is tiny. \n\ni really like their lunch special; comes with a meal a side dish and a drink (hot drinks, they don't charge but cold drinks is an extra 1$) \n\nif you're craving for porridge or wonton noodles, this is the place to go..", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-14", "description": "A 4 star for food, 3 star for the place being too small, average 3.5 stars to be fair.\n\nMy mother in law recommended us to try this little noodle shop and said that she visits there all the time.  I and my hubby used to go to Tak Kee Lee and we decided to give Ming Tai a try when our favorite Tak Kee Lee was packed with people and there's a waiting line inside.\n\nMing Tai is a small noodle shop, the tables are so closely placed next to each other.  In the weekend, there's no set meal for order.  So, we ordered individual items, a Cha Siu Won Ton Ramen, a fishball flat noodle and a Cheung Fun.  \n\nI like the flat noodle, the fishballs are just average, not really special.\n\nMy hubby likes the ramen.  The wontons are big and tasty.\n\nCheung Fun is fresh and the sauce is nice.\n\nEnd up we paid $19 including tips.  It's not very expensive but both I and my hubby walked out with a feeling that we need some more food.  Finally, we went home and had a half portion of the sandwich that we bought yesterday evening in Safeway.  We may possibly come back when our friend Tak Kee Lee is packed and we want some good noodle soups.", "author": "Roserrele W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-14", "description": "This place is ideal for barbarians.  I went to this place after reading the reviews of Ken K and Stanley L.  They both 5-starred it.  I was looking forward to trying it.\n\nUnfortunately, I didn't like my bowl of chicken noodle soup much.  I wouldn't order it again.  The chicken was strongly and deeply flavored with something - not sure what - maybe MSG or 5-spice.  I couldn't really taste a chicken flavor.  .  The pieces of chicken, like the wontons that others in my party had, were huge.  The wontons had 2-3 shrimps in each.  I found it difficult to pick up the big chicken pieces with my chopstick.  Sheesh, can't they make their wontons and chicken pieces smaller so I don't have to chew pieces off like a barbarian?  Just take those big wontons and make them into 2 or 3 separate ones.  If they did that I would up my rating to 3 stars...but still not go back.\n\nI would say this place is a run-of-the-mill small wonton house.  It holds maybe 25 people.", "author": "Sun W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-02", "description": "There are won ton restaurants all over the city and when we stumbled upon this restaurant a couple months ago we thought it was pretty damn good, but now that my parents have also given it their stamp of approval I feel confident in spreading the word on Yelp also. What hooked us in were the size of the won ton and dumplings that are served at Ming Tai. The dumplings are extra large and packed with shrimp and black mushrooms. Very simple, but the ingredients are fresh and they don't skimp on the shrimp. For the carb conscious you can also get the won ton or dumplings without noodles and it's still a filling dish. If you are going to order the noodles I would definitely recommend ordering the egg noodles over the ramen as the egg noodles have a lot more flavor.\n\nThe jook also has the right texture and is flavorful without needing to put too much extra soy sauce or white pepper in it. Another popular dish is the Chinese donut wrapped in chun fun that they serve with a sauce of peanut butter and oyster sauce. It sounds strange, but the sauce is actually a great combination of flavors.", "author": "A and K W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-20", "description": "Best wonton noodle place in San Francisco, hands down.\n\nTrust me, I KNOW. I got the I'm-from-oversea knowledge and experience.\n\nI know this place gets smacks for the poor customer service. To me, its just authentic. If you've been to multiple no-frills, hole in the wall joints in Hong Kong, you'll know what I mean. It stems from a no-tips required tradition found in most Asia and European countries.\n\nEasy solution to avoid the \"authenthicity\"... get take outs.", "author": "Stanley L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-08", "description": "there was a constant line today at lunch, and good job we got there as a bunch of tables were leaving...... wow this place was busy... Ok so the service was a not too great, but we were here for a quick, cheap and simple lunch and we got what we wanted.\n\nQuick look at the menu and there were various combinations of noodles, shrimp dumpling, wontons.... from previous experience a 'SHRIMP' dumpling or Shrimp Wonton is never just shrimp- like my parents they try and sneak fatty meat in every thing, saying it makes things more 'flavourful' so I played safe and ordered the black mushroom noodle soup- REALLY GOOD- who wouldve thought to use whole shitake mushrooms as dumpling substitutes?! \n\nThe man ordered the wonton and bbq pork noodle soup and was impressed with the wontons..  must say beware of the MSG, my mouth was tingly and was thirsty for hours after..\n\nthe rice rolls are pretty good too, get to them while they are steaming hot...... crowd was mixed- families with their kids, the odd grandpa with them, young teenagers taking advantage of the big bowls of jook. one appetizer and and two bowls of noodles soup will set you back around 20 dollars....", "author": "Sushi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-16", "description": "Go for their carrot cake and fish porridge. Only $5.50 per bowl, where else can you get such good value congee?", "author": "Chloe L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-29", "description": "Ming Tai Wun Tun Noodle has the best won ton noodle of all time!! it is cheap and gooooood!! :] Boyfriend got the duck over rice, it was greasy but it was good and tasty!!! I would come here again anytime! :]", "author": "Melissa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-25", "description": "This restaurant is a hole in the wall which was what ultimately enticed me to patronize it.  My honey was apprehensive.  I convinced him that there was some fantastic goodness overshadowed by the simple appearance of the place.\n\nHe had the beef brisket + dumpling noodle, and I had the preserved duck + lean pork porridge.  Huge portions, but great for us cuz' it was good!  Great flavors.  And the food came out fast.  The ladies that work there are a bit slow and aloof, but that doesn't bug me.", "author": "Jeanne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-02", "description": "One of the better places in San Francisco for won ton noodle.  They give you four big pieces per order.  Their congee is good too.  Too bad they usually don't open in the evenings except maybe for Fridays and Saturdays.", "author": "H K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-02", "description": "My  5 year old son took me here for my bday lunch.  And this place is really a 3.5 star.  I had the beef stew wonton soup here and the broth was good.  The wonton was good but would have been better if it was more bite-size and a few more wontons in the noodle soup.  Also if it was real actual wonton noodles...it would have been totally awesome.  Still no place beats Hon's on Kearny.", "author": "Allison T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-18", "description": "I've always craved congee when I'm sick or its cold out and Ming Tai has always come through with flavor and bang for your buck. I'm a big fan of their sliced fish with lettuce congee and the chinese donut roll with peanut/soy sauce. If you are ordering take out, be warned, they pick up the phone and respond in chinese so don't be deterred by the language barrier and order to your stomachs delight!", "author": "Rich L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-09", "description": "This place has good congee for the cheap price. The chinese donut is smaller here and over fried (too crispy and hard, so wont get soggy unless you let it sit in your congee for a long time). The restaurant is also really small. But I'll still eat here since its not in chinatown and so parking is easier.", "author": "Jess H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-08", "description": "Nice cheap spot for good congee.  But my favorite thing on the menu is Ja leurng (Chinese donut roll) which is a deep fried dough wrapped in a white thin layer of noodle. Comes with a couple dipping sauces.", "author": "Brian T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-30", "description": "Best wonton place ever!!!  The wontons are HUGE and it taste really really good.  I thought Wonton House was a good place until I came to Ming Tai.  Now I can't go back to Wonton House.  \n\nIf you're not into wontons, they also have great porridge there.  I usually order the preserved egg w/ pork and could never finish the whole bowl.  The consistency is just right.  Not too thick or too thin.\n\nCons - limited in seating and depending on the day, the waitresses are not always very friendly.", "author": "Esther L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-27", "description": "OMG YES! HUGE WONTONS! \n\nI've been here twice for the wonton noodles and can definitely say they satisfied my cravings. The regular wonton or dumpling and noodle orders come with 4 giants sized wontons or dumplings! (The difference between wontons and dumplings? Wontons are spherical, filled with pork and whole shrimp. Dumplings are more of an oblong shape, with the addition of a few strips of wood ear fungus to the pork and shrimp filling). I don't know that ordering the beef stew version is worth it since I haven't tried it yet, I would think it might be better to just order a plate of that separately.\n\nTip: If you come on weekdays around lunch time bring a buddy! There's a special where if you order two noodle soups, you can get a free item: some cooked chinese broccoli, a small order of chinese beef stew, or some cheurng fun. \n\nThe only complaint I had was that when I ordered the chinese fritter with the rice noodle wrapped around it, it wasn't very hot when I got it. :(\n\nOther than that, I don't know what other people complain so much about. Sure it's expensive if you're comparing it to eating wontons you had in China. But it's not that expensive. A good bowl of japanese ramen would cost about the same (unless you're one of those cheapskates who thinks ramen only comes in \"instant\" packages at the market). And what's so bad about big wontons? If I take a bite of a wonton and see a huge shrimp inside, that's good! And the service is apathetic sometimes sure, but this is a genuine chinese place. This ain't no wonton place run by Charles Phan (no offense to him, i'm sure his food is amazing)!", "author": "Crystal L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-20", "description": "egantic bowls of soup/jook/whatever you're eating.  since they've recently remodeled, it's much cleaner than before, though still very much reminds me of being in china.\n\nthe won ton is huge.  like chernobyl won tons.  and the food comes out super quick.  i thought the beef stew (ngao lam) was pretty good.", "author": "Jason J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-01", "description": "SORRY, I never had the food here because when my friend brought me here the othey day WORST THING HAPPEN. After we ordered, while waiting for our food I saw something looking at me. When I looked, it was a rat staring at me! I told the lady I wanted to have my food to-go, paid, left and threw the food away! I couldn't eat it ....", "author": "Frankie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-31", "description": "I have a new crush! The shrimp dumpling noodles at Ming Tai are mutant wontons that are the size of a 10 year old's fist. They are full of plump, whole sweet shrimp (not the gelatinous force-meat product that sometimes fills shrimp dim sum and dumpling products), crunchy strips of wood ear mushrooms, and chivey bits. Giant they are. The swirling bed of yellow egg noodles are perfect, it's not difficult to make good yellow noodles and these are as they should be, cooked to the proper Asian version of al dente. Sparkling, long simmered broth, the appropriate balance of saltiness, a few leaves of cooked lettuce, and more chivey bits complete the bowl.\nAlso tried the beef brisket wonton noodle soup. Rich, dark beef broth, copious chunks of tender brisket and lots of chewy fatty bits, plus wontons the size of golf balls encasing the same sweet, whole shrimp, and yummy yellow noodles.\nClientele is 98% Asian, and the place is small, about six 2-tops and three 4-tops. Line at the door, and simple menu of congee, dry noodles and noodle soup, and a few side dishes. Feel free to take the pale palates along, as they also serve a handful of classic sandwiches (ham and cheese, etc), different macaroni dishes (no idea what those are like), and fries. Noodles are cheap (about $4-6) and filling enough. The best I've found in SF so far. \nSigh, I love new crushes!", "author": "Candice L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-31", "description": "I haven't eat at this part of town yet.  So I was wondering and look at all the windows.  First I went to ABC, actually sat down but we look around and see what other people were eatting and glance at the menu, we make a run for the door like pants on fire.\nFinally we went across the st.  and order a quick  wonton noodle soup and rice and brisket.  The wonton was nice big bowl and giant wontons each problemly have 4 little shrimps in it!  The broth is just so so.  I think the soup at Wonton King was better but the portion at W.K. was small, tiny, I was still hungry when I walk out.  The noodle was better then the broth, al dente just the way I like it.  The brisket was another story.  Tough and goowy, meat that don't taste like beef,(mystery meat?)\nThey serve it with rice on the side.  1 serving is enough to serve 2 people and a midget.  If it didn't taste so disppointing, I would doggy bag it home.:-(\nI shouldn't complain because the price is right.  Maybe next time, I would go for the wonton again and then some other dish that is suggested here.  This place is cheap, how do they make any money?This is a hole in a wall but cleaner then most hole in the wall.", "author": "Mar H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-17", "description": "I just discovered this place today. I tried the won ton/shrimp dumpling soup which comes with 3 shrimp dumplings and 3 won tons and it was delicious. I also had a plate of fried shrimp dumplings as an appetizer to share but it was a bit too greasy. I peeled off some of the skin and then it was pretty good. Overall, this place is a bit pricey for what you get but it was delicious. I will be back!", "author": "Diane M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-24", "description": "I have heard about this place for so long. Everyone always says that you have to have the wont on here. Finally my mom, the bf and I came here for Saturday brunch. I had the won ton fun and it was really good. The broth was clear , not greasy and just had a really pure flavor. When I say pure, I mean that it didn't taste like there was a ton of msg in the broth.  The won ton is actually pretty good sized and there were quite a few in the bowl. The only reason that I didn't give this place 5 stars is because the service is okay. i wouldn't say that I come here for the service.", "author": "carebear l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-30", "description": "my entire 3.5 stars goes to the food and the food only. \n\nthe place is like the size of a small hallway and they squish as many tables as they can in there. you feel uncomfortably close to the person next to you/behind you and it takes forever to get a glass of water, tea, utensils, check... basically, you should be prepared to bus your own table when youre there. \n\nthat being said - food is very good! its authentic and delicious - reminds me of places in hong kong. things i liked: (prepare yourself for the awful descriptions here since my chinese sucks)\n\n-rice clay pot with tiny spareribs\n-chinese fried doughnut covered in a thin fat noodle with sweet soy sauce and peanut dipping sauce\n-won ton noodles\n-preserved egg with pork porridge", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-05", "description": "The dumplings are the largest I have been served and the quality is always very good.  The soup is definitely not oily and healthier than most places.  There is also jook which is very good.", "author": "Ginny M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-10", "description": "SIze matters...and with won tons too! I don't know exactly how many pieces of shrimp came together to form each of the balls but it has be between 4 to 6. It's like Voltron but with won tons. It's a bit shocking at first to see how big they are but you quickly get over it since it is very tasty! It's hard to get the noodle, soup, and won ton right but these guys have it down.", "author": "Barney M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-30", "description": "I'm usually pretty iffy about shrimp but this is my favorite place to have won-ton noodle soup. The won-tons have at least 2 whole shrimp in them each and I am crazy about the texture of their egg noodles. \n\nService can be spartan at times, but I am here for my soup, and sometimes a hot mug of almond milk.\n\nThis place is crazy busy on week-ends.", "author": "Sophie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-30", "description": "This is one of my regular breakfast places every weekend and I have to say every time I go there I'm pretty satisfied. Around brunch-lunch it's still pretty crowded. The store is small and a bit cramped but once you get seated that's when the real experience starts. All their shrimp rolls are REALLY good. The wontons are really big and tasty. I'm a big fan of their congee as well. This just goes to show that good things do come in small packages.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-24", "description": "Typically shabby dive-y Chinese restaurant surroundings with grouchy service (so if you prize ambiance, this place is not for you), but if you prize the best dumplings in San Francisco, then you should come here and order the dumplings.   I ate them and then spent the next forty five minutes randomly hugging my husband (who picked the joint as our lunch destination) on account of transitive food happiness.", "author": "Jan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-24", "description": "Yummy won ton!  They are HUGE.  I only got 4 of them with my noodles (I got them with ramen instead of the regular noodles - just for a change), but they were so big, it didn't matter.  Very flavorful.  We wrote our name on the clipboard at the front and had to wait about 10 minutes for a table.  Service was a bit slow.  The waitress didn't smile at all and wouldn't even look at us while we were ordering.  She was looking out the window the whole time.  We also had to wait about 15-20 minutes for our food.  Maybe the cook was making everything at once because about 4 tables got their food at the same time.  The won ton is sooo good though.  Definitely worth a trip back!", "author": "Kris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-22", "description": "won tons are ginormous (5 in a bowl without noodles) and flavorful and packed with shrimp, as others have mentioned\nfor the area though, $1 per wonton is a little pricey\nfish congee was a little more watery compared to won ton house in my opinion\nchinese broccoli soft", "author": "Rob C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-02", "description": "Huge won tons, huge price tag!  Thank you for not skimping on the shrimp, but please ease off on the bill.  Does it have abalone in the won tons?  Don't get me wrong, the food is good.  Knock off $1 per bowl and you get yourself another star.", "author": "Ezduzit S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-23", "description": "Yes, the Wontons are bigger but hey the pricetag is bigger too.  For the money, I go to Lam Hoa Thuan on Irving.  Same price will get you way more ingredients.  But you have to try to know, right?  Parking might be a bit easier here but make that 3 to 5 min drive over to Irving.  You'll thank yourself once you've started digging in.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-02", "description": "I love the congee at Ming-Tai! Hing Lung is still #1, but I live in the Sunset, so Ming-Tai is much more convenient. The congee is smooth, tasty and always piping hot. It's the best for cold rainy days. (However, the congee is only the freshest in the mornings. Don't get it if you go there in the evening.) You get a big bowl for like $4. On the weekdays, there's a special where you can get a bowl of congee and a side - all for just $3.50! Can't beat that! Service is ok, but what can you expect from a tiny casual Chinese restaurant in the Sunset?", "author": "Cee J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-18", "description": "the shrimp dumplings are really good.  i usually get them with lo mein.  they have a lot of side dishes that are good - shrimp cheurng fun and ja lerng.  i'm surprised that they're not open for dinner or on wednesdays since chinese places are open all the time.\n\nupdate - they're now open until 9pm fri-sun.", "author": "julia t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-22", "description": "This is a good noodle place.  Great shrimp dumplings!  The dumplings are big and very tasty.  This is a small place.  There may be a wait during peak times.  Lots of people come here for take out.", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-26", "description": "Came here like .. once.. a couple years ago. Don't really remember how the food was like, but I believe that it was fine. The workers there are real kind.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-04", "description": "This is my favorite chinese noodle place in the city!  Its wonton and shrimp dumplings are simply the best-in-class!  They are not only big in size, but also juicy and fresh!  I also love its iced milk tea, shrimp cheung fun and beef stew.  If you're looking for a place with the best HK-style wonton noodle, this is it!  Of course, this is not a place to please your gf in your first date either  :p", "author": "Jacky L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-10", "description": "I've eaten here four times in the last two weeks, so I obviously think that it's pretty good.  Ginormous wontons in the wonton soup.  The rest of the stuff is very mediocre.  E.g., I would pass on the barbecued pork (either homemade -- not in a good way, or purchased from a not-so-good place) and the fried donut wrapped in fun (kind of small).", "author": "Rich H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-20", "description": "best won ton in sf!!! i challenge yo to find a better won. keep up the good food jenny!!!", "author": "dion l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-18", "description": "I absolutely love their huge won tons. The congee is good too. Prices wre good. It's really smal, so you might have to wait in line.", "author": "bob k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-28", "description": "A solid noodle joint that stuffs a whole family of shrimp into each wonton, along with plenty of tasty sides to comfort your soul.  It's pretty far out of the way, but worth the drive.  Love finishing off a bowl of this good stuff and then walking a few blocks down to Polly Ann Ice Cream for dessert.", "author": "Patricia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-29", "description": "my friends chose this place.. it is small but has some great business... their won tons are big and  delicious and their beef rice noodle and fish congee are great too... i saw other people ordering spareribs with rice.. looks heLLa gOod~~what a lunch feast for me and my friends.... their prices range from 5 to 7 dollars...", "author": "Lily T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-30", "description": "Other than the rice porridge and won-ton, worth to try their rice plate (in the little steel pot), tasty!", "author": "E C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-07", "description": "Typical chinese noodle shop. I had the wonton and dumpling noodles for $7.50. They were the largest wontons and dumplings I've ever had and they were good with alot of shrimp. But if I had known that they use lard then I wouldn't eat that again. Is it true? I dont know.", "author": "VVVV H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-13", "description": "The first time i went here was like 5 years ago i was told the wontons and dumplings with noodles is off the hook .... so i order it when it came out i was like damn those wontons and dumplingss are huge!!   biggest dumps i eva seen !! lol didnt sound right anywayz freakin good!!  the appetizer like the noodle wrap doughnuts are good also the beef and shrimp noodle wrap are good appetizers .... man i want some haven't been here for a while!!", "author": "geo t."}
