{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "MMM. I'm not a big fan of sandos but I do enjoy a fresh one made with lots of love from time to time ;). And when I do order sandwiches for the office, I choose Mission Picnic! The veggies are SOOO FRESHHHHHH. Crunchy arugula.. crunchy romaine.. fresh errthang.\n\nOrdering is  easy - I always order via ChowNow. Love how the sandos arrive- in a box, all cut in half. Perfect for offices and on the go events (like picnics!). Also the perfect half sandwich size so you can eat another half (of a different sando!).  I REALLY enjoyed the deviled egg sando. The brioche bread was delicious. Everyone at the office enjoyed their sando + salad!\n\nSterling, the owner of Mission Picnic kindly delivered our order this morning. Delivery was flawless and on time (in fact a few minutes early) which fit perfectly with my schedule. \n\nHere's what I ordered (delivered today 5/23)\n\nDevil's Egg\nmarket egg salad, bacon crumbles, melted provolone, kosher pickles, green leaf lettuce, chives on brioche\n\nMozzapesto\nwhole mozzarella, thick tomato, roasted red pepper, baby arugula, balsamic reduction, house made pesto aioli on focaccia\n\nPollopesto\nhouse made chicken pesto, crumbled goat cheese, thick tomato, baby arugula tossed with lemon chive oil on focaccia\n\nABT\ndouble bacon, avocado, thick tomato, green leaf lettuce, mayo on focaccia\n\n(not pictured): Deluxe Cobb Salad: chopped romaine, mixed greens, grilled chicken, market egg, crispy bacon, avocado, blue cheese, cherry tomatoes with picnic vinaigrette\n\nThanks, Mission Picnic!", "author": "Chantel Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "If you are in need of eating a salad in a closet, here's the next best option as this is a tiny space on 22nd near Valencia with just three little tables. Luckily I was here after the lunch rush though frankly it wouldn't take much to produce a rush, like two people who want a salad at the same time. There are plenty to choose from, five entree-size ones and two sides. Sandwiches as well, over a dozen listed on the chalkboard. Presumably most people must order to-go...\n\nBut hell, I came to eat there. Waitress? Waitress?? Oh, OK, I have to order at their tiny counter. I went for the $10.95 Beets and Greens which came in a box anyway, but it was a big box chock full of goodness - roasted beets, pear slices, berries, fennel, quinoa, goat cheese, toasted pecans, all of it on a bed of mixed greens and drizzled with a balsamic vinaigrette. It was all so neatly organized that it looked like a bento box (photo: http://bit.ly/2HxPrTD). Delicious and plenty left for later.\n\nFOOD - 4 stars...really robust salad enough for another meal\nAMBIANCE - 3.5 stars...did I mention it's a tiny space?\nSERVICE - 3.5 stars...cordial\nTOTAL - 4 stars...when you know you should have a salad", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "Of all the \"standard\" type Salads the Cobb salad is typically my favorite. \n\nMission Picnic serves up a mean/tasty \"Deluxe Cobb\". \nDeluxe Cobb $12.50- Chopped romaine, mixed greens, grilled chicken, market egg , crispy bacon, avocado, blue cheese, cherry tomatoes with picnic vinaigrette. \n\nVery hearty and you can order online ahead of time for pickup. I enjoy my salad and would return for a hearty/healthy meal. \n\nI like Healthy Foods...occasionally ...lol. For the past year or so I workout multiple times everyday so I typically try to eat at least one Salad a day. Often times I bring my own salad for lunch but sometimes I venture out in the city for some healthy greens.  \nWhen I look at reviews sometimes just want to know where to go or how a user compares one venue against another to see if we have similar tastes. \n\nHere is a look at how I rank the Chicken and Waffle Establishment in the SF Bay Area. They are all pretty good this is just my take. \n\nRod's San Francisco Salad Rankings (and what they're known for or what I like). I have rankings various foods like Boba, Ramen, Steakhouse, Chicken and Wafffles(random right?) Follow my profile to see my most recent reviews. I hope I can be helpful since so many Yelpers have helped me discover new places \nRanked from Fave to least fave (Business owners don't hate me, all these places are good) \n\n1 Café du Soleil-Nicoise Salad\n2 SweetGreen-Pesto Chicken\n3 Darwin Café-Baby Spinach \n4 La Fromagerie-La Mancha Salad\n5 Mission Picnic -Deluxe Cobb\n6 Mixt-Mixt Cobb\n7 Plutos-Custom salad\n8 La Capra-The Cobb\n9 Tender Greens-Chinese Chicken\n10 Soma Eats-Spinach, Date and Goat Cheese Salad\n11 Blue Barn Gourmet-Cobber (Cobb Salad)\n12 Split Pea Seduction-The Squash salad\n13 Boxed Foods-Boxed Chicken Salad\n14 Kitava-Pesto Chicken Cobb\n15 Native Co-Native Salad\n16 Soma Chicken-Caesar Salad\n17 Proper Food-Lemon Quinoa Salad with Chicken\n18 Eatsa-Various Salads/bowls \n19 The New Spot on Polk-Asian Chicken\n20 Organic Coup-Kale/Caesar Combo \n21 Uno Dos Tacos-Fish Salad Bowl", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "Best Sandwiches in San Francisco!  While you won't see it if you blink as you walk by they are on Caviar and worth every penny.  The sandwiches are beautifully crafted, unique and tasty and the salads can actually feed two.  I've ordered multiple times and have fallen in love with the Egg Salad (what is that crazy spice in there?) on lettuce.  Run, don't walk!", "author": "Cindy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-12", "description": "I love this place. It's a popular and well known spot but is small and has a hole in the wall type feeling to it. They specialize in sandwiches and salads that are uh-maze-ing. I've been here several times and have always ordered the deluxe cobb salad because it's just that good. It's your typical cobb salad and includes the fixings such as grilled chicken breast, hard boiled eggs, avocado, bacon, tomatoes, romaine lettuce and blue cheese. It's so simple yet so good!\n\nI love that the ingredients they use are always fresh! The romaine lettuce have a nice crisp to them and the tomatoes have a little snap to them and they're sweet. The rest of the ingredients look just as fresh and taste like they were straight from the farm or bought that morning. On top of the freshness, you get a big serving for a great price! A bang for your buck spot is hard to find, especially a place that uses fresh and high quality ingredients. You'll spend anywhere between 9-13$ for a meal. Mission Picnic is definitely worth checking out if you're in the area.\n\nThe only thing I would like for them to change is to add a little more vinaigrette.", "author": "Steve H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "We were about 10 minutes away from Mission Picnic when I realized I could save time by ordering ahead. I created a Caviar account, made an order, and it was ready for pick up by the time we got there! (~12:30pm on a Saturday.) This was an easy, quick, and seamless experience.\n\nOh and of course, their sandwiches are always amazing. \n\n* Pollo Pesto ($9.95) - 4.5 stars\nSoft, moist chicken chunks. Flavorful pesto. Crunchy bread. And still warm by the time we walked to Dolores. Can't ask for much more!\n\n* San Franciscan ($9.50) - 4 stars\nMuch more savory sandwich, perfect for my bf!", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-26", "description": "Came here off a recommendation from my friend who was staying at my place. Cool little shop set up in the mission. A lot of different sandwich choices, and you can order ahead to be able to pick up (I believe). \n\nI got the salmon sandwich as a nice treat to myself because I was feeling a little too sick to want to cook. It was made in under 10 minutes I believe, and I was able to grab a table to sit and wait for my food. They package the sandwich nicely in case you wanted it to go, but it was nice outside so I stayed. Will be coming back here when possible.", "author": "Rajeev S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "No complaints. One of my go to spots. So far everything I ordered has been great! Sorry for the boring review.", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "THE. BEST. SANDWICH. IN. THE. WORLD. aka the Pollopesto. Ooooommmg. I never had a sandwich where i enjoyed every single bite. 5/5 seriously.\n\nPremium vegan- felt like a health god eating this sandwich. Taste was a 3/5 but for a healthier choice- worth it. To help the slight blandness- i got the mamazuma revenge chips which were bomb if you enjoy spicy food! \n\nThe bread is insanely good. Its crispy on the outside, but soft and chewy in the inside. The chicken was super moist- and the pesto was perfect in seasoning. This place was so good that i woke up the next day and walked 10 blocks to have it again. Need i say more?????", "author": "Jen Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "This little gem is incredible! My fiancé and myself have tried this place a couple times, and each time has been amazing. They deliver really fast, too! (with our orders being correct, naturally) \n\nI personally am not normally one for sandwiches, but Mission Picnic has made me a believer! If all places made sandwiches as delicious as theirs, I wouldn't mind having sandwiches more regularly. They've set the bar really high with a brand new standard for sandwiches!! \n\nMy favorite sandwich from here is the smoked salmon, and they are pretty darn generous with the salmon which is always a big plus with me :) And the london broil and premium vegan are both tied at a close second (really depends if I'm craving more red meat or something lighter and filled with veggies but still filling).\n\nTheir salads are really good as well. I'm particularly fond of their beets and greens entree salad, but their side baby arugula salad was quite filling, too. \n\nSo overall, this place is amazing. They've found new regulars.", "author": "Aiko H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "This is a small sandwich/salad shop tucked in between two larger shops. And when I say small I mean narrow. There was only room for about three two top tables, pushed up against the right wall. Really a to-go place only. \n\nI ordered a Rodeo salad. It took about ten minutes for our order to be ready. This salad was similar to most southwestern style salads with a Tex Mex type flair. It had chopped romaine, roast beef, cotija cheese, avocado, corn, black beans, jalapeno, red pepper, red onion, tomato, cilantro, blue corn tortilla chips with chipotle ranch dressing. I got it mainly for the chipotle ranch and avocado. I loved the taste!\n\nIt cost $12 and could probably feed at least three people. I'm telling you, this salad weighed five pounds. I took some lettuce out of the salad and saved it before I ate it. Just because it was so gigantic. But, if too much food is my only problem, then I'm ok with that!", "author": "Hannah G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "For our weekly office lunch, I picked Mission Picnic. Our delivery order arrived via Caviar on Friday, June 23rd around 12 noon.\n\n*Flatiron: Hot romanian pastrami layered high with melted muenster cheese, kosher pickles, deli mustard on french ($11.95)\n*Baby Arugula Side Salad: Baby arugula salad dressed with lemon chive dressing ($3.75)\n*Potato Chips: Artisan chips from Route 11, Mama Zuma's Revenge ($1.95)\n\nWe have $20 to play with, so yes, I got a sandwich, salad, AND chips! The sandwich melded into one great bite. The pastrami salty, the cheese melty, the pickles sour. I'm not a huge bread person, but it was nice and chewy and soft. I had one bite with the bread and then just ate the insides. The cheese melted onto the bread, so I ended up having a little more bread with the filling which I didn't mind. (You can also request a lettuce wrap if you'd rather avoid the bread that way.) The salad was huge! Very densely packed in the takeout container. It ate some with my sandwich and ended up making a makeshift pastrami arugula salad. The only critique I had of the salad is that it needed more dressing. There was a tiny container about two thirds full for all that salad. It wasn't enough. I adored the chips. Great spice. If you can't handle heat, I suggest you pass on these as they may be the spiciest chips I've ever had.\n\nGreat place for sandwiches. All this food actually fed me three times that day. If Mission Picnic comes back into the rotation, I would definitely order from them again.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Great selection of artisanal sandwiches with super fresh ingredients and homemade bread (try the focaccia...damn!).  I had the Southerner, which comes with bacon, marinated pork, and pimento cheese.  Delicious!  The fresh-baked chocolate chip cookie was a perfect finish.  Friendly service, reasonable prices.  Can't wait to try every sandwich on the menu!", "author": "Dave N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Great spot for a quick bite. Stopped there for lunch on a weekend and was happy to see the line wasn't out the door and it moved pretty quickly. The bread was fresh and tasty, and the sandwich combinations are top notch. I ordered the pesto, mozzarella and tomato sandwich- so tasty! The bench out front is handy if you have a pup with you (as I did) or if you just want to eat outside. Highly recommend this spot if you're hungry in the Mission!", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-01", "description": "I pretty simple and generic sandwich. I was expecting better. Limited menu too.\n\nLimited seating.", "author": "Captain B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "Sandwiches to love for. Best pastrami sandwich ever. In the Mission they also do catering.", "author": "Mychelle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "Had the turkey cranberry sandwich when the office had catering from here. It was delicious! The bread wasn't too hard, the sandwich was moist, and it had sprouts (which I love, and most places don't have it!). All the ingredients had the perfect ratio.  Can't wait to try them again!", "author": "Chanel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "Their breakfast catering is delish!  Garlicky herb cream cheese spread and a less guilty sundried tomato & chive spread.  Alongside with some crispy but not too greasy bacon strips and sweet fruit.  Another time they've catered for our office they served smoked salmon for the bagels.  The smoked salmon was so fresh and just the right amount of smokiness especially for an early morning breakfast.  I just wish there were a little more assortment of bagels aside from just plain and poppyseed.  Looks like in their storefront they only serve sandwiches and open for lunch.  So convince your Office Manager to wake you up with a wonderful breakfast catering order from Mission Picnic!  \n\nI hope we can try their sandwiches for lunch catering next!", "author": "Cat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "I've had lunch from Mission Picnic more than a dozen times. The sandwiches and salads are always delicious and the service is fast and courteous. I especially live their egg salad sandwich, the pastrami sandwich, and their potato salad.", "author": "Linda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-22", "description": "It saddens me that this little shop is not somewhere in the East Bay. I'd go here every lunch time just to get a taste of their Rodeo Salad.\n\nHave you ever ordered a salad and thought it was going to be the best meal of the day? Well, I didn't, I thought, ehh I'm here for work and I'm hungry and I saw this little corner store and was like ok sure why not...boy did it blow my mind. I loved how they added chips to it. The meat oh damn the meat it was heavenly. I always toss my salad but the presentation was so well put I almost felt I was being rude mixing it all up. But that's the best part and that's when it tastes so damn good. \n\nThe place inside is cramped and is basically an order and go type of place. Luckily, since I had no place to really go, there was a seat available for me to enjoy this heavenly meal.", "author": "Ladonna A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "Simple, but delicious. Basically everything a sandwich shop should be.  \n\nI had the pollopesto and it was awesome.", "author": "Vincent A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Super yum sammies but they ran out of bread while we were here... so make sure you go earlier than later!", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "So at a hiring fair then after wanted to eat. One of my coworkers started to search for a place to eat near by for us due to parking being so difficult & we ordered our sandwiches I got the vegan one and can I say FABOLOUS !!!! Great service ordered via phone was ready even though it was lunch time.... Great taste great price and friendly young man at cash register !!! Oh yeah the bread out of this world.", "author": "Virginia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-13", "description": "Imagine my excitement when I saw not only a delicious-sounding smoked salmon (my favorite!) sandwich on the menu but also the pictures showing the type of protein portion I would expect for a $13 sandwich (with sales tax for some reason on a cold to-go order at a place clearly designed mainly for to-go orders). Imagine my disappointment when I got home and unveiled what is shown in the picture. There was less than half of the salmon I saw in other pictures on the site, three anemic strands of red onion (yes, I counted), three capers (yes, I counted), and a whisper of cream cheese. If the sandwich looks inflated, its because of the avocado I added at home to make it more filling. Nothing like what was described/shown in the other reviews. Maybe I came on a bad day or maybe they have scaled down their offerings. They also have one of those terminals for cards that prompt you to tip 15% for counter service. The food was OK but for the price not worth it.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "My friends and I ordered to go so we could eat our sandwiches at Dolores park! The service was so quick and it was so easy to pick up. I got the flat iron and it was so tasty!!! I would 100% go back here again.", "author": "Monica B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "By far my favorite sandwich place I have found in San Francisco. Their veggie sandwich is my fav. I definitely look forward to trying other ones", "author": "Danielle D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-26", "description": "I live right around the corner from this place, so from time to time I'll stop in to give it a second chance. The sandwiches are fine. The problem with this place is that it's essentially a hub for Postmates and other delivery services.\n\nHere's my most recent experience. I walk in and can see one or two people also waiting for their order. I order a sandwich, and my receipt says #11. Right after this, #8 is called out. Great -- that means there's just two more people ahead of me. Then for over twenty minutes not a single order is called out, as they fill a huge Postmates order with what must be at least fifteen sandwiches and salads. Meanwhile other patrons have come in and have ordered, and the place gets packed as they work on the Postmates order, leaving everyone who is actually present waiting. Since it's getting backed up, the guy working the front counter goes back to help them fill the orders, and doesn't put on gloves or have a hair net, in clear violation of the health code.\n\nAt really off-peak times you might be able to get your order quickly, but otherwise I'd absolutely stay away. For the amount of time you wait here you could get a much better sandwich at Rhea's, just three blocks away.", "author": "Evan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "I was drawn to mission picnic by the pictures on yelp and the devils egg sandwich did not disappoint. Can wait to try their other sandwiches", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "ABT is awesome and what I typically order. The Focaccia bread is divine. Today I tried the Picnic Club and it was really great as well. Truly an awesome place to grab a quick bite. You won't be sorry. They have limited seating so be prepared to have to grab and go if there are not any seats available. I hope to try a salad next time but man it's hard to pass up a sandwich.", "author": "Autumn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-04", "description": "I am writing this review mainly based on the service that I received.  I came here on a Saturday, a Sunday, and a weekday.  I tried the smoked salmon the first time and the chicken salad sandwich the second time.  I also ordered their lemonade, which was very sour.  Really sour.  Like the sour candy/lemon juice with a bit of sugar type of sour.  The sandwiches overall were good, the portion sizes were great, neatly wrapped, and didn't fall apart when I ate them.  But the service is another story.  Even though I came here on three days, I didn't try any of the sandwiches on the weekday that I came here because I walked in and heard the staff member tell the lady in front of me that they ran out of bread.  It's a sandwich shop and they ran out of bread.  So I only ordered the lemonade.  When I was here on the Saturday and Sunday I was able to order from the sandwich menu but the service wasn't great.  When I would ask questions the manager/staff member seemed very impatient with me, even though it wasn't a busy time of day.  He was very vague with answering my questions and seemed a little uptight/annoyed.  Like sheesh, it's not like I'm playing 20 questions or giving him a quiz.  What's the point of working in the service industry if you can't stand simple conversations?  With my experience in the service industry I know customers can be difficult sometimes but in this case he was very unprofessional and I never went back because I was too intimidated.", "author": "Lola S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "I was wowed by their sandwiches   It was fresh, with great ingredients. Perfect amount of ingredients into a sandwich. No complaints here! Definitely fan!", "author": "Meishi M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-19", "description": "I'm not sure why this place receives a four star review?  I was supper excited to try this place for a while and the sandwich I got was pretty disappointing.  It was all bread and very little meat and vegetables.  I would expect more for $10.", "author": "Brandon Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-10", "description": "Came here on a whim while hungry in the mission and it was so awesome. I do not typically pay for sandwiches or seek them out when I'm out, but damn, I'd come back here in a second. \nI got a picnic club with added avocado and it was one of the most delicious treats I've ever had. \nPeople came spilling in with orders right after us and they were taking phone orders too, so the wait was a little ridiculous for 3 sandwiches. There's not a lot of space inside but they do have a bathroom and water, so there's a plus. \nWould definitely come back!!", "author": "Amy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "Two sandos and a big salad, all fantastically good, for $30. Quick to order and pickup, using Caviar to advance order at no charge. Wonderful addition to the neighborhood!", "author": "Holly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "You will adore the sandwiches here, and the salads, and the watermelon juice. Small place with only a couple tables for two, and no wifi, so it's mostly a takeout adventure. \n\nMy sandwich was so great I had a dream that night about eating it again. It's that kind of sandwich. High quality ingredients, and if you are a vegan like I am, you will go bananas for the flavor. \n\nTotal hole in the wall, totally worth it in every way.", "author": "Kate B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-30", "description": "The mission club is sadly not a double decker sandwich as most clubs are, but instead comes on ciabatta. But it's an excellent piece of ciabatta that more than makes up for the joy lost in having a novelty middle piece of bread. It's a pretty tasty sandwich, even in a neighborhood and city full of tasty sandwiches and I think the next time I go, I'll try the pollo pesto.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-21", "description": "Mission Picnic got me to eat a Vegan Sandwich.\n\nAND I LIKED IT.\n\nhttp://goo.gl/eP7GVe\n\nThe veggies were fresh, the focaccia was toasty and the hummus, tomatoes, cucumbers, lettuce, sprouts and avocado were expertly stacked.  \n\nIf I was a nitpicky vegan, I'd suggest adding garlic to the hummus and then more hummus.\n\nBUT I'M NOT.\n\nLooking forward to my next Mission Picnic @ Mission Picnic!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "LOVE this place near our church! New favorites- but pricey but worth every dollar. Fresh, huge portions and unique! Husband ordered the Southerner and Loved it - he is Fan of pimento cheese and a southerner. I ordered the smoked salmon sandwich - delicious and perfect. Saved the other half for lunch next day. We shared the beet salad and it was fantastic! Tried the hot jalapeño chips and they are HOT!", "author": "June R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-22", "description": "Even though we came to Mission Picnic for their Hainan Chicken sandwich (which they did not have), my experience here turned out to be positive.\n\nYes, the place is pretty small, but the line (which can grow to be quite long) does go by quickly. They have a number of great selections here, so know what you're getting because it's easy to change your mind!\n\nSince I smelled the bacon wafting in from the kitchen, I knew I had to get a sandwich with bacon... so naturally, I went with the ABT which has, yes, DOUBLE BACON. I also decided to get a side of potato salad since I love potato salad (and I was wanted to eat a little something while waiting for my bacon-licious sandwich).\n\nWe decided to eat at Dolores Park, so after a pleasant walk from the sandwich shop to the park, I FINALLY got to unwrap my sandwich.\n\nBefore I started eating, I had to admire my ABT first. Mission Picnic did NOT hold back on the bacon. The proportion of all the ingredients was beautiful. Then I had to eat it... and oh my goodness was it such an out of body experience. \n\nThat bacon... THAT BACON. WAS INCREDIBLE. SO CRISPY AND DELICIOUS AND SO MUCH OF IT. Not to mention, the mayo was KILLER and the avocado was SO FRESH. The ABT was DEFINITELY the best BLT-type sandwich I have ever had in my life thus far. I can't forget about the bread either... so amazing.\n\nWhy four stars? The sandwich was DEFINITELY five stars. Unfortunately, the potato salad was a little too rich for my liking. A little too much cheese... though the first few bites were pretty good.\n\nIf you're ever looking for a place to get your picnic fixings, definitely stop by Mission Picnic!", "author": "Sara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "My co workers and I Work in The neighborhood. We always order for pick up... Every time we ordered never a disappointment. The ingredients are extremely fresh and their staff is very friendly. Looking forward to working, wish there was a neighborhood discount! Lol", "author": "Sasha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "I'm always excited when my girlfriend comes home with a bag from Mission Picnic. I can't comment on the restaurant itself, but I can comment on the food. The sandwiches are always packed with the fixings, and the meat is always fresh. The sandwiches are big enough for nearly two meals, and I'm a big guy. The downside with this place would have to be the hours, very limited if work during most of the afternoon. Still good sandwiches.", "author": "Joel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-27", "description": "It's like hole in the wall. If you're not from around here you might just miss the place. It's grab and go cuz there were only 3 tables available. Was glad there were no line and the manager was super helpful. \nDidn't know what to get. I wanted the nervo Cubano but he said no longer in the menu for sometime. So I must have read some very old reviews. \nSo manager saw that I was unsure, he promptly suggested some of their popular sandwiches.\nDecided on the San Francisco with added spice. It is good. \nThe bread was crunchy yet soft. The meat moist with fresh vegetables. \nI am happy. I will return. \nGreat personal service by the manager/owner.", "author": "Nelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "This is definitely my favorite place to get a vegan sandwich from, the premium vegan sandwich is sooooo good like omg you have to try it!!! Love it lots. Customer service is great too, they're really fast and nice. 10/10 would recommend", "author": "Alisha A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Where I can get my egg salad fix. ProTip: they sometimes close a little before stated closing time so don't dillydally on your way over.", "author": "Yes P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "My favorite to go place for sandwiches and salads.  Everyone is extremely nice.  They also cater to companies throughout San Francisco.  My favorite us the Salumi special.  \nIt's located in the heart of mission with lots of walk in traffic.  Long lines during the lunch rush!", "author": "Sheila P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "Pricey but legit sandwiches! \nSmall \"dining area\"\nVery  mission hipster.\nThey have a set menu & multiple sandwiches that change all the time.\nThe reason for my 4 stars is that a girl working told is how sick she was then proceeded to  & help w/ our sandwiches... Ewwww", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "Sandwiches:\nCRANTURKEY - YESSS! Cranberry sauce in a sandwich was something I never tried before and it is amazing! Turkey is nice and moist and NOT DRY! Cause dry turkey is the worst. The sprouts gave it nice little crunch and was a good pairing with the rest of the sandwich as it complemented well.\n\nPOLLOPESTO- Also amazing! I love pesto on just about anything so I had to get this sandwich. It was absolutely amazing and I love the satisfying crunch sound I get when I bite into it. \n\nSMOKED SALMON- Got it once and it's great too. I love smoked salmon and cream cheese so this was my kind of sandwich. But since it's more expensive, I only got it once. \n\nSalads:\nI think I tried almost all of the salads except for the Winter Wedge.\n\nDELUXE COBB - As good as a Cobb can get. Sometimes I am fond of the bleu cheese, sometimes I am not. Chicken is really fresh and big pieces. They don't skimp on that! \n\nBEETS AND GREENS - I got this once by accident and I was pleasantly surprised by how good beets were. I don't think I ever had beets prior to this salad. I also enjoyed the candied pecans since it was a nice flavor to go along with the salad. I wish they had pecans in the other salads!\n\nCHOPPED ITALIAN - It was good but not my favorite since I like avocados and eggs in my salads usually. I'm much of a Cobb kind of girl.\n\nKALE CAESAR - There is this one single anchovy piece that stares back at me when I open my box. The smell always hits me but I am not an anchovy-hater although sometimes I don't know if having it adds to the salad. Get this with chicken because I do not know how people can eat just kale by itself. I just wish the kale was more chopped up instead of in a giant leaf form.\n\nAll the vinaigrettes are good. Red wine vinaigrette is my favorite. I do not like the caesar dressing as much since I prefer a creamier dressing and their caesar is bit thicker and mayo-like. But all their salads are great portions and super filling. They give you good size everything so a whole egg, nice cherry tomatoes and avocado, fresh lettuce, fresh chicken cut up in nice pieces and all. \n\nAwesome place! They deliver to anywhere in SF for $5 flat. They're always quite timely with my order deliveries. I did have two times when I was missing an order or got the wrong item but it was quick to reach them by phone to get that fixed. I can't even be mad since their food is so good and they're also really nice on the phone and even gave me an apology cookie+chips once. I gave the cookie to my co-worker but it smelled really good. SO GOOD. \n\nOh, and sometimes you get the person with the really beautiful handwriting who draws smiley faces on your boxes. Like who doesn't want to unravel a sandwich that has your name and a smiley face written on it?", "author": "Diana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "Wonderful sandwiches! We spent the day browsing this neighborhood and we're lucky enough to find this place when we got hungry. Super quality Ingredients with fair prices.", "author": "A B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "New favorite sandwich spot in the city. Split the Southerner and Flat Iron with my boyfriend and didn't stop talking about how delicious the sandwiches were for like an hour after eating.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-19", "description": "My office decided to get some sandwiches to have for lunch for a co-worker's BD. We placed the order a day ahead. Sandwiches were done on time and it was ready for pickup when I arrived. All my co-workers loved their sandwiches. I ordered the Pollo Pesto and it was soooo delicious. I am definitely gonna try this place out again in the near future.", "author": "Ernesto I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "Just back from Australia, jet lagged so hard I can barely pull myself off the couch. I missed my Cobb salad from Mission Picnic the most, so I hop online to check the hours, Google says 6pm, score! I get there at 4pm and they are clearly closing up, they could have easily turned me away and I wouldn't have been mad about it, but instead, on Sunday, pride weekend when they could have just locked up and gone and shaken their drunk ass booties with everyone else, they take me as the last order (and I didn't even mention that google said they were open later). Not only that, but it was probably the BEST Cobb I've had. They put a lot of love into that last minute salad. Huge props to the closing crew on 6/25/2017. Left a big tip but you deserve to know that you are rockstars via words as well. Thank you for sedating this jet lagged lunatic.", "author": "Tom K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "SOOO many delicious sandwiches and salads created with high quality ingredients. Choosing will be hard, but you'll find solace in the fact that you can return next time and try another delicious sandwich or salad (but let's be real - probably a sandwich). The watermelon juice is super tasty and refreshing. \n\nI can't wait to try the entire menu!", "author": "Sara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "Great portions, fresh ingredients, wish you were open for dinner! Perfect for healthy takeout", "author": "Haley Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "Really great food, SUPER EXPENSIVE though.\nThe sandwiches are super delicious though, and the kale caesar is flavorful and outstanding. \nBut really a sandwich and salad shouldn't come out to almost 30 bucks. Work with us here :)", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "Great hole in the wall sandwich spot with really fair prices and tasty flavors. The wait is usually 10-15 mins as they fulfill a lot of catering orders. Best to call in to make an order if you don't have time to wait. Cool people working there", "author": "Rachel T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-14", "description": "Stopped by for lunch! Cute little sandwich shop with nice service! \n\nI ordered the MozzaPesto Sandwich & Watermelon Juice. I enjoyed the Watermelon Juice more than the sandwich! I think the roasted red pepper in the MozzaPesto threw me off. The Watermelon Juice reminded me of the Watermelon Juice I drank when I was in Krabbi, Thailand, sooo good!!!!!!!\n\nI will come back to try the Cesar Salad & a few other sandwiches, then update my review!", "author": "Geraldine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Simple menu Good sandwiches. This place doesn't try to be too much. I like to call in my orders because it can get busy during lunch time and the place is super small. Best for take away there are only three tables in the place. Watermelon juice is good too!", "author": "Thatcher H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "Great great customer service, delicious sandwiches and salads.  They delivered our large catered order on time and correct, could not be happier with them and will use them again.  Thank you", "author": "Noyan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "Blink and you'll miss this tiny spot on 22nd but I hope that you don't as it's excellent.  I ordered the Nuevo Cubano and it was delicious.  The pineapple and avocado jalapeno aioli really made the sandwich.  I also got the watermelon juice which was quite refreshing.\n\nIf you're a sandwich fan (and how could you not), check out Mission Picnic and you won't be disappointed.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "Hubs and I split a Devil's Eggs sandwich and a Deluxe Cobb salad. Initially thought the price for the sandwich was steep but it was pretty large and was the perfect size for splitting. \n\nThe salad was also largely portioned. I was pleased to see we got our money's worth of avocado, bacon or chicken as they certainly did not skimp on these ingredients.", "author": "Esther A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-11", "description": "I am writing this review without even having tried the food from this establishment and it is purely based on the customer service I received from a man who identified himself as the owner. \n\nI would absolutely caution you not to use this place for catering a large group. Walk-in and pick ups only since you won't be in a rush and it's more of a situation that you as a customer can control. \n\n7 days ago (2/4) I placed on order online for a picnic platter to feed 40 people with desserts and drinks. It was scheduled to be delivered today (2/11) at 11:30am and I have a confirmation email outlining this. At 11:45am when it hadn't shown up I called to get an ETA. \n\nFrom the jump it was clear that for whatever reason dude was not familiar with our order. He ultimately ended up saying there was a 'glitch' in the computer and we were scheduled for tomorrow - I don't buy it, I believe we were overlooked and someone forgot to put us in the lineup for today's deliveries and he was covering. \n\nWhy this person is on the phone dealing with customers is beyond me. It might benefit him to hire someone with customer service experience in the food industry if frustrations overwhelm him to the point of being so rude. \n\nI started our conversation very politely, introduced myself, gave context as to what I was calling in reference to, offered my order number, and everything was bumbled. \n\"Who are you? What's your name? Your calling from what company? Do you have your order number?\", and as I was trying to answer his questions I was being interrupted as if I was inconveniencing him. I finally had to tell him to stop speaking over me so I that I could give him the information he was asking for.  When I wasn't being interrupted I was being talked over with really annoyed, exasperated sighs \"Ugh, oh my goooodd. Ugh, geeez.\". \n\nWhen we finally got to a resolution I was offered all of the food I originally ordered, albeit an hour late or a refund. I told dude I wanted both and he laughed saying \"You want the food for free?\" - uhm, actually I want the service I paid for but since we are well beyond that being a possibility I want a refund and delivery of the items you promised. \n\nWhen our order arrived the driver told me that they never charged our card because the system never sent our order to him so when I informed him that what he was telling me was the exact opposite of what the owner told me (and the exact opposite of what the order confirmation and refund confirmation emails told me) all he could do was stare blankly.\n\nAs a small business owner I'd think he would have jumped at the opportunity to rectify the issue and retain customer who places orders for more than $600 a pop but it seems as if that's no important to him.\n\nGive your patronage to this establishment at your own risk.", "author": "McKenna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-28", "description": "One of my favorite FOBanese dishes is Hainan Chicken Rice. Something about the simply boiled chicken, deliciously oily rice and aromatic ménage a trios of sauces (chili, ginger and dark soy) makes me...uhh, makes me happy. Sorry, going to keep it PG-rated for once.\n\nSo naturally seeing the Hainan Chicken Sandwich on Mission Picnic's FB page almost made me keel over. A FOBanese American Sandwich? I'm all over it! I hoped into my imaginary rice rocket and vroomed vroomed my way to Mission Picnic yesterday while bumping to Stevie B.\n\nMission Picnic is a new sandwich shop serving seasonal sandwiches; some with an Asian twist. They're currently in their soft opening stage and have an awesome deal of 50% off your purchase (till today). Their Grand Opening is tomorrow.\n\nFormerly the Corazon Juice Bar, Mission Picnic is a tiny shop with just four two-top tables so this is more of a to-go place.\n\nFor their soft opening, they had 6 sandwiches available (~$8-9):\n*Picnic Club (Rotisserie chicken salad w/ bacon & cheddar)\n*Hainan Chicken (Garlic rotisserie chicken w/ cucumber & picnic spread)\n*San Franciscan (Hot pastrami, turkey & provolone)\n*Devil's Egg (Market boiled egg, bacon & provolone)\n*MozzaPesto (Mozzarella, basil, tomato & pesto aioli)\n*The King (Peanut butter, bananas, honey chocolate & frosted flakes).\n\nThey'll also have soups and salads in the future. \n\nMake sure to try one of their refreshing fruit shakes (pineapple, watermelon or strawberry - $2.75). I had the watermelon which was more like a fresh watermelon juice slushy but it was really good (no sugar added).\n\nCASH ONLY.\n\nThe Hainan Chicken Sandwich was nicely packed with tenderly moist garlic rotisserie chicken, sliced cucumbers, tomato, lettuce & picnic spread on dutch crunch: http://bit.ly/171yYMd. The picnic spread of garlic and parsley was slathered onto the bread before toasting so all that garlicky goodness soaked into every nook and cranny. So yummy!\n\nWhile the sandwich was solid and made with top-notch ingredients, it was more like a garlic pesto-ish chicken sandwich to me. I was hoping it would be more FOBanese. There was no ginger in the spread and ginger is what makes hainan chicken \"hainan\" imo. And, although the dutch crunch had a deliciously crunchy mottled crust, I think a less carb heavy bread like a baguette would let the ingredients shine for this particular sandwich. Just my two cents.\n\nOne of owners, Sterling was super nice and encouraged customer feedback which is always a sign to build customer loyalty and remain competitive in this marketplace. I hope he does see this and offers several FOBanese sandwich options in the future including vegan options for my Yelpie friend John B.  who's always in the hood and for all the surrounding PBR drinking and camel toe inducing skinny jean lovers of course.\n\nMission Picnic has a lot of potential and this was just their soft opening so I can't wait to see what other specialty sandwich ideas they have up their sleeve...\n\nPerhaps a pulled pork with apple wasabi slaw sandwich, a Tonton sesame marinated tofu w/ portobello mushroom sandwich, a longanisa banh mi or a loco moco sloppy joe? I can go on and on.\n\nNow only if I can come up with ideas like that in my field of work instead of looking like a deer caught in headlights all the time...", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-04", "description": "Cute shop with some very tasty sandwich options. Sandwiches came out pretty quickly and the service was nice. Not the best place if you have a group of people, as there are only 3 small tables inside. Would definitely a place I'll keep in mind if I'm in the area and craving some fresh savory sandwiches. Would like to try some of their salad options too. \n\nI got the sanfranciscan and new salmon sandwiches. Both were delicious. The salmon was a good refreshing and filling sandwich. Sanfranciscan was a bit heavier, but just as delicious and filling. Decent portions for a  $9-12 sandwiches.", "author": "Christy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-28", "description": "Great little lunch spot! The place is long and skinny with 3 tiny tables crammed against the wall. I ordered the smoked salmon sandwich light on the cream cheese w a side of jalapeño chips and fresh watermelon juice. Delicious!!! The bread tasted like a dutch crunch and only towards the end did I realize the sandwich contained pickles which I normally hate but enjoyed unknowingly. Bit on the pricey side but good sized portions and  healthy ingredients. Will be back to try other things on the menu!", "author": "Yin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "Irritated about today's delivery! I got 2 salads and paid over $30! They barely filled up my box with salad and it's supposed to be a deluxe cobb salad. I always get the same order so I know how much it's filled up and I felt they ripped me off today. $33 on salads - I should be full.", "author": "Lucky N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-10", "description": "Yummy and delicious. If you are a vegetarian, you have 2 great options! The eggplant sandwich is delicious and the pesto is awesome. \n\nI had the vegan sandwich and it was also delicious. The focaccia bread was perfect and the sandwich was SUPER filling. Also, the chips are delicous.", "author": "Akshaya V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "Incredible bread, fresh delicious flavors, unbelievable watermelon juice. This sounds crazy but there's a \"swagger\" to this sandwich place. I'm very eager to go back.\n\nPollopesto - 5/5. Pesto very flavorful, lemon chive oil does come through to combine the ingredients.", "author": "Ojus P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "Amazing salads that are a healthy and fulfilling meal. \n\nSuper high quality ingredients, and generous portions on the salads make it well worth the price.", "author": "Lydia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "We ordered from this spot on eat24.\n\nI ordered the Caprese sandwich with arugula.\n\nThe sammy was a twist on the Caprese I love madly, but the arugula threw my taste buds off and ruined the bad*** experience I normally have with a Caprese.\n\nThe pesto in the sandwich was damn good, the bread and cheese were solid, and the tomato and arugula were fresh. \n\nDo it, just ask for NO ARUGULA.\n\nThat is it. That is all.", "author": "Gabriela W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-25", "description": "This place used to be great but it seems like new operators took over. Now the sandwiches are not as good, and the service is brusque, at best. Will not return.", "author": "Chou H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "This place used to deliver through eat24 and I LOVED IT. Now, sadly, they don't. Not sure why. I miss it!\n\nSandwiches are kick ass, esp the chicken salad. Best in town!\n\nPlease start delivering again!", "author": "JJ F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "Very tasty sandwiches and friendly waitstaff. I have tried the pollopesto and really liked it. I have tried the San Francisco, which was nice. My wife got the Mozzapesto, which she said was fantastic.", "author": "Benjamin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "At first I was a little upset I paid $10 for a sandwich ($14 with watermelon juice) but then I started eating it... Would've paid $20 for that pollopesto sandwich it was so dang good. Bread was perfectly crisp and you can tell only fresh ingredients are used. Huge portion, too! This place is a cute hole in the wall, but we warned it only seats about 6 people! I walked over to nearby mission park to eat.", "author": "Carolyn K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-08", "description": "yuk! The Beets where old as heck and the pears weren't ripe, the salad dressing was like pouring on molasses. The nuts were stale and the lettuce limp. Never again!", "author": "Catherine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "Great recommendation from the folks down at Chocolatier Blue. Looks like a hole in the wall but loved the relaxed, friendly vibe. Was also in need of a place to charge my phone and appreciated all of the outlets.\n\nI got the CranTurkey Sandwich and it was YUMMY! At first I was a little put off by the thickness of the bread, it looked huge, but then I tasted the bread. So worth the calories! It tasted like a little butter in every bite, which complemented the CranTurkey goodness. Ate the whole thing and had to have a late dinner because of it but was worth it!\n\nAlso enjoyed the watermelon juice, which has no sugar or junk added to it. Just sweet, delicious watermelon.   \n\nWould definitely come here again!", "author": "Julie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "I'm not a sandwich guy. There's just something about cold cuts and soggy bread that turns me off.\n\nHowever, Mission Picnic averts both crimes to sandwich-kind in one fell swoop. The pollo pesto sammie I got was surprisingly fresh, without coming off as...premanufactured. The arugula and tomato were real fresh as well. The best part? The bread was firm and fresh too! Hallelujah!\n\nThey do charge a lot ($9+ a sammie), but I've seen worse. I'm looking at you Ike's...", "author": "Casey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "I really enjoyed the Cobb salad from here. At $12, it's certainly not the most economic salad, but you're in for a treat. Mixed greens base with half an avocado, crispy bacon strips, hard boiled egg, juicy grilled chicken, blue cheese crumbles and to top it off, a sweet tangy apple vinaigrette.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-25", "description": "I first discovered this place about a year ago. I tried a number of their sandwiches, which were great. They have fresh ingredients and tasty sauces/spreads. I had to stop eating them because they were too big and addictive and probably caused some weight gain for me. I started ordering just the salads and only oder a sandwich if someone is willing to share it with me. The kale caesar salad became my favorite. It was a mix of fresh romaine, baby kale, perfectly salted anchovies, great croutons, thick shavings of parmesan, and the best caesar dressing I ever had. The dressing was extra creamy with the perfect anchovy flavoring.\n\nThey seem to have raised their prices and changed the ingredients of their kale caesar salad. The salad is more expensive and smaller. They now use the rough curly kale rather than the tender baby kale. The parmesan shavings have been dry and rubbery. My favorite creamy caesar dressing has been replaced with an oily sour dressing. I thought the dressing was a mistake when I first noticed it a couple weeks ago, but I have tried it a few times now and they seemed to have permanently changed it...very disappointing.", "author": "D. P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "Love love love Mission Picnic.  It's our spot to grab salads and sandwiches before hitting Dolores Park.  I've also had them cater at my office and everyone loved it.  \n\nThe owner is super nice and enthusiastic about his food!", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-12", "description": "Mission (Picnic) Accomplished\n\nThis past summer, I interned at a landscape architecture firm smack dab in the middle of the Mission. Known for its eclectic food--from taquerias to dosa places--the Mission is a mecca for unique flavors. However, working at an architecture firm, I often needed quick and easy meals on the go without compromising taste or nutrition. A co-worker suggested that I try Mission Picnic, and oh boy, I was not disappointed. \n\nMy favorite sandwich is the Picnic Club. Layers of tasty goodness: chicken, bacon, lettuce, cheese, pickles, mustard, and mayo. And the bread! No sandwich is complete without a freshly toasted bun. Mission Picnic offers a large selection of speciality sandwiches, unique to the store, of which you just have to try one of each. It also features other picnic items, such as salads, chips, blended juices, and cookies. Sandwich prices are a bit steep (about $9-$10 including tax), but Mission Picnic sandwiches make it up in deliciousness. You definitely aren't going to get a $5 footlong here (and why would you want to?)\n\nThe storefront is small with a few tables and chairs, but its presence is very strong. With its hand written menu and funky decor, it's represents the Mission very well.\n\nI was in the Mission today and wanted to visit all the food places I missed while I was away. One of the first to come to mind was Mission Picnic. Per usual, I ordered the Picnic Club and it was as delicious as I remembered. The counter server was Kathleen--one of the sweetest girls you'll ever meet. My sandwich was prepared by Sterling, the owner, a sandwich connoisseur, and, I must say, a little bit of a flirt. Also, shout out to Brian who was counting the till as I was complimenting the staff.\n\nBeing back at Mission Picnic reminded me of how small businesses can have a strong impact on a community. A sandwich is just a sandwich until it represents something more. Food is much more than about sustenance; it's about an experience. \n\nSo if you're hankering for a really, really good sandwich in the Mission District, scoot your butt to 22nd Street between Valencia and Mission, grab yourself a sandwich, have a picnic in Dolores Park, and enjoy!", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-03", "description": "I'm still not sure what the fuss is all about here.  I had a sandwich after a bike ride thru the mission and it really didn't do much to make me want to come back for more.  \n\nThe turkey was meh, but then again, what the hell am I doing ordering a turkey sandwich in the first place.  There wasn't much bacon in my sandwich, either that or it was turkey bacon, because I didn't taste the bacon. The spread was unique and I did appreciate the bread being toasted the way it was toasted.  I made a rookie move in not getting the watermelon drink and potato salad.\n\nOk ok, I will be coming back in the future. No turkey sandwich next time though.", "author": "Kelvin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-19", "description": "Though I've never eaten Hainan Chicken at a bonafied Asian joint, Mission Picnic's appropriation of the dish as a sandwich filling hits the spot. It's comforting, especially warm on a crusty French roll. \n\nBesides the typical sandwich toppings (shredded lettuce, tomato), the subtle-tasting pulled chicken is dressed in scallion oil & garlic butter--those condiments just made the sandwich. \n\nOnly complaint (and this is the neurotic food issues havin' part of me talkin', so feel free to ignore) is aside from breast meat, the not-so-pretty parts like fat, skin, & other general gross chicken parts I like to avoid, were chopped in. Most people don't mind those parts, but it drives me insane. As a whole, sandwich tasted good enough that I didn't mind having to pick out the few offending pieces. \n\nPlace only has two tables, so be prepared to take your sandwich to-go. \n\n$10 minimum for credit card purchases.", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-27", "description": "Have tried several different salads and a few sandwiches. Everything is tasty but a bit overpriced, specially for lunch. What happened to a lunch menu or half salad/half sandwich combo?? Love their watermelon juice, Cobb salad ,and their smoked salmon sandwich.", "author": "Maria R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "High quality ingredients.\nAttentive staff and owner.\nStrong attention to detail and creativity when it comes to the menu.\nSpace is clean and comfortable.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "The Cobb salad is to die for. It's so good that it compelled me to write a Yelp review. I wish I could say I've tried other items here (and I definitely will some day) but I just had to let the word out, for all of my fellow Cobb salad enthusiasts out there. The ingredients are so fresh that it reminds me of a way better version of a salad my mom would make.\n\nThe guys who work here are super cute as well. Killer Cobb salads and eye candy workers - be still my heart.", "author": "Emily T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-29", "description": "I've had this place twice now and the first time was great. I shared an ABT sando and a massive beet and green salad. No complaints that day. Didn't even mind the kind of inflated price.\n\nSecond time I go in, I order the kale caesar and the nuevo cubano. NO KALE. I kid you not, this was the worst kale caesar salad I've ever had for $8 +3 with chicken!) in that it didn't have kale in it. Just romaine, those fake, crappy, flavorless croutons, maybe like 4 tiny tomatoes and 3 pieces of tiny anchovies and the dressing was pretty gross. I almost called them because it was such a huge disappointment. When you call something a \"kale caesar\" it should have more kale and less romaine. Why emphasize the kale part in the title? After the beet and greens salad, I was expecting something higher quality. The cubano was 9.50 and turned to mush. Maybe the other sandos are okay, but that's not one of the better ones. I'm very hesitant to go in again.", "author": "Tori M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-09", "description": "Mission Picnic has 10ish sammies on it's board, looks like an hole in the wall, doesn't have much seating\n\nmenu: sammies, salads, juices, chips\n\neats:Hainan Chicken \n-\"pulled garlic chicken, shredded lettuce, tomato, cucumber, cilantro, garlic butter, oil,\non french rustic bread\"\n-moist, schredded chicken, very tasty, not 5 stars though.(flavors too subtle)\n\ncrumbs:\n-is mission picnic better than ike'?, maybe a better value, taste maybe a tie.\n-sammies made to order, 5 minutes?\n-reuben.also on list.\n-cash only\n-metered parking nearby or free on side streets.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-28", "description": "(See pics) Review #1351.Sandwich is more 3.5 stars. The 4 stars is because of the dessert.\n\nWhat was once popular Corazon Juicebar (there were people coming in looking for the old place) now is a sandwich shop. No sign until Friday (3/28) as they are really trying to test out their menus WITHOUT too much publicity.\n\nI really think the owner has a kick in making DESSERTS more than the sandwiches and that is why reviewing the dessert first as it's the real highlight!\n\nSterling has recently lived in France so this looks like a dream extension. Every dessert is made by him and as he mentioned (yeah sorry I was skeptical), it's the lighter sweet kind! They looked so very pretty and meticulously elegant, from tiramisu to chocolate, to fruit tarts. All were lovely and I had the strawberry cake and must say the aroma bursts out through the creamy silkness! If they would only add the coffee drink or tea, it will be a perfect afternoon spot or after dinner place to relax.\n\nOnto the sandwiches, they have a handful selection including Devil's Eggs on deli white (suggested it would be a real nice appetizer), Mozzapesto on focaccia, San Franciscon (west coast style pastrami with provolone) on rustic French, The King (only sweet sandwich with peanut butter, banana, honey, chocolate, frosted flakes!) on brioche, Picnic Club (chicken with chipotle) on ciabatta and Hainan Chicken on dutch crunch.\n\nWas totally eying the Hainan chicken but that was the one not recommended. The owner, Sterling, said if you are Chinese and had the Hainan chicken back home, you would find it to be not like that. Asked if maybe there was a twist to his recipe and it was said to still be perfected. So instead I ordered his recommendation (his most confident dish like The Taste show) and had the Picnic Club.\n\nThe chicken was decently 3.35 stars but the good substantial size made it up to 3.5 stars. It's $8.5 but paid half price as everything is (drinks and food) until Friday night during their soft opening. The little bacon bites were with a tingle of sweetness and a nice touch of crunchiness. It was also packed with mustard, lettuce and tomato, the standard. Did sincerely suggested that every sandwich has to be good and not just 1 or 2 signatures in the long run and look forward to the future visits.\n\nThey also made quiches in house. So many choices in such a small place!\n\nAnother major high point is they are currently open until 8pm and midnight on the weekends. This is bound to change to also open until midnight during the week. Considering Revolution is just around the corner and the shop is in between 2 major, major streets of late night establishments, or if you just live in the hood, having a bite here is a refreshing new option comparing with the bacon wrapped hot dogs and pizza, as one patron excitedly pointed out about the choice of switching out pizzas.\n\nThe peeps here were super friendly, like Mission genuine friendly, and the business partner who came in a bit later was also a nice chap checking and preparing more decorations and chit chatted with customers.\n\nDo want to see when this tiny shop expands to include next door office space, as well as other choices of sandwiches such as anchovy with capers (would be a definite to try.)\n\nGrand opening is this Saturday and if you are into vodka they are planning on having a party serving that with other refreshments and food.", "author": "T L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "Had the best chicken, pesto and goat cheese sandwich ever. It was really the best sandwich I've had all year. I will be back very soon!", "author": "Lexi F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-30", "description": "The sandwiches here will put you back almost $9 a pop, but they are very big, so splitting one with a friend is more affordable and ideal :) I don't know why anyone would line up an hour+ for Ike's if they knew Mission Picnic existed: cheaper sandwiches, equally (if not more) delicious, and no line is a triple win in my book! The interior has 3 tables and is super narrow and cute, so taking your sandwich to-go on a sunny SF day makes their \"picnic\" namesake apt :) \n\nHainan Chicken Sandwich was the most unique sandwich on the menu, which stood out to me. The chicken was perfect: not dry at all, and cut into manageable pieces, very true to Hainan style. The rest of the sandwich was perfectly proportioned, the accompanying lettuce was so fresh, and the bread was delectable. highly recommended! Get some napkins, it will be deliciously messy! :)", "author": "Tuwie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-17", "description": "5/17/13 Lunch\n\nA new sandwich shop serving sammies with a twist. Upon entering this tiny little shop we were whetted by the menu on the wall: Nuuevo Cubano, Hainan Chicken, ABT, San Franciscan (pastrami and oven-baked turkey)... all sounded good and yummy. After a few minutes of deliberation, my friend and I decided on two to share:\n\n*Nuevo Cubano: roasted pork and black forest ham with red pickled onion, a slice of pineapple on a crispy ciabatta. The avocado/jalapeno aioli and dijon all folded into a yummy flavor. I didn't taste the roasted pork but the ham was good. Pineapple dominated the flavor so maybe they could put more meat?\n\n*Hainan Chicken: this one, served on a rustic French roll, is almost twice the side of the Cubano. \"Hainan\" is really \"Ayam\" from Malay, meaning chicken. Ayam became Hainan when the boiled chicken dish came to China. Anyway, the Hainan chicken sandwich here doesn't come with the usual ginger, but a garlicky butter and scallion oil. Maybe they should consider a crushed ginger dip like that you get from a Chinese deli? The chicken is simply boiled but very tender and moist, unlike the usual leathery, rubbery texture of deli chicken. The assembly, complete with cilantro, sliced tomato and cucumber, looked a bit like a bunh mi. \n\nWe were also tempted by their special creation of the day: a French Toast sandwich with lumps of strawberries powdered sugar. But we were too full to have a go at dessert. They also have a PBJ sandwich, as well as a Salami plate. Guilty of having too much carbs? Get the Peach and Avocado salad.\n\nSo many possibilities here at Mission Picnic even though they don't offer katsu, the staple of Rhea down the street. They also allowed substitution. A guy came in toward the end of our meal and asked for ABT without the B---that is, bacon! So here you go. Give this place a try. Sammies are not piping toasty.\n\nMinimum $10 for credit card.", "author": "Matt Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "I picked up a few sandwiches from here last week to lug to a friend's house for an indoor picnic of sorts. About half an hour later when we finally sat down to eat, I expected the sandwiches to be at least a little soggy and drippy, but that wasn't the case at all-- somehow, after being manhandled for a solid 20 minutes during the walk from Mission Picnic to my friend's place, the sandwiches still managed to stay perfectly intact. The bread was surprisingly still crispy, as if it'd just come out of the oven, and the ingredients were all in their rightful places and tasted totally fresh. The sandwiches weren't dry either, so I have no idea how they maintained their crispiness, but it was gooood. Sandwich magic, I guess.\n\nWe shared 4 different sandwiches: the ABT, Pollo Pesto, Nuevo Cubano, and Cranturkey. The Cranturkey was my absolute favorite-- a lightly crisped french roll and just the right amount of cranberry sauce so as to not overpower the rest of the ingredients. The Nuevo Cubano was an unexpected runner up; normally I avoid pineapple in savory dishes because I think the combination is barfworthy, but again, the NC had just enough to add an unexpected kick. I thought the Pollo Pesto tasted a bit bland in comparison to the other sandwiches we picked up, but it actually came out as the favorite for 2 out of 4 people in our sandwich-tasting crew.", "author": "Kristina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-08", "description": "Mission Picnic, previously Corazon, opened about 1 week ago serving up sandwiches, salads, and fresh juices. The sandwiches are mostly traditional, with a bit of an interesting flair - the most popular and talked about is the Hainan Chicken sandwich. I wanted to try something different. \n\nThe San Franciscan (~$9.50) was screaming my name, with ingredients like Pastrami, Turkey, Pepperocini's.... and it was delicious! The combination of quality ingredients sandwiched between some amazing Semifreddo's French Bread made this an amazing sandwich. I just wish there was more meat (in general) on all of these sandwiches. \n\nMission Picnic is better than most of it's popular neighborhood competitors, like Rhea's, Pal's Takeaway, and Ike's (whoa, I said it). Nothing in the area is quite like it, but in terms of delivering an amazing pastrami, I think I still like the Sandwich Place and Marina Subs. In terms of top notch quality ingredient sandwich, my heart is still with Salumeria and Roli Roti. For something really different, I enjoy options at Bite Me. \n\nI'm a sandwich snob, and yet with so many options in the neighborhood, I would recommend stopping at Mission Picnic for your Dolores Park supplies. No place has served up sandwiches quite like this - so glad to have Mission Picnic in the hood!", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "I would've walked right past Mission Picnic if not for Yelp, so ... thanks, Yelp!\n\nThe vibe is super relaxed and friendly. Be warned that it's *tiny*, with maybe three or four tables for two at the most, so plan on taking your order to go. (Dolo is just a few blocks away!)\n\nI had the Pollopesto sandwich, which aside from its namesake(s) is also stuffed with goat cheese, baby arugula, tomato, and lemon-chive oil (omg)--it was fresh, well-balanced, and delicious, and washed down perfectly with their cold watermelon juice. My friend had the vegan sandwich, which was also tasty but not quite as delightful as the Pollopesto (sorry, friend).\n\nThe next time I'm looking for something quick, portable, and tasty in the Mission and don't want a giant burrito (read: am sober), I'll be sure to stop by!", "author": "Angela L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-09", "description": "I ordered the beets and greens salad after hearing rave reviews. Although the concept of flavors were nice, I was surprised with the lack of ingredients for the price. The salad composed of mainly mixed greens, exactly 4 pieces of red beet, about a tablespoon of undercooked quinoa, a small sprinkle of goat cheese, and a few tidbits of apples/pears and pecans. For over $11, I was very disappointed.", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-08", "description": "First time visitor, have heard about this place for awhile but was never able to see it until walking past one day.  The storefront is small, so small that if you blink you might miss it.  \n\nOrdered to London Broil during peak lunch time madness, only a 10 min wait for the sandwich.  The beef was pretty good quality but the standout was the bread.  It was a crusty but soft french roll and everytime I took a bite it just took me back to Paris on the river.  Def. a small seating area and in an area that will be a bit of a hike to get to the closest neighborhood park.  \n\nI'll be back, for the bread.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "The menu is unique and caters to the pallets of many foodies here in San Francisco. \n\nMost ridiculous one here? Try 'The King' - Peanut butter, Chocolate, honey, bananas and...wait for it....Frosted Flakes?! Oh my - talk about awesome in a form of a heart attack. \n\nThe San Franciscan is amazing. You simply cannot go wrong with this one. You got your Pastrami, turkey, provolone, tomatoes, red onion, peperoncinis, lettuce, mayo & mustard on a crunchy ciabatta bread. They were out of the French, but no complaints here! \n\nI Never got to try the Hainan Chicken everyone's been raving about :( Bring it back, please?! \n\nNote: Prepare to wait about 10-15 mins for your order and with only 3 small tables in the establishment, it's best to order to go or for pickup :) In short, I had a wonderful first experience here and would gladly pay $10 a sandwich any day for this place! TAKE ALL MY MONEY!!! *throws money*", "author": "Anh T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "My favorite sandwich place in all of SF!  Can't get enough of their sandwiches.  I didn't realize they actually sell out some days...so if they don't answer the phone that's why", "author": "Sara P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "Delicious sandwiches and sides! Reasonable priced too! The girls at the counter are nice and make you feel welcome!", "author": "Yedid G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "This place was delicious!  Based upon the other reviews, my husband & I headed over for lunch today - & it didn't disappoint!  We each ordered the San Franciscan sandwich and since the place is so small, we took them to go & walked to Dolores Park to enjoy them.  The sandwiches were perfectly flavored & had just the right amount of \"crunch\" when you bit into them.  Plus, they were filling!  We'll definitely be back to try more from the menu!", "author": "Karey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "Have gotten a sandwich here a few times while working in SF. They have salads and sandwiches which are different and make for good eating. Their bread is always fresh and helps make the sandwich. Very small place and I always take out. I will be back", "author": "Linda M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "I have actually never been to this place in person so, I cannot speak to the cleanliness of the restaurant, parking, etc. I have ordered sandwiches from here several times and they're always really good. I usually order the Franciscan sandwich. With chips, a drink and delivery charges the total comes to about $23.00 and that is not including tip-- Expensive for a 1 person lunch, but hey, when you forget to bring your lunch and hunger sets in, $23.00 doesn't seem so bad for a hot and fresh sandwich. Delivery has usually taken between 15-20 minutes. Not bad at all.", "author": "Andreea M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "Good sandwiches and salads, though a bit pricey. But, sandwiches are large and the quality is fairly high. Always a wait. Definitely call your order in ahead. \n\nI had accidentally tipped $250 for one sandwich on the iPad instead of $2.50. They called me almost immediately after I left to let me know my mistake and that they fixed it. THANK YOU!", "author": "Anna S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-04", "description": "The sandwiches here were nice.  We tried several, but none really stood out as being exceptional.  The bread was pretty good though.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-17", "description": "I stopped by here to pick up sandwiches for a picnic.  The pollopesto was amazing -- flavorful pesto, goat cheese, chicken, and tomato on crispy focaccia.  My friend enjoyed the vegan sandwich.  My only complaint is that the menu didn't specify that there'd be cheese in the side salad, so my vegan friend couldn't eat it.", "author": "Kellie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "The sandwich I ordered was surprisingly good, way better than I expected. Nice happy employees, clean spot, all in all well worth checking out if you're in the neighborhood.", "author": "Daniel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-05", "description": "The San Franciscan sando is so good, instead of a cup of water next to my bed at night, I put this sandwich on my night stand and eat that throughout the night. Not a true story, but the sandwich is incredibly amazing!\n\nSan Franciscan 9.50\nhot romanian pastrami, roasted turkey breast, melted provolone, crunchy lettuce, tomato, red onion, pepperoncini, oil and vinegar, mayo, deli mustard on french", "author": "John R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-12", "description": "I haven't eaten here or been here but I used their delivery service today! $15 minimum + $3-$5 delivery fee; not too bad for delivery service. Wanted to surprise the bf with lunch while being 2,000 miles away. Called around the time they opened and explained the situation to the lady. She was really sweet and helpful. I was able to order and pay over the phone (including tip). The food was delivered to him within 45-60 min like she estimated.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-31", "description": "Tried the San Franciscan, ABT, and London Broil, and all of them were super delicious. I'd definitely come back again!", "author": "Holly P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-07", "description": "3.5 stars overall. Tasty sandwiches. Overpriced, like most in the City. \n\nThey have some business operations issues that can be irritating. On multiple occasions, they have closed early or have been unexpectedly closed. Bummer if you've made a trip to specifically go there and had to deal with parking. \n\nThey also run out of certain types of bread sometimes, which can result in odd combinations like pastrami on brioche.", "author": "Grammarian A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "sandwiches are okay. would be nice to mention on the menu that almost all sandwiches come with mayo. unfortunate surprise for someone who despises mayo", "author": "Gabriele L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "pretty quick and reasonably priced\n\ncan't possible go wrong with the hot pastrami sandwiches, they're delicious :D\n\nonly a couple tables inside, so if you go in on the weekend, don't plan on being able to grab a seat.", "author": "Mike Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "Mission Picnic will now be my go-to spot for sandwiches. I tried the salmon, egg-salad, mozzpesto and vegan and they were all FANTASTIC. The bread were wonderful, I'm not even a fan of focaccia but this place made me enjoy focaccia! The french bread and brioche were heavenly! Also, the apple cider vinaigrette was so lovely! The quality of the ingredients were so fresh and so great! Honestly, I can't say enough. I love what they are doing and they are not at all pretentious or full of it! Just good ol' honest sandwiches (that are huge!!) and good prices. \n\nWe also did catering with them for 200+ and boy, they knocked it out of the park! On time, nothing was soggy, quality was not compromised and everyone LOVED it! \n\nThank you, Mission Picnic, you are a gem! XO", "author": "Foofa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "A great place to grab a sandwich -- only complaint is with a couple of quality related issues that (IMHO) should be addressed and corrected if MP wants to stay on top of their game.  The rotisserie pulled chicken sandwich is a winner but the chicken is not actually from a rotisserie, at least the dryness of the chicken and the grill marks suggested otherwise,  Also, the cheddar was dry ad crumbly at the corners suggesting that it wasn't wrapped or stored properly.  Easy fixes and I think a little more attention to these details and a would go a long way into locking this place into the best sandwich spot in SF!", "author": "Eric O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "Om nom nom, price for the sandwiches may be a bit high $9-11 but they are hella' delicious. I've tried to San Franciscan and the Club sandwich, both were great. The sandwiches are also pretty darn big, pick up a bag of chips and you've got yourself a meal. \n\nThere's not much indoor seating so it's definitely better to grab your sammy to go, and enjoy it elsewhere. If you're looking for something quick and sandwhichy, then give this spot a try!", "author": "David C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-01", "description": "Came in on a Sunday @3pm when the time says they close at 4. The guy was on the phone and wasn't even looking with us standing there. It took him 4-5 mins to look at us. I asked him if they are closed and just nodded three other people in the store not wanting to respond.u still have an hour to close...but not interested in getting customers. Bad bad bad customer service!! No eye contact with waiting customers as you are too busy on the phone. I am never coming back here.", "author": "Alok A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-05", "description": "Stopped by here on the way to Dolores Park for a 4th of July picnic. Great sando shop with a several good varieties. \n\nThe Picnic Club -  There rendition of the club sandwich. Good portions of chicken, bacon and cheese. Fairly large overall and excellent taste. \n\nHainan Chicken - Not bad at all. Flavors were there and again, it was a large sando. Careful on the pepper if you try it. It'll make you cry if you're spicy/pepper sensitive. Thankfully it's on the side and you can choose to add it or not. \n\nSalumi - Their take on an italian sando. I have to say, it's pretty darn good. The meats were flavorful and has a nice kick to it. The only small drawback is that it's a little oily. Other than that, it's a great sandwich! \n\nOverall Mission Picnic is a great addition to the area. It provides another spot of foodies to try and who doesn't like a good sandwich spot!?", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-04", "description": "Solid club sandwich.  Always a fan of a place that includes pickles.  The bread could have been fresher and I think the chicken was INXS.", "author": "Jordan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-04", "description": "Small place with limited seating. When I say limited I mean 3 tables against the wall with the people waiting in line a few inches away from you. However, they did a mean cranberry turkey sambo on a toasted roll. I wasn't expecting much but was very impressed with the sambo. They rotated out the hainan chicken which I wanted to try. The hubs got a salad and was not impressed - too much salad box stuffed to the brim without enough of the hearty stuff. Id say its a good place to quick up a sambo to go not dine in.", "author": "Melody T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-14", "description": "Awesome sandwiches - I never would have ordered the Cuban sandwich, but my boyfriend did, and the addition of grilled pineapple sort of blew my mind. Delicious! The watermelon juice was also excellent. Great spot to grab sammies!", "author": "Tasha D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-24", "description": "Picnic without having to put together the picnic? Yes, please. \n\nNice selection of well-made high quality sandwiches made to order. The sandwiches are good, and since they have \"picnic\" in the name it makes sense to get your picnic sandy here. At least it did for us.\n\nWhether you're going to hang with the vagrants in Dolores Park or tripping up to wine country, hitting up Mission Picnic on the way is a good idea.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "Customer service was excellent and the sandwiches are delicious. The watermelon juice is so good. A must have", "author": "Courtney F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "Amazing customer service, fresh, flavorful and delicious sandwiches. I had the vegan sandwich and it was loaded with avocado, tomatoes, hummus, sprouts and other goodies. They were out of focaccia so I had it on ciabatta instead and I added some jalapeños for a little more of a kick which was perfect! About $12 for a big sandwich and fresh lemonade.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-03", "description": "Came here for the first time with a friend and I loved it!! Didn't like how little seating there was, but at least it wasn't crowded.\n\nI ordered the San Franciscan and it was amazing! Everything tastes very fresh and the bread was perfect. I will be sure to come back here! :)", "author": "Steven T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "Pastrami sandwich is the bomb. I saw other reviews talking about it I had to try it. I can only say you won't be disappointed", "author": "Emad G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-11", "description": "I'm impressed. Great food! Excellent service! \n\n I ordered sandwiches to be delivered to my office. I sent the order in around 9:30. 11 AM was available so I selected it as a delivery time. They open at 11 so I figured that they would call to confirm the order and tell me when the sandwiches would be delivered. No biggie. I had time. \n\nI get back to my office just after 11. I have a message. The delivery guy is in the lobby with the sandwiches! Wow! \n\nEven more shocking all 7 of my (let's be nice and call them persnickety) co-workers loved the food. I got the Picnic Club. The chicken. The bacon! Great sandwich! \n\nThanks guys! We will be back!", "author": "KM R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-13", "description": "This place is very cool, I'm pretty active at mission, sometime it gets really busy. I was hoping a restaurant that allows me to order online, and pick up right away, so I can save some time. \n\nOne day I saw this small restaurant was packed, so I went in and look at the menu, they offer healthy sandwich and salad, when I was ordering it I saw they offer $1 off of you order through their app. \n\nI downloaded the app next time I was trying to order, it's pretty easy to set up and use, they take the order pretty quickly. It took about 10 mins for the whole process, which is pretty good. Right now when I'm on the way to mission, I just order it on my phone, pick it up by the time I get there. It's super handy. \n\nI wish they have more options though, overall, great place, cool idea! I like ordering food though my phone.", "author": "Dave Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-11", "description": "Service was very friendly and fast. I got the Southerner sandwich, which was okay but a bit misleading entirely overpriced for what you get: on the menu is was described as \"southern pork\", and in the south that would mean something along the lines of pulled pork. Essentially it's just a ham and cheese sandwich, and not a very big one, for ten bucks. I also opted for a side of potato salad, and it was the worst potato salad I've ever tasted... it had the subtle taste of apples and processed cheese. Yuck. You can get a much better sandwich for the same price from other places nearby.", "author": "P U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "I work nearby and pass every day so its amazing it took me so long to try it out.  So just gotta let you know that it was a great sandwich, I had the San Franciscan which was recommended by the pleasant lady behind the counter.  What I liked best is that the ingredients stayed together upon biting into the sandwich.  Some places, they make it so the ingredients squeeze out but these didn't. Here is a description of the Sandwich I ordered and note that I usually would not spend over $9 for a sandwich, but then again maybe you are not a cheapskate like me.\nSan Franciscan\n9.50\n\nhot romanian pastrami, roasted turkey breast, melted provolone, crunchy lettuce, tomato, red onion, pepperoncini, oil and vinegar, mayo, deli mustard on french", "author": "Jerome W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Quality food but expensive for the portion size. Can't beat a hand-written note on a sandwich wrapping either.", "author": "Keith M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-01", "description": "I _liked_ Mission Picnic, but I wasn't blown away. \n\nI had a caesar salad, which was fine. It wasn't anything to write home about, however.\n\nThe place is pretty small, so be forewarned. You place your order and hang out for about 15 minutes while PostMates cyclists push past you to grab their orders or small dogs nip at your ankles. All very Mission-y. \n\nNext time, I would choose the picnic club salad, but what can you do. I guess you'll have to back. :)\n\nThe good: sweet space. Really modern, I dig it.\nThe bad: a long wait for take out. \nProtip: take your food to Dolores. Soak in some sweet, sweet sun.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "This place was an extremely pleasant surprise. Decided to try it because of the number of good reviews and couldn't have been happier. We had two sandwiches which don't seem to be on the menu anymore, one was peanut butter frosted flakes and honey, and the other was a rotisserie chicken sandwich of some sort.\nI would highly recommend this place though be warned that the shop is very tiny.", "author": "Sara G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-05", "description": "Had the chicken club and wasn't impressed. The ingredients were all good, but the sandwich was bland. And it was chicken salad, which I wasn't expecting.\n\nI was disappointed that the sandwich wasn't hot either. Could've been better if it was hot.\n\nWill I try again? Probably not.", "author": "Rich R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-18", "description": "Not your average sandwich shop. With something so straightforward you would imagine that creativity is a challenge. Mission picnic is leading the pack in terms of diverging away from your standard sandwich and giving you a true experience. With a great selection, nothing here is boring and every single sandwich (I've tried all but the king) is as exciting as the next.\n\ni do however have a list of favourites; the San Franciscan being the staple with which you will never be disappointed. When you're feeling a bit more daring the Nuevo Cubano is so different and so delicious. The Hainan is also a great one which I suggest you all try before it leaves the menu. My favourite salad is the beets and greens and the side of potato salad is a must with any order. \n\nThere is so many good things to say about this place but I think what really stood out for me is the quality of the ingredients. I tried the new beef sandwich before I left and it literally melts in your mouth; thankfully they gave me a very generous portion of it. The staff are great, the atmosphere is nice and they deliver! It really is, for me, the best of its kind.", "author": "Ali B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-06", "description": "small place with three tables.  rude clerk who just nods head to acknowledge guests.  really?  is that how ppl in the mission communicate? \n\nSan Franciscan sandwich was a nice blend of two meats and good toasted bread.  Club you could skip.  \n\nClean bathrooms, but dusty lamp hovering over the aforementioned clerk.", "author": "PJ T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-29", "description": "Mission Picnic ... Delicious breads, fresh ingredients.  They get the order right !   A tad pricey but the quality is worth it.  I honestly can say a very good sandwich.\nI don't know if I am just picky, but I have a huge issue with consistency!  I hate it when I go somewhere anticipating the meal I had before only to see inconsistency.  Unfortunately I found that to be the case here also, although both slight variations were good lol.  They did get the order right but \"more mayo\"  less avocado\"  more avodaco\" bread too toasted.  Small things but as I said any variation WAS delish!\nOver all clean and good customer service.", "author": "415mama M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "A+ the best sandwich and nicest peeps, thank you Sterling!", "author": "Trishel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-03", "description": "I love mission picnic and I've never even eaten there. \n5 stars for customer service and you know the food is definitely good if it follows this awesome service. \n\nThe long story short: tried surprising my friend with a bday lunch delivery and had to cancel (she was out to lunch after I placed the order). \n\nTo the rescue: JENNIFER-so sweet, understanding, wonderful. \n\nTHANK YOU JENNIFER and because of YOU I already love Mission picnic and will be planning to actually try the food soon!", "author": "Kim D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-18", "description": "I heard many good things about Mission Picnic since it first opened. Excited to try a new place with such great reviews, and so near our typical haunt of the Mission Mercato on Thursdays, the boyfriend and I ventured to Mission Picnic on a Thursday late afternoon/evening to get some togo sandwiches. The place is small and we were the only patrons since it was an odd hour (probably around 4:30 or 5). We were lucky enough to be served by the owner and he recommended for us to try the Club and the Hainan Chicken. \n\nThe sandwiches did take a while to be made but I'm always okay with waiting for food to be prepared fresh. While we were waiting, the owner chatted us up as there was someone else there to make the sandwiches, Jose, who also works at Pal's Takeaway. Apparently, the owner is half Chines, half French and we learned that once when he was three years old, his mother found him pounding flour into the carpet while watching Jacque Pepin. Interesting. \n\nAnyway, we took the sandwiches home and were excited to dig in, but it was just a very underwhelming experience. The ingredients seemed well thought out, but it just didn't have that it factor that would make me return to a place. The Hainanese seemed a bit dry, not enough flavor, not vinegary or savory enough. I suppose it's a good option in the area, but it's not a destination for me. I walk past this place all the time and don't really have anything causing me to return anytime soon.", "author": "Victoria J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "Loveeeee that chicken club, staff were quick and attentive.", "author": "Khalid M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-17", "description": "I love sandwiches. Like, I really effing love them. It's probably a comfort thing with me, as my Mom used to make my sisters and I sandwiches when we were little, but wherever my love stems from, it's true, devoted, unadulterated love. \n\nBut I've never fallen in love with a sandwich in San Francisco. Yes, I've found sandwiches that I like - even sandwiches that I crave - but nothing I LOVE. \n\nI just stopped eating Mission Picnic's Devil's Egg Sandwich halfway through to write this review. That's how glorious this sandwich is. I absolutely HAD to let the world know how much they're missing by not having my bite of sandwich in their own mouth. I have little bits of egg and bacon stuck to my face as I type this, and I'm feeling no shame. \n\nIt's that good. \n\nLIFE TIP: They deliver - your excuses are null and void.", "author": "Mel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-19", "description": "Mission Picnic is the perfect stop before heading to the park. There are only a couple 2-person tables inside, so it's definitely more of a to-go place. \n\nI ordered the nuevo cubano. It was under $10 and only took about 5 mins to come out. The sandwich tastes like Hawaiian pizza, it was awesome. The bread is perfect and the pickled onions were incredible. Who would have known pickled red onions are such a great ingredient? \n\nEvery bit as good as Ike's, but without the line. Well played, Mission picnic. Well played.", "author": "K M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-10", "description": "Stumbled across this place and fell in love. This is the kind of everything-house-made original-menu place that makes our neighborhoods so special. It's a sandwich shop. In the same way that Chez Panisse is a new American local food place. Everything they make is unique, interesting, and tasty. For about 8 bucks you can get a great sandwich that's unlike anything you've ever had in a deli or an ordinary sandwich shop. \n\nI had a tuna sandwich with \"double cucumber\" and a spicy curry. The owner made it to order, so it took about 5 minutes. The flavors and textures balanced perfectly. This was 4 days ago. I still remember that sandwich. I'll be back to try another. Yay!", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-29", "description": "Got the mozzapesto, it was good. I wasn't terribly impressed with the bread and I thought the slices of mozzarella could have been a little more substantial. Pesto was excellent and roasted peppers a nice touch.\n\nI would definitely go back but probably wouldn't order the mozzapesto again.", "author": "Cole G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-12", "description": "I LOVE THIS PLACE!!\n\nI work a block and a half away and I end up going here for lunch at least once a week. It's so good, I'm addicted.  I love both the sandwiches and the salads. \n\nAll the ingredients are really fresh and they use really good ingredients in everything.  I can't even give you what my favorite meal is because everything is so good.", "author": "Dana M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-12", "description": "My wife and I wanted to try a different sandwich place so we came here and had the Hainan Chicken as well as their San Franciscan. \n\nThe Wait: Considering it was 2PM on a Monday, I was surprised at how long it took for them to make two sandwiches. It always amazes me to see the differences efficiency of various sandwich shops -- even those with diverse menus. This wasn't as bad as Ike's but the wait for the sandwich was still positively glacial compared to Roxy's or 1058 Hoagie\n\nAs far as the sandwiches themselves were concerned: there are plenty of better Banh Mi options compared to the Hainan chicken and the San Franciscan wasn't nearly as good as Deliboard (which IMO, still isn't as good as their sister shop 1058 Hoagie).\n\nAt this price point, I think Roxy's, Rhea's, 1058 Hoagie, or two Banh Mi sandwiches would be a better meal. I don't anticipate going back.\n\n-g", "author": "Gunn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-22", "description": "Mission Picnic features a simple menu that focuses on sandwiches. All sounded really appealing and I somehow settled on the Hainan chicken - mostly because I love Hainan chicken and to see it in a sandwich seemed inventive and unusual. \n\nI'm not sure if they cook the chicken in the traditional Hainanese way where the chicken is steeped in chicken bone stock, but let me tell you, that chicken in the sandwich was super moist and flavorful, much like a traditionally prepared Hainan chicken.\n\nIn fact, it might be the juiciest chicken I've had in a sandwich. \n\nMission Picnic is worth a visit. Perfect opportunity to grab a sandwich and head to the park.", "author": "Lee H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-02", "description": "Service Review:\n\nFirst time order at this place and what a disappointment! I ordered the Chicken Caesar Salad and London Broil Sandwich to go on April 27. And upon arriving at this place, the cashier did not even say a word and just blindly stare at me. I understand it was Sunday afternoon and he probably is hung-over from last night party or something. But you don't have to be so cold and no emotion on his face whatsoever. For some reason, I thought he included utensil in the salad box. Nope, not a single fork or napkin. It's such a joke to found out you can't enjoy your food at picnic because you got no fork.\n\nFood Review:\n\nI would give Mission Picnic 0 star if I could, but the food here are decent. To be fair, the chicken salad at this place is exceptionally good. The parmesan and crouton pair perfectly that gives you crunchiness and chewiness at the same time. The sandwich was OK, just like any other industrialized sandwich you got from Safeway.", "author": "Kenny O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-30", "description": "There is certainly no shortage of \"craft\" sandwich shops in the city these days (Ike's, Deli Board, Melt, etc.) and Mission Picnic manages to stand out. \n\nI've tried 3 which were all terrific and I'm aiming to try every sandwich on the menu because I believe they'll all be great. Get there.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-14", "description": "Tiny little sandwich shop. Smells of bacon and bread. The Nuevo Cuban sandwich is great. Super fresh tasting and the bread is just baked, adding to the overall experience.", "author": "Danielle O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "These guys are fantastic! Our girl scout troop was in SF this weekend and we needed sandwiches early Saturday morning. They accommodated our order and had it delivered and even earlier than expected! Thank you Mission Picnic, I will be sure to recommend you to our service unit back home who attend this event in SF every year!", "author": "KarenQ W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-28", "description": "Despite the spot being a hole in the wall, it is clean and all the ingredients are fresh and of high quality - from the tomato, arugula, bread to....you name it! Bread is done crispy but not dry. I got the London Broil (the roast beef sandwich) and the meat was tender, good portioned, and a great match with the aioli!", "author": "Christina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-11", "description": "I am on a perpetual hunt for the ideal sandwich. How lucky for me that I just discovered a new gem. Stumbled upon Mission Picnic on my walk home and returned the next day for a big honkin' chicken bahn-mi style sammy. That chicken must be organic and where do they get the rolls? Better than just an Acme bread. \n\nAnd a big sandwich, too. Saving the other half for my dinner tonight. Can't believe I'm so fortunate to have these guys in my 'hood. \n\nAnd, as the name implies, they're just right for a picnic in the park or on a Valencia parklet. If you're in the Mission for Sundday Streets this weekend, take a half-block detour off of Valencia onto 22nd and you're there!", "author": "maureen f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "I've been looking for a good sandwich shop for years in SF. This is my favorite one. Really well-balanced,", "author": "Peter J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-29", "description": "I ordered the Hainan Chicken sandwhich.  Maybe I got unlucky but I found a dressed-up vietnemese sandwhich with uncooked chicken in it.  I order my steaks rare, but I don't play with raw poultry, had to toss most of it.  \n\nMy buddy got the roast beef and swiss called \"SGT Slaughter\", it comes with a teriyaki slaw on it, the slaw is billed as spicy, but it's not, it's sweet and tangy, which makes it difficult to eat on swiss cheese and beef.  My buddy swallowed it out of hunger, but was grabbing his stomach afterward.  \n\nThe girl behind the counter was clueless, she took 2 huge phone orders between taking my order and my buddies, so that my sandwhich came out in 5 minutes and we had to wait around for 20 minutes for my buddies sandwich to come out......clueless help, I want my tip back.\n-minimal seating\n-Avg price of a sandwich:  $10\n-So many better sandwich options in this neighborhood", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "First time in this place. I love it!! Awesome bread and fresh ingredients. Fare price, the sandwich was quite big.", "author": "Lizbeth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "EXCELLENT!! - visiting here for work in SF in the financial district and had limited options for my team on a Sunday, but I'm so glad I found Mission Picnic on yelp.  Really good, fresh ingredients, a unique vibe.  They were really nice when I called, fast delivery.  Will DEFINITELY be ordering for my group again.  YUMMMMM.", "author": "Cindi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-20", "description": "San Francisco's hottest sandwich shop is Mission Picnic.  It has everything.  Creative yet intuitive flavors, friendly staff, chutes, ladders, the outdoor concert from a Zoloft commercial...\n\nSorry, I couldn't resist.  Anyway, I went today and ordered the Sgt. Slawter, and it was definitely in my top 20 sandwiches of all time (which is really saying something for me!).  It was the perfect combination of textures and flavors, juicy but not enough to make the bread soggy.  The teriyaki slaw with roast beef is brilliant, particularly when paired with dutch crunch and a garlic/herb spread.  The meat was exceptional: very thin and juicy with some real flavor.  This is some high-quality stuff, not your typical grocery-store cold cuts.\n\nPreviously, I've ordered the Hainan Chicken, which was good but didn't blow my mind like the Slawter did.\n\nMy only hang-up is the price.  It's just hard for me to justify spending $8.50 on a sandwich, even when it is amazing.  This is the only reason I won't be eating at Mission Picnic on a daily basis.  I'm not saying it's overpriced, just that it's too expensive for me to eat here as regularly as I'd like.  \n\nYou can really tell that the food here is made with care and quality ingredients.  I haven't seen such inventive and new flavor pairings in a sandwich shop, and I've eaten a lot of sandwiches.  The bottom line: go, and get the Sgt. Slawter.  And a watermelon juice if you're in the rare situation of not knowing to do with all of your extra money.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "Best sandwiches in the city! I could live on the pollo pesto.\nAlso the watermelon juice is unique, delicious, and refreshing...", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "The staff here are the nicest in the Mission! I have had a handful of their regular sandwiches, but have found my favorite in the cranberry turkey. Thanksgiving year-round. Mmmmmm.. They've got the softest most delicious bread on the egg salad sandwich too!", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-04", "description": "I want to share my best find at this place. \nHAINAN CHICKEN SANDWICH! \n\nIt's delicious.... \n\nThe sandwich has incredibly tasty garlic rotisserie chicken with cucumbers, tomatoes, lettuce on the Dutch crunchy bread - mmmmm, heaven!", "author": "Olga B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-12", "description": "We ordered a Kale Caesar salad and a San Franciscan sub. The salad was super disappointing; a single anchovy, barely any Kale or tomatoes and mostly lettuce.", "author": "Jaco L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-16", "description": "Hubby and I came by to pick up a few sandwiches before heading to Dolores Park for a nice afternoon in the sun.  \n\nWe ordered the San Franciscan, Hainan Chicken, and their version of the desert sandwich (bananas, chocolate, peanut butter, and frosted flakes) for our little girl.  The sandwiches were delicious!  They were still nice and warm and the bread was crunchy on the outside and soft inside when we got the park.  The San Franciscan was well made while the chicken in the Hainan was very tender and moist.  I actually really like the desert sandwich when I snuck a bite from my little girl.  The fresh juices also paired well.\n\nThis is definitely our new go to place before heading to Dolores Park.", "author": "Mac S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-01", "description": "Not a big fan of writing 1 star Yelp review but terrible customer service experience leaves me no choice. I've ordered from this place for delivery numerous times and enjoyed the food. This time around I was in the neighborhood and decided to stop by the physical location and WOW I was left speechless. I double checked online prior to showing up that they open at 11am, I come in at 11:15 to see the cashier screening at someone \"what do you want from me I don't know what is missing from your order it's not my order\" as I'm patiently waiting to place my order. A couple of minutes go by and she finally acknowledges me \"we aren't open for another 15 minutes\" she rudely says to me, I follow up by telling her it says online they open at 11 am to which she replies \"yeah not today.\" At this point I walk out the door and have no intention on EVER coming back to this place which is really unfortunate because I really liked salads they have.", "author": "Dmitriy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-03", "description": "I was just griping to a friend that it's hard to find a great sandwich in San Francisco.  Plenty of \"good\" places, but no \"great!\" places.\n\nWell, Mission Picnic is GREAT!  Every sandwich I've tried has been outstanding.  The menu changes regularly, to match the fresh fixin's they've got in the kitchen that day.  They've always got a few offerings to satisfy the less adventurous, as well as a choice feature or two for the foodies that haunt every corner of SF.  \n\nIt's not cheap ... but, in the San Francisco scheme-of-things, it's not that expensive either.  Expect to pay $10-$15 for a sandwich and a drink.\n\nOn top of Mexican Coke and other typical drinks, they have great/simple fruit drinks - basically, fresh fruit they blend on-the-spot with ice.  Simple, refreshing.  Try one, you won't regret it.\n\nBe warned - there isn't a ton of seating, and that that is available isn't spacious.  But, you can always find a park (or, a Mission Parklet) to grab a seat.", "author": "peter a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-29", "description": "I absolutely LOVE the sandwiches here.  My personal favorite is the San Franciscan- pastrami and oven baked turkey with lovely melted provolone on a great french bun with peperocinis which gives it a perfect zing!  The Picnic Club is also fantastic with the chicken salad and bacon and lettuce, tomatoes, pickles and cheddar.  It's so big too!! I can usually stretch it into two meals! :-)  Also the Albacurry is delicious, it's got a Thai style curry flavour that is in almost a sloppy joe style sandwich that has some really great pickled cabbage and cucumbers. \n\nThe salads that they come up with are so yummy as well, they currently have a chicken Caesar that is out of this world amazing!! And the portion is perfect, too!!  They have a lovely soup that changes daily.  OH! And sometimes they have banana bread pudding and if you can get your hands on that- sooooooo delicious!! :-) \n\nSo hurry up and go try out the grub here!! nom nom nom!", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-02", "description": "Tough spot if you're gluten-free. The sandwiches look good; I just wish they had better salads!", "author": "Elizabeth M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-24", "description": "AHHH-MAZINGGGGG sandwiches at this new place - Mission Picnic has GOT_it_GOING_On.\n\nTheir picnic club was hands down the most succulent chicken sandwich amazing creation I've ever tasted - how do they make that chicken so tender?  Probably because they know what their doing.  Facts.  \n\nThe worker bees and owners is cool as all hell (and most likely working) - straight cuties.  The music is awesome - thanks MP for playing the good beats.\n\nTry them for a catering event!  They will accommodate.  Check out their website, its friendly.\n\nGo to Mission Picnic, right NOW HOMIE :)", "author": "Jana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-08", "description": "Me and my friends went here for their grand opening last week.  Their sandwiches are creative and suited the whimiscal names given to each.   One sandwich that definitely stood out was their Hainan Chicken sandwich (we also tried their Picnic club, Devil's egg, and San Franciscan).  What made the Hainan different was that it had an Asian flair to it, but made modern into a sandwich.  The dutch crunch was toasted lightly and the chicken wasn't too dry; but was juicy and savory when paired with the secret sauce that came with it.   \n\nAside from the sandwiches, their watermelon juice was delicious =D\n\nWhat made this place even more enjoyable, are the staff themselves.  The owners are very approachable and easy-going.  They make sure that every sandwich you order is made to perfection!  \n\nDefinitely worth the trip out to the Mission.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-18", "description": "Love this little hipster joint with tasty specialty sandwiches. Got the Nuveno Cubano and it was SOOOO good. I liked the sweetness of the pineapple mixed with a small kick of spice from the jalopeno aioli. It's a bit pricey for a sandwich (~$8-$10), but I think it's worth the treat every now and then. Definitely coming back!!", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-14", "description": "There's a lot of rave and crave here and I won't be a hater.  It's good.  It's solid.  And it's a sandwich.", "author": "David S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-16", "description": "Sandwiches are good. But customer service should step it up a notch! If you want repeating customers you should make them feel more welcoming into your establishment. Very small store and only three tables to eat on which other people in line continue to bump your elbows. Thanks But No Thanks!", "author": "MENG D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-23", "description": "I stumbled on this place on my way to Dolores park. The menu is tight, the bread is fresh and crunchy and the service was friendly. It's not super convenient for a lunch in the park, but with the extra block walk!", "author": "Kylie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-17", "description": "It started off on a good ole' Saturday with the girls in San Francisco.  The day seemed perfect for a sandwich so we came across this new deli.  Mind you guys that Im a big fan of sandwiches, I travel far and wide in search of a good sandwich!  The sandwiches here?  Amazing.  They create these amazing sandwiches with quality products.  Everything from the inside to the outside is just perfect.  The bread is toasted to an amazing perfection.  The meat and everything else just works PERFECTLY  all together.  All of their selections are great.  Their juice is great too :) if you're looking for the best deli sandwich in San Francisco, this is hands down the right place to go to.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "Ever since I moved to the Bay Area, I have made it my mission to try a few new dining establishments per week. I have heard nothing but amazing things about a quaint sandwich shop called Mission Picnic. So this passed Friday I saddled up and headed down to the Mission to check it out. The neighborhood was very eclectic and had an interesting mix of shops. The staff at Mission Picnic was very polite, patient and thoughtful in recommending a sandwich to fit my tastes. With some consulting,I selected the San Franciscan, which was amazing. A nice mix of meats and great blended flavors. It was so good, I decided to grab another sandwich for the road! This time I chose the CranTurkey. Equally as delicious, light and very fresh. I have recommended MP to all of my friends and our next corporate lunch will definitely be Mission Picnic catered!", "author": "Elvis N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "The cobb salad is a winner - savory chunks of chicken, fresh avocado, crispy bacon slices, hardboiled eggs and a homemade vinaigrette. Sparse seating but friendly customer service. I'm already looking forward to eating another salad here.", "author": "Nan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "Great sandwiches, impossibly succulent and the bread is also great. It's tiny but if you can get a table it's actually a decent place to consume your sandwich, while listening to some good tunes", "author": "Miguel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-31", "description": "I had been wanting to try food from here since they opened. I finally got my chance when I decided to order lunch in for my boyfriend and I on our day off. I ordered the San Franciscan sandwich and the Beets and Greens salad. Both were delicious! The meat was sliced so thin on the sandwich and the crust of the bread was so crunchy with the inside was soft and tasty. Both of us were thoroughly impressed and super full! Will definitely be ordering from here again!", "author": "Ariel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-19", "description": "Mission Picnic was an amazing find meandering around the Mission. The Albacurry sandwich was all kinds of yummy, and really filling. Why someone didn't think to put curry and tuna together is beyond me. The Orzo salad was super rich and creamy. Definitely worth waiting the 15 minutes to get my sandwich. I wish I lived in SF to eat here all the time!", "author": "Daniel E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-26", "description": "This place opened not long ago & I've decided to give it a try.  So glad I did because this place is amazing!! I really like their setup and their menu was simple & appealing. \n\nIt was a lot to chose from but I settled in on the picnic club sandwich with rotisserie chicken salad.  The ciabatta was soft but crunchy exactly how it should be. It was delicious!! Everything was fresh & flavorful and I knew  I was being serve the best quality of food and services. Everything was excellent and everyone there was upbeat and friendly. \n\nOne of the best sandwich places in SF.  This place was beyond my expectations. What awesome find in the mission neighborhood...seriously, everyone need to give this neat place a try!", "author": "Angela W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "We ordered a huge lunch order for our office and although there were some inconsistencies with the Eat24 menu and their website menu. They called me to let me know were super nice and easy to deal with. Everything was exactly how we ordered and it came pretty quickly considering it was lunch time and we ordered for about 18 people. The salads are really big and filling and everyone really liked the bread. We will probably order from here again :)", "author": "Autumn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-15", "description": "Whenever I'm in the area craving a sammie, the San Franciscan is my go to sandwich :D It has the perfect balance of meat/veggie/bread ratio and with the melted cheese and toasty bread it's just an amazing marriage of flavors in my mouth... I love washing it down with their watermelon juice and for a nice sweet treat after, the chocolate chip cookie, YUMMMM. What more can I possibly ask for? Nada :D", "author": "Laura L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "I love this place!\n\nThe sandwiches are so so delicious and filling. I usually get the turkey cran and it does not disappoint. It's a perfect blend of turkey, cranberry sauce, and sprouts & other veggies that create the perfect texture and flavor combinations. \n\nI've had the ABT and while it definitely satisfied my bacon craving (hello double bacon!), the toasted rosemary foccacia was a little rough on my mouth. Personally, this sandwich is better eaten in halves like an open-face. \n\nI've only ordered to-go because the place is quite small and can easily get crowded. Luckily they work through the line quickly.", "author": "Eilene G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-21", "description": "Ordered the Devil's Egg and Premium Vegan sandwiches for delivery through Eat 24. Around two minutes after order placement, I get a call from the Mission Picnic saying they're out of the Devil's Egg. Okay, that's fine. I changed to the ABT. Again, a minute later, another call saying they're out of focaccia bread and they only have French loaves left. WTF? Fine, I'll deal. However, I specified for the Premium Vegan to have NO ONIONS! What does the sandwich come with when delivered? A field of HORRID RED ONIONS! At this point, I'm livid and pick off each piece of onion. I vow never to order for delivery again.\n\nThe sandwiches merit the prices and flavor is good, not great. I ate half of the Vegan, onionless sandwich and my breath reeks of ONIONS!  Delivery service was quick because I received my order with 20 minutes. Delivery guy was very nice. Service reps at the store are another story! READ ORDER SPECIFICATIONS THOROUGHLY POR FAVOR!", "author": "Kim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-12", "description": "Chicken pesto sandwich = amazing.\n\nEverything this place makes = incredible\n\nWaiting 20 minutes for a sandwich = lame\n\nThat is all.", "author": "Braden B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-11", "description": "Great selection of salads and sandwiches.... The good ones too, with some thought put into the ingredients, flavors that mesh well.  \nI read a review and someone complained about the quality of the chicken... the chicken on my Cobb salad was picked very nicely, (no fatty or unpleasant pieces), and the lettuce seemed as though it hadn't been chopped the day before like most places. The salad was $10.50 which seems reasonable considering what was in it. \nThey seemed decently busy, so it took a little longer than I expected, and someone who ordered after I did got their order before I did, so I almost had to dock a star, but great place, great fresh ingredients.", "author": "Shawn B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-20", "description": "Walked by this place and it was packed.  Decided to see what all the commotion was about.  I ordered the chicken cobb salad and fell in love!  The following week decided to make a trip over and I was so disappointed when I got back to my desk and my salad resembled nothing like my first one.  The bacon was missing, the salad dressing was completely different from the first time.  I called over and was assured they wanted to make things right.  Was told the next time I came in the salad would be on the house.  Mission picnic kept their word.  I ordered a sandwich as well.  Both were delicious.  I think a little more consistency would be good.  My salad was delicious, but again, it was different from the 2 previous times.", "author": "sumaya g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "Delicious! Ordered delivery for a meeting at the office and we all agreed, super yummy. The food was fresh and arrived when we requested, the dude even came up to our floor! We will forsure be ordering again from here. A great twist on some classics (we ordered the Cobb, Caesar, Cranturkey, and Mozzapesto). Loved it.", "author": "Kat H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "I've never been, but I placed a phone order earlier today and I couldn't be happier with the way I was treated.  Sterling, the owner, personally took my phone order and was very pleasant and accommodating.  Thank you so much, and the next time I'm in SF, I'll make sure to stop in and try the food!", "author": "Muhammad E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-29", "description": "Wow, they immediately turned things around. Still pricey, but cheers for being responsive!", "author": "Joe D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "Mission Picnic has amazing sandwiches.  To be honest, I've only ever had the Picnic Club, and I am so satisfied with it that I have no desire to branch out.  The chicken salad defines what a chicken salad should be, and the tomatoes are fresh.  It's best to call in ahead of time or order online so you don't have to wait, and since there are only a few tables it's often better to get take out.  The sandwiches are so large they will probably last you through almost 2 meals.  My roommates say the San Franciscan, London Broil, and Pollopesto are excellent choices as well.", "author": "Rachel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "Easily the best sandwich place in San Francisco. A lot of different options of meet and veggies. Great customer service highly recommended.", "author": "Serge B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "We ordered our food through eat24 and had it delivered,  the food was still hot. We ordered a Cranturkey sandwich, it was delicious, the sourdough bread was amazing. ..it's so hard to find good hard sourdough rolls!!!", "author": "Courtney V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-19", "description": "The watermelon drink is literally the best non-alcoholic drink in the city.", "author": "Quinn D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-25", "description": "We had Mission Picnic today for the first time!  It was fantastic!  I work at a medical office in the Castro and they delivered to us.  The owner delivered our lunch himself.  Very impressive!  He was extremely nice!   He also handed me a coupon for their event on March 29th.  The menu isn't that big but I like that, so one doesn't get overwhelmed with what to order.  I had a winter wedge salad and the Picnic club sandwich.  So fresh and tasty!  My co-workers all loved their salads and sandwiches.  We will for sure be ordering from them again soon!!   Thank you Mission Picnic!!", "author": "Rudy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-13", "description": "One reviewer called this \"a tad pricey\" and I'm going to chalk that up to all of the young tech money in the neighborhood. Three stars for a tasty (turkey/cran) sandwich, albeit way too much mayo. Lemonade crazy sweet. Two stars lost for the price tag and imbalance of the aforementioned ingredients. Walked out with a sandwich and drink for over $13...no side, no salad, no chips. Meh.", "author": "Maria G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-08", "description": "Best BLT in town, hands down. I had been laying off the bread and this sandwich was more crisp bacon than bread! I'm too young for a heart attack so why not do it now.", "author": "Frank H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "Delicious food! I have ordered delivery from here twice, and each time I got the same thing, because I loved it so much! I get the arugula side salad and the mozzpesto sandwich on their rustic french bread! Every bite is perfectly seasoned and absolutely delicious! One of the best sandwich and salad combos I've ever had!", "author": "Stefanie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-03", "description": "I love this place! Mission Picnic got me to eat a Vegan Sandwich. I LIKED IT. I highly recommend Mission Picnic for catering your event! Mission Picnic has an outstanding staff and super tasty sandwiches--our favorites are the ABT and the Picnic Club. I heard many good things about Mission Picnic since it first opened", "author": "Sebastian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-02", "description": "A nice change from the usual sandwiches. Fun, inventive and delicious. I had the Nuevo Cubano sans Avocado Jalapeño Aioli, and added their delicious bacon to the mix. Delish. Service was awesome and they helped me select a sandwich I would like, only problem, it was hot and the paper it's wrapped in got condensation and ripped apart in my backpack. I wasn't offered a bag. Kinda ruined my sandwich but I'll still go back and eat in next time.", "author": "William D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-26", "description": "I have loved every single sandwich I've tried here. I have been ordering the chicken caesar salad lately, and it always fills me up! Give this place a shot, and you will smile through the entire experience.", "author": "Chase L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-14", "description": "This place is so promising (nice ambiance, friendly), but I've tried most of their sandwiches and many of their sides and I still haven't found one that I'd go back for. Their sandwiches tend to be pretty dry and lacking in any real deep meaning or taste. I bought one of their salads and there just wasn't enough dressing--I had to go home and re-dress it. Do try their cran-turkey, though; that one is pretty good.", "author": "Keito U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-09", "description": "Plus for interesting combinations.\nMinus for value and small portions on the sammies.\n(especially in competition with a good nearby burrito or slice.)\n\nSuggestion:  sandwiches of this perceived caliber should come with a good pickle.", "author": "Jag A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-09", "description": "Really yummy but expensive and the ingredients are not worth it. I asked them about their meat, if it was hormone free, organic, etc. they looked at me with disdain and said it was just \"meat.\" Ok, fine but then what am I paying so much for? Not seating (the 3 tables are always taken) not service (it's slow and they are sorta rude) and not high quality ingredients.", "author": "A R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-04", "description": "The service here is incredibly bad, waited nearly a half an hour for a sandwich. A sandwich that isn't any better than something you could get any old sandwich shop. To top it off this place isn't exactly cheap and for the amount of time you'll spend waiting it's not worth it. In a neighborhood with plenty of options you'd do well to seek other places out.", "author": "Joe N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-13", "description": "Average sandwich shop. Was super excited to try it out because of the number of stars. FYI they don't serve Dutch Crunch anymore and their sandwiches are heavy on the mustard...not a big fan.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-05", "description": "Great sandwiches, I love this place. I've only been twice, but both times have been good. The first time I got the San Franciscan, which was good - nice size, great bread, plenty of meat inside. The second time I got the Devil's Egg, which was fantastic. I love egg salad, and this egg salad is particularly nice. It is certainly not a generic egg salad sandwich.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-30", "description": "After seeing the reviews, I was pretty excited to give them a try and hopefully add them to my roster for company lunches.  Not only did they deliver an entire day early, but on the actual day it was originally ordered for...I requested my order to be delivered by 11:30am and here I am writing this review at 12:28pm and my order is still nowhere to be found. My lunch meeting started at noon so our attendees are not pleased. I just started at this new job about a month ago...thanks for making me look bad Mission Picnic!", "author": "Kayla C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "Ordered delivery for office lunch and it came fifteen minutes early. Rodeo salad was delicious!", "author": "Shalin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "a great place that is so convenient to get a quick lunch. i had the lentil soup and peach salad which were both very tasty with a homemade feel. i loved the freshness and it the spot for this nursing hungry mama. i know i will be frequenting here for a quick meal. \n\n**i am glad that they have a $10 min for credit card - it forced me to get more food :)", "author": "Rachna P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-07", "description": "A little disappointed after reading the reviews that were so super.  I got the Cesar salad with chicken.  I ordered some extra dressing on the side as well but the dressing was pretty scarce.  The croutons tasted much like you get out of a box and the lettuce and dressing wasn't anything special.  The chicken was also kind of dry and not like freshly grilled chicken is supposed to taste like.  They should grill fresh chicken and put it on the salad and the dressing should be made from scratch each day including some more anchovy, garlic and mustard flavor.  Next time I'll try a sandwich, just wish there were some Organic choices, damn we're in SF, get with it :)", "author": "Mitch A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "Great sandwiches and salads, made with fresh ingredients, prepared quickly... What else do you need?", "author": "Jesse H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "San Franciscan was pretty tasty but a bit expensive. Only three tables so it's best for carry out.", "author": "Xteethx B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "Sterling @ Mission Picnic is seriously the BEST. He is now my go-to caterer whenever I need to plan lunch for the office/off-sites/meetings etc. The sandwiches are SO good and the salads are phenomenal as well- all really great quality. Mission Picnic is definitely a crowd pleaser.", "author": "Kristin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-09", "description": "Creative sandwiches with quality ingredients. What originally brought me in was the Hainan Chicken sandwich. Hainan Chicken is a dish which is popular in some places but difficult to find in San Francisco. Turns out that this place captured a lot of the flavor of that dish in a sandwich. I have been happy with everything I have tried here. Also, the location is central to just about anywhere you would want to bring a sandwich on a nice day in the mission. Grab a Hainan Chicken sandwich and a coconut water and head to the park... NOW!", "author": "Eric G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "I absolutely love this place! I order online a lot with coworkers and they deliver.  They have delicious, healthy, and not as healthy sandwiches.  Their beet salad is my favorite!  I call the staff sometimes to add or change my order and they are very friendly.  I have no complaints so far!", "author": "Celeste A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "Today was my first visit to Mission Picnic. Prices ranged about 9-10 dollars for a sandwich. There are only three tables so you best to expect to take it out. \n\nI had the Southerner which was just okay. My husband had the london broil which he absolutely loved. That is saying something for him, very picky.\n\nThe people working there were extremely friendly and helpful. I made a few changes on my sandwich, (maybe that was why it was just okay), and they had no problem with that.\n\nWith any restaurant, you are never going to get everyone to agree and love it. I would say go try it and see for yourself. It was good with fresh ingredients and very filling.\n\nI will be back.", "author": "michelle b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "Love the London Broil and Mozzopesto sandwiches. I tried the Pollopesto sandwich, but it's a bit on the dry side.", "author": "Amin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-04", "description": "Yummy huge less than $10 sandwiches and salads, great to have a mission place for a casual lunch. Tiny shop, maybe 4 or 5 two-tops, so pick up or go early", "author": "Aki N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "Mission Picnic has an outstanding staff and super tasty sandwiches--our favorites are the ABT and the Picnic Club. We love the sandwiches because the ingredients are fresh, generous, and put together with care. Breads are perfectly toasted, bacon is always crispy, and deli meats are top quality. Though we love the sandwiches, the incredibly kind and friendly staff are what keep us coming back. We are always welcomed with a smile (we love Jennifer!) and the place has a happy, upbeat vibe. Highly recommend Mission Picnic!", "author": "Suzanne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-23", "description": "I've been here a little over a dozen times and it never disappoints. Might be my favorite sandwiches in the city. I'm personally a huge fan of the nuevo cubano but the hainan chicken is also pretty good. Haven't tried the peanut butter banana sandwich but I am always tempted.\n\nThere's not one obvious reason I give it 5 stars - it's just all those subtle aspects of the execution done right - the bread and sandwich ingredients are super fresh, the sandwich construction is balanced and the bread is always toasted to perfection. They offer some unique sandwich combinations and it's obvious they care about what they're serving you.\n\nThe inside of the place isn't anything special and there isn't a ton of seating, so I usually get sandwiches to go and wander around somewhere. If you're hungry, you can't really go wrong here.", "author": "Josh S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-16", "description": "The Picnic Club is quite good, and I also had the soup of the day which was a vegan cream of broccoli.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "Love love the food but the delivery is always late. I waited 1.4 hours today for my food. If delivery was faster, it would be a solid 5-star.", "author": "Mehdi A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "I really like this place. It's very simple, but really tasty and good sandwiches. They are fast and fair prices as well.", "author": "Yuri N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-12", "description": "Blue cheese....!!!! Omg I would never try this cheese ever but I accidentally tried it from the peach salad that my friend had order. It wasn't bad at all. Despite the fact that I got to try something new, the taste of the sandwich (The San Franciscan) here really hit the spot. Must try!", "author": "Sinath N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-15", "description": "Yummy!!!!  Hubs and I happened on this place while searching for a sandwich joint near Dolores park.  On our way there, we literally walked in to the Sunday Streets festival, so that was also kind of exciting.  Anyway, it's a small place - seats 8 inside.  The menu offers something for everyone, but we decided to share the Hainan Chicken sandwich.  It was so DELICIOUS!  Definitely enough for two as a light lunch.   Because we checked in, we also scored a watermelon juice.  Service was great.  Prices are reasonable (less than $9 for said 'wich and most everything was along the same price point). I can't fault this place one bit!", "author": "Amber E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "Great ambiance. Visiting from LA found this place on yelp. Sat outside enjoyed the weather the food was good. Not to mention they serve beer and mimosas at 10am!", "author": "Christy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-08", "description": "$9 for a bland sandwich that took 30+ minutes to make? Bread was hard as a rock, and no flavor anywhere in my Picnic Club.", "author": "Mehul T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-30", "description": "Every sandwich I've had from here is mmmmm delicious. I took my grandmother who lives in Nebraska here and she even said it's \"the best bread I've ever tasted,\" which is saying a lot since she's had her fair share of homemade delicious bread. My fav thus far is probably The San Franciscan although the Sergeant Slawter is a very close second. Only downside is if you go late in the day they can be out of certain ingredients, but they usually find a very tasty substitute for you.", "author": "Sarah O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "Good, tasty, creative ingredient sandos.  Devil's Egg (egg salad) was solid.\n\nTook awhile to make 'em.  Probably worse during height of lunch rush.  \n\nMin $10 credit card is lame... get Square going on there yo.", "author": "Henry F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-13", "description": "Fast delivery. 30 mins only! But the proportions for the potato and pesto salad are so disappointing, small as heck! The other salads are normal doesn't taste super good. Expensive-ish for just average things.", "author": "linda t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-23", "description": "The server was extremely friendly. The sandwich I had, Pollo pesto (their special) was probably the best sandwich I have had. (And I've been to Ikes, Birite, all those places) I still think about their sandwiches on a weekly, maybe even daily basis... okay maybe not that much. But they are DAMN good. The price is not bad at all when considering how friggin huge they are, and the quality of the ingredients.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-16", "description": "Really enjoyed my Deviled Egg sandwich, and the side salad was huge!", "author": "Max Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-29", "description": "Disappointment 3 of 3 in the Mission.  Tried the roast beef, turkey with cranberry and vegetarian sandwiches.  The use of mayo on all the sandwiches wasn't desirable, but there also wasn't a whole lot of flavor coming from anything else other than the cranberry.  The meat amount was good with the turkey but sparse with the roast beef.  Overall, would rather eat a sandwich from Pluto's or Ike's every day of the week.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-15", "description": "What a great find!  Fast service and a great menu!  The Nuevo Cubana is fantastic,  super tasting sandwich.  The ABT Sandwich has the most bacon I've ever seen on a sandwich, great sandwich!  Stopped by on the way home twice this week, I'm addicted!", "author": "Ken B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "The food is great but so are the two guys who run this shop. We wandered in on a weekend afternoon - the place was empty and the owners told us how they got into the business, their interest in the space, etc. Very cool. And then they threw in a cookie for free :) Good people, great food.", "author": "K D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "Great sandwich, great salad. Good selection of drinks. Cozy joint with few tables, best to take it out for a picnic. Not as greasy, messy, loaded as icky Ike's, just right and light and fills you up leaving enough room in your tummy to get an ice cream. Go there and you'll not regret it. I gave it four stars 'stead of five since they do not offer enough healthy choices.", "author": "Pepe W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-20", "description": "Great new spot in the area. Check out the Hainan Chicken sandwich!", "author": "Brian K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-13", "description": "What a good sandwich. I've had pretty much the entire menu to date and have yet to be disappointed. The owners know what they are working with and put together a sammy quickly and for a good price. \n\nWe're NOT talking $13 over-priced sandwich people, this stuff is a good deal at a great price and if you are lucky you'll get to meet the owners in their small shop. Feel free to ask them about sandwiches or general life advice including but not limited to southeast Asia, love and relationships. \n\nTop notch sammy, good ingredients and a good price. What more could you want?", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-07", "description": "Overall I really enjoyed my experience here.  I ordered the Hainan Chicken sandwich which was garlic-y and flavorful.  The bread was the perfect consistency and the ingredients were all harmonious.  As a bonus, I was given a watermelon juice with my sandwich.  I've never been a juice fan before, but this watermelon concoction was awesome!  It was not too sweet, which is why I normally don't like juice.  I would definitely order both again.", "author": "Elisa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-16", "description": "Cute cozy sandwich and salad spot in the Mission. Ordered the Cranturkey (premium slow roasted turkey, aged Swiss, organic sprouts, light onion, double green leaf, mayo, cranberry sauce on rustic French) - was super delish! Just the right amount of turkey, the sauce was sweet and tasty, and the bread had that perfect amount of crunch! Also recommend their cookies that are freshly baked daily. They have a whole wall of different sandwich selections that all sound delicious, need to come back and try more! Kinda curious about The King (peanut butter, banana, honey, chocolate, frosted flakes, on a crispy brioche).", "author": "Audrey E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-04", "description": "If you haven't been you don't know what you're missing. Seriously. Their staff is super cool and welcoming, which I adore walking into any business. I had the Cuban, which was to die for. I secretly wanted the KING also, but was so stuffed I couldn't imagine having another sandwich in hand, I bet those bananas go hard though. I was told they alternate their sandwiches out so they constantly have new ones to share, which is a plus because trust me every single one (except for the curry because I'm not a fan of curry anytime) makes me extremely indecisive and confused in the best way possible. I am salivating as I'm remembering the warm, toasted, deliciousness pleasuring my tastebuds with every bite. The only thing this place needs is brewskies! I give the picnic an A!", "author": "Danielle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-25", "description": "Great new addition to the neighborhood.  Had the Hainan Chicken sandwich - loved it.  Garlicky, fresh, lots of tender chicken.  The folks behind the counter are great.  Say hi to Spencer (aka Babyface.)", "author": "Alice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-18", "description": "I'm in love. These are truly great sandwiches and a steal at the price. Every one I have tried has been exceptional. The salads are bountiful, simple, and flavorful. The $3 delivery fee - delivery via TCB - is worth every penny. My food usually arrives in half the time the confirmation email promises (and no hipster lines to wait in!). The Salumi Special sammy is like an upscale muffaletta, which I have been craving. I Can't believe it took me so long to discover this place.", "author": "Brooke B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-08", "description": "Had the Hainan Chicken Sandwich and San Franciscan.  Both were fantastic!  The Hainan got perfectly baked dutch crunch, you know with the thin and crunchy outside, and the warm soft inside.  Once your teeth get through the bread, then you get some excellently seasoned chicken the rest of the way through.\n\nThe San Franciscan is on a French roll, also with a good crust and warm soft inside the bread.  The pastrami is juicy.  You already think it's amazing, and then the provolone and turkey run through and straight wrestle your taste buds into submission.  Another excellent sandwich.  I've got several more to try like the Cubano and the King.", "author": "Yoway B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-20", "description": "Excellent food!  One of my favorite sanwich places in the city.", "author": "Ed Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-23", "description": "First impression: Rhea's (19th & Valencia) is way better. Ordered a Hainan (garlic) Chicken sandwich and found it lacking flavor and overly bready. Cost: $9.73.", "author": "Karl N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-06", "description": "I've tried most of the sandwiches here and they're all great. Rivals Hot Press for best sandwiches in the area.", "author": "Travis N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "Great place for a quick sandwich in the mission. I had the premium vegan sandwich and the side baby arugula salad. Fresh, tasty and healthy! The people behind the counter were very friendly too!", "author": "Abhi V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "real good spot for sandwiches. all the ones i have tried have been great but i especially like the Cranturkey (Turkey & Cranberry) sandwich. their bread is always fresh. good spot to get sandwiches from before heading to Dolores Park.", "author": "Farbod F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "Incredible bread spoons with fantastic sandwich fixins at this great lunch nook.", "author": "Natalie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-12", "description": "Mission Picnic , very catchy name and finally got to try it , the love for sandwiches never stops and having something new and simple other that those big hoagies with cheap deli meats on bread thats injected with steroids is always a plus and much appreciated , the sammy was well constructed  and the bread is the best part . but one star off because the Hainan chicken lacked flavor or maybe did not have enough sauces , i always believe a good sauce can make a sandwich 10 times better . we also tried the deviled eggs on brioche it was very good, looking forward to explore more menu items ...", "author": "NAEL K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-19", "description": "I just stopped in the other day for the first time. I had the chicken salad sandwich- best sandwich I've had in awhile. The cashier (owner?) was very personable- making jokes as he rung me up. The wait was no more than 5 minutes as well. I can't wait to try more including the veggie. There is also a vegan sando available.", "author": "Amy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-01", "description": "It's tasty, yes, undeniably tasty. But it takes 20 minutes or more to get 2 sandwiches here and I find it to be very expensive. I mean, I have to be real, I am a sucker for Mr. Pickles, and with that only a few blocks away I am always going to go for Mr. Pickles because they are faster and more reasonably priced and, most importantly, TASTIER! \n\nI wanted to love this place, I have tried several times, but the witty sandwich names and creative concepts just don't make it worth the price or the wait. Mr. Pickles remains the best sandwich spot in the MIssion, as far I am concerned.", "author": "c m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-05", "description": "The hot cuban sandwich is to die for.  Just delicious.  The assortment of sandwichs are great for eating there or taking to go.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-09", "description": "I happened upon this place while wandering through the Mission - I'm always on the lookout for a good sandwich. All I can say I WOW if you're a sandwich person you must try this place!! I got the Picnic Club and it was the perfect balance of moist yet crunchy bread, chicken salad, and all the rest of the fixings. The sandwiches are huge, so if you don't have a large appetite you could easily share one. \n\nIf I'm back in San Francisco I'm going to make it a point to come back and try The King - banana, honey, chocolate, peanut butter, and frosted flakes - oh my!", "author": "W. T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-10", "description": "Great food but always pay cash with delivery (the tip at least). The delivery service folks are city bike thugs and completely unbearable. The most recent order was by a guy that wouldn't ring the doorbell and when I did make my way to the building door, he was on the phone, stuck out his arm with the bag while he continued to talk on the phone.  The raised arm and bag was the only acknowledgment this guy made. These kind of folks make this city much less than it could be. Hopefully they'll find another delivery service since the food is good.", "author": "Bob C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "The Nuevo Cuban was unreal... Mission Picnic just became my go-to sandwich place in the city.", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "I eat a sandwich here at least 3x per week...the san franciscan is too good. Staff is super friendly and owner is very attentive and friendly. Great service - thank you MP!", "author": "Misao T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-24", "description": "I have finally found the restaurant that upset me enough to get a yelp account.  Thank you, Mission Picnic for popping my yelp review writing cherry.  That's about all I can thank you for.  The food here isn't even all that bad.  It is pretty standard.  But the customer service I received today (or didn't receive) left me beyond perplexed.  I ordered lunch for my office through GrubHub (love them - they are always good to me) and got a call from the restaurant that the food was on its way, but they had forgotten a sandwich.  She presented me with the option of a refund, but that would have completely defeated the purpose as to why I ordered food to be delivered.  Our crew is filming in the studio today and no one can leave the office.  She said because they were already on the way, they would rather refund.  I told her then one person would be out a lunch and asked them to please correct their mistake and send the sandwich.  When the first order came I realized there was a second sandwich missing (for the founder and CEO of my company, nonetheless.)  I tried calling several times but got no answer.  I finally called GrubHub, who after several times of trying to contact them as well told me they were refusing to send the SECOND missing sandwich because they were too busy.  I will NEVER order food from here again.  You forget two people's lunch and REFUSE to send it because you're too busy?  Not my fault as a paying customer that your staff can't get it together.  So as far as customer service here, the service part of that simply doesn't exist.  \"Refusing re-delivery because its too busy......\" Unbelievable.", "author": "Chelsea S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-08", "description": "Fantastic sandwiches from this new hole-in-the wall sandwich purveyor. I've been there three times since they opened and I'm stuck on the  San Franciscan (Hot pastrami, turkey & provolone) but one of these days I'm going to branch out and try the cultish Hainan Chicken (Garlic rotisserie chicken, cukes and picnic spread).  \nMy partner tried the King, a PB, bananas, honey, dark chocolate & frosted flakes sandwich that's like having dessert first.  \nGood quality and tasty creations. \nI'LL BE BACK!!!", "author": "Ann P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-26", "description": "From the reviews, I assume the meat options are far better than the vegetarian options. We stopped by and had the Pesto-Mozzarella sandwich and the Premium Vegan. The latter was such a bummer. The sandwich was incredibly dry -- just a little hummus -- and there was no salt, no pepper, no seasoning whatsoever. The Pesto-Mozzarella at least had some flavor, but zero points for innovation. These are sandwiches you can find on any menu, and that can be prepared far better at home for a fraction of the price. Major disappointment -- nothing distinctive, and no reason to return.", "author": "Scott B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-21", "description": "Chicken Pesto- One of the best sandwiches I've had in a long time.  I loved the arugula and goat cheese in it. The chicken mixture was delicious. The filling to bread ratio was perfect. I hate it when is there too much bread or too much meat. All the ingredients were fresh and good quality. I highly recommend this sandwich. Sooo good! = )", "author": "Pam G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-25", "description": "i heard this is a good place to get a sandwich for a picnic in the park. i live on the other side of the park so i've never been but today i walked by and stopped in. i had the nuevo cubano. i'm generally not much of a meat person but it looked interesting. fire roasted pork, black forest ham, pepper jack, red onion, avocado jalepeno aioli dijon and PINEAPPLE yum i love sweet with savory and a bit of spicy! all that for, i think, about $8. They charge you an extra sixty or thirty cents if you use a credit card under ten dollars. this is a sandwich to fill you up! They also have fresh juice and fruit like watermelon. there are some other sandwiches that look good, like the cranberry turkey one. i wish i could eat peanuts, because they have one with peanutbutter, chocolate, bananas and CORN FLAKES! ill most likely be back! oh, and there's about three tables, this is more of a takeout place than an eat in. hence the name Picnic.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-31", "description": "Mmmmm ... Hainan chicken sandwich!  Damn it was good! Nice toasty rustic bread roll with generous amounts of chicken , garlic spread, aand lettuce with a thai chili pepper on the side. I've never had a sandwich like it and the chili pepper had a nice little kick to it that went really well with it. Staff was nice, friendly, and knowledgeable about what ingredients they used and where it came from. Admittedly this was the only sandwich I've had here, but I'll be back to try the others.", "author": "Cliff L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-29", "description": "I order some food n got the email to pick it up 10-30 min later, only to receive phone calls n texts saying different things. One saying they were closed, another saying it was gonna b 30 min late. Long story short, I didn't get my food, n not sure about my money either. Girl on the phone wanted me to call eat24 to get my money back even though it was their mistake.", "author": "Paul G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-11", "description": "the sandwiches are good.\nthe Francisican being the top Notch.\n\nthe 1 star is soley on the amount of time one has to wait \nwhen you order in advance on their website.\nI ordered the sandwich on line 12:45pm, mind you it does state\n10-30 min reay time , (but for a sandwich) come on!\nwalked in 1pm, told me 5 more min. as I watched people who\nordered on site come & go.\n1:15pm Sandwich ready.\n10min at most walk in. 25-30 order on line.\n\ndo yourself & your patience a favor....\nWALK IN !\n\nFyi Filet Mignon takes 17 min to cook medium well... just saying", "author": "peter g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-29", "description": "Really great sandwiches! Had the \"southerner\"(of course) which was great. It had fire roasted pork, bacon, AND an amazing pimento cheese spread! The staff was especially friendly. Space is small, but overall five stars.", "author": "C C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-14", "description": "Love Mission Picnic! Their food and people are awesome! Sterling does a great job with the staff and customers that keep me coming for any last minute meals. This place is a must eat!", "author": "Jeanelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-06", "description": "Very very tasty I normally don't go in for sandwiches with long ingredients lists but this was an excellent time for me to deviate from my normal path!  Excellent addition to the neighborhood.", "author": "Regina O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-13", "description": "Mission Picnic is just what the neighborhood needs. Try the sgt. Slaughter sandwich. It's awesome. Mission picnic provides fast, delicious sandwiches without the frills or nonsenses of some others deli style shops in the area. I dig it and am headed back today for another crack at their menu", "author": "Connor D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-10", "description": "I used to work near here, and every time I went to Mission picnic there was a bit of a wait. There's pretty much never going to be a chair available, so plan on taking it to go. The sandwiches really are good, but honestly this place gets more from it's trendy status than I think it really deserves. Worth a try, but I didn't make it a regular thing.", "author": "Nik K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "Great new lunch place - has an interesting selection of specialty sandwiches ranging from meat to cutting edge to healthy.  Nice combination of portion size, excellent ingredients and freshly made with care at a reasonable price.  Perfect for takeout as well.", "author": "J B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-18", "description": "Good sandwiches! I like the San Franciscan it was so juicy!!!!! I usually order from this place since I just live 30 steps away! one thing I recommend is call ahead of time because they do take 15 min to make your sandwich. I remember i called in one day and came in 15min and it was not ready since they had a huge catering order, so I waited another 10 patiently and then another 10min frustrated!! Everyone in that store was also with a straight face because they been waiting for a long time. Overall it took 35 min to get my sandwich, and I was late for my final and that is why I am giving them a 3 star. Every single time I think of this place I think twice because of that one experience I had. It does suck to not have an accurate estimation!!! Because i recently got San Francisco Jun16th and my sandwich was cold because I decided to go in 15min instead of 10 min.  But overall if you have time to wait and you want a good sandwich come here!", "author": "THe real TrUth D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-18", "description": "Came by with a hankering at 4:30 and said they closed over a half hour early because they were understaffed. Not a way to run a business. Just going back to hit up reliable Ike's.", "author": "Greg S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-11", "description": "this place just opened and its soooooooooo EFFING good! i had the hainan chicken and died.", "author": "Courtney H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-22", "description": "tried out this new sandwich spot this weekend and loved it! great sandwiches - not a lot of room to sit down, but super close to Dolores Park", "author": "Lizzie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-30", "description": "Best sandwiches in the Mission!  I got the Hainan Chicken and the chicken was moist and flavorful, bread was crispy but not so hard that it cuts the roof of your mouth.  Perfect place to stop by for goodies on the way to the park.  Highly recommend!", "author": "Virginia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-11", "description": "Delicious! The Cuban was amazing. Friendly service.", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-11", "description": "San Franciscan was amazing!! They cut up the meat so the each bite is neat. The flavor reminds me of my days back with Jimmy Johns but I love this place. It's so unassuming but so worth the time. it's a small place with three or four tables. Its really a pick up and go hence the word picnic.", "author": "Kalifornia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-06", "description": "solid bread quality (my sandwich barometer), quick and friendly service, not too busy at noon. really loved the perfectly sweetened watermelon juice.", "author": "Dee R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-06", "description": "Huge fan of these sandwiches!  If you're in the area, definitely a place to drop by.  It's a small space but love the detail and the story of the place.  I decided to give their albacurry sandwich a try and was a fan.  Can't wait to head back soon to try more of their creative concoctions.  Keep up the good work, MP!", "author": "Alice Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-24", "description": "Considering the 200 other places to eat in the Mission, I will not come back here.  Service was friendly, and I don't mind waiting, but paying $9-$10 for a sandwich that consists of avocado, bland hummus, and those really bad, cheap, light pink tomatoes...the kind they use at Subway, was pretty disappointing.  The focaccia was over toasted too.  My friends mozzarella sandwich was also just ok.  This place would be 3-4 stars better if they used better quality, locally farmed ingredients and seasoned their food properly.  Just not worth $9.", "author": "amanda g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "Great sandwiches. Nice people. I wish they would switch the menu up a bit more, but other than that, pretty darn good. I recommend the egg salad.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-21", "description": "Wow!  My premium vegan sandwich was so good, I got the chills!  Everything super fresh and the focaccia was perfectly toasted.", "author": "John V."}
