{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-17", "description": "I was pleasantly surprised by this small Chinese restaurant. Here are the points:\n\nThe good: The food here is very, very delicious. Their seafood here are especially worth trying and the wonton soup was so flavorful. The menu is in both languages and do offer a pretty wide selection of classic and traditional Chinese food which I appreciate. For good food in generous portions, the price point was phenomenal. The servers here are very timely and they all speak some or a little English to accommodate English-speaking customers. I have been to a few \"scary\" mom-and-pop type of Chinese establishments, but this one was pretty nice.\n\nThe bad: The floors of the bathroom seems to always be wet. The bathroom smells unkosher (maybe some deodorizer might fix this). The tables are missing utensils and condiments. Depending on when you show up to dine at Mission Hunan, the wait time for your food to arrive might be very long. Even if it is after the lunch rush when there is no customers around, this problem persists. The restaurant is not fancy at all and, from some angle, one might say it looks a little ghetto.\n\nThe ugly: The employees here yack off all day in Cantonese and Mandarin Chinese. It is hard to enjoy your food or sometimes focus on eating when you hear restaurant employees quacking away loudly like arguing ducks in the middle of the dining space or behind the counter. I feel like telling them to shut the hell up, but, decided not to, as this might be a cultural thing. \n\nEveryone should have lunch or dinner hear. It is not shabby at all and I certainly enjoyed my experience!", "author": "Robert M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-07", "description": "I had the Mongolian Beef here from recommendation from the server and it was delicious! That being said, don't come here expecting the best Chinese food you've ever had or the 100% most authentic.\n\nThe meal started off with a soup, which I was expecting a hot and sour for, but it ended up being a variation of minestrone soup. It was still good tasting, just a bit unexpected and odd at the same time.\n\nThe Mongolian Beef was good though, very well made with a great selection of vegetables and a good flavor throughout. They also served the dish with a ton of rice, so it was easy to get really fully by the end of it. And at about ~$10 total it was a rather reasonably priced meal.", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-23", "description": "Waited a half an hour for my food and it wasn't ready when I told the waitress why was taking so long that it had been a half hour she said it hasn't been a half hour. Luckily I took a selfie in the restaurant when I started and it was a half an hour away I did get my chicken wings I ate that paid them for it but the rest of the food I told him to cancel. RUDE ASS waitress!! No tip for you!!", "author": "Hanohano V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "Had the Lunch special of the day:  Crispy Chicken and Vegetable Chow Mein with soup.  Big portion and was able to take it home for a 2nd meal.  Polite and fast service.  I'd go back.", "author": "Jim I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-10", "description": "While it's definitely not as gritty as it used to be, I admit I don't make it a point to spend much time around this part of the Mission.  Ditto for the likes of the Tenderloin and mid-Market.  That being said, I can certainly be swayed by the prospect of trying something new and/or delicious (the things I'd do for good food...), even when they aren't the trendiest spots or sitting on my list of (endless) bookmarks.   I just might be less excited, that's all...\n\nSince one of my relatives was impressed by the food at Mission Hunan, as well as their friendly prices, we decided to check them out despite how they're a bit out of the way for us.  As I looked over the menu though, as well as what others around us were having, nothing really stood out.  There may be a lot to choose from (including a variety of noodle dishes, clay pots, and sizzling platters), but most of their offerings are standard dishes, with nothing that seemed particularly special worth trying.  Spoiler alert - none of the dishes we ordered were either.\n\n-- BEEF WITH BROCCOLI...$10.28\n(https://www.yelp.com/biz_photos/mission-hunan-restaurant-san-francisco?select=6ypnRSTWKsezMvMLeYRfoA)\nCertainly not the sexiest or most interesting dish you'll find on the menu (here or anywhere), but this actually wasn't bad.  Not amazing, but not bad.  The slices of beef were more soft than chewy and the broccoli was fresh and bright.  A shame that the portion size was a bit light, though.\n\n-- TWICE COOKED PORK with String Beans...$10.28\n(https://www.yelp.com/biz_photos/mission-hunan-restaurant-san-francisco?select=opf-fMwjc0upUE86SEJJBg)\nCompared to our Beef with Broccoli dish, this felt like a much better value.  However, I can't say this one tasted as good.  The string beans, carrots, and onions were fine, but the sauce was too sweet for me.  What's more, the pork was uneven - some pieces were hard, others were okay. \n\n-- BEEF STEW CLAY POT...$12.88\n(https://www.yelp.com/biz_photos/mission-hunan-restaurant-san-francisco?select=O12WG-_rm0S-IbRgANYcxQ)\nWhile I liked how juicy the mushrooms were and how flavorful the sauce was, I don't get why so much of the beef was torn up.  Sure, it was better than getting chunks of dry, tough meat, and the pieces that were intact were pretty tender, but most of this felt like a big, gloppy mess.\n\nLike my relative, a lot of the positive reviews from Yelp friends seemed to give Mission Hunan high marks for their value (at least, as of 7-8 years ago).  Though that might still be the case with their daily lunch specials and rice plates (they seemed pretty reasonable), I'd respectfully disagree in regards to what we had.  By no means are they pricey, but I feel like a lot of my usual haunts in the Richmond and the Sunset offer so much more - whether it's in terms of value, convenience, or flavor.  Meh...one less reason to come back here.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "Come round here for dinner from time to time whilst in the Mission & it's in the midst of the Bart Station but it's a bit of a gem. The portions are big, food is consistent, and fresh. I'd recommend sticking with the staples as I was a bit put off by trying some of the more adventurous dishes simply cos the lady's serving can't speak English & say everything is popular/good. I like their veg/meat/mixed dishes, noodles & rice, soups.", "author": "Julian I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "This is what you expect when you go out for Chinese lunch.  A big list of lunchtime specials for under $9 that come with rice, soup and fortune cookie!\n\nAfter egg drop soup, with bits off chicken and roasted corn, I was served a larger plate of shrimp and green vegetable.  For me, the chile sauce was key to full enjoyment.  It's a thick, red sauce, tangy and full of pepper seeds.\n\nI had to take half of it home - with plenty of chile sauce.", "author": "Sondra H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "Authentic delicious dishes, very reasonable prices, strongly recommend Mission Hunan Restaurant.\n\nBest time to come is Lunch hour special from 11 am to 3:30pm for the $7 dollar Combo Specials!\n\nMy favorite dishes, Egg & Beef, Combo Chowmein, Potstickers ...but everything is super delicious!", "author": "Abel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "KOREAN CHICKEN\n\nMy dad used to work in San Francisco as an accountant. His favorite Chinese restaurant was Ming's on Mission Street (I think it used to be on 14th and Mission or 22nd and Mission). When I was little he would take my mom, sister, and me at that restaurant. That restaurant was a two-story building. The second story is where the bathroom was. One of my fond memories was going upstairs looking down at the open kitchen. It was cool to see how the cooks cooked the dishes. One of the other fond memories was my dad's favorite dish at that restaurant - Korean Chicken, which had a thick sweet soy sauce hard and crispy breading on the chicken wings. The sauce also has numerous chunks of diced garlic, which helped the amora. Since the breading was thick it was able to maintain its crispiness with the sauce. I assume since Korean Wings was an Americanized Chinese dish I would see this dish at other Chinese restaurants such as items as beef broccoli, sweet and sour pork, Mongolian beef, and General's Tso chicken. I could never find Korean Chicken at any Chinese restaurant that has Americanized items. So I believe the Korean Chicken was a specialty at Ming's. About ten years ago the Ming's I knew on Mission ceased to exist. So I never thought I would experience eating the Korean Chicken I experienced growing up again.\n\nAround that I passed by Mission Hunan Restaurant by accident. There's a dance studio I go to on Thursday nights that is about several blocks away from the 16th Street/ Mission Bart Station. About one block away from that Bart station is Mission Hunan Restaurant. When I first entered I looked at the menu and noticed the item Korean Chicken. These wings brought back great memories as they were the Korean Chicken I had at Ming's. There was something about that black, brown sauce. On my taste buds I can taste a some hot pepper oil and brown sugar. I believe to thicken the sauce there is some cornstarch. There's a concern that a heavily breaded chicken wing could be dry. The Korean Chicken at Mission Hunan Restaurant is moist. Everyone has a guilty pleasure of an Americanized Chinese dish. Mine are the Korean Wings at Mission Hunan Restaurant. About a couple of weeks ago on a Wednesday after Father's Day I came here to eat with my usual item Korean Chicken. I also had char siu (BBQ pork) over rice. Char siu is lately becoming another Chinese dish I like. The char siu at Mission Hunan Restaurant doesn't have the burnt ends but a moist meat with a sweet, fatty texture I like.\n\nMy rating is based upon that one dish - the Korean Chicken as I can't find this dish anywhere else. Lately the hipster scene is going to Korean restaurants to have some soy garlic wings. I believe the Korean Chicken at Mission Hunan Restaurant are better than any wings at a Korean restaurant. Maybe those wings at the Korean restaurants maybe more authentic than the Korean Chicken at Mission Hunan Restaurant. However I've had the soy garlic wings at the Korean restaurants and they don't taste half as good as the Korean Chicken at Mission Hunan Restaurant. If you are craving for wings at a Korean restaurants  I recommend to skip those restaurants and head to Mission Hunan Restaurant for some Korean Chicken.", "author": "Gerald R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "This is the spot. I work down the street, and if you come for lunch, you'll see the real San Francisco. \n\nI started coming here enticed by their nondescript daily lunch special neatly written on a whiteboard displayed by the front door. Don't come here looking for shiplap or bearded hipsters making cocktails while juggling with their feet. This is a hole-in-the wall, get in and get out kind of place. Muni drivers often take their lunch breaks here, folks from the neighborhood abound, and a lively, quick-on-their feet waitstaff.\n\nIf you order something that isn't soup, you get free egg drop soup with your order. I usually order scrambled eggs and beef over rice, and if I'm feeling like I need to treat myself, I'll order it over fried rice. The beef is perfectly seasoned, mixed in to a soft and fluffy scrambled egg. The portions are huge. I mean h u g e. So I usually eat half and save the rest for dinner. \n\nMy favorite thing to watch while eating here is the incredible patience that the staff has with the different characters of the neighborhood. They approach everyone with compassion, but they don't take sh*t from nobody. They are happy to serve you beer, but don't be a jerk. They are happy to let you use the bathroom, but keep it clean. \n\nThere are days when you want to wear the clothes you wore last night, or maybe your pajamas, and get some greasy food, without seeing anyone you know on Valencia Street. This is the place to go.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-07", "description": "Food: huge portions & actually pretty solid. We got the Korean chicken wings and spinach.\n\nService: Horrible - Waited 40 mins for a takeout order because they forgot to make one of the entrees. 4 people behind me in line got their food first and the waitress only checked on the order when I asked.\n\nThe other dish they prepped had already been sitting in the take out box for 30 mins by the time they realized their mistake. Not happy.", "author": "Kristy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "Cool spot funny servers fast place clean ! Even there on a crazy nasty block ! I enjoy the food every time i am here good job. !!  thxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx", "author": "Zurdo R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-15", "description": "They actually served me paper with my shrimp dumplings and served seafood noodles even though I paid for seafood sizzling!!! Disgusting and fraud restaurant", "author": "Adithi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Reasonable prices for the plate size. My mom and I have went here from time to time for the past 10 years or more. It's a humble place, with parking...but beware of the area.", "author": "Maria R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-10", "description": "Pleasantly surprised.\n\nWe were in town to see a friend of mine perform at the Lost Church down the street.\n\nHUGE portions. I couldn't believe the amount of food that they give you here.\nReasonably priced for what you get as well.Alot of other Chinese restaurants that we have been to in the city give you a lot less food for a lot more money.\n\nCan't really think of anything negative to write. The sweet and sour pork was the best thing that we ordered, followed by the chicken fried rice. Both were very good.The only thing that was kind of bland was the beef chow fun.\n\nWe will definitely go back if we are ever in the area again.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-11", "description": "I ordered two Hot & Sour soups. I was asked if I wanted chicken or shrimp. I responded shrimp. When I got home it was full of pork, no shrimp, no chicken. It also had a lot of lumps that I hope was a thickening agent, that looked like a weird jelly, that wasn't properly dissolved. Absolute FAIL. The braised green beans were really greasy and had some weird pickled veggies I'm not used to getting w braised green beans at other Chinese restaurants. Probably won't return to try this place again since Hot & Sour is my thing.", "author": "Tracy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-03", "description": "Let me start off by saying the food here is great! Really delicious food in pretty large portions for a good price. I love pan-fried noodles, so I ordered pan-fried noodles with beef and tomatoes. It did not disappoint! It was a huge plate that came steaming hot. So hot, the tomatoes burned my tongue, but everything did taste fresh. The beef was savory and tender, and the noodles were nice and crispy.\n\nThe bad?\n\nWell, there was a cockroach crawling on the wall right by where my coworkers and I sat. I killed it with my napkin, made sure the bugger (pun intended) was dead, went to throw it away, washed my hands, and when I returned to the table, I asked the waitress politely in Mandarin, \"Excuse me, may I have another napkin?\"\n\nHer, sounding very annoyed: \"But I already gave you 3 napkins!\" \n\nOne napkin for each of us.\n\nMe: \"But I had to use it to kill a bug, so I need another.\"\n\nAt least she went to get another napkin while my coworker remarked that she was really stupid. If a customer asks for another napkin, you don't question it. You go get another napkin.\n\nI did tip, but a small tip, due to the dirtiness of the place, and the waitress's rudeness.\n\nGood food. Pretty good for the filthy Mission district, which is why I give this place 3 stars instead of 2. Yes, the quality of the food saves this place a star, but I think I'll go somewhere else for Chinese food.", "author": "Jo W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-08", "description": "So I'm sitting here and the lady who seated my friend and I throws menus on the table and walks off dose not come back around for a good minute finally we order she obviously was not listening to thing we said my friend and I ordered meals with no meat and both of our meals came with beef in them when we try to explain to her what's wrong with our meals she rolls her eyes and walks off I WILL NEVER EVER COME BACK", "author": "Ruth P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "A small place for great Chinese food. I used to live nearby, and ate there a lot. Now I drop in when I can. \n\nI highly recommend the General Tso's Chicken. I also love their huge and flavorful pot stickers. \n\nThe portions are large, and the food is excellent. This one of my favorite Chinese restaurants. \n\nThe staff is friendly, and attentive. \n\nHighly recommended!!!", "author": "Jennifer U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-26", "description": "I ended up at the table right by the big fish tank, which was cool, except for the clearly visible fish poop stuck to the glass near the bottom. It's an average cheap Chinese place otherwise, Big Lantern down the street is nicer.", "author": "Jacob M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-29", "description": "Not bad for a hole in the wall Chinese spot on Mission. Quick, affordable and lots to choose from. Obviously not the best, but what do ya expect? Out of all the dishes we ordered, definitely going to recommend the Korean fried chicken wings. Somewhat comparable and prepared similarly to San Tung, each bite is filled with crisp, sweet and spicy. Also tried the pan fried noodles, wonton soup, and combination fried rice. \n\nTwo words to describe this place: tasty and cheap.", "author": "Vasean P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-03", "description": "We just finished volunteering at the Food Bank and needed a place to grab a cheap bite.  Ran across this restaurant on Yelp. This place is nestled in what I call a rather \"sketchy\" neighbourhood. It reminds me of Tenderloin where the smell of urine will drive you to walk super fast. Once inside the restaurant, it's your typical local Chinese joint. \n\nGiven the neighbourhood, the atmosphere of the restaurant, I was surprised to see the prices of the dishes. $9 to $10 for fried noodles and the like. I was expecting it to be around $8. Has inflation really gone mad? But when the dishes came out, they were in huge portions!! So, I guess that made up for the prices... The taste of the food was actually decent! I was pleasantly surprised. By the way, they also give you free soup so no need to order any. \n\nI wouldn't go out of my way to come here. But if you live nearby or so happen to be in the neighbourhood like us, this isn't a bad place for a cheap Chinese meal.", "author": "Jannie Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-01", "description": "My family and I have been going to this restaurant for many years/generations. Honestly this is my favorite place to eat won ton soup and the portions are generous. They are quick with their service and are always willing to make accommodations for special requests of their food. The only reason why I will be giving them four stars is because their staff have not the best memory every time I go in without my family they don't recognize me. You could be accompanying someone to get food and when you step out then return they think you're a different person. But again this place I would definitely recommend to eat at!", "author": "Gloria K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "The 1 star is for the food, it's not too bad. The bad thing is that if you don't tip them then they will scream at you. The guys in the back are always picking their noses- gross. They should really work on their customer service. My family has been going there since 1992, that had always been our to-go to place for Chinese food, but unfortunately they don't know the minimal thing about good customer service. Makes sense why their restaurant is almost always empty.", "author": "Janet D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Not the prettiest of locations but extremely good food. Been coming here since a kid and it's always consistent. Love it", "author": "Marylou V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-15", "description": "Too much MSG in the soup!! Even if it's free, I wouldn't recommend drinking it.\n\nAlthough the dishes are cheap, there is quantity, but not quality. The chicken in the pan fried noodle tasted like they hadn't properly removed all the fat, and it wasn't marinated enough. \n\nNot the best food in the world, but it is cheap.", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-10", "description": "My boss and I were gossiping about good food. He told me that this Hunan restaurant on 16th and Mission makes good food with big portions at an affordable price. \"Conversation like what we had is another way to make you hungry!\"\n\nObviously I like the \"good food with big portions at an affordable price\" part. But I don't like that particular busy area. However I am a city worker, who goes, eat and yelp everywhere in the city and county. \n\nBut a few days after our conversation, I finally made my way to the busy area for lunch. The time I was there at 12:20pm, the restaurant was surprisingly not busy at all and I was seated immediately. \n\nI was looking at the posted lunch special for that day, which is the honey walnut prawn with fried rice for $6.50. Yummy right? But I am allergic to all shellfishes and ask for a substitution meal. Instead the lady gave me a Chinese-style fried chicken over vegetable chow mein for $6.00. I get cut up fried chicken parts. Like most poultry dishes, the chicken meat was dry. But the outer layer very crispy though. The Chinese pasta was not too oily and not too dry. I like the restaurant's pasta dish and come back just for that particular pasta. Free soup is also included with the meal. For the affordable price, the portion was indeed HUGE! My dish: http://www.yelp.com/biz_photos/mission-hunan-restaurant-san-francisco?select=3dL_ZeiKijsSG3b_r3FSMg#agKI1_RuQ80Uqhj7MjatiA\n\nAs I was eating my meal, I was looking at the restaurant's aquarium. How calm and relaxing to look at! Aquarium: http://www.yelp.com/biz_photos/mission-hunan-restaurant-san-francisco?select=3dL_ZeiKijsSG3b_r3FSMg#BKf3j-7dotDgDgU2TNGjow\n\nThe area is not the safest. But the food is super cheap with big portions.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "Love it here, delicious and inexpensive. Very fast service even when they are swamped. And conveniently placed near a Bart station.", "author": "Mario C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "Sadly, it took me years to try this place, which always looked a little scary from the outside and by judging by the neighborhood (close to where I live).  It was only after my Chinese students told me that the delicious catering they always ordered was from there, that I dared to try take-out on my own.  Despite it being the favorite of my Chinese students, I found it satisfied my desire for americanized Chinese from my mid-west childhood.   It is not fine dining and I don't see anything \"Hunan\" about the food, but it is really good basic food for a decent price - one of my go-to places in the neighborhood.  Interestingly, it is usually filled with latinos, with telenovelas playing silently on the tvs.", "author": "sweaterhead x."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-24", "description": "I ordered the bbq pork chow fun.  The meat was fatty, super tough and it wasn't bbq.  I've had this dish many, many times from other establishments, and it is usually thinly sliced and tender.  I ate a small bowl of it.  DO NOT ORDER!\n\nI also ordered the fried prawns.  They fried them soooo hard that I could only eat 2.  I crunched them up, and gave the rest my dog.\n\nI will never go there again!", "author": "Ebony B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "This place is on my way home. Its quick and inexpensive and the food is good. Okay it's not the best but it's tasty and cheap.", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "Mission Hunan restaurant has been there as long as I can remember and it was known to be a 'hole in the wall' restaurant in Mission district. They not only serve gourmet chinese food but also offer unique experience of Chinese-American mixed culture in the city. I like getting their lunch special(~$6) that comes with soup, entree, and chow mein or frird rice. I personally think that it is the best deal that you can have in the city and the food is actually delicious!! My family also love to go there to get our chinese food craving fixed. We usually order korean chicken(the flavor is on point), wonton soup, sweet and sour fish, Mongolian beef, and combination fried rice. These are the regular items my family usually order and they are very tasty plus their portion is huge that it can feed family of 5 and have left overs!!:)", "author": "Ji P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-10", "description": "Pretty meh americanized chinese food. I've got nothing against the style, but the dishes here weren't that great. The korean wings are alright and you can't really mess up young chow fried rice, so this place isn't the worst you could end up at.", "author": "Omar M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-27", "description": "Horrible food! Horrible service! \n\nNot sure how this place stays in business...food was inedible...cashier was extremely rude...Won't be going back...", "author": "Noree B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-28", "description": "The short older chinese lady with the curly frizzy hair was extremely rude when serving food to people. She bumped into me several times and in one she literally shoved me into a table without apologizing. Very unprofessional. \n\nOther than that, the good food is the only reason why i keep coming back. Service there is mediocre.", "author": "Kimberly P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-13", "description": "Low price and in the mission.  The chicken in the Hunan Crispy version was really dry.", "author": "Mabel F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-23", "description": "I made an order for pick up and got there in 20 min. The food was all ready to go, pretty fast service.\n\nThey give you huge portions here. The food is okay, pretty standard Chinese takeout. It's pretty greasy and the meat is a little suspect, but it's cheap and fast.", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-14", "description": "Ordered online today at 1:56 to save time. The confirmation said 15 minutes for the order to be ready. Showed up at 2:15 to give a little more time, waited around for 15 minutes at the counter before anyone acknowledge me as a customer. Ask if my order was ready and to my disgust she said it would be 15 minutes before my order is ready.", "author": "Salvador M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "This is the best place for cheap but good hole in the wall Chinese food outside of Chinatown and the Chinese Chinatown (i.e. Richmond district). I live in the Potrero neighborhood, so to have this gem pretty close to the house is amazing. Everything is good. I don't know why other reviews are low.", "author": "Andy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-09", "description": "Good straight forward American Chinese food with the option for authentic if you can read Chinese. Don't expect a refined dining experience.", "author": "eVa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-04", "description": "Food taste good!, Big Portion & cheap! Don't let the look of the place fool you. Their daily special is a bargain too. This place seems busy during lunch time (mostly regulars).\n\nWould definitely come here again & Recommend this place to others.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-19", "description": "3.5 stars \n\nTheir signs say they serve authentic HK styled food so we decided to give it a try.  Once we sat down, I was happy to see they have a lot of authentic soul food entrees written in Chinese on the wall - too bad we didn't order them.  Actually, we ordered one dish but was told later that they didn't have the ingredients.\n\nWhat we had:\nbeef stew wonton noodle soup - pretty good.  they use MSG, enough for me to feel something but luckily not too much to get me sick\n\nchicken chow mein - this was such a silly order.  it's ok\n\nIf we were to return, I will order the soul food.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-20", "description": "The food: good quality food, large portions for the price. Food tastes great and it's my favorite Chinese takeout place in the city. For Americanized Chinese food, I go for the orange chicken and combination fried rice. The korean chicken is good. The hot and sour soup and the wonton soups are good as well. They don't skimp on the wontons or the veggies. They also have a delicious chili sauce that's very different from other restaurants. \n\nAmbience: it's clean, but the neighborhood isn't too great. Free parking in the back is awesome. \n\nService: the waitress/cashier is very nice and speaks pretty good English!\n\nBottom line: I recommend it for Americanized Chinese food takeout! Wouldn't really eat there, but that's just because this type of food is always takeout for me!", "author": "Andy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-13", "description": "Usually I like eating here but the last 2 times were dismal. Food was way greasy and all pretty much tasted the same. Makes me question if the alcohol I had consumed made the first few Times applicable haha. Anyway I don't think I'll give this another go. There are far better spots in the mission for Chinese food. To me if they can't get it right consistently then I say NEXT", "author": "China D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-04", "description": "Food is delicious. I love their lunch specials. I am however not too fond of their soup that they give with the specials. Looks like bunch of left over vegetables and other things placed in broth. Other than that, cant complain. Just dont expect your food to be served right away on peak lunch hour.", "author": "Nino J V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-21", "description": "Great lunch spot!  They have a huge lunch special menu, food is decent and they're quick. I love their complimentary corn soup.  I also love their beef scrambled egg over rice (I've only seen the shrimp option available at other restaurants).  I've also tried their wonton soup, chow fun, sweet and sour fish and so far so good.  \n\nCom early and grab a table, gets quiet busy during lunch time.  Or call in for take out.\n\n3.5 Stars", "author": "Veronica N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-25", "description": "Told us takeout would be ready in 10-15 min. We showed up after 20 min and they hadn't started making it yet. They would not give us a discount, nor would they deliver (we proposed leaving & have them deliver it when ready).\n\nMuch like newspaper correction departments, we regret the error. Mission Hunan, apparently, does not.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "In a very spur of the moment decision, my boyfriend decided that we should get a roast duck for Christmas Eve dinner. We had been walking around in the Mission, and a quick Yelp search reveals this place. They have roast duck. We order some spicy green beans and rice to go with it, and they also give us complimentary corn soup. We take it all to go. \n\nWhen we get back to the apartment:\n\nMe: I could've sworn I said we only needed two bowls of rice...this is an entire to-go container of rice. \n\nAnd then later...WTF they gave us the duck head?? AND neck? Should I have specified that I wanted the OTHER half of the duck? \n\nThe corn soup was so good though. It had egg in it and probably corn starch but it was what I needed after a day of walking around in the cold rain. The green beans were not spicy at all and in fact were kind of greasy, and so was the duck. But the flavor wasn't bad. And there were huge portions of everything. I think all of it was $20. Talk about a value meal.", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "Ordered the seafood chow fun for 9 bucks. Got an enormous platter of chow fun loaded to the brim with prawns, scallops and fish. Probably the best Chinese food I've had in America thus far at this value.", "author": "Amitabho C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-02", "description": "Alright so I gotta admit, I was skeptical coming here. This area of SF definitely kind of creeped me out. This was one of the few places we saw on yelp that was cheap with decent reviews.\n\nI reluctantly walked in but was surprised to be greeted by the server (I'm used to fast asian service with no greeting). She was really nice to us and polite! I ordered mongolian beef over chow mein while he ordered sweet and sour pork with rice.\n\nThe portions here are RIDICULOUS. I love carbs. Meaning--I always finish any type of chow mein platter I order. But nope. I ate about half and filled a togo box with the rest. It was SO HUGE AND DELICIOUS. I was scared the sauce was going to be too sweet. She assured me it'd be spicy and tasty and it really was. The sweet and sour pork was cooked perfectly. There was just enough crisp on the meat as well as sauce.\n\nI was really surprised at the service I got and huge portions for small prices. If I'm in the area, I won't be  hesitant one bit next time!", "author": "Enza P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-05", "description": "You must be aware of this restaurant... I'm a contractor and I always buy food for my crew all over the city and there's been like three times already that I found thinks in the food when I eat there ...\n1 st time- a  round used bandage I think it fells from the finger of a cooker.\n2nd time- there was a family with a small dog and they ask for a high chair for it and the waiter give to them so the dog can reach the table.... You think is ok??\n3rd time.. I found a long hair in the fried rice\n4th time... There was a small hair in the sweet and sour chicken and it looks to me like a pubic hair... That was so disgusting and nasty.... Please don't go there...", "author": "Adan V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-27", "description": "I had been here once before and had a very lackluster lunch special, but on the recommendation of a friend who claimed there was good food on the Chinese menu I gave it a try again. Big mistake.  \n\nI came with a friend who spoke Chinese to ask the waitress what was best on the menus. Ended up ordering two dishes: a lackluster but edible short ribs with black pepper sauce and a completely flavorless Hunan crispy chicken. \n\nI was disappointed in myself for giving it a second try, left hungry, and have no intentions to go back ever again.", "author": "Nolan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-08", "description": "Mission's best kept secret, a seemingly dumpy Chinese joint right next to a Burger King right off 16th St. BART.\n\nNo, it's not Mission Chinese where progressive technique meets Chinese food. If you want something like that, just GO to Mission Chinese. Don't expect it here!\n\nYes, it's affordable ACCEPTABLE Chinese food that doesn't make you feel like shit or thirsty. Although, you can totally get that feeling by ordering all your favorites and classics: Sweet and Sour \"Insert-Meat-Here\", Mongolian \"Insert-Meat-Here\", Orange \"Insert-Meat-Here\", or General Tso's \"Insert-Meat-Here\".\n\nThey still have all your crowd pleasers.\n\nAside from that, here's what's good here if you want some tasty Chinese:\n\nHunan Crispy Chicken\nBraised Garlic Eggplant\nHong Kong Crispy Noodles with anything\nANY Claypot dish\nDry-cooked String Beans", "author": "Charles L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-05", "description": "Rating them here relative to other Chinese places. \n\nCan't beat a cheap Chinese lunch special, but the selection here is pretty tragic for vegetarians or those of us who like to pretend to be one. Food was fine but entirely lacking in any spice or interesting flavor aside from the mountain of rice and pile of sweetened veggies. \n\nUpside is unfailingly polite service and, again, the absurdly cheap price. Hard to get too upset when you get this much food for so little of your hard earned cash.", "author": "Scott T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-09", "description": "Great price with GREAT portions! You can't go wrong with anything on the menu! Definitely satisfies all my need for Chinese food (and believe me, since I've moved to Socal, my need for Chinese food is practically insatiable!)\n\nIf you're looking for authentic Chinese food with a great price tag-- make sure you check out Mission Hunan Restaurant! If you can get there on time, be sure to get their $5 lunch special! Great deal! \n\nP.S. Four stars for food and price-- the extra star is for the friendly staff!", "author": "Tiffany U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-08", "description": "I go to Mission Hunan all the time especially for lunch. They have this amazing daily $5 three-entrée lunch special (usually soup of the say, a meat entrée, and chow mein or fried rice.) They always offer complimentary soup to their customers, which is definitely a plus! This restaurant has been around since forever. I grew up in San Francisco and believe me, this place is one of the only great hole-in-the-wall Chinese restaurants that serve AUTHENTIC VERY AFFORDABLE Chinese cuisine in HUGE PORTIONS still around. The staff is always friendly and efficient. Parking is never a problem because they have a parking lot behind the restaurant and the atmosphere is rather up-beat and comfortable. \n\n I try to eat healthy, as in less oil and salt, and this restaurant is more than happy to accommodate my needs. They actually insisted on remaking my order once because it was too salty. I love their veggie dishes and they make it in every form possible--stir fried, steamed, boiled in chicken broth, etc.  My favorite dishes are the braised beef rice noodle soup with bok choy, their salt and pepper baby beef ribs, and their shrimp chow mein. Everything on the menu is pretty tasty and I've never left unsatisfied!", "author": "Ellen W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-24", "description": "Omg I'm sick with a high fever so I decided to come here to get some chicken wonton & lemon chicken... 1st i was rushed while lookin at the menu & the wait was almost over 30mins.. When I got home to eat I was disgusted to find little plastic wraps in my soup & now sacred to try the lemon chicken.", "author": "Gerrick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-11", "description": "This is a great place especially in this area were there is shop after shop of Chinese food around here. I like there chow main it's the best. And the last times I ordered there potstickers it was missing flavor but this time it was great and the workers are very friendly. I'll only come here for my chow main I have others place I go to get the rest of my items.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-21", "description": "\"The soup is wonderful\" and it's a bowl, not just a cup! Very fresh ingredients and most importantly, the staff is wonderful! \n\nWe try to get here at least once a week (Sunday) after the Alehmeny Flea Market. \n\nTheir service has always been great...they say as we leave: \"See you again next week\" and they remember our favorites. The flavor has greatly improved over the years, too!", "author": "Drew P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-25", "description": "This place is the most American of American chinese food joints. Meat is tenderized beyond comprehension. Sauces are thick. Noodles are too soft. Broths are one note. They also seem severely understaffed. Probably won't be coming back.", "author": "Debbie Chiou S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-02", "description": "I love comming here, this is also one of my moms favorite places to go too.. there portions are great for little amount of money.. This is one of the main places we come to if we want Chineese. Love there soups, LOVE the Seafood Wonton soup, and combination Won Ton, we always get the Chicken Vegitables, and steamed rice.. Oh, another thing, there rice. a Small, is litterally the size of your soup bowl.. a mediem, will sometimes look like a Large, and .. well we never order a Large, since were never that many people.. Though, if you plan on going on your own, becaureful, because they do serve a LOT of food on one plate, theres no changing the size of the plate-- \"One size only\".. I go there once in a while for lunch, I've ordered a Chowmein with Chicken Fried rice, I felt that the plate was big enough for 2 people.. maybe 3.. but it was only $8.75. Not bad right? I guess you can always save the rest for dinner, or your tomorrows lunch. I've recently tried there Sweet & Sour Tilapia, and it's really good, my new favorite. though I think I'd like the Tilapia without the Sweet & Sour sauce, it's a little too sweet for me, and sticky.. but its good.. They have your basic sodas; coke, sprite, orange, etc, Snapple, if you want water, it's better to order the cup of water with ice, because they charge you for a bottled water, they have your basic beer, Coronas, Heniken, Tecate(I think?) etc. for about $3..\n\nthe service is pretty good, they sit you once you walk in, if theres a place for you to sit..if not the most you'd wait is maybe a minute or two. once you sit they give you their menus.. and give you about 5-10 minutes to look through it, and then come back and ask you what you'd like to drink, and if your ready to order.. the usual wait time for your food is about 6-10 minutes, depending on what you ordered.. you can ask them for tea while you wait.. or just to drink with your meal. I guess you can say were regulars, and know how they work. I would recomment this place to people, if your looking for a satisfying cheap Chineese meal :)\n\nOH, and also, if your looking for parking, my mom uses the parking lot from the walgreens, it's behind the bar next to it.. :) and there's always street parking.\n\nBut overall, there food is really good.. for a great price.. \nIn my opinion, It's worth it. and we continue to come here.", "author": "Mariana O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "Yum!\n\nWe found this little place on Yelp when another place we went to was closed for the holiday. \n\nWe started with the chicken wonton soup and it was so delicious.  Lots of flavor and tons of chicken.  The medium bowl was plenty for the two of us.  I was full before our dinner got to us.\n\nWe ordered sweet and sour pork and mongolian beef.  The pork was light and the sauce had the perfect amount of kick to it.  The mongolian beef was ridiculously tender.  We'll definitely be going back.", "author": "Autumn B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-02", "description": "After checking out the reviews here, I decided to give this place a shot. It seems the lower-rated reviews were the ones that were more accurate.\n\nI had the combination chow mein and the pork won ton soup. While the portions for both were huge, the chow mein was disappointing. The taste was bland and the noodles were a bit too greasy. That and the lack of vegetables (which I'm used to in a chow mein) did not give me a good first impression of this place.\n\nThe soup, on the other hand, was much better tasting. Lots of dumplings and barbecued pork.\n\nI'm giving this place 2 stars, mostly because I've had much better for a lot less (total came out to a little over $13 for both). Try someplace else.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-10", "description": "Came here for lunch today with some coworkers since we were all craving some delicious Chinese food.  Did not disappoint at all!\n\nWe each ordered a lunch special, Tomato Beef, Chinese Broccoli Beef, and Mongolian Beef.  They were all very delicious and tasty!  Since we all ordered a different kind of beef, you can really try the different spices this restaurant can create.  \n\nIt's located in a very convenient area, so it gets really busy during lunch.  Good thing we got there before the rush!  \n\nThe staffs and the boss were all really kind and attentive.  Their lunch specials came with a bowl of soup, and I certainly finished mine!  Our portions were all really big, so we all ended up packing half of it to go.  Dinner tonight!", "author": "Nancy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "As a restaurant, the food is good and cheap. What separates this from Red Jade and Big Lantern (which just reopened on 16th street) is that it seems a bit more authentic. It has a large following of actual Chinese customers, which i find to be a rarity in authenticity. A large percentage of their deals are written in Chinese on pieces of paper on the walls and not in the menu. The food is cheap and the staff is friendly, even as they are rushing around the room.\n\nCriticism: I closes at 8 pm, so no chance at late night dining.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-11", "description": "Order for pick up and got 3 out of 4 orders wrong. On top of that I had to pay extra. Food is super greasy and bland. The service definitely sucks and waited nearly 45 minutes!", "author": "Tony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-22", "description": "authentic chinese food to satisfy those cravings!\n\nI was starving when i walked in and wanted my food ASAP... but when i opened the extensive menu, it took me a while to finally decide what to order (i'm indecisive!). They had all the staple Chinese dishes which confirmed its authenticity... but confused my hungry tummy&brain! I finally decided on a beef noodle dish that hit the spot! i even had leftovers to bring home. The prices are definitely affordable, perfect for a college student like me. \n\nan additional plus: the service is friendly and fast. it's definitely family-owned, which made me feel right at home :)\n\nall in all, no frills chinese food: authentic, affordable, yummy!", "author": "Erica L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-06", "description": "Bleh - not bad if you're despirate for some Chinese food. I'd rather save my money and go somewhere else.\n\nSizzling rice is bland - taste pretty oily.\n\nSeafood soup is tasteless.\n\nUnfortunately this is all I really have to say about this place.", "author": "Andy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-02", "description": "I found this place by accident as I was trying to find another Chinese restaurant. The food is good to what I assume is very authentic since I usually don't go past my comfort zone for example chicken w/ rice. The food is well cooked, very good, priced fairly, and anything on the menu is also good.", "author": "Nathan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-10", "description": "This is now officially one of my favorite Chinese restaurants in the city. I was more than impressed after coming here. Considering the super affordable prices, I was amazed at how huge the portions were! I went in with a friend and ordered two entrees, fried rice, and soup.  All of the ingredients were fresh and cooked to perfection. Everything was delicious and the other people dining in the restaurant seemed super pleased with their food, too. We were stuffed at the end of lunch and even had leftovers to last us through dinner! \n\nService: ON POINT.  Friendly staff and food arrived in a timely manner.\nPrice: Very affordable!\nPortions: Huge. \n\nDEFINITELY will be returning the next time I have a hankering for Chinese food, especially for the lunch special!! It sounds amazing!", "author": "Helen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-17", "description": "One thing I love about the place is the huge value each of your dollar bills have!\n\nYou can eat a roasted duck over shrimp fried rice or showmen, have some soup with your meal and get a can of coke all for $8.15... \n\nThe food quality is good too, service is quick and there is always seats inside, parking in the Mission? Yes, the metered parking in front of the restaurant and street parking on Capp street almost always available.\n\nIt's one of these places where you're leaving satisfied with a value and quality even though sometimes it's a little harder to communicate than wanted.", "author": "Veronika A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-02", "description": "Huge portions, decent food, and cheap. So I'm a fan. Some of my favs are: salt and pepper pork, mongolian beef, and braised eggplant. They're all really good! One thing I'll never get again and that you should never, EVER order is their beef stew clay pot. It was basically huge chunks of fat and cow veins. Yes, it was as disgusting as it sounds. Everything else we've had has been a winner though.", "author": "Elise A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "I love this place!!! :-) The food is hot, fresh, and comes in nice portions. I really like the Mongolian beef and korean chicken. So much flavor. The people that work there are really busy but very nice. Makes all the difference! I will keep coming back.", "author": "B W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-26", "description": "This place is great! Right next to BART, and super authentic. We were in a group of 8 and ordered family sized portions of fried rice, chow mein, lemon chicken, and Mongolian beef. I ended up taking 3 boxes of leftovers home. The food was served quickly and tasted amazing. With all that, some soup, and drinks all around, the bill was only $60!", "author": "Karen G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-09", "description": "So I hate to give two stars to a Cheapo-Chineese joint, but their lunch special was pretty bad. It was salt and pepper spicy shrimp, chow mein and soup of the day. The shrimp were deep fried in full with the shell and zippy flavor soaked through. So basically, it was a plain shrimp once I got done greasing up my fingers to get it. The chowmain was bland and needed lots of soy sauce to eat. The soup was ok. \n\nOn the plus side, the service was very friendly and that's the only reason I feel bad giving it the two stars I'm giving it.", "author": "Greg G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-16", "description": "I came here for takeout on a Friday during lunch time and the place was PACKED - always a good sign.\n\nMy sister and I ordered:\n\n- salt and pepper pork chops - a little bit doughy but still yummy and not too greasy\n- spicy green beans - a little soggy for me and not spicy at all\n- steamed rice for 3 people -  which ended up being enough rice to feed 6 hungry people AND leftovers\n\nFor the price I guess this place is decent.  Plus their lunch special is RIDICULOUS - $5 for soup, vegetarian fried rice or chow mein, and the meat entree of the day.  WOWS.", "author": "Kim-van T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "As far as us Asians go, this is the best On The Go Restaurant in SF, they have great food, fast service, and alot of different foods to chose from. Their Chefs there are highly trained, and great cooks. When I go there to eat I'd always get there Lunch Specials. Awesome Restaurant!", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-18", "description": "great hole in the wall - amazing service for what it is, TRY THE SALTED PORKCHOPS - very very very very good.\n\nalso soups are very large and filling and tasty. ask for the house tea", "author": "Patrick P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-24", "description": "16th street mission...next door to burger king...mission hunan sits...appearance clean 'n' tidy....cravin' a quick take-out meal.....standard variation of mandarin and cantonese cuisine...addition of roast ducks, bbq pork 'n' spareribs...clay pots 'n' rice plates too...\n\nseemingly standard...yet...taste leavin' a sour note...found the taste 'n' smell of the oil in the dish...displeasing...slightly grimy to the palate..", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-20", "description": "I love this place! A friend of mine went here today and i was telling him that i pass this place almost on a daily basis but never really paid attention to it because it's part hidden and right next to a produce market + it looks quite dingy from the outside. A typical Chinese greasy food place but really good chow if you're in a hurry and a No Nonsense service. their prices are bit on the pricey side but since this place is been in this spot for the longest time more than i could even remember, you know you need to make a profit knowing this place is good and it's been here that long. My friend ordered a large hot bowl of won ton soup and when it came it was the size of a toilet bowl...I nearly fell off my seat because i cannot believe what i'm seeing how big that bowl of soup is! Me my friend and probably 2 more other people could eat this soup bowl and would still be full. i ordered a Beef w/ scrambled eggs over rice and it was it when it came in even though this wasn't in the menu.My friend told me that these people will actually cook anything you want, just describe it what it would look like when it's cooked and they get it right. I think i now have my NEW old standby place and this is basically 30 yards from the 16th Street BART station right next to the Burger King. This place accepts PLASTICS (Debit & Credit cards) w/c is a big plus for me & the 2 girls serving you is excellent but always in a hurry but their service is great and they never complained.Expect to wait a bit when it's lunchtime and their menu is substantial. Vey good chow and the service is excellent & no complaints here, i would mind going to the city just for this riding my bicycle because it's so easy & accessible...", "author": "Joel A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-01", "description": "Authentic Chinese?!?! Really? Umm... This is American Cantonese slop, which is about as far from Hunan cuisine as you can get without going to McDonald's. It is as cheap as McDonald's, but this doesn't necessarily explain why you get what you get. While running the risk of offending other Yelpers, I dare say that those who deem this \"authentic Chinese\" might consider taking a trip to China before you making such declarations. A little background in Chinese and specifically Hunan cuisine seems to be in order.\n\nTraditionally (which is measured in millennia), there are four primary cuisines of China: Guangdong (aka Cantonese), Huaiyang, Shandong, and Sichuan.  This is common knowledge to all Mainland Chinese people.  However, they are also well aware of the more recently added fifth primary cuisine - the cuisine of the people and their immortalized leader - Hunan.  \n\nChairman Mao hailed from Hunan, a central province of China know for cooking and eating the spiciest of all Chinese food. That's right, even the hotter than Sichuanese.  However, there is more than just spice in Hunan food.  For example, no self-respecting \"authentic\" Hunan restaurant would leave Mao Shi Hong Shao Rou (pork Chairman Mao style, which is savory-sweet) off the menu. It just wouldn't happen. Unless of course, the people running the restaurant were in fact not Hunanese.  And herein lies the crux of Mission Hunan.\n\nThe staff here all Cantonese and the owners are either Cantonese or Taiwanese, as evidenced by there use of tradition Chinese characters, as opposed to simplified.  In addition, any \"authentic\" Hunanese restaurant would have red chilies hanging from multiple locations throughout the restaurant, or at least one near the door way. This is an auspicious symbol and one that is not taken lightly in Hunan. \n\nNow that authenticity has been dealt with, how about the food?  After not recognizing a single traditional Hunan dish on the menu, I ordered the \"Hunan Crispy Chicken\" for lunch. I was served a plate of poorly fried chicken smothered in oyster sauce with a side of steamed broccoli and rice. This is barely worthy of being called crappy Cantonese food, let alone the broadly defined crappy Chinese food. So, I ate my food, paid my $6.30 + tip and left.\n\nUnsatisfied and somewhat annoyed at the audacity of the owners and staff to so blatantly disrespect what is perhaps one of the finest Chinese culinary traditions: Hunan caixi.  The Chairman would certainly roll over in his grave if he knew what these people were doing in the name of his beloved cuisine.\n\nHunanese should be cheap, spicy and delicious. This place is definitely cheap.  If you are on a budget, have at it. But remember, there are plenty of other delicious cheap eats in the area. I suggest move on.", "author": "Alex P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "The food was good (but not great). The portions were good, service was great, and the prices are really reasonable. It's a good neighborhood Chinese spot. Nothing more.", "author": "Damien P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-12", "description": "No stars. I waited (foolishly) a half an hour for togo egg rolls and a large white rice. I heard the woman tell at the kitchen before I asked so I think it was the kitchens fault for putting my order behind those who were dining in, even though I had been there before them.", "author": "Andrea J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-21", "description": "The golden rule of being under $10 and satisfying can be observed here. Healthier than Bugger King next door. Also, no yups or hips. Real.", "author": "Mag N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-23", "description": "I really love this little place. This place epitomizes small, family owned, hole in the wall resturant with delicious food. Everything is super greasy but it only adds to the flavor.", "author": "David F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-15", "description": "I've been eating at Chinese Restaurants all over San Francisco for 55 Years and Mission Hunan is one of my favorites. They have quality, great tasting dishes piled high with the freshest food for a low price. They even serve a free bowl of house soup with every rice plate. Being located at 16th near Capp you would not expect to find such wonderful food. Check it out, you'll be pleasantly surprised!", "author": "Mark G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-03", "description": "I was very pleasantly surprised with this place! I had thought \"Chinese restaurant on the Mission? Mehhhhhhh.\" But it turned out to be pretty good stuff!\n\nI had the beef chow fun to go and the portion was huge! The only word to describe the manner in which one must eat a meal so large is \"laboriously\". And it was really, really good! Some of the best beef chow fun I've had, in fact. For 6.90 it made a delicious lunch, dinner, and lunch for tomorrow. \n\nI guess someone ordered extra soup or something so they had a few bowls left over and I got one for free!\n\nService is fast and friendly. That one girl with the helmet head hair that appears to be running the whole damn place is awesome. \n\nWill DEFINITELY be back to try the panfried noodles.", "author": "Polly F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-31", "description": "I very love to go this restaurant. the food is really great( like Hong Kong Style). Also the service are very nice everytime i go there!!I usually go there at Lunch time..usually is quite busy ..the food is very delicious and no expensive!! \nI hope u Try it ...", "author": "amy y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-17", "description": "Not a vegetarian friendly place, just like many other Chinese restaurants out there. The portion is really huge. Food is okay. Waitresses are nice and fast.", "author": "Shirley W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-23", "description": "I'm not sure why Mission Hunon has a bad rating.  It's incredible food for the $5 lunch special.  Anyone who is going to whine about that is insane.  The staff is very friendly, and while the tables aren't exactly new, I've never found the restaurant to be unclean.\n\nSoup is great.  Entree's are damn good, and I honestly can't explain the poor ratings.  I think some people can't enjoy a meal unless they pay a premium for it, and convince themselves it's fancy.", "author": "Steve T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-24", "description": "i use to past by this place and always said i'd give it a chance. And that chance came, it was during Lunch Time. And i was surprised to see they have Lunch Special under $5!! its a 3course lunch too! for example that day it was Vegetable Fried Rice, Orange Chicken, and some kind of Corn Soup which was SOOOO GOOOD!! Alot of food for $5 bucks right! Staff are friendly and try to help you asap while trying to help there tables too. It did take awhile to  get my food, but i also learned u can call in for pick up and they'll have everything ready for when you arrive! Give this place a chance, Call in ask for their luch Special or  anything!", "author": "Silvia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-24", "description": "I live just around the corner from Mission Hunan. - very fortunate!  There are many things not on the English menu.  I've tried them by asking for them and by looking at what the Chinese work crews order at lunchtime and pointing.  I LOVE the beef stew clay pot.  I always ask for extra tendon.  If you're not familiar with \"beef stew\" at Chinese restaurants, it refers to the cut of meat - namely chuck and beef tendon - yummy!  They will combine any ingredients you ask for.  I like lop chong (Chinese sausage) and scrambled eggs.  I like bitter melon and beef stew.  I like the moo-qua (my spelling) with garlic sauce.  You won't find these on the menu.  The only thing they wouldn't make for me is pork fat back and oyster clay pot.  I have to be content with the roast pork and oyster pot - it is delicious.  The only way to get the fat back is with mustard greens.  They also have \"Chinese soup\" everyday as well as the soup of the day.  Try it on a day when it's tender greens - excellent!  One of their soups du jour is beef vegetable.  This soooo good!   I also get an extra order to go.  Love the Mongolian chicken as well.  Try it.", "author": "Ron A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-25", "description": "Could be cleaner.  Great prices.  Great soup.  The food is greasy like all Chinese food.  It's half a block from where I live so I visit this place when I'm craving Chinese food and am on a budget.", "author": "Stephnie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-04", "description": "Hole in the wall, good food, not the best I've had...the orange chicken was ok, I was bummed.  Not the place for me, but definitely give it a try.  The tank of fish definitely threw me off, but was cool!", "author": "Allie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-31", "description": "Each time I am in the mood for Chinese food and around Mission, I would stop by Mission Hunan. My favorite dish is their wor wontons, which include shrimp, chicken, veggies, and wontons. The people make their own wontons daily, so they taste very fresh. Their other great dishes include this salt and pepper rod cod. I am not sure if it is on the menu, but they are more than happy to customize the orders for you. As someone who is on a low-sodium and low-fat diet, the waitresses there understand my needs and would steam all the entrees for me.\n\nThe place is usually quite busy during dinner and lunch times, but once the waitresses got your orders, it is pretty quick for the dishes to arrive. Another note is that the customer service is very good. The waitresses there are very friendly and trilingual in Chinese, English and Spanish.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-19", "description": "This place is good. Your typical Chinese fare. Not wonderful but it is down the street from my work. The portions are large, service is fast, inexpensive and always good quality. Good for a quick Chinese fix at lunch!", "author": "julie q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-02-09", "description": "On the wrong side of the Mission street tracks lies Mission Hunan. Authentically unhygenic (you dont want to hear why I say this).  The food itself is good, not authenic, but good.  I usually order the X on rice to go.  I sat down once for a bowl of roast duck with noodles.  I was close to authentic and I believe they use the very local fresh noodle supplier, I was pleasantly surprised.", "author": "H C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-26", "description": "yummy indeed. it's probably not popular among yelpers because this restaurant sits on the wrong side of town. it's only a block from the restaurants in valencia, but if you don't come here cuz it looks seedy, you're missing out. \nanywho, it's one of the tastiest chinese food i've had. it's dirt cheap, and the portions are enormous. it ain't that clean, but i didn't see any unwanted species on my food. i did look hard. and i did get a fortune cookie. i'd go back there again!", "author": "Jen R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-28", "description": "Did not like at all. appetizer came out after meal. Both were gross. This is especially not the place for a vegetarian to eat.  All the entrees were cooked in meat grease. eww.", "author": "mindy w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-12", "description": "The food at Mission Hunan is so very average-almost repulsive actually-no taste etc.  the staff are usually friendly and the service is quick.  the neighborhood is a bit shacky with open drug dealing, public urination, and addicts talking to themselves between fixes but thats just the way it is--good or bad.  I have gone there on occassion just because its simple, clean and I am usually hard pressed to change my predictable ways.\n\nSince Valencia Sreet and 16th Sreet are getting much nicer restaurants- and because one of the waitresses DEMANDED that I leave a tip  on my last visit 10.07 I will not be going back.  Yelling after the meal is paid for in full demanding a tip is very unusual.  With my nephew about the see a spike and mike film across the street is unacceptable.  Seeing the place as a convient location before the film, and being set in my ways is not a good reason to go to a crappy restaurant.  I speculate the wait staff  at Mission Hunan have made friends with the local street addicts to pull in customers and have begun stealing their drugs.   \n\nLook at the place when you walk by.  The waitresses look unhappy and very tired.  Compare Mission Hunan to the newer restaurant scene in the area and you see a happier, livelier crowd eating good food elsewhere.  Don't eat at Mission Hunan.  You owe it to yourself.\n2 good restaurants I recommend are:\nSunflower Authentic Vietnamese\n506 Valencia St\nSan Francisco, CA 94110-1115\nPhone: (415) 626-5022 \n----------------------------------------\nBangkok 16\n3214 16Th St\nSan Francisco, CA 94103\nPhone: (415) 431-5838 \n\n  Mission Yelper", "author": "c g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-04", "description": "Dirt cheap,decent portions, did seem rather greasy. And no fortune cookie.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-09", "description": "I enjoyed going to the restaraunt for a long time becase their food was pretty good. I enjoyed their huge wontons for the wonton soup, I like their sweet&sour chicken (when it's piping hot) and their combo fried rice is tasty. The prices are cheap and the portions are generous. \n\nHowever I wouldn't go back there if they did what they did to me two weeks ago with my family. We just finished lunch and we were about to pay the bill. My parents don't have a lot of money and they intend not to spend like they do. They stopped us at the door and DEMANDED that we give them a bigger tip because we were a party of four. My dad was mad at first on what they were talking about, he thought that we had under paid and when we checked the money he gave them it was the correct amount. When he found out that he was asked to give a bigger tip he just walked away in anger and disgust that they could ask something like that. We had been going to their restaraunt for a while and they had never asked us for more tip. My mom out of embarrassment just gave an extra dollar because that was all they had.\n\nFirst of all, it didn't say ANYWHERE on their menu or a sign in their restaraunts that parties of four or more HAVE TO PAY a bigger tip. If they do continue to do that, they are just being desperate for more money. Also I think tips should be earned by the quality of food and service you get, and honestly their service and attitude wasn't so great when we ate there. \n\nI like thier food because it's tasty but I just wished they would have a better attitude.", "author": "cecilia s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-09", "description": "one of my favorite chinese restaurant in the city, definitely one of the best chinese food in san francisco and guaranteed cheap and tasty, tried their korean chicken, hunan crispy chicken,salt pepper fish fillet and lots more..... i dont mind the waitresses  coz i dont eat them, try to smile with them and surely will smile back.", "author": "jack s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-21", "description": "Excellent quality chineese food. I am eating a  chicken brockley rice plate.  Very flavorfull, good portions, fresh and cheap. Don't let the the location keep you away (16th @ capp).", "author": "mark g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-01", "description": "Really a 3.5 for the food and value.  This is pretty darn close to the authentic Hong Kong style eating hall that would often host large parties and family banquets. The food is what you are here for and not much else, unless you speak Cantonese- then it's like you are in-the-loop and the staff get very chatty. The decor is plain, simple and practical, with the standard feng shui fish tank w/ gold fish and koi- signs of good fortune and of course the obligatory plastic plant, the bathroom is disappointing so you're best off doing take out. The service is also very much operating at a no-frills but efficient level- your dishes will land promptly and loudly on the table. If you know your way around the menu then you can't go wrong, and the portions are generous. The shrimp wonton noodle soup, chicken, pork, beef and seafood stews are deelish, i usually order the BBQ pork (char-siu), and tao mui (pea sprout stir-fried w/ garlic), and the ginger scallion chicken. The tofu and mushroom veggie stews in clay pot are also great choices for the summer evenings when you are in the Mission and have a craving for Cantonese style cuisine but don't want to trek all the way out to Chinatown.", "author": "Akash D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-05", "description": "This place hooks it up for the lunch special. The ladies here are always nice and super friendly. The food comes fast, hot, and plentiful. when i have 6 dollars to spend for lunch. I come here, mostly because its around the corner. But whatever, I'm down for some of their pork fried rice anytime.", "author": "roberto g."}
