{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "Don't expect to be wowed by the interior; just know that service is friendly, and food is made quickly. Plenty of street parking in the neighborhood. \n\nOrder and pay at the counter, and your food will be brought to you afterwards. There's a good amount of indoor seating, but there's also a few tables outside as well.\n\nI've tried the crepes, bagel sandwiches, and burgers, along with the carrot juice, and have not been disappointed. This place is my go-to breakfast joint when I'm in the neighborhood.", "author": "PaHoua L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "This is a great place for lunch!  Flavorful food, pleasant service, and a casual, clean setting.\n\nOur group of 5 adults, 2 kids, and 1 infant in a stroller was welcomed and accommodated.  The menu is diverse, and our group enjoyed savory crepes, burgers, and falafel.  The food was fresh and tasty.\n\nThe service was polite and friendly.  The set up is such that you order at the counter, and your food is then brought to your table. \n\nThe space is reasonably spacious by SF standards, simple, and clean.\n\nOverall, this is a great, family-friendly spot for a casual meal!  I only wish it was open for dinner!", "author": "Barnali D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Fantastic apple and cinnamon crepes are served and enjoyed here! The place clean and organized!", "author": "Gabriel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-25", "description": "Veggie delight friendly here!  Cafe and you pay at the counter.\n\nMy friend and I went here after a healthy hike to Mount Davidson and Bernal Heights hill.  She needed her veggie diet because her doc said that she needs to control her cholesterol otherwise it can spiral out.\n\nTo support that regime, I ordered up the Mediterranean platter and she ordered the garden burger.  I went out of the way to not get mayo in hers.  It was great!  I felt filled up with fiber and heartily full (as in not bloated and heavy). \n\nBesides the veggies, they have the meat and brunch plates!  Straightforward and good to grab light eats. \n\nIt was delightful and happy Friday!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Little disappointed because the prices on the website and paper menu are different than what they charge when you get there.\nPrices a lot higher than advertised.", "author": "Otto N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-15", "description": "Great neighborhood spot. Easy menu. Easy parking. \n\nCame here for brunch around 10am and it wasn't busy at all. The menu is very limited for breakfast but simplicity makes it easier to pick. They also serve sandwiches, crepes, wraps, and soups along with espresso drinks. The menu is written on a chalkboard and you order before sitting down. \n\nI got the combo #2. It has 2 pancakes, eggs, and choice of sausage or bacon. The presentation is simple, but the food is good. \n\nDef will come back and check out their burgers and lunch!", "author": "Junella T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Once again, great food, but it's self-service. Order at the registers.\nNot a fancy joint. but you will eat well:)", "author": "Oly P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Yummy Combo Crepe: fresh strawberries, bananas, Nutella AND whipped cream. The staff: friendly and fun. I was here at 8am so it wasn't crowed and the vibe was mellow. Definitely will come back to try the rest of the crepes.", "author": "pip t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-01", "description": "Yummy crepes and friendly service! These guys remind me of Crepevine (but not as good). The owner is super friendly and service is quick & efficient. The food, however, is just \"ok\"... (not bad, but also not great). \nThe pricing is consistent with SF restaurants. My favorite thing about these guys: they're open during lunch all week (unlike several restaurants on Cortland).", "author": "JonJon W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-25", "description": "I had a less than satisfactory experience at this place. I got a CITRON CREPE to go because I just wasn't interested in sitting down. (Yet again I am after Skymiles.) Takeout food tends to be subpar. But that does not explain why the crepe they gave me was clearly burnt and poorly made. I did have to wait awhile for this one crepe and maybe that's why it was burnt. They probably left it in the pan too long which is pretty careless. The cafe wasn't even busy when I was there around 4. Not worth the $8.", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-08", "description": "I typically go to Martha's across the street, though I give this one a try every few months. Without fail, the ingredients, especially vegetables, are not great and always a little soggy or brown. I just ordered a Greek salad and pointed out all the Romain was browned and gone bad. They made another, though they didn't apologize, and they seemed confused as to why I wouldn't want to eat brown lettuce.", "author": "Stanford G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Amazing cafe in the Bernal Heights neighborhood. I love coming here because the service is great and food always comes out fast and delicious. They have an extensive menu. They offers salads, vegetarian friendly dishes, crepes (savory or sweet), scrambles, omelettes, sandwiches, burgers, bagels, sides (their house potatoes are my favorite), breakfast combos, coffees, teas, juices, smoothies, you name it. Restroom for customers is always clean. Fun music playing throughout the day. There is plenty of seating inside or if you'd like you can sit outside and take in the fresh air. I love bringing my family and friends here when they visit me. They always leave happy and full. Highly recommend this place!", "author": "Cristal F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "Good tasty food and not monster portions! Nice interior, but nothing special. Service was simple and direct. The person behind the counter was responsive to customers. I'd come back here again.", "author": "Christopher D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Classic spot in Bernal with the nicest people. Great outdoor tables where you can enjoy the sun and the best neighborhood in SF! Most of their specialties are breakfast-focused, and some solid crepe options to choose from. I like the combo with french toast, bacon, and eggs - will leave you full all morning. You can also come on a Wednesday night for a comedy show (happens once per month)!", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "Absolutely adorable!! Super quick, fair priced and delicious! Great area too to walk around.", "author": "Nickole B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "Awesome place to eat. Great food really tasty and on point. Just a bit expensive for me.", "author": "Julian B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-14", "description": "I have eaten here multiple times. This cafe is in a great location with lots of choices on the menu. Today I ordered breakfast and the owner bragged that the pancake batter is made fresh every morning. I tried them and I can easily taste the instant (just add water) pancake mix. I guess I was expecting some sort of homemade recipe? On top of this, the pancakes were cooked on the same grill that handles every other meal, so they sort of tasted like turkey burger. There is no real presentation on the dishes. Avoid the breakfast.\n\nI would definitely go back here for lunch as the burgers and Gyros are good.", "author": "Philip D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Love this place! Nice people great service and the Chicken Salad Sandwich is the best!! I've been coming here for years. I even have a friend that comes here from Tracy just to have the Chicken Salad Sandwich.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "This is one great place to have brunch. So much to choose from the enormous menu.  Cafeteria style order, you get a number so you can save time not having to wait for your waiter to come by. You can choose where you want to sit. The food comes out hot. I had the Spanish Omelette with home fries and wheat toast. The best is fresh squeezed orange juice, that was sweet. Plan to go back and try other things on the menu.", "author": "Irene T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "The middle eastern food is excellent. I always get the falafel in a pita. It is not a deal nor is it over priced. If I could make it at home I would.", "author": "Lance M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Neighborhood gem! Excellent tasting food, great variety, awesome strong coffee, friendly staff, just right! Keep it up...we'll definitely be back!", "author": "Lissette I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "I'm writing this from your corner table. I got really good service from Abraham today. I forgot my Yelp login, so I logged in with google to let you folks know. He was polite and thoughtful and attentive, and he seemed to really care that I left happy. Also, my eggs were perfectly over-medium, which is really hard to do, so shoutout to the dudes on the grill- tall guy with a cross necklace, less tall Hispanic dude with a plaid shirt and a good haircut. Well done y'all! PS Abraham just RAN and caught a lady who forgot her takeout- nice kid.", "author": "Rose L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Great Family Business. \nSam and family have fresh healthy breakfasts and lunches. I love the Healthy Start breakfast. The Ginger or Lavender Lemonade is a real treat. Check out the after hours venue. Tuesdays Child on Wednesdays.. The 3rd Wednesday evening of the month for local standup comedy, spoken word and music created by Sams son Azziz.  Fantastic.", "author": "Jeanne J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-15", "description": "Good quick breakfast and lunch spot.... tried almost all the breakfast styles and doing lunch today.... friendly staff and owner great location!", "author": "Paul D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "I was staying at a friend's house and thought I'd walk over to Cortland to grab breakfast while my friend was at work. I stumbled across Moonlight Cafe and thought I'd check it out since they had a pretty large menu and outdoor seating (it was a really nice day). \nI ordered an iced coffee and a \"Combo crepe\" which included strawberries, bananas, and Nutella. Both turned out to be around $13 so I would say for San Francisco, that's average. \nMy food was prepared in a timely manner, it didn't seem incredibly busy when I walked in so it only took around 5 mins to arrive at my table. The crepe was pretty good! With fresh fruits and chocolate drizzle, it's really difficult to mess up a Nutella crepe. The iced coffee was a smooth and bold cold brew, so no complaints there. It's also served in a chilled glass which was a very nice touch! \nNot really sure where all the bad reviews are coming from, I really enjoyed my experience here. Customer service was great, food was prepared quickly, and most importantly there was seating available!!", "author": "Tricia Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "Great tasty fresh food! Solid breakfast options depending on your mood. \nTry the Mediterranean platter, gyro, eggs Benedict, and all of the sandwiches.", "author": "Alex F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "Located in the Bernal Heights District of San Francisco, this shop has such a variety of tasteful selections to choose from. The shop is simple, nothing fancy, with a sumo wrestler look-a-like Buddha overlooking the interior.\n\nI ordered a bagel w/pesto, feta and tomato. You get a choice of bagel: onion, pumpernickel, poppy seed, plain, I chose an everything- I wanted it all! ...and got it for $4.75. \n\nWater faucet and cups available on the side. Service was good. Bathroom had a bunch of graffiti, but was clean enough to do what I had to do.", "author": "Jules B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "I absolutely love this place. This is my go to breakfast spot. The employees here as well as the owner always provide me and my boyfriend with great customer service. This is def. a mom & pop shop. They are pretty quick with the service. Whether you are dining in or calling in for take out, expect for your food to be done promptly.", "author": "Jenn P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "In town visiting family when we found this little place for breakfast. We both order the two egg plate with bacon and a cup of coffee. Everything was great! They cooked our eggs how we liked them and even did the bacon to order (one crispy, one regular). We sat outside and people watched. I'm glad to know that even you all in San Francisco hate to parallel park!", "author": "Amy V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-18", "description": "Taste: fine\nService: counter order\nDecor: none really\nPrice for quality: fine\nbeers: don't think so, nothing palatable at least\n\nJust stopped in for a quick egg n cheese sandwich, a no muss no fuss joint with some small tables. Easy squeezy one two threesey, on the cheap and quick. No problems, but nothing to write home about.", "author": "Dave H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "Great breakfast!  The service here was excellent. Very welcoming. The food was awesome as well as the coffee!", "author": "Ace B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "I've been here with my family three times in the past week alone! I recommend everything from their crepes with pinenuts to their french toast. Quick and yummy food, relaxed seating, extremely friendly customer service, all around truly a 5 star breakfast place!! Couldn't recommend more :)", "author": "Leila S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Gluten free bread (and bagels, and English muffins)! It makes me so happy! Super solid brunch foods and friendly staff. I ordered a western scramble with gf toast and potatoes and it was really good (the toast actually tasted like bread)! Super convenient to people near Bernal as it's right on Cortland. And then you can go work off the food with your dog across the street at fit bernal fit. :)", "author": "T P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "Ended up here for brunch with the smokin hot wife on the recommendation of Kunal, our charming host from the great AirBnB we stayed at nearby (that is recommended elsewhere). \n\nAnyway, the place is simple and charming, but the quality of food and coffee is very high. My wife had an exceptionally good Americano and I was served one of the best Mochas on the planet!!\n\nBrunch was very good as well, the staff were friendly and helpful and overall I would heartily recommend Moonlight Cafe to anyone.\n\nGood people watching spot as well. This is a rather funky area of town, but doesn't seem too hipster... rather a more laid back stylishness :)", "author": "Phil M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Delicious sandwiches made here. The veggie sandwich is my ultimate favorite at Moonlight Cafe.  The staff and owner are great!", "author": "Jhovani M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "The perfect neighborhood breakfast spot. Friendly and delicious. Staff were gracious and accommodating of all my special requests. Call customers by their names. Cook quickly and hustle to make sure everything comes out as soon as it is ready. Food is fresh, selection includes everything you could want for breakfast. Poached eggs and crepes were cooked perfectly. Espresso drinks, smoothies, and fresh-squeezed orange juice. Kid friendly. What more could you want?", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "Great lil Cafe with yummy sandwiches, burgers, pitas, and salads!!  They even had a vegetarian menu for my daughter who's vegan.  Friendly service and situated in such a sweet neighborhood.  Love Bernal Heights!", "author": "Rosie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "Friendly people and yummy food. Loved the omelet and crepes and strawberry smoothie!!! Happy foodie :-)", "author": "Eva B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "This is what a neighborhood cafe is supposed to be.  Great food, friendly people.  There are some real gems in their eclectic menu, like the lamb kofta burger, the cheese & onion crepe and the philly cheesesteak.  That last one is a relatively recent discovery for me and I crave it near-constantly. \n\nIt's on the small side with a comfortable neighborhood vibe.  I'm only just getting to know the people who work there, but I constantly hear first-name greetings when people order.", "author": "Erik L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "This is the best cafe I've ever been to in SF because every time I go there i know I'm getting amazing food and service. They are always so nice and the food is honestly amazing every visit.", "author": "Colette H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-11", "description": "I stumbled here after picking up some pickles at Paulie's Pickling down the street. My friend and I actually really wanted to try the waffles with poached eggs at Suite foods waffle shop but they are closed till the 14th. The staff here is super friendly and you order at the counter and sit down and they bring you your food. I order a Basilico crepe, which has basil, provolone, tomatoes and onions. My friend had the egg, ham and cheese sandwich on a croissant. \n\nMy crepe was very good. It came with a side of salad and some home fries. The salad was very fresh and the potatoes good as well. I'm a huge crepe fiend so any time I can have them, I'm happy. I tried my friend's sandwich and it was very tasty. The croissant was so buttery. All in all, a very good spot to stop by for a crepe lunch. I should also mention they have a lot of other food on the menu besides crepes. Burgers, sandwiches, baked goods, etc. We also had mango iced tea and fresh squeezed oj and both were great.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "Freshly squeezed OJ in frosty mugs? Yes, please!  I wanted to order more! \n\nI had their healthy start breakfast, which looked real good on the counter (waiting to be served.)  It's  two poached eggs with avocado spread on an english muffin (they need to drain the water out, because the english muffin was a mushy mess), but it was otherwise quite delicious.  I ordered a side of sausage, which was good too.  \n\nPrices = reasonable.\n\nService = friendly. Order at the counter, grab a number and table, and wait for them to bring everything.  \n\nI'll be back here when I'm in the area.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-08", "description": "4 STARZ for excellent service!\n\nI gotta share with you that the staff here have always been excellent.  I have been here several times and their food is always good and they get it to your table quick especially during lunch hours.  The owner is always friendly.  They go out of their way to make you feel very special.  I like the \"Sumo Wrestler\" up above.  I think that is so cool!  I recommend coming here for lunch - they do get busy but service is quick!\n\nCheers!", "author": "Edwin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-27", "description": "This is the kind of place where it matters what you order.  The best stuff is terrific, the worst is pedestrian.\n\nThe best:\nPort Wine Cheeseburger (port wine in the cheese)\nPhilly Cheesesteak\nChicken Pignole savory crepe\n\nThe mood here has always been great, even better since they enlarged the seating area a few years back.  You can sit at the outside tables with dogs.  They'll refill your fancy coffee drink with house coffee.  In short, this is not a coffee shop, it's a breakfast and lunch spot and there is nothing else quite in this niche in Bernal.  The breakfast fare at Progressive and Martha's is really more croissants and muffins.\n\nI am happy to have it!  Kind of challenging to eat here with more than four people, but it's nice to sit in the window nook if you have four.", "author": "G M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "Usually my go to spot with my father.   We get the royal \"first name basis\" treatment and friendly wave from the chefs in the open kitchen area every visit.   Very polite and neighborly service.  Consistent fresh flavorful food in a cute quaint cafe environment .", "author": "Qiana V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-04", "description": "I am so disappointed with the level of customer service here. I live directly across the street from the cafe and frequent this establishment multiple times a week. Most often, my family orders for pickup. Today we ordered a side of hummus and pita, a sandwich and two smoothies. When we came to pick up our food, the owner was there. He was also the person who took my order. Upon arrival we noticed that the food was not what we ordered.  He had given us two sandwiches and no pita and hummus. Even though we told the owner this he very rudely insisted this is what we ordered so this is what we must pay for. I was shocked at how abrasive and unaccommodating he was. We told him we still need one item that we ordered before we pay. He grudgingly completed the order but way over charged us. He also charged us for the sandwich we did not order or take. (Must add their smoothies were terrible!! Made w/ Oj so tasted funny) At this point my husband and I were so fed up we paid and left and vowed never to go back. It's a shame because of the convenience but I would never give this man or his cafe my business again.", "author": "Tina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-21", "description": "I'm not sure why I never ventured into the Moonlight Cafe before, but on a walk one day I decided to stop for lunch. I like consulting my Yelp App on my iPhone to tell me what's open and where to go. Good Choice.\n\nIt seems they do a lot of breakfast, brunch and lunch ad have quite the selection. I ordered a cheeseburger which came with french fries. I put a big heart of condiments on my burger to show my appreciation. \n\nThe fries were good, those really long and big potato fries when served crispy and not oily - are just the perfect big fries. I ate about half the burger and fries, took the rest to go. I even enjoyed my burger leftovers the next day.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Pamela and I shared a citrus crepe with lemon-ginger aid.  A nice refreshing afternoon snack", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "Best place for breakfast or lunch in Bernal!  \n\nThe food hits the spot, the coffee is good, and the people are friendly.\n\nBaby and kid friendly, too.", "author": "Seth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "I love this cafe, and when I visit Bernal, this is where I go for breakfast after a jaunt over to Martha's for my chai latte with 2 shots of espresso! I found that they will actually fill a 2 quart container with their fresh squeezed oj or orange carrot juice which I LOVE at my request. It's SO delicious. I will always come here. I love their crepes, blintzes, croissant breakfast sandwiches, and of course their juices. May they never go away!", "author": "Stella T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "The best place to eat! Hands down!!! I love coming here because it's clean, great food, and super friendly service. Everyone is nice the owner the son the nephew the cooks the servers. Everyone in that place is super friendly and super nice easy to get along with.", "author": "Michele T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "Just stopped in from out of town to visit my sister and she recommended this place for breakfast. French toast was excellent, perfect texture. The staff is super friendly, just felt warm and welcoming. I'll be back.", "author": "Cam R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-30", "description": "We were looking for something quick for lunch so we thought we would give this place a try despite the relatively low Yelp rating. Once we sat down we began to understand why this place sucks.\n\nWe believe it was the owner who was about to take our order when a woman taking her food to-go said to the cook that she had wanted a hamburger patty for her burger. The guy stopped us mid-sentence when we were ordering and interrupted her to see what the problem was. She explained that she didn't want sliced meat, but instead, a patty like she had asked. The owner said, \"no, you asked for hamburger bun\" and she responded that she had said hamburger patty. The situation quickly became very uncomfortable for us as the owner got flustered and irritated, saying he would have to charge her $4 more for the patty. She said that was fine and he rang her up as he was shaking his head. He let it be known that he was extremely agitated and it was poor management on his behalf. You can't get so easily frustrated with people, and let it show, for such a stupid issue. Just chill, bro.\n\nI asked him what was in the greek salad once that was all over and done with. I went with that, minus the olives. Our salads came and they didn't have tomatoes like he had said. They were also like $7.50 each, but there was nothing special about them. \n\nOverall, overpriced and poor management. Won't be back.", "author": "Sofia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-03", "description": "I dig this spot. Great food options and good amount of space.\n\nFresh squeezed OJ, Crepes, fries... we ordered a variety of different foods. Price was good, but the staff was very friendly and when my wife asked about dairy in their foods (for my son) they pointed out what was options were available.", "author": "Roger A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-21", "description": "Great place to eat.I hade a banana smoothie and some pancakes and bacon and it was all good!", "author": "Cooper R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "This is a classic diner in the middle of the commercial strip on Cortland Street in Bernal Heights.  The food is straightforward, made fresh, and tastes good.  Plus, they have a good variety of diner type food.  A solid choice for breakfast or lunch.  If only they would stay open a bit later.....,", "author": "Mark A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "I love Moonlight Cafe and eat there weekly. It's a great neighborhood place, with friendly owners. I am a regular and they always remember how I like my iced tea - which is the delicious by the way. Great food, great location, nice owners & a super casual setting. Try the Bernal Hill omelette - you will not be disappointed!", "author": "E B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-10", "description": "A casual neighborhood eatery with reliably good breakfast and lunch dishes.", "author": "David K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-10", "description": "I stopped by yesterday during the lunch hour for a chicken salad sandwich to go. It was my first time going to MOONLIGHT CAFE.\nI was very pleased with the customer service (friendly) and my sandwich was AWESOME!\nParking can be a problem during the lunch hour, but well worth stopping by.\nI live in the neighborhood & can't wait to try their Crepes.", "author": "Janet T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-07", "description": "Very disappointed. I have been a loyal customer. We were the only ones in line. He kept tapping his pen on the pad as we were trying to decide what to order from the menu. He seemed annoyed. I thought we had order fairly quickly. \n\nWe ordered breakfast. Once I got my breakfast, the Breakfast Pita seemed to be missing something.  I realized I had forgotten to ask for mixed greens and tomatoes be added (since the pita always looks empty). I went back to the counter to purchase the sides. He says he's going to charge me for a whole side salad when the girl had just given me a few small slices of tomato & not even a handful of greens. I was reaching for the plate on the counter when he notices dog hair on my hoodie and totally spazzes out telling me to get away from his counter (after I've already paid for my breakfast and he's already run my card a 2nd time for the sides I just ordered) I'm a Dogwalker. Dog hair happens. I immediately apologized for having hair on my hoodie. He continues to tell me to stop and to get away. He's being loud saying that I'm bad for business and he can't afford it. (What you can't afford is quality food while you keep raising the prices) I wasn't trying to get dog hair on his counter. He was so rude and it was completely embarrassing that he would make such a big scene. I kept my cool. I apologized and walked out without my food.\n\nIf the dog hair on my hoodie was a problem, he should have said something BEFORE he took my money and just refused me service to begin with. Not let me order and THEN kick me out. Never again. He took my money and I didn't even get to taste my breakfast.", "author": "Jay N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "Went here for breakfast while visiting family in the area. All the staff were very friendly & welcoming. The food was superb. The service was great, even with how busy they were that morning. And the latte and chai we ordered were also very delicious. Will definitely go back for more sometime!", "author": "Kato M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "Food here is good and wholesome, the staff has always been very hospitable, I always leave with a full tummy and a smile. Coffee is very good too. Very broad menu.", "author": "T M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "Second time coming here now and both experiences have been amazing. First time came for lunch and the second time for breakfast. The food was amazing and as silly as it sounds tastes like it was made with love. It sincerely tastes like a great home cooked meal made my your mom. A part of that feeling comes from the environment of the place. The owner works the counter and greats everyone that walked in like they were family. Super friendly environment with the team behind the counter really helping to make dining here an experience!", "author": "Pavan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "Love this place.  Always friendly, comfortable atmosphere,  and the food is good.  They even have gluten free English muffins and crepes!", "author": "Lisa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "I like this Bernal Heights area breakfast/lunch joint. The food's always great and the place is always clean. The food wafts as you walk in. There's no wifi, so you'd have to cross the street to a cafe is the only negative.You can have a range of breakfast choices and a bunch of Mediterranean type food. I chose roast beef stuffed inside pita bread...hey why not, you might as well combine the menu items on the chalk board. 'twas good.", "author": "Reyz A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "Love this place.... makes me happy! :) This neighborhood joint is the place to be. The owner and his son always make me feel part of their family. You're welcomed here. It's the \"Cheers\" of Bernal Heights. It's got the vibe of \"everyone knows everyone her\" and you are loved & cared for. One of favorite places to be at... come & join the fun.", "author": "Jinny K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-31", "description": "I got the healthy starter. MMmmmmm... It consisted of two poached eggs on an english muffin. A delicious, fresh made salsa was sprinkled on top of the poached eggs. It also came with a small salad. The dish tasted light and flavorful. I would have liked more salsa! \n\nI also tried the smoked salmon crepe. It tasted a bit too fishy for me, but it still had a nice flavor to it. The hash potatoes were yumz.\n\nThe hot apple cider was ehh...Just something similar to the mix you get at the store.", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-07", "description": "Enjoyed a great breakfast with great service one morning with my BFF!  The Breakfast Croissant was yummy and the French Toast was awesome!\n\nThe gentleman behind the counter was very kind and allowed for a great experience!  I will be back!", "author": "Candy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-14", "description": "Friendly staff, pleasant atmosphere, and delicious food. I ordered the Garden Veggie Burger and it was delicious! I added avocado and provolone to make it perfect. Glad I stopped in and will definitely be back!", "author": "A P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-12", "description": "This place reminds me a lot of Crepevine. Standard breakfasty/brunch food. We all had the healthy start:  two poached eggs served over a toasted english muffin topped with avocado and fresh salsa. served with a side salad. Really tasty and satisfying. I don't usually make the trek out to Bernal, but this was fun. Lost a star for having a pretty dingy interior.", "author": "Eliza D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-03", "description": "This place is totally overpriced, moreover the food is just average. However, there aren't many breakfast spots on Courtland Ave.", "author": "Dan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-14", "description": "Fair price with reasonable portions. We got there a little bit early so there weren't that many people yet, but the crowd started when we we hale way into our meal around 815am.", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "Great breakfasts and lunches. Great service too! Family owned for a long time and they treat you like family. See u again soon!", "author": "Victor Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-26", "description": "Super consistent brunch place. Always good food. No pizzazz needed. Really friendly staff. Lots of vegetarian options. Highlights include the healthy start, the veggie sandwich, any crepe, and potatoes. Iced coffee is cold pressed and amazing. Really you cannot go wrong with anything.", "author": "Josh T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-13", "description": "Went to this cafe on Monday lunch with my boyfriend.  Nice place with outdoor seating and easy parking.  We had crepes and the food was tasty. You can really go wrong with crepes haha...\n\nI am giving four stars because the service was amazing and the server/cashier was fast and very nice.  He even brought out water and a treat for our dog!  Lavender lemonade was a bit tart, but homemade and fresh.\n\nGreat casual place to grab a bite and relax.", "author": "Kiko K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-15", "description": "We visited Bernal Heights and had a wonderful meal at Moonlight Cafe. The location is fantastically hip - in fact, half the restaurant was filled with hipsters donning horn-rimmed glasses. The moonlight crepe was glorious with eggplant, peppers, and other goodness. The home fries were solid. Next time I want to try the chicken and pesto crepe. Yummy.\n\nPrices are reasonable at Moonlight and food quality good. Service is good enough and location is great. You won't be disappointed at Moonlight.", "author": "John Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "Their pancakes are soooo good! Just the perfect amount of fluffiness. Their Italian sodas are definitely worth trying. Not too pricey and the menu has a great variety to chose from. Definitely try this place out for their brunch!", "author": "Munira H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "We just ate here and it was sooo yummy! The owner was really nice and hilarious! I got the breakfast combo and the eggs were yummy. I highly recommend this place. Good people, good pancakes! :)", "author": "Jessie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-30", "description": "Food is decent. I haven't found their ingredients to be very high quality, but it's nevertheless tasty. Portions are reasonable, but definitely overpriced. Good place to sit and relax if you can find seating and don't mind paying a bit more. Owner is rude at times. Today I asked him what veggies were in the veggie, avocado, and cheese sandwich (it wasn't busy and there was no one in line behind me, btw) and he looked at me like I was the bane of his existence, before listing them off as if I asked the most obvious question in the world and he couldn't believe he had to respond to it (also, not that i really care, but one of the veggies he listed wasn't in the sandwich).\n\nUpdate: I'm taking away one star for rude service. I generally try to give people a pass but every time I've gone in there, they've been unpleasant. They opened late this morning and the cashier was clearly in a bad mood and didn't care who knew. Yucky experience.", "author": "Roxy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-28", "description": "I started coming here a while ago with a friend, their Falafel's a treat!\nThe food's always great and the place is always clean, the food smells great as you walk in so you know it's all good before you figure out your order, but the thing that stands out is that while i was eating i saw the guy that took my order helping an older lady cross the street and then he's back in the Cafe taking orders and serving food like business as usual, and it probably was. while i was enjoying what i saw and pointing this out to my friend someone else working here was making a point of entertaining someone's toddler in a high-chair.\nTasty food is one thing, making a point to be a neighbour is another, together it's great!\n\nThat's my story and i'm stickin with it!", "author": "Eddie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "I've been here numerous times and their lattes, oh their lattes, are to die for. I didn't even have to add sugar, that's how good it was. The staff are probably the friendliest I've met thus far, and I'm not exaggerating. The food was wonderful; I've had the bagel with lox, the french toast, and my favorite, the philly cheesesteak. All were really tasty. If you're in the area, definitely give this place a try!", "author": "Shira S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-06", "description": "Awesome, friendly service every time we eat here.  Lots of locals and familiar faces come here.  I don't blame them for coming back because their service and food are pretty good.\n\nIf there for breakfast, a must try is their \"fresh lox and the works\". They spread cream cheese, a thin layer of fresh salmon, a handful of capers.. all nicely topped on a lightly toasted asiago bagel. It comes w/ slices of lettuce and tomato on the side.  Tastes really good w/ their coffee... nice & strong.  \n\nWhether for breakfast, brunch, or lunch their Chicken Pesto Crepe is pure goodness. It's filled w/ mushrooms, tomatoes, onions, and provolone cheese... comes w/ seasoned potatoes and a lightly dressed salad.  Nice hearty meal at any time of the day.\n\nIf there for lunch, you should never leave without ordering their \"sweet\" crepe. I usually opt for their combo- banana, nutella, & strawberry. ((Sigh)) It's really good... \n\nThere are other breakfast & lunch items on the menu that I haven't tried yet.  I'm sure they are all really good, but I did eye somebody that ordered the Eggs Benedict.  Ooooo, for the next breakfast visit....\n\nLocation: street parking is available, but again metered. Bring change. Streets in the neighborhood are narrow as well, so be prepared for that when driving around for parking.", "author": "Joy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-05", "description": "Ok, so I have had a lot of different style of crepes but none have come close to the Moonlight's!! I am not over-exaggerating over here people! They have crepes for the sweet -tooth in you or savory crepes! My favorite and the usual one that I get is the Chicken Pesto with avocado. I also enjoy dipping each bite in Tapatio Tabasco sauce! What can I say? I'm a spicy type of hombre! Lol... The service is great and prices are good. Come through and enjoy the savory goodness of a GOOD crepe!!", "author": "Cesar N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-08", "description": "Just this last Wednesday, my mom, my great aunt and my grandmother drove up to San Francisco to visit my sister who has resided in the city for about 24 years.   My sister normally doesnt each lunch and didn't really know where to take us, but lives in this neighborhood and had heard good things about this place.  She is a very busy person and had to just drop us off and take care of some quick business.   Looking at the menu, all of us were feeling a lil unsure of what to order.  The prices seem fairly steep for just a bagel with cream cheese, cheeseburgers are a tad overpriced and just to add bacon is like an extra $4.  However, we went with it because my sister normally does not let us down when it comes to dining.  My grandmother and aunt, each ordered separately and my mom and I ordered together.  My mom and sister already knew what they wanted,  (2 cheeseburgers at 10.95 each with a side of fries), my mom placed her order with a bald gentleman that seemed to be the owner, while I stood there trying to decide.   Immediately he grew impatient and I could feel his negative energy, so I rushed to judgement and ordered a cheeseburger as well.  We asked for 2 canned sodas at $1.25 each and when he rang up the total, it came to $56.95.  Hmmm.  My mom questioned, \"$57?,\" to which the owner replied, \"We use good quality food.\"  My mom is fairly passive and just paid.   I, on the other hand a total penny pincher, thought about it while I washed my hands in the restroom, and came back out and told my mom that didn't seem right.  3 cheeseburgers @ 10.95 each equals 32.85 + 2 sodas @ 1.25 adds up to 35.35.  That would be almost $20 in tax.....hmmmm....I know San Francisco is expensive, but no way.  My mom agreed and so her and I walked up to the counter and very kindly explained to the owner that it didn't add up.  He immediately got testy but looked at the receipt roll in the register and kept repeating that it's expensive because of the quality.  That still doesn't explain a $20 difference.  I kindly told him, that I think he might of misheard our order and with the quickness, his temper went from zero to a hundred.  He yelled and pointed at me, \"YOU ARE BEING RUDE AND I HAVE THE RIGHT TO REFUSE SERVICE! YOU NEED TO LEAVE RIGHT NOW!\"  And before you knew it, he was throwing money at my mother.  He continued to yell repeatedly, \"I HAVE THE RIGHT TO REFUSE SERVICE, I HAVE THE RIGHT TO REFUSE SERVICE, I HAVE THE RIGHT TO REFUSE SERVICE.\"\nThis whole time, my 85 year old grandmother was fixing her cup of joe next to us, didn't hear a thing (she has a hearing aid, but of course her hearing isn't totally reliable) and we had to tell her we needed to leave.  So he threw money at her, my great aunt and proceeded to kick us out of his cafe. \nIm amazed at how quickly his attitude changed when he didn't like being questioned and the fact that he would have such little respect or class to throw out 4 women, including my 85 year old grandmother!!!  Regardless of the quality excuse, I think this guy was trying to take us for a ride and possibly thought that we were dumb enough to fall for it and not do the math.  \nI will never go here again, my family will never go here again, and my sister has advice her city friends not to go there ever again.  \nRude, impolite, ridiculous and a skeez. \nIf you ever wanted to visit the infamous Soup Nazi, go see this guy.  Seriously.", "author": "Jodi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-17", "description": "I haven't written a review in eons, but after the third time here I knew I had to come back on leave a rave review!  So here goes:\n\nI loved this place soooooo much!!  I so wish I lived closer, I'd be here every day!\n\nWhy only 4 stars?  Because I actually haven't had much off the menu.  My husband was the more adventurous one, and got something different every time we came, but he's not a yelper.  But I can say this, every time I've been here I got a simple breakfast of French toast, scrambled eggs, potatoes, and sausage links  and they were all the best I've ever had!!  I used to work at a few breakfast joints and I hate French tost, but *this* french toast had me coming back for thirds ;)  Its how I remember French Toast as a kid except probably with less butter.  (I had a butter addiction as a kid, I'm way better now!  Well, kind of better)  They put sage or something *spectacular* in the potatoes and the sausage has rosemary...although the breakfast I had was simple, I fell in love with it.  Now for the best part:\n\nThe BEST drip coffee I've EVER had at a restaurant EVER!!!!!  ANd the Mango Smoothies...OMG.  I would come here every day and get coffee and a smoothie if I lived closer.  \n\nLets see...out of all the the Breakfast places that I have reviewed, I think this one might be my favorite based on the fact that the smoothies and coffee are so good, I have not been disappointed in the one breakfast I've tried, and there's always seating, even outdoor seating if we have the dog with us.  \n\nIf I think of it, I'll totally write another review after I broaden what I order here.  \n\nAlso, I can't forget, I really liked the staff, the service seemed speedy (although you do order at the counter, they bring you your food and they're pretty attentive to what you might need).  \n\nAgain, loved this place sooooooo much!!!", "author": "Jessi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-09", "description": "PROS: Very good food! Breakfast was fantastic-I ordered on one day the french toast meal, another day the cruscant! Cute little place! Good and friendly service!\n\nCONS: depending on the day, seating can be limited...and it is a little pricey!", "author": "Amie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-24", "description": "One of my favorite breakfast and lunch places in SF. Aziz the owner knows me and most regulars by name. He makes a real effort to help his customers and even remembered my order the last time I went in.\nMake sure you try the breakfast pita for breakfast and the chicken philly for lunch, those are 2 of my favorite things. \nTheir white chocolate mocha is really good too.", "author": "Sean R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "Amazing lavender lemonade (made fresh). Fantastic eggplant sandwich.  Reasonable prices.", "author": "Deb D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "This is a great spot for lunch because it's priced well and offers a range of foods (i.e. breakfast served all day, sweet or savory crepes, sandwiches, soups and salads) to satisfy any craving.  I usually find myself coming back for the Caesar chicken salad because the portion is filling, dressing is coated thoroughly and, the thin slithers of chicken are wonderfully grilled. No complaints here :)", "author": "Lynnie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-29", "description": "In my continuing quest of my new neighborhood, I decided to trek up the hill a bit and hit this cafe.\n\nThe service couldn't be better.  Order at the counter, make sure you get a big mug of coffee, and have a seat.  You will wait longer for your food than most places, but that's OK ... everybody seems to just want to relax. A bit pricier than I expected.\n\nI had a scramble with chicken apple sausage, onions, peppers and tomato.  It was pretty good, but I could have done better at home.  The potatoes are OK, but would be better with some spice or veggies thrown in.\n\nOther items on the menu include omelets, bagels, breakfast sandwiches, pancakes, etc.  The coffee was good and better than Martha Brothers and Progressive Grounds.\n\nIt was a good, family oriented place where everybody seems to know everybody else ... just what you would expect to find in a neighborhood dive.  I'll be back now and then to try other things.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-16", "description": "Moonlight cafe has changed over the years! I really enjoy going there now. The food is very fresh and well made. The juices are freshly squeezed. Yes, they have carrot and orange juice. Both are great. I've their healthy start on the memo. Their bacon is that the kind with thick cut. I like to go there on the weekend with my dog. Wish they have outdoor heater though, because you know it could be kinda chilly in bernal sometime. :)", "author": "Yina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-21", "description": "Food - 4 stars\nPet Friendly - 5 stars\n\nYowzer...you want a dog friendly place? Eat lunch outdoors in Bernal Heights.  Instead of parking cars or bikes, patrons park their dogs. I'm not kidding..dogs were lined up around the corner.\n\nThe cafe has two extremely popular outdoor tables. We got lucky on a Saturday afternoon and got one of the tables where we enjoyed Greek salad with chicken.  Food was tasty and freshly made. I like when you can see the cook making your food.\n\nNow about the dogs...both of the tables outside (including us) had dogs. Two poodle were tied up on the meter around the corner. A chihuahua looking pup was tied up right in front of us and wiener dog was one meter over.  Josie Poodle would never forgive me for tying her to a meter post but if that's your thing, Moonlight Cafe is the place for you.\n\nTotally pet friendly...we'll be back!", "author": "Kim W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-06", "description": "To reiterate what most other reviews have said: this is probably some of the friendliest service you'll find anywhere in the city. Moonlight Cafe didn't overwhelm me with amazing food (it is, perhaps, slightly better-than-average cafe fare), but the fantastic neighborhood feel and friendly banter between the owner(?) and regular patrons was so warm. A sweet place to spend a lazy hour or two.\n\n(To be fair, I would give it 3.5 stars if I could)", "author": "Sam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-17", "description": "All I have to say is get the Healthy Start breakfast and a glass of lavender lemonade.", "author": "T J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-06", "description": "Friendly staff, great food/good price. Good place for mimosa's on a Sunday.", "author": "Nohealani C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-18", "description": "I like this place. Where else can I get a crepe within the Bernal Heights district? I use Crepevine as a benchmark for all crepes (it's the only crepe place that everyone and their mamas know) so compared to Crepevine, I'd have to say Crepevine is slightly better in quality and quantity. However, Moonlight Cafe's crepes are still worth it, and this place doesn't just serve crepes; they also serve breakfast such as pancakes, bagels and omelettes, burgers and sandwiches. The area is nice and the restaurant is spacious. What they really need to do is close later. They close at 6pm on the weekdays. How will I ever be able to eat here if that's when I get off of work?\r\n\r\nJONASAPPROVED!", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-10", "description": "If you ever happen to be walking along Cortland, famished around 3:00pm, you're pretty much out of luck unless you settle for pastries or little snacks.  Except for one saving grace ... Moonlight Cafe.\n\nAt first glance, it looks like a little coffeeshop with probably not much in the way of hearty grub.  But as soon as you walk in, you get a whiff of eggs and sausages and notice the meticulously handwritten (and colorful) menu (a la Crepevine) and you know you're going to be just fine.\n\nThey have the usual (omelets, scrambles, crepes, burgers) and your not so usual (Mediterranean platter, several beer options).\n\nI had the Mediterranean omelet with feta, artichoke and olives.  Very filling and served with some home fries.  Totally hit the spot.", "author": "F. P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "came here unexpectedly because i was famished and it happened to be near me at the moment. i ordered a panini and it was delish. customer service was on point too. it was a nice day out and they had out door setting. the panini defininitely hit the spot. I will definitely be back", "author": "Kristina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "There's nothing fancy about this place, but the food is excellent. The people are friendly, service is prompt and efficient, and there are seats outside so my dog and I can take a break on our morning walks. They open at 6:30am, a rarity in the city.  My favorite, and my dog's, is the whole wheat pita with scrambled eggs, cheddar and bacon. With a good tip, you're talking $10.", "author": "Donna R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-03", "description": "I really wanted to like this cafe.  Really.    \n\n3 stars overall.\n\n2 stars for food.    I have been here a handful of times, hoping each time would be better but, unfortuately, the opposite occurs.  I've tried their breakfasts, crepes and sandwiches and they've all been sub-par.   It never hits the spot for me.  Also, I found the food to be a little pricey.\n\n4 stars for service and location.  It's in a great location, has friendly staff, place is clean and parking is easy.", "author": "Mare P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "It is one of our families absolute favorites.  Yummy food and great service.  They have always been so nice to us.  My daughter is a bit of a fussy eater and they have always tried to help us.  Once we ordered a bagel with cream cheese, it came out toasted and my daughter was upset.  They quickly offered to make another one free of charge (I was willing to pay) and told us to keep the other one for the rest of us.  One star off as some items definitely seem to be a little overpriced, but others seem to be a good deal.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-21", "description": "This seems to be the only place around here that has a Mexican Hot chocolate option. Been walking around for awhile and couldn't find anything except this place. This place is always busy and has dogs sitting outside with their owners.", "author": "M C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-25", "description": "This eatery is just a couple blocks from my photo-studio. I'll bring my production crew or even clients here for a quick and informal meal.\nIt's mostly a Bernal-dress-code(casual hiking) kind of restaurant. The menu's mostly about omelettes, crepes (savory and sweet) , burgers, and a short list of sandwiches. dining here is popular at breakfast and lunch on weekdays and brunch on weekends.", "author": "Kingmond Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-20", "description": "Service is absolutely horrible. After waiting close to an hour for our food on a busy Sunday, we noticed at least other tables that had arrived after us had already received their food.\n\nWhen we asked the busboy/server about our order three times, his final response was that our ticket was being prepared from the \"other side\" of the grill and made no apologies.\n\nWe decided to ask for a refund and go elsewhere. The owner made no apologies, refunded our meal but charged us for the two iced teas; unreal!\n\nDon't waste your time at this place, there are plenty of great restaurants along the Bernal Heights Cortland Street corridor.", "author": "Dave L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-11", "description": "I visit San Francisco a couple times a year and stay with a friend who lives in this neighborhood. I ALWAYS stop by moonlight cafe for breakfast.  good food fair prices very friendly staff and a real feeling of a locals spot.  definitely recommend this place", "author": "joshua l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-05", "description": "Sadly, because there's no good options on Cortland, I'm forced to go here. The food is not good. It's not terrible but it's not good. It's at least fresh tho. But the portions are tiny, they charge extra for everything you add, and the worst is the PRICES. They are soooo expensive. The only reason moonlight is still in business is because there are no other casual good places to eat in the neighborhood. Sad but true.", "author": "Jessie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-11", "description": "The pesto chicken crepes ... to die for. I actually go out of my way to wander in for lunch whenever business takes me to the City. Nice staff, food is delivered quick. \n\nOnly downside is the music eminating out of the $34.99 CD playing boom box (circa 1986) is horrible.", "author": "Paul F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-03", "description": "Nice peps and decent food, all within a 3 minute walk. Can't beat that.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "Yummmm!!! I have not yet been disappointed by this place. Their smoothies are amazingTheir breakfast is awesome. Perfect portions that are always filling. I got the croissant egg breakfast sandwich with spinach and avocado with the Berry smoothie for breakfast which I am beyond pleased withI love supporting local businesses in the neighborhood. This place Is well worth the business and support. It Can some times be a little pricey but you get what you pay for which is Mmm mmmm tasteyit's also very kid friendly. Great for just about any body....the service here is great:) the gentlemen in the front greets you with a smile immediately and the chefs behind the counter do a good job cooking your food at fast pace then serving it to you. I swear they're mind readers here too bc as soon as they served me my food, I got up to grab napkins but as soon as I turned around wallahhh the chef had napkins waiting for me:) WooHoo..*Happy Face* walking out of here with a full tummy.", "author": "Stefany L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-02", "description": "Cool place on Cortland. It's next to my nail shop so my daughter and I decided to go here. My daughter got the Pancake breakfast which was just ok. I got a spinach, tomato & mushroom omelet. It lacked seasoning. The potatoes were good. IT's a place I wouldn't go out my way to go back to.", "author": "Ayana K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-06", "description": "For a cafe, they have a good variety. Pricey, but then again so is most food in San Fran.\n\nPeople are friendly. Food is freshly made and fast. Very good Thai Iced tea.", "author": "Christine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-26", "description": "This is how a neigborhood cafe should be.  The menu is simple, the food is good, and the service is efficient.  What more can you ask for?  Yes....it is a little pricey but Bernal Heights is in a great nook.  The neighborhood is nice, the people are nicer, and it's just in a great area.  \n\nI was planning on going to liberty cafe but they were closed on mondays so I walked down to this gem and I was amazed.  I was amazed that this place is never packed.  The food is made in front of you, they have outdoor seatings ( 4 to be exact), and the weather seems to always be better around this part of town,\n\nI had the chicken ceasar and my friend had the egg plant sandwich.  I would not go out of my way to come here but if you were around the neighborhood and you need a change of pace, this is a cool place.  It feels like you are not even in the city.", "author": "jason g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-21", "description": "Every neighborhood needs one of these places - crepes, good sandwiches, burgers, salads and some mediterrean food thrown in.  Moonlight Cafe does an exceptionally good job at this particular genre.  I loves me some basil crepes and fresh cooked taters. \n\nPerfect place to bring the kids - no whining when they've got all their favorites to pick from like pancakes, cheese crepes, burgers & fries and eggs with potatoes.  \n\nIt's always a good sign too, when you recognize the same employees for years - means that management is probably cool and treats their people well.  \n\nMy only complaint - they never give you enough butter.  Sorry, but I like my toast BUTTERY!  You need to toss me AT LEAST four of those little wax paper butter squares.", "author": "Molly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-30", "description": "Awesome breakfast place! The crepes are so so good. This place is crazy busy because they make a mean crepe so try to get over there early.", "author": "Some D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-09", "description": "So.. I was stumbling around Bernal Heights today... doing yard sales in a neighborhood I am usually not in.. I got hungry... and saw the Moonlight Cafe.  It was busy... which is usually a good sign.... so I went in.... The menu seemed to have a good breakfast.  I ordered the Western Scramble.  Then I proceeded to wait  20 mins for my food..  When it was delivered..... The eggs were OK... scrambled with Chicken Sausage, onions, tomatoes, and bell peppers.  They were served with Toast and Hash Browns (which I was REALLY hungry for).......  The Hash Browns SUCKED!!!  They were barely cooked cubes of potatoes. still CRUNCHY!  I took my plate back, and the guy was like.... 'Sorry!... No problem..! ' And put another steaming helping of UNDERDONE potatoes on my plate!!!!!  NOTE TO YOUR COOK:  Hash Browns are supported to be BROWNED!!! .. on every side of the potato cube!  Steamy white potato cubes DO NOT make HASH  BROWNS!!  If you can't figure out this IMPORTANT breakfast side dish... Why the HELL are you serving breakfast?  AND.... The TOAST was not TOASTED!!!...  Guess I stopped at the WRONG place!!  Won't make that mistake again....!!!!", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-13", "description": "Cute cafe in a darling neighborhood in the Bernal Heights district. I just had a burger and fries and while it hit the spot, I've had much better. I found the prices to be rather high for the portion size then again every store in this neighborhood is on the expensive side. Not a place to go out of your way for, but if you are in the neighborhood and just want to sit down and watch all the cute dogs pass by in a charming setting, Moonlight Cafe is a great place to start.", "author": "F K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-18", "description": "I ABSOLUTELY LOVED THIS PLACE!!! The atmosphere was great, nice,quiet and a nice staff. The food was delicious. I had a lovely pancake breakfast one day, then a Banana, Strawberry and Nutella crepe the next. It was the best thing I have ever eaten. I loved the tip jar which states \"Sexy people tip\". LOL! Each time I went I found a seat. A perfect little place to go grab a bite or some coffee and sit down to read or work.", "author": "Patricia G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-31", "description": "I agree with my wifey. This place is overpriced and lame. Pancakes should not taste bland. Syrup should not taste bland. I was so annoyed that my local breakfast spot was so unfortunate.\n\nAnd yeah..$30 for two bland meals? Not in any way is that worth waking up for. Kthx.\n\n(Edit: Oh oh! and my question about their broken ATM was met with a snappy answer that made me want to slap the countergirl. Do people here have any manners at -all-?", "author": "Rylan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-13", "description": "Stopped in here looking for a healthy bite for lunch. The salads looked pretty standard: garden, greek, caesar. I inquired about the veggie pita, and the nice girl behind the counter steered me clear of it when I mentioned I was also thinking about the falafel. \n\nYay for that; the falafel was terrific. Nice and large, too. It wasn't exactly the healthiest option in the joint thanks to a delicious mystery sauce of cream, but it was certainly satisfying. Shared it with the boy, since it was too big. The price was nice for that sandwich, but the other options like the burgers looked rather pricey.\n\nWill definitely be back.", "author": "Brittney G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-19", "description": "Expensive breakfast\nCreepy mural but good food\nSnatch sparse outdoor seat", "author": "Shannon N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-01", "description": "New Year's Eve. Noon.\n\nMe: Let's get brunch. \nEd M: Sure. But where?\nMe: Slow Club?\nEd M: Eh, I don't like anything on their menu today. How about Universal Cafe?\nMe: I dunno, Yelp says it has a long wait and it looks expensive. \nEd M: OH! HARD KNOX!\nMe: Uh, I want breakfast. \nEd M: Hm, Just For You Cafe is good but it'll be a long wait.\nMe (looks up Just For You, not too pricey): OOH. BACON OMELETTE. Sure, I can wait. I've got put on my pants and socks. \nEd M: Alright, I've got to put on my pants. \n\nI find it funny that half of my conversations with Ed M end up with him saying \"I've got to put on my pants.\" \n\nWe drive over to Just For You but it looks like it'll be a long wait. So while heading over to the backup (Slow Club)...\n\nEd M: Hey, I think there's this place on 25th and South Van Ness called Ann's Kitchen. Ann's something. Want to try that?\nMe: Yeah, sure. \n\nWe drive over to 25th and South Van Ness and there's no such restaurant. \n\nEd M: Uh, go to 24th. \nMe: Um, nope.\nEd M: Go to 26th. \nMe: Um, nope.\nEd M: Go to Valencia. \nMe: Um, nope.\nEd M: Let me google text Ann. God, I don't remember the name of the restaurant. \nEd M: I DON'T WANT ANN TAYLOR! Uh, how about Boogaloos?\nMe: Alright. \n\nOf course, Boogaloos is packed at 1PM on a Saturday. ME HUNGRY!\n\nMe: Uh, does Liberty Cafe do brunch?\nEd M: OOH! And if it's not open, Bernal seems like it would have a lot of breakfast-y type places. Lesbians love breakfast. \nMe: .....\nEd M: .....\nMe: Did you just say that lesbians love breakfast?\nEd M: I have nothing to backup that statement. \n\nOf course, Liberty Cafe is closed. It's 2PM. I'm HUNGRY. Turns out there aren't that many breakfast-y places along Cortland Ave. We do spot Moonlight Cafe. It's a gamble. There's an odd feeling with going into a restaurant that you haven't pre-Yelped. Like trying a new drink. Or sleeping with a \"new\" hooker. \n\nThere's nothing really special about Moonlight Cafe. Bagels, omelettes, bagels, and sandwiches with a chalkboard menu. It's LOUD inside because of all the kids and the radio that's turned up to full blast. I had the Spanish omelette but it was nothing special. I asked for cheddar cheese but I think they used American. Oh yeah, it's cash only. \n\nShould have gone to Slow Club.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-20", "description": "I love this place for a reasonably-priced breakfast -- the croissant sandwich always hits the spot. Bagels, pancakes, waffles, and French toast are all tasty too. And the fresh-squeezed orange juice in a frosty mug rounds it off perfectly.\n\nBest of all, the staff is super friendly.", "author": "Meredith D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-12", "description": "God, could the patrons here suck anymore? If I have to see another white baby screaming at its cooing white mama, I might just throw this piping hot veggie burger at its face. But wait a minute! Hold up! I refuse to waste food on stupid, over-privileged babies, especially food that is delicious! \n\nI love this veggie burger. It's huge and loaded with avocado and tomato and whatever else you so desire and it comes with a bucket of french fries on the side. Seriously. Like, you order your burger with fries and when you pick it up from the counter you're initially all like, \"hey, I ordered fries with this,\" but then one of the hottttt, Spanish speaking metalheads is like, \"Here you go,\" and hands you a bucket of fantastic fries. It's awesome. \n\nHave I mentioned the hottttt, Spanish speaking metalheads working at this place? Dude. They absolutely rule. They sport skull bandannas and Metallica tshirts and long, flowing metal hair. And they always play 'the Bone,' unless the asshole \"man\" is working, who makes them change the dial to ugly white baby and their ugly white mama music, i.e. Matchbox 20 and some other truly offensive shit. When this happens, I silently sympathize with my headbanger boyfriends trudging away behind the counter, thinking about the disgust and disdain disguised by their stoic faces at the sounds of Jimmy Eat World blaring into their rattled and buzzing metalhead ears, all while taking gigantic bites of my delicious veggie burger and inhaling handfuls from my bucket of fries.  Run-on sentences rule so hard.", "author": "Chloe S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-30", "description": "3.5 stars...\n\nI'd been here twice before the remodel and each time I went, there was a hair in my food. Each time! I vowed never to go back. \nBut it's been a while since the remodel, and I am a forgiving person, believe it or not. And my parents run a restaurant, and I know how hard it is. SO, I decided to give this place another try. My husband was very proud of me. \n\nI ordered the Mediterranean crepe and my husband ordered the french toast with the walnut bread. Two cups of coffee and an orange juice. \n\nThe food was good. My crepe came with potatoes AND a salad. My husband's french toast smelled really good! and there were 6 pieces! The orange juice tasted fresh and the coffee tasted decent, not too strong and not too light. The wait  for our food was a bit long, though. \n\nThis place is a do-it-yourself service. Order at the counter, pick up your utensils and condiments, seat yourself. They call your number and you pick it up. \n\nThere are a lot of tables inside. Good place for small to mid-sized groups and kids. Two tables outside. \n\nWe'll probably be back. It's the only place near by that does the crepe/omelet/pancakes/french toast thing, that doesn't cost an arm and a leg. \n\nTotal bill: about $22.00 with tax and tip", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-13", "description": "Okay so I've been coming here quite frequently to try different things on their menu. I have yet to be dissappointed. From the delicious variety of crepes to their pancakes and french toast....everything is simply prepared and fresh. The only complaint I have is that their coffee is pretty weak and the guy who works behind the counter (older dude) who looks like he's managing the whole place, is very grumpy and unpleasant looking. I could give him a few tips on customer service! BUT, other than that.....it's still my favorite neighborhood spot!", "author": "Anne E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-08", "description": "1. Tofu Scramble has unadvertised eggs in it.\n2. Register gal insists I should have asked if it had eggs.\n3. Register gal tells me that I need to pay for what they made for me regardless of the fact that there were eggs in there on the sly. \n4. I paid $11 for my consolation home fries ($2.25) and free sourdough toast.\n\n\nHonestly I wasn't even rude. I didn't even put up a stink. I brought back the eggs and suggested that they have management add to the menu  that the Tofu Scramble has eggs. The gal on the register was insistent that I was wrong and was persistently rude. Totally bad experience, I was just trying to come up with a suitable solution (extra side of home fries) and she refused to refund me any $. I paid $11 for the home fries and toast!\n\nSO NOT GOING BACK, EVS!\n\np.s. Totally annoying world music blaring on speakers.", "author": "Gina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-15", "description": "I've been coming here since it opened and have always loved the food.  Nothing too complicated or original, just good and tasty.  I love the chicken pesto crepes!  The best part about this place is that it is family run and the owners/staff are extremely friendly and always remember me.  The owner's son really makes you feel welcome.  The only negative is that this place is a bit pricey, but the quality of the experience makes up for it.  I have since moved out of the neighborhood, but will definitely stop by when I get a chance.  Support Moonlight!", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "Really nice place and pretty good food. I'm usually not a big coffee house person but I've been here 2 days in a row now.", "author": "Derek O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "Moonlight Cafe has become our favorite place for breakfast.  The food is quite good, the coffee exceptional.  The service is outstanding.  Everyone there, including the owner always have a nice greeting and very accommodating.  The place is clean and inviting, it's what a nice neighborhood cafe should be. \n\nM. H.", "author": "M H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-01", "description": "I like this place for no other reason than that it is decent and convenient to my house...certainly not worth a trip if there is something by you.\n\nSolid burgers, really good bacon.\n\nI discovered today that the owner / manager / register-guy really can't handle complaints...if you approach him with a simple one (e.g., that your 5 friends *finished* eating before you even got your french toast and eggs) he might just call you names, insult your personality, and tell you to get out.\n\nLove when dickhead managers try to make you feel guilty for their own mistakes.", "author": "David R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-12-17", "description": "The man who usually staffs the register and probably owns or runs this restaurant was belligerent to us this morning. He must have a freaky vendetta against Martha Brothers, or he has a deap-seated coffee inferiority complex.\n\nWe walked into Moonlight with cups of green tea in hand from Martha Brothers, where we originally went to get bagel sandwiches until learning they were out of bagels. At Moonlight, I wasn't sure whether to eat there or take out the bagels we were about to order. I said we'd stay, because I didn't want to waste the to-go packaging.\n\nThe guy there told us angrily that if we were going to stay, we'd need to pour our drinks into other cups. I understand that policy, but it seemed a little over the top. I mean, people leisurely walk up and down Cortland and stop in various places, so it's maybe tacky but it's not unusual to have a paper cup from elsewhere in your hand.\n\nBesides, I was almost done with the tea and was about to throw it away. I didn't want to waste another cup just to make him feel better about the integrity of his cafe's branding. We weren't flaunting a competitor's cups on purpose as some signal that Moonlight's coffee is inferior to Martha's.\n\nI told him that changing cups seemed silly to me. He blew up and said that we could leave if we didn't like it. \"Fine, we will,\" I said. We turned around and unfortunately, I also lost my cool and cursed to my feet, not quite under my breath. I've been to the Moonlight many times and I usually got along with this guy, even though he treats his employees rudely.\n\nAll of this happened after he was already yelling at an employee about who-knows-what for putting out a plate of eggs scrambled with artichokes. The guy needs some anger management. I wish him well with that.\n\nBut I won't go back to Moonlight, as many other places would gladly take my breakfast money. And I would gladly empty my cup if someone would ask me nicely. In fact, if I were asked politely, I'd probably even apologize for thoughtlessly bringing in another cup. Oh, the horror!\n\nHis cup policy makes him look like a jerk. It's not even what he's asking, but the way that he's asking. Why would I throw my money at that? I hope that someday, dozens of people all line up for breakfast there with other cups in their hands.\n\nIf he's defensive because people say Moonlight's coffee is bad, then he should improve it. If he's angry that other businesses compete with him,  then he shouldn't take it out on customers.", "author": "elsa m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-09", "description": "I tried to go here last weekend for breakfast and I stopped at Martha's \ncoffee first. and thenwalked accross the street. The owner was very rude and went on about how they do not allow any outside products that are not purchased there and I would need to put it in a cup right \naway.\n\nI understand you can't hack the competition there coffee is way better then yours that's a given.\n\nIt's the way that you ask be a little more friendly in the way you ask instead of Hostile. Due to this fact I will not be coming back ..But I will walk past ur shop with my Martha Brother's and maybe I will even linger at the corner for a bit.\n\nIf the food was great maybe I would not care that you have no manners. But it's not so whatever I can spend my money elsewhere.\n\nPlus I tried the food 2wice (check reviews below)\n\n I have been here b4 to eat breakfast it was okay and they were friendly enough but the breakfast combo's are not to my liking and it's not easy to substitute\n\nI also have had the cheesesteak here it's okay but does not compare to the cheesesteak shops at all", "author": "Kim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-02", "description": "The Mediterranean sampler plate is simply delightful and the owner is generous and amiable. Check it out!", "author": "Raphael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-07", "description": "I have been patronizing the Moonlight since the days when they were cooking food on a hot plate. Why? Because real people run this place and they greet me by first name. Where else in the city does a business know and greet you by name and ask how are you doing? If you want to see what makes this country great, go to the Moonlight where you will find passionate hardworking people doing their best to make a living.\n\nBeyond that the food is good and so is the coffee. I like the breakfast choices and the crepes make a great lunch.\n\nEnjoy!", "author": "james r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-09", "description": "The Moonlight Cafe is another of our office's semi-regular lunch spots. The turkey sandwich is good as well as the burgers. I have ordered the port wine burger the last two times.  The cheese in today's PWB was not melted, which makes or breaks this burger. You see, the cheese is made with port wine. I bet if they made the burger with port wine, the melted cheese wouldn't matter as much. They should ask me about my teri-burger recipe. It can be adapted to port wine. \n\nI've never had any issues with the staff. They have always been very friendly and helpful. I see others have had less than stellar service. \n\nI've never had an issue parking and have always found a spot on Cortland within a block. \n\nOne of my coworkers ordered the banana crepe. She described the crepe as crape. So even though they put the whipped cream on the side in a coffee cup, don't order teh crapes.", "author": "Kevo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-02", "description": "The food here was decent, but I'm giving it 3 stars because of how long it took for my friend to get her order of french toast.  What was supposed to be a 10 minute wait turned into a 30 minute wait.  I guess if it turned out to be the best french toast ever it would be understandable.  I had a cheese omelette here and I liked it, but some of the potatoes that I had with my meal seemed like they weren't cooked all the way through.\n\nThe artwork on the walls is all over the place.  On one wall you have a painting of what looked like burlesque dancing girls, one of who looked like her boobs were going to pop out of her corset.  On the opposite wall there was a painting of a street in Italy (actually I'm not sure if it was supposed to be Italy, but we'll just say it was).  I would have to say that my favorite piece of art was the statue of the small sumo wrestler that was placed over the entrance door.", "author": "Maria F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-11", "description": "I used to live a block away, and I went to Moonlight Cafe almost every single day.  The coffee there is way better than crappy Martha Stewart Bros., and it is a family-owned business.  Everyone who works there is super nice, and if you go in more than once, they make it a point to learn your name, or your kid's name, or your dog's name.  Plus, you can get an egg and cheese sandwich on a bagel for like $3.  It's not fancy, but it's homey -- and you can avoid the Starbuck's crowd there.\r\n\r\nAs of May '06, they just expanded their space and have a bunch more seating...", "author": "Bodacious T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-29", "description": "I like to go here by myself, read the paper, have some coffee, I'm very fond of the salsa crepes, I've tried a few other things but always go back for the salsa crepes, it's a nice, quiet alone spot, they have a couple of tables outside, so it's dog friendly, but stay away from the eggs, unless you  like brown, over cooked eggs, ( but I am pretty picky ) so try it out , salsa crepes.\r\n\r\nUP-DATE____________________________________________\r\n\r\nSo I went here today, and they have remodeled, which makes the place so much better, they have a full on kitchen now, they have expanded there menu, I had the eggs benidict, which was pretty good a little heavy on the hollandise ( and if i'm complaining, it must be a lot) but it's good to know that some where in the hood I can get a decent benedict any day of the week..", "author": "JIll H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-25", "description": "One of several cafes on Cortland Ave.  Choose your fancy.  It's your standard cafe with the standard chalkboard menu.  \n\nThey close early compared to most cafes I've been to--6 p.m. weekdays and 5 p.m. on weekends.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-06", "description": "This is a fabulous cafe for Sunday breakfast. \n\nThe coffee is fresh and strong, the egg dishes simple and cooked carefully per request. The staff is friendly. For people-watching, there are tables by the windows and two al fresco tables.\n\nThey also serve crepes and I saw customers with thick BLTs, plates of hummus and taobuli, etc. and salads.  \n\nBernal Heights is fortunate to have this cafe in its mix of neighborhood eateries.", "author": "Malati S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-27", "description": "The moonlight cafe has one of the best burger/fries combo's i have ever had in the City. It's not a burger joint at all and they don't try to be one, but the nonchalant burger entry on the menu is so scrumptious that you have to appreciate the time and effort they put into ALL their food. This is my favorite place to go in Bernal and it is a good prequel to a Maggie Mudd's shake or sundae. Minus one star for no soda fountain.\n\npost script:  I also love the murals on the walls. so pretty.", "author": "Curran M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-13", "description": "Extremely slow service. Wound up cleaning my own table after having been ignored by the waitstaff for 20 min. Well over half an hour after ordering our food (which was nothing fancy - 2 crepes) showed up, after some prodding. Food was good but not spectacular. Owner is friendly , thouhh", "author": "Thomas W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-17", "description": "Some items on the menu look good, but not all. I had a very simple scrambled eggs and bacon. It came in a hurry, with the toast not fully toasted and the bacon pre-cooked then warmed up slightly. I just ate it and now I feel pretty bad. My system just can't process that much grease. It was everywhere. They couldn't even get simple scrambled eggs right! Grease grease grease everywhere. Not fit to eat. Gross. Why did I eat it! I might have to hurl shortly.", "author": "scott f."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-11", "description": "Really like a 3 1/2.\nHad a really good chicken crepe here with pine nuts, cheese... Ok fries on the side and a bit of salad. My guy had a nice looking little apple crepe. OK coffee. Menu included burgers and sandwiches.\nService was fast; the place was clean, cheerful, pretty barebones; prices seemed slightly high at first but I was pleased with the amount of food I got on my plate.\nA perfectly fine little neighborhood breakfast joint/cafe.", "author": "Sara G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-30", "description": "Right down the street from me..... Friendly staff and great food.  Breakfast is great here on lazy weekends....even better on a weekday when playing hooky from work ;)", "author": "Mike S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-17", "description": "We got two sandwiches and the combo crepe (nutella, strawberries, and bananas).  The grilled ham and cheese and the tuna sandwich were both very yummy and satisfying.  The crepe at the end was good.\n\nI felt like the prices were just a bit high.  Otherwise, I'd go with 5 stars.", "author": "Mary K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "This is my spot for breakfast  since I work down the street. I am the Duke!!!!!! Sam the owner is the man and makes a mean latte. The potato's are made fresh everyday and the food made to how I like it. I haven't found another place in the neighborhood that matches this place. If your hungry come here!!!!", "author": "Dennis K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-06", "description": "At 3pm on a Sunday, this is the only place you can get food along this stretch of Cortland, which automatically earns it a star.  Breakfast all day gets it another star.  And then a third star b/c we didn't hate the food.  It was pretty quiet when we went in- no line, lots of empty tables to choose from.  My scrambled egg whites weren't exactly scrambled; more of like a fried egg white chopped into small squares.  Not the end of the world.  Potatoes + toast completed my meal- a fine greasy feast- and my partner was reasonably happy w/his chicken/pinenuts/provolone crepe.  $6 for mine, $9 for his.  Plenty of available street parking.\n\nThis place strikes me as a smaller, rougher-edged version of Crepes on Cole- menu is pretty similar, and it's also CASH ONLY.", "author": "Zoe L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-16", "description": "Walked in cold off the chilly Bernal Heights streets and checked out the menu...  and saw CREPES!!!! Even better was my fave: apples and cinnanom!!! So I ordered a chai tea along with the crepes then poked around for today's newspaper, while listening \"Highway to Heaven\" on their little boombox. The place was empty at 5:12pm Monday evening - just having seen some orange-red clouds at the sunset through all the telephone wires in the area so I was feeling very good! I saw the old man (referred to by other reviewers) cut up an apple and that gave me a very good feeling! The chai was much better than across the street at Progressive Grounds  - yeck - and when the crepes came, it was deliciously tasty!!! A bit of whipped cream with sprinkled cinnanom and apple pieces, and two crepes folded over with a light sauce and fried apples...  hmmmmm  I wuz in crepes heaven!! What really surprised me though was the cleanliness of the condiments table; even the shakers were clean and shiny!! wow!!! I have never in my life seen such clean and well-maintained condiments containers!! Even the honey squeeze bottle had a bit cut off its nozzle so a better tream could be squeezed out, and that's a rare sight in MY book!!! I'm a believer now and have found my Bernal Heights spot to eat and snack!\n\nMonday, 23 Feb 2009 = I've been here several times since my first review was written and the service, cleanliness and great chai teas and food in general hasn't changed! I go here each and everytime I am in the area, which is at least once weekly to deliver my sister to her neighborhood medical appt.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-07", "description": "This is a great little spot to enjoy a healthy breakfast or lunch.  I especially like the Mediterrean platter as it has a perfect mix of med. treats and is as healthy as can be.  The food is consistently good.  The service is also consistently friendly and prompt.  Perfect stop for a quick meal.", "author": "Camden S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-04", "description": "i have been eating at this neighborhood joint for 5 + years.\nIts one of my absolute favorites.\n\nBreakfast is fabulous...its family owned with a family vibe and friendly faces.  They have a couple of little tables on the sidewalk.  Their coffee is great...They offer American Breakfast, Greek, they serve crepes, and burgers, and falafel, and so many other wonderful treats.\n\nMoonlight will always have a special place in my heart.\n\nOh did I mention they bust they're boombox out on the weekends ...beatles, bob marley...just fantastic!\n\nCheers moonlight!", "author": "Ariane M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-16", "description": "3.5 Stars: Just your typical cafe in Bernal Heights that serves your basic breakfast and lunch. Nothing fancy or adventurous on the menu. Though it is a dine-in cafe, you order your food first at the counter, then when your food is ready, they call your number and you get it yourself.\r\n\r\nI do have to say that it is the most reliable place on Cortland Avenue to get breakfast. However, it can get pretty crowded during the weekend mornings and you'll feel rushed at times (because of all these people standing around you waiting for a table).", "author": "Zell C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-08", "description": "The food here is gooooooood.  Every time I go here everything is always really tasty.  Fresh squeezed OJ is good too.  \n\nIf I remember correctly, they don't accept cards, but have an ATM inside (not sure if my memory is referring to the right place).  \n\nIn my opinion, breakfast prices are a teeny bit high, but portion size and great taste probably make up for it.", "author": "Levi B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-04", "description": "Nothing more than an average, local morning cafe.  I got the lox and bagel and the brine that the capers are kept in was one of the dominating tastes...that shouldn't happen.  I live in the area, but I wouldn't go back again.", "author": "AJ K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-03", "description": "I have been here a couple times. It is across from my house. I'm going to say its OK. Not the best, but good for what you pay for. Fairly inexpensive. They do have fresh squeezed OJ which is kind of amazing :)", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-15", "description": "Really? $8 for a tuna melt and I don't even get a pickle? There's not even any celery or capers or anything in the tuna. You just opened a can of tuna and stuck it between two slices of cheese and some bread. You should be ashamed of charging so much for so little.", "author": "Georgia F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-01", "description": "very friendly people, lots of food and drink options.  easy place to hang out if you need a cafe for the day. food is fine though, not too impressive.", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-21", "description": "Amazing food, very friendly service. This little cafe has grown over the years both in size and skill. The food gets better and the service is still very warm and fun. Check it out the next time your craving a specialty crepe!", "author": "Chris R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-04", "description": "Stopped in for a ginger lemonade yesterday, and as always it was the refreshing drink of perfection.  Bonus: Sam, the owner, was there, and he made it himself.", "author": "Linda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-08", "description": "Best service in Bernal Heights and consistently good healthy breakfast options with fast and friendly service. The place gets crowded on the weekends after 11:00 a.m. so come early and be prepared to eat well.", "author": "P A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-12", "description": "I had the BLT sandwich it was good and my wife had the banana strawberry and nutella crepes and she said it's too chocolatey", "author": "Delfin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-20", "description": "I had gone by this place many times and after being done with a standing morning appointment,  in the neighborhood, I decided to have a late breakfast here.  I ordered pancakes with a side of potatoes with a cup of coffee.  The pancakes were fluffy and not too big and a very generous portion of seasoned, red potatoes, which were flavorful.  The coffee was strong, which is exactly what I needed.  The service was friendly and you get your money's worth with the portions of food being generous and the prices reasonable.", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-12", "description": "Lunch with my sister before pedicure.  Fast, good service and good food.  Great place to have quick breakfast or lunch.  My BLT was perfect and the bacon was crispy but not greasy.", "author": "Wendy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-27", "description": "I've been coming here since I moved to Bernal about 5 years ago. It's bigger than it used to be.Sometimes it takes a while for the orders to come out, especially if you have a few peeps with you.The owner is great.The Breakfast Pocket is my best friend.They usually do sausage or bacon in it, but I always special request diced ham & they are pleased to change it for me.Cash only used to be a problem, but they now have an ATM, so that makes it all better.Also love the Burgers, and my son , who is a huge potato lover can't eat enough of those fries!!!!", "author": "Ellice D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-24", "description": "For breakfast this place just seemed average. If I pay $9 (cash) for an omelet, I want it to be damn tasty. I want my potatoes to be crispy and flavorful. My spanish omelet was just okay- not something that I couldn't do myself with random fridge items & the potatoes seemed bland.", "author": "Chrissy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-13", "description": "They fixed the seating and there's plenty now. They've also done it up really nicely with some pretty murals on the wall. And the food, as always, is good consistent quality.", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-25", "description": "Moonlight cafe is everyhing I want and need on a Sunday morning. While I have not explored too much of the menu, I have identified a staple item that I look forward to every Sunday morning (hangover or not)...the \"breakfast in a pocket\". The concept is simple - regular white pita, soft and supple (oooh, i really hate using that word, but it's necessary here) stuffed with eggs scrambled with your choice of bacon or sausage and cheese. I personally go for the bacon with cheddar...and then go the extra mile...that's right...the SIDE OF CREAM CHEESE. (Damn, I am salivating) The folks there save me the pang of greed I feel when ordering my sinful side, and just include it next to my\nperfect pocket everytime I order. Yet another reason to love the moonlight cafe. Always kind, consistently yummy, and great neighborhood atmosphere. My only hesitation in filling that fifth star is that their only available hot sauce is Tabasco...would much prefer Tapatio.", "author": "Jessa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-17", "description": "A nice little place to get some crepes .... though they taste more like a thin omelet. The potatoes are kickin', and the salad though a bit tart is pretty good and healthy.  Love the ice tea ... but a refill should be in order. Not too busy and on hot days the windows open and sidewalk seating is the norm.... thanks Moonlight for being clean, comfortable, and A-OK!", "author": "Mark B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-17", "description": "I like this place.  Great neighborhood breakfast/lunch joint.  Really tasty breakfast pita with eggs and sausage.  Good crepes, good coffee and really friendly owner.  I'd give this a 3.5 stars if I could only becuase it is slightly (maybe 1.00) over-priced.  Very glad it's here though and the new remodeling is fabulous.", "author": "Aeon G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-11", "description": "Best (and only) no frills breakfast in Bernal Heights. Superior service and consistent preparation. Since its expansion earlier this year, and perhaps some increased word of mouth, bernalites now compete with migrants for table space at peak weekend hours.", "author": "j h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-09", "description": "This place is your basic, honest breakfast/lunch place with mostly great fast service.  I have personally eaten there a lot and like the owners and other folks who work there.  The eggs are made to order and the coffee is decent.  Plus I find/found it gives you a lot of food and their turkey burgers are some of the best.  I think the father and son who run the place go out of their way to make the place work very well.  \n\nThe desserts are totally boring and the musics is loud and really sucks.\n\nOtherwise I'm a big fan.\n\nBy the way all of you folks who bitch about bringing in your own drinks to a business establishment are rude and dumb.  Coffee and other drinks are the way restaurants make a slim profit a little bigger.  Why should you bring in something you bought somewhere else?  Get a life. Over 90% of places go out of business in 1-2 years because it's hard to make a go of it in the food service industry.", "author": "S.C. H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-23", "description": "My friends dad owns the place so once again i'm a little biased. Yummu yummy samiches. I had the grilled chicken the other day, it was simple a delish. Their friens are good and you get alot. I took off one star because there was no changing table in the bathroom. I know us woman with children are taking over the world but can you at least provide a tine table or something?", "author": "Angelina M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-20", "description": "Edited to add:\nWe have given Moonlight a few more chances and decided that we will not be going back...ever. The service and quality are just horrible. I'm sorry it took me 5+ trips to figure that out. Also be forewarned, it's stroller patrol and super kid friendly, dont be surprised to have several screaming children sitting next to you while you try to enjoy your brunch.\n\nOriginal review below:\nDear Moonlight Cafe....Bite me!!\nSeriously I am super pissed off at this place. It has the potential to be such a great little cafe but obviously the management don't care about the employees or the customers.\nFirst off, for what it is its overpriced. You cant charge those prices and serve mediocre food, you just cant. \nSecond the service is lackadaisical at best.\nOn my first trip there my meal (basic crepe and a latte) took forever but was ok, it wasnt great but it was edible.\nOn my second trip my meal (a bagel) took way too long, honestly how long does it take to toast a bagel????? Not only that but people who ordered AFTER us received their food first. WTH????\nWhen my bagel arrived I was surprised to see the worlds smallest bagel. It was an insult to decent bagels everywhere. It was almost comical in its puniness.\nThis place is just crappy and I will never go there again. Its too bad since its in my neighborhood and I love crepes. Oh well, all we can hope is that it gets sold to someone who actually cares about serving decent food. And if the owner reads this, maybe you should consider hiring another person during your lunch rush so it doesnt take 30 minutes to get a freaking bagel and while you are at it, try gettting some BAGEL sized bagels!!!!!\nPrice: overrpiced for what it is but overall relatively cheap\nAmbience: nonexistant\nDecor: laughable\nCleanliness: decent\nFood: mediocre", "author": "Catty C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-15", "description": "Let me start off by saying that I really like the friendly, casual atmosphere here and to top it off the food is good.  Definitely a dependable place to go for a quick, tasty breakfast.  I love the breakfast croissant and the breakfast pocket.  The coffee is good too!  (Hey, I like Martha's too but let's be rational Martha's fans ... do you bring your own cocktails when you go out to dinner?).  My dad even likes this place over Savor in Noe Valley.  For me, it depends on what type of breakfast dining experience I'm in the mood for.  Moonlight is the best when it comes to grabbing a simple, on-the-go, no nonsense, hot meal in the morning.", "author": "Julie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-14", "description": "I love this place! Talk about service with a smile. Their crepes are good (although I can't imagine really messing up a crepe) and their coffee is tasty. They have a delicious lavendar lemonade and their med platter is killer. It warms my heart whenever I see their funky little sign.", "author": "Maya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-04", "description": "Great during the weekdays because it doesn't get so crowded unlike the weekends.  Newly remodeled, it has lots of space and more tables for people to enjoy their Sunday brunch.  They have crepes, omelets, breakfast combos (which are my favorite), a veggie menu, sandwiches and burgers.  The staff always greet you with a smile and are always friendly!", "author": "Mel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-12", "description": "I love this place! It is two blocks from my house and I go religiously each weekend for their short stack of pancakes and coffee. I disagree with others about the coffee review. I love their espresso and find the neighboring martha's to be rather bitter. The service is friendly - I'm always greeted warmly by staff and the server knows me by name. I recommend the pancakes (obviously) and also their BLT is great! I think their crepes are essentially the same as crepevine, or others like that. I'm not a big crepe fan so don't really have much to say on that.", "author": "Suzi S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-18", "description": "Utterly gross.  This place would be acceptable if you are on a road trip somewhere in the middle of the country and stop off at the local greasy spoon diner.   Rubbery pancakes, hash browns taste of bouillon cubes, etc.  Never again.", "author": "Goldie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-18", "description": "I agree with Michael E., it's totally similar to the Crepevines and Squat & Gobbles, but with a smaller menu. Unless you happen to be in the Bernal Heights neighborhood, I wouldn't trek across the city (or Bay) to Moonlight. The food and prices are fairly reasonable, at least $10 per person. What I've enjoyed so far is their Port Wine Cheese Burger, Fries, and a glass of Ginger Lemonade.", "author": "Leroid D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-16", "description": "For an unseasonably beautiful November morning here in San Francisco, it was time to dine al fresco for Sunday breakfast.  My dad thinks it's the \"Earthquake Weather,\" but who's checking.  I drove up Cortland Ave. in Bernal Heights and used my parking karma on a spot near St. Kevin's Church.  How lucky!  The place is full of locals, families, some out of towners...good vibe.  The eggs benedict was perfect and the hollandaise sauce wasn't runny.  The potatoes were brown and not burnt and was served timely.  Only the coffee wasn't up the snuff; I would suggest going across the street for a bold cup.  The joint is family owned and the crowd is what you would expect in this neighborhood (very neighborly).  I am not bashing the Visitacion Valley folk in my 'hood, but this was a very nice place to have breakfast on a warm Sunday morning.  It's family friendly, too. I will be back.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-09", "description": "On my way out the door this morning and paid 8 bucks for a mug of tea and french toast. The guy behind the counter was really nice and for that I gave a more generous rating. However, the french toast was only borderline okay, and it didn't have very much flavor. Probably not coming back .", "author": "Adam P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-25", "description": "my great ex boyfriend Gabe lives in Bernal Heights, and I remember the first time i spent the night he took me there in the morning .I was half dead from hangoverness, and me and him and his roomate Edgar trekked up the hill to the moonlight cafe. \n\nits a cute little breakfast place, everything in bernal heights is cute do you notice that? nothing is off the hook amazing,its a total breakfast vibe, i remember my omelete being yummz.\n\ni miss that summer of 05, it was really fun", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-02", "description": "They're breakfast food is great! I love the toasted bagel with cream cheese, sun dried tomatos and cucumbers. and they're crapes are good too. Everything made to order and they're coffee is good, too.", "author": "Kelly Marie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-28", "description": "Usually considered a breakfast joint, these guys actually make the best burger in town. Go for the bacon...", "author": "Gordon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-19", "description": "i am reviewing this mostly based on service because i've only been here one time so far.  not that the food wasn't delicious!!!  it was perfect.  exactly perfect--my friend and i walked in and wanted a sandwich on a pita (their pita is magnificent) with falafel, hummus, avocado and grilled eggplant.  it wasn't on the menu but the man behind the counter said it was absolutely no problem, made it up immediately, charged us fairly and was extremely pleasant about it all.  this place is a few blocks from our final destination, which was maggie mudd's, so i know we'll be back soon.", "author": "kate s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-07", "description": "Went here because the line at Liberty was spilling down the street.  While the staff was super nice, the food was just bad across the board... between our omlette, hash browns, sausage, turkey burger & fries, we didn't like any of them.  Plus, they messed up our order, took forever for the food to arrive and it was definitely pricey for what you got .  Just kinda blah.  Two stars because I wanted to like it... and the staff really was nice.  As an aside... do all the breakfast spots in town that serve omlettes and crepes have the same people draw up their colorful-menus-on-a-chalkboard (i.e. gobble & squat, crepe 'n coffee, etc.)?", "author": "Ken H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-11", "description": "We go here regularly and think it's a fine place for what it is.  They have a wide variety on the menu, prices are very reasonable, and the staff is friendly -- especially if you're a regular.  The ambiance is nothing fancy, but it's a good basic cafe.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-10", "description": "Kind of Crepevine-like breakfast spot.  Good for a quick breakfast.  Portions are decent and prices are reasonable.  They are very anal though about no outside drinks.  They should work on their coffee then!  Closes early.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-26", "description": "Reliably good.  Not infrequently we find ourselves here. It might be that there are tables outside so we can munch with our pooch.  It might be that the owner takes a very personal interest each time we are there.  Perhaps, that the latte, tea and steamed milk with vanilla that we can count on to be good; whatever it is, we find Moonlight on a tight rotation.  My son loves the pancakes and the way the owner will bring our doxie a biscuit.  I love that whether I want a quick bagel or a more substantial scramble I can count on Moonlight to provide it with local-owned charm.", "author": "Gwen E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-07", "description": "The crepes were decent, but their sandwiches, especially their pastrami and philly cheese steak are downright embarrassing.  Their french fries come straight out of the costco frozen foods section and are downright disgusting.  Their prices are outrageous considering the quality of the food.  \n\nThe crepes keep this place from getting one star, but everything else is bad news cat.", "author": "Brendan R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-02", "description": "I've eaten here a few times.  The place has fairly good breakfast, it's a bit over priced, but was willing to forgo that because it is so close to my house.  \n\nToday, I discovered that the Eggs Benedict does not come with toast--never mind the fact that it is on the menu immediately above the words \"all breakfasts above are served with potatoes and toast.\"  I first mentioned this to the guy that had place my plate on the counter, but he told m that the Eggs Benedict doesn't come with toast.  Manager / owner guy was at the counter, and I asked him why it doesn't come with toast when, according to the menu, it clearly does.   He said that the biscuits that are part of the Eggs Benedict counted as toast.  What?  I told him that I disagreed and I felt like I was owed some toast.  He asked me what kind of toast I wanted, I told him rye.  Then, when the toast came he attempted to charge me $1.75 for the toast.   I refused on principal.\n\nI'm not going to cry over toast, but I am going to complain at the manager guy's terrible customer service.  For the two cents the toast cost him and a menu that was corrected the next time I ate there, he could have earned a loyal customer.  Instead, he earned this review and has lost a customer.", "author": "David L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-02", "description": "Moonlight has grown on me because you can get a good breakfast/brunch without all the bullshit San Francisco waiting for a good breakfast/brunch. Coffee? No. Go to Martha's.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-01", "description": "This place is ok.  Food and service are pretty average.  Mainly just like squat and gobble.", "author": "Alex E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-31", "description": "Moonlight Cafe is the perfect neighborhood spot. Yummy breakfast dishes are available all day, and great lunches satisfy those looking for hardier fare. They have options for vegans and vegetarians as well. It's hard for me to move beyond the basic crepe, but I do love the Mediterranean plate and the fab burgers my husband orders.\n\nI love their coffee, dark and hot, and they've just gotten a beer and wine license that lets them serve mimosas with fresh o.j. and a fascinating variety of wine cocktails.\n\nBut just as important are the staff and the customers. Sam and Aziz, the owners, work many shifts, greeting regulars by name, ready with their orders. The small tables are easily reconfigured to move together when a friend drops by, and when I walk my dog, I can sit outside with him as I sip my coffee.\n\nDrop by for a lovely, restful time, a quiet read or pleasant chat with friends.", "author": "H P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-27", "description": "Really delicious breakfast this morning!  And cheaper than brunch in Boston or Cambridge, MA (my erstwhile home).  Staff really nice and you can tell that cooking good food and being friendly to neighbors and strangers is important to them.  Spectacular bacon--rarely is bacon perfectly balanced between crispy and chewy.  If I had one _tiny_ critique, it would be the syrup--real maple syrup does so much more for pancakes, french toast, or anything else.  I should have thought to bring my own, like Jerry in the episode with Courtney Cox.", "author": "Dan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-15", "description": "Extrememly friendly service adjusting any order exactly how you want it. Wonderful bread for a chicken breast sandwhich. Definite must if you want a solid sandwhich, cold or hot, or breakfast.", "author": "S F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-03", "description": "I really like this place. Their breakfast choices are good and I like the falafel sandwiches. The staff is also very friendly and treat customers well. The only problem I have is the price -- it's a bit on the expensive side for what they offer, but I do keep coming back.", "author": "Dawn M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-06", "description": "I'm a pretty generous rater in my opinion but three stars is all i can give to this cafe.  The menu looks phenomenal and has all of my favorite things...avocados, sun dried tomatoes, hummus, salmon, spinach, etc. but when i got the yummiest sounding bagel they had it was a let down. I went with two friends who both ordered similarly simple things and it took 30 minutes to get our food. I might have been less judgmental had my simple bagel taken 10 mins, which is the time it would have taken me to make it myself. We ordered to eat in, and suffered the consequences. Everyone that came after us and ordered \"to go\" got their food in a jiffy...", "author": "Laura C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-26", "description": "I just love my local cafe. Service cannot be any friendlier and I love their food. We go here at least twice a month with the kids and I always order the Philly cheesesteak sandwich, that is my favorite cheesesteak sandwich in town -both the beef and chicken one. The food is great for what it is: affordable, fast, cafe fare, + the great service and flexibility makes them a 5 star place for me, no doubt.", "author": "carmen c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-11", "description": "quick, good service from super friendly staff and owner! great breakfast crepes with side salad. amazing grilled chicken sandwich. really crunchy yummy bacon on BLTs. good fries! awesome chicken caesar salad. Wonderful, nutty coffee. i think it's the best coffee in SF. really. sidewalk seating is great in nice weather! and again, good coffee, and nice hearty-sized mugs of various colors and types!", "author": "lesley f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-28", "description": "A great spot for breakfast or lunch. The crepes are terrific. Reasonably priced, good food", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-11", "description": "decent tasting chicken pesto crepe.  the salad and potatoes that came along with were a little sub par.  i had to run to martha bros for coffee and then noticed a sign that said \"absolutely no outside food or drink\".  this could only mean that their coffee sucks and it was a standard thing to go across the street for something better!  i got a few stink eyes for bringing it in anyway...", "author": "Robert S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-19", "description": "i have had many a lunch here and it never disappoints. try one of the middle eastern dishes or maza plates. the food is filling but not too greasy and their soups are always homemade. also, the owner is a real sweetheart and seems to pride himself on being a member of the community and not just a merchant...", "author": "Marcy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-01", "description": "I like this local place, but had the worst -- and  not cheap! -- breakfast I've had out recently. Everything was undercooked or overcooked. The food had no real taste.", "author": "birdy f."}
