{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "While crossing Colombus after having dinner at The House (on Grant), we heard The Isley Brother's \"Who's That Lady\"  blaring from their speakers. This siren call was our magnet to check out this funky, funky SF institution.\nMy god, the speakers sounded great--so clear but with a thumping bass too.\nThe bartender was sweet and she fixed us Ketel One martini's in no time at all.\nUFC was silently playing on the  TV's overhead as The Isley Brothers morphed into Steely Dan.\nI felt like I walked into a Clint Eastwood \"Dirty Harry\" movie.\nThe \"people watching\" windows were a real treat.  The drinks were strong.\nThe vibe is old school mellow.  This dive is definitely in a time warp.\n We did not fit in at all but yet we couldn't have fit in any better. \nI love my city.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-17", "description": "i don't recommend stopping in Mr. Bings if youre a young woman.\n\nMy friend and I stopped in here for a drink after dinner on a sunday night. It's a small place and quite a few people were there. 2 guys were completely wasted, and i saw one start to choke a girl (trying to be playful) and she ran out. My friend and i sat down and the same guy came over and started talking to us, not leaving when we said no to all of his advances. He went back to his friend and the bartender, and it was clear they knew the bartender well if not close friends. the two guys came back over more aggressively this time, the other one trying to get my friend to dance. When she said no and pulled her jacket up to cover herself out of discomfort, i looked over at the bartender who was watching and laughing. The guy in front of my friend then announced \"are you touching yourself under there? she's touching herself!\" \nwe looked at each other and pushed our way out, leaving feeling violated and dehumanized.", "author": "Andreya A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "Have to say us girls stumbled upon this place last night,  after a late walk through a deserted Chinatown.   \nThe music is what drew us in immediately.   Friendly bartenders in this divey joint, that had a great playlist to shake your tailfeathers!  \nWe heard about some secrets this lovely little joint has, from a jolly, local fellow we met walking the morning after we visited here.  Definitely a good enough reason to come back and stumble inside again.   \nWe had a grand time here!!!", "author": "Bridget S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Wow!\nThis place is pretty legit.  We were waking back from dinner in North Beach and ran across a small pub that had loud music and beers flowing...  decided to stop on by and have a few drinks.  The bartenders are cool, the drinks are cold and the music is loud.  \n\n\nWhat more do ya want?!?!", "author": "Jesse L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "Although we live in LA we frequent San Francisco at least 2-3 times a year and we always stop in to see our favorite bartender Jake.  This is a great old school chill bar in North Beach.  You are always guaranteed to have a great time and meet some very cool people.  It's a must add to your bar list when you visit the city.", "author": "T T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "My favorite bar in North Beach, hands down. The place is small, but it luckily never gets too packed in here. Perfect place to grab a drink with friends or make some new ones. I want to say there's around 7 beers on tap, but I order a mixed drink here so can't comment further on the beer situation.\n\nAll the bartenders are super friendly- shout out to Nicole for going out of her way to return a wallet to a customer who walked out of the bar without it. I've seen many bartenders do the complete opposite she immediately ran to his rescue.\n\nSmall table spaces in the back, bar in the front, plenty of room to stand in between.", "author": "Arezou A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-19", "description": "New place sucks. Great depiction of what sf is becoming: sterile with a bunch of d$&@chy tech nerds. Old\nMr Bing's was great, but I would choose not to come to this new place and have to\nEase drop on some boring transplants conversation.", "author": "Lev D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-03", "description": "Cute place but if you are just a group of women going you better watch your surroundings AND YOUR DRINKS. Please be careful! I cannot stress that enough. Again, WATCH YOUR DRINKS!", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "Situation:\n- Wednesday night with some friends (March 2017)\n- Orderded and Old Fashioned and some drinks for friends\n\nPros\n- The layout is a great improvement over the previous layout of the bar\n- Great service \n- Tasty drinks\n- Really nice atmosphere \n- They take credit cards ($15 minimum)\n- Amazing 80s music playing when I was there\n\nCons\n- Very few beers on tap (but some very good beer)", "author": "Dipesh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "When going to SF I usually stay near Chinatown/Financial distinct. Sometimes my hotel and flight schedules don't 100% line up. This is one of the places I go to kill a little time before I Lyft to the airport. It's a small dive bar. Nothing more to say. I've never been here at night. When I've been here during the afternoon it's been pretty empty.", "author": "Thomas F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-30", "description": "Wondering around Chinatown and looking for a drink and found this place. Yes is is a dive bar but one of the best times we had in San Fran. The drinks were excellent and bartender very good. The old fashion was perfect   The sign outside looks old and cheap but it is classic. Definitely recommend it.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-26", "description": "It's time for a \"MILESTONE\" review #200 to be exact. It's pretty nice considering my schedual at times to hit the \"200 review\" mark. So shotout to the city of \"San Francisco!\" North Beach in particular. All my milestone reviews (50, 100, 150) have come from me visiting \"SF\" spots. Now my review for Mr Bings gets to sit at \"200\" I've heard so much about this \"North Beach\" legendary dive bar. Word on the street (and the sign in the window) states this bar went through an ownership change. But the new owners want to still live up to the classic \"Mr Bings\" when they move their establishment in. But in the meantime it's still \"Mr Bings\" was it worth the hype? Well let's find out..\n\nAugust 24, 2016 Wednesday - One man (me) looking to catch a happy hour and go somewhere I never been before.\n\nAtmosphere - 2/5\nService - 3/5\nCleanliness - 3/5\n\nBackground - Mr Bings has been around for sometime. Some say \"It's a right of passage\" so it's only fitting that I set foot in there. Considering SF is like my second home to an extant.\n\nAtmosphere - Mr Bings is old, and you can see it..smell it..and feel it as you walk through the small nook if you wanna call it that, of a bar/dive. Stool seating is what is offered here. Although on the other side of the bar has beer boxes and such piled up taking away seating space.\n\nDrinks - I had two Coronas @ $4.50 a piece. That's a pretty decent price, still \"somewhat\" competitive.\n\nService - The lady that tended bar this day was polite and soft spoken. I don't know if that's a good formula for a bartender in the Bay Area, especially in \"North Beach\" she kinda went and sat away from the patrons. She came and tended us if we called her over, but the non interaction was kinda off putting. But at least the Coronas were cold and delicious.\n\nOverall - Mr Bings may not be for everyone,  but this place still has character. It really is a bar I'm sure every Bay Area bar hopper have a story to tell about their time here, young or old. I wouldn't say it left an huge impression on me..\"But\" I did cross this off my \"North Beach\" list of must visit places.\n\nFuture - Sure, I will visit again but the places where my \"crowns\" wait for me take first priority.", "author": "Tre S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-15", "description": "This place is terrible. Service is awful and they act a bit racist. They made some very unprofessional comments.", "author": "Nicholas T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-18", "description": "I like the place and go there once in a while. This time my friends and I were treated horribly by the door girl Melissa (I think?) First she told us to go away because they were having a private event, then she told us that she can let us in for 15$ each. After we refused she pulled out her phone and started taking pictures of us (not sure why?). Will never go again:/", "author": "Miner B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Great vibe, good music, the price is right, and the staff makes you feel like family.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "LAST CALL!   Goodbye Mr. Bings.  You've given so much to so many over the years.  Thank you for your service to the community.  \n\nYou served the working class in a high class town.  You served the strippers.  The mechanics.  The cooks.  The bartenders from all over town.  The suits.  The ties.  The tech workers.  The tourists.  The celebrities.  The bums.   The drunks. The drinkers. \n\nIn the end, you served so many, so well, in your little corner of San Francisco that you made us all return over and over again.  You gave us memories.  Helped us erase bad ones.  And kept doing your thing for so many years.  \n\nA part of San Francisco died today.  Progress comes one funeral at a time.  Today was your funeral.  Your passing makes way for the new.  And while it may not be the same, or even better, it will be new again.   Which any luck, what comes after you will one day be remembered as fondly as you were.  \n\nTime marches on and stops for no one, or no Bing.  \n\nCheers to you!  And may we all never forget you, until we ourselves are forgotten. \n\nAu revoir Mr. Bings.  So long, and farewell.  We move on into the night and the future, sadly, without you.   \n\nUPDATE FOR REOPENING UNDER NEW OWNERSHIP-\n\nMr. Bing's Dive Bar.  These words no longer have any meaning.  What once was, is no longer.  It lives on in our memories and the famous sign still attached to the exterior.  On the outside nothing has changed.  The rust on the sign still evident from years of neglect, pigeon excrement and San Francisco fog.  Familiar.  Welcoming.  Inside, a shock to the system to those who remember.  Gone is the horseshoe bar, the tennis painting, Ms. Pacman,  the warmth of the neon sign, and gladly, in this case, the mad dash of the occasional Chinatown cockroach.  \n\nWhat is gone has been renewed with a less soulful and less joyous reflection of San Francisco as a hard working town.  There are better spirits, craftier beers, new paint, lower lighting and gasp, candles on small tables.  The old shoddy and  thoughtless artwork has been reimagined John Taffer Bar Rescue style, complete with partial barrel wall adornments.  \n\nWhile the hookers, strippers, drinkers, drunks, and industry types move up the hill, deeper into Chinatown (Li Po, Buddha Lounge, and Bow Bow) the new Mr. Bing's feels like the overflow lounge for the far superior and pricier Comstock Saloon 20 feet across the street. This doesn't feel like Mr. Bing's and while that is ok, the future advances mercilessly, leaving the old behind.  I'd bet that this bar would be better served retiring the name, and the rotting sign, and rebranding entirely, thus avoiding comparison to what was, and blazing a new path for the location.  \n\nI do wish them the best, and I will continue to gaze admiringly whenever I walk by, and drown my sentimentality up the hill at Li Po, or plod into north beach and rest in Gino and Carlo. \n\nI stand by the five star rating because the new location offers good quality and much better service than the old Bing's.  Best of luck!", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "Mr. Bing's is a SF classic originally a cabaret this little, dark, bar is full of charm.", "author": "Rebecca R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "I guess this is an Irish bar. Was it always? Cheap drinks, cheap room. Live music, one bartender on a friday night. Packed.", "author": "James M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Fun little bar at the borders of North Beach-Chinatown. Jessica makes the best drinks and is the friendliest local San Franciscan! Highly recommended and coming from another local.", "author": "chickenskratch x."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "Best bar in San Francisco !!!!! Cool, chill, exciting all in one place!!!! Bartender Brett made these out of towners feel like locals at the best pop up karaoke shop!!!! WE WILL BE BACK and WE WILL PARTY #5StarsForever", "author": "Jenni W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "I had to review Mr. Bing's after reading about its sale and imminent closure (read here: http://sf.eater.com/2016/7/5/12100402/mr-bings-north-beach-closed )\n\nAlthough I haven't been here in years, I doubt much has changed. That was part of Mr. Bing's allure: it was a classic dive bar, a place where you order a beer-and-a-shot from the bartender, not a handcrafted cocktail from a mixologist. You didn't come here for the service or the cleanliness of the place. You came here for drinks that were stiff and cheap. \n\nIt was easy to find the bar right outside of Chinatown and I remember a few of my visits were on Saturday afternoons. They went like this: buy a beer and a shot, leave my change on the bar, pump some money into the jukebox, return to my seat, and people watch while enjoying the music. Then repeat until there were a few bucks for a tip and make a quiet exit. \n\nLong live Mr. Bing's.", "author": "Ruel G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-29", "description": "Man, it's disappointing me right now to write this review as Mr. Bing's was one of my go-to spots when I would crave a dive bar in Chinatown. That has officially changed. I rarely ever write one star reviews as I generally have great experiences wherever I go (thanks to Yelp) but, my last experience here is deserving of such low standing. \n\nIf you haven't been to Mr. Bings before you should know that it isn't known for friendly service, great drinks or clean bathrooms, it's just a part of its \"charm\" and you put up with it. In fact, when I think about it, this place has to be violating so many health codes it's not even funny. \n\nThat being said, a friend and I stopped by on Friday night for a quick \"pop\" and were swiftly greeted by some pretty poor service. I'd never seen the two bartenders before as it's generally a couple older gentleman but, these two \"youngins\" had the shift that night. It seemed like they had a few friends sitting at the bar and didn't want anyone else in there. One of these friends was what I'll call, \"an appraisive patron\" and was quite rude to me and my friend. We shrugged it off and tried to order a drink from the younger female bartender who swiftly replied, \"you need to leave\". Much to our surprise and the couple sitting next to us, we were very confused. We decided to stay for one drink after pleading our case and needless to say were \"mean mugged\" all night. The vibes were pretty negative. \n\nSo in conclusion, farewell Mr. Bings. You had a good run but, will forever be tainted because of two bad apples (employees). Oh, and fix the mens bathroom. Even for me it's pretty gross.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Old school joint with an awesome bar keep. Mary Ann is the shit, tip well. Hot babe that is great for convo. Good fun. Enjoy your stay", "author": "Josh A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Santacon 2017!  Best bartenders!  Taking the East Coast vibe to the West Coast. Yummy sandwiches and Christmas cookies to celebrate the day.  We loved the experience!", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-01", "description": "Mr. Bing's is still closed and will remain forever closed.\n\nHaving said that, you can now walk through the doors under the Mr. Bing's sign and find yourself in a bar, but the word \"bar\" in this case requires the following adjectives:\n\nPretentious, douchey, smarmy, unctuous, uncomfortable, not authentic.\n\nIt's the perfect bar for all the pretend San Franciscans who think they're cool because they live in San Francisco, but are anything but.\n\nI'm sure the new owners and the new clientele will be very happy I won't be going there again. One and done.", "author": "Yowz A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "Stopped in here for a drink after eating dinner in China Town. It was cool. Kinda divey but nice  enough to bring a date to for a few.", "author": "Jim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "What a dump! A beautiful, beautiful dump. If you don't like dives, get the hell out of, Mr Bing's.\n\nUpon arrival you'll be welcomed by the bartender, Scooter, and the vicious aroma of barf. It's very pungent but the root of the smell is not traceable. You'll continuously check the floor around you and the bottoms of your shoes to see if you've unknowingly stepped into the result of someone's Chinatown food poisoning episode - it's awesomely disgusting.\n\nAside from that, they seem to have a pretty decent jukebox, affordable drinks and with enough persuasion, an offer to challenge Scooter to a dice game of 1,4, 24. Gambling at a bar? Yep, not uncommon in this part of town but not necessarily advertised either as you just have to know who to ask. \n\nAfter reading my buddy/partner in crime's, Danny's review, I think he unknowingly coined Mr Bing's new slogan. It is as follows: \"Mr Bing's, sticky floors and stiff pours.\"\n\nMy kind of bar.", "author": "Brad B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "If you want divey, this is the perfect place for you! I enjoyed my time at Mr Bings mostly bc of all the random walks of life that enter in this watering hole. The drinks are awfully cheap and they play random music from 80s, hip hop, soul to rock\nwhile having the tv on to watch sports. The restrooms are dirty (what you can expect in most dive bars) and they only accept cash.", "author": "Joy-Alonica B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-09", "description": "I don't think I've ever liked a bar so much that smelled so closely to a port-o-potty. \n\nMr. Bings is what it is. A dive with sticky floors and stiff pours for a fair price. It's got better than average people watching and some dice games usually make their way around the bar top too. \n\nLook elsewhere if you're expecting anything fancy, but if you like your beer served with a potential side of dead fly this is definitely your spot.", "author": "Danny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "Phenomenal bar! Jake the bartender is one of the classiest and best bartenders we've met!!great drinks great local atmosphere and seriously Jake is one of the best bartenders we've met and this place is off the hook! They make you feel as if you're one of the family! We will be back! Thanks Jake!", "author": "Elisa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "Great Greyhound and very friendly service. A bit loud for 1:1 conversation but otherwise a great spot and location!", "author": "Martha U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-08", "description": "Came here after seeing it on an Anthony Bourdain episode in SF.  Casual, cheap and no frills place right off Columbus Ave in north beach.  Beers were $4-5 each and cash only. Good attentive service and the patrons all seemed like locals relaxing having a good time. \ncheers.", "author": "Kelsey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "Mr. Bing's is a divey little american bar right off columbus just outside chinatown.\nIt's nothing fancy. The bar is well laid out and the staff have been doing this awhile. The regulars are friendly the beer is cold and while this is not a sophisticated place-wouldn't hold out hope for anything resembling a mangotini-it's a comfy place to have a conversation and drink some beer and a shot.\nDomestic's will run you almost five dollars-well, four dollars but I left a dollar tip. Pabst is the bargain special at two bucks.\nCash only but the usual atm (with fees) is on site.", "author": "Steven W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "What a facelift! For a legendary Iconik bar Mr Bings! Great staff / DJ and service.. best dive bar next to comstock ! \n\nThe doorman, Yonah, deserves a Purple Heart !", "author": "Khoren E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "This place has one of the worst bathrooms in the world and people complain about it, but this is by far one of my favorite bars. \n\nNo frills, no bs, just drink. You will catch some old timers/regulars here still and they can tell you some history about Mr Bings.", "author": "Lyman C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "Dive factor?  The highest.\n\nDrinks?  Lethal.\n\nVibe?  Ultra low key, ultra casual, ultra cool.  \n\nUltra cool.\n\nThe band Metallica have been known to hang out here.  Several times.\n\nWay, way, WAY before Anthony Bourdain showed up.\n\nLocation?  Pretty Stellar.  It's on Columbus Avenue, on a corner that merges FiDi, Chinatown, & NB.  \n\nService?  Always neighborly.  \n\nGritty, divey, grimy, seedy, & dark.  \n\nThe perfect setting for a Dashiell Hammett or Raymond Chandler novel scene.  Or a Chinese underground piece.  And anything film noir.  \n\nESPECIALLY when it was okay to smoke inside.\n\nA friend of mine used to bartend here.  He loved it.  No pretenses.  No hipster.  A thoroughly man's man kind of joint.\n\nThe drinks are notoriously strong.  Definitely not for pansies.  Ladies, EAT FIRST for chrisake!  Unless, of course, you're only doing beer.  \n\nA real gem of a joint.\n\n4 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "There are dive bars, and there are AWESOME dive bars.  Bings falls in to the second category.\n\nWe stumbled in to this place 20+ years ago on a boys football trip and we were impressed with the cash only, great selection, low prices of the cocktails in a town with so many trendy bars. We were drinking Jaeger shots that were easily three gulpers that about broke your neck from the shock. All for about $5 a shot.\n\nWell, I just happened to stumble on Bings again this week and how could I not stop in??? I am glad to report that nothing has changed and the dive factor that makes this place cool is still in full effect. The sticker cover condom machine in the bathroom gives this place a sixth star all by itself.\n\nA couple of things to know about Bings.  Don't bring a posse. The place holds maybe 30 people if you sit on each others' shoulders. It's small, for locals, and they give zero shits why you are in town or who you know.  Potty before you come. The bathrooms here border on third world and you only want to use them in case of emergency. Boys have it easier than girls in this place as we have proper equipment for not touching anything.  Last, just have fun. Lose the ego, the uppitiness, the swagger; Bings is all about drinking big shots or beers with a  few people on your way through life.", "author": "Travis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "100% recommend this dive bar to anyone visiting SF. Jacob took great care of us and kept the drinks coming. I would give 6 stars if I could. Until next time!", "author": "Hunter P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Excellent cocktails, unrealistically flattering painting of Shane MacGowan. Not too crowded, good soundtrack the whole time, behind the curtain was just a closet not a magical play area.", "author": "leo b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "You've stumbled into Mr. Bing's, possibly a hair drunk with a high probability of sore legs from walking through Chinatown.\nIf you can manage to teeter onto a bar stool and can audibly order a drink, you've just found your spot for the next several hours.\n\nMr. Bing's was featured on an Anthony Bourdain episode, which honestly, is what brought us in. The bartender and locals are what made us stay. \n\nThere aren't any special drinks.\nThere aren't any things to nosh on.\nThere aren't any hotties waiting to get picked up.\n\nIt is simply the dive-ist of bars San Francisco has to offer. Order your favorite spirit and open yourself up to talking to locals. From the local who refuses to move because he got his rent fixed back in 2011 to the flamboyant group that just got in from Castro, everyone was friendly, talkative and willing to buy the tourists a shot.\n\nIt's the only place that the person behind the counter handed me a sharpie and nodded towards the bathroom, softly saying \"go\", welcoming the signature of a Houstonian.\n\nComstock Saloon and Mr. Bing's have a thing going on between them- stay long enough and you will get to laugh along with all the locals while shots and beers are walked back and forth across the street.\n\nTo quote Bourdain, \"What kind of sick f***in' freak would not like this place?\"", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "Mr. Bing, Mr. Bing!\n\nOur first stop, when we got to San Francisco on a Friday night. It was our first destination to pregame and then head out to other bars in Chinatown. \n\nWowa! My first impression of this place is for regular customers to come and hang/chill with their buddies. Felt like it was not really a place to make friends or be loud.\nIt was quite...interesting.... They have jukebox, dollar for one music. \n\nThe restroom have one stall, that I know of, for the women.\n\nMy friend started to order our first drink, which was AMF.... \nThe bartender was not cheap with the alcohol. Each sip was pretty lethal. The PLUS side that it was inexpensive! LOVE THAT! Especially how strong that drink was. \n\n\nService was EXCELLENT! The bartender, Lyman was super nice and friendly! Even though he booed LA -.- \n\nLyman, was the only bartender there for couple of hours that I came in. PROPS to him having to deal with so many customers on a Friday night.\n\nJukebox plays random music as to what the customers would request. When my friends added their music and it started to play. We couldn't hear the music, so we ask the bartender and he bumped up the music for us! SUPER NICE! \n\nThe bartender's friend Jason was there. He was helpful too! Some of us needed water, and he got it for us! THANKS!\n\nAfter we down our AMF, my friend bought another round of shots, so that we can start heading out to other bars.\n\nJason, the bartender friend was outside and we were asking him about other bars around here. He was nice enough to walk us over to the other bars that was popular. But that place called Cosmo was closed, so we ended up back to Mr. Bing!\n\nWe stayed here all night. We even got other customers to dance with us. Even though this bar is pretty small and not for dancing crazily.\n\nThis place is CASH ONLY! which is understandable, for their inexpensive prices and strong drink. Once the cash runs out that is when you know you need to stop.\n\nAWESOME place! You just got to know how to loosen up and have fun!", "author": "Jenny V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "Really neat little place, kind of divey but perfect for a happy hour cocktail or beer. Excellent service from a friendly, knowledgeable bartender.", "author": "Miranda P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "i used to be a regular here when the place was a triangle shaped dump. The tore out the old bar and put a small one with more room to breath. Love the new atmosphere. Needs more rap and top 40 music though. Great job.", "author": "Armando E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-01", "description": "How have I been in San Francisco this long and not gone to Mr. Bing's? It's probably because I pooh-poohed it for years. I've walked by that tired-looking, circa-1956 sign hundreds of times never giving it a moment's thought until of course, a very drunk Anthony Bourdain showed up there on \"The Layover\" and immediately praised it as a \"fine drinking establishment\". So when I was going out with my gal pal Rene for a little nosh at Bix nearby, it was my brilliant idea to come here afterward for a nightcap last Wednesday night. Unless you're a social hermit like myself, you already know Mr. Bing's is at the vague line of demarcation between Chinatown and North Beach on a prime corner spot on Columbus Avenue (photo: http://bit.ly/Zz69Eh).\n\nThe odd angle of the building in which it is housed makes the V-shape bar the dominant feature of the space (photo: http://bit.ly/YcYWsF). It looks like it once aspired to be a tiki bar but failed miserably and ended up wallowing as a seedy dive buoyed by the high-spirited company it attracts. It was pretty quiet that evening except for a group of hooligans I thought were college kids on spring break. Imagine my surprise when I turned my head to discover the people were around my age. One particularly obnoxious character kept flashing his ample beer belly to passers-by outside the window letting out a girlish whoop. Even more bizarrely, a pair of women kept taking photos of him from their iPhones perhaps to send as incriminating evidence to his obviously soon-to-be-ex-wife.\n\nRene and I parked ourselves quite comfortably and ordered with alcoholic aplomb, the likes of which haven't been seen since Mickey Rourke and Faye Dunaway in \"Barfly\". Probably around six bucks a piece (...who can remember?), she ordered a gin and tonic, while I had a Makers Mark and ginger (photo: http://bit.ly/Yltafa). We kept quizzing the bartender about Bourdain, but he said he was hired after the episode taping. So much for anecdotes we could share with our grandkids one day. I have to tell you after I downed my second drink, I was feeling more than relaxed. All I needed was a mirror, so I could pretend I was Jack Lemmon looking at his reflection in \"Days of Wine and Roses\" as he says, \"I wonder who that bum is. Look at me. Look at you. Now look at me again. We're a couple of bums.\" I smell an Oscar nomination.\n\nCOCKTAILS - 4 stars...feeling no pain\nAMBIANCE - 4 stars...the dive to end all dives in SF (photo: http://bit.ly/18nATs9)\nSERVICE - 4 stars...he poured 'em with élan\nTOTAL - 4 stars...now I feel like having a fat greasy burger at Sam's (belch)", "author": "Ed U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-10", "description": "Your typical neighborhood dive bar. Well lit with big windows facing out on a busy corner of Chinatown/Little Italy.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "Yow-zas!!!  This is a great place.  Its divey.  Its dark.  Its dank.  Its ri-DIC-ulously awesome.  If you are going out downtown clubbing and you need a pre-party place, THIS IS IT!!  Large pours.  Stiff drinks.  CASH ONLY but you'll be happy you didn't bring a credit card because you might just forget it behind with the amount of alcohol you could drink here with only a few swipes.  On the weekends it can a fun place to hang with some friends or even mingle with other locals.  The bartenders are friendly enough too and will occasionally drink with you.\n\nSo come one, come all...to the diviest place on Columbus!", "author": "Cary L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-18", "description": "This place is awesome!!! Scooter , agii, Lyman!!! Just great people! Love them all!! \nThey're pretty good as liars dice.... Paying tuition to learn is well worth great the crap talking that comes from their mouth!\nI come here as often as I can to watch all the crazy that happens here, if your in town this is DEFINITELY the place to check out!", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "If you give a dive bar a 5-star rating then it is the diveyist of dives! I love it! Enough said!", "author": "Steve T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "I really like this place. Nicole made me feel really comfortable. She was really nice and she provided great customer service. Definitely would come here again.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-12", "description": "Mr. Bing's is on the corner of columbus and Pacific. place has been around for decades. \n\ni seldom went there in my youth. reason being bartenders are usually older males while other bars hired young women.\n\nin the olde days, microbrews didn't exist. usually drank cognac, michelob, or heinken.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Great location !!! Found a park across the street. Bings has changed for the better and the bartender Jake was a blast.", "author": "Tanesha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "This place is not closed! Love it. Great staff and reasonable prices for North Beach. I met some awesome people there. I will be returning.", "author": "Lyndsay P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-16", "description": "This bar deserves to be on everyone's bucket list because it has such personality.  Ambiance is very important to me.  The ambiance in this place is so bad that it becomes \"good\".  Neon lights flood the place with light making you think you are in a bad hamburger stand somewhere in a bad part of Bakersfield... only the people behind the counter serving you the drinks appear to be strangers from Chinatown who have as much interest serving drinks to you as they do cleaning up the cages of the live animals they have for sale.  I love the steely eye indifference the orders are taken, the robotic and bored movements required to make your drink served with expressionless faces that instantly turn away once the drink is deposited in front of you.  The animal has been serviced.  Next?\n\nTime stands still in this place.  There is absolutely no effort that goes into making Mr. Bings better or worse.  It is what it is and it will always be as long there is someone in the family that owns the place to come in and crank the handle on this family cash cow.\n\nThe night I was there, we had been at the Comstock across the street for drinks.  I loved the place when it was San Francisco Brewery... now The Comstock.  I hate it.  At Mr. Bings, one of the Comstock waiters that served us came in after his shift to have  glass of Mr. Bing house white wine and hit off  the Chinese girl who serves.  She clearly had no interest in him and it was pathetic to watch him attempt conversation with the people behind the bar who wanted nothing to do with the losers that come in for their fix.  It appears that he wanted to be \"a regular\".  \"Hey!  You know me!  I've been coming here every night for a month!\" - but each time anyone comes into Mr. Bings it's like a flock of chickens - none of them have names, they all make the same sounds and they all look alike.\n\nGo to Mr. Bings.  You will feel like you are doing something illegal - it should be.\n\nTip:  My friends ordered up a Homobile to take them home after Mr. Bings.  While waiting for the car he started to get into the wrong car and the driver turned on him with such fury that I was astonished: \"Get out of my car you f#!@ you  f@!!!$5 or I'll kill you!\".  (My friend is one of the kindest and most loveable people you'd ever want to meet.)  Just double check before getting into a strange car:  Is it my homobile or not?", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-23", "description": "North Beach joint that was a little odd when I came. Everyone was sitting at the bar, not talking to anyone else, and just watching the small TV above the fridge.\n\nFew great things:\n- The picture on the wall of the woman walking with her bare ass cheek showing. Snap a photo of this and send it to mom!\n- Have the bartender teach you how to play the dice game 1-4. I had a great time even though I lost $2.", "author": "Lawrence H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "Stiff drinks & funky beats! Raiders on a Satrday afternoon, cold Sierra nevada psles & stiff vodka sodas", "author": "Rigo J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "Dive bar, it's showing its age and smells of it.  Regardless, dive bars can be a little oasis which this place is.  My dirty martini tastes wonderful after several hours of wondering the city.  Salud!!", "author": "Shan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "While in San Francisco for work, I stumbled into this bar late one night...on Halloween. It was the only bar on Columbus that had room for me. I ended up spending the enitire week perched on a stool there, at times the only one in the bar.\n\nLast night while watching Anthony Bourdain's The Layover on Travel Channel, he too spent the entire evening there and stumbled out stinking wasted. Now I'm sad because this place will be overrun with tourists and Hipsters. Thanks Tony. : )", "author": "Gary M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-27", "description": "I think the daytime may be a bad time to hit this spot. Smells like salami and had the worst service I got in my time in SF. If someone dragged me here again I'd give it another go but I'm not going to otherwise with Vesuvio around the corner being so awesome.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-25", "description": "This place is pretty terrible. The owner sat in the back corner with his friends and stared at every female in the bar (only 3). Then at 1:35am he turned off the jukebox I had money in. He refused to give us our money back even though our songs wouldn't be heard. Pass on this bar.", "author": "Daniel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "Yasmin - is- the- best. Hands down the most fun bartender ever. I love her. She should've here every day. Her music is on point. Like really on point.", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "This place is the best addition to the neighborhood since I lived here in the late 80s. It's about time somebody opened something like this.", "author": "Fahkin A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-16", "description": "Perfect dive bar to watch a baseball game. I hope it doesn't change too much under new ownership.", "author": "Sean C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-25", "description": "Mario, the bartender, shut off the juke box after I deposited money. They shut the bar down at 1:30am and force you to get out. No thanks.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-31", "description": "\"Creep\" by TLC was playing when I walked in, so yeah, what's not to love about this place?\n\nCheap drinks and a great dive atmosphere, \n\nI will definitely return next time I am in the Frisco.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "Classic dive. Too bad it's closing. Cheap drinks, funky decor. Not at all fancy. Has big window onto Columbus.", "author": "Osama B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-16", "description": "I call this place Mr. Trump's. It was a shitty dive bar that smelled like sewage. New owners revamped it but kept the name. I stopped in for a drink. The bartender seemed wired and trying to impress some lady patrons. I sat at a table and looked around, took out my phone to take a picture of the new decor, heard the bartender tell the bouncer, \"HE TOOK A PICTURE!!!\" and was promptly lifted out of my seat and ejected from the premises. No signs, no warning, no nothing but a humiliating boot in the ass. I guess they think they're Zeitgeist. I had to laugh. I live in the neighborhood and these jerkwads won't last. I swear it had something to do with curiously jittery behavior of the staff. Avoid at all costs.", "author": "Dean V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Stoped in yesterday for one last Martini. Sadly it probably won't be around on our next visit.", "author": "Heidi W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-13", "description": "You know I've always heard people saying \"damn those techies and hipsters are ruining the city\". I've always kinda sorta agreed but didn't give it much thought, until now. An iconic Chinatown dive bar completely hipsterized. If you want a cocktail for some craft beer go to comstock, a shot and a beer you go to Mr. Bing's, well at least you used to. I would've respected this business if the new owners kept it as is and held on to some of what's left of the old San Francisco. These guys should change the name so people don't get confused with the old bar because it is not the same.", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-09", "description": "If you can get past the smell of disinfectant, this place has definite charm! It's patrons are certainly great for ppl watching purposes - we we went there was an old guy asleep on the bar. A great little piece of Americana in a city that sometimes tries too hard to be sophisticated/European. Love it.", "author": "Fi M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-25", "description": "i was giving this bar mr. bings a 5 star because one of the bartender welcome me and she's hot.. hehehe. good jukebox.. lots of people celebrating christmas eve..\nmerry christmas and happy new year to this bar.. bings\nbut after i saw and watching everything?.. because of this manager asshole no respect to people who you work with?.. \nmanager?.. im sorry its christmas and he just ruin it..\n\nfyi : this manager mike is fucking asshole i wont give this bar a 5 star no way ... because of this manager asshole no respect to people", "author": "Nestor N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "Fantastic low key dive bar with a terrible bathroom, random Galaga machine and affordable drinks. Been here several times and it's been really slow with a ball game on the TV and a laid back bartender. My kinda joint.", "author": "Chad O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-13", "description": "Disregard the Bing \"decision engine\" pushed by Microsoft since the only decision to be made in here is by no means, micro and soft.   \n\nOrder a cheap drink.  The night we went; the dude poured a little heavy and I loved every hard moment of it going down  There's no dicking around in here. What.", "author": "Jay D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-21", "description": "Hey, have you ever been kicked out of a bar for saying you wanted to move on to another bar. Yeah, I hadn't either until I came to Mr. Bing's. I'm actually shocked by how high their rating is, because it was, hands down, the worst bartender experience I've ever had, for a bar that was already pretty gross inside.\n\nI walked in this past Friday night, post-happy hour to meet some friends that were already there and was immediately turned off by the mildew, locker room stench emanating from the bar. It is also cash only and I didn't have any cash, so I was waiting for my friends to finish up so we could leave.\n\nThe bartender came up to us, immediately with an attitude, and asked to see all of our IDs, even the people that already had drinks in their hands. I explained I wasn't drinking and she said it doesn't matter. I understand this is reasonable! This is not what I was upset about, but she literally was looking at us as if we were belligerent teenagers. So, since I felt very uncomfortable in this smelly bar, I, to be fair rather dramatically, said let's go I don't like this place to my friends, which caused her to flippantly wave me out the bar. When my friends were taking a long time getting out of the bar, I went to go grab them and she yelled at me to get out the bar. When I said I hadn't even done anything, she just continued yelling at me to get out. I tried to ask what I had done and she just looked straight ahead refusing to talk to me. I asked what her name was and she refused to talk. Hey if you're going to be a complete, unreasonable jerk to your customers and drive out a party of 8 people, at least be professional enough to give me a reason and your name. Also, yup, she'd rather lose the business of 8 people then try to be remotely friendly.\n\nWhen I called the next morning to make a complaint, they hung up on me.\n\nSo, yeah, clearly this dive bar doesn't care about customer service, but avoid the very angry, Asian bartender with the tattoo on her shoulder since I don't know her name.... Better yet, avoid the bar entirely.", "author": "Christina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-26", "description": "Chinatown also has an enjoyable amount of really odd shaped bars. Mr. Bings has this triangle thing going, which I kind of like, and they make strong drinks, which I definitely like.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-20", "description": "Don't play liar's dice with the bartender.\n\nI witnessed a regular down 5 shots in 10 minutes because he kept losing. If that was me, I would've been [ fill in the blank ]", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "Staple dive bar. My go-to down the block when visiting our place in SF. Stick to getting a beer. Cheap and reliable = perfect match for a frequent neighbor.", "author": "Darcy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-29", "description": "Definitely My Bar of Choice When I am hanging out in the city with the best baseball and football teams ever! Go Giants Go Niners! Anyhow, you can expect strong drinks that won't break the bank. The jukebox has a nice selection of tunes.\n\nSee Ya Soon Mr. Bing's", "author": "Carey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "Divy, charming and a great time.\n\nThere has always been something about the lack of effort at Dive Bars that's been my number 1 reason to go to them and Mr. Bing's is no different.  I hate how sterile all the big chain restaurants are and the clones that all go to them.  Mr. Bing's had a great mix of people and the sketchy ambiance just makes it so much better.  Their not pretentious, they'll have a drink with you, provide good conversation and not give a shit about being all proper and by the book.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-29", "description": "Nothing better than a Budwesier tall boy on a Saturday night. Brought me back home...\n\nThanks, Mr. Bing's!", "author": "Abby S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-01", "description": "I would give this place let's start but it doesn't give me that option we walked in and the guy look like we just shot his dog he didn't even acknowledge us what a dick", "author": "kenneth m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-06", "description": "Went there too early in the night I think.  The bartender was great fun but the place is old and dirty and smelly.  Might be better later in the night after I have already had a few somewhere else. It is truly a dive bar.", "author": "Jean C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-31", "description": "Love this Bar! Great vibe and awesome prices. The best thing about it is Erin the bartender! You will love it and her!", "author": "Allan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "Small dive bar seats 50. Good juke box. Strong drinks reasonably priced.", "author": "Coral H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "Don't expect fancy drinks or sturdy barstools at this chinatown hole in the wall, but they make mean dirty martini and can be fun with the right crowd.  This is a small joint on a busy corner in the main street of Colombus which borders San Francisco's adult entertainment district, North Beach and Chinatown.  The drinks are cheap and the service is fast.  There is a cool high tech touchscreen plasma TV juke box that fishes music from a huge database of songs that ranges from current Top 40 all the way back to the Phil Collins originals.  Mr. Bing's is your classic SF dive.", "author": "Jaydee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-21", "description": "The perfect dive bar at the perfect time. \n\nMr. Bing's is always there when you need a stiff drink and a good song on the jukebox. The staff is super fun and friendly too!", "author": "Janette W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-03", "description": "If you're like me and the whole club scene with loud music and terribly lighting filled with sweaty folks attempting to dance in the space that could be mistaken for a sardine can is just not your interest, this dive bar represents exactly that sort of paradise. \n\nEven if it's as dive of a bar that dives could get. \n\nThere's a fairly large area behind the make shift bar that is decent in mixing the basic spirit with soda concoction. But don't be expecting any sort of crazy mixology stuff. Unless you're alright with the extent being a drink name that ends with \"on the rocks\" \n\nThe beers to choose from are fairly shitty ones with a few local craft beers tossed into the mix at a bit more of a price premium. You have one bartender behind it all serving the large V shaped bar top and at any given time there's some really old black and white movie playing. \n\nThis is, for all intent and purpose, the land that time forgot. Were you could literally and figuratively come here and let time pass you by as you forget your problems. \n\nThey have a Ms. Pac-man machine in the far corner and the decor is everything you would expect your grandpa to have in his basement \"study\" that they converted over to a bar and pool table room.  \n\nIt's dark, dirty and the service is typically done with an I don't give a shit attitude. It's part of the charm. But it's also done in a way that you're not offended so much as you feel like you're just annoying them. \n\nIt's a great spot to either start or end the night. As it could always get better or at least it can't get worse than here.", "author": "Javier J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-29", "description": "Liar's dice.  Nothing on tap.  My most hilarious nights out generally include this place.  'Nuff said.  \n\nGlad the surge of hipsters that flooded this place after Bourdain's visit has since died down!", "author": "Allison B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-28", "description": "Gross. It smells like the toilet in here. Also, the bartender has a major attitude which is odd. Nothing has been updated since about 1968. Gross. Many better options in the area for a cold beer.", "author": "Robin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-05", "description": "MR BINGSSSS\n\nIf you want awesome bartenders in Hawaiian shirts (like for real) go to Mr. Bings. Inconsistent drink prices (BUT all very cheap and stiff) you gotta go to Mr. Bings. \n\nLiterally the bartenders would give you your dollar you tipped them back to you to play more music (if you're the one feeding the dollar jukebox all the time like me). \n\nThis place looks like it's going to fall apart, but it's really the most consistently awesome dive bars in the area. You always feel welcome, and the bartenders are soooo funny and sweet! \n\nIf you're lucky they've stocked the bathroom. Not just with toilet paper, but with novelty condoms and other awesome sex toys and trinkets you can buy from these outdated quarter dispensers.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-07", "description": "Mr. Bing's was the last stop on a long bar hopping evening. When we walked in Ruggy asked the bartender what his favorite drink was and the guy answered a shot of whiskey. I knew at that point we were in for a treat. \n\nRuggy then changed his tactic and asked about the guy's favorite beer they carried. The answer? Coors Light. Yes, this bartender was that awesome.\n\nThe guys ended up getting some beers and after perusing the liquor selection I asked for a blueberry vodka and soda. I received some sort of pinkish red drink. Oh well, I'm not the kind of person to ask questions so I drank it. Also, I was guessing it was probably plain vodka and cranberry juice.\n\nThis place is pretty small and kind of cramped, but I like their style so I'd come back and order another cocktail and drink whatever mystery drink the bartender gives me any day.", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "So this place rates at a TWO on your Broad Spectrum Bar Analysis, but a solid FOUR on your Highbrow Divebar Index\n\nWhy?\nThree reasons....\n\n1)  Bruuuuuuuce!\n2)  Stocks 1.75L bottles. Phe-pho'-ken-nomenal.\n3)  Triangular bartop in a flatiron room.  Check the layout.\n\nName any other bar that can claim any of the above...  That's what I thought.", "author": "David D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-03", "description": "While I'm all for dive-bars, Mr. Bing's won't make it on my \"best dives\" list. Here are my qualms:\n\n1) You call that a Vodka Soda?!?!? That is the smallest glass KNOWN TO HUMAN KIND! Seriously. I wanted to ask the bartender if it was a joke, but it was pretty evident it was not. I wish I would have taken a picture. The glass was a joke.\n\n2) Only 1 BARTENDER? On a Friday night? Really? \n\nThings that give this place potential:\n\n1) I love places that let their customers pick the music- even if it at a price. I value the eclectically-loving music fans!\n\n2) Liars Dice! I want to come back just to play!\n\nI'm sorry Mr. Bing's- but I just wasn't impressed.", "author": "Annalise F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-29", "description": "OMG. What is with Yelp not recording some of my review? This was probably the best day of my life.  Went to Mr. Bings after a day of exploring North Beach. We didn't know what to expect as we had only seen the place on Anthony Bourdain's show.\n\nLet me tell you. This place is worth a visit. KICK ASS mai tai's. And I'm not even going to disclose any more. My only advice is to visit the place, start chatting with the bartenders, and let your amazing evening unfold...", "author": "Stacie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-07", "description": "If nothing else, I would give Mr. Bing's 5 stars for having a picture of Joe Montana with his hands held up signaling touchdown that looks like it was cut out of the SF Chronicle sometime in the 1980's still taped to their beer refrigerator.  Is that great or what?\n\nBasic no frills no hipster dive bar that pours strong drinks and allows the drinker just to sit and drink quietly if that's what you want to do.  It's a small place but it feels just right.  Bar stools are padded nice and soft because you need to be comfortable if your going to put a shift in.  No food, but that's not why you go in, right? \n\nMr. Bing's...ah, yes.  I will be back.  Many times...", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-03", "description": "Chinatown's bar scene sketch-o-meter, on a scale of 1 to 10, 1 being the lowest:\n\nBuddha: 6\nLi Po: 6.5 (only because of the nice, um, \"booth\" and the fact that there always seems to be someone working on the electricity there)\nRed's: 7 (because I swear we were the only non-mafia members there one night)\nMr. Bing's: 8.5\n\nThere's just something about Mr. Bing's that turns me off.  Its proximity to Broadway?  The row seating that makes it tough for groups of more than 4 to converse?  Maybe.\n\nRegardless, I'm just not a fan.  Sorry Anthony Bourdain, I'll stick to my Chinese Mai Tais at Li Po.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "I like this place.  It's a little triangular dive bar on a busy street corner.  I like it when it is sunny and I can see outside both doors.  I also like it when it is cold and rainy and I am the only person there in my own little secluded hut, lol.  I like bringing friends there and slipping out the back door.  Huh?  Where did he go?  hahaha.", "author": "Bill V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "Nice little spot to get inexpensive drinks and nice jukebox. Jack n sevens were stiff.", "author": "miguel f."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-07", "description": "Horse shoe bar pretty much takes up the entire bar and face a flat screen TV that plays bay area sports.\n\nAbout enough seating for 15 people with a little more standing room.\n\nDrinks aren't cheap, but they aren't super expensive either.\n\nClassic Dive bar.", "author": "Steven F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-24", "description": "This is my dive dive bar in San Fran. It's a hole in the wall, it's cheap and not much to look at but the best dive bars are that way. My favorite part of the bar is that you can control the juke box from an app on your iphone which I of course down loaded immediately and played 80's jams. If you are looking for fancy this is not your place, but if you are looking for a fun place to do shots...this is your spot. The only downside is that they are a cash only bar so come prepared.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-05", "description": "A cozy, worn-in, former topless bar, dive. No tap beer though.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-18", "description": "Rich douches galore if you like rubbing elbows with the people destroying SF go here it is packed with nothing but SF's finest, sociopaths and deadbeat tourist. \nI can't think of a more smug place to be.", "author": "Josh A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-08", "description": "Friday nights can get a little wild, but the drinks are moderately priced, sometimes on-the-house, and there's liar dice until you can't count anymore. The female bartenders are pretty, and the males are abusive. Hahaha.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-23", "description": "Jason G. brought me here and i met the bartender Scooter and his friend Jason. 3 Jasons and a Scooter playing Liar's Dice. I never played before.\n\nWhen someone says drink and you see a shot in a cup. you dont take bitch sips you take a shot. if i had known i would have taken sips. because i suck at lying. :(\n\nIn the end 3 jasons managed to get the best of scooter and win a couple rounds. This was a great first night in town. I like the layout and the view of busy people wantering the streets. \n\nI was the drunkest this night over all the ones i was drinking heavily in town. I should be more ready the next time i visit.\n\nEverything felt just right.", "author": "Tien L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-09", "description": "This place is a total dive bar.  \n\nA no frills joint to knock back some drinks, have meaningless conversations, watch people play a dice game called \"Liar's Dice,\" and see the bartenders get wasted.\n\nBeer is not on tap and is served in the bottle.  There's a jukebox for you to pick your favorite drunk songs.  I should have looked for \"shots\" by LMFAO and Lil Jon.  \n\n1 shot of Don Julio Blanco (more like a 1.5-2 shot) + 2 beers = $17.  Add a $3 tip = $20 for a round of drinks.  Not bad at all.\n\nA cool bar if you're looking for a non-fancy schmancy place to get some drinks and forget about all the worries in your life.", "author": "Suzi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-15", "description": "If I lived in North Beach, this would be my bar. Kinda grimey, with stiff inexpensive drinks, great view of Colmubus Ave and great people watching. It's small and inviting to talk with other randoms that are at the bar with you. \n\nThe bathroom smells like somebody puked up a urinal cake though.", "author": "Patrick G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-19", "description": "We were recently in SF for the day and decided to recreate Anthony Bourdain's Layover San Francisco.  So we decided to stop in here and check it out.\n\nIf you like a dive bar, this is it!!!!  I think I'll let the locals keep this one.", "author": "Stewart B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-13", "description": "Just looking for some good cocktails and some conversation with someone other than each other, we wandered in here after an hour of wasted life at the Hustler Club (I'll save that for another Yelp). \nFour hours later we poured ourselves into a cab but not before... meeting some really cool people. Winning or losing (I'm not sure) a decent amount of money playing liars poker. Buying or getting bought (I'm not sure) numerous shots. Making a lot of new friends (or enemies, probably both) and laughing our asses off.\nAfter eating the town and loving it our most memorable time may be the night we stumbled up on Mr. B's.", "author": "Dave X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-24", "description": "I'll just throw this out there: BEST DIVE BAR EVER.\n\nYes, Anthony Bourdain sent me here. If AB recommends something, then I trust his opinion, because in AB I trust. And Mr. Bing's did NOT disappoint, if dive bars are your thing. They are mine. Seriously, I have a fondness for dive bars. No beer on tap, cranky bartenders, people of questionable integrity, and bathrooms so vile you're almost tempted to piss on yourself rather than have to come within 20 feet of a toilet that's never seen a scouring brush.\n\nWith it's triangle-shaped bar, and one of the most ruthless games of Liar's Poker I've ever seen - basically, it's a dice game where you try to bullshit your opponent into believing what you've got under your dice shaker is the truth; get caught lying, and you drink. Heavily. Now, I consider myself an expert on the dark art of bullshitting, but the bartender, a crazy Chinese fucker named Scooter (I kid you not) , seemed like he was a Zen master, and I wasn't about to get my ass handed to me so easily, especially from someone that kept taunting his pathetic opponents with \"You're not gonna like this!\" - Mr. Bing's was spectacular in its seedy glory.\n\n(A quick business proposition to Mr. Bing himself: wanna make some extra cash? Then sell some t-shirts with Scooter's face on it, with the caption, \"You're not gonna like this!\" Make some extra dough. I get 50% just for thinking about it. You're welcome.)\n\nAnd my wife and I got royally drunk. I mean, I remember hopping in a cab, and walking into the hotel room and pointing to the bed shouting, \"Oh, look, the hotel's giving away iPads!\" (duh, it's my wife's), and then wondering loudly, \"Uh, where the fuck are we?\"\n\nAfter that, I'm clueless. Because I don't remember putting myself to bed.\n\nAnd, yes, I did check to make sure my organs were still intact. Hot damn, I love Mr. Bing's, but I wasn't too fond of the hangover. \n\nI can't wait to go back to San Fran, so I can abuse my liver in such a lack of luxury and restraint.", "author": "Gus S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-05", "description": "If you get the female bartender, good luck playing songs on the jukebox- as she owns it.  She was offered the same amount of $$ she put in (for her sad selection) and said no to fast forwarding them ( she is able) because she liked the  song and forgot who the customer was...  this here is a lesson in good old fashion capitalism", "author": "Sasha D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-12", "description": "Dive Bar. Inexpensive Drinks.  Dick is awesome, Thank you!!\n\nI will def. come back next time I am in the area!", "author": "Oriana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-13", "description": "This place screams dive bar.  Cheap beers and well drinks, plus lackluster decorations makes this place as divey as they come.  However, this place gets a high rating because that is what it is.  \n\nThe jukebox is a nice add on and it pretty much has every song you could want.  The bathrooms are ehhhh, but you have to appreicate a place that has gum advertised to cover alcohol breath.  Classy Classy.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-05", "description": "Mr. Bing's. A place with cheap drinks, a triangle (boomerang?) shaped bar, no food, and an entertaining crowd. It's also pretty filthy from the barstools to the bathrooms but it adds to the charm, I swear.\n\nIf you walk in here and the place is dead, don't leave. Have a seat and just wait to be entertained.\n\nNoticed that a lot of the trendier bars in the area had people duck in here, buy a shot for probably half of what they are charging at the trendy spots, and go back to trendyland.\n\nTake a look at the way the alcohol is organized in this place. Hilarious. Absolutely no rhyme or reason and the bartender forgets where he puts things sometimes. He'll appreciate it if you remind him where he put the alcohol you are drinking.", "author": "Laura R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-10", "description": "Ha this place is the epitome of a dive bar. Basically lacks charm, decor, not much of a crowd. bartender is kinda uninterested and surly, and I'm not so sure that the Grey Goose is really Grey Goose. So why 4 stars cuz this is what a dive bar should be. You go in there to get a cheap well drink or beer and a shot. You don't get a martini. It's never crowded. \n\nThe last time I was here the old guy behind the bar (I just assumed that was Mr. Bing himself but probably not) was taking more shots than any of us. In my book that rocks! \n\nWas a great place for a small group of us to go and have some simple drinks and bull shit without being distracted by anything but drinking.", "author": "Hyung L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-21", "description": "We found this place about six years ago on a visit to San Francisco in mid-August.  On our last day, a Sunday, our flight didn't leave until late in the evening so my wife suggested that we find a place to watch our Houston Texans play their first pre-season game.  I assured her it would be impossible since it was pre-season and I was certain we would only find the 49ers and the Raiders on television.  She acknowledged that it would be unlikely by suggested we try just the same.  We headed over to Chinatown because that is always a great place to people watch and have some lunch.\n\nWe had finished lunch and were walking down Pacific towards Columbus and lo and behold, looking through the window of Mr. Bing's we saw the Houston Texans pre-game analysis taking place on a beautiful large screen television positioned over a quaint neighborhood bar.  I looked at my wife and said, \"you were right!\"  In we went, found two seats at the bar and watched a great game.  We enjoyed ourselves so much that we didn't leave the place until after dark and headed straight to the airport to catch our flight.\n\nSince then, anytime we are in San Francisco we make a point to spend a couple of hours and enjoy a cold beer at Mr. Bing's.  Our most recent trip introduced us to Konsin (it is probably misspelled) the bartender who was a delight to get to know.  If you read this review and decide to try out this place, please tell Konsin that \"John and Connie from Texas\" sent you in.\n\nEnjoy!", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-06", "description": "The best dive bar in the City!!!\n\nCheap drinks...  Great bartenders!   A room with a view of Columbus...\n\nThen you get characters like Jason G. who hangs out in the joint...\n\nRobert  who is Mr. Bing's son and Michael \"Scooter\" Chan are the bartenders...\n\nMy absolute favorite bar in the City...", "author": "Randal P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-28", "description": "Came here with Choon Y and a few other friends for happy hours yesterday.........Yes.............I know.....how can you spend Thanksgiving at a dive bar?\n\nMy intent was to meet up with Choon Y for a drink and to wish scooter, the bartender. a happy thanksgiving.  I felt sorry for the poor lad for having to work.  At the end of the drinking session, I was the poor lad that I should have felt sorry for.\n\nThe drinks are pretty stiff here and the game of choice is liars dice.  Liars dice and alcohol = no thanksgiving dinner and asleep by 7 pm.  Had a great time though.  I woke up today at 11:30am the next afternoon  so I slept for 16 hours.  Terrible!!!  Choon...........the next time you want to buy insurance.....let's not do it over 10 shots of ketle one and tonics.  \n\nBy the way, three 6's Choon.............your call\n\nGreat times!!!", "author": "jason g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-31", "description": "Mr. Bing's is a real friendly place.  The bartender bought a beer and chatted up an elderly woman that was waiting for the bus on a particularly hot day.  A regular bought beers for a friend and me, in addition to a few other folks at the bar.  Genentech's employee scavenger hunt apparently meets outside Bing's before dispersing;  a few scavenger teams came in to check off items from the patrons.\n\nCouple that with a central location and decent prices, and you've got a decent dive bar.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-02", "description": "Classic dive bar right in the middle of a hopping area. Tight quarters. Bathroom smells. Beer was relatively cheap.", "author": "Nate N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-21", "description": "Scooter is King. No fuss. No problems. Just don't bring a whiny attitude.", "author": "Enrico P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-21", "description": "Talk about dive bars !!!! WOW  Knew when we walked in we had to have a drink, and glad we did.", "author": "Hugh B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "After staying the financial district for a night, we were looking for something more our speed.  Mr. Bing's was exactly what we were looking for.  Simple, cheap beer/shots, no annoying 20 somethings talking business and sipping cocktails.  Bartenders were just the right amount of friendly/attentive without being annoying.  Great way to end the night.", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-14", "description": "If there's a such thing as a grungy bar, this is the capital of grunge. BUT if you're wanting a place that is pretension-free, crazy-crowd-free, & sh*t--just about darned near free in its drink prices, this is your spot. \n\nThe bartender cusses at people. He called one chick a b*tch while I was there. I mean, she was a regular, but I was floored at the frankness w/ which he dealt w/ the commiserating drunkards seated around the oval-shaped bar. \n\nThe facade & the drinks are equally no-holds-barred, as cheap & easy as a Tenderloin hooker. The women's bathroom is no \"ladies' room\"; no \"lady\" buys condoms w/ ticklers in the bathroom, at least none of whom I've encountered. (Ok, so the prophylactics don't have \"ticklers,\" but they're no average Trojans! I \"fight on,\" so I *know*.) There is a cute-ish vanity in the bathroom that's great for taking photos to upload to CL's Casual Encounters section. (Jk--seriously--jk--but O_O)\n\nI love this gritty little spot. Some of the most down-to-earth pick-pocketers mooch around here. \n\nBe careful if you're from out of town; a guy I met here learned about \"trust\" the hard way. Fortunately for him, he was a vet w/ plenty of experience in sheisters. Bring your nunchuck skills!", "author": "Kali K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-11", "description": "If you are any Adult  ....  Like a good Drink\nMr Bing's is the place.     Real Bar.      BRUCE is the man to see.  \nPours a mean Tanqueray.   Knows his sports.   Loves a good joke.\nWhat more do you need in a bar.\nWE love all the bar keeps and locals. \nMy wife is from the area, but we live in Mendocino. \nEVERY SINGLE  time we come to town we stop at Bing's  \nHope to be there soon.", "author": "Scotty G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-20", "description": "I had heard about Mr. Bing's on Anthony Bourdain's show. But I didn't realize that this was the place until after my visit. I stopped by here one night after a particularly long Friday night happy hour session with co-workers. We ordered drinks and quickly found out that they are cash only, luckily they have an ATM. We sat here for about an hour had a few drinks and played dice games. Super low key and relaxing, would defiantly stop by here again.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-24", "description": "Classy joint, this spot. Strong drink at such a value that I don't have to resort to the car bar... ;)", "author": "Corey H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-04", "description": "Stopped by on St Patty Day bar crawl. Must agree the bartender and the dude who greeted us were great. They partied as if part of the crowd. Decor is cheasy cool and the music selection was eclectic. A must do on a pub crawl so you can say you were there.", "author": "Russ S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-03", "description": "Worst bar I have ever been too!! The bartender would dip a used glass in soapy water and do a quick rinse in a tub of sitting water and re-use it again! Gross! Also very expensive! They use some kind of mini glass ware LOL", "author": "Ellie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-13", "description": "Was walking around sf and was going to a diff bar in the area, but the place was closed so I found this place on my yelp app and decided to check it out since I'm a big fan of dive bars.\n\nIt was 5 in the afternoon on a Sunday so there was only one other customer in the bar when we first walked in. $9 for a bottle of beer and a tall glass (12oz?) of pretty strong whiskey and coke (and when I say strong, it's strong, not just girl-standard strong, coz I like to taste my alcohol!). \n\nWe stayed for a few rounds. It was fun listening in on other ppls conversations and people watching (in and outside of the bar) :) Definitely a good place to drop in for a few drinks!", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-11", "description": "Awesome time.. If you are a drinker, this place is your solace with an eclectic mix.  Try the Mai Tai:)", "author": "Tee S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "If you've never heard of Mr. Bing's, you need to go and check it out at least once.  It's a little dive-y place where there's strong drinks, cheap prices and the bartender is only slightly aloof (unless playing liars dice with some patrons).  Sure, the place is a little sticky, but once you get past that and relax, it's a hell of a time.  I always run into someone I know and haven't seen in a while, which is nice.\n\nFrom there you can stumble on to North Beach or just hang out and play dice or Galaga.\n\nGood times all around.", "author": "Mike I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-31", "description": "If a working man's bar is what you seek.  This is the real deal.  Does not get any more less fancy then this great bar.", "author": "Stephen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-15", "description": "I stand corrected - I was just informed by my boss (with whom I was enjoying those tasty Mr. Bing's libations), that our bartender's first choice was a shot of Crown Royal! That deserves at least another star, as far as I'm concerned!", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-10", "description": "This dive is quiet if the juke box isn't playing and loud if it is. Drinks are cheap for the strength of their pours. Bartender was friendly and was running the whole place himself.", "author": "Charlie V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-30", "description": "Mister Bing's was yet another stop during the SF Yelp pubcrawl yet I'm torn on what I think about this place. The bar is located on a corner and therefore shaped like a V inside. They don't have any beers on tap so your choices here consist of mixed drinks, bottled beer or wine. \n\nWhen we rolled into this place we packed it in and it became difficult to navigate through the place. I did play Golden Tee for the first time ever against Dfens T. and I WON!!!! Beginner's luck I guess! Then all of a sudden an overpowering putrid stench of sewage emerged and I had to make my way towards the door to get some fresh air. \n\nAnother issue with this bar was the scandal over how the false advertisement led Omid to believe he would be getting much more crack than he did..... but that's a whole different story!", "author": "Lori K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-29", "description": "Great dive bar, cheap strong drinks, good juke box selection!", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-12", "description": "I stopped by here on the way home from an all day social for work on Friday for a night cap (ok, it was only 9:30) and ran into a great bunch of people.  Some cute Irish guy and his friend bought me a couple of rounds and we generally raised hell for about an hour before their tall, sour faced friend showed up.  I seriously considered scratching her eyes out, but am clearly above that as a classy lady.\n\nOne of those cigarette girls came around the bar and the Irish guy bought me a Toblerone and some gum and then walked me out to a cab, as I was getting a little wobbly.  \n\nI couldn't coax him into the cab to come home to the Marina with me, but that's probably for the best as I puked as soon as I got home.  Anyway, Bings is a great dive bar if you are in the area, the drinks are cheap and there's always some friendly faces.", "author": "Kimberly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-26", "description": "I remembered the first time I came here, Dick was my bartender and he was alone by himself during the day. He's a really sweet guy, keeps up a good conversation. so, dont hesitate to walk in because im pretty sure that since he's friendly, im pretty sure all the bartenders here are friendly!", "author": "Jay K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-08", "description": "Went there on a Sunday night and watched a game on their one big screen TV. The place is kinda divy.  Nothing spectacular.  The drinks were decent price but I'm not sure if it's the owner but he was kinda rude.  He made a commet about my friend being \"high maintenance\"  because we wanted to move one seat down so that we can ALL see the game.  I mean, is that so hard to ask without you making some smart ass remark?  Whatever.", "author": "Meshell C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-04-08", "description": "This place has a cool triangular bar as its entire seating area and is oftentimes the last stop for the drunks heading home for the last BART after a night on the town.  But I like their sign a lot.  A fine place to pass the time away if on your way to or from somewhere better.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-25", "description": "Went because of Bordain. Divey and fairly cheap. No reason to return. That is all.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-27", "description": "Mr. Bing's proves the power & persuasion of television . Tony Bourdain has developed a huge fan base and we all probably stopped in at Mr. Bing's after his visit there . I'll admit thats why I popped in . They have a catchy , sort of inviting name '' Mr. Bing's '' ... they have a nice sign outside .... convenient location on corner of Columbus & Pacific .....they sell booze /beer for reasonable rates ...... beyond that there's really nothing memorable or special about the joint . There's nothing wrong with Mr. Bing's ... its just that there are so many other interesting and fun places to choose from ... Mr. Bing's is just bland .", "author": "Sonny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-19", "description": "An hour at Mr. Bing's is like a week at the circus. If the circus consisted of a handful of asian men sitting around a triangular bar quietly but nervously watching sports while children loudly shoot dice in the corner of the ladies' room, under \"sexy time\" vending machines, all while Mr. Bing himself runs the show from behind the bar. \n\nThat's actually a horrible description and makes Mr. Bing and his whole shebang sound cheap and tawdry. It's really quite magnificent. No beers on tap, but as Christopher pointed out, this can be a GOOD thing at a dive bar. They're not known, across the board, for sticking to the highest standards of cleanliness. Besides, there's tons of bottled goodness and I'm a vodka girl anyway. I'm kind of in love with the ramshackle, boudoir-inspired ladies' room and the weird little alcove leading to the men's room. \n\nThis place is a hoot. Just remember that Mr. Bing will warm up to you, the children will eventually disappear (where they went, we still don't know), and if you lose your money in the \"sexy time\" vending machines, Mr. Bing will refund you. And he'll make sure you get your goodies! That's what I call service. Drinks are cheap enough that you don't have a good excuse to not buy me one :)", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-22", "description": "love this place on tuesday tuesday evenings and friday evenings.\n\nask for the anthony bourdain special.....", "author": "DOM d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-27", "description": "Came to San Francisco during Spring Break with some friends to celebrate my late birthday celebration. \n\nGuess who was my bartender? =)\n\n1 raised eyebrow and a slight smile later, I had my first 21 drink at a bar..in chinatown. \n\n5 friends, 5 Absolute vodka shots, and 1 chill bartender.", "author": "Peter T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-16", "description": "Mr Bing's is a great (tiny) bar in what was once the Barbary Coast.  Michael Chan and the rest of the bartenders will pour you a no-bullshit strong cocktail.  While you're sitting at that odd-shaped \"V\" bar, look up and check out that weird hoop near the ceiling: that was the curtain rod for the stripper stage back in the '60's.  \n\nI just did a podcast about Mr Bing's.  Please check it out http://bit.ly/4uFXDY\n\nAttitude Adjustment Hour at www.aahour.com", "author": "Dennis C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-21", "description": "I seldom remember the nights I spend at Mr. Bing's. Correction: I remember portions of those nights.\n\nMr. Bing's is a little odd, in that it's completely white inside, which makes it feel like a hospital to me. A drunken, stinky hospital filled with booze hounds.\n\nThe bar tender is a nice guy who once fed me interesting things to say in Chinese to degrade my overly-inebriated friend. It worked: eventually my friend vomited, and I learned how to call him a little girl in Mandarin. Yes!", "author": "Wes T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-23", "description": "My favorite shithole bar in the city- hands down.  Many of the characteristics you love about a dive bar- no draft beer, grumpy patrons,  disgusting bathrooms, great place to people watch. And don't forgert about playing some dice....", "author": "Jim B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-21", "description": "This place creeps me out a bit, but if you want a seedy bar in Chinatown/North Beach, this place serves a mean margarita.\n\nBring your conversation skills and sports trivia knowledge.  And your own hand soap.", "author": "Dmytro A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-06", "description": "Creepy old man bar that I stumbled into trying to find a TV playing the SEC Championship. Bama whooped FL- cry Tebow, cry...\n\nThe bartender Dick is a really friendly guy and I was trying to chat with him about the game, but I was super distracted by the portrait of the bare ass tennis player up on the wall by the door. And the random organ caricature with limbs and face on top of the fridge. Cheap drinks as you would expect.", "author": "Chrissy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-09", "description": "Took our buddy here on his bachelor party. \n\nMr. Bing offers to buy him a drink, whatever he wants. The bachelor says \"Give me your best drink!\" So Mr. Bing pulls out this red Chinese liquor. We ask what it's called, he says \"Ung Ga Pa!\" Our good friend downs the mystery shot, and then immediately pukes his In-N-Outs all over the bar. \n\nA night to remember forever.", "author": "ruzxs b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-18", "description": "A great little dive bar  with a vintage look  and more characters than a Victory Outreach gathering... The ambiance or lack of is great.. The walls are adorned with random cheap color-by-numbers art and Mr. Bing T-Shirts.. The prices are very reasonable for well drinks, don't go here asking for some douchey mix drink... You will stand out like an educated person at a \"Tea Baggers\" convention..\nGrab a drink and buy a Mr. Bing's T-Shirt...  It's a great conversation starter..!!!", "author": "Carlos M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-31", "description": "Mr Bings is a Cool Neighborhood Dive Bar. My friend and I stopped here for a Cocktail. My friend ordered a Captain and Coke and I ordered a Kamikaze. The Bartender was a festive gentleman in a Hawaiian Shirt. He brought our drinks back my Kamikaze was the strongest one Ive ever had Jet fuel baby. Interesting decor and a V shaped bar.", "author": "Eugene L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-18", "description": "This is bar that is definitely worth hanging out especially for the after party. Definitely a dive bar!\n\nGreat decor, funny people, and also Bruce is the man!\n\nDefinitely chillax in here and hit on a couple of honeys.", "author": "Aaron P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-08", "description": "I was tempted to save this place as my lucky number 50 review... Damn my impatient ass; it's gonna have to settle for almost as lucky number 40.\n\nIt's all fuzzy.  a stumble left or right and I'm immediately running into somone, luckily it's someone I know.  Through my haze I try to understand where/what/how and (least importantly) who I am, but my carefully pieced together mental strategy is SHATTERED by the ominous voice of Jason G.  \"6 6 Jason Biggs... come on what you got!\"\n\nThat's when I realize I'm NOT floating in a hazy cloud city; basking in glorious women.  Nope.. I'm at bings, sloppy and mind twistingly drunk from another great game of Liars Dice with scooter Jason and Smak. when I say great I mean getting my ass handed to me.  Damn you guys I still don't know how i lose so much... but i guess that means i win right?\n\nI don't think I ever have, or could have a bad time here.  The crowd is always great, the bartenders are always having as much fun (or more..) than you are, and they make the drinks strong enough to knock out a bear.  \n\nseriously.  I mean, don't get me wrong here.  I can keep up with the best of the best, but 5 drinks later at Bings and I'm second guessing my alcoholism!  \n\nNext time you're walking by on a weekday night, stick your head in and you'll never know what you'll find...  apart from cheap drinks and a great time that is!", "author": "Joseph F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-09", "description": "We stopped by here while waiting for our table at Tomasso's. This bar to me epitomizes a good SF dive bar. Strong drinks, cheap prices, friendly bar tenders and a bathroom that requires a hazmat suit to enter and return safely. A central location and a big flatscreen also help. Well worth a visit. Just avoid the hazardous bathrooms.", "author": "Chris J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-05", "description": "Came in here after a show at the Punchline...\n\nWe didnt realize it was cash only and we had someone go to the ATM inside the bar while another friend went to the bathroom.. As we were waiting for our friends the bartender asked what we wanted and we told him we were waiting for friends.. Comes back a minute later and goes \"Come on guys, this is not a spectator bar\". No shit asshole but we told you a minute ago we were waiting for other people.  I understand that is a small bar and after being on tv you probably have people just hanging around but we told you why we wanted to wait and you were still a fucking prick. Never plan on going back and fuck you.", "author": "Jared M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-31", "description": "Yea...this place is fun. It doesn't matter who you are with. You will run into people who are out to get drunk, have a good time, and chat with others. Unlike most dives, the vibe is fun and energetic. The bartender will crack you up or crack on you to make others laugh. If you just want to have a good time without being pretentious, come here now!", "author": "Siao W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-23", "description": "The default music genre on the jukebox (ie, when noone has put in any money) is bad hiphop, mixed with 90's pop. It felt like 1997 in there and not in a good way. There were some sketchy people in there, the sketchiest (and on some level, the most awesome) being the urban samurai, getting into a verbal altercation with a loud group of women, declaring the he not only had the \"longest hair\" of anyone \"up in here\", but that he was also the only one \"packing a .22\", holster of which he then proceeded to flash on his way out for a cigarrette. I might add that he looked like Mr. Miagi , dressed head to toe in black with long gray hair in a ponytail. \n\nSide note: The use of space in Bing's is appallingly bad. There's a mirrored post in the middle of the place so you can't even see the TV. It's cash only but doesn't have an ATM, but it does have an antiquated golf arcade game. The bartender was nice though.\n\nThere are dive bars, and then there is Mr. Bing's.", "author": "Ravenna P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-10", "description": "Dropped in at 1:30AM, got a couple of shots and some beers, ~$60. \n\nThe decorations, there's a ton. Lots of Chinese New Year stuffs hung up all over. \n\nWasn't too busy so we got attention right away. The bartender was helpful and seems like he'd be a cool guy to hang around with.", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "Great prices, healthy pours and around the corner from Bow Bow Lounge.\n\ndo yourself a favor...this is a must do in north beach", "author": "david s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-25", "description": "it was just ok - but maybe because i went in sober.  have a feeling you have to hit this place when you're already on a roll.  staff was nice, customers were salt o' da earth types of folks - no fancy schmancy cosmos here.  order a beer, grab a stool and make a friend!", "author": "Jennifer G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "(surprised face) wooooah!\n(serious face) Woah.\n(scared face) wo..ah.\n\na shot is not a shot, according to mr. bing.  \ntwas an actual cocktail.\nweak concoctions need not apply at this bar.\n  \n       chatter-chatter-chatter-CLACK!  the dice game at the end of the bar filled in the silent gaps of the televised WPT players' critical decision making moments.   \n             'sigh.  i miss playing poker,' i thought, as hayley w. and i sipped on our soco and limes, commenting on the bluffs and check-raises of the game.\n\n   one cheap drink...err...shot, happily sent us on our way.\n         mr. bing, thank you for attempting to brighten up an otherwise wet and dreary sunday evening.", "author": "Ting A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-25", "description": "My friend Richard C back in LA, once wrote a riveting review breaking down what a dive bar really is. He pointed out that far too many people will slap a \"dive bar\" label on a bar and its true shit hole meaning has been lost in the process. Well, Richard, and dive bar lovers around will be happy to know that I've found one and the basement where the bathrooms are literally smells like a delightful combination of rotting corpse, ass and um, yuck. Yuck is a smell, right? And I think that qualifies as a true dive.\n\nAs for the rest of the place, yeah, it's pretty divey, although they do serve Belvedere, which isn't very divey, though quite tasty. The decor looks like it hasn't been cleaned since the day they cut the red ribbon, but ya know what, it's damn charming. I also like that you literally have to be buzzed into the pit of stank below in order to use the bathroom. Clearly they are serious about Customers Only.\n\nI really did like this place and if I was in the neighborhood, I would totally pop in for a cheap drink and a little Dolly on the speakers.", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-23", "description": "I love Mister Bings! It is one of the first bars I visited when I moved here and I keep coming back.\n\nBruce has been working that counter for the 9 years I have been coming here plus 11 more. He can knock back a whole bottle of Crown Royal.....provided you are buying the shots!\n\nThe bar is teetering on the edge of what I would call a dive, but I am going to give this place the nudge over to the \"yes it is\" side for a few reasons;\n\n1. They have those single sheet of toilet paper dispensers in thier bathroom. You know, the type you only find in places like Delores Park (and we all know what those bathrooms are like)\n2. I swear I have played dice with members of the Chinese underground in here, too many times to count\n3. See the comment above about Bruce....lets not pretend he stays sober as the night carries on\n4. Bare assed woman painting adorning the wall, which has been stolen, recovered and bolted down so it will remain there forever\n\nGo to Mister Bings, go now!", "author": "Drue C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-30", "description": "Not what i expected when i walked into this place.  Its all bar.  An oddly shaped, triangular like bar.  No tables...just bar. The maximum capacity was 48.  I only counted 24 chairs..so if you bring a friend, they obviously have to stand behind you.  Let the lady have the seat.  Its the right thing to do.\n\nMy friend told me to get a fernet and soda, cuz i wasn't feeling well.  I looked at her funny.  The bartender looked at her like she was crazy, poured me a shot and brought me a ginger back...as fernet should be served.  Then he pointed at her and laughed, and snapped, you give me $6.25!  Then when she asked for a drink, he told her he doesn't serve crazies, and smashed the bottle of fernet on the bar and cut her.\n\nOK..that last part didn't happen, the bartender was cool, and I'd come back for more than one drink...now that i know what the inside is like.  But 1 star taken away for the $6.25 price tag on the fernet.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-20", "description": "Have you ever seen an old Chinese man beat a white guy at dice and then scream, \"AH-YOU MY BITCH!!!  AH-SUCK MY DICK!!!\"\n\nNo?  Too bad.  I have.", "author": "Frankie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-20", "description": "This bar is so tiny, you literally have to push you self against the wall/window if someone else want to get through.  Guess that why its called a dive bar.  But got some serious cheap drinks here, so should be a must stop for pub crawl, just dont stay too long cause you might develop claustrophobia.", "author": "Young N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-04", "description": "Mister Bing's might just be one of the finest drinking establishments in the city.  Nay, the finest drinking establishment in the world.\n\nAll hyperbole aside, I do love this bar.  From the strange alcove that leads into the men's bathroom to the breathtaking painting of a tennis star near the front door, this bar is wonderful.\n\nNo beers on tap.  That can be a good thing at a dive bar.  Somehow I manage to get by with either Jack on the Rocks or a fine bottle of Anchor Steam.  You can too.\n\nAnd their shirts really do make a unique gift idea.", "author": "Christopher K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-04", "description": "Any bar that sells sex toys in the bathroom (even the girls bathroom!) for 75 cents (although Drue got ripped with her ass coin) is a fantastic bar. \n\nMr. Bing is THE man. \n\nYa, they don't have beer on tap, but meh, the atmosphere and company totally make up for it. Did I mention the sex toys in the bathroom that you can buy? \n\nThe entry way can get crowded, but that happens when your on a pub crawl and everyone invades at one time! The jukebox selection was awesome and I had a deep conversation about the 3 choices for a dollar and which songs to choose. You don't want to mess something as important as the music of the bar up. A huge responsibility. \n\nanyway, I love Mr. Bing and I will definitely take my friends!", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-22", "description": "It is what it promises to be.  The definition of dive bar.  I would have given it 5 stars but no beer on tap. The bartenders were friendly and the bathrooms were clean, meets my criteria for a good dive bar.", "author": "Tracy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-14", "description": "This was just what we needed after our somewhat misguided \"Girls Night Out at the Strip Clubs\" adventure. Ahhhhh....a dive bar to soothe us back to a sense of normalcy. \n\nWe ran in to a bachelor party of Berkeley PhD students and had a fun drunken chat -- SO much more our speed than the leering nastiness we had just observed elsewhere (ok, maybe those same guys were leering nasties moments before at the strip clubs, but in a dive bar, everyone becomes their regular selves again).\n\nIt's small, it's divey, and it's fabulous.", "author": "Vandana M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-05", "description": "My friend and I stumbled into Mr. Bings after spying it from across the street at another venue (Tosca Cafe). We were feeling brazen and adventurous and glad we stopped at Mr. Bings. The bartender was friendly, the drinks were stiff, and the company was honest. We engaged in chat over where to live in the Bay Area and how the hell we found ourselves at Mr. Bings and Tosca as we're from out of town. I told our new friend they both just felt right. I will definitely go back, more cash in hand, for a pleasant evening at Mr. Bings.", "author": "Meagan O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-10", "description": "A tradition of mine this is the first bar I stop at when I'm in town. Divey sports bar right on the corner a few blocks away from North Beach. Bartender is cool and they play hockey on the tv! Good stuff.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-30", "description": "First:\nThis bar is NOT in Nob Hill.  It is in North Beach, beeotches!  Since when is Columbus and Pacific Nob Hill?\n\nSecond:\nDive bars, how I heart you.  How I hate to review you on Yelp for fear of you becoming the new \"it\" place to hang out.\n\nI love Mister Bing's... it is a divey, divey bar.  Small, oddly shaped due to the building's structure, old skool bartenders who are more interested in watching whatever sports game they have on the television than in you & your friends, cheep liquor and a decent jukebox.\n\nI have been drunk at Mister Bing's on more than one occasion.  MORE than ONE... (something like 20, actually).\n\nRandomness: Whenever I go to Mister Bing's I find odd things left on the vanity in the girl's bathroom.  One night I found tweezers w/mother of pearl handles, one night I found three marbles, one night I found one of those girly pens from Hawaii where you flip it upside down and the girl is neekid in the pen, one night I found a pin which said \"I'm not running for Governor of California in 2003\" (it was 2005)... I always look forward to my trips to the bathroom because I'm curious what I will discover.\n\nThe women's bathroom in Mister Bing's is kind of like the tree in \"To Kill a Mockingbird\", actually... I just wonder where Boo Radley is hiding...", "author": "Kate R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-09", "description": "Damn it.\nThis was my secret  place...the place that no one knew about...and  now Yelp has blown that all to hell.\n\nALRIGHT THEN.\nMr. Bing's has Frankie on the Juke box, you don't talk to anyone (this isn't  \"Cheers\" mofo, just sit down and don't bother the bar flies!)\n\nYou sit down, you shut up, when Mr. Bing comes over, order the martini.  When it comes, pay him, shut up, and drink it quietly.\n\nI don't care if you're there with 15 of your friends.  Don't check your phone, don't blah blah blah your yuppie bullshit all over these nice local, long-timer barflies.\n\nMr. Bings is an institution, going back to the days dinosaurs roamed the earth (ok, maybe not that far)  so you and your iphone and your inane BS isn't appreciated.\n\nBut if you want to taste the best martini in the city, for like 3 bucks, shut up and give this place the respect it deserves.  Once you're outside and nicely buzzing you can go back to being a shit-head.", "author": "Lisa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-15", "description": "I finally got in here for a quick drink (and trip to the restroom) a couple of Saturdays back.  It's everything a good business should be: cheap, quick and convenient.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-08", "description": "So about 10-15 years ago,i was out socializing with a few of the boys(i.e.strip-clubbin')and while everyone else went over to the S.F.Brewing Co. for a beer,me and my boy stepped into Mr.Bing's for some finer libations..I should say,we stepped back into a time warp!! I felt like at any moment i was either gonna get asked for a light or i was gonna get shanked...We take a seat at the bar(thats all they got)and order some drinks.When was the last time you saw Kessler as top shelf?I dont care if it is \"smooth as silk\"(says so on the bottle..look)that stuff goes down more like a terry cloth towel!!!The jukebox was pumping out some quality tunes(Bon Jovi,Marvin Gaye,Patsy Cline..repeat)i just wish there was room to start a mosh pit! We went on a Saturday night and let me tell ya..the joint was jumpin'(well,as much a place that seats 7 people can be)...Dive bar,indeed.......\n\n one last thing before i close this up......\n \n What do you get if you add all the people up at Mr. Bings on a Saturday night? \n\nA FULL SET OF TEETH!!!!", "author": "mr. s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-14", "description": "Did I go to the same place??? \n\nBoyfriend and I stopped in here around 11 p.m. on Jan 1. We were the ONLY people in the joint other than a completely obliterated, rambling, odiferous drunkard who was actually being cut off by the bartender when we walked in. This man was muttering about his daughter (who apparently was a thorn in his side) and he bellowed, at one point, \"Redneck Debutante!\" and then slumped back onto his stool.\n\nSeriously...no one else in there.\n\nAnd the entire bar smelled like a bathroom. Or like despair.\n\nThe only reason I'm not giving it one-star is because the drink was pretty damn good and was only $5.50. \n\nI like dive bars (old men drinking, smoking and swearing, surly bartenders, etc)...but this was more like swilling in a den of sorrow and poor hygeine. I really should have been suspicious that I lived in SF for 10 years and somehow never wandered into this place. And how is this considered \"Nob Hill?\" Looked like North Beach/Chinatown to me.", "author": "Cinnamon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-13", "description": "The ultimate dive bar. If you want to get drunk walk into Mr. Bings!!!!! I visit when I am in the area and its scary at times. Cant ever seem to leave sober or walking straight when I visit. For a great time in a old bar and a cool bartender Bruce is the man.", "author": "Dennis K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-26", "description": "This place is okay...not the cleanest bar but hey...you in Chinatown...where in Chinatown is clean may I ask...??  Their shots are cheap with huge servings.  I would love to give them 4 stars for just that fact but the place is a bit creepy, old, and a bit on the dirty side.", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-22", "description": "Awesome dive bar with strong, cheap drinks and great people watching.   I got four mixed drinks for $20.  Not too shabby.  The bartender is this old little man who handles crowds and crazy personalities well.   Bring quarters for the juke box, an open mind about the people you will meet, and a mood to talk about anything to anyone.   Just my kind of dive.  Loved it!", "author": "Tram T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-12", "description": "Old Man behind bar\nDrinks Like a Southie Irish\nMan I love this place", "author": "Keith M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-18", "description": "If Mr. Bing wanted to sell this place, I wouldn't be shocked to find a crack-team of Australian rugby dudes who have been waiting years for the opportunity to snatch it up, serve giant cans of Foster's, & change the name to \"The Boomerang\". Because that is the shape of the bar -- a boomerang. And the front window is big, & its plates of dirty glass cry out \"Please, find an excuse to throw that gentleman sitting in the corner through me...just tell him you don't like the cut of his jib & do it.\"\n\nDrinks are far too expensive for my tastes, but the juke is stocked with smooth hits of the 70s & 80s, which is a big plus.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-04", "description": "I give this dive the full Five for its shape alone. Unpretentous and funky. Yes please, more of that. \n\nEvery time I come here I notice the Chinatown regulars on one side and, um, Whitey on the other. Dunno if that's a flukey thing or even a bad thing. Hey, at least everyone is in the same bar and the old crowd didn't just get sent packing, as in every Mission bar.\n\nThe one burning question I have is this. For years I've heard of a secret cardroom you can only get to through a hidden door in the Ladies Room. And I've never been in the Ladies. Anybody know?", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-21", "description": "Great Dive!  I remember back in the '90's when they had the 45's jukebox with Fats Domino's \"Ain't that a Shame\".  Man, was that the soundtrack for many a ridiculous drunken evening.  Interesting crowd of locals and the random brave tourist.  I always ended up in conversation with others at the bar in various states of coherence...always interesting, always memorable, even if the details always seemed a bit elusive in their recollection...\n\nWell, their jukebox is updated, though I can't say it is improved -- sure it has more CD's, more selection and great tunes, but there was something to be said for that old clunker.  Oh yeah, they also had The Beatles \"I Don't Want to Spoil the Party\" -- oh man, this thing was prime for great college existential evenings!  \n\nAnyway, my tangent aside, I was in there not too long ago with some old friends, and while the jukebox has been updated and has less character, Bing's still seems to attract plenty of characters regardless, and our night was one for the ages.  Great place to prop up your elbows, for sure...", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-14", "description": "Just when I thought North Beach was crossed off my list of parts of SF I like to hang out in, Mr. Bing's goes and gets me thinking there's probably a lot I've missed.\n\nThis place is essentially a giant empty room with a triangular-ish bar jutting out in the middle of it.  There's no beers on tap.  The bar is a little short and not very neat.  There's very little wall art.\n\nHowever, this place just has some kind of charm that I can't seem to describe.  I think it may be the jovial bartender, who does tend to get a little distracted but passes out drinks like it's his job (wait... it is).  I think back to when we first arrived here there was about one other person in the bar.  It was some guy sitting near the front with an empty shot glass in front of him.  He was going toe to toe with the bartender on Crown Royal shots.  Yeah, the bartender's glass was smaller than the patron's but unless the bartender was somehow sneaking water into his own glass, the patron looked to be in pretty bad shape.  It's possible this is why the bartender was so happy.\n\nGetting to play games while drinking Tsingtao and Jagermeister shots is great.  Playing liars dice after a few drinks helps you understand why the dice are so weathered.  You may not be able to bet money but I'll be dammed if that doesn't lead to betting shots.  If fact, if your game doesn't become a drinking game, you're doing something wrong.\n\nOverall, this place gets a lot of points.  Lots of booze, average beer selection (I do like Tsingtao), wasn't very crowded with plenty of room to jaw with your pals or get an intense dice game going.  This place does feel like a true dive bar; mostly regulars and folks looking for a drink more than just hipsters or preps trying to be cool by \"slumming it\".", "author": "Steven R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "mr. bing's is the choice towards the off beaten path of bars in the north beach area.  it's unpretentious, and a straight forward no thrills dive.  no need to worry about stale drafts since it's only bottled beer in this joint.   the \"V\" shape bar gives you a full view of your surrounding  patrons, while the large windows provide glimpses of the outside world for great people watching.\n \nif you're in need of a drink without the scene, mr bing's is your low key watering hole.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-11", "description": "This bar has the best painting I've ever seen (tennis player ass!), and the bathroom has the best vintage tampon machine. An off-the-beaten-tourist path dive bar with strong drinks and no nonsense.", "author": "Wendy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-25", "description": "Always slightly frightening, Bing's is a great place to go if you want to be a total degenerate barfly, but would also like to sit in the display window at Macy's while you do it. It's like a real life version of that diner painting that you had in college, except instead of Marilynn Monroe and James Dean is you in a beer-stained t-shirt and a toothless junkie rubbing dirt in his hair.\n\nIt gets three stars for achieving the impossible task of having tons of windows and 'dank' at the same time.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-27", "description": "A solid three stars. Why not? I'm feeling magnanimous today. \n\nMister Bing's is a Chinese dive bar in North Beach. You've walked passed it a gazillion times. You've never noticed it was even there, despite the backlit sign in split yellow and and faded white, with dated red cursive proclaiming the name of the establishment.\n\nIt's right across the alley from the San Francisco Brewing Company and, so far as I know, they have no beers on tap---just bottles. And a weird circular depression in the ceiling that looks as though a chandelier might once have dangled from this spot in more...ahem...glorious times. Although the ceiling is so low that a chandelier would have knocked over any but the most stout little dwarf.\n\nThat's because Mr. Bings was once a haven for Chinese dwarves who were shunted off to the periphery of Chinatown back in the railroad days. Old Grandpa Bing himself would serve tea and listen to the dwarves tell their tales of woe: how they were relegated to inspecting railroad ties on account of them being so close to the ground, how they were picked on by the Irish and Italian dwarves that they shared quarters with, and how all they wanted in life was a cheap hooker and burlap sack to call their home. \n\nThose were the Halcyon days of Mr. Bing's, which is now staffed by the great-great-grandson of Mr. Bing, who is also known as Mr. Bing.", "author": "Zak N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-30", "description": "I hit up Bings after work on a regular basis and it quickly became my favorite little spot in North Beach.  The drinks are stiff, the prices are right, and they went out of their way to not only order Talisker for me but to give me the best price in the city on a glass.  \n\nRobert, Scooter, and Bruce are great.  Become a regular and they will remember your name, your drink, and greet you at the door like an old friend.  \n\nCome play liars dice, throw back a couple cheap stiff drinks, and don't be afraid to stick some money in the jukebox.", "author": "shannon d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-17", "description": "I loved the bartender, I loved the crazy dice game everyone was playing, I liked the strength of the drinks and the general seedy quality of the whole establishment- but damn- bringing a group of feet tired folk in here was a mistake, as there were all of two seats open at the bar. Yet another SF bar I will have to visit when I am travelling with only one other person.\nI will have to say, we asked for dive bars, and Mister Bing's delivered. I'm not even sure there was a women's bathroom...", "author": "Tori B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-13", "description": "I closed out the night here once and I think we had a couple of drinks.  I think Fernando was there and so was Chad, but I'm not sure... We hit the Drinking Consultants, Bamboo Shack and a bunch of other places that night...   Oddly enough, we drank here until probably 2:30 or 2:45 before they kicked our asses out...", "author": "David O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-14", "description": "Oh Mr. Bing.  I only come to you when I'm already ripped.  Will you ever forgive me for that?  It's just that I don't even think of you until my friends and I are deep into a weeknight binge.  At some point during the evening, we inevitably head over to Chinatown/North Beach to get something to eat - but we never make it....\n\nAs we stumble across Columbus, we see the large glass windows of Mr. Bings, the convivial souls imbibing at the bar, and head right in without hesitation.  As some others have mentioned, the drinks here are poured VERY FREELY, so you bettah watch your step.  And of course I dig the awful painting, but I also dig the 5 gallon white plastic buckets that formerly held soy sauce that now serve as ashtrays.\n\nClassy touch.\n\nThere's still some folks who think my friend Mariann's real name is Barbara Brown, but that's a whole 'nother story.", "author": ".Hon H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-08", "description": "Spartan, just-the-basics dive bar, with that makes no attempt to be cool, or hip, let alone hipster. Leave style at the door sonny boy, and let them pour you a slammin' shot of Jameson. Lot's of fun at Mr Bings. Drinks are cheaper than Li Po, and arguably better. Bartender, someone you can have a conversation with.  Would be nice to have beers on tap, but they apparently like to keep it simple.\n\nGreat people watching from the windows. Jukebox is available if your group of friends want to attempt to turn it into a karaoke bar, which mine did.", "author": "Boris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-25", "description": "Say 'Mr Bing's' to a San Franciscan in 'The Know' and they are sure to smile.  It will be a knowing smile and one tinged with amusement and maybe sadness for a lost opportunity, regret and yes, perhaps even lost love, for this place is where dreams can be made and broken.  On first glance the place doesn't look too grand, but the bartender soon sorts that out.  True, you will be very lucky to get the drink you asked for, but it is sure to taste all the more sweet for it.  The moment of the night came when some pissed-up tourist asked my mate if he wanted a shot.  He asked for Cheese-liquor whatever the hell that is.  The bartender asked with amazement \"Are you serious?!!!!\".  This is a first for me.  Surely to Christ if you stock a drink you have to know there is a very real possibility that someone may ask for a drink of it at some point.  Hey, who am I to argue with Mr Bing, or rather his son, Bruce?\n\nBeen several times afterwards.  Love it and look forward to next week when I will be there again.  Get the Cheese-liquor ready Bruce!\n\nOh, I also got told a great piece of advice here.  Never eat Chinese food on a Saturday, because there is a good chance the chefs will have lost all their money gambling and will be pissed-off.\n\nThere was another occasion there involving some drunk Texans and The Hustler place opposite, but that is a bit racy for this place!", "author": "nottellinya a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "Not bad.  When I asked the bartender if he had any recommendations for first timers, he said, \"Cash only!\"", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-27", "description": "So glad my significant other picked this place to meet his brother after work.  I must say at first I was a bit tentative, but after awhile my behind just kind of sunk into the bar stool and the gin and tonics were generous.  There is no doubt that this place is a dive and the only annoyance was this game of dice being played near us where the players were slamming the dice cups down so hard it was shocking.  \n\nAnywho....If I lived in the North Beach/Nob Hill hood this would definitely be a stopover after a long day at the office.  Thanks a bunch Mr. Bings!", "author": "Sheila Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-23", "description": "Tiny and u-shaped, this is not your standard north beach party bar. Stop in after work for a strong drink and you should leave satisfied (or stumbling).", "author": "William H L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-15", "description": "Pure and utter sleazy dive.  I love it.  \nMr. Bing's, when I walk by you on my lunch breaks, I just want to saddle up at the bar and tie off a thick knot with your deliciously strong G&T's.  My must you be so close to my work?", "author": "Blake W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-28", "description": "I like Bing's. they have that \"I'm right here, but no one really knows about me\" feel to it. it's great. you can go there and sit around and watch all the wannabe hoochies stroll up to Broadway for their clubbing needs or you can go there after work and watch a game on their \"big screen\".\n\nOne word of caution, though. Don't ask for any \"exotic\" mixed drinks cause it's likely they don't know how to mix it. I once asked for a liquid cocaine there and they came out with something that was like pineapple juice with a splash of vodka.", "author": "Bernie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-03", "description": "A sign on the wall says it's the best triangular bar in town. \n\nFeh.\n\nThe place is too cramped for my taste. I had to stand near the doorway to the restroom and the odor of Clorox drained me of a desire for a drink. \n\nWorth poking your head into if you're the type who wants to check out dive bars. And the patrons seemed nice. So I guess my only real complaint is about the architecture, but that's most of its charm.", "author": "Wella L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-12", "description": "I like Mr. Bings! The bartender has a good sense of humor and is a nice guy. The drinks are reasonable and you don't find too many annoying people here.\n\nThe jukebox sucks...it's one of those ones where you have to \"download\" your songs, it's pretty expensive, and sometimes you don't wind up playing what you think you did. Case in point, I spent $4 on two Muzak versions of Misfits songs. \n\nCheck out the tennis player picking her butt art.", "author": "Heidi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-02", "description": "When you finally admit to yourself that you aren't really going out to try to pick up women, because you never even so much as talk to one of them, or look at them, walk into Mr. Bing's, scoot one of the old, leather stools to the bar, and order something stiff. Repeat until you are drunk enough to complain that there are no hot chicks in Mr. Bing's for you to mack on.", "author": "Sir M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-05", "description": "Albeit in North Beach, this is a dive I can get behind. I want to stress its simplicity and excellent ovoid triangle bar shape. There is indeed a big TV, and it is accompanied by a few dudes watching the game, this clearly being their first and only stop after work before going home. I only hope that the middle aged guy constantly badgering Mr. Bing in breathtakingly loud Cantonese is not a permanent fixture, but we'll have to see next time, won't we?", "author": "Peter B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-16", "description": "I've never really drank in here but let's say the bartender was nice enough to let me use the facilities when I needed it the most.  That itself deserves 6 stars!!!!\n\nOverall, the place looked divey but also looked like an awesome place to drink when you just want to chill.  It beats the hell out of all those BS lounges up the block.  I think I'm going to stop here one day and thank Mr. Bing.... along with having a drink.", "author": "Jason Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-12", "description": "Not so much, the bartender Frank is entertaining, yet the establishment seriously lacks.  To the point that you might think to yourself, are you kidding me.  This is the type of place that you run into old friends from college or people you have not seen in yrs, and makes is super bizarro worls.\n\nCASH ONLY.", "author": "Nicole F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-04", "description": "THIS PLACE IS GREAT!!\n\nI walked in on my birthday and stumbled out!!\n\nThe bartender, Robert was super friendly, very sweet.  I ordered my favorite drink, a whisky sour, went to the bathroom and when I came back to a sip of that nice drink.  Well... I have never had such a stiff  whisky sour in my life- it was amazing, truly amazing!!  I swear this whisky sour tasted like a shot of Maker's Mark with a tiny bit of sour in it.  It was only about $4,5- can't beat that price.  \n\nThe place itself is really cool, no fancy-shmancey stuff, just a real local  hangout where you can relax and get a drink with no fuss.  I would recommend this place to anyone who wants a  bar that is cool,  very-well priced with a very friendly bartender!!", "author": "Michi R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-06", "description": "Exposition:  Aaaaaaaah Mr. Bing's, how've you been?  Oh how I miss thee.  Writing this almost brings tears to my eyes.....  This is no bar to bring a date to woo her.  In fact, it'll be your first & soon to be last (unless she's a cool chick that digs dive bars....)\n\nRising Action:  Just flew into town & met up with some friends in NoBe (North Beach).  Where to go?  Lets start walking....  Here?  Naw.  Here?  Naw.  Ring, ring.  Hello?  Where are you?  K, just meet us in Chinatown... Wait! Here's Mr. Bing's, just park & meet us here.\n\nClimax:  Had a blast as more friends stopped by.  Drinks were cheap and boy oh boy was it flowing and so was the smack talking amongst friends.  All in all, great place for some boisterous sh*t talking and friendly rambunctiousness.\n\nAnticlimax:  $70?  Each?????  Just for drinks?  WHAT?  Worth every dollar.\n\nDenouement:  Well, where to next?  Here?  Naw.  Here?  How 'bout Sam Wo's (see review).  Sure!\n\nps.  This transitory bar should not be considered the main course but more of an appetizer or desert of the evening...", "author": "hung n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-16", "description": "Some times you just need a place to drink a million budweisers, do shots and play dice.  You don't have to be a regular to get the 'treatment' at Mr. Bings.  It has a tiny bar, crappy ambiance, cranky locals and a semi-functional bathroom (not sure if it has the xmas lights up still) - call it dive-bar-chic.  However, you can take whomever you want, yell, spill and generally whoop it up.\n\nRumor has it that the main bartender is difficult.  You don't go there for some high maintenance help or bimbos dancing on the bar.  You go there to drink and terrorize your friends of friends who would rather go somewhere crappy like the Matrix.  Either way, I find all aloofness is thawed when I buy him a shot immediately.  Of course, that means you will do one as well.\n\nPS - you'll be tempted to go to Kell's to continue the Bud train.  Don't do it.", "author": "DaPlayer A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-02", "description": "bada bing bada boom -I'm Tony Soprano. \n\nI don't remember much here except Omid getting rip off a naked girl playing cards. HAHA. you only got one!\n\nIf I don't remember, then it must be really good.", "author": "Stanley K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-29", "description": "As soon as you can accept Mister Bing's is what it is you can be happy too with this establishment.  Strong Drinks, check, painting of a female tennis players butt, check, random hockey trophies check.  The drinks are strong, and the bartender was cool, when we rolled with 20ish people all at once he only winced slightly, but he seemed happy to be busy.   Mister Bing's is kinda small and is a dive, so if thats what you are looking for, like I so often am, Mister Bing's is great.  I think that I am going to add Mister Bing's to one of my regulars.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-05", "description": "Bruce is my man.  Too many stories of what went on at Mr. Bing's.  I love this bar.  Super chill.  I love watching the crazy, drunk, and crazy, and drunk, ... people pass by and cops speeding around with their lights and sirens on the weekends.  \n\nDrinks are genuine and strong.  Beer is in a bottle.  Drinks actually have alcohol.  Everything is dirt cheap.  I come here to get liquored up before going anywhere else.\n\nBruce is a great bartender.  Funny.  Very funny.  Make sure you buy him a drink.", "author": "Christopher C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-29", "description": "Triangular-prismatic version of Cheers - ie. where everyone seemingly knows each other's name.  We happened upon this place in the middle of the day on a Saturday, and the place was empty but the bartender was very friendly.  In the span of about 30 mins while we were there, 3 regulars walked in, greeted each other, and engaged in a jovial conversation with the bartender while me and my buddy sat and just listened in, and chuckled at their occasional jokes.  It was relaxing and fun.  I have no idea what it's like at night, but definitely this place was exactly what we needed after walking around all of downtown and North Beach: quiet, relaxing, friendly and cool.\n\nAdded bonus was the painting of the girl playing tennis and scratching her bare butt... my buddy couldn't get enough of that picture.  I'm guessing he doesn't have internet...", "author": "Stan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-18", "description": "Ginsberg, Schminsberg.  Wanna a drink with enough punch to destroy a mind or two within your own generation?  Skip Vesuvio's and head to Mr. Bing's.", "author": "L W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-11", "description": "mr bing's is a random spot in north beach, but this is a great place to come get your pre-game on. they have extremely cheap drinks here. our jack-n-coke's were $4 or maybe even less. i didn't get to meet mr. bing, himself, but our italian bartender was the man and chatted it up with us all day. he even let us bump some gangsta rap on the jukebox and he gave us some porn. i love this place. the main picture for this place is awesome. i want that poster.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-23", "description": "Mr. Bings Rocks! Ask Sam to shake for a drink... you win some, you loose some but you still get your buzz on!", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-06", "description": "This is one of the best bars in the city because of their service and the amount of alchy they serve. When ordering shots, I recommend this place because they give you double shots, not half a watered down shot. The people there are nice and not rude, unlike other bars.", "author": "Q W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-10", "description": "Oh man, I don't know where to begin. How about the fight that was taking place outside as I walked in between a homeless guy and what appeared to be a really drunk patron of Mr. Bing's? Or the extremely loud dice game that was taking place in the corner of the bar? Or the scene when Dr Dre came on the jukebox and complete strangers started nodding their heads and singing in unison. Good times, although sketchy...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-16", "description": "Greatest bar of all time! The bartender, this old Asian guy I call Mr Bing (not really him from what I understand) is a huge fan of Crown Royal and everytime I'm in there we go toe to toe for a few rounds. Note to self: don't challenge an old bartender who drinks for a living to a drinking contest (especially when he has his own shot glass that's half the size of the shot he is going to poor you). Mister Bings is a small locals only type spot that always brings a young fun crowd. Get ready to drink because that's what you do there! Luckily it's right next to Little Italy so you can easily get your booze on and follow it up with a slice of fresh baked pizza!", "author": "Robert G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-05", "description": "i love the layout of the bar.  it's almost like a social project because you face all the customers no matter where you sit.  you will almost always strike up a conversation with the others there.\nbruce is the greatest.  he's the only bartender i'm familiar with there, but he pours a good drink and is ready to pour you another.  stiff drinks, cheap prices.  just how i like my alcohol.\nthis isn't where you want to go to find your glittery babes and your striped shirted dude-bros.  this is the perfect place for a. getting drunk or b. throwing back a few with your friends.  (cue cheers theme)", "author": "Jennie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "Plain, simple, and gritty.  Cheap drinks served by a no nonsense bartender and patrons that are conversant and fun.  This corner spot was a fine watering hole and nice dive, a good spot to escape from Grant St.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-20", "description": "if your into old and shady dive bars shaped like a triangle...then this is the place to grab a cheap beer....no taps...just bottles....the grey groose, is not really grey goose...probably Popov in a grey groose bottle, lol....but thats kinda place this place is......", "author": "Hessam V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-21", "description": "One of the 4 bars I like in C-town. It isn't lovely, it sometimes smells horrendous, but the staff is nice in that gruff sort of way. There's a disgusting Chinese opiate shot you can do here, tastes like turpentine - so ask for the clear one coz it's more swallowable than the amber stuff. I have no idea what it's called but they'll know if you ask...then they'll give you the stinkeye knowing full well you are likely fresh out of an institution.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-11", "description": "I have been here once... To start off the night before hitting some clubs on Broadway. Barkeep is mellow, served up some mean drinks and that's pretty much it. For dive bars this is the pure meaning of the word incarnate and that's why I loved it.", "author": "Alfredo N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-13", "description": "strong drinks, very strong drinks\n\nand lots of chinese people screaming at each other\n\na good no-nonsense dive bar, and the barkeep is a chinatown legend\n\nhungry? it's probably 2am anyway, sam wo's closes in an hour", "author": "Charles C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-26", "description": "THis is a GREAT bar and you should go....look out for the fish-man at about 10:30 pm-he sells some good stuff, and on Xmas-eve, he had a last minute deal on lobster.  If you're interested, bring your own plastic bag to take home...", "author": "Nic B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-07", "description": "Oh I wish I could remember what Metallica song my friend loved to play on that jukebox. Something obscure. I could take or leave Mr Bing's.", "author": "Angela K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-18", "description": "This little treasure is a great jump off spot.  Probably half the reason you'll go there is to get served by Bruce, a chinatown legend.  Bing's has good music, golden tee, tv and an \"I don't give a rat's ass atittude\".  That's probably why I like it. Oh yeah, also smells like pee sometimes, if you're into that.", "author": "Mike D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-30", "description": "This place takes me away.  Is the first true dive I've come across since moving here which measures up (down) to my dive standards from back east. And that means: great pours, great regulars, no excessive love from behind the bar, crap on tv, disconcerting lighting, etc etc. Wretched little haven. Might not be for everyone - but that is totally, totally fine with me.", "author": "kt s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-02", "description": "What a great dive bar. Cheap, stiff drinks, funny and patient bartender (I'm not always the easiest patron to deal with after a night at the bars) Not sure I would go to stay there all night, but it's a great place to go to start or end, or just drop by on your way somewhere else.", "author": "osmahn k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-21", "description": "A great dive bar and a great place to catch the Chinese New Year Parade (it ends right outside the front door) only negative is the bartenders can sometimes be a little distracted.  Jukebox is pretty robust too.", "author": "Peter E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-13", "description": "my favorite SF dive bar.  reasonable prices, entertaining people watching and i always leave drunk!  i know the place is ugly and smells a little bit, but what else do you want in a dive bar other than laughs and cheap drinks.  insider tip.. during the day when it's empty use the women's bathroom.  it's actually cleaned daily and doesn't have any bugs flying around.", "author": "T D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-28", "description": "feeling invincible after a giants game we attempted to walk most of the way home of course not getting very far......Enter Mr. Bing's. Opposite of fancy- Mr. Bing's is just what the Doctor ordered if your doctor works at a free clinic and prescribes alcohol. 2 drinks later, and feeling much warmer, we continued on......to the next destination.", "author": "ali m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-17", "description": "a fun north beach dive-bar where you can play \"Dice\" if you're into that... well, thats what we did when we were there :) just ask the bartender for some. a good low-key place that's easy to spot right on columbus!", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-09", "description": "mr bings is one of the first bars i went to when i moved into the city a while ago. over priced but the charm and all that comes with it is devastatingly what you want. beer. good people watching.", "author": "aidan m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-19", "description": "So being the usually responsible person I am....found out I had forgotten my ID in the purse exchange at home. Sooooooo being in North Beach with a  group of friends wondering where the heck am i going to get in without an ID.....a lightbulb went off above my friend Matthew's head....Mister Bings he says....\"Mister Bings\" who the? Where the? And a walking we went to this corner type bar situation...... I have no clue how long this bar has been in existance but the cash register made from the 1300's or so it looked anwsered my question- long, long, long, long, long, long, time. I am not sure if Mister Bing was the one behind the bar working, but that's what I called him all night whether he like it or not- He made us jager bombs but mixed the bomb and the jager together....gross. There were some weirdo's in the bar but I was with my friends and that's all that mattered to me! P.S. he didn't check my ID- phew!", "author": "Ricquel N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-07", "description": "i think i'm in love.  the second i saw the sign outside, i knew this was the place for me - a quick glance through the window at the triangular padded bar only confirmed what i had originally suspected.  and when i asked the bartender (please tell me that he was mr. bing) what kind of beer he had, he just waved at a stack of boxes against the wall and told me to take my pick.  i'm not sure what else to say really ... ummm see you there?", "author": "ali l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-29", "description": "Great little dive.  Nice jukebox, great bartender, and most importantly, cheap strong drinks.  If you find yourself in North Beach, this is where you should start out, or end up, or both.", "author": "Fabio F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-26", "description": "this isn't the place you take a girl to impress her. this is me after work with a friend who just want to have a conversation and a drink. it's not even a dive bar. it's just a place.", "author": "Daniel N."}
