{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Love Mr. Pickles! I've ordered here for my office and my office mates have always been happy with the results. \nWould recommend! I usually get the Mercy Me (with swiss instead of provolone). \n\nSometimes I wish they were open past 7, but that's just because some office days go late. Thank you, Senor Pickles!", "author": "Sara G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-05", "description": "The sandwich was not bad \nBut the cashier attitude wasn't very Pleasant\n\n\n\nBeside it the restaurant was Decently dirty  most of the tables where very sticky like no one have wiped for very long time \n\nI'm hoping to come by again and maybe I had a fools experience because the sandwich was really no bad .", "author": "Aviad B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-06", "description": "Total Sh*t Show. Don't waste your time or money. So many things wrong with the entire experience. \nArrived at 5pm, left at 5:37pm sans sandwich. Didn't have fresh bread, or many other items. 3 other people ordered before me and got their order first. The trainee did not know simple math and got flustered and when I asked why I was overcharged 6$ the sandwich maker/only other person in the shop, put her hand up to me and told me don't be rude. After back and forth for a few minutes where I was trying to help him do the math because they don't have receipts or a calculator, I went to sit down. 15mins later my sandwich was not done. When I asked them status, she immediately replied give her her money back. Then the cashier spent 10mins trying to figure out how much to give me after I told him 10x it was $12.40 while he yelled at me. I just went in for a sandwich, wasted 40mins and got yelled at. What a joke! \n\nAny reply from the owner would be welcome, but the owner wouldn't even get on the phone with me to fix the situation.", "author": "Rebecca M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-21", "description": "They definitely have good sandwiches, and when I'm in the area, I would definitely go. This location is cash only and has an ATM machine in their store. \n\nHowever, Little Lucca's in South SF has the better sandwiches which are also much bigger for cheaper.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-11", "description": "I had got the mad munchies,and my co workers told me to hit them up. It was on my way home so I go. I get the station 7 sandwich, I was going to wait till I got home but I said fuck it I'll eat some now. I had a weird request, I asked to cut it into 4s.  They did with no problems yay! \nThe sandwich blended together perfectly! The cheese was melted and all that good shit. I ate half. So good I wanted to eat the whole thing. Great customer service since it was my first time. I took one star off because I wish they had a more inviting sitting area. It nothing fancy,just a good spot for a sandwich!", "author": "Maria R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "The best sandwich I've ever had. Up until this point probably Brother's sandwich in LA was my fave but as a person who normally hates sandwiches I can see why people like sandwiches, after Mr. Pickles. It's in a what I thought was a somewhat random location, very residential. It's easy enough to find though and it's no-nonsense, straight forward good food. It's super casual and a bit run down with limited seating.\n\nMy hubs and I shared a Station 7 sandwich and it was SO good. The chicken breast was a teeny bit dry but the pepper jack cheese was all melted, the sauces were an incredible and the veggies in it were SO fresh. It was one of those times where you're like, wow this is what fresh veggies are supposed to taste like and you remember you eat un-fresh delayed delivery food from middle man grocer which is just depressing. The dutch crunch bread was probably the best part of the sandwich, every single bite filled my nostrils with super fresh bread-y scent and the texture though it cuts up your mouth is incredible. \n\nOverall, would HIGHLY recommend, I can't wait to come back! BTW, it's cash only .", "author": "Amy K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-06", "description": "Worst service. The owners niece made my sandwich with the wrong bread and asked me to pay for both if I wanted to change my bread. It was my first and last time here.", "author": "Madie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "This is my favorite spot. It the bread to meat consistency that has me. Perfect sandwiches. No joke. Check them out in Daily City too, Their Hella Good", "author": "Justin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "This is by far one of the best sandwich spots I've been to. \nI didn't used to actually stop to eat at those spots but recently it's been something I've wanted to try but I'm not easily amused with a new spot. This honestly turned into a favorite by far and I haven't tried many and I've only been there once. The go green sand which was amazing! I hadn't tasted a sandwich that actually left me feeling wanting more. I would literally be able to eat there everyday  but that wouldn't be the best diet and also I live in the next city. If I lived near by I think I'd actually go there as often as I could... but I'm willing to travel  but for sure 5 stars. It's not a huge place it's cozy the workers are nice and their work is of course amazing.", "author": "Carolina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "I phoned in my order ...so many choices \nThey were very helpful on the phone \nAs soon as I walked in my sandwiches were ready without any waiting period \nThe cashier was very polite (cash only) with this kind of service I'll be back and when I tasted my sandwich definitely delicious me and my coworker were very satisfied \nThank you", "author": "Serenity A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "I say 4.5 stars technically because not only was the sandwich delicious, the customer service was amazing.\n\nI got station 7 sandwich no pickles, added cucumbers and finally added jalapeno ranch dressing.  BOMB!  \n\nI really enjoyed it and will come back for more.\n\nPrice was a little high, and it was cash only!  So one star off for that.  But if I could do 4.5, I would!", "author": "Raja D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "I wish they'd opened early enough to be the sandwich we take on hikes, but that only happens when we get out the door late. \n\nInstead, it's my favorite choice in my neighborhood when I don't have anything to cook for lunch on the weekends or if I'm heading to meet friends at Dolores or Precita park. \n\nSplitting a sandwich is perfect for not feeling overfull, but I confess that during anything longer than a 5-mile hike I'd rather have my own ;)\n\nLots of options, but if you don't find your calling on the menu you can always make your own. Comparable to Ike's in size/style of sandwich- I think better, at least because there isn't a huge line. \n\nBummers: \n-funky hours (closed when I get home at night, open too late in the AM to pick something up on my way to work/weekend activities)\n-cash only (and cheapest sandwich is $10). Closest ATM is at the liquor store at 21st and S. Van Ness. The sign on their machine has said \"new one coming soon\" for over a year.", "author": "Krista L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Great neighborhood find, much like all the surprises you walk into in the Mission these days.  The menu covered so many tempting options.  The people at the shop are willing to guide first timers to make recommendations.  Our sandwiches were delicious but an incredibly generous portion, we had to save it for later.  Looking forward to going back!", "author": "Soo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Best sandwiches!!! I love the turkey with cranberry sauce. But everything I've tried there is so good!", "author": "Kiko Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-10", "description": "Slow service, not friendly and they do not listen to specifications \n\nLastly its a cash only place so very inconvenient \n\nCertainly doesn't feel like a mr pickles", "author": "David G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-11", "description": "Super super suuuuuuuuuuuuuuper slow service. Two sandwiches took over 30 mins. And they warmed up the meat in microwave instead of the oven.", "author": "The M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "Is a small sandwich shop located in the mission. They have a variety of hand made sandwiches that are pretty good.\nBread is good and the ingredients are fresh.\nThe price is fair, an average of $10 a sandwich.\nThis place only excepts cash. There is an ATM located inside of the restaurant however it didn't seem to work.\nI ordered they were very busy and it took about 20 minutes to make the sandwich. Considering how busy they were it seemed reasonable. Street parking may be a bit difficult in this area.\nI would highly recommend this place over your standard Subway or Quiznos.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "Best Sandwich shop in the Mission. End of story.", "author": "Tuffy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-19", "description": "Was very dissappointed with this place.. smfh got me a ceasar chavez sandwich... i mean it looked good..but when i bit into it.. the chicken breast was super dry and didnt have any taste... smfh do not get the ceasar chavez sanswich unless its marinated in something.. because ir tasted like  chicken from a can.. smfh oh well this will be the last timw i go here and just stick to the one in Daly City!!", "author": "Jay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-02", "description": "Yum!\nI used to work near Mr. Pickle and it was worth the 3 block walk in the heat to get one of their sandwiches! I would always get a make your own, and it was always just so so delicious! They are also HUGE! There is enough for later or even for the next day. They do only take cash, but have an ATM in the store.", "author": "Larissa S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-05", "description": "Came here for lunch one today. I was excited to eat here because I've heard good things, I preferred a \"Silly Philly\". The first sandwich that came out smelled good but I took the paper off and the bread was completely black from being burnt. I sent it back and the second one came out a few minutes later, it was cold the bread wasn't toasted, the meat was cold and the cheese wasn't melted. I sent it back and didn't order another. The girl behind the counter looked surprised and the cook didn't offer to fix it. I would never come here again.", "author": "Shavon Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "I've always thought that grubbing on taravel had the best sandwiches in the city.....but I was wrong.  mr pickles on south van is AWESOME.   huge portions, super clean and a creative sandwich board.  when I work in the area this is a lunchtime must.  5 stars all the way", "author": "Robert S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-29", "description": "They made me a pretty decent sandwich. I had the one with chicken and pesto on a toasted dutch crunch roll. It was loaded with chicken, pesto, and a good bunch of lettuce, tomato, onions, and banana peppers (I think).\n\nThere was nothing special about it as it was a pretty standard sandwich with standard ingredients, but well executed. It obviously can't hold a candle to Ike's Sandwich but that is not to say it's not a good sandwich either.\n\nI later found out it's not affiliated to the \"Mr. Pickles\" mini-chain of sandwich stores, and I find their logo and branding very misleading.", "author": "Umesh T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-21", "description": "Order online! You can personalize the sandwich and request a time for pick up, whether it's now or later. They'll call you to tell you your sandwich is ready.\n\n#13 Cesar Chavez - 3.5 stars\npic: http://www.yelp.com/biz_photos/mr-pickles-sandwich-shop-san-francisco?select=Cg4u2ym1991VHSroYyx33Q#Cg4u2ym1991VHSroYyx33Q\n(Chicken breast, bacon, avocado and jack cheese on sourdough roll. My version: dutch crunch, pepper jack cheese, no pickles, extra sprouts. $8.24)\nDefinitely a good bargain - you get a huge sandwich with a lot of meat. The quality is not the absolute best, but you still get a good sandwich. The dutch crunch was a little hard, not as smooth & buttery as I've had in the past. The chicken, while seeped in their sauce (which tasted great!), was still a little dry. And I highly recommend adding sprouts - adds that subtle bit of crunch and gives the sandwich some greens and freshness.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-10", "description": "First time in SF. Rainy day, lost, and really hungry.  Wendys? No. McD's? NO!!.  Down a little street I spy Mr. Pickles Sandwich Shoppe.  Hmmm says I. Tummy and bladder shouted STOP.  ...and I'm glad I did.  Wes greeted me with an open smile, nice to see on such a day as this.  His cohort, Wes, and I had a fun few minutes of 'where are you from'. I informed them of my vegan status, Wes and his co-worker assured me they would prepare something wonderful and they didn't disappoint.  The Veggie minus cheese was huge,well stuffed with fresh and delicious goodies and lightly touched with some sort of pesto infused oil.  Next time I expect to taste the eggplant with marinera sauce. Hot and toasty.\nGreat experience. Thanks guys!!", "author": "Karin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-27", "description": "I gotta say, I was pretty hyped to go to Mr. Pickles, especially after hearing all the praise that friends and co-workers gave it.\n\nBut the thing is, there were just a lot of little things that turned me off. Dutch Crunch should crunch, shouldn't it? Chicken coated in Frank's Red Hot shouldn't be dry, should it? Sandwiches shouldn't cost $9+, should they?\n\nIt was decent, but nothing award-winning.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-09", "description": "Came in to get a sandwich today  around 1 pm only to find out they only take cash but their ATM machine is broken and has been for several months . OK. I guess they expect you to walk three blocks to the nearest bank and come back... For real?\n\nMy friend wanted to order a simple sandwich w/ cheese and add pickles, they told her no, we can't do that? WTF? Mr. Pickles won't give you any pickles? They would only let her have pickles on the SIDE of her sandwich... Ummm, ok? You should really think of changing your name since you won't give people pickles on their sandwiches, Mr. Pickles.\n\nNext I ordered #17, a BBQ chicken sandwich with pesto. I thought the flavor profile sounded a bit weird but I was willing to give it a shot. I asked for no peppercini, onion or tomatoes. They remembered everything except the peppercini.\n\nThe establishment itself is not well taken care of at all and the employees appearance is sloppy. The rack for the chips was low on chips (at 1:30?) and so were their beverages. I was hesitant to sit down in their dirty chairs for fear of catching some undiscovered disease. Needless to say, I didn't stick around any longer than I had to once I got my food. \n\nThe sandwich was big but all I could taste was the BBQ sauce. Nothing else came through but the taste of the BBQ. Not the $2.50 extra I paid for bacon, or the $0.75 I paid for ranch dressing, or even the pesto sauce. Nope, nothing but BBQ sauce. I paid over $12 for this monstrosity and couldn't even finish half of it before my stomach started talking to me.\n\nYup, you guessed it. I won't be going back.", "author": "Eve R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-09", "description": "We love this restaurant. \nThe sandwiches are wonderful!! Good breads. \n Try it. \nPlus they have gluten free too that I really enjoyed. \nMmmmm my mouth is watering just thinking about it.", "author": "Car B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-22", "description": "3.5 stars overall. \n\nWhile I've had better sandwiches in SF, my husband and I will be popping into this place frequently, given our satisfaction with our first experience and the proximity to our place.  Would have rated higher had it not been for the bread; we had the dutch crunch bread, which didn't have the classic \"crunch\" and chewiness we were hoping for.  The bread was still fresh and tasted fine; but didn't have the texture that I'm looking for in a dutch crunch.  \n\nThat being said, the sandwich we had was delicious, topped with a VERY generous amount of toppings, which I'm a huge fan of (I loathe sandwiches that lack on toppings - pile on those toppings please!).  Oh and the pickles; outstanding.\n\nWhile it may look overpriced for a sandwich, please do not let that stop you from trying these delicious creations!  The sandwiches are so large you can probably plan on splitting with a friend or ending up with leftovers.  \n\nDefinitely will be back, Mr. Pickles :)  Just maybe consider swapping out your dutch crunch for a better option.", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-12", "description": "I'm a die hard Mr. Pickles fan, but my best friend and I got food poising last Sunday. Scared to go back and it's so sad because it's one of my favorite spots. Also the all cash thing is bullshit. Like upgrade already.", "author": "Nancy I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-17", "description": "I usually don't write reviews but today I feel I have to. I had the worst possible experience coming into mr.pickle today. First I ordered 'the bear' or 'the boar'. First they don't take credit cards. That part I don't mind but then I noticed they don't hand out any receipts. They don't punch it in the register. They don't keep any records of sales or orders. Sound fishy? Uncle Sam will probably catch up to them sometime or another. \n      \n      After waiting 20 mins or so I noticed the people who were behind me  getting their sandwiches and started eating. Then one of the guys asked me what I ordered. I told him what it was then he told me he lost the post-it they use to keep track of what sandwiches to make. Who writes the order on a post-it and think that is a good system to be organized?\n\n      He goes and tells me that it will take another 10 mins to make the sandwich that they totally forgot about. This was after already waiting over 20 mins after I placed my order. \n      \n      I asked why would it take that long? They said because it needs to be toasted for 3 mins. Well does it take 7 mins to finish it? Are they making everyone else's sandwiches before they get to mine? He then told me they can make a cold sandwich for me right away. I looked at the menu and all the sandwiches they make are all toasted except for 2 . It has a \"T\" next to sandwich on the menu to indicate that the sandwich is toasted. \n     \n      He was kind enough to refund my money and make the cold sandwich for free. I thought that was a nice gesture. I then ordered the House Combo. They make the sandwich right away and in just under 30 mins I finally had a sandwich and went on my way. When I got back to my office to eat since I had no time to eat there I saw that they gave me a sandwich with only cheese and a cucumber!!!! I can not begin to explain how pissed off I was when I saw that!!! \n\n      The only thing that I can come up with is that they had to have did that on purpose since I took them up on taking the free sandwich. They offered it to me because they made the mistake and had me wait close to 30 mins to get a sandwich I didn't originally ordered. Who eats and orders a sandwich with only cheese and a cucumber??? \n\n       This is by far the worst experience I have ever had in getting a sandwich. I would not recommend this place not because of the sandwiches but for how they treat their customers and how they are cheating on their record keeping. How do you claim accurate sales and pay taxes when you don't keep any records of them? No receipts, all cash, and take orders on post-its.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-26", "description": "There's a shortlist of sandwich joints that comes to mind when discussing \"best in the Bay\". Ike's and Little Lucca are securely at the top of the heap IMO. The few that follow are: Brazil Cafe in Berkeley, Submarine Center in West Portal, Rhea's in the Mission, The Sentinel in FiDi... (subjectively speaking of course)\n\nMr Pickles is not far down that list.\n\nThere is a careful formula in making a good sandwich. The aforementioned list of sandwich joints have adhered to this tried and tested ratio and in most cases, even perfected it. The same goes for burritos, shawermas and anything that consists of a starch, a protein and sauce. The ratio has to work in order for the meal to work. \n\nMr Pickles makes it work. And they do it with a smile. \n\nTheir staff is a friendly lot. I keep forgetting that it's cash only so one time, I was short a couple of bucks but had already ordered the sandwich. The guy just gave it to me without hesitation. He told me to just get him next time. I did just that. \n\nI've ordered the Porky Pig several times. It's one of my faves. It's just ham, bacon and cheese but sooo good. *oink* \n\nI'm also a fan of their pastrami so I sometimes go for the Dog House (pastrami, bacon and swiss cheese) or the Diyana (hot pastrami and swiss cheese on rye). They have never disappointed.\n\n                                                            ************\n\nIn honor of the late James Gandolfini, I shall wolf down an entire Tony Soprano (salami, ham, mortadella, provolone cheese, italian dressing on dutch crunch) the next time I'm here. And this time I won't forget to bring cash.\n\n4.0 stars.", "author": "Angelo B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-25", "description": "Well, I've been a long-time fan of Mr. Pickle's but this was my first trip to the mission location. I have to say, the food was at least 4.5 stars but good lord, it was the dirtiest sandwich shop I've ever been in.\nIt really feels like a gas station. Great food, friendly service, but gross gross - sweep the lettuce off the floor!", "author": "Kiefer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "good food and great service! The staff is friendly and willing to go the extra mile.A variety of bread choices, meats and vegetables made to order. This was meant for Concord ca shop", "author": "Debra H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-03", "description": "Got the Dog house on dutch crunch.  The dutch crunch here is fabulous!  Heated to perfection; crisp on the outside, soft on the inside.  \n\nGood amount of meat, veggies, and sauce.\n\nWill definitely come back to try the other sandwiches.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "I love sandwiches!!!  This place literally makes one of THE best sandwiches I've ever had. Ingredients are fresh although sometimes the chip selection is a little small, but I'm guessing it's due to the amount of business they have throughout the day. The same 2-3 guys are always working so the consistency is definitely there. They are super friendly and the guy at the register asks about my dog whenever she's not with me!!!!\nCurrent fav is the boilermaker vegetarian style.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "Let me begin by declaring my hatred of pickles. I detest them. I despise them. Given the opportunity, I will defame them. Off the bat, the name of this place put me off. Even though I've walked by nearly everyday for a year, I never got the outage to stop in and buy something from *the pickle joint*.\n\nLast week I finally mustered up the courage to try Mr. Pickle after they refused to sell me an Italian sub at Salumi. Crossed my fingers, crossed my toes, and went in.  Lo and behold it did not smell like kosher gherkin in there!  Thank goodness!\n\nMr. Pickle had just what I wanted, the Tony Soprano, an honest Italian sub. served on Dutch crunch with a little mayo, it was a slice of Jersey on an SF afternoon.", "author": "Ivan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-06", "description": "I really wanted to LOVE Mr. Pickle's.  I mean, it's named Mr. Pickles!  So awesome!\n\nBut, my Cesar Chavez was kinda just an explosion of over-cooked chicken, mayonnaise, lettuce and avocado.  Sure, there was some bacon in there, but it was overpowered by the absolutely massive amounts of chicken and lettuce.  Certainly it was a LOT of food.  It was so big I could skip dinner (I did skip dinner!).\n\nSo, while I'll still love Mr. Pickles in theory, and I'll always love Mr. Pickle waving at my as I drive by on South Van Ness... I'll keep looking for the perfect sandwich.", "author": "Jon E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-02", "description": "Really friendly guys! Great suggestions and delicious food! Will be coming back for sure!", "author": "Porsha H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-30", "description": "Turkey, Bacon, Swiss & Sweet Dutch Crunch bread.\nI'm craving you right now.\nMore than anything else on our planet.", "author": "Johnny K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-03", "description": "A dirty little sandwich shop that feels like a gas station inside. Huge menu. Super friendly, helpful and stoned sandwich masters to help navigate the enormous menu.\n\nIf you have to get something quick that you can eat later, Mr. Pickle's is a win (we went to get sandwiches to take to the Giants game). \n\nIf you're looking for anything different, you don't have to walk far to find better food.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-09", "description": "Salads are just as good here as the sammies. I usually create my own sandwich but my coworkers looove the #24 Go Green. \n\nStaff is super friendly + nice. Overall, good lunch spot.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-19", "description": "A long, long time ago, I asked a Mexican friend how to say \"pickles\" in Spanish.  She said, \"I think just 'pickles' with a Spanish accent?\" Thanks to Google translate, I have since determined that was a LIE.  But the seed was planted and Señor Pickles was born.    \n\nDon't let the grief of James Gandolfini's passing deter you from getting the Tony Soprano, with salami, ham, mortadella, provolone, and italian dressing.  It's pretty astounding.  And big.  All of Capitán Pickles' sandwiches are big, actually.  I had to shove half of my meatball sammy in my purse for later and hope it didn't leak its goodness all over the place (it didn't; I wrapped it nice and tight.)  \n\nBasically, next time I'm closing my eyes and picking randomly from the menu.  No more building my own sandwich for me!  \n\nOh and the pickles are HUGE!", "author": "Yelena K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-26", "description": "Now that Mr. Pickles SF serves gluten- free bread from Mariposa Bakery I will never go to Ike's again! The bread size is much bigger than Ike's lame tiny gf bread but with the same good taste, the price was $5-7 cheaper than Ike's. I am not looking back on this decision! Also now they offer more vegetarian/vegan options than before. \n\nNothing is perfect, I wish Mr. Pickle was cleaner and the staff was more professional. I mean would it kill you to put your work uniform in the laundry after making 50+ sandwiches? If you have celiac's disease you may want to skip eating here, I watched them use one knife to cut all sandwiches. \n\nMy fabulous veggie sandwich on gluten free bread was $7.50 today, you can't beat that.", "author": "Shannon Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-22", "description": "Delicious sandwiches! Every sandwich i get is huge and delicious. My personal favorite is the gaucho! Cannot go wrong with Mr. Pickles!", "author": "Allison M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "Can't beat it. Classic Sandwiches, fresh ingredients and special sauces. Hot or cold is the question. Love it, no matter what city their in. Enjoy!", "author": "Frans R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-05", "description": "I got a sandwich from here in salad form and it was so good! The staff is very friendly and willing to help. I am not from the area but the next time I am in San Francisco I will try my best to go back here.", "author": "Mallory S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-28", "description": "It was honestly just okay & compared to other sandwich shops in the mission this one just falls short on innovation, flavor, & sauces. Sorry guys! Love your lol pickle out front!", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-08", "description": "I've passed Mr. Pickle quite a few times and always wondered if it was good. I actually looked on yelp and there were 4 stars so I thought it was going to be pretty amazing. SADLY, i was disappointed. The sandwich was way too dry. I ordered a sandwich with chicken breast in it and it was so dry that i couldnt even eat the other half. the taste was good but there wasn't enough moisture. they also had avocados that weren't ripe so they didnt give me any. my friend got a sandwich with pastrami in it and it was also extremely dry, even with the veggies. maybe they forgot the mayo? \n\nI gave the food 2 stars, but im giving this restaurant 3 because of the friendly service and they let me have bacon since there was no avocado.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-28", "description": "This sandwich shop is reliable which is what is best. The ability to order a sandwich at peak hours of the day is so clutch. I have tried 3 different sandwiches and they were rich in protein. This is what makes Mr. Pickle's Sandwich Shop different from other sandwich stores. The sandwiches are super tasty and they are big enough to satisfy even those folks with large appetites. I'll be coming back here regularly, because of the quality and the sandwich size.", "author": "Marcos F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-18", "description": "The only explanation for The Hipster - which is one of the best concoctions in all of the lands - is that the sandwich elves get f*cking stoned before coming up with their creations. \n\n\"You know what I want, man? Chicken ... peanut sauce ...teriyaki ...  and sprouts.\" \n\nKeep smokin' it up, Mr. Pickles - your high-as-fuck creations rock my world.", "author": "Mel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "I had over a dozen sandwiches from this place while living in the neighborhood. I've ordered in person, online, and over the phone without any issues.\n\nThe sandwiches are large and tasty! Pesto sauce and pickles are good. I usually get the Cesar Chavez or Station 7. The Illers is actually quite good, as is the flavorful Hipster. I'd always try to eat one half while walking back to my apartment with the other half and a bag of chips stuffed into my pockets.\n\nPoints off for the crummy shop interior.\n\nCash only.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-29", "description": "So I feel bad giving them 3 stars but I cant help it. The guys who work there are very nice, its close to home, cheap and never crowded - but Mr. Pickles did not win my heart.\n\nI have gone here twice- both times I left saying I wont come back.\n\nso many people love this place and Im starting to think that maybe its me :P\n\nThe bottom line is- the sandwiches are OK nothing great. I have tried two different sandwiches and both times they tasted bland and I have to say they really take their time making the sandwiches. \n\nProbably will go back one more time but I dont necessarily recommend it.", "author": "Nina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "I love this shop.  I love the taste of thrir gluten frre bread.  They were considerate enough to use a dofferent knife and preparation area without me even asking. The flavors are rich. I  filled up by half a sandwich! I wish there was one in Utah!", "author": "Brittany M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-10", "description": "This place is amazing.  Best veggie sub I've ever had.  I come for lunch almost every day because it's that good.", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-13", "description": "Sandwiches include a generous portion of meat and condiments.  Definitely suggest getting the Tony Soprano on Dutch Crunch.  \n\nNot much seating here, so you're best bet is to take it to go.  \n\nCASH ONLY.", "author": "Larry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-13", "description": "Big, gooey and filling!\n\nOh how I wish we had a Mr. Pickles in the East Bay! \n\n I ordered a SFGator I believe.... well the one with cheddar, bbq sauce and chicken. WHEW!! I couldnt even finish it because it was the size of a super buritto!  All the flavors meshed well together even with the pesto! Just the right amount of everything! I usually go to the mexican spot across the street but I think they just recieved some competition for my dollar!", "author": "Marakia R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-30", "description": "I wouldn't go out of my way to get a sandwich here but if you're in the area (and are tired of bi-rite), Mr. Pickle's has super duper sized sandwiches of all different kinds (their selection really can't be matched). \n\nJust make sure you have cash on you because last time I checked they don't accept cards.", "author": "Raha G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "Always a fan of the Millbrae Mr. Pickles and was happy to see his Mexican cousin on 20th.  I was super busy at lunch and missed my time frame to eat a deli sandwhich.  I was still craving one when I got off work and figured most delis were closed.  I was thinking I would grab Mexican somewhere and then I drove by Mr. Pickles and saw that they were open. \n\nThe sign on the door said they closed at 6 but it was 630 and the sandwhich slanger was still working.  All of the options sounded bomb.  But went for the Station 7 (chickenbreast, honey mustard, avo, jack) on Dutch Cruntch.  When he handed me the huge sandwhich wrapped in white paper, I was delighted that the sandwhich was all warm and toasty.  \n\nTasted so good. Not way too much mayo, honey mustard taste was sweet and tangy, lettuce was crunchy, onions gave the perfect kick and the bread was sweet, chewey and crunchy.", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-05", "description": "Those who know me know that I am a very picky sandwich eater. I do not eat sandwiches that are cold, not toasted and I dont put any mayo, mustard, tomatoes, olives, pickles, peppers, etc.... I even eat my hotdogs plain...no ketchup, mustard, relish, etc... you get the drill.\n\nI finally got a sandwich from Mr. Pickles when I was in the area last week. I've visited countless times in the past and was disappointed whenever they were closed. I ordered the Cesar Chavez which came with chicken, bacon (removed from sandwich!), lettuce, lil bit of onions, avocado and cheese on toasted sourdough bread. It was DELICIOUS and definitely worth every penny! I ate half for lunch and half for dinner. Very satisfying and I will definitely be back!", "author": "M W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-08", "description": "Decent sandwich shop. I live nearby and get sandwiches for weekend lunches. My go-to is the Caesar Chavez on whole wheat with everything except mustard and pickles. Tasty, but sometimes the chicken is a little dry.\n\nPro tip: call ahead for pickup.", "author": "Max H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "When you need a BLT fix, this is the place to go! I get it on dutch crunch. Hits the spot everytime.", "author": "Divya P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-09", "description": "Got the chicken breast salad, absolutely huge so definitely worth the price. Good range of dressings too. Great selection of sandwiches and even do gluten free bread which being coeliac, is a massive plus for me. Super sweet guys working there, very kind and helpful.", "author": "Jazmin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-08", "description": "Not all Mr Pickles are alike. This one is the peak of what Mr Pickles should strive for. Fast service with subs as satisfying as they are affordable.  If you are in the mission craving a sub this is the place!", "author": "Deacon J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "I am hopelessly in love with Mr. Pickle. He is a flat wooden cutout of a pickle wearing a sombrero, which stands on the street during opening hours..... and I love him. I hope he never gets stolen again.\n\nMr. PIckles is the place to go when you realize Ike's has a little too much hype to be your standby. It's a great, reliable friend who will help you pack a perfect picnic for your walk around the Mission or your drive down South on the coast.\n\nI like the Turkey Tom and the chicken-bacon one with sprouts, and the Hipster is delightfully unique and sticks right to your ribs as the wind and fog from the bay roll in to chill you.\n\nAlso, I have never seen such a wide variety of chips in a single place before. It seems like a custom-curated collection from all the best bodegas of the area.\n\nFacts:\n- You don't have to like pickles, they're really good about taking modifications to any sandwich or customizing to order\n- You can order online in advance... pro tip\n- Giardinara peppers come free with any sandwich and add excellent zing\n- Closes early on the weekdays, which is sad\n- Sandwiches keep an amazingly long time - pick one up Friday for a trip Sunday even and you'll be OK\n- Dutch crunch is so delicious. Did you know they paint the tops with rice flour which then cracks during baking? (Also the Dutch call this Tiger Bread, not Dutch Crunch. Potato Potahto.)\n- You could share a single sandwich with a friend for lunch and have plenty of food.\n- The prices are great.\n- Cash only\n- They do have a carafe of coffee inside in case you need it.\n\nLove ya, Mr. P!", "author": "Megan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "This place is amazing! My GF was having a rough day and then she had the golden gate sandwich and it changed our days!!!! Seriously guys OHhhhHhHhh my gawwwwshh so good. I thought the chicken was gonna be a chicken breast but it was shredded and soo so good.", "author": "Adam G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-14", "description": "I wanted to write this review right after I ate my sandwich, but I fell into a food coma.....  Three hours later, I am finally awake to tell you Yelpers how wonderful Mr. Pickle's sandwiches really are.  I got the \"Slickster\" on a dutch crunch roll with turkey, jack cheese, and cranberry sauce.  Soooo freaking amazing, and bigger than my whole face [see picture].  Not good for anyone on a carb diet, but if that's you, what are you doing reading a review for a sandwich shop anyway?\n\nAlmost all of their specialty stuff automatically comes with pesto on it, so if you don't like that, say so when ordering.  And bring cash, cause you can't use your plastics here.  Also, there's hardly any place to eat inside except a tall counter at the window, so plan on carrying that massive brick of a sandwich home with you.", "author": "Christy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-16", "description": "I ordered the Tony Sopranno and was being difficult in terms of toppings when I went. They accidentally gave me the wrong sandwich but quickly fixed it and even gave me a free bag of chips to go with it. Things happen, but I'm just glad they were so nice about it. The sandwich was also amazing.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-21", "description": "Yes! This place is soo good. The tall handsome muscle man at the cash register is very nice. The sandwiches are so good. They put delicious pesto sauce on the veggie! Yumm! Love it here!!", "author": "Susana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-27", "description": "I had about a half an hour to kill before I had to be at work.  I needed some grub and I took to my Yelp bookmarks to try something new.  I decided to try Mr. Pickle's.  I first heard of Mr. Pickle's in SF Weekly when their iconic sign was stolen and I was always intrigued.\n\nI made my way inside and it looked like a nice mom and pop deli.  I took a glance at their menu and the Cesar Chavez and The Gaucho caught my attention.  I chose the Gaucho because the chicken comes marinated in my favorite sauce, Frank's Red Hot Sauce.  The sandwich consists of chicken marinated in Frank's sauce on a sourdough roll topped off with mayo, mustard, pesto, lettuce, tomatoes, onions, pickles and peperoncini.  The sandwich also comes with ranch dressing, but I'm not a fan of the dressing so I requested no ranch.  \n\nThe sandwich is a generous portion and comes nicely toasty.  The sourdough roll was tasty and crunchy and the sandwich exploded with flavor from the chicken to the sauce.  The sandwich was a little spicy because of the wing sauce but it was perfect in my opinion.  The crunch of the bread, the flavorful chicken, and the condiments all added for a tasty sub.  I had intentions of saving the other half for later, but I couldn't resist.  \n\nMy only complaint is the lady behind the counter, perhaps she's the owner?  She had the TV on and they were running a news story about the new Arizona immigration law and she made a coarse remark regarding illegal immigrants.  I don't care about your political opinions and values, but watch what you say in regards to your customers.  I'll be back to Mr. Pickle's.", "author": "Alexander E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-01", "description": "Fat sandwiches, quick and friendly, lots of options.", "author": "Bantu Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-08", "description": "Parking is somewhat diffucult but hey, it's SF.  The place accepts only cash and has a small stool/bar table along the walls and a table for 2 right outside its doors.. luckily we grabbed the table because the sandwich, once it is done is freshly toasted that it must be devoured right there and then.\n\nI ordered the Mercy Me.. chicken breast, provolone cheese w/ marinara sauce w/ all their fixings: mayo, mustard, lettuce, tomatoes, onions, pickles, pepperoncinis, and pesto.. OMG.. be prepared to ask for extra napkins or you better be holding onto your sandwich the entire time because it is HUGE and MESSY.\n\nThe boyfriend ordered the Gaucho.. chicken breast marinated w/ Frank's Red Hot Buffalo Wing Sauce w/ ranch dressing on sourdough.. also w/ all the fixings mentioned above.\n\nThe lady did not believe me.. I finished my entire sandwich plus 1/4 of my boyfriend's because he wasn't able to finish it.  Boy was it good and boy did it almost make me regret eating his portion because I was full.. like very full.. \n\nRefreshments are offered in bottles or cans.. coffee and tea is available.. chips and candybars as well as cookies are available.. I bought the Deep Dish Chocolate Chip Cookie.. so soft and chewy.. \n\nI thanked the lady for a wonderful meal when we threw the trash away.\n\nDefinitely love this place.. friendly service.. the place was starting to get packed.. both walk-ins and call-ins.. the lady appeared calm and friendly throughout the mayhem..", "author": "Tram N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "Love this sandwiches! Pastrami here is great! They are fast and awesome, have great combinations. I have try the tuna here before and is great too!", "author": "Karen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "i went back again, and i can say this spot is the business for a couple reasons:\n\n1. they publish nutritional information whereas ikes does not. any franchise business (which ikes fall into) that does not publish nutritional info gets a raised eyebrow of suspicion from me. \n\n2. highly customizable sandwiches that do not diminish taste. i was being pretty health conscious the day i went and got my typical station 7 but removed: pesto, pickles, mustard, and asked for light mayo. it was still delicious as ever with these elements removed, but i think next time imma skip mayo altogether (there's avo on this) to save 100 cal and ask them to only use 1 slice of cheese.\n\n3. you can save half for another day. even with the items removed, the sandwich was still huge, so i made the decision to eat half now, and save the other half for tomorrow's lunch. phenomenal decision. i was satisfied with the first half and second half at their respective times, and did not feel painfully stuffed. ike's sandwiches are too small for this imo.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-18", "description": "These sandwiches cure hangovers.\n\nThe sandwiches are HUGE, delicious, creative, and the staff is a bunch of super-friendly cuties.  You can't go wrong with a sandwich from Mr. Pickles.", "author": "Dina G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-03", "description": "The deli sandwich situation in the Bay Area in 2014 kind of reminds me of the way sandwich shops used to be in LA back in 2004. There was basically just Subway (everywhere!) and Quiznos was the hot new thing. There was also a scattering of independent shops that were hit or miss, nothing too special unless they served 'Boars Head' which usually meant they wanted 10 bucks for a sub. And of course local California chain Togos was the place when you wanted something special (back when avocado was special)\n\nFor some reason the sandwich renaissance SoCal experienced has yet to make its way north. Jersey Mike is here but you have to hunt for them. Togos is still here going strong but none of the other big chains currently in SoCal raising the stakes are present. No Capriottis, no Gandolfos, no Firehouse Subs. For this reason Mr. Pickles seems to be thriving and all the Bay Area folk I talk to rave about the place like its....actually good.\n\nIts not that Mr. Pickles is bad. Its just that the bar has been raised so much by all these newcomers that Mr. Pickles now ranks somewhere down around Subway as far as Im concerned. Let me take that back, at least you can tell the difference between one meat and another at Mr. Pickles but to me their quality still isn't as high as the other big national LA chains. I like some things about Mr. Pickles. Throwing in a cookie is a nice touch (even if they are usually burned or hard as a rock) and I'd prefer a pickle like the real delis do.\n\nI think most people just keep going there because of nostalgias sake which isn't a bad thing. But I have a feeling Mr. Pickles days are numbered. Like Quiznos which slowly got replaced by Jersey Mike franchises and the Togos locations that are slowly closing  down as LA's sub titans battle for marketplace, its only a matter of time before they make their way north. I hope Mr. Pickles figures it out and adapts in time to survive. As for me, I'll be counting the days until Gandolfos opens nearby!", "author": "R S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "Delicious sandwiches!  Cesar Chavez was my favorite.  But the Station 7 is decadent and amazing!", "author": "Bennett H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-11", "description": "I did not eat here, but I am giving it one star for closing 30 mins before their posted hours. It's very frustrating to drive somewhere, look for parking and then not be able to get something to eat at 6:30 on a Monday when their posted hour is 7pm. Thank you for nothing.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "Grabbed one of these sandwiches before watching a movie because I never tried this place and it was delicious. You basically build your own sandwich. They have tons of options to choose from and I admit I was a little lost at first because of all the things I could do.\n\nThey had very few seats inside but that didnt bother me since I was leaving anyways. I grabbed a drink from their fridge and made my way out with a delicious sandwich.", "author": "Tim M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-17", "description": "BACON!!\n\nWell if you like Bacon as much as I do, then you will order bacon on any sandwich you get. Oh yea and it has to be on Dutch Crunch bread. That is the bomb dot com choice!! It's a staple for sandwich places. Just go if you haven't been. Stop being a wuss. Just kidding.", "author": "Indy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-07", "description": "Consistency is the key here!!!!  I have visited this location at 20th st. & the Daly City location as well, and each time I felt like I was at the same spot!  Great sandwiches, and even greater employees, every. single. time. PESTO. VOODOO CHIPS. I'll be loyal to Mr. Pickles forever :)", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-19", "description": "Full Disclosure - I live really close - and I eat here A LOT.  Not because I want to, but because it is so damn easy, and I'm lazy.  Honestly, I'd have previously said that I don't really like sandwiches.\n\nBut the guys that run this place are great - super friendly.  And they make an amazing sandwich.  They put some big hot mess of pesto mayo lettuce pepperoncini and a million other things on every sandwich by default and it's awesome!  Seriously, if someone hadn't handed me half a sandwich covered in this mess, I would have told them to leave it all off, but man, it's delicious!\n\nThe Tony Soprano is good, the Bear is my favorite (anyone want to split it with me - my boyfriend has developed a dislike of BBQ sauce in the last few years), and everything I've had (except a hot salami sandwich - salami alone should NOT be hot) is great. Also, they have good chips - try Funky Fusion (even though it sounds gross)!\n\nI wish they had unsweetened iced tea for sale, but they're so nice, they'd probably carry it if I asked!", "author": "Kim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "Just had lunch here. Wow! What a great place. The staff is friendly and the sandwiches are delicious and BIG.  This place is a great value. If you find yourself in this neighborhood, I highly recommend the Porky Pig sandwich.", "author": "Lloyd H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-10", "description": "The sandwiches are huge, and that is why all the ingredients fall out.  It's not very fun to take one bite and everything falls out and everything is a mess, especially when I had the #16 Mercy Me.  It's tasty though, but the chicken was kind of rough.  Compared to Ike's, it's not as greasy and bigger, but it lacks the kick that Ike's sauce has.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-19", "description": "The food was good but it's really dirty and there are a lot of Nats flying around and there is not that much space.", "author": "Avery A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "the sandwiches here are both good and enormous.  it's hard to argue with a $10 sandwich that is large enough that you can save the second half for another meal.", "author": "Kyle W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-02", "description": "Dear Mr. Pickles, \nYou have really good sandwiches.\nIt's also 2012, so, accept credit cards now.", "author": "jared c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-10", "description": "A staple of the neighborhood.  Big portions, great sandwiches.  I recommend the Diyana (roast beef) on sourdough roll, but the Soprano is a close second for me.\n\nThey also have giant pickles.\n\nYou could easily split a sandwich with a friend and feed two people for $10.\n\nThey have very convenient online ordering (you pick it up in person, no delivery).\nParking can be a bit of a hassle, depending on your luck.\nThey close before dinner (6pm most days I think) so I usually get Mr Pickles for lunch.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-04", "description": "Went in for the famed Cezar Chavez but they had no chicken. Got a meatball sandwich instead and was not pleased. First it was more \"stuff/extras\" than meatballs and cheese. Second the sauce was mediocre and third which I would say is most important the meatballs seemed very low in meat content. They had a whitish tinge and did not taste very good at all. I was starving and ate this sandwich and when I finished almost immediately felt ill. I would not come back here.\n\nOverall: Not good but the guy working there was friendly, food came out quick, and was cheap enough. \nAll that said, I would not return.", "author": "Josh V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-09", "description": "I love this sammich shop. The BLTA is great, but be warned you shouldn't try to eat this on your own! A triple decker, meant to be shared by two people.\n\nI was sad to learn that some jerk stole their life size Mr. Pickles sign from the front sidewalk.  It pained me to see the \"MISSING\"  poster inside the shop for a few months, but I was happy to learn the culprit returned it!\n\nAaah, mustard and mayo glory.", "author": "Ingrid K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-16", "description": "Oh Mr. Pickle, you certainly know a way to a girl's heart.  I LOVE the Cesar Chavez on Dutch Crunch.  \n\nLet's back up here a little, for those that don't what Dutch Crunch is, (AKA Tiger Bread), it's this wonderful crunchy-on-the-outside, soft-on-the-inside bread painted with rice paste on the top.  It's been getting a lot of hype lately, and I'm not a sammich connoisseur but lemme tell you...it's worth the hype!  \n\nThe menu is pretty extensive, but I think pretty much everything is really good here.  The sammiches are pretty perfect as is... I almost always customize a sammich, but uh uh.. not here, it is wonderful just the way they make it and it's pretty enormous.  I usually finish half and save the other half for dinner or the next day.  Quick tip: if you have a broiler, use it, and toast the bread up again!\n\nA favorite of mine for lunch, and the only downside is that it's a cash only place.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-22", "description": "My review is really only for the BLT on sliced sourdough with pesto, I'm stuck on that sandwich and haven't tried the others even though Mr. Pickle's is only a block away.  Maybe I have sandwich OCD or the dread fear of flying but it's a damnably fine creation, I get it without mayo as the pesto sauce is just enough to lubricate my masticators and the tubes at the back that lead down to the belly, critically  without sogging down the sandwich, can always make it home with an intact BLT rather than a soggy mess.  Someday I'll try another item off the menu, that day is not today.\n\nbacony bacon, sour sourdough and basily pesto make it tops for me.", "author": "Flummo X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-12", "description": "This place was one of our go-to spots when I used to go to the high school across the street. We'd order by phone and  we'd head out and pick it up right when lunch started. Excellent customer service. The guys there are super friendly and efficient. We used to order the Boilermaker not just because it was our school's mascot but because it was so good! It really made you full with just half of it. The selection on drinks is pretty great too. There's not much seating space, just a small bar-like area towards the side that's a little too high for a 5'3\" person and a couple of tables outside by the door. Better take it to go.", "author": "Precious Athena P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-02", "description": "Super tasty.\n\nHUGE sandwiches though, I usually just have one half for lunch and save the other half for the next day.\n\nCan be kind of frustrating when their ATM machine is out because they only take cash, but there is a laundromat right across the street with one so it's all good.\n\nI either get a Tom-Tom (turkey and bacon) with pepperjack or a Gaucho (shredded chicken in Frank's Buffalo Sauce and ranch) on dutch crunch. Both really delish. Everything comes with a really good pesto sauce, plenty of pickles, tomatoes, lettuce, and pepperocinis. I always get no onions cause it's already a potent mix for bad breath, but that's just me.\n\nThey recently added a bunch of new stuff and upped the price (usually around $8), so it's not for every single day meals, but it is nice to treat yourself to a good sammich once in a while!", "author": "Emily R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-14", "description": "If you are a gluten free person beware... they use the same utensils etc for your sandwich.  I got really sick, thought the sandwich tasted great.  So if you need GF, you will have to ask them to make it on a clean surface with a clean knife.  Just so you know...", "author": "Target T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-06", "description": "I grew up frequenting the Mr. Pickles in San Mateo.  So I was elated to find that I lived less than a block away from this Mr. Pickles when I moved to the Mission.\n\nI haven't been to a Mr. Pickles in years, but when I stopped in on Sunday for a Reggie (chicken, cheese, & avocado on dutch crunch) I remembered what is a solid sandwich shop this place was.  Unfortunately, being a bit older and wiser, I think Ike's Place is better.\n\nAlso, I love a good sandwich, but throwing down 1000+ calories for lunch means that I either need to skip breakfast or buy bigger pants just to enjoy mass quantities of bread, meat, & cheese. I don't think I'll be stopping here too often.", "author": "Lara O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-10", "description": "I swear, it's hard to find a quality sandwich these days.  Grab any sandwich on a roll of your choice of bread cooked fresh that day by a bunch of hipsters who know sandwiches.  It's pretty much right off the freeway, but I hit this place up because its close to some work BS which makes it all worth it!  I think a french dude owns it and you know they are all upity about their bread... for good reason.", "author": "Adam H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-11", "description": "Gigantic sandwiches at a reasonable price. The shop was busy and a little slow the only time I've been there. I enjoyed the chicken salad on Dutch crunch, which was big, delicious and a little sloppy. Shouldn't have eaten the whole thing, but couldn't help myself. You can order online and pick up your food, which seems smart, although I've never done it. Looking forward to trying some of the specialty sandwiches.", "author": "Lewis W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-22", "description": "I was at a jobsite near this shop recently and one of my coworkers took me here for our lunch break.  I got the a salami sandwich and was totally turned off by the fact that they have some flavor infused salami that basically tastes like your taking an overpowering bite of dill with every bite.\n\nMy coworker raved about his meatball sandwich though so I decided I'd give it another shot.  \n\nI came in a little before 2pm and the place was empty, I still had to wait 10 minutes for my meatball sandwich, which I was ok with because it's toasted and all.  But then I got home and they had given me a BLT with avocado by mistake.  \n\nBad enough to have your hopes set on one thing only to get another, but the bacon and avocado are unusually bland, it's like I'm eating lettuce and tomato with bread...\n\nThe kicker, my meal was over $10.\n\nOverall very disappointing on two separate occasions, I won't be going back.", "author": "Mark N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-18", "description": "Thee best sandwich I have EVER had. This place has been opened for years now, and though I have been curious to try a 'wich, I finally had my Mr. Pickles experience. \n\nTheir menu is quite extensive; it's not an average 'meat, pickles, and condiments' type of shop. I got the sandwich that with chicken, honey mustard, extra pickles, in a dutch crunch roll (called Station 7). Being Sunday, I assumed I was going to get stale bread. Boy was I wrong! The roll was soft, crunchy, and perfectly toasted. My teeth sunk into it and my biteful of sandwich melted into my mouth. Oh goodness.... \n\nThe gentleman who took my order was an extremely friendly and patient. (Since I was overwhelmed with their menu). I thought he was get annoyed and roll his eyes at me, but he didn't. :) When I was done with my meal (since half definitely filled me up) I requested a container; instead of giving it to me, he wrapped it up. It was a simple, nice gesture to say the least. \n\nAnd the sauce! At first I thought it was pesto and after I returned to another Mr. Pickles in the East Bay a few days later (yes, their sandwiches are THIS good!) I was informed that it's a mixture of garlic butter and Italian dressing. \n\nAs a dessert, you get lollipops. How awesome?! \n\nThe only drawback of this place is that seating is limited. Oh well, I got over it after indulged in my sandwich. \n\nI will most definitely visit other Mr. Pickles shops in my area. 0", "author": "Johan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-07", "description": "Not as good as the radio commercial makes it sound.  take that pickle and put it where the sun don't shine, lol.  \n\nOk, don't do that...well it is SF, so go ahead.  But anyways, the sandwich I had there was ok.  Not as big as i wanted, not as spectacular I hoped and not as cheap as i hoped.  Bleh.  I might go back someday, But I won't go out of my way for it.  There was nothing wrong with my food, just nothing to write home about.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-05", "description": "Sandwiches here are huge and come with their signature green pesto.  I ordered the green sammy with chicken, pesto and provolone.  A bunch of co-workers and I ordered online and really enjoyed being able to customize our sandwiches. \n\nI couldn't finish my sandwich and didn't mind having it as dinner a few hours later.\n\nThey also gave us blowpops with our order (reminded me of Ike's).  I like that this is close to my office and creates sandwiches that are the size of what Ike's Sammy's used to be before they got super popular.\n\nGreat pricing for the amount of food you receive, too.  So important when going out for work lunches during the week.  Oh, and you GOTTA get your sandwich on their dutch crunch - it's amazing!\n\nWill def come back to try their other delicious sandwiches again!", "author": "Carmel U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "Mr. Pickles is my last hope against starvation when I have nothing in my fridge.  He's really a humanitarian in that way.  Love the Tom-Tom.  These are heavy sandwiches, I usually split one with my sister and we still have left overs.", "author": "Tasha D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-22", "description": "I went with a friend around 6pm for sandwiches on dutch crunch bread...and they only had ONE dutch crunch bread left!! :( I gess its a good sign, that business is good for them?? but bad bc we had to share :(\n\nanyway, earlier that week i had been to podesto's for dutch crunch bread sandwiches, and after trying this place, i gotta say i like podesto's sandwiches alot better. i felt that it was more crisp, fresher tasting, and just overall yummier. \n\nthat being said, its not that mr pickles was bad...just a normal sandwich. :) but i have been there only once and the lack of dutch crunch was a blow, so maybe i will change my mind the next time i go!", "author": "Eileen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-06", "description": "Mr. Pickles is a saint.\n\nAt least when I'm hungover and would like something that isn't a burrito to help my cleanse.\n\nGreat sandwiches at a pretty reasonable price.  Check out the entire menu to see some quite unique options.  My go to is the Slickster with extra turkey.  The service is also great.  Friendliness abounds at the register not to mention the big dude who makes sandwiches who is always an entertaining person with which to speak.\n\nIf, like me, you're looking for something relatively quick that isn't a burrito, Mr. Pickles is great.  I curse my roommate for introducing this place to me because I'll probably be here way more than I want.", "author": "Steven R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-09", "description": "I've been obsessed with Mr. Pickle recently.  I went three times in one week, twice consecutively. What makes that possible, you ask? The variety and the service.\n\nThe bread and the pesto are what really set this place apart. I also love that you can order online and specify a time for your sandwich to be ready.", "author": "Tyler M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-22", "description": "Located quite conveniently on the corner of 20th and S. Van Ness, Mr Pickle's is an excellent small sandwich shop with a huge, creative menu. Besides making your own sandwich out of all the normal ingredients, the 31+ specialty sandwiches are innovative and robust. Along with fresh, (usually) flavorful meats and veggies, their sauces are savory and plentiful.\n\nSome Favorites-\n\n#13: Cesar Chavez - Seems to be everyone's favorite. Chicken breast, bacon, avocado and jack cheese on sourdough roll. Chicken is always tender, bacon is usually slightly chewy but sometimes nice and crispy, avocado is abundant, and the sourdough rolls are fresh and immense.\n\n#3: Tony Soprano - Great italian combination here. Salami, ham, mortadella, provolone cheese and italian dressing. Excellent on either the sourdough or dutch crunch.\n\n#19: Station 7 - Chicken breast marinated in honey mustard (Yes!) with pepper jack cheese and avocado on dutch crunch. Not sure how anyone can dislike this combination.\n\n#10: The Bear - For when I want to get messy. Hot roast beef with bbq sauce and melted cheddar cheese. Healthy serving of roast beef, that doesn't get overcooked in the process of heating. Tangy and sweet bbq sauce, with no spice at all (A spicy bbq sauce would be awesome here) but nonetheless a nice compliment to the roast beef and cheddar.\n\nBesides those big four, there's plenty of other delicious choices, as well as unlimited possibilities for your own custom supersandwich.\n\nNot the most attractive decor or layout but it works, as it simply wouldn't feel right if it were much classier. Service is usually great, but sometimes it can be on the slow side. They only accept cash, and more often than not the ATM is out of order, so you need to go across the street to the laundromat. Prices are very fair, and seating is scarce, be prepared to eat standing up or get it to-go. Recently they have opened another location in the Marina district, which I have yet to try but I'm sure its just as fantastic!", "author": "Chris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-24", "description": "This is a great little sandwich shop reminiscent of places you'll see in East Coast urban centers, just with not so much humidity and no Puerto Ricans (Mexicans instead). There's scanty a seat to be found (3, I believe), an ATM (place is cash only), a blaring loud TV, an ice cream chest, a soda fridge, and a counter. That's it. You order from the chalk board and you wait. You get sandwich and you will probably have to leave or stand there and eat it.\n\nThe staff is nice, but there is no decor to speak of. You can't ding a place like this for that, since its not a sit down, serve you water and sip wine type of place. It's pretty get-in, get-out. Prices are reasonable, too.", "author": "Wes T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-10", "description": "On our way to Baker Beach, we stopped and grabbed some sandwiches to go. I had the buffalo chicken sandwich. Spicy and creamy, great flavors, but the crunch Italian roll made it a mess to eat. My friend had the veggie, and it was piled high with every vegetable imaginable.", "author": "Christy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-03", "description": "I love this place. Sandwiches are very good and priced appropriately. My favorite sandwiches here are Cesar Chavez, Station 7, Guacho, and Golden Gate. Every sandwich is made with fresh ingredients. Order your sandwich over the phone and pick it up 10-15 min later for faster service. I don't mind the cash only policy, you just need to plan accordingly. I'll continue coming here weekly.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-17", "description": "I was working a job in the city and we phoned in an order for 9 sandwiches...a daunting task for the person ordering and the person receiving the order.\n\nOrder was to be ready in 30 minutes...I guess that's not too bad seeing that we asked for 9 sandwiches to be picked up around lunch time.\n\nI got the \"Dog House\" which was pastrami, bacon, and cheese. I actually asked for no pickles and mayo, and it did end up with pickles. Oh well. Note: the sandwiches are BIG. They use a decent sized roll (if you have a roll), and pack it full of ingredients.\n\nExperience: 3 (It's fine...)\nThe phone ordering was relatively painless, save for a few times I was put on hold. They were probably pretty busy...but i never felt rushed. \n\nValue: 5 (You get what you pay for and more...)\nSandwiches range from ~$6-$8 on average...but you may need to save the other half for another meal. I...uh...ate the whole thing.\n\nFood: 4 (It was good....)\nYes, there were pickles in my no pickles requested sandwich, but it actually didn't bother me that much. The ingredients were fresh and delicious. And, did I mention...the sandwiches were BIG? I was thoroughly satisfied.\n\nOverall: 4\nGood, solid, not-too-fancy, quite large, sandwich, at a not so bad price. It's a place worth repeat visits.", "author": "Ellis A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-16", "description": "Finally checked this joint out this afternoon.  The Vigilante Pickle sign on the street corner has always intrigued me, and frankly I am a somewhat of a sandwich whore.  \nHere's the deal:  There is only one vegetarian option.  What the what?!?!\nGood news is that there are few things that top a dutch crunch roll toasted with melted provolone, avocado and all those other vegetables I love.  I really like that they put cucumbers on the sammie, and the sprouts are a nice addition.  \nThe employees were super friendly and speedy, and the price was great.", "author": "Lacy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-05", "description": "This place is way better than Ike's. The sandwiches are great and the line is reasonable (very much unlike Ike's). I keep ordering different sandwiches to find a favorite but each one I have is better than the last. The last time I was in there I had the chicken one with the buffalo wing sause - holy crap that was good (the meat was a little tough, though, but I would get it again). \n\nBonus: It's fun to watch the counter-boy while you're waiting for your sandwich - he's the cutest thing ever. And a flirt. But with everyone so who knows what's going on there.\n\nUpdate: The cute counter boy has not been here my last couple trips. I think he's gone. The food is still good but the missing eye-candy makes me sad.  :-(", "author": "Tim W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "I never understood why my coworker would pay $8 for a sandwich until he made me tried it during lunch. I was hooked. I got the Station 7 sandwich with the chicken and avo on dutch crunch. It was unbelievable tasty and huge. I usually eat half a sandwich for lunch, but it was so good I just gulp the whole thing down! I love their online orders... no wait!", "author": "Cece Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-03", "description": "This place has to be one of the best Sandwich shops in the world. Make sure you get the Dutch Crunch!!!!", "author": "Chris J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-19", "description": "We stopped by Mr. Pickles crazed and hungry with a dog in tow. We tied him to the post out front and went in to order. The nice guys behind the counter gave us a doggie treat for our little one. I ordered the meatball and the Mr ordered the pastrami; we both got Dutch Crunch bread. The bread was fantastic, easily rivaling Roxie's. My meatball was really tasty but the pastrami apparently \"didn't hit the spot\". I think Mr Pickles is easily on par, if not better, than Roxie's.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-13", "description": "Pretty solid subs. Though probably a bit to mayonnaise-y. You'll always make a mess when you eat one so be prepared.\n\nI wouldn't really bother ordering ahead again. Every time I do I always forget what I want and sometimes they don't get it right. Some kind of communication error happening there. Just wait it out at the place. It's not a bad spot to hang out and catch some mission culture.", "author": "Roderic C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-21", "description": "Ate at the San Jose one right when I moved to the bay area and had no idea it was a cult classic sandwich shop.  Then I discovered one in the Mission I have now made it a staple in my regular dining.  I LOVE that they have tons of vegetarian options... the tuna melt is bomb, the veggie meatball is bomb, and they give you a sucker for dessert which is perfect for my 5 block walk home.  The bread is awesome and the guy that is always working there is very friendly.  Not much space to sit and eat in the shop at the mission location though, so you are probably better off to get it to go.  Thanks Mr. Pickles!", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-28", "description": "This place is right by my work, so i thought that I woudl give it a try.  I'm a little picky when it comes to meat and this turkey was not good.  I didn't even finish it.\n\n-but people in my office still go here all the time, go figure.", "author": "Laura P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-15", "description": "All I have to say is, Mr. Pickles = sandwich WIN.\n\n(But since I'm trying to write a helpful review, I'll say more.)\n\nFrom the large portions to the array of toppings, this sandwich will satisfy your taste buds and your appetite.  \n\nAll sandwiches come topped with mayo, mustard, lettuce, tomato, onions, pickles, and best of all--pepperocini and pesto.  What kind of sandwich place has sandwiches that AUTOMATICALLY come with pepperocini and pesto at no additional cost??  I'll give you a hint--an awesome one.  (You can also ask for toppings to be excluded as well, and they're good at honoring that request.)\n\nThe portions are HUGE, too.  I can usually pack away a lot of food for someone my size, but these beasts are usually good to last for 2 meals--or at least a meal and a snack.  If you do manage to finish a whole one in one sitting (as I may or may not have challenged a friend to do), do not be surprised if you find yourself passed out in a food coma afterward.  (If you're lucky enough to work around here and eat a whole one for lunch, don't say I didn't warn you that your afternoon productivity will massively decrease...)\n\nThey also have about 20 specialty sandwiches to choose from.  My favorite is the Mercy Me--warm chicken breast with marinara and provolone.  Amaaaazing.  I usually get it sans mayo, but the pepperocini gives it just the right kick.\n\nI've tried the Gaucho too -- chicken breast marinated in Frank's BBQ sauce and ranch.  If you like hot wings or ranch, this is your go-to sando.\n\nJust make sure you have dolla bills, yo, because it's cash only.\n\n**Sidenote: I drove by this weekend, and I'm happy to report that the Mr. Pickles sign is back!  It was missing for a while.  (And thank goodness it's back, before I'd have to go and kick some @$$ for stealing from this awesome place.)", "author": "Alice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-15", "description": "Best sandwiches around and a great value for your money.  You will feel pretty darn full after tackling down one of these tasty beasts.  Mama and the staff here are wonderful and calling your phone order ahead of time allows them time to toast it perfectly while you find a place to park.  Then you just pay, leave a tip, grab your free sucker, and prepare for bliss.......\n\nMust try:  the Ray Ray (salami & cheddar on dutch crunch)\n\nYou should really get ALL the fixings with most every sandwich(maybe a meatball plain?) but the pesto sauced veggies are a delicious addition to the tuna, veggie, meaty, you name it!", "author": "Smiley D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-17", "description": "This place is way better than ike's with about 1/100th of the grief - take that, hipsters (and also stay away). even aside from the fact that it's absurd to wait an hour for a sandwich, every ike's sandwich i've had develops the wet bread problem by the time you get it where you're going - even if that's only 15 mins away. we got mr pickles yesterday. it was HUGE. we then drove 1.5 hours, hiked 2 hours and opened the sandwich. no wet bread, lots of meat, pesto-ey deliciousness. i heart you, mr pickles.", "author": "Erica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-27", "description": "Mr. Pickle's makes the best sandwiches in the city, hands down.\nWhy?\nWellllllll . . .\n\nFor starters, their veggie is to DIE for. I remember coming in, my first time, looking at the menu, and thinking to myself, \"Man, they don't have very many special sandwiches for vegetarians. In fact, they only have one.\" But then, I ordered it, and . . . I only have eyyyyyessss . . . for youuuuuuuu . . . \n\nSeriously. Just ask them to add some avocado and you'll never want another sandwich ever again for the rest of your life.\n\nAlso, these sandwiches are so dang huge that it's like getting an instant twofer. No kidding. Add a bag of chips, and you've got two days' lunch, right there.\n\nFinally, their staff . . . they're so nice. A while back my husband and I came in without cash (our bad!) and their ATM machine was out of service. The lady behind the counter told us there was a machine across the street we could use, and started making our order for us anyway. Other places would give you sass for goofing up like that, but not Mr. Pickle's. Quality of service can either make or break a business, so it's always nice to find a spot where you want to give the staff a great big gold star for all-around awesomeness.\n\nNow go get that sandwich!", "author": "Erin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-09", "description": "I love their sandwiches. I especially like  their BBQ Hotlink sandwich. Their sandwich is different than from other hot link sandwiches. Their sandwich contains a nice sweet BBQ sauce. Moreover, instead of plain mayo and musturd, they use a flavorful pesto sauce. Furthermore, their sandwich is big and filling. It is toasted and reasonably priced. I usually order the hotlink with the Dutch crunch bread. I ordered this sandwich several times.", "author": "Hiroshi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-02", "description": "Every time I'm in the area I have to have a sandwich from Mr. Pickles! I love getting my sandwich on the dutch crunch roll. I always forget the name of the one I like...I think it's the bear...the one with roast beef and barbecue sauce, Mmmmmm. I'm getting hungry just thinking about it right now haha. But don't get me wrong, all the sandwiches are delicious!\n\nParking the area is meh...but you can watch BART over and take a nice stroll over and enjoy the weather when it's nice out.\n\nThey only accept cash here, but there is an ATM machine =P\n\nIf you come at lunch time you can expect to wait a little bit because they don't have a huge staff, but it's not a crazy wait. Hop on a stool and prepare yourself for one of the best sandwiches you will ever have.", "author": "Albert K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-17", "description": "Yum yum yum!  quick and simple everything is great here. thanks guys!", "author": "Jourdain D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-23", "description": "I can't express how much I loved my sandwich here. I got the sharkbite which was chicken with frank's red hot, blue cheese dressing, pepper jack cheese and ALL the fixins... it was AWESOME. The sandwiches are huge but it won't stop you from taking it down. \n\nMy boyfriend ordered one with bacon, avocado, chicken and some cheese and all the fixins and it, too, was outstanding. This place goes in our top five sandwich shops for sure... The staff is super friendly and my man loves the dutch crunch bread, so I'm a fan!", "author": "Danielle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-04", "description": "Mr Pickles has been stolen!  No wait, he's back!  The thief felt bad and left him over by Shotwell's in the middle of the night...wearing a new bandana, or something.  Is this typical Mission Mayhem, or the most clever publicity campaign since \"Hang in There JacK\"?  Either way, one thing's for sure: the lady running Mr Pickles has got quite the dialog going with the neighborhood.\n\nBut hijinks aside, Mr Pickles' sandwiches can definitely play with the big boys (Ike's keeps coming to mind).  Actually, Ike's is still number one because of their more creative selection, but I dare you to find fault with MP's Station 7: chicken with spicy honey-mustard, avocado, and of course pesto, all on the sweetest of dutch crunch.  Yes, it's sandwich heaven.  \n\nPS, since he's decked out like Pancho Villa, maybe they should call him Senor Pickles instead?", "author": "Wes M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-15", "description": "Not only are these sandwiches ginormous, they are delectable: fresh and packed and just the right amount of crunchy and spicy. \n\nIf you are still trying to decide whether or not to eat at Mr Pickles, look at the photos. Specifically, the photos of Senor Pickle. Right now, go. Ok, if you are not convinced by this point you might as well check yourself into a morgue since obviously you don't have a pulse.\n\nIt's also possible you are blind and reading this review with a screen-reader, so I will try to describe him to you: Senor Pickle is a pickle, and he wears a giant sombrero, and 2 ammo belts crossing his chest, containing peppers. In his left hand, he is wielding a sandwich, which he may have recently liberated or perhaps created himself. His right hand is poised to draw the jars of mayo or mustard from his belt, and he is wearing cowboy boots. He is wearing a mustache, and an expression of daring delight.", "author": "Alan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-09", "description": "always a yummy treat. thank you guys for the freshest, fast, delish sandwich in the mish\n\nall the guys working there are sweet, and they make on killer viggie delight.", "author": "Bonnie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-30", "description": "I tend to come here whenever I'm hanging out with my ex, since he's close by and is allergic to everything.  The sandwiches are big, relatively cheap, and tasty, so what else do you need?  I'm a banh mi kind of guy, but these will do in a pinch.\n\nMy only complaint is that eating these sandwiches tends to be a sloppy experience.  It's kind of like eating a delicious trainwreck.", "author": "Jimmy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-28", "description": "So the big wooden pickle out front has been stolen. It's made the news, I'm sure everyone knows about it by now... but we're starting to get worried that it's not coming back.\n\nDiyana would like whomever took it to know that there's no hard feelings. If you return the Pickle dude you will not be harmed, in fact, she'll even give a free sandwich to anyone who brings it back - no questions asked. \n\nWe all miss the Pickle. Please, do the right thing man.", "author": "Tyler M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-14", "description": "There are some who say that size doesn't matter. When it comes to sandwiches, I am not one of those people. And there are few things I hate more than a bad sandwich. A bad sandwich is worse than no sandwich at all. A good sandwich, on the other hand, is a beautiful thing.\n\nMr. Pickles has sandwiches that are both large and delicious. (No dirty minded innuendos here, please.) And the prices are really affordable! (I rocked a veggie sub today for $5.) Sandwiches come with a really yummy pesto sauce, and the bread is nice and fresh. \n\nThe ambiance isn't anything to write home about. I recommend getting your sandwich to go. Especially if you are trying to eke as much sunshine as possible out of your measly lunch hour.", "author": "Angie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-24", "description": "If you think I didn't go here two days in a row for lunch this week then you are sorely mistaken.  On Tuesday I had the Tony Soprano (typical but awesome deli sandwich) and on Wednesday I had the Cesar Chavez (chicken, avocado).  Apparently these are their two most popular sandwiches, and for good reason.  Both came with peppers and pesto and were huge and delicious.\n\nMy only complaint is that this is definitely a takeout place because:\n\n1)  Who Wants to be a Millionaire was blasting on the TV.  If you like to read during lunch, like me, Meredith Vieira will do her damndest to foil your plan.\n\n2)  If you try to eat in, your only option is a very high counter with very short stools.  For about two minutes I enjoyed the \"this is what it feels like to eat lunch when you are a little person\" effect, then I just abandoned the stool and ate standing up.\n\nI will be back!", "author": "Nathan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-08", "description": "Cheap, huge, and delicious!  What more could you want in a sandwhich?\n\nParking is never hard, and the lines are short.\n\nI always opt for this over Ike's Place.", "author": "Peter G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "One of my favorite sandwich places in SF! I think my go to is the Station 7. It's not super trendy like Ike's (which is also amazing) and I usually get it to go. I love their dutch crunch and there's enough sandwich that half will be enough.", "author": "Nik K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-09", "description": "restaurant 4 of 50\n\ngot the buffalo chicken sandwich.  it was hella good.  nice and warm and toasty.  monster sized as well... just a  half was plenty!  the service was super nice too... the woman insisted on wrapping the half sandwich i had left over so i could take it home.  the renegade cowboy pickle out front is hella cool too... my friend erica took a photo of it but she is too scared to post on yelp, so i had to post it for her.", "author": "vlad k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-23", "description": "My old review is below, but I have to admit Mr. Pickles has improved a great deal.  It is now staffed by one woman, and one guy (same ones every day), and things are going much more smoothly. The sandwiches are not gourmet, but you get what you expect to get, no more and no less, and they don't make mistakes like they did before. For me it is still a meal of convenience and I always feel a pang when I spend money on not great food. If I could be whisked anywhere in the city to eat I would never eat here. \n\nOld review: I love sandwiches. Unfortunately, Mr. Pickles is the closest sandwich shop to my work so I eat here from time to time. The quality of their meat seems to have improved since they first opened, but their bread is just stuff you'd buy off the shelf from Safeway. The kind that never molds or gets hard. In a city full of amazing bread this is a crime. \n\nThese sandwiches are NOT made with love. I don't order the posted specials, so whatever I order, they get wrong every time.  Literally every time. I started to pre-write my order on paper so I could just hand it to them and cut down on one possible point of failure, and they still get it wrong.  Its almost comical.  I wonder, what will be missing from my sandwich today, the avocado, or the cheese?  Will I get mayo instead of mustard? The sandwich makers act like they are being forced to work their against their will, grumpy and slouching. \n\nIf I have only 10 minutes to run grab something, I do go there, but it is depressing every time.", "author": "M M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-05", "description": "great sando selections here! crazy ones too. I think they have the menu on-line somewhere, definitely worth checking out. Its next door to The total You where you can get a fine treatment (wax, facial) and a fatty sando!\n\nEasy parking too!", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-15", "description": "Look, I get that you're busy. You work fast and you make good sandwiches. You guys even have friendly attitudes.  But honestly, you need to work your online orders into your counter orders.  I ordered at 12:32pm, walked in at 12:55pm, and my sandwich had not even been made yet, and it's exactly three ingredients - bread, meat, cheese.   I live a block away, I visit often, and I want to save time by ordering online.  I don't want to order online, and then arrive for you to notice that, \"oh, let's make your sandwich now\".  You get paid for you time working. I get paid exactly nothing for my waiting.", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-24", "description": "From the Pillsbury Doughboy, to Kool-Aid Man, to Noid the Zoid, for decades now our very way of life has rested upon the food mascots who have informed us not only which foods were nutritious, but which foods all the cool kids were eating.  But perhaps no food mascot is sweeter than Mr. Pickle.  Dude's packing condiments by the gallon, and his sombrero can't be beat.  Just look at him!\n\nIt should come as no surprise that an anthropomorphic pickle with such an amazing sense of style should also be a master in the kitchen.  Mr. Pickle tears it up in the culinary department, serving up sandwiches by the pound that are delicious like woah.  \n\nAlso, sometimes you can watch trashy MTV dating shows here, if that's what the sandwich makers have a hankering for watching.  But regardless of what's on the TV, you can rest assured that you will be dining upon a sandwich that truly rises above the rest.  \n\nPerhaps best of all, for all you single ladies out there, it doesn't look like Mr. Pickle has a ring on that finger... so act quickly!  I can't imagine he'll be on the market for long.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-21", "description": "As an SF native and local, I have been to my share of sando joints and am rarely impressed. Mr. Pickles provides big 'ol portions and the prices aren't that bad (under $7 for a big sandwich in SF is a pretty good value). The ingredients taste fresh and their veggie sandwich is one of the only truly filling veggie sandwiches in the city. I have no qualms about placing Mr. Pickles in the top 5 sandwich shops in SF.\n\nOne minor con: it can get pretty busy - especially on weekends - so just keep that in mind when you are looking to stuff your fat face.", "author": "Victor W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-21", "description": "Fat fat fat.\nCheap.\nTasty.\nPretty fast.\n\nDon't like the deco at all (pretty depressing) but it's obviously a place for taking away.\n\nWould totally recommand if you don't mind gaining a few hundred calories for lunch.", "author": "Mathilde B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-09", "description": "The Cesar Chavez is no doubt, one of the best sandwiches I've ever had in my life.", "author": "Sara G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-31", "description": "I cant go longer than a week without my Gaucho (Sandwich). This place is friendly, affordable, and, again, Im hooked on the Gaucho.", "author": "Philipp T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-25", "description": "These things are huge!\n\nDon't be overwhelmed with the wall menu. Gotta love dutch crunch rolls filled with meat and cheese! Small little place but we've taken our sandwiches to nearby house stoops. \n\nTake a picture with Mr Pickle (now that he has been returned after his kidnapping).", "author": "Anna R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-30", "description": "That pickle cowboy standing in front of your shop looks like he wishes he had been born a jalapeo. Thank you for supporting his fantasy.\n\nYour sandwiches are awesome, loaded with great fixings, and most importantly great quality kosher dills. You just can't beat a good pickle. I mean, unless you hate pickles. So for that, you rule. Crazy combinations are always a plus at a sandwich shop too. Big portions and quality meats add up to a great spot!", "author": "Ben R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-24", "description": "Tonight's conversation went something like this.\n\nME:  When are you coming home?  I'm starving.  What should I cook?\nGUY:  I am still working.\nME:  Ok, well I can't wait for you.  I don't feel like making something for myself.  Wait, what is this in the fridge?\nGUY:  The other half of my Mr. Pickles sandwich.\nME;  Ok, whatever, I'll eat that.\n\nI was so hungry tonight and in a moment of hunger weakness I devoured half a sandwich from Mr.  Pickles.  Huge amount of Italian deli meats on a dutch crunch roll (which I swear tasted deep fried, WHAT!).  Healthy?  Not by a long shot.  But really delicious.\n\nIf you eat the entire thing, you are a pig.  For sure.", "author": "Poker B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-23", "description": "This sucker is HUGE. I like the Soprano, it's a solid sandwich. Throw in the extra buck and get a pickle, in fact it's often all I get. Note: Pickles are delivered on Tuesday and the pickle taste reflects the day of the week you get it on. Not much, but Tuesday or Wednesday is def. the day to go.\n\nNot Super Impressed with the sandwich, but honestly, best sandwich shop in the mission that I've found yet.... Maybe in the city.", "author": "Tyler W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-11", "description": "No Pickles at Mr. Pickles, how could that be?  I fully expected a nice dill pickle spear with my turkey, bacon with Swiss cheese sandwich. But no pickles at Mr. Pickles. For that off comes a star. This shop has no atmosphere; and for some reason the lady at the counter watches some strange program on the Discovery Channel about how toothpicks and other random items are made; but they are friendly and relatively efficient. But still I like to call ahead and get my sandwich to go. \n\nThis shop represents something that our City needs more of, sandwiches, we have a real shortage of good solid sandwich shops in this town.", "author": "Seamus M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-18", "description": "Tried it out for the first time on a rainy-day excursion. Took a little while for being the only order in there, but the wait yielded a beast of a sandwich. I will be coming back.", "author": "Nate R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-16", "description": "This place has a decent hot pastrami, but not worth a long trip to eat here. The use of pesto as a condiment help give their sandwiches a unique taste, but at times I was lamenting the huge portion. Also, I don't believe they think that there is ever too much mayo.\n\nThe price is decent, the food is good, the TV is TOO LOUD, and the decor is out of a hospital waiting room. I continue to eat here since its nearby with a rocking bandito pickle as a sign.", "author": "Geoffrey P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-30", "description": "One of the best sandwich spots in the city.  The best in the Mission that I have found (aside from Tortas in some taquerias, I don't count those).\n\nThe breads are top notch. The meats are good too.  They have some crazy sandwich combos. They have some 'pesto spread' that goes on the sandwich.  They will toast any sandwich.\n\nThere is nothing not to love... wait... yea. there. is.\n\nI hate pickles.  I use to see a chick that loved them... in fact.... they all loved pickles. I will not make out with you with in 20 minutes of you eating a pickle.  I really don't care how pretty you are.... I mean... hot... I only make out with hot chicks.\n\nSorry Mr. Pickles, you lose a star for that gigantic pickle outside that just looks to me like: FAILURE.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "I used to frequent a Mr. Pickle in Sacramento when I lived there, so I was ecstatic when I discovered there was one mere blocks from where my boyfriend lives.  Their sandwiches are so yummy.  I can't eat an entire one in one sitting they're so stuffed with goodness.  I always get a simple turkey because they include so many other ingredients it doesn't seem all that simple in the long run.  They have many original sandwiches as well though with different combinations of ingredients.  The pesto spread that comes standard is the highlight of every sandwich.  That, and the pickles, of course.  Who could resist their adorable mascot?\n\nMy only complaint about this location is that they have a grand total of three places to sit.  You pretty much have to take your sandwich to go or hope no one else is enjoying theirs there.  Also, sometimes they have their television at an annoying volume.", "author": "Laura W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-23", "description": "I have no problem making a trip all the way across the city just to get a sandwich from this place - they're amazing.\n\nFor under $10 you get to choose from a huge menu full of delicious options which are totally unique to Mr.Pickle's restaurants.  I'm normally a traditional (boring) Turkey sandwich kind of guy, but I swear they must put crack on their sandwiches because I have yet to try one that I don't like. \n\nAnother thing that's awesome about this place: I *hate* pickles, and they don't ever give me shit for asking the employees to make my sandwich without them! The first time I asked, I pictured someone saying in a loud voice (maybe with a new york accent) \"NO PICKLES ON YOUR MR. PICKLES SANDWICH??!!!.\" \n\nDelicious, cheap, and filling sandwiches. Thank you Mr. Pickles.", "author": "Isaac W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-01", "description": "yummy yummy yummy. 5 of us went and we all got the veggie. It was so good. I ate half for dinner and then the other half after coming home from dancing all night. It was a great late night snack. The pesto is great.\n\nThere aren't any tables or chairs to sit and eat in, so it seems it may just be a \"to go\" place.", "author": "Ashley E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-19", "description": "vegetarian BLT.\n\nholy crap it is amazing.\n\nthere are no words.\n\n\nalso, online delivery.", "author": "Lily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-27", "description": "Absolutely go to Mr. Pickle's for an awesome lunch!  Their sandwiches are amazing, all melted and delicious and huge and perfect in every way.\nBut you should also go to Mr. Pickle's for a real SF neighborhood experience.  Diyana, aka \"Mama Pickle\" will watch out for your car if the DPT is near, and will hold packages for the people in the apartment building, and keep the street clean and safe out front, all the while telling you a joke and taking care of business. She's awesome!  Stop by and say hi!  Her son Elias is behind the counter, taking charge of making your lunch experience the absolute bomb, every time.  \nI love Mr. Pickle's!!", "author": "Aidan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-09", "description": "Things I love about Mr. Pickles: \nBest Meatball Sandwich I've had in the City, in fact one of the best ever, aside from Paradiso's in San Jose. \nBest Random Signage: A Cowboy Pickle?!\nFriendly phone service\n\nThings I don't love: it takes forever if you don't call ahead - but, don't be a jerk - just call ahead and it's all good.", "author": "Carla G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-20", "description": "My favorite sandwich shop in the Mission. Have been going here ever since I moved to the neighborhood. My personal favorite is a turkey and salami on dutch crunch with swiss everything hot! I love the pesto sauce so much. \n\nowner is also very nice. she always flows me a buck instead of making change. I highly recommend Mr. Pickle", "author": "Alejandro M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-19", "description": "Well the Pickles in the jar on the counter Rocked my world....but the sandwich did not. Bread to meat ratio bad, shredded lettuce bad, lady behind counter adorable. I'll be back for the pickle.", "author": "Hidegrl A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-27", "description": "Good things take time - and the good sandwich from Mr. Pickles take time.  The hot stays hot, the cold stays cold, and the bread gets toasted (twice!).  The topping is plentiful (the pickles are quite good) - and pesto is a nice touch.\n\nIt's a gigantic sandwich, as mentioned in the other reviews.  But I have had a female friend who's put down 1.5 sandwiches in one sitting.\n\nNext time you go, pick up a handy paper menu.  For future visits, call your order in, have your change ready, and you are in/out in no time.  For those of you looking for a quick fix, be warned that the sandwich making could be very slow - but then again, good things take time.", "author": "Hanson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-18", "description": "Peanut sauce on my sandwich?  Sprouts and teriyaki sauce too?  The \"Hipster\" sandwich (despite the god-awful name) is by far one of the best sandwiches I've ever had.  It was a beautiful experience.", "author": "Rachelle P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-09", "description": "My favorite sandwich place thus far.  Their Pesto sauce...mmm", "author": "Lia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-22", "description": "If your starving and/or potentially up for a food coma, their sandwiches are pretty amazing.  old school sub sandwiches.  \nThe place pretty small, literally 2 seats, so plan on eating it somewhere else.\nI left the house with only 5 bucks in my pocket and was able to get the cheese/vege sandwich, and it lasted me lunch-dinner.", "author": "Ashley P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-19", "description": "1 hour wait for a sandwich - oh hell no!\n\nWent there today for a 'quick' bite. There were a few people in line - and then those who had ordered online which made things take much longer. But what really got to me was how people who were in line after me me got their sandwiches before - a lot before almost 15 minutes. When I brought this up to the worker he gave some lame excuse about meat cooking (uh its deli meat dude - its already cooked).\n\nTo top it off - they left off the avocado! The best part of a turkey avocado sandwich.\n\nWill not be going back!", "author": "Sara M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-04", "description": "I'm not a fan of Mr Pickles, and its probably because their brand of sandwiches just does not suit me at all. I've been to a lot of sandwich shops in the city and we felt like this just isn't the place for us. When we went, we had roast beef sandwiches on sour dough, same sandwich i get every where else, quality isn't there and a little pricey for a sandwich.", "author": "Rio A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-13", "description": "I can't believe I haven't Yelped Pickles yet. Yeah, that's right, we call it Pickles around the office... the \"Mister\" requires too much effort.\n\nAnyhoo, they used to have Tootsie Roll pops free with your sandwich. Now they have cheap-ass round pediatrician's-office knockoff lollipops. It's revolutionized my Pickles experience, and not in the good way. Kind of like the 2000 election.\n\nThe sandwiches themselves are large and in charge. I'm a fan of the mortadella sandwich (with ONE INCH OF MEAT! Perhaps the only instance where I would exclaim that with joy instead of disappointment), toasted on sourdough, for those days when you feel like a fatass and embrace it.\n\nIn conclusion, I heart Mr. Pickles. When they bring back the Tootsie Roll pops, they'll get that elusive fifth star.\n\nUPDATE 2/5/07: The Tootsie Roll Pops are back, bitches!", "author": "Alyssa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-15", "description": "Huge, Giant size sandwiches.\n\nThese are made for the guys, but let's look at it this way ladies.......we can have half for lunch and the other half for dinner.  Never mind sharing with your honey!  Make him get his own sammy.\n\nI *Heart* the Tony Soprano sandwich.", "author": "Emmy d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-08", "description": "YUM YUM! Mr. Pickles is so delicious...I rather get this over Ike's any day of the week! Cheaper, just as good, and NO LINE! Allegedly Ike used to work at Mr. Pickles, and that is where he got the sandwich idea, Ike just put more outrageous sandwich options and raised up the prices. All the Mr. Pickles sandwiches are pretty good, but get it on Dutch bread! YUM. The owners are really nice too. She gave us free lolipops!", "author": "alexandria g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-21", "description": "The City is seriously lacking in good sandwich shops. I think Mr. Pickles may be one of the best, or maybe I just miss having a deli on every corner??  The Gaucho and the Veggie are both fantastic, the service is always quick and their pickles are amazing! (go figure!) There's not much seating in the restaurant so plan on getting your sandwich to go, and definitely make sure you get one of their pickles, they're delivered on Tuesdays, so hit them up when they're fresh!\n\nI just wish someone would open a good sandwich shop in Russian Hill!", "author": "Craig E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-14", "description": "I've moved away from the Mission (thank god) but still go back to Mr. Pickles every once in a while to get the Caesar Chavez sandwich. I get mine *light* pesto and pepperjack cheese instead of swiss.\n\nIt can get a little hipster heavy so I'd recommend calling in the order 10 min before and getting it to go. Ultimate in and out.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-26", "description": "I'm into pickles to such an extent that I was unimpressed by the pickle content of my sandwich. It was pretty good, but if a joint called itself Peanut Butter Man's, replete with a mascot outside that's half-man/half-jar-of-peanut-butter, a fool might come to expect some peanut butter on sandwiches, and plenty of it. So throw some more dill chips at me. That's all I'm saying.\n\nThere is a dearth of big (non-torta, non-burger) sandwiches in the Mission. You've got Lucca's, Bi-Rite and a very few others. So there's Mr. Pickles. It's a big sandwich, oozing with, um, condiments. Which it's mascot brandishes from holsters. \n\nOne thing I wasn't prepared for is they splooge pesto sauce on everything. Seriously. It's on the menu. I tell ya, pesto ain't onions, but the next time I roll into Mr Pickles, I'm saying, hold 'em both.", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-01", "description": "As a toasted sandwich lover I have become addicted to this place. Their turkey with avocado on whatever bread is always great. The only drawbacks are that their stools aren't high enough and the TV is always blaring. Last time it was Forrest Whitaker's wife talking about how she loves bargains (fuck you byatch).\n\nGreat toasted 'witches but next time I'm gettin' 'em to go.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-10", "description": "Truly truly one of the best values around. Every time I get a sandwich here, I have been pleased. The price is right and the owners are super friendly in this no frills joint. Don't plan on eating there, but for take out you can't ask for more!\n\nTony Soprano is my personal favorite on dutch crunch.", "author": "Matt C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-15", "description": "holy fuck .so yesterday I was a) sad from a situation on friday b) pms'ing so hard I cried watching ICONOCLASTS:Maya Angelou and Dave Chappelle on Sundance channel c) it was super rainy. I was a motherfucking mess,kinda like Anna Nicole Smith(rip) mess. I needed a sandwich. I remembered I had seen a mr pickles on s.van ness once, and thats a popular chain that is in my hometown too.\n\nCan we say just what the doctor ordered? I got a THE GAUCHO that was chicken breast doused in buffalo hot sauce and then all the fixings.\n\nThank you mr.pickles for helping me thru a horrible day.BESOS", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-16", "description": "Definitely not a place to sit down and eat--just get your food from the smart ass sandwich makers and go out into the sunny Mission.  And I strongly recommend the chicken salad sandwich...all white meat, with or without cheese and all kinds of veggies and condiments.  Add a couple of salt and vinegar potato chips to the sandwich and you're in lunchy lala land.\n\nMy vote on the outdoor mascot:  Winner.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-28", "description": "This is a damn good sandwich!  They have a large selection of specialty subs, including BBQ, meatballs, pastrami, and just about anything else that you can think of.  The sandwiches are huge and could probably make two meals if you aren't starving.  \n\nTheir ambiguously racist Mr. Pickle mascot is priceless.  It kinda looks like the love child of the 3 Amigos and an old cucumber.  \n\nNow the bad:  My sandwich was $6.49.  My total bill for the sandwich and a Vitamin Water was $10.  Me thinks me sees where the margins be at. \n\nSo for all you sandwich-philes out there, if you happen to be in the area, this place is definitely worth a visit.", "author": "matt c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-12", "description": "Dog house was pretty decent. Pastrami had a good amount of flavor. Bread was a bit hard for sourodough but maybe I'll try a different bread next time.", "author": "Eric R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-03", "description": "Walked there this morning, a drizzly day. Was needing a good hangover sandwich and decided to try this place out.  Was presently surprised by two guys working. They were super nice and helpful AND treated us to tootsie roll pops.\n\nGot home and could only eat half, the sandwich was so huge! Got the veggie no cheese. Mmm Mmm good. \n\nOh and very sad to here about Mr Pickles. I'm thinking we start mass posts/blogs to find him and bring him home!!", "author": "Emily V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-27", "description": "These sandwiches are really good. I've tried the Station 7, the Hipster, and the Gaucho and they were all good. There are 31 options and you can customize. Two things to consider: 1) cash only 2) call ahead or the wait will be long.", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-26", "description": "Pickle Cowboy! How can you pass this place up? A life-size (albeit short) pickle with a 10-gallon stetson and two six-shooters. My friend who introduced me to Mr. Pickles just loves that sign. \n\nThe sandwiches are fantastic. First off, they are huge. It takes a large person to finish one. Smaller folks like me can easily split one with a lover, friend, or enemy.\n\nLast night we had a turkey, ham and salami sandwich. The meat was excellent. I'm not usually a fan of salami, but this was delicious. The melted cheese was so tasty too. The toppings are all fresh, and the bread was perfect (get it toasted!)  It's not a cheap sandwich (around $7), but it's totally worth the price. It's more food than a Subway footlong, and so much better. \n\nThe staff are very friendly also. You must go.", "author": "J S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-04", "description": "I was seriously impressed with the size of my tasty sandwich from Mr. Pickle's Sandwich Shop.  Unfortunately, it was very, very messy.  I can recommend this place, but I would advise against trying to eat one of these monsters while driving.  By the time I got to Half Moon Bay, my pants were drenched in the buffalo wings sauce that was an integral part of my chicken sandwich.\n\nAlso, be warned that it's common to spend 15-20 minutes waiting for your sandwich to be prepared because it can get really busy around lunch and this place rightfully is seen as a great deal.  Parking can usually be had nearby, but plan on putting three quarters in the meter because you're likely to be waiting for about that amount of time if you arrive between 11:30 - 1:00.", "author": "Lucius M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-25", "description": "My friends and I are in this huge sandwich phase of our lives right now, so obviously we had to visit. We even looked up the menu online so we'd be prepared to order one of these massive sandwiches. Seriously, they're the size of a small puppy, and not too expensive. Love it. \nAnyway, I got a Cesar Chavez, which contains all the perfect ingredients that a sandwich should have: chicken, bacon, avocado and jack cheese.. add on the complimentary pesto, mayo and veggies and you're in sandwich heaven. \nExcellent. The nice lady who took my order was awesome, too. Definitely coming back.", "author": "Tabby R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-31", "description": "Okay, I have to admit, I wasn't really looking forward to going to a sandwich place called Mr. Pickles.  But someone was buying me lunch, so who am I to be hella picky right?\n\nWe find parking immediately and I wasn't too sure how to feel about that being in San Francisco (I mean, really, do you ever find parking right away?  Is that a good sign of a business?).  We walk in (keep in mind it was about 1PM, so I assume there would be customers there before us) and there were NO ONE THERE.  Not looking good.  \n\nNot to sound racial, but this look like one of the most \"white-washed\" sandwich place I have ever seen in the Mission yet there were two latin fellas listening to soft Latin Rock behind the counter.  That was totally unexpected.\n\nI finally figured out what I wanted to eat, the TONY SOPRANO.  We get back to our workplace and I looked at my sandwich and the first thought was \"DAMN, pretty big, lots of meat, my kinda sandwich\".  I took that first bite and thought \"DAMN, not too shabby Mr. Pickle, not too shabby at all\"\n\nNow, will I find myself craving a Mr. Pickles Sandwich?  Prolly not since I know of better places, but I'm glad I was able to experience it.  \n\nPrice is pretty reasonable, service pretty good, and the sandwiches are pretty good also.\n\nThis has been another Mike Vuong PSA!!", "author": "Mike V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-07", "description": "will all the new nattering nabobs of negativity putting down the pickle quit the hyperbole?  one-star people, really?  really??  \n\nyou boobs nattering about how Ike's rocks and how the pickle is so ghetto, yada yada yada, you've compelled me to write this update.   man, you just don't get it, do you?  this isn't some city-wide contest or beauty pageant.  the pickle is about knowing you can stroll in whenever you're hungry and haven't got much cash,  and only a truly superb sandwich with a tootsie roll pop and genuinely friendly service no matter the time or day or day of week is gonna cut it.  everybody wants a sando place like this around the corner. \n\nthe pickle is about being able to get your simple ingredients inside the best sourdough roll ever.  (whatever you get, be sure to order yours on sourdough, toasted.)  the Gaucho, extra spicy, is still my personal favorite.  But find your own.", "author": "Nikki F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-30", "description": "Awesome sandwiches, always made to order fresh ingridients, friendly faces, just an awesome place to get a sandwich", "author": "Pedro C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-05", "description": "I first discovered Mr. Pickles in the Dublin/Pleasanton area and loved it.  I found the one on 20th and South Van Ness in S.F. and couldn't wait to go there.  What a disappointment.  The place was skanky and dirty.  The sandwich was excellent and because of the huge size, it's the only thing I ate that day.  I woke up in the middle of the night with severe stomach cramps and spent the entire rest of the night in the bathroom off and on.  Never again.", "author": "Kathy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-27", "description": "i think it was the chicken honey mustard sandwich or something.  the taste was amazing, but as i was eating it, i started wondering, is this canned chicken?  cuz it tastes like canned chicken (the texture).  didnt care for the meat part, but it tasted good.", "author": "Sage S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-18", "description": "Today is April the 18th, 2007.\n\nI dont know why i have not taken 2 hours of my day to write a review yet for this place. Today is the day, Mark it YELP, MARK IT!. \n\nThe price is right, the sammich is generous, for less than 7 bucks you can get a mean sandwich with a rare name to reference it, kind of like THE LARRY DAVID- filled with Capers and a white Cod.  Im still waiting for that one, but even if your less adventurous, get a regular turkey sandwich, all i have to say is, Your gonna return.", "author": "Joe J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-18", "description": "Not the best Mr. Pickle's I've been to. They still make a kick a kick ass sangweech but the 'ambience' is a bit lack luster. There's no where to sit except a gluttenously high bar with too short stools that just put your face level with the counter top. I guess that's supposed to be good so then you could just shovel the sandwich directly into your mouth without even having to hold it, but I'm a Carl's Jr. motto kind of person and I like it when it gets all over the place. \n\nMy friend and I were the only people in there at about 2pm on a weekday, I'm kind of baffled how they stay open. If I had a choice I would drive to the Mr. Pickle's in Daly City instead of taking the bus to this much closer one. The Daly City one might have a creepy gimp who works the register, but its way nicer and there's places to sit.", "author": "bo h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-31", "description": "I always get either the Tom Tom (turkey, bacon, and swiss) or the Meatball, on dutch crunch, toasted, with everything. These two are so good, I can't bring myself to try anything else. It's all I can do to pass up one of them. The pesto-based house spread (part of the \"everything\") takes every sandwich to the next level. It's delicious and cheap, the guys behind the counter are chill and polite, and they give you a lollipop for dessert.", "author": "Marco L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-24", "description": "I have just two words for you. Peppers. And pesto. I am a wuss when it comes to all things hot, but the peppers make the sammie. I live a mere five blocks from here and have not frequented it nearly enough. So, I'm working on this extended weekend and had a hankerin' for a sandwich while I toiled away at my computer. So, I looked up Mr. Pickle's to see if they were open, and sure enough, they're on in full force on Sunday. I walked down there and they were packed with people, which is a good sign. I believe a street fair is on Mission today, but still. I got the house combo with ham, salami and turkey with everything, including peppers and pesto. When I got back home with my prize, I inhaled that sucker. That is one of the best sandwiches I've had in a long time. I had forgotten about this amazing shop, but no more. I have a sense it will be my staple go-to soon. Fresh bread, shredded lettuce and good meat. I highly recommend it. \n\nOh, and if you know the whereabouts of Mr. Pickle, please alert the authorities....\n\nhttp://missionmission.wordpress.com/2009/03/15/breaking-mr-pickle-stolen/", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-06", "description": "Ordered a pickup for 9 people. It was ready on time, which I always am a huge fan of. I ordered the Tony Soprano and it was fantastic. They only take cash but I can't really take away a star for that.", "author": "Chas B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-29", "description": "I called up Mr. Pickle on my telephone and a woman answered. I assume it was Mr. Pickle's wife. I ordered one of their chicken sandwiches because I love chicken so much.  Mrs. Pickle said to me, \"We have to close because we are out of bread.\" I said, \"But I don't like bread, I like chicken.\" I later discovered bread is necessary to make this particular type of sandwich. I am going to KFC where things make sense.", "author": "Dinner Dog X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-10", "description": "One of the best....if not THE BEST....sandwich shops in the city. The sandwiches are huge -- Mr. Pickles doesn't skimp on any of the ingredients. Plus, the staff is very nice -- they sometimes even give you a free lollipop to show their appreciation.\n\nThe best part of Mr. Pickles? The sign out front. Go there to see for yourself.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-21", "description": "I'm a sucker for a good deli, and they are hard to find in SF.  I've lived right around the corner from this place for a long time and finally, finally made it in to get a sandwich.  What a trip!\n\nme: I really like the Mr. Pickles outside, he's a nice addition to the neighborhood.\n\nDiyana: Isn't he cute? I love him.  All the kids like Mr. Pickles, they walk by going home from school and say hi to Mr. Pickles.\n\nme: nobody ever messes with him?\n\nDiyana: Why would they want to hurt Mr. Pickles?  Nobody hurt Mr. Pickles.  I kill them.\n\nJust enough time for banter while the skilled craftsman makes our to-go order in the background.  If it hadn't been a week ago I would remember the names of the two sandwiches, but mine was a pastrami and swiss, my girlfriend had something with chicken on it, both with the works (yummy pesto!), and both fantastic.\n\nThanks Mr. Pickles for reminding me that I need to check out more places that are a short walk from my house!", "author": "Matthew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-09", "description": "I love this place. One of the best Sandwich place in Mission. The guy is so great. He gives cool recommendation. I try visit every week.", "author": "Kapil D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-24", "description": "this place is sick.  goldmine as it is 14 steps from my door.  tony soprano is what you would think - salami and motadella and a bunch of other italian loveness....fuhgettduhaboutit", "author": "Rob C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-13", "description": "Sandwiches are good, on par with the Safeway Primo Taglio goodness. There isn't much space to eat inside; plan on grabbing to go.", "author": "Rob T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-13", "description": "get the tony soprano on dutch crunch", "author": "Doug H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-01", "description": "My favorite is the Reggie - chicken on dutch crunch.  I always think I'm getting something half-way healthy, but then when I'm done my hands are completely covered in oil.  The turkey on sourdough with cranberry sauce is good too.\n\nEmployees are friendly and not ass kissers. And everything is made fresh but still pretty fast.\n\nMr. Pickle is a half-pickle-half-man/cowboy with a handsome mustache who greets visitors with a smile.", "author": "Carlos V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-19", "description": "Initially intimidated by the large and heavily-armed, Sombrero-flaunting security with the perpetual smile, we decided to circle the block a couple times to patronize this silly themed Sandwich shop.  \n\nFledgling vegetarian, I could not resist the honey-mustard chicken temptation that is the last Sandwich on the menu; its epic name escapes my memory.  My partner chose the only vegetarian selection and we waited.  \n\nThe end result were two over-endowed Sandwiches, successful in their execution.  Though not very creative in their presentation, they were tasty and virtually endless in contents spilling out of the yeasty flanks of custom selected bread.  \n\nI'm 6'3\", and the two stools available to sit at the window made me feel like Lil' Bush.  19:1 Meat to Vegetarian selection leaves room for innovation.   I'm sure Mr. Pickles does enough business with omnivores and relapse-prone veg-diet enthusiasts.   And people who like to stand whilst they eat.  Thanks, Mr. Pickles.", "author": "Erik O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-10", "description": "Though the original Mr. Pickles in San Mateo is in my top 5 sandwich places, this specific location takes a close second to the flagship.  They have all the same specialty sandwiches, and make them just about as good, though they have different names.  My personal favorite is the \"Padre's Pride\" or as it's known in S.F. the \"Cesar Chavez\";   MMMMMMM.....roasted chicken, bacon and avocado with melted jack on a sourdogh roll, i'm tellin'ya kids, it don't get much better than that.\ni'd probably give 5 stars if the original wasn't sooo damn good.", "author": "Carol S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-12", "description": "The Cesar Chavez is one of my favorite sandwiches in the city. Chicken, provolone, bacon, avo, with a pesto mayo. Mmmmm....\nAlso, the staff are friendly and they have a TV to watch sports while waiting for your order.", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-08", "description": "Good sandwiches can be hard to find... but not at Mister Pickle. The staff are friendly and funny, and the sandwiches are amazing. I'd put them on a sandwich pedestal close to Ike's Place. Great bread, great sauces, great ingredients, and it is all toasted to perfection. I recommend grabbing your food to go, however as the seating leaves a bit to be desired... but that's okay, you're really going for the food.", "author": "Christopher V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-30", "description": "This place is awesome. Vege is great. Service lovely. Only place in the mission that's told me to bring my bike inside instead of leaving it on the street.", "author": "Wade M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-17", "description": "Working in the Mission, my coworkers and I daily rotate where we get lunch take out... We order from Mr. Pickles at least once a week...(when I first discovered this shop, I think it was twice that week) Delicious!! I would never ever be able to finish one sandwich to myself so my coworker and I share the Cesar Chavez and we are only left satisfied. Their bread is delicious. Their pesto spread is delicious. \nmmmm....think i'll go tomorrow for lunch", "author": "Jessica Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-09", "description": "its...okay. \nthe woman who works at the one near mission is a doll. very nice lady.  but the sandwiches lack a bit flaor. maybe its the bread... i think i crave the fresh baked flavor of ike's. but if you like a sandwich that is a lot tastier than an average sub,  this is good place to go .", "author": "Katie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-19", "description": "I'm a sucker for a big ass sandwich...and I just love eating them! After walking through \"Sunday Streets\" in the Mission it was time for a snack before heading to the symphony at Dolores Park. This place is awesome because there are so many options to choose from! I chose the veggie sandwich: comes with everything including pesto! Yum!!! It was huge and I ate the whole thing...all by myself! Satisfying and wanting more...can't wait to come back and try other things on their menu...staff is friendly and you can't go wrong with the price!", "author": "Mel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-02", "description": "Who ever does not love Mr. Pickles must be crazy!!! Talk about a yummy sandwich, this is the place. Not only that but it is way clean in there. O.K. I noticed they got 100% on the health dept rating. I bet you could eat off the floor in there but I think I'd rather dig into the food\nEnjoy!!", "author": "lorri l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-18", "description": "Here's a good litmus test for any dining establishment's food quality. If you see cops eating there, chances are, it's pretty good. That's what drew me to Mr. Pickles. \n\nTheir sandwiches are HUGE and tasty. I'm partial to the pastrami, but I also stuff my face with the chicken salad frequently. It's gotten to the point where I am always asked \"chicken salad today?\" by the staff when I saunter in for a late lunch.\n\nAnd let's talk about the staff. They are some of the nicest folks you'd ever meet. Always friendly, have never gotten my order wrong once, no matter how complicated I decide I want my sandwich that day.\n\nThey have a huge assortment of specialty sandwiches, but if you want a simple ham on dutch, they can make that too, with their fantastic pickles and pesto dressing.\n\nJust be sure to wear a rain slicker, because some of those sandwiches can be quite messy. (\"The Bear\" and \"Station 7\" come to mind.)", "author": "Jonny P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-01", "description": "The sandwiches here are amazing. The bread is soooo good. I love the tuna sandwich here and my boyfriend loves every sandwich on the menu. This is *the* place for a deli sandwich in our neighborhood. Sadly, the famous Mr. Pickle sign was recently stolen from outside. I have my fingers crossed the culprit will return the Mission's beloved Mr. Pickle.", "author": "Veronica J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-20", "description": "Two meals in one sandwich.  They load on the toppings.  Only a few barstools, so get it to go.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-09", "description": "I am a vege-\"except for the once a month when I visit Mr Pickles for a (now not so very ) secret turkey sandwich with cranberry sauce on toasted wheat, hold the mayo, onions, and peppers\"-tarian. Yum. No shame.", "author": "Hallie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-13", "description": "Ok, their stupid hours of business aside I have to bump them up a star for their Dog House sandwich. They do go a little crazy with the lettuce though.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-09", "description": "The metric by which all other sandwiches are evaluated. Simple as that.", "author": "Haz O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-13", "description": "I had no idea Mr. Pickles was a chain restaurant considering how low profile this location is. The pastrami sandwich tops my personal favorites list. Not for shrinking violets, it is a large mound of meaty-Swiss-cheesy goodness. Yesterday I picked a vegetarian sandwich, and it was delicious. Avocados?? Yes!! The bread rolls run a little tough. I wonder if they can improve that.", "author": "Evelyn B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-11-01", "description": "Giant sandwiches, with everything you could imagine on them, the oozing kind. I love the pickle sign, but not the blaring TV or the nondescript decor. For boys with big appetites,  it's apparently sandwich heaven. Personally, I prefer my food on a smaller scale.", "author": "Stellah D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-27", "description": "Mr. Pickles is tasty and nice.  Their sandwiches runneth over with abundant, flavorful filling.  We ordered a Station 7 on sliced wheat and a meatball sandwiche on dutch crunch, complete with sour cream and onion chips.  I ate half, saved the other half, and gobbled it up as an afternoon snack.  Still tasty after sitting around for 2 hours.  At about $8 a person, this place is one special sandwiche shop.  Plus, that pickle guy out front makes me giggle every time.  It's a pickle wearing a sombrero!  That's funny!  Well, I think so.  I'm easily amused.", "author": "Diana Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-10", "description": "Not really sure what people are raving about.  Yes they have different types of sandwiches than a grocery store deli counter, but they weren't all that.  It tasted like a regular sandwich.  The sandwich wasn't as big as I was expecting after reading the reviews.   I mean when I pay over 6 bucks for a sandwich it better be big.  A few days later I had Mr. Pickles again.  Same experience.  The sandwich was decent enough, but I definitely wouldn't go out of my way to come here.  But if in the neighborhood and in the mood for a sandwich, I'd stop by.", "author": "Isi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-24", "description": "I went there hoping for the kind of subs you can get back east.  No luck there, but the sandwiches you can get are fantastic.  Do yourself a favor and tell the cashier what you absolutely don't want on your sandwich.   Otherwise be prepared to answer a dozen questions as they prepare your food: did you want mayo?  Pesto?  Hummus on that pastrami?  Still, once you survive the interrogation, you've got enough sandwich to feed a family of five.  They've got a couple of seats, but it's more for waiting than for eating; I've only ever taken my food to go.", "author": "Christian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-16", "description": "Excellent!  Mr Pickle's is a little out of my way but sometime I just get a craving for the Station 7 sandwich.  I hate places that skimp out on the meat and topping, you won't find that here the sandwiches are huge and they don't skimp out on anything.  They are always nice and if you order by phone your order will be ready in no time.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "Best damn sandwhich in a long time. God this was good. The prices are quite reasonable and the wait was short. No five stars because the place was kind of dumpy looking and it really didn't look all that clean. Otherwise, everything was quite delicious. Will definitely eat here again.", "author": "Adam P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-22", "description": "A co-worker talked me into getting lunch here... fantastic aoli, great bread, fresh ingredients, one sandwich is large enough for 2 people.  Def goin back soon.", "author": "Bin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-24", "description": "I'm gonna talk about work related dives for a bit here... Mr. Pickle; is across the street from the most amazing Mexican eatery in the mission, and it holds its own in terms of  \"sandwich\". I worked down here for a year and would frequent Mr. Pickle with some regularity with my cohorts, and honestly, the pastrami, etc are all outstanding. freshly made with melted cheese (not kosher), and bold flavors. In true eBay form: highly recommend. A++++++++", "author": "Adam X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-31", "description": "My first bite was the tell all--the roast beef had an aged taste to it and not in a good way. I think since I ordered it with everything, I was able to ignore that taste for a few more bites, but in the end, I could not eat the damn thing. It is a bummer too since it is the closest place to grab a quick sando from my work. I may try it again and order something different, but only time will tell.", "author": "Deborah S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-20", "description": "I had an americano and an egg sandwich.  The americano was pretty bad, even considering that the woman working there explained to me she was lousy at making coffee.  The egg sandwich was iffy, the prescrambled eggs came in a folded sheet from a tupperware from the fridge and were microwaved.  All in all I would try it again but I definitely wouldn't order an egg sandwich here.  This is not a breakfast or coffee place.", "author": "Matt N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-16", "description": "Really nice place. Portions are liberal - sometimes enough for two meals - and price is right. Always a tasty sandwich.", "author": "Zac w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-24", "description": "OH MY GOD!  I'm almost one hundred percent sure that this place IS THE best place to get a more than spectacular sandwich in this city.  Or perhaps even in the world.  The sandwiches are to f-ing die for!  I always get the veggie, with avocado (VERY important) and pepper jack cheese.  Dude...its the kind of food, where you take a bite...look at your friend...and you both just smile and nod for about 30 seconds.  Delicious.  Spectacular is a better word for it.  And the staff are all pretty amazing.  Friendly and super awesome.  This place should get a crown.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-23", "description": "The guys are always arguing with each other. About what their mother told them to do or if the mayo is still good. They cut their chatter to stare like they've never seen a woman before even though I know my friend who lives upstairs goes there all the time and she is female. THEN they call me ma'am.  Hilarious!", "author": "Krismet C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-28", "description": "I kept being tempted by the big friendly pickle on the sidewalk, during my drive to work in the mornings.  Finally after reading Derek D.'s review, I decided to try it out. It's definitely not most inviting decor, but they had some creative sandwiches on the menu.  I opted for the Vegi plus turkey (I know defeats the purpose of a vegi sandwich, but it was easier to order it this way then turkey plus all the veggies.).  The sand which was pretty good...I'd eat there again...but I have to say I was a little disappointed that there was no deli pickle on the side...something I kind of expected with a name like Mr. Pickles Sandwich Shop.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-23", "description": "Had the Cesar Chavez sandwich: chicken breast, bacon, avocado, on Dutch bread. Approved. Love the sombreroed Mr Pickle outside.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-12", "description": "Dig this sandwiches here...dig the details of Mr. Pickle's kidnapping...sometimes they give you free blow-pops.", "author": "Elle N M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-24", "description": "Really didn't want to like this place. Kind of out of the way, the lady overcharged me for the sandwich, they don't carry baked chips, don't accept credit cards, and wanted an extra $1.50 for a pickle. So I passed on the pickle, picked up chips elsewhere, and headed to my spot at Dolores Park. I thought on the walk over the weight of the bag was due to the soda can. As I discovered, and the reason why this is a four star review, is because the sandwich is so freaking big. They piled on so much turkey, mixed in some cranberry, veggies, and slammed it all together on whole grain bread. Mmmm, delicious.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-28", "description": "Mr. Pickles, you're the one; you make lunchtime so much fun! He's almost as cute as Rubber Ducky, wearing that giddy sombrero and packing all that heat for the kiddies to play with. Their sandwich size fits a large man with a healthy appetite, but they also offer half orders for the pipsqueaks (like me). Or you can share with a friend. The meatballs are yum. My boring but satisfying go-to is turkey provolone avocado. The Mr. isn't worthy enough to even kiss Sub Center's left pinkie toe, but it's a good start for this part of the Mission. I was inclined to give them three stars, but the zany mascot bumped it up to four. Gumby ain't got nothin' on you.", "author": "Katrina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-29", "description": "I don't think words can express how much I love the Mr. Pickles cut out that stands on 20th and South Van Ness. Mr. Pickles looks like he's about to make his move in a showdown. He has a big sombrero and a thick dark mustache. He's got a sandwich under one arm and carries mustard and mayonnaise in his holsters. His bullet holder has peppers instead bullets. He wears cowboy boots on his little pickle feet. Really he should be called Senor Pickles, but Mr. Pickles answers to no one. Mr. Pickles makes me feel safe. I feel like he's protecting the street. What harm could befall me while Mr. Pickles is on the beat?\nHaving said all that, I've only been there once. I'm not sure about the price since it was on work. There's very little seating, a counter and some stools. The sandwiches were pretty good. The one time I went in there all workers looked like dopey hooligans. Big teen-aged boys who were joking around a lot. I liked that. Mr. Pickles is a small Bay Area chain, and each place names their sandwiches something different. I found this slightly confusing when picking up the order I placed.\nI suppose this review isn't too helpful, but really it's all about Mr. Pickles himself. Mr. Pickles! I squeal with delight each time I see him.", "author": "Daniella C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-19", "description": "After eating one of their huge ham sandwiches I was sure I had taken a year off of my life expectancy.  Every time my roommate eats there he has to take a three hour siesta.", "author": "David A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-28", "description": "I would just like to point out that other people are beginning to catch on to my theory: http://missionmission.wordpress.com/2009/05/15/mr-pickle-refurbed-and-redeployed/", "author": "Liz W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-18", "description": "Probably the messiest sandwich I've ever eaten (I like the turkey with cranberry sauce) but completely worth it.  Friendly service, hearty sandwiches, fresh and tasty.", "author": "Julie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-04", "description": "For big, heavy, hot sandos that drip all over and stuff you silly.  Got the one vegetarian option which was a mass of melted jack/cheddar, sprouts, iceberg, pickles, cucumbers, mayo and pesto on a perfectly pressed crispy wheat roll.  Not 5-star scrumptious but definitely fatso satisfying.", "author": "Melanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-24", "description": "how can you even care about the food when the pickle outside has a holster of condiments??  a holster of condiments!!!\n\nbut if you do care - the sandwiches are good, although the dudes inside who make them move at the pace of a very slow snail.    \n\nalso, try the peanut butter cookies.  you won't regret it!", "author": "Sharon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-20", "description": "Not as good as the one in San Mateo on El Camino Real... but close... and still the best sandwich in the city (READ: THE BAR IS SET REALLY LOW).  I am a big fan of the Ceasar Chavez as any sandwich with chicken, avacado, and swiss is heaven in my book, the Padre's Pride from the San Mateo Location (the original) is better.  I stop off here to get food for beach trips or ball games and every time am glad I did.   Get to go and call in your order if you can, the wait can be quite long.", "author": "Darren R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-23", "description": "This place is a block from my house and for some reason off my radar because I just went there for the first time recently... Boy have I been missing out! I got one of the most rockin' sandwiches I've had in a long time. Mortadella with melted swiss cheese, good bread, pesto and peppers make it messy in a good way. Perfect for a picnic at the beach (which is what we did) - or anytime you need good grub really.", "author": "Aimee G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-30", "description": "This place used to be a staple of my lunchtime eating when I worked in the US bank tower on 22nd and mission.  The sandwitches arent horribly cheap but they are big and tasty...The soprano on dutch crunch is simply killer and a real meal and a half for most of us normal folk...the service is fast and friendly and the chip and drink selection is pretty damn good as well.  I'm a fan of mr. pickles and all of the other mission kids are as well!", "author": "Francis K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-24", "description": "We stop here usually on our way out of town...either for a trip to the resevoir or to a concert etc to pick up sammies for the road. Really good, huge and yummy.", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-19", "description": "They make a pretty good sandwich here but I'm partial to the location down in Daly City since I've eaten there more and only once here.  I think they are pretty much the same.", "author": "Derek D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-08", "description": "In my opinion Mr. Pickles has the best sandwiches in the city.  Featuring tons of meat, fresh bread, and pesto spread onto every sandwich they make these bad boys offer a huge sandwich with a lot of flavor.  Try the Tony Soprano (it features just about every meat in existance that ends in a vowel) or my #1 pick the Pastrami with Bacon and get your daily reccmmended allowance of nitrates.", "author": "matthew w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-19", "description": "I finally ate here, mostly b/c of the big pickle out front- he's sexy! I had the BLT with most of the condiments, which is pretty out of the oridnary. Usually I only want BLT with a little mayo but was delicious! I have to go back and try some different ones- they all looked pretty good. Plus its impossible to find a sandwich in that area.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-01", "description": "Fairly priced sandwiches that are strictly the best i can find in SF. People talk up Ike's a lot, but the wait for a sandwich is ridiculous and just not nearly as tasty or well constructed as Mr. pickles. Excellent service, family run and all around a great place. it would be nice if they had more seating though. if you want my recommendation, get the #19.", "author": "J. G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-09", "description": "meh is right. mediocre at best. it's edible. and the woman (who was adorably batty) just wasn't listening when i told her what i didn't want on the sandwich... so i ended up with most of the stuff i didn't want. oh well.", "author": "Ashley A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-02", "description": "awesome veggie sandwiches, make sure to get dutch crunch!", "author": "Dave M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-05", "description": "I love this place!  It is a great addition to the neighborhood.  I especially like the fact that they hire neighborhood folks to help run the place.  And to top it all off...the sandwiches are FANTASTIC!  I recommend any on the menu, as I have tried almost every one.  If you are part of a school or community group, ask about discounts.  They really try to support the neighborhood.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-11", "description": "I went by here five times before i went in, but i should have listened to Mr. Pickle's look in his 2 dimensional eyes long before. I didn't know that pesto was meant to be on all sanwishes, but it is.  well, maybe not all.  that's why no 5 stars.  One of two places to get real sandwish in the mission.  This sandwish is two meals for me.  making my meal 3.50 each time.  This is the rad price for the rad meal.", "author": "chreesh b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-08", "description": "I come here for a fantastic sandwich. I don't go for the amazingly cheap price, that is just a bonus.", "author": "Kelly J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-19", "description": "Great sandwiches! I wish I live closer to them  :-(", "author": "Lysander A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-17", "description": "Although their sandwich are expensive, i still love how it taste. $7 a sandwich is more than what i can afford for lunch but i'll go when i have a buck more to spare.", "author": "Man G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-14", "description": "hey very good sandwiches\n#1 mr. pickles shop\nAlso Upset someone stole the MR PIckle outside the one with the hat and the sandwich in his hands so whoever took it please give it back to the store owner", "author": "Suleiman J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-05", "description": "Live just a few steps away and never walked in til a friend mentioned how good the sandwiches are. Oh Yeah! Totally agree! The sandwich is huge and the guys did not go weighing or conserve the portions like some mu*&th%$$ckin shops do like weak a$$ Togos or Subway which are multi-million $$ companies. Prices are fair for the amount of sandwich you get and so I highly recommend. Thanks to those guys who hook it up in there! Oh yea - who the F*&&ck took Mr. Pickles! Bring em back!", "author": "Edward B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-23", "description": "The lady that runs this place is great! And I love their sandwiches!", "author": "Mr. Marie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-14", "description": "We really enjoyed our sandwiches here! It's a great place to find something for everyone in a group and you don't have to spend a lot. I got a chicken type sandwich and really enjoyed it. My wife tried the veggie type sandwich and she's asked if we can go back sometime. If you're in the area and only want to spend 6-7 bucks on lunch, I'd recommend stopping here.", "author": "Devin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-25", "description": "I live across the street from Mr. Pickles and only go there once in a while for a treat.  I love their BLT on Dutch Crunch.  I love deli sandwiches and the people here are low key and nice.  Recommended.", "author": "Walter P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-16", "description": "i live in the neighborhood and you really couldn't ask for more in a sandwich.  i like the veggie sandwich - the pesto gives it a nice kick and.  the mean sandwiches are really good too.  they use a lot of different fresh veggies and the bread is good as well.  try one of their sandwiches warm!", "author": "michelle k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-05", "description": "I must admit that this place can make a killer sandwich. Their bread is always perfectly toasted. Anytime, I show up I can get a sandwich real quick no appointments or waiting. Street parking is not bad either. If your ever in the area, try them out they sure beat your quizno's", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-17", "description": "great sandwiches, great price.  depending on your appetite, likely enough food for 2 meals.  have tried just about every chicken sandwich and have not been disappointed yet.", "author": "Tim G."}
