{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "Pliny The Elder.  On Tap.\n\nNot sure if this is a usual occurrence, but it is enough for me to want to check this place out every single time I go here!  Which isn't very frequently, but it's about to be a whole lot more frequently if this is the case!\n\nIf you are not familiar with Pliny (Elder/Younger), then I strongly suggest you get off your butt, climb outta your shell, and go familiarize yourself!  It's super good, DIPA, Strong, but goes down oh so easily.  I was blown away by the fact it was on tap.  Almost didn't want to leave, but adventures must be had, and they only go so far when you're in a bar all day.\n\nAnyway, staff was super friendly and chill.  Y'all should come check it out because, ya know, stuff.\n\nKThxBai! LUVYOU!!!", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "As a devout fan of futbal once every four years, it was imperative for me to find a bar that allowed me to showcase my passionate fandom in between bouts of affordable beer. Luckily, I found Murio's. And in this fine establishment, my World Cup experience this past month was everything I had imagined.\n\nMurio's has three large televisions. Two of them were along the bar, one on each side. Great for if you have a seat along the bar as you can chat up the barkeep about the current state of modern football -- that is when she isn't super busy dealing out $5 Modelo's. The largest TV is off to the side, for the viewing pleasure of the lounge area. This area is furnished with large L-shaped couches, ideal for group sizes between 4 to 10. When occupied, it gives that fervent energy one looks for in a sports bar, combined with the rare comfort of personal space commonly forgone during a sporting event.\n\nThe bar was a little too intimidating for me. I feel like if your Manchester United jersey is not advertising vodafone, you may not be ready to appreciate the subtle intricacies in the \"pitch\" as many of the bar side stalwarts would. I'm sure they're all still very inclusive, I just don't wanna answer with \"FIFA\" to when they drop that friendly - \"I'm a left wing back. Whaddaya play, mate?\"\n\nMy buddy and I spent most of my 90 minutes plus stoppage time in the lounge area, enjoying the World Cup in the only way we know how --- directing troll comments at the world class athletes as they flash across the screen.\n\n\"Damn does Toni Kroos spend his offseason at Vegas DJ-ing?\"\n\n\"Yo the Croatia jersey reminds me of the checkered wax paper from Golden Boy's Pizza\"\n\nThe more beer, the less tact.\n\n\"Breh Modric looks like Steve Nash without sunlight.\"\n\n\"Oh wait watch-- wait-- ah damn! I thought Suarez was gonna bite him from the back right there!\"\n\n\"Let God save the Queen, Pickford you save that goal\"\n\nThere will be a point in alcohol consumption when the indecencies from our mouths are assuaged, if only by its incoherency. Instead of becoming a nuisance, our recent loss of intelligible speech becomes a welcomed excitement added to the bar. We begin to exchange high fives with new found friends.\n\n\"ALL ABOARD THE LUKAKU TRAIN!\"\n\n\"It's ha-mays. HA-mays. HA-MAYS Rodriguez.\"\n\n\"MBAPPPPPPE!!! That boiiiiii fast\"\n\n\"RaHEEEEEEEMMM\"\n\nJubilation in the air, beer dripping freely from our chin, and flashes of thumbs up to the bartender who still manages to find time to clear empty glasses from our den. It did not matter if a jersey had three lions, or if they looked like pizza wax paper. Everyone was just at Murio's to have a good time, and a good time was there to be had.\n\nIt only happens once every four years. Thanks Murio's for making it count.", "author": "Ringo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Always great music that I actually wanna listen to!! But I will also preface this with I'm a Goth/alternative/rocker type chick so I like listening to rock/alternative at bars that I can't find often. \n\nJust went here on a Monday for a first date and had an absolute blast!! \n\nBecause it was a weeknight it was pretty dead which meant no one fighting over the pool table! I had forgotten how much I love playing pool even if I'm not that great I still have a really fun time playing. Time to save up my quarters!! The tables a dollar a game. \n\nOfficially my fav bar on Upper Haight!!", "author": "Goth Kitty Jen J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "Local low key chill spot. Because it's pretty much locals. Had 2 grey goose something's and a bag of chips for $22. I was like whaaaaa? And the bar is fully stocked with a bunch of good shit. Wide range. PBR, local stuff like Junipero and something called Writer's Tears which is intriguing. Makes me want to be a writer so I can legit drink it and maybe cry after ?", "author": "JoJo W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-16", "description": "Decent enough bar and an easy place to get pliny, which may no longer retain it's lofty status given the bevy of excellent beer that has flourished in the last few years, but is still pretty damned good.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "Very friendly, chill spot. ~6 beers on tap, definitely not a craft beer bar (which keeps it from being stuffy and pricey!), with a standard cocktail menu. Excellent spot to stop in and grab a casual drink and people / mural watch out the window.", "author": "Steven E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-06", "description": "Went to Haight Street to check out record stores and stroll.  After an hour I needed a bathroom and a cocktail. Murio's was close by.  They had some drink specials visible from the outside that sounded good.  \nWe ended up ordering a gin and tonic, and a moscow mule.  Standard drink, nothing special.  Bathroom was available-little hole in the wall across from the bar.  Looks like there was more comfy seating towards the back of the bar past the pool table.  It felt like a neighborhood bar, it was mid afternoon and there were already a couple of groups that were feeling good.  Bar tender was nice and moved quickly.  Drinks were moderately priced. After our drinks we decided to move on to another spot.", "author": "Amanda F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-16", "description": "This bar was aight. The drinks were meh, the music was old school nothing familiar. \n\nNot sure if it was because we were there on a Saturday afternoon. We played pool, which was missing one of the striped balls. We noticed a second set after a few games and played another round. \n\nWe had a few vodka sodas and some super cheap champagne.. it was Andres or something like that.", "author": "Nicole G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-19", "description": "Criminal.\n\nTired, I stopped in for a nightcap after a long night of work. \n\nSet my glasses on the table to look at my phone.\n\nThe bartender came over suddenly and wiped off the table. I didn't think anything of it, lifting my beer. \n\nWhen I got up to leave, I could not find my glasses. \n\nYep, you guessed it, the shady bartender swiped them!\n\nUnbelievable. Really. F#$% this place and that beardo bartender.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-01", "description": "Worst bartender I've ever met. Incredibly rude. Slow service. Doesn't care about customers. I ordered one beer and he acts like I'm asking for some ridiculous mixed drink then calls me an \"amateur\".  Do not drink here.\n.", "author": "Jason D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "This super stylish space next to Parada 22. This sweet neighborhood, ahhh! The lighting, the company, the mixologists, the jukebox....It's my favorite place to go for happy hour, especially when Rob is working.", "author": "Helen K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-02", "description": "This place is a joke. I'm always down to give spots more than one try before I write a review. Came on a Saturday after the sf deltas soccer game and it was kind of packed. I was surprised to see one bartender. He was super slow and rude. The bar back was clearly drunk, he wasn't cleaning any of the glasses people dropped on the floor. I was DD this night so all I wanted was sprite, when my bf ordered their cocktails he asked for a sprite next and the bartender said some sarcastic joke that rubbed me the wrong way. Am I not allowed to have soda? \n\nCame again on a Saturday and it was pretty dead. Yet it still felt like a hassle to get a drink from the same bartender. We learned to order doubles because it's nearly impossible to wave him down for another round whether it was busy or not. \n\nOverall the place is an upgrade from what it used to look like. \nThere's a pool table, so bring your quarters.\nLots of bar seating and table seats in the front and back!", "author": "Brittany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "Strong drinks and a inappropriate bouncer at the door. Lots of seating, nice interior, plenty of space to move around.", "author": "Daryll G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-08", "description": "I like this place, mainly because they have Russian River beer on tap and it's a good spot for people watching on Haight Street. The Sunday afternoon lady (short, dark hair) was drinking a lot, pretty drunk and only paid attention to her friends (who were wasted and loud). Other than that, no frills place for great beer.", "author": "Lia B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-09", "description": "So I'm a regular at the hookah bar next door. The first time I ever came here was last Friday, because my friend from the hookah lounge, wanted to buy me a birthday shot. Friday was awesome, bar tender was sweet and gave me/us no hassle (bigger husky guy), wait was only 5mins if that. I'd have given them more stars ONLY IF my second day went better....\n\nEnded back up here the very next day, as its conveniently located immediately next to the hookah lounge. This time I had a HORRIBLE experience for my second birthday drink....\n\nSaturday there was an asian guy bartender, after waiting 20 mins for him to get back to our end of the bar, I asked for a lemon drop...he first started flipping through a book (which we're assuming was a book on how to make the lemon drop, he started walking up and down the bar looking for something). Then came back and asked again if I was ready, and I again asked for a lemon drop, he asked me what? what? like he couldn't hear me, then asked me what is a lemon drop, whats in it.......my three friends and I were shocked and appalled by this statement from a BAR TENDER!!. He started being VERY MEAN and angry, and then started saying he has too many patrons etc etc to be making difficult drinks...um what?  you just spent more than 5 mins walking up and down the bar flipping through a book, and its like three liquid ingredients and ice...\n\nI SHOULD have just listened to my friend and gone to Cha Cha Cha on the corner, too bad I rejected saying I came here just the day before.... WILL NOT BE RETURNING, will walk just 10 more steps and go to Cha Cha Cha or Milk Bar (when they don't have a line!).", "author": "Nais K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-01", "description": "Worst service I've ever had in my life!!! Guy, spiked hair! We bought one drink and tried to pay with a credit card and was soooooo mean... we had already bought 4 drinks with a good tip.. then bought one and he wouldn't except our card... never told us there was a $15 minimum.. if so we would have got cash or gaven him it but instead tried to start a fight.. just moved down the street and will NEVER come back!! Disappointed", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-09", "description": "We just walked into this bar and the bartender accused us of having fake IDs without checking them electronically. He hit on my friend sexually and made them uncomfortable so they walked out. He insisted they return and made them pay for the drink he initially denied them. \"Worst. Service. Ever.\" - The Comic Book Guy from The Simpsons.", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Yo! This place is theeeee shiiiiiit. Robert straight killed it while serving up some bad ass grape kool aid. Fun crowd, good music, what the fuck else do you want?", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "Great place to have a drink, bartenders are awesome and super friendly! Its a must go!", "author": "KillJoii X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-03", "description": "I went here on a Thursday night and the bartender was rude as hell. I would not recommend", "author": "Briana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "Great local boozer. Had a few pints in here after walking Golden Gate Park and the bridge. The patrons and barmaid gave me plenty of good advice for stuff in the area to do.", "author": "Robert O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "#133\nYaya for Murio's Trophy Room!\n\nI was in the Haight area with my favorite bar crawl friend David and we stopped in to the Trophy Room for a cocktail as the street festival was happening.  We wanted to try as many bars on the street as we could while we meandered our way down the block for street food and cool vendor items.  \n\nDavid and I walked in to Murio's and all of a sudden the bartender yells out, \"What's up mutha-fucas!?!?!?\"  Well, that is one of the best greetings I have obtained in a long time, so I am down to stay and drink with this guy.\n\ni greeted this loud individual and I asked his name.  \"Danny, what the hell do you want?\"  If I were not already spoken for, I'm telling you--charmer... LMFAO!\n\nAnyway... Danny made us two fabulous cocktails, I mean FABULOUS!  I had a martini and David had a Corona.  We wanted to play pool as we saw the tables and grabbed a few quarters and our drinks and made our way to the back of the bar.\n\nWe chose from the plethora of warped sticks hanging on the wall, put our quarters in the table and it was time to beat my BFF down on the billiard table.  We played a game or two and another challenger came along.  No problem.  I had it--won our table back, grabbed a couple more cocktails and then we thought we would meander outside back to the street fair.  I mean, that is what we came for, we just got a little sidetracked--as always ;)\n\nDanny was one of the most personable bartenders I have ever had the pleasure of meeting.  He makes a mean drink and has nothing but funny things to say.  Now, that is a bartender--and Murio's is a cool bar.\n\nStephani Smiles for Murio's Trophy Room ;)", "author": "Stephani M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-17", "description": "I feel bad giving a bad review,  for the bartenders that work there, but this is about the door man today 06/16/2018, 1:15 AM. I've been going to Murio's for about 7 years. I work at the food industry as well. The way I was treated last night was not right. I was waiting outside for my Uber that was 5 min away and door man said I had to leave and I couldn't wait outside of the bar, being really rude for no reason. What??? Are you serious? It's not like a nightclub with a line blocking the sidewalk!! I'm a woman outside of the bar I just left,  waiting for my ride home!! And I work at the closest bar two blocks away and I know a few of your bartenders for years. What was this about? I really like a couple of the bartenders there, but that just did it for me. I was literally standing outside of the bar waiting for my Uber, is that ilegal? Used to like this place, not going back. Hire professional and decent people for the door!", "author": "Lovinglife P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Love this place! You can play pool, get an Irish coffee made with a french press AND it's dog friendly!", "author": "Dinah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "Robert the Sweet guy with the rocky cigar shirt is the friggin awesome and hustles like a mofo! First time at the bar and being a CEO of a growing biz I would put him in management if I could. You don't see this everrrrrrrr!", "author": "Sienna G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-08", "description": "Perfect place to walk in a have a beer ! The Prices are good with $8 shots. Good to go to after a nice shopping spree at Haight St. All the bartenders are ready to serve !", "author": "Charlie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-02", "description": "This bar is fine, but the bartender is a mean-spirited fellow. He was an a-hole to me and my 3 friends without any provocation. It's a bummer that this guy feels he needs to put down his bar patrons to feel like work is worth going to. \n\nMost bartenders are hired for their friendly, sociable demeanor (and drink-making talent). Don't know what the Murio's management team has in mind, letting this dude interact with customers. He's rude and sloppy. \n\nAs far as I gathered, one of the things he yelled at us about was ordering soda, bitters & lime. It's pretty poor taste for a bartender to talk down to someone for drinking soda. We also each got greyhounds -- which is beside the point.\n\nPerhaps if your shtick is to make fun of patrons and it's actually funny or in the spirit of a good time in any way... That could maybe fly... But just yelling at whoever orders a drink and calling them names? Who wants to party with a dude like that? \n\nI hope you find peace, angry Murio's bartender dude. I pity you.", "author": "Yak T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-04", "description": "Came here on a Monday night after a great comedy show at Milk Bar. We sat by the \"fire\" and had a few rounds of drinks already (which weren't great), when I went up to the bar to grab a few waters for the table (gotta keep hydrated). I had a few bucks to tip for the water in my hand, very visible. I gladly waited my turn to be helped, was very patient, and when the bartender, Robert, approached me I asked for two waters. His response? \"Oh for fucks sale.\" I was completely appalled by that response, he sounded so angry that I ordered the waters, slammed them onto the table and said nothing to me. I thanked him, despite the rude exchange, and went back to the table. My friends and I will not be coming back to this bar after that awful remark.", "author": "Leilani V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "My favorite bar on Haight Street. Love that they serve Pliny the Elder, play great music, and have a pool table. A more relaxed spot though so not great for groups", "author": "Hunter R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "This is a great locals place in the middle of a tourist ridden area. Fresh greyhounds are a nice surprise given the beautifully divey(but light) atmosphere. Service is friendly and it's not crowded on a Saturday afternoon. Great post-brunch spot where you can transition from Bloodys to Hounds.", "author": "Sydney S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "A chill neighborhood dive that gets a little cray whenever something is pappin in the Haight. 7$ fresh squeezed greyhounds made with Svedka. Nice bar tenders. Plus, excellent Haight St. people watching through the open windows at the front of the bar. Never a dull moment up here.", "author": "John D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "What I love about Murio's:\n- friendly bar staff (especially Robert - gets me my drink quickly and is always super nice!)\n- great prices, tasty Bloody Mary's\n- they have Blind Pig on tap (usually)\n- pool table!", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-05", "description": "Came here for the second time last Saturday. It was pretty late, around 12:30am, and went to the bar to order a drink. My friend was going to get the beet and shot combo and give me the shot. I don't think the bartender understood what we were trying to do. He basically yelled at me to pick something, rushing me, because more people were walking in and I assume he wanted to serve them asap. \nHe said I could order any well shot I wanted so I asked for Stoli. He condecendingly told me that wasn't well and it isn't well at any bar and told me to pick something else. He stressed me out so much I just wanted to leave. \nDon't tell and condescend to your customers. I just wanted a drink, but instead I ended up feeling shitty because of the bartenders bad attitude. It's still a nice, chill bar...EXCEPT for the service.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "Super relaxed, casual bar in Haight Ashbury. We stopped in because they had Pliny on tap.. a highly sought after and super rare beer (especially in the Midwest). The bartender was super friendly, and was busting her booty to keep everyone served and the bar restocked. She definitely took pride in the job! My guy got his Pliny and I got a mixed drink which was $13 in total. It was our cheapest drinks for the whole trip! Bathrooms were clean. I would definitely frequent here if I lived in the area!", "author": "Suzanne B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-09", "description": "The bartender is an ass and a joke.  He has no customer service at all.  We had a group of several people last night and it wasn't that busy but he sure made it seem that our business was such a hassle for him. He was so bugged out that we had credit cards. It's not a cash only bar. I asked for an extra lime and he says \"it's always something\" in the most sarcastic tone ever.  Then I ordered 5 shots and one of the glasses he was going to pour into was dirty so I asked for anther glass. He already made enough for the five shots but poured it all into the four. Made another round for one more shot and then tried to charge me an extra $10. Wha?? But you just made enough so all you had to do was grab an extra clean glass bruh. If I was the owner of that place, I would be totally embarrassed.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "Unpretentious bar with Pliny on tap and freshly squeezed grapefruit juice in your Sculpin. Amazing", "author": "Ben H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "This is the coolest spot, not very big but has a lot of charm. Pool table, cute back lounge with couches and nice lighting, and a bar in front with a good assortment of drinks. Keith and Robert (Batman and Robin) are the coolest bartenders you'll ever meet!!! Will definitely be hitting this spot up whenever I'm on a night out in the city!", "author": "Kellie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-14", "description": "I thoroughly loved this place before it remodeled and became awful.\n\nThe bartender who looks like a hairier/larger Joey Fatone is a jerk. He seems to make up prices as he goes. Every goddamn beers that he sets down on the bar sloshes out. Idiot.\n\nIt's way too loud inside (so is Hobson's, but I forgive them because of most of their other redeeming qualities) and the clientele here seems to be people leaving the methodone clinic or coming on down from Hippie Hill. I'm no snob ... This is my neighborhood ... But this place just has a weird vibe. \n\nIt used to be a fun dive bar, but now it's ewwww.", "author": "Whitney M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "Robert the bartender rocks. Felt warmly welcomed into the bar. Great Happy Hour and a friendly atmosphere on Haight street.  My husband Frank and I  wish we had more time to spend there. We will be back on our next trip to San Francisco.", "author": "Jill S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "I was here a few hours ago and I'm giving 5 stars to the bartender that took the time to make me an amazing Negroni. I only had one and decide to order a beer after I had finished it. Her selection of music was also very good. A nice bar with some chill patrons.", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-08", "description": "Situation\n- Weekday evening drinks with friends\n\nPros\n- Modern Decor\n- Good Bartenders\n- Great beers on tap\n\nOverall\nIf I'm in the area, I will definitely try to stop by", "author": "Dipesh G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-05", "description": "Stopped in here to grab a quick drink on a Saturday afternoon. Plenty of tables. Cool location.", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "My friends and I settled in here over the weekend almost by accident... There was a big pay-per-view fight going on, and we didn't want to pay a cover charge. We arrived fairly early, around 9:00, and the place was mellow when we arrived but hopping by the time we left.\n\nAnd we were not disappointed. The clientele where fun and in the Christmas spirit, the bartender was a magician, and the drinks were fairly priced. I'd go back in a heartbeat!\n\n...plus, they serve Pliny. Wins on all accounts.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-18", "description": "The drinks are okay and prices are high, but not unreasonable. Service is average to mediocre. The doorman needs to be replaced. Got the first drink okay, but the second drink... The bartender got chatty with some folks, so after a few minutes waiting and a few more moments of waving my hands around in a fairly empty bar, I stood up on the footrest of a barstool. The bartender noticed quickly, smiled, and started walking over to take my order. None of this bugged me much, it is a bar. Bartenders working by their lonesome don't have eyes in the back of their head. Sometimes you need to get up and wave. I'm not new to how a bar works.\n\nBut then, from behind!\n\nA doorman in a leather Crocodile Dundee hat came shuffling up and squawked, \"Don't stand on the barstools!\" Like he thought I was about to jump on one and start dancing. I wasn't on the barstool, but had my hand resting on the seat and my foot on the footrest to lift myself up as I if I was getting on the stool to sit down. After one drink, I wasn't dunk, and though I was feeling a little impatient, I wasn't doing more than what I do when I get on a stool for any other reason. \n\nThe doorman got a little closer than I generally expect unless someone is trying to get aggressive about something, he shouted like he thought I was deaf, and got in my face, refusing to back off. Basically, agitated bully behavior. So I turned my back on him, announced to my friends we were leaving, and we all walked out. I was the one that invited them there in the first place. I bought a replacement drink at the next bar for the one friend who had not yet finished his, but my other friend and I had been waiting with already empty drinks for the bartender's attention.\n\nI can understand why you might want a doorman who doesn't mind getting in a fight, but one who walks into the bar after a guy and makes up excuses to harass customers is not a wise choice. After going here for six months, never again. Crocodile Dundee, you are a shameful excuse for a doorman. That treatment was offensive. \n\nMurio's, if you do take action about this incident, write me a response on here so I know to update the review. I'll never go to the bar again, though.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-26", "description": "Whoever was the bar tender tonight was a total jerk. We walked in at 1:10 (they close at 2), purchased 2 beers and 5 minutes later he started kicking everyone out, saying he was closing the bar. We asked if we could finish our beers and he said no, even though we were halfway done. We mentioned they don't close until 2 and he got angry at us for pointing that out saying \"you're really gonna act like this?\" Everyone in the bar was confused as to why we were being kicked out. The bar tender ended up giving us our money back so we would leave!!! We essentially got free beers, which was a win for us, but the guy was a total jerk.", "author": "Angela B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-12", "description": "Sadly, Not a happy camper. I give it the credit that it's an eye pleasing spot with a pool table and mod print wallpaper; better than what I expected from the exterior for ambience, however, service.... Below sub par.\n\nThe place wasn't even packed and I waited 5 mins to be served only to be over charged for my drinks - on the chalk board outside listed Pliny was $7 - I got two, and my friend for a grapefruit vodka, which was $7... So doing the math (7x3= $21) so why was my bill $30?!?!? \n\nTo top that off, I asked my friend as he was ordering drinks to get me a glass of water. He ordered drinks too.. But no, this red head bartender dared to be so extremely rude to say \"water? That's it.. Water\" (... He just ordered 3 drinks from you BTW) and that wasn't the last, she then continued to say \"well, you better babysit this because I ain't filling another glass\" ... \n\nIf you are too good to serve a glass of water along with cocktails, then have a self serve area for water. What if the person dehydrated, what if that person was a drunk and needed to sober up. Completely unnecessary rudeness and poor service, that we decided to just finish our drinks and leave.", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-05", "description": "Bartender was an asshole. Whole place smelled kinda gross. I did like that it had a coin-op pool table and ample seating. Will not return as long as that asshole bartender is there. Otherwise just a normal bar.", "author": "Erika S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-25", "description": "Crooks here! Be very careful of this place if visiting from out of town. I was there March 19th in the evening for a few drinks before dinner. The scum bag bartender decided to give himself a $10 tip on my card. Luckily, my cc warned me of this and even luckier, I had the receipt from that night to verify that this bartender was committing fraud. Needless to say that on my next visit to SF, I will NOT be going to this dump for libations.", "author": "AJ D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "came to sf for the weekend.. bar was packed.. robert was legit the hardest working bartender i've ever seen in my life. kudos to robert!! legit made the experience great at murio's!! highly recommend this bar!!", "author": "Keith B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-12", "description": "Murio's has become one of our favorite bars in the Haight. It has a cozy vibe, complete with comfy chairs and a fireplace.  There is a long bar with stools and a lounge area in the back with low tables and couches. Just as a heads up, there is only one table to roll under.  This used to be a super divey bar, but you would never know it. It's one of the most accessible bars in the whole neighborhood. The front door even has automatic pushbuttons at waist level and foot level. The bathroom is humongous, and well decorated! Even the soap is within reach from a wheelchair, which is saying a lot believe me.  It has a lever doorknob and a perfectly inclusive mirror that's at the right height for almost everyone. \n\nAlthough they spruced up the place, they kept the prices at a divey level.  It won't break the bank to hang out for a few hours. As if this wasn't enough, there is even a pool table!", "author": "Shannon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-06", "description": "After a shitty experience at CHA CHA CHA, we found this place.\n\nWe were super impressed. I had a group of 6, and we were greeted by the very friendly female bartender. This place had great prices, a great bar, cool, eclectic lighting, lots of seating and pool tables in the back. Very chill experience, will be back!", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-19", "description": "We stopped in for a beer and a piss. It's a good Ol dive bar. The bartender was from Ireland, and as expected, she was very sweet. That's about all I have to say. Thanks for the beer.", "author": "Tony F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-04", "description": "Good drinks.  Sazerac = epic WIN!! I don't even like whiskey much... this is so hard to put down (on the table!) \n\nGood space.   Dim lighting, but plenty of seating in the back.  There's a pool table here, granted, I didn't enjoy seeing plumber's crack... I think men are going commando these days?!?! \n\nPrices = reasonable.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-15", "description": "We stop there 3 pm wednesday novembre. 3 peoples + us.\nIts was a really cool place, big windows. \nI was looking for a place like this during mu trip, I found !", "author": "Vincent B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-07", "description": "This place has some memories for me. \n\nI remember it when I first moved to the city. It's a place I'd find myself wandering into while waiting to meet friends. It was an always a dimly lit room full of an interesting mixture of locals and pure randomness. It was never really my kind of spot - but it had a unique charm about it - that always felt familiar and well - alright.\n\nToday I walked past Murio's and didn't even recognize it. It's a whole new place. Same location- but just with a face-lift. They've brightened it up by opening it up with windows. The juke box grins at you. There's a great lounge area to sit down. There's a pool table.  It's comfortable. The bartender is warm and welcoming. Everyone's smiling and just happy to be there. The place  - though much different from it's predecessor  - still feels familiar and well  - alright.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Great little bar with a great ambiance. The location (on Haight) is very cool and convenient to get to. The bar itself is very laid back and nice. There's a bar in the front, fake fireplace in the back, and a pool table. The drinks were good, it wasn't too crowded, and the people were nice.", "author": "Zach H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-22", "description": "Most of these recent reviews are clearly written by people who haven't been to Murio's for like a year and a half.\n\nMurio's is no longer the fun, almost spooky dive bar you are writing about.\n\nIn fact, there is nothing divey about the new Murio's.\n\nRight as you cross the threshold of Murio's you feel like you're in an upscale douchebag bar in Cow Hollow. It is depressing.\n\nMurio's WAS an awesome dive bar. It was almost cave-like and scary. I'd watch tourist stroll in and promptly shuffle out with horrified looks. \n\nI'm not saying they fucked up by changing or anything, I just want people to know this is no longer the super divey local bar everybody keeps writing about.\n\nDecent beer selection, Blind Pig on tap, which rules, lots of liquor, comfy couches in the back, etc.", "author": "Blake C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-11", "description": "Fun place to meet new people and have a drink", "author": "Mari G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "Favorite place in the neighborhood for great pint with window seats to the Haight. Great bar tenders taboot!", "author": "Matthew T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-21", "description": "This is my favorite bar in The Haight and I will tell you why.\n\nI discoverd Murio's long ago.  It was dark and trashy. And cheap and usually a cast of characters in the afternoon hours who just wanted to get drunk on the cheap.\n\nThe new Murio's speaks of what SF is becoming: shiny and lounge like with cool lighting and nice, professional barkeep, I dig it. \n\nWhat I really like is this now seems an oasis from the craziness on the street.  Back in the day anyone would wander in here, which I was fine with...but if I worked here I would have grown tired of dealing with that.  Now I feel like this polished, newer version of its previous incarnation is exactly what the neighborhood needed.  I am sure the owner is happier now too as prices have climbed and are more inline with shiny, new bars.\n\nCheck it out.  Check out the groovy wallpaper and the awesome pool table.", "author": "James S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-06", "description": "I went to this bar with friends three days ago, and it's the worst experience ever. The bartender was so wasted, they had their last call around 11pm. We had fives drinks and she tried to charge me $82 for it. After communicating for a long time they gave me a fifty something dollars bill to sign, I signed it so I could have my card back and we left. Yesterday I checked my account transition history a $86 bill from this bar went through. I tried to call the place to talk to the manager, nobody ever picked up the phone. It's really not about the money, but my experience with this place is so ridiculous I can't believe it.", "author": "Kenzo L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-07", "description": "Stopped  by here durring happy hour.  It was kind of chilly out and they had Hot Toddys on the happy hour menu.  They were rpetty good and the place is kind of divey though and I got a little bit annoyed by the fruit flies.  Other than that the service was great and the bartender was really friendly.  As far as bars go, I'd have to rate this place right in the middle.", "author": "Zorin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "Love the staff, great place for a beer and they really give back to community. I used to live around the corner and would come here for live music", "author": "Chris K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-24", "description": "Every time I wander into Murio's, something inexplicable happens. It's always the last place I end up on my way home, which is trouble enough. I've been known to shoot pool there after dousing myself in a vat of sangria at Cha Cha Cha, or strolling in for a nightcap after giggling uncontrollably over pizza at Escape From New York. Regardless of the million permutations that determine how exactly I end up there (or who I drag with me), it's this kind of safe-zone where I end up spilling my heart out onto the bar as those pretty lights sparkle above me.  \n\nI think maybe it's because Murio's doesn't impose any kind of predetermined vibe on their patrons--they embrace whoever you feel like being that night. You can relax or you can act out--Murio's will love you just the same, unconditionally. A love I'll accept, happily, for all my days in this city.", "author": "Meredith C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-06", "description": "WHAT HAPPENED!?! This place used to be great but they put in floor to ceiling windows in the front and got rid of the pinball machine! And they got rid of the dank, THE DANK!!! The only good thing is the new jukebox, it looks cool but I will not be drinking here again!", "author": "Fred F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-14", "description": "Great drinks and atmosphere, drunk bartender who over charged us then argued about it and angrily slammed the tab down in front of us. What a joke.", "author": "Evan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-27", "description": "Not to busy on a friday night and a great place to wait for a table at cha cha cha's or Prada 22 also tv with the giants game on at the moment !", "author": "Miguel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "Can't say much about the night shift here, but we stopped on a recommendation from a guy at Amoeba for a beer. The place is huge inside, but there was only about 10 people total at the bar. The bartender was awesome. He was total California bro, but not like a douchey East Coast bro. He was super friendly, gave us a ton of recommendations to check out around the Haight and had a bangin' playlist going. Prices are decent and that's about all you need to know about this place.", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Great place for an afternoon cocktail and people watching.  Bar tender was super nice and made a solid vodka tonic.", "author": "Theresa G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-14", "description": "My friend got punched in the face at this place some years back from a drunk dude who we didn't know but didn't like my friend's face. \nDive.  Yup.", "author": "Kev M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "Came here on a Friday night.  Fairly crowded, nothing crazy. Drinks were alright, but the service was exceptional. The bartender Nick was not only attentive, but I saw him working his butt off during lulls between customers. Of this is the service I get here every night, I will be back tomorrow.", "author": "Chelsea G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "Love me some Nick . Best nipples in town . Make sure he is working before you head there .", "author": "eric d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "Went here after bad experience at cha cha cha bartender was fast friendly and plain awesome. Drinks were good got super drunk ambience is welcoming! They check id so no idiot kids in there! -1 star for it being slightly dead on a sat night but then again it was memorial day weekend", "author": "Aminah H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-25", "description": "Perfect dive bar\n\nThis place was the headquarters for a scavenger hunt we attended.  Lots of fun.  This place is cool.   a true dive bar, has the total feel. Located in the lower haight.  the bartender is cool, he was loud and all over the place. Drinks, being slung everywhere, the pl;ace was loud.  perfect Dive bar.\n\nhad lots of fun doing the scavenger hunt....", "author": "Nic C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-21", "description": "There's no point in asking, you'll get no reply...\n\nRemember that episode of the Simpsons where Moe remodels his bar and starts calling it Meaux's, hoping to draw a younger crowd?\n\nThat seems to be what happened here.\n\nI give you... the new Murieaux's Trophy Room!\n\nI'm sure there's a perfectly valid explanation for the stark remodeling that took place, but it seems like they went a bit too far.\n\nI think there's something missing here now.\n\nSome grimy bit of atmosphere.\n\nMore girls seem to come here than before, it seems.  Or at least, more of a certain type of girl seems come here now, and consequently maybe less of another.\n\nYou can still park yourself at the bar in the early evening and strike up a random conversation with a stranger.  I think that was a crucial element of what made this place a fixture on the local scene in it's previous incarnation.  \n\nThe old jukebox was like a shrine to punk, metal and trashy rock.\n\nI didn't get a good look at the new jukebox, but it appears to now be a vintage-looking floor standing box with a 50's retro thing going on, and no particular taste in music being catered to.  \n\nThere was a small mixing console tucked discreetly into a corner beside the bar, implying there is still some kind emphasis on music, however.  \n\nThey still carry beers like Pliny The Elder and Blind Pig on tap, which is nice.  Of course, there's a chance that the newer bartenders don't know what those are.  I saw one of them start making a Bloody Mary once when a guy walked up and ordered a Pliny.\n\nThe big windows now flood the front area with daylight, which glints winsomely off all the new, shiny, brushed metal surfaces.  There are trophies of various types lining the shelves behind the bar, playing on the name as decorating theme.  \n\nI guess this is still a comfortable, convenient place to stop in for a beer or two, but the overall brightness and shininess kind of robs it of the distinct ambiance it once had, however.\n\nThis place used to be a squalid yet lively dive bar, and now they've cleaned it up and made it pretty.  \n\nPretty vacant.\n\nAnd we don't care.", "author": "Gopal R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-22", "description": "Let's be clear: Dive bars are my favorite. You won't catch me bitching about the lack of ambiance or the service at most places. I like it chill, unpretentious, and quiet enough to hear my friends. \n\nHowever...\n\nWalked in last night with my husband. It was 8 pm, there were maybe 10 patrons and it was half empty at the bar. After two minutes, we realized that the (lusciously busty and happy to lean over while serving so that all could admire) bartender was too busy doing shots at the other end of the bar to be bothered to notice we had no drinks in front of us. No one was demanding her attention. Two more minutes passed, and there was a loud thunk that could have been a top heavy bar stool hitting the floor. Nope. It was a top heavy patron who had fallen backwards off his stool, landed on the back of his head, unconscious (his eyes were unblinking, glazed and open). It took four guys to get him up while My husband hovered over the phone ready to call 911. Once he was up, we decided to leave since we hadn't even been glanced at. As we do, we overhear the boozy bartender lackadaisically slur, \"is his head ok?\" No. No, it's not. The sound it made bouncing off the floor made that obvious. \n\nShe should be fined and fired for serving him. \n\nWe won't be back. Bummer. We went down to the bridge-and-tunnel-set Hobson's instead, which was fine.", "author": "paige m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "Can understand the upset folks below after a remodel of their favorite dive, but I'm a local and I love it! I think the Haight has enough of the old school dive bars to go around, and a little remodel never hurt anyone. Let's be honest, the remodel won't last forever and soon enough, it will be back at it's old divey dive status.\n\nGreat place to bring your Off the Grid food when it's cold and windy, and also home of hot bartender Dan. The poor guy dealt with a group of crazy ladies pre-bachelorette weekend and was a true gent. A great establishment, happy to have in the neighborhood and with some great eye candy.", "author": "Kate V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-07", "description": "My friends and I came here on a Monday afternoon to hang out and relax.  It was my last day in SF before returning home, and the place was really inviting with cute decor and plenty of space for us to sprawl out in the back. \n\nTheir happy hour was really good as well.  I was happy to discover they had bloody mary's for $5 - how can a girl pass that up.  Even better was the mix and drink snacks that it came with.  The bartender prepared a tasty, spicy bloody complete with lots of olives and a pickled asparagus spear.  SO YUM!!  Not gonna lie, I totally had 4 of these and thanks the bartender for her awesome bloody mary making skills. \n\nMy friends enjoyed a few beers and sodas (not everyone drinks, yo!)\n\nThe pool table was really tempting, but chatting with friends you don't see every day was more important.  However, as a pool player, the table looked well kept - so I would come back and check it out the next time I'm in SF.", "author": "Jaci H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-21", "description": "Really nice bar in SF, has a pool table. Cocktails start at $10 and beer on tap starting at $8.00. Hung out in back area with tables booth chairs", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-18", "description": "I've lived in the Haight for the last four years and I've seen this bar change from that lovable dive in which you might get stabbed, either by a regular or a well-worn bar stool, to the slightly trendy, slightly hipster, well decorated hotspot it's become since the remodel 2 years ago.  I like this bar.  It's a good bar.  It still feels like a neighborhood bar, in spite of its shiny new decor.  The cocktails are unpretentious and tasty, the beer selection is always good.  It's so good, in fact that a friend and I came here on the last day of SF Beer week 2014 to get a taste of the coveted Russian River Pliny the Younger.  It was also among the worst experiences either of us have ever had at a bar.  \n\nWe knew that Monday was when the keg was going to be tapped.  My friend had the day off and got there around noon to see when it was going to happen.  6 was when it was supposed to happen and my friend hung around, alone at first, until I was off work and met her at around 4.  We both spoke to the bartender about how crazy Pliny tapping is, how annoying it is when everyone's asking about it, even when the sign out front says \"Pliny tapping at 6.\"  We joked and agreed with her about how overhyped this beer probably is, but that we've had yet to try it so we just wanted to cross it off our list.\n\nI've often been in when Alma is tending bar, and she's been a capable enough bartender.  We bantered a bit that day, and at the point I arrived, she knew my friend's name and understood why the two of us were there.  We were having a great time joking with the others who'd been sitting at the bar for hours hoping to claim the same goal.  By the time 6 hit, the bar was packed, with hands waving in the air, everyone trying to get a taste from the pony keg the bar had been allotted.  \n\nIn any situation such as this, one would think that the 'tender would do some serious triage, attending to those bar patrons who've been sitting at the bar for a few hours first, then taking orders from those who clearly pushed their way upon the bar in only the last few minutes.  It was the exact opposite of what happened.  She made two meager sweeps of the bar, passing up several of those sitting at the bar in favor of others who had just arrived, often without even the mildest of acknowledgment.  Both times she came by our end, I flagged and waved, asked for two servings, got a nod, and... nothing.  The second time she cam around, the same, only this time our neighbors helped out, telling her that my friend and I had been waiting to be served.  She, looked, nodded and... nothing.  She returned to the tap, began serving others, again.  Seconds later, reaching for more glasses to serve other patrons... Foam... \n\nThe Pliny was gone, neither my friend nor I getting served, while several others around us, who had pushed and crowded around, were given 4, 6, 8 servings.  Many of the people sitting at the bar didn't get served.  Even after mentioning, \"Hey, what gives? We've been here for hours,\" all we got was a hapless shrug and the most insincere of apologies.  To be fair, it was gone, but to have been so blatantly ignored was bordering on gross incompetence.  \n\nAgain I like this bar, I'll go back, but I'll either walk right out if I see Alma behind the bar or insist for another tender to help me.  You should, too.  If you see a short, olive-skinned woman with long black hair behind the bar, leave.  Wait for other bartenders to be there, they're far better at their jobs.", "author": "Lewis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "Murio's....Oh, how I miss you!\n\nI used to work right across the street, and go there with friends/co-workers for pau hana (after work drink). I actually got the second drunkest I've ever been there....whew....crazy night.....ANYWAY...If you're a people-watcher like me, this is a great place....Though, while people-watching, you might get punched in the face by someone that doesn't appreciate being looked at....................at all. The drinks are strong and affordable. The best and worst of San Francisco's bartenders work here...You can go during the day and be totally ignored by some hipster dude that thinks he is WAY too cool for YOUR tip!....Then, go back that night to get the friendliest service from the hottest female you've ever laid eyes on!....Either way, Murio's is gonna be a TRIP!", "author": "T. G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-29", "description": "Used to be a dive,but no longer. It looks more like a marina bar with small tables and a large glass front.\nAt least they kept the pool table. But I will miss the telephone booth.\n\nHowever bathrooms are 100% better if you are in need so keep that in mind. But you won't find any of the locals here.", "author": "Timothy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "Visiting from la with my gf and we started our night here. Stayed way longer than I expected. The  bar is kinda divey but pretty nice. There was only one bartender but you wouldn't even notice cause he was so damn fast. All n all good times at this joint. Highly recommend it.  Cheers.", "author": "Esteban C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Fun little \"dive\" bar! Its like an upscale dive, if that exists? Anyway, had good service, good drinks, and their drink specials for the day were tasty. A good spot for people watching. It appears they are pet friendly, someone had their cute dog. Area with couches in the back looks like a nice place to hang out with friends.", "author": "Amy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-27", "description": "Where is the lingerie? I walked into what used to be one of my favorite dive bars to find this newly redecorated and rather pretty little shop. It has lots of lovely seating areas for your companion(s) to wait as your browse and a fancy little bar right where the old one used to be. The pool table is even still there but I can't find where they've put all the fancy underwear for sale. What kind of fancy shop is this if I can't find the merchandise?\n\nAs much as I loved the old place, I have to say, \"bravo\" on the new bathrooms. So, \"Bravo.\"\n\nOh, and be careful to not hit yourself on the big ornament thing in the back. Oucharoo!", "author": "Loli L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "Being from New York, this is exactly the type of crunchy place I try to avoid, but I embraced the SF/HA culture and enjoyed my two trips to Murios. \n\nHaighlighted by the pints of Pliny and pool table, it's a good time.", "author": "John E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-07", "description": "I always love stopping into Murio's when I'm in SF.  I miss the old dive-y Murio's, but the renovations certainly don't keep me away.  I definitely prefer drinking here in the middle of the day when the crowd is nearly nonexistent and I can just sit back and relax.  This place seems to be packed with hipsters at night and the dj will drive you crazy with his loud music.  Kids these days...  \n\nThis place makes me feel like an old man.  I drink in the daylight hours and I think the music is too loud.  Awesome.", "author": "Todd S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "You know, I remember walking down Haight on my way to Amoeba and looking over to Murio's and thinking it must be full of 1pm drunks inside!\n\nSo, the day I was here, I was just out of options. I didn't want to go to Kezar, or Milk, or Alembic, so what the hell! I was celebrating something special as well!\n\nSo after getting ID's I walked in and to my surprise, either Murio's just got re-decorated about a year ago, or it was always like this and I never noticed! It's second to being the fanciest bar on upper Haight! It had such a romantic vibe! Yes, Upper Haight bar. Yes, you read it. Not a dive bar, not even 1pm drunks lingering. Mostly couples or big groups, hell, not even gay it seemed.\n\nI was amazed by the decor. Something about it just felt so romantic. Go here for a date or something...take your girlfriend here and kiss her in the backroom.", "author": "Alexia R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-12", "description": "Ended up here after getting off work early and finding that not only was Hobson's Choice closed, but so was every other bar along the way.\n\nInside the pretty dark bar, the world cup was on multiple tvs, and there was a decent amount of people for the time of day.  Maybe because everything else was closed.  It was a nice surprise to find that happy hour not only started at 12pm, but went all the way until 7.\n\nThey have a good selection of beers, including some semi-rare Russian River Brewery ones on tap-- Pliny the Elder and Blind Pig.  I had a glass of the Pliny, and eventually a bloody mary.  \n\nThe bloody mary was pretty good, definitely not just some Mrs. T mix.  There was a good amount of horseradish in it, and it came with not just a green olive, but a green bean and asparagus spear as well.  Pretty tasty!  And couldn't be beat at only $5-6.  Not stingy on the booze either.\n\nThe bartenders seemed pretty nice there.  I'd go back if I was looking for a drink around that time again, but something about the dark atmosphere kinda throws me off.", "author": "Jon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-18", "description": "A great Hole in wall watering hole. \n\nFun atmosphere. \n\nand Cheap drinks in sf? Score! \n\nIf you have a particular libation you would like, they can do it. \nif you have a particular liquor you are craving, but don't know how you want it... they will take care of you. \nit's great for an indecisive person like me! :)", "author": "Judy N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-17", "description": "Visiting from Houston  and was pleased to hear some old school hip hop so I wandered into this bar. One bartender was a total douche and glared at me after I accidentally took the wrong shot (he placed it in front of me, so I drank it) and harrassed me for taking his \"good tequila\". But, I got about 5 min of quality twerking in then went on to some classier joints down the street. 2 stars for playing Tupac.", "author": "Erin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "My second living room while I was to chef school in 92 to 93. Awesome and friendly staff. Great strong drinks. Juke box is awesome as well. Great place to meet hot girls with tattoos and great attitudes towards sharing heh. Love this place.", "author": "Ray S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-28", "description": "Somebody needs to update the entire album on here for Murio's..... it sho' doesn't look like most of the posted photos no mo'. \n\nIt's really pretty now though... I'm like a flyyy flying towards the lit lantern. Before it used to have one of the nastiest bathrooms at a bar in SF (next to Zeitgeist maybe). Now.. I don't know, guess I'll have to pay a visit just to check out the bathroom.\n\nIf you don't like being spotted at a bar, you better not go. That's right, they made big a WINDOW out front now....patrons are now on display.", "author": "Faffy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-23", "description": "Oh Damn I think I'm in Love!\n\nDefinitely a dive bar gem!  It was Sunday night when my friend took us here after a dinner at Cha Cha Cha's a couple of doors down.  There's one pool table and a sign up board where you can put your name down to play some pool.  They have music playing and there's plenty of places to sit.  They do have dollar beer night, which is awesome, and the drinks weren't too highly priced either.  It wasn't horribly packed and there were random people walking in at different times during the night. I think a little bit after midnight all the barstools were taken up so this place gets decent business - even on a Sunday night!  \n\nOne of the girls in my group wanted a group picture and this random girl offered to take it.  I thought that was pretty cool of her...  and then as she is about to take a picture she pulls down her tube top and totally flashes us with her booby!! whoah! I think my friends and I got a little shocked but we all laughed it off.  Entertaining I guess?\n\nOf course.... not everyone may see it the same way I do.  I'm just a sucker for dives with good vibes, a chill atmosphere, nice and interesting characters, good prices and good drinks!  And good-looking bartenders (whether straight or not) doesn't hurt either.  :)", "author": "Mercy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-13", "description": "As a person who spent a lot of time at Murio's around 2000, it pains me to say that I actually like the redesign. Roy is right that Murio's really was the last excellent dive bar in that area and definitely had its own vibe to it. Now it may as well be any bar, but I don't necessarily think that's a bad idea.\n\nFirst, the bartenders still kick ass. They are funny, nice but still have a biting sense of humor and know how to mix you a drink.\n\nSecond, bathrooms. Ok guys let's be honest--how many times did you go to Murio's because you had too much to drink at Magnolia or somewhere else and you really needed to pee? I think in 1999 that's how I actually discovered the place in the first place. Well now you can do that in three very clean bathrooms in a bar that's still kind of cool even if it's no Zeitgeist.\n\nThird, they have Pliny on tap. That definitely means something.\n\nFourth, the pool table is still there and I have tons of memories attached to that thing.\n\nAnyway, if you didn't go back in the day you'd probably think--oh this is just a nice mostly clean, dark-ish bar. If that's how you approach it good for you. But for me it'll always be Murio's even with the new facelift.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-30", "description": "It always starts so innocently. You're minding your business and taking a stroll along the Upper Haight on a weekday. You are perhaps thinking of the Gaza Strip situation or your hair or about calling that dude who lived in that flat on Fell a few years back because he was smokin' hawt. You smile wistfully at the entrance to Golden Gate Park. You pass by McDonald's and Amoeba. You step over panhandlers with dogs and cardboard pleas. You are not phased. You are a seasoned, jaded city rat.\n\nYou see the chalkboard sign in front of Murio's that boasts a liberal definition of happy hour. Their happy hour lasts from noon to 7 and they, the good people of Murio's, will provide you with a well drink or beer of your choice for just three dollars. You say, \"Why thank you, Murio's! I think I will have one to wet my whistle.\"\n\nThen many pours later, you find yourself cradling your chin very close to the bar and finding the Fox Soccer Channel as captivating as a telenovela. The bartenders, some of the most sarcastic and friendly folks in the city, are cracking you up. Your walk has lasted several hours, and most of it took place from the barstool to the bathroom, you lush.\n\nBut is there any better place than Murio's to come to this realization about yourself? There is not.", "author": "Kimberly V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "Great nice looking dive bar. Descent selection on spirits and GREAT BARTENDERS. No I am not related or go out with any of the staff. There just very good staff.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-11", "description": "Longest trek to a DYL.  Ever.  At least, in my relatively short history of DYLs.\n\nSo the night started off interesting- walking in the Prop 8 march.  As the lovely Pilar and I knew our adoring fans were waiting for us, we veered off and attempted to get on the N-judah.  Which we did...and then it stopped.  But HEY- yet ANOTHER person who I haven't seen since high school was on the SAME TRAIN.  Spooky.\n\nWe ended up jumping off and hiking the rest of the way, because spending the evening trapped with the woman who would NOT SHUT UP is not the way to go.\n\nAnd then we entered Murio's.  While I wasn't impressed at first, the more time I spent here allowed me to scope it out and acclimate.  The drinks were so-so, and while I know it's to stay true to the \"dive bar\" atmosphere, why oh why can't these places take credit cards?  I hate carrying around cash, I'm a skinny white girl who most likely will get mugged soon.  Although they did have a cool sign behind the bar explaining WHY they don't take credit...but I can't remember what it says.\n\nI liked the christmas lights on the ceiling, although I wasn't impressed with the sturdiness (or lack thereof) of our table.  \n\nIf there's another DYL here, I MIGHT go...but it's highly unlikely I'll trek out here on my own.\n\nGreat to meet some new yelpers, though!", "author": "Pam S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-18", "description": "Where is the dive bar that I know and love?! Where do I now get my $2 Hamms? \n\nI haven't been here to see the new-remodel so I honestly don't know how I feel about this \"new\" Murio's yet. But iI'm all for re-vitalizing the neighborhood. If it's good for the goose, it's probably good for the gander.", "author": "Melissa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-11", "description": "It was my first time. I'd never done it before, but I'd spent all day getting little suggestions talking me into it. \n\n\"You'll LOVE it.\" \n\"It'll hurt a little at first, but you'll get into it.\"\n\"Just relax, it'll hurt less.\"\n\nI agreed. I was a little apprehensive, a tad nervous, but a bit excited. Almost giddy.\n\nI am, of course, talking about my first DYL. Which went down at Murio's. Home of nicely priced drinks, a kickass jukebox, crap on the floor, and doggies gently lapping the ladies' room toilet. Oh, and the pool table where Tanner handed me my pale Irish ass.\n\nGreat wee dive bar in the heart of the Haight.\n\nAnd yes, I was careful, and wore protection.", "author": "Gary E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-11", "description": "Friday night started out a little hectic, in that on my way to the city my longtime mohawked-out friend from military school (I love how they breed us to rebel aftewards) called and asked if I could help her pick up her new furry little animals in Millbrae. After a half hour of breaking down the cage and it's components, we drive up to the city and park near the bar. \n\nThen, the craving hit. Again. McDonalds. OMG. \n\nI don't know if it was because I was reminded of Quinn's Zombie Movie Night and me scarfing down a Big Mac (they said bring your own food!), or if it was the temptation of salty, greased up fries I could delightfully nom on...but the craving was there and I had to have it. \n\nSo I walked into Murio's with my hand in a McDonalds bag, eating fries and a Southern Style Chicken Sandwich. Drinking a Stella. \n\nI give this place three stars because for most of the night, my friends would come over and say, \"is it self serve? Because I don't see a bartender here.\" \n\nAlso, invisible negative stars for the dog who was my best friend up until I finished eating my chicken sandwich, at which point the MOMENT I put the last bite in my mouth, he got up and left. Everybody uses me. Even the dog.", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-02", "description": "Ok look, if I go in a shithol...errrr... dive bar and I order a martini straight up with olives and you serve it in a whiskey glass, that's a problem.\n\nIf, later on in the evening, a pool ball is accidentally hit a little too forcefully, flies across the room, and hits said martini so that the glass explodes upon impact at which point you hand me a broom and tell me to clean up, it's no longer just a problem:  it's a fucking issue.\n\nFuck you, Murio!", "author": "David O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-14", "description": "I never made it by in its former incarnation, but I can say the end result is pretty decent. Bar on the right with cool lights, a few tables on the left, pool table at the middle-back, and then a cool lounge zone at the very rear. That was occupied by a birthday party reservation on my visit- slightly annoying for me, but good to know you can book that space. Crowd/vibe hard to pin down for now, but overall comfortable.", "author": "Thomas R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-30", "description": "When did I get so old that I prefer a dingy dive bar to a \"cooler\" bar? Well anyways, my partner and I hopped into Murios for one drink after having dinner in the Haight on a random Thursday evening and it was everything a dive bar should be. Clean but looks like it's not, pool table in the back, patrons older than 21, reasonably priced drinks, cool bartenders, and a \"welcome all\" vibe. We were able to play a couple of games of pool before we had to give up the table to other people so that was pretty cool. We ended up having drinks there for the rest of the night, we were so comfortable we didn't want to leave right away. All in all, it's a cool spot to have a few drinks.", "author": "Melina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-10", "description": "So I end up spending a lot of time in the Haight, mostly waiting for friends at Amoeba.  No, not waiting to score \"nuggets\" or whatever else those people are pushing (There's no wait for that anyway).\n\nSo I wandered over to Murio's.  Yeah, it's Dive-y with a capital \"D\" but the bartenders couldn't be nicer, from the obviously lost tourists (\"Where's Golden Gate Park?\"), to the \"regulars\" that come in and pay with quarters (\"Don't worry, I tip in dollars\").  Yeah, they do Happy Hour from 11-7 and beers are $3.50.\n\nNote that Murio's was a tennis shop back in the day, thus the giant racket behind the bar.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-23", "description": "Went to this place rather early in the evening, sat down at the bar, and had an apple cider. As I was looking around I noticed that they had caricatures all over the ceiling with different sayings and suck. This made being in the bar so much more humorous. Wish I knew the gals name behind the bar, she was sweet.\n\nwould come back here again", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-09", "description": "It's a nice, chill place to hang out in the neighborhood, pool table and all. Not 100% sold on it or the crowd though, so we'll have to see what I think next time.", "author": "Rowena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-16", "description": "I have spent a many afternoons in this lovely refreshment stand.\nHamms for $2. Pabst on draft. Full bar. The Irish coffee is the best one I ever tasted. \n\nIt is pretty much a must stop if you spend the day in SF. I can't think of many people who do not enjoy a day at amoeba music, followed by a couple drinks in a dark bar with a good juke box.\n\nmaybe that says something of the crowd I tend to run in...", "author": "Rossi H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-25", "description": "I was physically attacked in Murio's, because my buddy and I were wearing Tigers gear during the World Series. On top of that, when my eye was bleeding and swollen, the bartender, who was shitface drunk, DENIED ME SOME ICE. He told me I was in the wrong place. This is after I had been there for a few hours and bought a couple drinks, with commensurate tips.\n\nA bunch of actual humans finally stepped in and helped us out. A police report was filed. I and friends and co-workers had been going here for years. \n\nLastly, they have a jukebox that is plugged in and lit up and will take your money, but is not connected to any speakers or anything, so it won't even play your music! If that isn't the epitome of underhanded and shady -- at best -- I don't know what is.\n\nThis shit hole was better when it was a shithole!", "author": "Steve I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-13", "description": "Used to be a great dive bar. Closed down and reopened as the douchiest place in the Haight. Seriously, the ambience would be best-described as classic Marina. Didn't even bother ordering a drink when I walked in.", "author": "Steve K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-03", "description": "LOVE this place.\n\nAfter lunch, my friend suggested we pop into Murio's for a Bloody Mary.  I'm always on the hunt for a great Bloody Mary, and most places inevitably disappoint.  \n\nNot Murio's!  Oh man.  They know how to mix a Bloody Mary!  Just the perfect amount of heat and tomato with all the perfect accoutrements!\n\nThe is the dive bar of dive bars and if I were you, I would pop in there on a rainy San Francisco day, order a Bloody Mary and enjoy.", "author": "Sara B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-29", "description": "Yeah, I dig this place. Could it be due to the residual ganja aroma, man?\n\nThat, and there are some damn good billiard playing dudes here.\n\nI guess that's the reason for the trophy crap all over the joint. \nBut, they also have a damn good jukebox. And, if you look up at the ceiling, you can find some pretty funny cartoon artwork; coulda swore I found a pic of myself - never mind. \n\nI like this place because it's not crowded. The people here are chill (wonder why). Spot cool doggies that are allowed to wonder in and out.\n\nSo, I don't think you will like it here. I'm here. You won't like me; I'm old and hate hipsters.", "author": "Kara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-15", "description": "They have Pliny the Elder! Nough said! Good mix of neighborhood bar and nice atmosphere. Fresh sqeezed juice in their drinks.", "author": "Matthew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "No...you didn't, you wouldn't dare.......you did!!!!!!!!  NO!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nFirst the GAP, now this.  I remember during the dot com era when all the window displays were so perfect, like a wannabe Chestnut street.  It was a scary time in the Haight, but slowly, history prevailed and the landmark Haight perservered.\n\nWTH did you do to my beloved Murio's, the last real holdout of trashy historical dive bars left in the upper Haight?  It was a toilet, it was a drunktank, it was edgy, it was freaky, it was real...I loved it!  I miss it.  In the words of Sally in the Peanuts Halloween episode where they cut up the pumpkin in preparation for carving, \"You didn't tell me you were going to KILL it!!!!\"\n\nI should have known something was up when I first saw all that wood covering the front recently.  I figured they were doing some minor changes or exterior mods, but never in a million years expected this.  Have to admit though, they did an amazing job!!!  Honestly, the first time I saw it, I did a real double-take.  I literally took a step back and looked at the outside to make sure I really was at the right place.  Visually, it is pretty darn impressive.  Whoever handled the re-do more than accomplished what they were paid to do.  Hell, whoever did it was a G.D. magician!  This place looks so nice inside.  The makeover is gorgeous and had I been blindfolded and brought in, I would have sworn up and down that there is no way it could have been the same place.  And yet, with all the cleanup and upgrading, we lost a little part of ourselves along the way.  The crowd is obviously very different now and the place looks and feels nothing like what it had been, both good and bad.  \n\nI have countless memories of drinking here over the years, in the day and the night, fun times shooting pool with wild alcohol abandon.  There must be a ton of lost souls in the area...where will they all go now?\n\nA cynical friend of mine said that if he had wanted to go to a place like this, he would have gone to the marina (or perhaps Martin Mack's) and that there are plenty of places like this already, so why kill a historic dive?  Personally, I  really like how it looks in there, but only wish it had been anywhere else on that block.  I also have serious doubts if the customer base in the area can support what the new decor of this establishment aspires to be.  Curious to see which way all this will go once the place finds itself and the customer base finds a natural level.  What type of crowd will frequent this place?  Only time will tell.\n\nLike they always say, change is inevitable and there is nothing as inevitable as change.  As to whether it actually can be considered progress remains to be seen.   Popped in here for a quick drink the other night, but didn't stay long since I was too shocked.  I still have mixed feelings so will keep my review rating exactly where it is until I go back a couple more times.  \n\nLike I said earlier about Sally in the Peanuts cartoon...\"You didn't tell me you were going to KILL it!!!!\"  What next?  Lucky 13?", "author": "Roy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-10", "description": "murios is MY BAR. \nI've been frequenting the place for almost 7 years.\nwe recently moved out of the city so it's off my path now, but it's one great dive bar.\n\nthere have bee epic bartenders there. from jason to mike, to eric. \nthe owners is the nicest sweede on the planet. \n\nthe people that come in and the people you meet are priceless. the juke box has always been great. from butt-rock to mexican pop.\n\nthere will always be a special place in my heart for murio's. \nand rest in peace water fall. (tim)", "author": "Brandon V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-08", "description": "They went and fucked it up. Sunlight should never be seen in a dive bar and now it looks like the typical Starbucks style of San Francisco \"everybar\".", "author": "Gregg D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-23", "description": "This place is terrible since the redesign - no more punk rock jukebox and instead have decided to play some awful mix.  No more dive bar feel -looks like a yuppie bar. Even the bartenders look depressed and I can't blame them - I wouldn't want to be there either.\n\nSticking to the Gold Cane and other bars that still have a somewhat of a real feel to them.  I want my Haight back!", "author": "Mark K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-28", "description": "I've changed my mind about this place. This bar really bums me out.\n\nThey are usually understaffed. One time I was here for dollar beer night and they just had one lady working the whole bar. I felt really bad for her because the place was packed.\n\nThis bar is also absolutely filthy and crackheads/bums like to hang out in here too.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-10", "description": "The last cool bar in the upper haight has turned into another yuppie tourist joint.  What was once a jukebox with the Reverend Horton Heat has been replaced with trendy \"unst-unst-unst\" music.  It's not only a remodel, but a finger in the air to anyone who once hung out here saying \"Stay away locals, we're only appealing to tourists now.\"  Don't bother unless you're here from the mid-west and only want to see the Fisherman's Wharf version of San Francisco.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-09", "description": "thought the place really needed to facelift, but this may have been a little too much....  the new front windows bring in so much light (with the walls reflecting), it's tough to call this a dive bar anymore...\n\nall they needed to do was get the gross smell out of there!", "author": "Colin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-15", "description": "After Opera in the Park, we need a drink...and what better place to quench our classy/thisty selves than Murio's Trophy Room in the Upper Height. \n\nSeveral bottles of wine were polished off at GGP but we were just buzzed. Still though, a situation like this calls for a tall boy of PBR...actually 4-5 of them. The last ones standing were me, Theron, Adrian, Nadja and Jessica. Unbelievably, the girls kept up w/ the guys despite being 1/2 our size. The patrons of the place are eclectic. They range from dirty hipster to dirty hippie to dirty biker to dirty scenster. I felt right at home. \n\nThe highlight of the day...or was it night already?: \nJessica goes up to some gorgeous woman and asks, \"If you're interested, I'm sitting w/ three guys who think you're hott.\" Most girls I know will claim to be a great wing man, but I have not seen much to justify this boast. I saw it that time. \n\nNow as for the rest of our com-padres. After they left, one of them took a \"nap\" close to the park. I later found out that she woke up surrounded by traveling homeless Height kids and their dog. I guess drinking a gallon of PBR didn't sit well w/ her. As for Goose, she called in the next day claiming that me and Theron are \"bad influences\". Psha, I say....psha.", "author": "Angelo F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-13", "description": "NICE bartenders ,friendly place,great prices and it has a pool table. I choose this place over every other spot on haight st!!!", "author": "Kristopher M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-19", "description": "So this is going to sound bad, but it is the truth...\n\nThis is my go to place after my weekly doctor appointment.\n\nWell, I don't go every week, or even most weeks, but if I'm going to a bar after my doctor appointment, this is where I go. \n\nThe service is mediocre, but the drinks are cheap. It is next door to Amoeba and Cha Cha Cha, so you can grab a quick drink before a show or before dinner without spending all the loot in your purse. PLUS it is great for people watching...I mean, come on...it IS The Haight.", "author": "Chia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-06", "description": "This place was fun.\n\nWe'd started the night with a slightly smaller group (6) at The Alembic, but some Mac and cheese and fries later, the growing size of our asses told us we  should move on.  Ended up here because the giant sign beckoned to our group of 10.\n\nCheap beer but cash only.  $4 might not be super cheap for a pint of beer, but after $15 martini's and $12 for a basket of fries with mayo for dipping, I'll take $4 stella anyday.  When we left, we heard the doorman say \"well, there goes half the bar.\".", "author": "Kathleen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-20", "description": "I actually visited Murio's quite a while ago, on my last trip to the bay in August.  Thinking back, I am amazed at how drunk I was on this Saturday afternoon before even entering this fine establishment.  But that's also the main reason as to why I wasn't able to Yelp about it until now- I could not, for the life of me, remember the name of this place until Jessica T was gracious enough to Yelp it and bring back a flood of memories for me!\n\nMy day began innocently just a few miles away at the Toronado.  After a good number of pints here, we were on the bus to Amoeba Music to pick up some new jamz, as well as some proper old school funk.  A friend suggested we stop into Murio's afterward, to keep the buzz going.\n\nI was greeted with an ice cold, refreshing can of Pabst Blue Ribbon which was presented nicely in a brown paper bag.  How can you say no to that?  Anytime I have the opportunity to drink out of a paper bag, I jump at it.  Whether I need that drink or not, if it's in a bag, I'll put it in my mouth.  And when it's a house special, for a low, low price- even better!\n\nI vaguely remember some hot tunes pumping out of the juke box, making a relatively docile daytime crowd bob their heads and sing in unison the chorus of Stairway to Heaven.\n\nI definitely plan on making another trip to Murio's, and I hope the next time I'll remember a little more of it.  Looking at some of the fan photos, I was thinking to myself \"so THAT'S what the place looked like!\".  Ahh, the wonderment of alcohol, you gotta love it.", "author": "Sean L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-28", "description": "Me- \"I'll have a Maker's, no ice\"\nBartender- \"OK, that'll be $6\"\nMe- (Double-take)\n\nIn conclusion, If I could get a glass of Maker's anywhere for the price of a beer, I would have a criminal record.", "author": "Ryan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-21", "description": "Used to frequent Murio's a lot more than I have recently, but it's always a good place when I can't think of anywhere else to go.  Good tunes are always playing and they have Jello shots for a buck.  rock on.  One of the bartenders is kind of a dick, but I think that his \"thing\" - one time he was showing off and whipped a bottle cap off - it smacked me on the face next to me eye...I asked him to buy me a shot to make up for nearly blinding me...he didn't see the humor in it.  Whatever...I still go there.\n\nUpdate: no more Jell-o shots served here.", "author": "Mac M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-23", "description": "I went here last night after an absence of several years ... even though I live nearby ... and I wondered why I had stayed away so long.\n\nIt's the perfect dive bar. Nice bartenders, great jukebox, interesting patrons, good conversation, a World Series game and ... a happy hour that lasts from noon to 7 p.m. I enjoyed my $3 dirty martinis.", "author": "Kim C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-05", "description": "OK....Murios is reopened and I can report that I have been there twice for drinks.  The interior has been gutted, the ceiling lifted, and the walls replaced with very modern looking wallcoverings.  There are fancy light fixtures and a loungy area in the back to hang out.  That said, it is still a BAR, and a place for cocktails.  \nYES, as reported, the Pliny the Elder is no long on tap.  HOWEVER, the bar does have Blind Pig IPA on tap still, which is also made by Russian River Brewing Co.  This gives me hope that the dearest Pliny will return in the near future (Haighters, you can find Pliny on tap at Tornado and at the Page).  \nFrom a price perspective, it does seem as if it is a little bit more expensive.  The first time I went we drank some Blind Pigs, and I believe those were in the standard 4-5 dollar a pint range.  But I was, um, not sober when I walked in there.  \nI went last night and had a few Manhattans while my wife had red wine.  The wines have been upgraded it looks like to decent brands--$7 a glass with a nice pour.  My Manhattans (using Bulleit bourbon) were also healthy on the booze and clocked in at $7 per drink.  Seems like a bit more than I remember paying at the old Murios, but still not bad at all...\nFor now, the place seems to have kept its roots while upscaling a bit.  I will keep an eye on this one.", "author": "Blake W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-30", "description": "I loved this bar. It was the dirty dive bar where people would tell there children not to walk to close to the door way when passing. The type of place you couldn't see how pretty or ugly the Pearson next to you was with or without your drunk goggles on. No windows for descent folk to judge your drunken ways while you just leave net working and your responsible life aside for the night. It would be hard to act so bad to be 86 d from this joint. Well not anymore. It looks really posh and clean with big windows and well lit. I'll get back to you when I give it a shot if they will still serve the likes of me a shot. Nick the bar tender is still there thank god and he is a riot.", "author": "Justine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-30", "description": "Oh Murios. We go way back. Back when I was 17, thank you for never questioning my id. NICK!!! I love you and miss you. Thank you for all the awesome bar stool chats, cheap strong drinks, and hilarious antics. This is a great dingy dive bar with a good juke box, interesting characters, darts, pool tables, and a bathroom with a western theme swinging door. Nick, Kristin says hi to you an Autumn. (:", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-14", "description": "Once of my favorite bars in Upper Haight! Lots of room, great happy hour, and awesome vibe. The pool table is also a plus. I always have fun at Murio's.", "author": "Bridget B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-18", "description": "With my mug, I don't have any delusions that pretty hipster bartenders will fawn over me; however, on the dreary afternoon that my associate and I skulked into this establishment, we were met with a murderous glare akin to that of a menstruating honey badger. The bar was nearly empty: one patron at the bar, and a table of four near the pool table, quietly conspiring. The bartender peeled her gaze away from her cell phone, looked up expectantly, and when it registered that we were not who she hoped we'd be, the change in her features was audible; you could HEAR her hopes crash to the grimy, wooden floor. She grunted a greeting. My friend and I saddled up and ordered two Pabst drafts, she pulled them, threw the coasters down on the bar, and slammed the two pints in front of us. Then, she went back to manically texting.\n\nThe bar itself was unremarkable. It could have been a bar on the southwest side of Chicago. Or Milwaukee. Or Boston: dark wood, Christmas lights, mirrors, artwork scrawled on napkins by patrons over the years, signs issuing various warnings (don't be an asshole, \"Tip the Bartender, Bastards!\"). For this reason alone, the atmosphere was friendly enough.\n\nI grew up frequenting the bars of the southwest side of Chicago that Stuart Dybek wrote about in his stories in Coast of Chicago - the places that offered bowls of hard-boiled eggs and peanuts at the bar, the places that Polish, Italian, and Irish families spent Sundays commiserating with friends and family. I base the quality of an establishment like this by how quickly I can engage in a friendly conversation with the bartender or patron upon entering (usually about local sports, but not always), and I've applied that litmus test to neighborhood [read: \"dive\"] bars I've visited in all other cities throughout the country. For example, at Mr. Bing's on Columbus where we went the night before, Bruce, the Bartender, greeted us warmly and invited us in to watch the Giants game within 10 seconds of us walking in. We paid a LOT more for drinks that night, but stayed much longer... Hmmmmm... I bet you are wondering why...\n\nMeanwhile at The Trophy Room, the jukebox was playing Radiohead's Kid A in its entirety, and I proceeded to try to convince my comrade that, despite his issues with any music recorded after 1975, this album was a damned good one. My efforts proved fruitless. Our conversation went from music to the temperature of the beer in drinking establishments (he commented to me that he felt his Pabst was warm. He bought the beer that day, so I had forfeited my complaining rights). He remembered hearing from a friend of his in Amsterdam that, on bottles of Heineken, there is a suggested temperature that the beer should be chilled, and that if it is any colder, it compromises the flavor. He asked the bartender, who at this time was busily chatting up a friend who had entered bar and took a seat near her at the end of the bar, if she might grab him a bottle of Heineken -that he wasn't going to drink it, but only use it for reference; however, in the middle of his explanation, she cut him of, \"Yeah, yeah. I get it! I GET it!\" She grabbed the bottle from the fridge and slammed it down in front of him.\n\nNow, another of this bartender's friends had arrived, a ratty-haired, hipster chick with old school punk band patches neatly sewn or ironed onto her Gap jean jacket. She was cheerily served a 24 oz. can of Pabst Blue Ribbon - for $2, I should add. The prices, even for the middle of the day, were enough for us to subject ourselves to the bartender's abuse for one more pint. The young women chattered merrily, glowering at us, disaffected, whenever our conversation became a bit boisterous, as conversations are wont to do in gin mills.\n\nWe finished our beer, paid up, tipped the bartender much more than she deserved, and went across the street for a veggie burrito.\n\nMy overall impression: I spent the late 80's and early 90's mostly being ignored by hostile, hipster chicks with punk band patches on their jean jackets. I dated a few: not as special as they fancied themselves to be. I don't enjoy paying good money for that memory. Maybe I'm too old.", "author": "Daniel R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-02", "description": "Typical dive bar...dirty, friendly bartender. Cheap pool with jacked up pool cues...all in all a perfect beginning to what became the impromptu San Francisco Vacation Pub Crawl of 2009 \n\nOne complaint, the drinks were a bit expensive considering the atmosphere...", "author": "Mia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-31", "description": "Great bartenders, dogs are allowed, you can bring in food (Parada22 and Cha Cha Cha next door) and good beer - Pliny the Elder, Hopstoopid, and Supplication. Pool table, plenty of space, and good vibes.", "author": "Art V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-05", "description": "Generally speaking, I'm an easy mark for most dive bars (hellooo, have you*met* me?), and when we found ourselves roundabout of the Haight and in the market for a cold one and a killer jukebox, and Murio's was only too happy to have us sidle in, order up our own version of high-octane sarsparilla (which, for the sake of discussion, we'll call 'Hoegaarden'), and quicker than you can say slack-jawed tourist, there I was pumping dollar bills into the jukebox.\n\nDecent brew selection, easygoing staff, and over the strains of Pablo Picasso (thanks, Modern Lovers), we bled off into the dark recesses of the night.  And in the end, isn't that about appropriate for a dive?", "author": "Kevin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-16", "description": "I live in the area but I haven't been by this spot until recently. It was clean, crowded but still had room to grab a seat with a friend and chat over a drink. I have no idea how this place use to be prior and how long they can keep up the good vibes but as long as they last I will continue to hit the place up. I like it.", "author": "Shanna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-12", "description": "As Matthew R (swooon) so eloquently pointed out in his review, \"Murio's is a filthy, seedy dive bar\". It is also a place where you will have beer spilled on your Christian Loubotains (wear non-designer here), you will be asked to flash your breasts, and if you're not careful you can be speared in your boney hips by a pool stick by a drunk guy who blames the assault on you instead of taking responsibility. What else to expect from a drunk wielding a four and a half foot stick? It comes with the territory here.\n\nAll of the downfalls considered, Murio's also happens to rock, even in the opinion of a girl who prefers wine bars and designer shoes (and bags. and clothes. and makeup...oh god!). I like to come here with the merry band of alcoholics I like to call my best friends. Probably because when one is drunk, one tends to think EVERYONE is their best friend. This should give you some idea of how much time we spend inebriated. I can come here and have my ass kicked at pool by Amir, drunk cry with Drue, and watch Starla charm the pants off of boys. Oh and smoke outside with two of the three mentioned above. It's gritty, it's greasy, and the bathroom is filthy. But all in a good way. Go there. Drink. Play pool. Just don't hit any girls with boney hips or ask them to flash their boobs and you'll be fine.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-08", "description": "As Kevin N. mentioned below, I too, am easily satisfied by many a dive bar.  And this one was pretty right on.  Really, the main necessities include a dark-painted space, cheap beers, and a jukebox. Live bands are sometimes a plus too, but it's not a necessity...\n\nMurio's is a major winner in the jukebox department. This alone is probably responsible for 1.5-2 stars.  I got to play some Cramps on the night I learned Lux Interior had died. I even chatted briefly with some fellow about the Cramps.  At that point I decided that knowing a little bit about/having seen the Cramps should probably be a requisite for entry into a certain type of dive bar.  \n\nThrew a few dollars in and added on some Modern Lovers (and Kevin did too! Good taste, my friend!) as well as Radio Birdman.  \n\nNow, I don't know about you guys here in SF, but in Michigan, Radio Birdman is not exactly found on every jukebox. Steve Miller Band would be more likely. Maybe even the Ramones, but not really Radio Birdman.\n\nI enjoyed sitting in a bar, sipping cheap beer while listening to \"I-94\" without actually having to go outside and drive *home* on the real I-94 through the ice-n-snow!", "author": "mariah c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-07", "description": "Well, its Friday night, we are hitting place to place in the HA neigborhood...Stopped in this little dig called Murios Trophy Room...Pretty cool spot. They have a SWEET jukebox that has all kinds of great music, stuff you probably forgot you liked. \nThe bartender seems a bit busy, large bar with one dude workin...The first drink I got was weak, a bit disappointing. The second drink?..TOTALLY strong, wow dude, easy...", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-08", "description": "I want to do a dive bar crawl where we all just come to Murios as soon as they open and stay. That would be a dirty nasty dive bar crawl. \n\nStop one on the crawl would be in the back of the bar with a few strong drinks for a game of pool, since the daytime drinkers here are much more serious about verbally abusing each other over 10 or 12 cocktails than playing a game which requires some level of coordination. \n\nStop two would be on the mismatched bar stools where you could down a few more drinks while engaging in conversation with people who will make you think you are visiting a circus sideshow rather than a bar. The upside is that the regulars, along with the wide array of Christmas lights, will cast a healthy glow on you that will make you look beautiful and not the least bit wasted!\n\nStop three would be the restrooms, which I recommend visiting with drink in hand. Since you are going to, at this point, be getting drunk enough to spill this is a prime place to do it for disinfectant purposes.\n\nStop four on this crawl will take you to the counter across from the bar where you can ceiling gaze before your vision becomes double and you can no longer appreciate the fine art caricatures, the large tennis racket and hidden trophys this place has provided for your viewing enjoyment. \n\nStop five? The tables by the front door. By this time it should be getting dark out so this should be celebrated with a tall boy of PBR as you watch the hipsters and nighttime riff-raff take over the bar. \n\nThe final stop on this dive bar crawl will undoubtedly be the floor, hence the term \"crawl\". This, my friends, is when the dirty nasty I was talking about earlier will truly come to life. This will also be the only time in the day, regardless of how you behave, that they may kick you out....but this, too, is debatable. \n\nWho's in??", "author": "Drue C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-16", "description": "So we won the semis, and then we had some time to kill before the finals.  4 of us, slightly sweaty, in our jerseys, palming our own basketballs, looking for somewhere obvious to relax and watch the Lakers/Celtics game 5 . . . naturally we went to the Kezar, since we'd been playing at Kezar Gym, and it's y'know, right there.  It was also packed to the gills.  Ok - plan B . . . Murios!  \n\nGame on TV - check\nSodas on tap - check\nWeird people arguing with the bartender about whether they can use the bathroom without buying anything - check\nDrunken woman slumped unconscious over her gin and tonic at the corner of the bar - check\nComplete lack of internet reception on my iPhone - check\nOther weird people hurling the bathroom key at the bartender - check\n\nBased on this experience only (I have others in this place that were, how shall I say . . . calmer) - I conclude that Murio's is a great place for a part time jock and full time dork such as myself to relax and watch a basketball game on TV, if you find belligerent drunks and the dregs of the Haight Street Beat to be relaxing.\n\nWhen I've come here just to play pool at night, I've found it much more hospitable.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-09", "description": "Fourth bar stool from the end: see that? That's my ass groove in that stool.\n\nYou might think the bartenders here are assHOLES. I've heard that from folks. Actually, if you think that, funny thing... \n\nThen YOU'RE the asshole. Take that! These dudes are cool, and I will defend them to the death. Nick the bartender is my favorite bartender in SF. Has been since I moved here, hasn't been outdone yet. He's a RIOT. He keeps the bar entertained with his dirty one-liners -- seriously, he NEVER misses a beat -- and my crazy old mom pointed out to me that that's what a good bartender does. He's a professional entertainer of sorts.\n\nOkay, now you're saying, \"wait a minute, you took your MOTHER to Murio's?\" \n\nYES I DID, BIOTCHES! And she loved it. She talked about drinking tequila and puking with Nick all night long. I had to drag her out of there and lock her in her hotel room to get her to go to bed.\n\nWhen I lived two blocks away, no one ever dragged me home. No one ever kicked me out, either. Even though they probably should have (like the night of the vodka-drinking contest: augh). That doesn't happen too often at Murio's. In fact, I've seen a lot of people throw up IN the bar. So hells yeah, it's kinda gross. But I also one time watched Nick tell a wasted girl who blew chunks that she was gonna clean it up herself. Talk about a look of disbelief. \n\nBelieve it, chica. That's how they roll at Murio's. You're welcome to puke there, just clean it up yourself.\n\nKings of Leon in the jukebox? Check. Which lead to my first take-a-random-guy-home-from-a-bar-and-sleep-with-him experience (yes, not so long ago I had standards, people!). The next morning I found out he was 21, and had lied to me about his age. Which made me want to throw up, but that wasn't really any different from how I usually felt the morning after a Murio's night. So it was a wash. \n\nOkay -- I got laid by a hot 21 year old. It was a win!\n\nMurio's rules!!!", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-08", "description": "I've come to the conclusion that I like my bars to stink a little.\n\nWhether it's vomit, dog, body odor, or something unidentifiable yet slightly foul, I never fail to have a good time.  In fact, it almost seems like the smellier, the better.  Perhaps it's because my apartment smells bad, but I digress.\n\nNot to say Murio's is all that smelly.  Murio's has pockets of smelliness, whether it's underneath the bar counter (no coat hooks, natch), in certain back corners or near booths, or near the front of the bar.  That might sound like a lot but they are genuinely isolated.  Besides, if you drink enough, you won't notice and it's not bad enough to really care anyway.\n\nTall boy PBRs, pool table, ample seating and an eclectic jukebox, all accompanied by well drinks for $4.50.  Dog-friendly too, apparently, especially for that cutie pie who frequently decided to lounge in the middle of the floor so that patrons may better appreciate him.", "author": "Sus... B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-21", "description": "Wow. That's all I can say. I guess I'm not cool enough, or uncool enough to deserve respect in this place.\n\nFirstly, it's around 6 or so on a Friday. My girl and I go to meet a friend at this...place. Weird vibe as soon as we walked in this place. Yes it is a dive bar, but you'd expect some friendliness or playful banter from the bartender. No. Even getting the opportunity to order a drink was like pulling teeth.\n\nSo, I order a beer (I drink everything for the record) for myself, and my girl is a little picky and requested an Absolut and cran. No big deal. Well, the bartender decides to offer the well vodka, which according to him was basically the same. She makes the gross face and denies the substitution. True as it may have been, she gets what she wants, she's a CUSTOMER, she's not running for congress. He rudely serves the drinks and says to us: \"Next time a bartender offers advice like that, you should take it, because they know a lot more than you do\".\n\nWhoa, whoa, whoa bro. Just because you have your little power trip at a shitty...SHITTY bar in the Haight, doesn't mean you have the right to give me or anyone stern admonitions about our alcohol choices. People want what they want. Maybe you have to go home at night to your cold, empty, unfurnished studio and cry yourself to sleep, but you don't have to bring the attitude when you talk to me. Get a hobby, man. Additionally, I know plenty about alcohol...probably more than I should. Well liquor is not an intellectual pursuit of mine, so save it for someone who cares.", "author": "Berg W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-18", "description": "Stopped here for an early beer en route to Golden Gate Park for Outside Lands. It's a true dive bar, full of interesting characters and artifacts.", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-12", "description": "Outstanding time no thanks to Lily w/ her jokes.", "author": "Edwin M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-24", "description": "This is a cool bar for wanna-be's, poseurs, & trendy hipsters.\n\nThey used to have a great juke box, but now it sucks ass.  \n\nThey get two stars because it USED TO BE a very cool hang out.", "author": "Larry A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-21", "description": "After getting our high-brow scotch up the block at Alembic, my companion and I decided to low-brow it before calling the night a night. The tender of our portion of the bar was Nick, or so I've put together. He and his finely coiffed hair bounced around from one patron to another like a drunken... well, like a drunken bartender, which was exactly was he was.\n\n\"What're you drinking tonight?\" he enthusiastically inquired when he landed in front of us. I don't remember whether we asked for whiskey or he did, but my beautiful companion asked what whiskey he recommended. \"Powers.\"\n\n\"Two shots of that, then!\" we respond as one slurred voice.\n\n\"Oh, crap, now I'm going to have to do a shot with you!\" he half-muttered, half-exclaimed as he retrieved the bottle.\n\nAfter slamming a shot with us, he proceeded to make a chilled tequila shot for another patron. First try: he poured a straight tequila shot, and was corrected. On the second try, he was a little more mindful. Shaker-- check. Ice-- check. Ice in shaker-- check. Shake, then pour into shot glass... and out comes a few dribbles of water. No tequila. \"That's it, I'm done! I'm drunk!\" he exclaimed, and handed over the shaker and tequila bottle to another tender before wandering away.\n\nThis makes Nick the best bartender... EVER. And I will cut anyone who says otherwise. With a spoon.\n\nSomeday, I'm going to have to make it all the way over to the pool tables, the jukebox, and perhaps even a second round at the restroom.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-21", "description": "It's there. Usually old men. Ehh... group thing not solo thing", "author": "Lisa S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-20", "description": "One star for the POS ginger bartender at Murio's that wouldn't let my brother from New Zealand buy a drink because the birth date on his New Zealand license was 'backwards'.  Here's some advice, do some traveling so that you can figure out that America is not the only country on the planet.  \n\nps he is also the same bartender that told me a month ago that San Francisco bars would no longer accept passports as proof of identification/age.  Um... you can travel the world with a passport but you cannot buy a drink?  makes total sense.   Too bad he ruins the whole vibe of a potentially awesome bar.\n\npss Here's to the woman bartender earlier in the day who accepted his ID.  She's obviously an educated and reasonable person.", "author": "Kate H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-24", "description": "Unless you're of Anglo-Saxon descent, I would not recommend this joint to anyone else. Yes, it is very shishi, and service is way below standards. If you are anything less you will be met with a condescending bartender, unless you're of Anglo-Saxon descent.", "author": "Adrienne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "When I visit SF I always have to stop for \"a\" drink at Murio's. I say \"a\" because I usually end up staying much longer then I should. Great drinks, very cool bartenders and some very fun locals.  This please is awesome.   I wil continue to visit when back in town.  cheers!", "author": "B I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-26", "description": "Murios is a filthy, seedy dive bar. I'm having trouble coming up with much else to tell you about it. \n\nTall boys of PBR are available, opened and ventilated with an awl for you. I'm not sure I'm brave enough to have a mixed drink here.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-16", "description": "This is a great place to hang out at and meet everyone you know who has hit rock bottom.\n\nOk, not quite rock bottom, but close.  If you have a job selling weed in front of McDonald's, this is the place to come to after you've sold your last gram.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-30", "description": "The jukebox alone gets this bar five stars.\nKind of pockets of atmospheres here.\nOne end of the bar feels totally dif from the other, ya know?\nIt's a cool place when not overrun. \nGood bang for your buck on the mixers as well.", "author": "Theo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-18", "description": "One of the only bars in town with Radeberger beer ONTAP-that gets 5 stars in my book. Great Jukebox cool peeps too.", "author": "Ann H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-06", "description": "On our Red Vic trip Friday night, the pre-show entertainment options consisted of tapas and fine bourbon (c/o Cha Cha Cha & The Alembic), or pizza and PBR (c/o Escape from New York & Murio's).  \n\nWe went with pizza and PBR, partly because they didn't involve waiting, but mostly because that's just the way we roll (but really because they didn't involve waiting).\n\nI didn't really find this place to be as filthy as the other reviews make it out (with the exception of the bathroom, but that's kind of a given in a place like this).  Random J and I saddled up with a couple of tallboys (which was my first ever PBR in a bar, now that I think about it) and hit the pool table (also a first for a bar--these things are usually taken over by people far better and surlier than myself).  After a couple minor obstacles (#1: trying to get the damn quarters to go in--you gotta put your back into it) (#2:  humbly asking the lady at the other pool table where I could find the ball rack (hint: it's inside the table)) we were good to go.  I was winning until I sunk the 8-ball into the wrong pocket.  With a few quarters left, we tried our hand at Ms Pac-Man and Galaga and, unsurprisingly, sucked.  Man, the buttons on that machine have seen better days.\n\nTotal Cost: 2 $4 tallboys + $0.75 pool game + $0.50 of arcade games =  $9.25.  That's some damn cheap entertainment for two people in SF.\n\nAnother bonus: This place plays some great tunes.  Marshall Tucker Band's \"Can't You See\" was a particular highlight.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-20", "description": "Ended up here after Bay to Breakers to continue the drinking that had started at 8AM that morning. \n\nOverall cheap drinks, tall boy Pabst ($3), and a pool table in the back made it a nice place to chill and recap the hilarity of the day. \n\nThe decor is typical dive bar and showing its age so don't expect anything fancy. It actually reminds me of pubs in the Mile End section of London (gritty and with a hardcore regular crowd). \n\nThe place was crowded on Sunday but I have a feeling that its a lot less lively the rest of the year.", "author": "Arin N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-11", "description": "Grabbed an afternoon drink here with a friend. There were enough people inside to make us not feel alcoholic. I haven't been here at night and don't know what the nightlife is like... But yea, good daytime vibe.\n\nI mean, it's def a dive. But if you're okay with that... Cool place.", "author": "jared c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-18", "description": "What a cool dive bar!\nThe jukebox is crazy!!\nI had to check twice to make sure I hadn't stepped through a transdimentional rift and ended up in front of Zeitgeist's jukebox...  Is there some kind of rule about reviewing while drunk at 3:08 in the morning?\n\nThe drinks *are* strong, BTW.\n\nAfter hanging out with friends I hadn't seen in years, buying a couple of rounds, and being basically drunk and queing up a ton of music I never got the chance to hear I decided to go next door and browse their, uh, glasswares...  I'll save that one for when I'm sober enough to remember the name of the place.  After an interesting brief shopping trip (so to speak) it's off to... the Lucky Penny!", "author": "Theron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-13", "description": "GG Bridge Iron Workers.  Hipsters.  Raging alcoholics that smell like sausage.  What more could you ask for in a bar?  Oh, wait, combine that with a piss-soaked bathroom and 24 oz cans of PBR and you've got Murios!\nMurio's was my first \"local\" upon moving to SF and ever since then i've always had a deeply embedded love for it.  I never fit in with anybody else who drank here, I never met anybody here, and certainly there are better bars....yet I kept going day after day.  If you go expecting ANYTHING, you'll be disappointed.  Go with a working liver, a few bucks, no expectations and Murio's will be there for you all night long.", "author": "Zev K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-10", "description": "As an ex-murion I approached the new bar with skepticism but it was great!  Nothing like Murio's but still a really nice,  comfortable bar.  The bartender was great. The booze was just as I remembered it...the only thing that sucked was that the music was totally lame. I couldn't handle it for more than 20 mins", "author": "Robert S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-30", "description": "A friend of mine said we were going to a bar in the Haight, not having usually gone for drinks in the Haight, I wasn't sure what to expect but Murio's was not what I was expecting, that's for sure.\n\nThe trophy room is a solid dive bar that would fit in anywhere in the city. Very much your typical pool table, juke box, wood bar, cheap drink type of place. Lots of room for big groups in the back and plenty of seat-age. Put Livin' on a Prayer on the Juke box and get ready to get a crowd singing.\n\nIt's the kind of bar you want to hit up on your way home from work and just relax at until all those loud kids show up and you start yelling at them to get off your lawn. \n\nIt's worth coming in and looking at all the ceiling art. It's wallpapered in caricatures of either patrons or employees of times past. I guess I should have asked. \n\nCome in, have a drink or four, pet some folks' dogs and make a night of it.", "author": "Andy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-16", "description": "An old friend of mine was proposed to on the bar of this bar. He got right up on the bar and popped that question.\r\n\r\nWe decided to have her bridal shower there, and the bartender was so cool he let the entire group of us (about 12 drunken women) get up on the bar to re-enact the moment.\r\n\r\nI've had a lot of fun wild times here. Its a dive. Not all dive bars are a good thing, but this one is ok by me.\r\n\r\nThe bartenders even have the right amount of cranky going on.", "author": "Marz W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-26", "description": "Murio's, Alembic and Citrus club in the upper haight are part of what I call my \"bermuda triangle.\"  Because I am a lady of convenience, I never venture outside of the three block radius from my house.  When I have friends visiting from out of town, they get this grand tour of my neighborhood and no one seems to complain.  \n\nMurio's is extremely dark and cold.  But they have pinball and pool tables.  The environment is not really conducive to friendly conversation among strangers, but I haven't met any jerks there.  Sometimes creepy people hang out there. Once I was there with an ex boyfriend of mine and this guy kept saying what a good looking couple we were.  Somehow the conversation basically ended with him suggesting that we all have a threesome.  Oh. I forgot to mention he had long hair and was wearing a cape, so needless to say I had to decline his generous offer.  Good times.", "author": "Jade L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-21", "description": "When myself and my Wife visited the greatest city on earth back in 08,and my Wife being a big Joplin/late 60's fan we spent the day in the Haight district (I was in S.F for the rich history of Bay Area Thrash,but that's another story). So we were having a great time wandering the streets,had a look at what my Wife thought was Joplins old house, bought a couple of t-shirts had a bite to eat looked in a few shops,you know the thing.....As we were reaching the bottom end of Haight St we decided that a drink was in order.As luck would have it this decision occured just as we were passing by The Trophy Room.Now from the outside the place didn't look too much,but this isn't meant to put the place down,in my world not looking much is a good thing,i'm a Metalhead, if my feet don't stick to the floor I feel uncomfortable (My feet didn't stick to the floor here so don't worry!!) Once inside one look behind the bar told me that this was the right place to pop in...when you are in a different country (even one that speaks the same language as you) it can sometimes be a little bit daunting to just walk into somewhere especially a Dive Bar several thousand miles away from home. But not here,straight to the bar, 2 bourbon and cokes and away we go!!....After a while we got chatting (accosted) by a guy called Raymond who was from Boston (if he still hangs there there say hi from me). Who likes to take the pee out of us tea drinkers : ) Now, by means of witchcraft Raymond managed to talk us into supplying him with a couple of Long Island Iced Teas (without the Gin). This is when things took a turn for the odd/weird/Haight District...*disclaimer* Lee\"Bio-Zombi\"Z in no way endorses being in Rome and doing what the Romans do!!..My wife and Raymond got to talking about herbal cigarettes. And in no time at all a trip to Hippie Hill in Golden Gate Park had been organized and certain medicinal items were procured and enjoyed......In the 2 weeks that we spent in San Francisco we enjoyed 3 really good drinky sessions, one in Whisky Thieves,one in North Beach who's name escapes us. But by far the most memorable was spent in the company of Raymond and the lovely people of The Trophy Room.\n We will be back next year,please don't let it have changed!!!!!", "author": "Lee Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-02", "description": "If you're a champ you should hang out at Murio's Trophy Room.\n\nOf course you'll probably end up drinking like a champ and feeling far from that the next day.\n\nOne main reason; drinks here are cheap.  The PBR Tallboys are like $4 or something and always served COLD.  Even if the novelty of drinking tallboys in a bar has worn off for you, pints of their delicious tap beer (including one of my personal favorites Red Tail Ale) come in at about $3.50.  And yes, they have a full selection of booze for all you non-beer drinkers.  \n\nYeah the layout is a little weird; if you get stuck in that middle \"bridge\" sort of area you'll definitely be getting jostled but so far it hasn't been hard to find a decent space on either side of the place.  \n\nThe jukebox has a good selection of punk rock and rock n' roll, which I know seems a little \"typical\" for SF dives, but personally, I'll take that any day.  The one thing I could stand to have at this joint is an ATM (or at least take card, dammit) but given that it's low key, mostly mellow and a good place to throw back some drinks make me shut up.\n\nNow if only I could get my caricature on the ceiling....", "author": "Steven R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-26", "description": "This place is FANTASTIC!!  \n\nThe bartender was friendly and nice, the drinks were delicious and cheap, and the jukebox was one of the best I've seen in the city, It was a really great way to spend an evening!! \n\nI would certainly recommend this place to anyone looking for a great, simple, no-nonsense bar in SF!!", "author": "Ignatious M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-05", "description": "A pretty fun place. Maybe a little too bright, and certainly more annoying as the night wears on and people spill out of the several sports bars and music clubs nearby, but still fun.\n\nWe've had incredible luck with the bartenders at Murio's. Without a doubt some of the friendliest in the city. Combine that with quick and no-nonsense drink pouring and you've got a great spot for the early evening before it gets too jam packed. Again, if I were running the place, I'd take out about half of the lighting as it seems to constantly have a '2 AM, everybody out' kind of feel where you're squinting against a harsh floodlight just to see if you're name's come up on the pool table yet. It also could benefit from some darker carpet or a fresh coat of paint that isn't a primary color. Bright and happy might be good for an IKEA, but it's crap for bars.\n\nAll in all however, we'd still recommend giving Murio's a try. After all, how impressive is it that the staff here are able to stay this friendly and cordial when most of the people walking by are stoned tourists? \n\nNever mind.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-06", "description": "49ers QB Joe Montana was a closet bisexual who used to go to all-night coke parties in the Castro. Any given Saturday, he'd be up all night, getting him some dick, getting him some yay -- the night before a game. 49ers management had a special phone number they'd call when Joe was MIA: the SFPD, who would then go into the Castro, find him and bring him home in time for a few hours' sleep.\n\nThe reason why Joe was so well-known for second-half comebacks? It'd take him that long to sober up, clear his head, and remember how to play football.\n\nThis is only one of the better stories I've heard at John Murio's Trophy Room, named for the Hawaiian tennis great. \n\nWill there ever be a bar called The Breakfast Nook in Chris R.'s Starter Home ? I doubt it, which is why John Murio is great and we are not.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-10", "description": "Nothing like going to Murio's to have a drink after a hot, stressful day, play a game of pool or have a drink with your friends and buddies. It's a dive bar alright, so dont expect your fancy, girly drinks here, just the good ol' beer, whiskey and Vodka acompanied by a jukebox full of classic tunes of rock. \nThe patrons are always friendly, and many of them you can see everyday, being part of the peculiar bar culture of Murio's for more than 30 years. \nThe bartenders are just fantastic, providing good conversation, jokes and drinks. Ask for Nick when you go there", "author": "Elvin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-13", "description": "The Jukebox is my hero. I like everyone who hates this place. People are funny. Just drink your drink and listen to the jams.", "author": "Christa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-17", "description": "I love this place when it's empty on a weeknight.  That's when you can really tell how dirrrty it is.  The highlights are strong drinks, a couple of pool tables that people aren't fighting over, and the bartender who is also the bouncer.\n\nAll bets are off on the weekends though when you deal with all the spill over from Cha Cha Cha.  I fear those people.", "author": "Susan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-02", "description": "Back in the day it was nice not to be thrown out because you and your friends are \"STRANGE\" and getting stranger by the minute!!", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-13", "description": "What can I say? The cliché music, the coked-out homeless guitar player, the shamelessness that automatically overtakes your body upon entrance and drives you to request $1 miller high lifes and do the robot all night...\n\nMurio, you done me good.", "author": "Talk N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-06", "description": "Excellent. Cheap beer. Good atmosphere. Awesome bartenders.\n\nWe came in for the last stop of our Haight bar crawl on a Saturday night and f-g loved the place. \n\nThe bartender was foul-mouthed and funny and we talked s-t all night long. \n\nCanned beers were as cheap as $2 each and Pliny the Elder was on tap for $4 a glass. IPA lovers will also find Racer 5 and Brew Free or Die on tap. \n\nDefinitely recommended.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-18", "description": "Good service, great music, not too crowded on a Saturday night. \nWaiting for a table at Cha Cha Cha's wasn't nearly as unbearable with this gem right down the way. The host even offered to go to Murio's to tell us our table was ready. Stellar!\nLove the art on the ceiling.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-29", "description": "Lots of guys in here.  When I walked up to order my drink I felt like I was on stage, every head turned and eyes followed my every move.  A little creepy.  Also, oddly enough...the bartender never looked my way.  Took me a long time to get his attention, I think it wasn't until my tall friend came up wondering what was taking so long that the bartender finally came over.\n\nThere is a pool table that seems to be always busy.  Don't remember hearing any tunes but I'm sure there is music being played somewhere.  The layout of the place is nice.  Lots of bar seating along the walls.  Not really my kind of place.  Although I'm sure if I lived closer it would be another star, it wasn't too busy and probably under normal circumstances it's easy to get a quick drink here.", "author": "Mary R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-29", "description": "The best bar in the Haight, and one of the best bars in SF. Nick is the coolest bartender in the city and the selection of beers can't be beat (lots of local/NorCal stuff like Russian River without even being aggressively advertised). Also CHEAP. Go!", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-28", "description": "I love this place. It's messy, it's divey, the drinks are cheap, the characters strong and the wall decor definitley keeps you occupied. The jukebox is good, the bathrooms are not.\nThe bartenders are friendly, and the occassional pirate may show up. \nIf you're afraid of Haight Street or getting your fingernails a little dirty, this bar probably isn't for you, but I love the pool tables, the uncertainity of who or what will walk in and the cheap booze.\nHurray for Murio's!", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-02", "description": "Stop #1 in our day-drinking-in-Haight adventure. Strong pours, nice staff, friendly patrons. Surprisingly clean bathroom. I'd drink here again.", "author": "Lyn P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-15", "description": "I used to come in here back in the day when the Amobea record store used to be the Park Bowl. My grandfather and Uncle would frequent this spot as well as the Gold Cane and Paul malls all on Haight.\n\nYou would wait until they were drinking and playing pool with their friends then my cousin and I would hit them up for money for bowling and video games. When they had some drinks and were in a good mood we could get money from them and sometimes the friends as well.\n\nThese days it's not the same but I hit it up once in awhile and it always seems to be hit or miss..I have had some okay drink nights in here", "author": "Kim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-22", "description": "Of all of the bars on Haight Street I think this is my favorite.  The bar is long so there is plenty of room to pull up a stool for a long evning of booze.\n\nThe jukebox has tons of cool tunes.  I am actually giving this place an extra star because the have 'Broken Hearts, Empty Bottles', one of my favorite drinking records... ever.\n\nYes, there are drunks and drug addicts.  Better than the striped shirts sucking down some sweet rum drink at Hobson's.\n\nEnjoy.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-30", "description": "I miss the old murios!!!! went here after they remodeled and it's awful! nothing at all like my favorite old dark dive filled with awesome locals and they took pliny off tap! I can forever complain about the change, one thing I do like is the comfy couches in the back but I'd take the old dingy cave like back area any day. No place to dance :( Nick is the only reason I'd ever return.", "author": "ariana m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-21", "description": "the haight. i hate it. the only reason to be there during the day is for some pressing issue. once you tattooo your face and use stolen dogs for heat, youve given up on life.....anyway. i always stop at murios on the way home. 2$ pbr. good juke box.\n\nall they need is a darts area.", "author": "aidan m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-27", "description": "Good ol' Murio's is a place largely unaffected by the many changes around it. Over the years, just about every storefront on that side of the block has morphed from one establishment to another, yet Murio's endures. The interior is a bit larger than the old days (the result of a unused room being converted into space to put another pool table, I believe), but nonetheless, it's pretty much the same. Sometimes, a constant in a sea of change is a good thing. \n\nBesides, that, there's a good crew of bartenders and a fairly decent jukebox. Drinks are still pretty cheap too. I like to drop in on a weekday afternoon and see my buddy Waterfall (he opens the Haight St. Fair every year with a blast from his mighty conch shell), who almost always has a new edition of his poetry 'zine, The Waterfallian, ready to give me. His stuff revolves around anti-war and political themes, and is probably the only poetry I'll read for sheer enjoyment. I usually like to grab a taco or two from Balazo down the street, hang out and chat with Waterfall about politics (or shoot the breeze with friends/aquaintances who pop in from time to time), and catch a ballgame on ESPN or whatever is on, before retreating back to my home base.\n\nI do miss the old Nightbreak days, when there was an actual live music venue next door, but oh well...", "author": "ACE A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-07", "description": "Murio's is a great place to have a shot of Fernet, rock out to a sweet juke box, or play a game of pool. My favorite time going there is always after a kickball game. It's a great place to have a beer and a piece of pizza. Drink prices are right on point, and there's always a spot at the bar. It's an oldie but goody you must stop by and experience. Say hi to Nikki and Marge. There kick ass bartenders that you should know!", "author": "monika l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-06", "description": "Floors - disgusting \nChairs - disgusting \nBathroom - beyond disgusting\n\n\n Taking in all the disgusting aspects at Murio's, there doesn't seem to be much of a reason to go. But it more than makes up for it by having friendly bartenders who aren't too cool to look down upon you. They not only serve tall-boys of Pabst Blue Ribbon, but they'll even puncture it with an awl for increased airflow and more rapid consumption.\n\n\n And the né plus ultra of the Trophy Room? Proximity to Amoeba. As if I need my inhibitions reduced before going into record buying Valhalla.", "author": "Omid T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-11", "description": "watched the suns sweep the spurs here last sunday, they have toshiba HDTVs and when the jukebox isn't playing, depending on the bartender, you might hear the cure's pornography album playing.  VIVA LOS SUNS!!!", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-08", "description": "When I'm in the mood for a killer bloody mary, I head to Murio's.  It's like a meal in itself loaded with picked asparagus, green beans, celery, and peppers.  Extra spicy for me, thank you very much!  \n\nBe sure to check out the art on the ceiling while you're there!", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-09", "description": "4 stars for the people, the grunge and the pabst.\n\nThat one extra star for the Lenin poster behind the bar.\n\nI followed  a gang of pirates here one night for chrissakes!\n\nThat's an extra star the site won't let me give Murio's.", "author": "Jen I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-12", "description": "This is actually one of my favorite bars in SF.  I'm normally there during the daytime(recovering from the night before) so keep that in mind.  Great jukebox selection, great bartenders, right next door to Amoeba, pool tables, relaxed atmosphere and my wife swears they make the best bloody mary she's ever had.\n\nIf there is any downside I would say that parking is difficult in that area, but that's not the bar's fault.", "author": "Vince G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-21", "description": "Always a solid choice!\n\nDrinks are reasonably priced and the jukebox is packed with great albums. It's also one of those rare places where the music is not too loud to hold a regular conversation.\n\nThe bartenders are fun to chat with and they make sure your glass never goes empty.", "author": "Jill M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-29", "description": "I love this place, and I wish to hell I knew about it in the years I lived in the City.  A few years ago on a visit, I was trying to work off a hangover and trying to work up the energy to do my usual 2-3 hour CD/DVD binge at Amoeba Records next door.  Caffeine, food, lots of water, and a trip to the beach still didn't sooth my aching regretful soul.  So time for a small hair of the dog to smooth things out, as it were.\n\nSix blissful hours later, I decided to save Amoeba for another day.  2-3 kick ass spicy bloody mary pints, several Red Hook pints, and a few Jameson's shots took care of any shopping plans I may have had, and I felt a hell of a lot better.  I wasn't even broke.  It's one of the cheapest bars in San Francisco, and utterly without pretension.  It was the Thursday before St. Patrick's Day weekend, and I watched at least 7 groups or pairs of obviously underage people try to get a drink there.  Being right where Haight Street hits Golden Gate Park, there's a fair amount of runoff as far as the tourist trade goes.  I must say, short of booting them to the street, the bartender did the most efficient, amusing, and occasionally polite job of getting rid of the teen drinkers.  It's been years so I forgot the name and the face, but the bartender was a cool guy that had been employed at one point doing repairs on the Golden Gate Bridge, had moved up to the Pacific Northwest somewhere, and had just moved back to SF a few weeks before my entrance into his dark, divey part of heaven.  Let's put it this way, the bar was fairly dead since I was doing some early drinking (walked in around 10-10:30) and this guy was a genuinely interesting person to talk to.  He even got me into watching the NasCar race on TV, and I freaking hate NasCar.  Loathe it.  Racing to me is the most boring sport on the planet.  This guy had enough facts, trivia, and stories about races he had either gone to or watched, that his commentary actually made watching the monotonous race interesting.  And again, totally nonpretentious.  Non-hipster, non-scenester, and just down to earth.  Kind of like a neighborhood redneck-ish dive transplanted somehow into the Upper Haight.  \n\nI avoided the Upper Haight for the most part when I lived in SF, mainly due to the abundance of hippies and dreadful (no pun intended) pseudo-hippies/trust fund wannabe people.  Murrio's is as non-hippie you can get for the Upper Haight, in fact there's lots of good punk represented on the jukebox, including the fairly obscure early 70's punk band Radio Birdman.  \n\nMost people who I've met here were really cool.  On another daytime visit I had programmed a Poison Idea song and a Hard-Ons song on the jukebox, and was working on my pint.  A punk lookin guy and his girlfriend (?) walked in and sat a couple seats down from me.  When the Hard-Ons song started (I think it was \"Girl in the Sweater\") the guy said, \"Alright, the Hard-Ons!\" and started bobbing his head to the music.  Once my Poison Idea song started \"Just to Get Away\" the guy looked straight at me: \"Did you play this?!  This song RULES!\"  Needless to say we talked for awhile.  I know this has nothing to do with the bar itself, the beer, or the prices, but 50% of a bar's appeal IMO is the crowd that hangs out there, and Murrio's is fairly douchebag-free due to its lack of pretension. This guy's girlfriend was wearing a Texas Chainsaw Massacre 2 pin, so that maybe gives you an idea of \"my crowd\" or whatever.\n\nThe Haight Street tourism/crazy person spillover does occasionally result in some lameness, but sometimes to amusing results.  My favorite was the Jim Morrison wannabe-looking guy with the snakeskin cowboy hat, who seemed like he had sampled a fair amount of 60's style psychedelia, if you catch my drift.  Literally the second I'm thinking to myself, \"Does this guy wanna be Ian Astbury from the Cult?\" he TAKES OFF HIS SHIRT FOR NO REASON, muttering dopey poetry-like nonsense, and CHANGES INTO A CULT T-SHIRT AT THE BAR.  At this point, I'm thinking, is this Ian Astbury himself fallen onto hard times? Or is this guy in some (God forbid) Cult tribute band?  Either way it was a fuckin surreal mindbending moment that could probably happen only at Murrio's.\n\nAnyway, the point of this rambling review is that Murrio's is a reasonably priced, fairly pretension-free place if you want to go have a few beers in a non-meat market type environment.  For major drinking and occasional socializing.", "author": "The D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-14", "description": "I was out and about with my friends friends looking for a cool little spot to hang out and have a couple of drinks and listen to some music.  We seemed to be going into the direction of the Haight.  So we thought why not go to MILK.  As we got there the door man told us it was a $10 cover charge.  It was already 12:30am and we didn't feel like spending money on a cover charge, so we opted to head over to the bar across the street to get some drinks.  \n\nAnd so we encountered Murio's.  A great little neighborhood dive bar filled with regulars in the back area enjoying beer and playing pool.  As my friends and I sat at the bar perusing at the liquor selections that they had to choose from, we met a kind fellow who wanted to make some friends that night.  He talked to us about how Murio's is his favorite bar, he played matchmaker earlier that evening for some strangers and proceeded to serenade us with some Otis Redding tunes.  Mind you that he was already a bit tipsy, as this bar was not his first stop for the night, but he proved to be very entertaining.  The bartender and the regulars were nice and chatty, which made a close to our evening quite enjoyable.", "author": "Cynthia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-01", "description": "I find it hilarious that I am going to give this place 4 stars. This place screams sketchtastic from the moment you walk in the door underneath the glowing red neon sign and notice that those really are plastic christmas lights on the ceiling.\n\nI have a hilarious story about how my rum and coke came in one of those tiny bathroom solo cups. Granted, I still got a very nice pour from the bartender, but it was hysterical at the lack of coke that went into the plastic bathroom solo cup. What made this whole thing funnier? When I wanted another, the bartender needed my solo bathroom cup back. Yes. That extra $0.005 cents was totally going to break this place for profit. At the same time, this was so over the top weird that I couldn't help but thinking it was hilarious, not bastardy. \n\nSo like I said, I don't know why this place gets 4 stars, but it feels like 4 stars. Its one of those places that screams \"get really really tanked here, and then go puke on the McDonald's drive thru speaker\". You just gotta have at least one of those bars, yeah? We went here prior to a roller derby match. I can't say there is a better match for a pre-roller derby drink fest. If you don't go here in an equally sappy/raucous mood, I doubt you'll have a good time", "author": "Sean C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-25", "description": "This is a great Rock N' Roll dive...first off, The Rolling Stones were playing on the Juke Box, which had a pretty good selection. Second cheap drinks including $1 PBR cans sunday nights and $1 Miller high life monday nights. Last but not least, I was regailed with stories of Keith Moon and Joe Strummer by an elderly british man. Epic win!", "author": "Camille A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-27", "description": "after getting denied for a job, i hopped on the muni to haight for some good ol' retail therapy, bought some books and ducked into murio's on my way to amoeba....i never made it to amoeba.\n\ni knew i found my bar when a random guy tried to use the bathroom without buying a ($2) beer and the bartender got all sass-attack on his ass. i'll admit, i had an instant girl crush on the bartender. she was witty and adorable, doesn't take any shit and could probably kick anybody's ass. she also gave the best \"cut off\" speech i've ever heard. it's a delicate process telling someone they've had enough..  kudos to you, marjorie (hope i got the spelling right.. heck, hope i got the name right.)!", "author": "darcy a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-21", "description": "in the 90's the trophy room used to be my favorite bar.  now, it sucks.  i went in there two months ago while my girl friend was shopping at whole foods.  i'm not there two minutes and a fight breaks out.  i watch it for a while until a large black man walked in and broke up the fight.  the female bartender was useless.  she was wasted! really wasted behind the bar and didn't even try to stop the men.  here is where i say i have actually done door/bounced in my time.  when a fight breaks out you toss both people out.  fuck them, they can fight on the street for all i care.  however, the drunk wasted bartender let the guy she knew stay in and continue drinking.  frankly, if you are getting in to fights at bars, you might consider not drinking for the rest of the day.  it's just a thought.  after all this BS i left.\n\nflash forward to a few weeks ago... i was in the trophy room again.  there is another wasted female bartender bartending.  i'm not there two minutes when some homeless guys pit bull bites a woman in the hand.  hey dumb ass bartenders, you don't serve homeless people in the bar!  you also don't allow their fuckin pit bulls in there either.  i hope the troyphy room got sued over this!  fuck this place now.  it used to be great but has gone down hill.  oh yeah.. what's with the stupid turn table in back.  how loser wanna be hip can you get trophy room?\n\nthe trophy room shouldn't even get a star.", "author": "T D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-21", "description": "Murio's Trophy Room. At 5 pm on a Saturday night it served as suitable place to meet a date and drink some whiskey. \n\nPeople call this place a dive, but it's a very mild dive. It's too bright and too clean to be a proper dive. They have good beer on tap for 3-4 bucks a pint. A great place to start an evening in the haight, not crowded or loud. \n\nThey have a jukebox. Maybe 50% is cool, Pixies, Two Gallants FTW. Two bucks equals 8 plays are you serious?\n\nThere was an old dude and his little dog and they were playing fetch and the dude was making out with the dog.", "author": "Jim C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-10", "description": "Yep, it's a dive. But a nice one, and convenient to Amoeba... $3 happy hour! Pool tables! Cheetos! (no, not for free)", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-27", "description": "GREATEST BAR IVE EVER BEEN TO!  Shot out to Mr Cortez the bartender.  This place was great!  Dim lights, loud music and strong drinks!  Not to mention the bartender was CRAZY funny.  We came from Cha Cha Cha's to get some \"real\" drinks.  I live in the east bay but id definitely head back there for a good time.  The ppl in the bar looked scary but were down to earth...and thats my kind of place:-)", "author": "Randi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-03", "description": "First time visit, we stopped by say hi to some friends. Xmas lights on the ceiling! People are extremely friendly. Bartender is very nice and hyper! Ordered sex on the beach when I got in. He made fun of me about there are some sand on my butt pretty much the whole time we were there. lol My bad, it wasn't the drink for a dive bar. Anyway, happy folks are here. Music is very 90s but in good way. Only 3 stars because the bathroom front door (more like a half cover) is facing to DJ stage. Everyone is able to see when u fixing your hair. Ugh... (Thanks god it's not the toilet door...)", "author": "Flora F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-06", "description": "Check out the old school photos at the back of the bar. This must've been a hot diggity dawg of a place back in the day.", "author": "Aim E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-06", "description": "If ya want a cheap drink at a no-nonsense place, where you are bound to have a crazy ass conversation head to Murio's Trophy Room.  After a few drinks poured by cutie bartender Nick, everyone at Murio's Trophy Room is your new best friend.  But be warned: Cheap Drinks + Stumbling Distance Home = Trouble.  So 4 Stars, because every Good Girl needs a little trouble in her life.", "author": "Natasha R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-13", "description": "I just started hanging out in upper Haight, having wrongly accused it of being far too seedy for me.  Some friends took me out to Murio's, and well...I was very pleasantly surprised.  Friendly people and staff - and the booze is good and cheap!", "author": "Mario G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-20", "description": "I'm a big fan of dive bars, but this place blows.  Rudest bartender EVER.  Jackass wanted to charge me for a second drink to remake the drink HE poured incorrectly.  Seriously?  As an ex-bartender, I can't even fathom that kind of attitude.  I'll take my dive bar business elsewhere.", "author": "Vanessa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-07", "description": "it's a DIVE BAR, people! on haight st., for that matter... if you want to go to a sanitized pretty bar, go to the marina, you can even find these bars in the mission now-a-days... hell go across the st. to milk..whatever!\n*sigh* i digress\n\nthis place is the sh!t !  nick, the bartender is cool, and i love his hat that gives him all the character!  i love the patron slim, and his dog, maganda [or was that the dog he had that passed... damn drunken nights].  spots like this bring out people of all breeds, and people who are down to earth and just want to have a damn drink.  no bull crap, no foufou decorations, no need to dress up...just give me what i come to a bar for: ALCOHOL.\n\ndespite all the 'makeovers' that haight st. has incurred, this place has stayed true to it's identity, and the realness and rawness of haight st. \n\n'nuff said.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-06-14", "description": "Does a place make you cool by name dropping it or do you bring the cool to make it worth mentioning? PBR in huge cans, classic punk rock.  Done.", "author": "JP Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-13", "description": "I fucking love this bar.  Good Juke box, video games, cheap booze....   Why only four stars then?  Glad you asked...  When ever I step outside for a smoke I get accosted by holmess people and hippies.  No, I don't have any change.  No, I don't want to buy your dirt weed.  I'm not a tourist so stop trying to sell me your fake acid.  Sure, you can have a cigarrette but just one and only if you go away...  Aside from that the bar is cool.  If you shoot pool you can always get a game going and if you find yourself hungry there's good food all over Haight St.  Oh ya, if you order the 24oz PBR the bartender (without being asked) will carb the top with a knife...   you know, in case you want to pound it.", "author": "jason k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-21", "description": "Used to be a damn fine place to grab a beer and get harangued by greaseballs and punk rock boys before shows at the I-Beam. Also used to have trashy girls dancing on the bar in a gacked out frezny. Long gone are those days, we still pop in here for drinks after a day of shopping at Amoeba because it's  tradition. Unfortunately, now the folks seem to be having a lot less fun and the bartenders are cranky because they're being monitored at all times by an evil eye.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-03", "description": "this place is classic Haight st.   I hope with the remodeling they don't change the old skool dive bar vibe that everyone enjoys. there is enough trendy places on the street already...and i hope they keep the same kind of music and Nick is still serving us wit and cocktails...", "author": "SASHA B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-16", "description": "so now they have to charge $5 for beers to help pay for their 'facelift', no more tecate by the can..stopped in once for happy hour, then was told the drafts were $4...the only thing that is 'divey' about this place now is the bartenders..they should've been shipped out with the old furniture..(sorry, those arent happy hour prices) back to the gold cane for us, will give them credit for uplift because the place was terrible before, and it does still kinda have the old 'stench'...guess no amount of facelift can get odor away", "author": "gavin t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-05", "description": "murio's is my neighborhood dive bar. no frills. no bull. interesting cartoons. pool tables. funky-looking regulars who no doubt have interesting stories, though i don't really need to hear them. \n\ni've never seen it crowded (maybe because it's usually a late afternoon or evening stop for me). interesting music on the jukebox. people will leave you alone if you want. it's simple and cheap, just what you want your neighborhood dive bar to be.", "author": "leslie a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-23", "description": "dive bar, cheap drinks and pool tables.\n\nwhile the service isn't the greatest, the bartender is a great guy and well worth getting into a conversation with. (everytime, it's one guy working on a friday night).\n\ncheap drinks, kinda dirty, ton of smokers out front.\nit feels like home.  *sigh*", "author": "Ge O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-16", "description": "Whoever wrote down that Murio's bathrooms are gross is an uptight jerk.  This is the only spot in the Haight that will let you use the bathroom to pee without buying a drink.  You can just walk right back to the left and - ah - relief!  They have a really nice big mirror in there and there's never a line.  This bar has no attitude and a nice pool table.  It's a classic spot.  It's been on the Haight for years and years and years.  A professional tennis player named Murio used to own it back in the day.", "author": "jane d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "My neighborhood watering hole. You have to appreciate Murio's for what it is--a dive bar. Always good conversation to be had there, and the bartender is beyond entertaining.", "author": "Mallory M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-21", "description": "i've been falling in love with this dive lately. good people, friendly prices and generous bartenders. the juke box ain't too shabby either. if you find yourself in the haight its definitely worth stopping by for a drink or five.", "author": "Joseph N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-04", "description": "A few years ago, a Murio's patron Yelped the now-defunct dive as being the \"John Lovitz\" of bars.  Crude, classless and in poor taste, both Lovitz and the old Murio's had character.  Sadly, the new iteration of this long-time Upper Haight landmark lacks any of the Lovitzness that previously drew me in.  In trying to lounge-up the place with cheap and tacky decor (square white cow hair seats and light fixtures that were seemingly a high school shop class project), the owner (who, speaking of class, has been known to dress as Adolf Hitler for fun) has simply put lipstick on a pig (or tried to shine a turd, as we say in Oklahoma).  Rather than throwing gobs of money into this renovation, he should have focused on ridding the joint of the most unsavory aspect of the bar: its lame tenders.  Nick's boorish misogyny and racism have driven off more customers than they've attracted and the relatively new female tender lacks even a modicum of charm.  That said, male patrons will be relieved that they no longer have to sneak into the women's restroom to drop a deuce, as was the case previously.  As for me, my boycott (begun when Nick demanded fellatio from a female patron as a precondition for entry a year ago) will continue and I will spend my money down the street at Alembic, where both the drinks and bartenders are thoughtful.", "author": "siegfried s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-02", "description": "I have been going here a lot more frequently on the weekends and I always have a good time.  Great songs on the jukebox, entertaining people to watch and plenty of beer.", "author": "Jenna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-01", "description": "When I first moved here I frequented this place...frequently.  Met some crazy people and definitely consumed more than my fair share of booze and had a blast doing it.", "author": "Rachel N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-01", "description": "Every time I've been here they play great music and serve great drinks. Randomly I ended up meeting one of the bartenders off duty and we all went and hung out.  It's close to my house, divey, and perfect. Minus one star because a gang fight broke out in front of Milk across the street and carried into the bar and the police and ambulances ended up coming.", "author": "Liz O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-11", "description": "I'm the first person reviewing this place? fuuuuuck...well, considering some of the regulars in there prolly don't know the internet from their buttholes it's really not THAT big of a suprise. Wow - where do I start? I'm not as regular in there as I used to be, but Murio's still has my heart as what I would consider one of the best bars in the city. It's the best dive I've ever had the pleasure to live near and a great first date spot no doubt - there's always a nice cross section of the city in there. Lately it's been a little bit on the whiteboy side (I've been going there for maybe 5 years now?), but it's fine. Drink enough with your friends and it's like they're not even there. :) They've always got super nice folks working in there, and the jukebox is good shit. Some of the best pool players in town hang out here so make sure and bring your A game, ya herr?!", "author": "Justin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-02", "description": "my old haunt...many memories of 151 and coca colas with a splash of grenadine up in this piece. good jukebox. A bartender who looked like one of the members of the HIVES used to work there. You used to be able to smoke inside...thats always fun.wicked cheap happy hour,like above and beyond the call of cheap duty.if i wasn't so morally opposed to hanging out on haight street nowadays you know I'd be at this dive in a heartbeat", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-08", "description": "I actually really like this place on a weekend afternoon. It reminds me a lot of the bars in Austin and they have 24 ounce PBR cans, a jukebox, and a couple pool tables. That's really about all I need, you?", "author": "Cory G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-11", "description": "I will always be inexorably  linked with this bar, for being the first time I tasted the evil mistress we all know as Fernet Branca.  All I can say is that was one hell of a night....", "author": "Eagan I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-24", "description": "This place is way too clean and way too bright to be a dive bar. Drinks are not cheap. Single shot drinks are full of ice and not much alcohol. Double shots are stronger but the glass is pretty regular looking for $12. Service is super slow. If you are intending to get wasted on cheap drinks, this is not the place.", "author": "Yenly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-15", "description": "One of the best bars ever... I stumbled in one night, was called an asshole by the bartender (Nick is the best), and then promptly made Murio' s my favorite spot in the bay. They've got Old 97's on the juke box, weird old guys in cowboy hats on any given night, and Craig (my most favorite Ameoba employee ever), I miss Murios. I miss Humboldt Hemp Ale. I miss getting drunk and fucking with the most random people on earth (hello Tom who loves Jack Daniels, Jon the vegan from NY, Fred  the guy on his way home to WA to tell his dad he's gay). This is one of the only bars I've felt comfortable drinking in alone (weird, I know).  It's perfectly acceptable for a girl to have a lonesome pint and tell people to, oh so politely, fuck off.", "author": "Meghan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-21", "description": "I used to work here. What a great fucking bar. A real bar for real drunks. I just wanted to give a shout out. Great jukebox and pool players. I would like all my martinis in rocks glasses by the way.", "author": "Boxxxman J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-27", "description": "Have been here many times throughout the years and it is always consistently fun and entertaining. I have yet to find a more interactive group of people in any bar in SF, including the bartender(s). Always attentive and never a dull moment. Was just there last night and not only was the bartender super cool to me and my drunk friends, but the guys sitting next to us were very fun and friendly in a non pervy way. So say what you must about dive bars, but if you're up for some strong drinks, nice  folks, and great music, this is the place.", "author": "summer r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-03", "description": "THe greatest five bar in the city. Lots of cheap drinks, nice dark atmoshphere, killer music selection and the bartenders are badass! Ask for Nick he is the shit of all shits!", "author": "joshua b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-27", "description": "The best bar in the Haight, hands down.  Punk rock on the jukebox- that's all I have to say", "author": "Aimee J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-05", "description": "Can't escape this place. Best Dive Bar in the Haight. Pool players paradise.", "author": "Jessica J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-08", "description": "a good chill bar. drinks were cheap. a couple plasma's showing the warrior game. dog friendly(those 2 giant dogs were adorable). squirrel monkey's flying around(im dead serious). pool table with good players and a waiting list. interesting crowd. had never been here before dyl, but i will almost surely be back at some point.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-06", "description": "The most grim and filty den of shit  i've ever been in.  The no passport policy is a joke.  Only Americans allowed.  Is this legal.", "author": "Gary J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-15", "description": "$3 well drinks during 7 hour long happy hours - lovely\nbeing told by the bartender to not play journey with the cash he gave me for the jukebox - also lovely\nthe fact that there was a melvins album in the jukebox - !!!\ni'm even down with the christmas lights on the ceiling.", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-20", "description": "II have begun to frequent this bar less. I am an absolute fan of dive bars and obviously because of environment. Lately, I am less than satisfied with the service of the bartenders. Militant group members have more hospitality than the bartenders at this place. As much as I like being ID'd at my age, I feel as though this task has some baring on the hostility exhibited by the employees. There was also the request to listen to a recent sports game, that, as the bartender explained, would cause difficulty for him monitoring the dozen patrons (who were also watching the game) and so proceeded to put music on the jukebox. Before this incident, I paid for a mixed drink that had too much tonic and no alcohol and asked to have it strengthened. The bartender responded rudely to this and stated that he couldn't add more to the drink, but would have to make a new one, much to his chagrin. Now, as much as I appreciate a new drink, I do not feel like wasting a drink that would have been perfectly acceptable on it's own. \n\nThe list of frustrations continue with this spot; most including the service. I don't expect a red-carpet treatment and have certainly experienced my fair share of rude servers, but it appears that the prerequisite at Murios is to treat all patrons with discontent and hostility.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-18", "description": "never had a drink here but I was walking down Haight street one day needing to use the restroom in the worst way so I hurried into this bar...used the bathroom, flushed, washed my hands and headed towards the exit...I heard the bartender say something to me so I looked over... he saw the confused look on my face and repeated \"what can I get you?\"  To which I replied, \"oh nothing I just had to use your bathroom\" THEN he said in a really really pissed off manner \"Can't you fucking read man, the bathroom is for fucking customers ONLY!\"  ... I had nothing to say back, since I was in shock and I'm the one with something lose so I kept walking, thinking \"dam that is one fucked up bartender.", "author": "Adrian H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-29", "description": "you know, I really try to be optimistic. I thought that new ownership would bring back the good ol days but like they say \"lipstick on a pig\"!", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-30", "description": "love this place, it's like the local waterhole of san jose in san francisco that i never had. i would especially like to thank the bartender dude who spikes my hamm's can before serving it. this place has an awesome music selection (dead milkmen is a fave). one night there with my lady folk, i ordered way too many jamo's (whats new) and for some strange reason i ordered a Humboldt Hemp Ale, just to spill it all over the bar, what an ass. To my supplies, that same spike in the beer can bartender was not too mad on the outside. two thumbs up, yo!", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-08", "description": "Ask the barkeep for a what is now known as a \"#1\".....can of Hamms and house whiskey for a finsky.....place is definitely a \"Trophy Room\"", "author": "Joe Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-19", "description": "cheap drinks, friendly bartenders, great jukebox, good spot to play pool.  minus one star for the condition of the bathroom.", "author": "Daryl F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-04", "description": "absolutely my favorite bar in the city.  I moved about a year ago but continue to stop in every time im in SF.  If you have ever felt like a bartneder was too \"cool for school,\" come here.  Nick is the most friendly and engaging drink server i have yet to encounter, and Casey can get into to some really great lengthy conversation with you.  The juke box is sweeeet!  so thanks guys cause without your great staff, you just wouldnt be you :)", "author": "Blanch P."}
