{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "A Mustafio's Pizza review, in haiku form:\nAfter a pub crawl,\ndo yourself a big favor.\nYou have to end here.", "author": "Carl M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-20", "description": "Pizza is tasteless and overpriced for no good reason. Owner is rude. I asked for a specific piece and he acted like he couldn't hear me. He barely warmed it up for me. I am such a pizza lover and was starving yet this was absolutely disappointing. And why is it 4 dollars for a tiny piece of cheese pizza?\nAn ALARMING note. Server came by with whatever dirty water, owner touch it and did NoT wash his hands before taking my box and placing my pizza in it. Disgusting and against ALL FOOD HANDLING BASICS.\nSeriously if you want a good, reasonably priced and tasty pizza go to either Golden Boy Pizza or Pizza Milan. They are both superlative, kind and clean at service and definitely under 4 dollars pour slice!", "author": "Hosna A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-19", "description": "Even after kick'in back a few drinks.  Bleech.  Walk a block or so in any direction you'll find another place.  \n\nAlthough... if you like 90% bread with 10% cheese.  You might like it!!!! \nCheese is weird too... kinda like the times ya try to melt the store bought shredded stuff but gets sort of mushy in a weird microwave way....   Besides, 90% bread is just wrong. \n\nGarlic bread... eh.... where's the garlic & butter?  $5 for stale bread?  \n\nThe wings however, aren't terrible.  They're like the oven baked, frozen Costco bag ones (I kinda like those *blush*)   Note: you have to order them about 20-30 min in advance....  zzzzzzzz  \n\nRelative to all the other nearby pizza places, it's not cheap either.  #fail", "author": "CatwomanRoar M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "This place had a very delicious cheese slice. All I tried and my review is based on the cheese slice. There was lots seating inside. I found this place refreshing especially with all the pizza offerings in the area. The best part of this place was the painting of Al Pacino Scarface. Will have to try the other pizza toppings.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "The Bachelor Party Finale...for some of us at least...it was almost 1:00AM when the bachelor party I was with arrived at Mustafio's.  \n\nIf you're drunk, or high, or both this pizza might be seem absolutely delicious. Probably the best pizza you've ever had in your life, and it'll help prevent a hangover, or at least lessen the pain...5 Stars.\n\nIf you're sober, I'm pretty sure this is just really average pizza.  Maybe worse.  At least these $4.50 slices are huge...3 Stars.\n\nSo I'll just do the math and say its 4 Stars.  \n\nTourist Tip: Last call in San Francisco is 1:45am...plan accordingly.", "author": "Chun P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "I eat here sometimes when I am on Polk Street.  The pizza is excellent and the fellas who work there are real nice.  Great soda selection.  Fast service, pizza served hot and fresh.   AAA+++", "author": "Charlie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "Came here via the Yelp Elite event and was quite happy to find a decent pizza place since I've moved out here!  Came back afterwards to see how they did without the special Yelp event treatment and still was happy!\n\nPizza slices range from $3.25 to $4.50.  Before you jump the gun and be all \"I can get a $1 slice pizza\", this isn't your typical super thin triangle pizza.  When I say these slices are big, I mean they are HUGE for the price you are paying.  I could have easily been full with just one slice of cheese pizza, but I got two as part of the Yelp event.\n\nI base my pizza reviews mainly off of the simplest pizza - the cheese pizza - b/c there's no point in eating something with tons of condiments if you can't even get the most basic pizza down.  I must say that I was pretty satisfied with it- crust was thick enough that you can pick it up without it flopping over (if it's not too hot out of the oven), and not too much cheese that you would enter a food coma.  Thankfully not too much grease either- sometimes I find myself dabbing my slices with a napkin but this time I didn't really need to do it.  I also had a slice of their Hawaiian pizza- I liked how the pineapple chunks were small/ plentiful enough that you didn't have to tear through a piece/ awkwardly drag it off the slice when you bit into it but there was enough to give it a sweetness to cut the saltiness from the bacon and ham.  \n\nOne thing to note- the pizza slices are thick so if you are a fork and knife person (like me), it might be a bit thick to cut.  Luckily, the waitress offered to cut my slice into smaller parts, but otherwise I recommend just waiting for it to cool before using your hands (since as I said before, the slices don't get too soggy / become limp).\n\nIf you are out on Polk, craving pizza, and want a bang-for-your-buck, I'd recommend Mustafio's!  Added bonus- if you check in on Yelp, free garlic bread when you order a pie of pizza (need to check this out eventually).", "author": "Audrey H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-05", "description": "Horrible serve!!! cold pizza!!!!\nWaited for customer service person finally showed up. (No one else in place). He was more interested in a video on his cell phone...than his job.. acted like I was bugging him. No thank you either. Avoid this place pizza was cold, greasy and kinda tasteless", "author": "Chris W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-01", "description": "\"You took a pizza my heart\"\nMy thoughts when I met the manager and chef. Such a great guys and you can see that they really do care about their customer, by always updating their menu every week to months. They told me that they will have a siracha and white sauce with seafood flavor in the next month. So I will look forward to trying those next time. \n\nBut this time I got the combo (I know I'm basic) and their pesto chicken (I believe) and they were really good, love the pesto chicken flavor more. He recommended that flavor to me and I'm glad he did. I really want to try the pineapple aka Hawaiian one next time. Oh and let me just say that I love pizza spots that make their pizza in a rectangle shape with less crust. Truly get then whole pizza with the flavor and not the crust, so you get your money's worth. Also they have a check in offer with free garlic bread which is pretty darn cool.\n\nOverall a great pizza spot that deserves to have more support because if you just talk to the manager there you will see how great of a person he is and how much he really cares about each of his customer. And he really appreciate any and all the feedback that are given to help improve his restaurant.", "author": "Christopher G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "For what you pay: large rectangular slices. Cheap!\nAmbiance: small, few tables but lots of nearby parks!\nService: Wonderful!\nTaste: amazing\n\nMustafios is a petite shotgun style joint infamous for drunching out and inconspicuous for good sober pizza.  Open till 2am. This place gets a lot of attention from an intoxicated reviewer. \n\nFast pizza usually means greasy and gross. Whenever I get pizza this fast I'm typically wary of taste and worried of loss in flavor. They used an oven to reheat my two large pre-made slices. Instantly I had high school flashbacks of large sheet style pizza rolling through a toaster oven to produce a pitiful portion of saucy cheesy bread with toppings.  \n\nThank goodness this wasn't the case. This pizza is prepared diligently prior to its reheat.  In the ingredients compilation is where you will taste the difference in this place and other chain pizza joints.    My chicken pizza slice was raft with spinach , cheese and white sauce buried one below another and did not at any bite feel lacking in ingredients. I did prefer the chicken pizza to the pineapple pepperoni. The red sauce has a lot more twang, very Italiany and well balanced with salty meats. Highly recommend. \n\nOverall this is place is a fast yet yummy place to get pizza. Don't come here looking for provenance- it is good, cheap and quick pizza.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-05", "description": "This pizza tastes like oven cleaner, WTF?\nNice guy working but again WTF?\n\n\nFux club xxb by DC fcb guy fee e.g. by yeh it RSS guy it eh it eh it enough he funk or dvi USB it GB", "author": "F G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "Came here on a Wednesday evening with a couple of friends. Outside the glass window, you can see the square pizza slices that instantly draws you into the store. When you walk in, the atmosphere is a typical pizza place with high tables and seats near the cash register. Pizza slices are huge for their price and it's inexpensive. I got the pesto chicken slice and they heat it up for you in the oven. The pizza came out sizzling hot and I was satisfied with the deliciousness. I sprinkled my pizza with all kinds of condiments- cheese, pepper, and oregano cause I like lots of flavors on my slice. They have other original flavors like cheese, pepperoni, Hawaiian, combo, and different flavors that are not listed on the menu. The price is under $5 depends on what you get, which is affordable around the neighborhood.\n\nStaff are extremely friendly folks there, they were so welcoming to us when we walked in. They also came to our table to clean up our pizza mess. \n\nIt is also a good place after the bars for affordable food when you spend too much on drinks. ;) \n\nTIP: Check-in for FREE garlic bread. The portion size is HUGE and loads of carbs. It also comes with marinara sauce We couldn't finish it, but they allowed us to have the garlic bread to go.", "author": "Judy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "These square pizza won my pizza snob boyfriend's seal of approval. \nHad hawaian and combo. Both were delicious. The meat they use really stands out from most pizza places. It doesn't taste cheap, the meat actually has characters. (Yes, meat has characters! This girl loves meat that much!)\nTheir sauce has an extra spice kick which goes very well with pepperoni and sausage taste of the combo pizza. \nDecent amount of topping, decent size, decent dough texture (and not burnt). The dough may be too thin for some, that's where you fold it and stuff it. :D\nBest of all, the owner and the staffs are very nice. Friendliness is one of the best topping on pizza. :)", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-20", "description": "The pizza was delivered it WAY earlier than its supposed delivery time so i thought maybe it would've been bad but no. \n\nThe wings were also very spicy.\n\nOverall the pizza was worth its money.", "author": "Eimond R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-06", "description": "I had this when I was drunk, I thought it was good. I tried it when I was sober, I thought it was good. So I think it's good. \n\nRecommendation still: pesto chicken pizza with a side of ranch. GIT IT.", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Best place ever. My husband loves the Scarface motif. We both LOVE the pizza and wings. They have the square end slices and I don't care what anyone says this might be one the best slices I've ever had. The guys seem busy but quality is important and this place is worth the wait. Also open late perfect for the night owls .", "author": "Roxanne N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-16", "description": "The pizza here is very distasteful. Was not happy at all with the quality of cheese or pepperoni.. seems like they chose rather cheap ingredients. Slightly overpriced for what it is, probably will not come back again or recommend this place to anyone else. Just walk a block or two in any direction and you will find better pizza, I'm sure.", "author": "Camille C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "Calling out all pizza lovers out there! Mustafio delivers a solid pizza pie or shall I say pizza rectangle? The slices are the size of a 4×6 picture. Let me give you a snapshot of my quick dining experience at Mustafio. As I approached the restaurant, I looked through the glass window and gazed at the selection of hot and ready slices. They offered the basic slices such as cheese, pepperoni, and  Hawaiian. Why be basic, when you could be gourmet? Of course i opted for the Veggie Pesto. The pesto was fresh, packed with flavor and generously slathered under the layer of gooey cheese. Then topped with slices of tomato. What really stood out in this masterpiece was the crunchy crust. I really enjoyed the contrast of the crunch and the soft texture of the cheese with all its fixings. \n\nWould i come back?! Yes, If I'm in the area you bet I am.", "author": "Briana H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "I was on my way to Slider's to grab a burger, but then I walked past Mustafio's pizza which smelled awesome.  I had to go in and get a slice.  \n\nBeing from NYC, I'm irrationally elitist about my pizza.  The slices are a bit pricier side of pizza- but I think for the portion and quality you're getting - it's pretty spot on.  \n\n- I wish the crust was thinner and crispier, but I think the owner is working on that. \n- The cheese was amazing and bubbly.  \n- Dough was soft and chewy.  \n\nIt's probably the best pizza you'll get in your area and the owner puts a lot of love into the business to make sure the pizza is good.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-25", "description": "Ordered from here after 10:30 PM after getting back to the hotel room after a long day. We used Door Dash, because we wanted it delivered. We ordered a slice of pepperoni, a slice of cheese, garlic cheese bread and buffalo wings. The garlic cheese bread was burnt, to the point where the entire bottom of the crust was black. The buffalo sauce wasn't hot and it didn't have a good flavor. The cheese they use didn't taste like real cheese. It could be the hour we ordered and that's why nothing was of good quality, but still, very disappointing. All of that food and they only allowed us two small ranch sauces. I wouldn't go back there ever again.", "author": "Selecia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "I am biased because this is one of my favorite pizza places but it's for a reason. Even though they are recently under new management the quality of the pizza remains the same. Great late night post drinking food. They're fast and it's hot. Don't expect to be able to sit and eat. It's always packed especially once its gets close to last call so be ready to take it to go.", "author": "Tamara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "I stopped by Mustafio's today as part of the Yelp Elite experience, and I'm glad I did. This is surely a cure from the dominos experience, giving off the more neighborhood joint feel. The owner was also super friendly, and provided me with multiple suggestions on sauces to eat my pizza slices with. \n\nThe pizza slices themselves are thick (just the way I like them), which a generous portion of sauces and meat. If I'm back on Polk for an after work drink and need some quick dinner, this will be at the top of my list. \n\nMost importantly, service is fast and the management is friendly.", "author": "Nancy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "What a pizza! We came here with a group of friends and had an awesome time. Service is friendly and pizza is tasty and fresh.", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-08", "description": "So I only tended to come here between the hours of 1 AM and 2:30 AM if that's any indication of why I'm here.  Being one of the only pizza place open after a night out the place is still pretty good.  The staff is friendly and the pizza itself is alright but gets the job done.  If you happen to be strolling down Polk late at night and you need to satisfy your pizza craving, come here.", "author": "Maurice O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-18", "description": "Overview:\nVery greasy - yet flavorful - pepperoni pizza by the slice. A box will cost an extra .35 and well worth it to absorb all the grease. When I first opened my pizza box and saw all the grease absorbed into the cardboard I had a knee jerk reaction -- and the reaction wasn't a positive one.\n\nAmbiance:\nCool vibe inside. Great seating. Friendly workers create a warm and welcoming space.\n\nMy advice to you:\nOrder plain cheese. I have suspicion the grease was mostly from pepperoni.... Right as you get it place a few napkins on top and bottom - a  real pizza eating sin according to my Italian friend... something I've never done before because of growing up with my Italian friend.\n\nAbout me:\nI was perfectly sober like a Mormon when eating this pizza. Also, I've had the best pizza in the city - Tonys, Mozzeria, Firetrail, & Golden Boy. I've easly become a pizza snob as a result. Also if anything is really good I become price insensitive.\n\nConclusion:\nPerhaps if i was really drunk - lets face it... this place caters to the late night bar crowds.... I would have loved it. Will do my best to come back and re order and try a more plain pizza slice... and update this review... If I had ordered a  plain cheese I would guess I would have rated this much higher - keep that in mind in consideration of my review.", "author": "Stefan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "Bomb dot com! \n\nCame on a random Wednesday night after celebrating our buddies birthday at a nearby bar.  Half buzzed, we were craving some pizza.  I thought of this place instantly when we were walking up Polk Street.  Ordered a slice of combo and a slice of pepperoni for my fat ass and it HITS THE SPOT! Best pizza in town.  Unique and it is a square shaped pizza! Spoke to the big boss there and he mentioned that he named his pizza place Mustafio then also named his kid that too! Awesome dude.  I definitely will be back since I do just work around the corner from here.  Definitely recommended if you are craving great SF pizza!", "author": "Ben Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "This is the best pizza I've had in San Francisco ever! It tastes wonderful and the crisp on the bottom is to die for!", "author": "Theo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "Fucking bomb ass pizza. The most delicious, perfect pizza I've ever eaten. 13/10", "author": "Jake H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-29", "description": "before pacquiao there was only one filipino hero widely known to americans: rufio.\n\nya i'm talking about bruh who held down neverland while robin williams #rip was out adulting.\n\ntoo bad #spoilers dude got impaled or he might be around to try the pizza from his cousin mustafio.\n\ntoo bad clams aren't around either - must've been out bc i was given anchovies instead. clams were why i chose the SEAFOOD SPECIAL \"sauce, shrimp, clams, parsley, garlic\" but whatev.\n\nmaybe the switch was a gesture to replen my electrolytes from the funky bicycle workouts i've been doing. salt salt salt.\n\nfrom ordering to eating in 45ish minutes quick.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "This place has decent American style pizza, but it's great for those drunkin' nights on Polk st.", "author": "Josh Giosue D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "Came here for a slice before starting our Crawloween pub crawl in the neighborhood. This is the perfect place to come to for a pre-drinking meal as the pizza is soaked in saturated oils and is cheesy, carby deliciousness. \n\nIt's pretty small inside though so be prepared to eat standing up if there are a lot of people inside.", "author": "Anita L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "Pizza here is cheap and big servings. Come here if you are looking for drunk food or a cheap bite on Polk. Just another typical pizza place. I don't have too much more to add.", "author": "Ross S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-20", "description": "Probably an unpopular opinion but this is one of the better corner street pizza joints near a plethora of bars you could ever ask for.", "author": "Sara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Back to basics! I came here as a Yelp Elite, and was definitely not disappointed. I had two square slices (one with just cheese and one with cheese and pepperoni). It was nothing fancy which was perfect since I was craving a quick, casual bite without all the frills that some pizza places have. The crust was crispy on the outside and soft on the inside, just the way I like it; and not too thick nor too thin. The pizza in general was awesome and it wasn't too salty or too greasy. The service was friendly quick, and the restaurant itself was small-ish but with a good number of high tables and bar seating. Overall, I had a great experience with the food and customer service and i look forward to coming back again (or ordering delivery) and maybe throw in one of their desserts next time ;)", "author": "Bianca C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-30", "description": "Late night dinner because I was having too much fun at the Exploratorium I forgot to eat dinner. I wish I knew more great late night bites but I really don't. Not a fan of bar food which seems to be the only place open past 10pm. \nWe ordered three slices of pizza, Hawaiian, pepperoni, and chicken pesto and side of Caesar. The dough was meh, sauce nothing special, and toppings were the usual suspects. It was all just meh for me. Total for 3 slices of pizza with a side of Caesar was around $18. Probably not coming back although about half of the patrons seem to be regulars especially the cops.", "author": "Naty D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-14", "description": "A prime location for some easy drunchie food, Mustafio's sign outside glowed and enticed me to go inside for a slice of pizza. After such a fun night, I didn't really care much for gourmet (plus, there's no gourmet at 12am anyway..)  so  I readily stepped inside the simple-looking pizza shop. Despite its appearances, Mustafio's menu is extensive... a variety of pizzas and desserts and other Italian dishes are available for ordering. However at the time we went, there weren't a whole lot of selection left for slices. Priced at around $4-$5, I thought that was pricey for the size of the pizza, and the pizza wasn't really that toasty either... However, I'd be willing to give Mustafio's another shot if I am in the area again, maybe get a calzone next time, or hopefully they'll have a better selection for us drunk zombies looking for a good quick bite.", "author": "Evelynn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "My favorite pizza spot in the city! They know my order when I come in. If your looking for a tasty slice of pizza this is your place. Staff is nice and friendly. Added bonus is that ranch is free!", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "Good service. Great pizza. But sometimes the service can be crappy. Too many drunk people and seating is overly limited. The pizzas are great. Its already made and ready to go. I keep going back", "author": "Ronald S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-27", "description": "I was in the area for a meeting, starving and short on time. I saw they had slices so I went in to grab a pepperoni slice. It took a while. In the middle of my paying, the guy went to take pizzas out of the oven (which is fine, i appreciate attention to quality control). The result of my waiting was 2 fresh pies - I think a veggie one, and a ham+ other toppings one. So they had 4 options to choose from at 12:30pm. Even though my pepperoni slice was ready in less than a minute, I had to wait closer to 3-5 minutes to actually pay, so if you're in a hurry, account for that. \n\nThe thing that struck me as not-so-great was that he dropped a pizza pan on the ground, and just picked it up and put it in the stack of pans that he uses to bake pizzas in. So the bottom of that was touching the top. Again, I personally don't care all that much. Germs are necessary. But I don't think other patrons would appreciate that. \n\nThe slice was fine - it was doughy, large, tasted fresh and hot. I liked how there were 15 condiments laid out for patrons to use, including a sriarcha mayonnaise.", "author": "Amy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-21", "description": "Great pizza especially late night. As you can see, it's quite busy and it's almost midnight on Friday night. They had no problem adding pineapple and jalapeños to their veggie slice of pizza. The sweet worker even offered to cut my slice into three, since it's so huge. They even had ginger ale.", "author": "Wendy A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-09", "description": "Long term customer that is now moving on\n\nNever again \n\nWish they didn't change things\n\nBut sometimes it's time to make a change \n\nThey made the decision extremely easy\n\nFarewell", "author": "Scott H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Frankly these guys are the best.  Their pizza is simply wonderful and they care about their customers.  My favorite is the Chicken Pesto Slice or the Veggie Slice and they don't scrimp on the veggies...\n\nBUT\n\nI'm working my way through their menu as they have great salads and other sandwiches I want to check out too. I write few bubbly reviews but these guys deserve five stars and they get it right!", "author": "Dalt W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-16", "description": "Pizza wasn't anything special. $4 for a good sized slice, not bad compared to other places in the area. \nThe girl that took my order never took her eyes off her phone screen the whole time. \nSlice was re-heated for about 80seconds and dropped on a plate. \nI wouldn't go out of my way to eat here, but if your headed home from the bar at 2am what more do you really need?", "author": "Simon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "Pizza place open late! We were exhausted after a day of walking around the city. Came back to our hotel to find room service was over. My teenagers were famished even though we had an early dinner. Ordered from them at 1140 pm. Pizza arrived 30 mins later. It was cheesy, greasy, yummy goodness...as expected. We got Hawaiian, cheese and halal pepperoni. We don't eat bacon and the turkey bacon was fantastic! The slices had great quality ingredients. We'll try the pesto chicken next time. Pizza was great, service prompt, the severs on the phone very helpful.", "author": "Emad A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-13", "description": "This is a nice pizza place. The pizza slices are square.  The toppings are generous. Overall, their pizzas are good. I also like their Tiramisu cake. The place is clean. Customer service is good.  They are open late. \n\nSince there are so many pizza places in San Francisco, it is hard to give it more than 3 stars. Other than the shape of the pizza, there is nothing really unique or special about their pizza.", "author": "Hiroshi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "Had a couple of slices of pizza from here. Pretty good customer service. The pizza is delicious love the basic pepperoni or combination. \n\nThis pace is also surrounded by a bunch of pretty good bars that I've been going to for the past 5 years. Who doesn't like a bomb slice of pizza after a night out drinking. \n\nOne of my top spots when I'm in the area.", "author": "Xavier R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "This is the BEST pizza!!!!! They are very generous on the toppings and the crust is excellent. They are my very favorite place for pizza!!! I highly recommend coming here!!! You won't be disappointed!!!! \nTheir salads and deserts are very good too!!!!", "author": "Sherri K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-07", "description": "Ordered pizza and garlic bread for delivery. Got here on pretty good time. Pizza was good, garlic bread was cold", "author": "Kelcee F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-05", "description": "Came here after playing across the street at the Hemlock Tavern. Ordered two pepperoni slices. Loved it! Will be back for sure.", "author": "Russ A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "This is some solid drunk person pizza. I think that's the best way to put it. It's not fancy, it's some greasy, glorious pizza that you get cause you just need some pizza and you need it now. The restaurant itself is really small and the garlic bread could be way better. And my boyfriend got lots of toppings and regretted it a bit, where I just got plain cheese. Our consensus was that this place is best if you just want some quick and simple cheese or pepperoni pizza, no frills.\n\nThat said, we'll be back.", "author": "Kristen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "Solid, yummy pizza right around the corner from my home. Super friendly staff. Got the Hawaiian and cheese slices. Nice thin crust - just the way I like it. Perfect for a cheap quick dinner or an after-bar snack.", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "Great tasting pizza and friendly service!! Definitely recommending to anyone out of town and that Red Velvet for desert, daymmmmm", "author": "Raul D U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "Best pizza I have had in the city. I would definitely recommend this place to friends and family. Pizza slices are great and prices are great as well.", "author": "Brenda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "Hella good pizza after clubbing/drinking! I LOVE IT. Fast! Delicious! Just needs more seating..", "author": "Leah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "Great pizza and great hospitality at this place! Pizza was fresh and flavorful, can't be beat. Much better than Golden Boys!", "author": "Wailan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-29", "description": "While finishing up a pizza, I found a small strand of hair on it.. 5 minutes I tasted a hair on my tongue & It made me vomit.", "author": "Francis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-14", "description": "I had this review drafted and forgot about it! \n\nBumping up a star based on EXCELLENT customer service by the owner. After my initial review, he contacted me via Yelp and offered to deliver for FREE the same order with an additional strawberry cheesecake! And not only did he follow through, he delivered the pizza himself personally! So rare that an owner takes such matters into their own hands and customer reviews seriously. He was so apologetic and friendly! \n\nThe pizza delivered was the correct pizza this time, however maybe because I am in favor of  thin pizzas (and granted margarita and pesto pizzas are normally on flat breads) it just seemed to lack something. All the other reviews were of meaty, cheesy pizzas, so perhaps those are the more signature dishes. Will be back to give them a chance!", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "**This review is for their take-out service only**\nAfter having a couple of adult beverages at Jackalope right next door, ya girl needed a pizza to soak it all up to prevent the unpleasant after-effects of alcohol. We were on our way to the Tamia concert at the Regency and were thrilled to see we could grab a slice of pizza before heading to the venue.\n\nWhat caught my attention was the delicious looking pizza that was displayed at the front window. Going in, it looked like there were a few customers enjoying their pizza whilst sitting on bar stools. It's a small place with a few chairs, so they can't really accommodate too many people.\n\nAnyhoo, the pizza I chose was the vegetarian pesto slice. It had pesto, tomatoes, and feta cheese as well as the obvi cheese and sauce and it set me back $4.75. For $5 I would think they'd include a drink with the purchase, but because the pizza is so good, I'll let it slide and still give them 5 stars. The crust was probably my favorite part. With each bite, it had the perfect combination of crunch and chewiness from the pizza. The tomatoes were very flavorful and the feta cheese wasn't overpowering. I also appreciated the fact that it was a square slice = basic geometry = triangle slice (less pizza) = rectangular slice (more pizza)\n\nHighly recommend, I will definitely be back to try the rest of their menu.", "author": "Kathleene E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-18", "description": "Ordered one large Pizza ( meat ) and one medium Pizza ( Veg). Paid $70 including tip for delivery. \n\nPizza size was good, it had no taste. Frozen veggies, thick crust and cheese was sub standard. Had two slices ( hunger does that ) and threw the rest of veg pizza. Cannot recommend. They need to get better and improve.", "author": "Vish C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "I remember going here alot back in 2007. It was good then,and not sure why I stopped going. I guess cos I moved down to the SOMA. And then lately I was looking for a new pizza delivery option and found this place again. Glad I did! \n\nOrdered last night on 9/15/15 on GrubHub.Here's my review.... First the delivery person was cool. Quick and painless transaction. Second the food is really really awesome. IMO there aren't very many good pizza options in SF,and places in the TL are usually terrible imo.And just SF in general is notorious for having really bad pizza. Don't get me wrong though,I'm a native,and I even admit that alot of SF pizza really isn't that good. But then there's this place.... Not the most epic pizza I've ever tasted but pretty good for SF. \n\nLove the square pizza slices!!!!!! Highly recommend them. I had pepperoni and a Hawaiian slice and they both rocked. The cheese and the sauce tasted pretty good. The cheese didn't have a funky smell and that's a huge plus.\n\nAlso ordered the Pepper Chicken Sub sandwich. It was really really good. Still got leftovers in the fridge. Plus they carry those rare Fanta sodas!!!!!!\n\nNow for the best part,their desserts. OMG please try the red velvet cake! It got me so stuffed I ended up sleeping pretty good last night. I will revisit them again for sure.", "author": "Isabella A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "This has become our GO TO place when drinking or otherwise on Polk (love Vertigo!) and sometimes you need something quick and delicious... PIZZA warmed and served by friendly people is the perfect quick break that might just help extend your festive drinking and partying!!! Love the pesto veggy and I'm far from a vegetarian!! If only they offered a pepperoni and sausage with pesto! Yum!\nThis place is fast, cheap and a perfect fit when you need a slice!!!\nParty safe, sexy and be nice!\nCheers!", "author": "Sean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "As fast food pizza places go this is my favorite in San Francisco. Maybe that's because I live so close to this one, and try not to get pizza too often, but I love pretty much all of the varieties I have tried here. \n\nThe meat combo slice is the slight leader. I always put Sriracha mayonnaise on all the slices too. The prices are good and it's fast. \n\nIt can get very busy at the weekends, late at night particularly. But worth the wait.", "author": "Derek M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-25", "description": "Simple, not a great welcoming service. The pizza doesnt taste good. Rather go to Papajohns or pizzahut. The garlic bread that comes with yelp check in is disaster and dreadful.", "author": "SuJun K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-27", "description": "I've been sort of paying half-attention lately as I passed this stretch of Polk Street on my daily commute down to Civic Center.  After noticing the sign a few times over the past couple of weeks, I walked by last Monday to find that Mustafio's has finally opened.  The store-front is very bright and inviting, revealing pizza in the window and a nice counter and table area to stop and grab a slice.\n\nWhy You Want to Stop In and Give it a Try:  Nice Ownership.  The service here could not be friendlier or more welcoming.  It's a nice spot to grab a slice.  There's no gimmick or particularly upscale element to the place - it's finished with a nice wood counter, wood high-tops and stools, and pizza in the window (a la Golden Boy - although the windows don't open.  And, I'm not comparing the quality to Golden Boy).  It's a nice addition to the block, and gives a less \"grimey\" option to pick up a slice after an evening of Polk Street reveling.  \n\nThe pizza itself is solid, if nothing revolutionary - although, pizza is not necessarily something that needs to be reinvented.  This is standard by-the-slice pizzeria fare - maybe the one deviation is that the slices are rectangle cut, rather than traditional.  The crust is relatively soft and chewy - not doughy.  I'm a fan of the sauce - which is sweeter than some.  I think it's really good with the cheese blend they use.  I also tried a slice of pepperoni and sausage, and I liked the fact that they make it so the pepperoni gets pretty crisp.  I believe they are still finalizing the menu, but they have a veggie combo that I have not tried and the owner tells me it's pretty good - he uses roasted red peppers.  (Picture below)\n\nOverall - a big chunk of the four stars goes to the service and the environment.  If you're in the neighborhood, come in and say hi.  They do offer free delivery, which is a nice bonus.\n\nWelcome to the Neighborhood, Mustafio's!", "author": "Adam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Exactly what I needed. About to leave San Francisco for the drive home and the kids wanted pizza. This place said pizza by the slice and it was ready when I arrived; just waiting for someone to eat it. Went in about 8:40pm on a Monday night. Left within minutes with three delicious slices. Couldn't be happier. Thank you!", "author": "Diego M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-21", "description": "Not a bad pizza at all and the crust is solid. Not like a brick but enjoyable with a nice crunch to it. If you like soggy thin crust pizza then do not come here. I myself enjoy all different kinds of pizza and this is pretty good. I feel it lacks some flavor and I thought there needed to be more pepperoni on the pizza. The veggie was good as well. The slices are large so if you can't eat a lot as myself or want to waste any food then just order a slice instead of multiple.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-04", "description": "This place is such a hidden gem - well maybe it is famous in the city . \nWhen you walked in this palace, it is not your regular pizza place - it is a mix of a Mediterranean market and pizza spot! They even have a little market section for you to choose some fresh kebabs to go !\nThe dough is what makes this place special - per the owner, they imported the flour directly from India ! I didn't believe how different it can be until I took the first bite of my pepperoni pizza - it is SO good ! That special taste of the dough is so amazing and I will come back again.\nIt is a tiny place and a bit aged . Definitely a good place to munch on after a drinking night .", "author": "Ivy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "Please take my review with a grain of salt as I usually come here intoxicated and hungry after hitting up the bars on polk. I've been here several times and the pizza is always fresh and delicious. The other evening after ordering and inhaling  a slice, I got back in line for round 2. That's how good it was.", "author": "R B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "Great place to go after a night of bar hopping on Polk. \n\nI would say their pizza is just okay, nothing special. If you order a to-go box, they charge you extra so I always just opt for the paper plate. Also, most importantly, don't miss out on their condiments at the end of the line. They have the usual cheese and pepper flakes, but one thing that really caught my eye was the sriracha mayo. Omg it was so good. Must try!!", "author": "Carrie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "This place is my go-to for a quick bite. The staff is nice, the prices are fair, and they always provide prompt service. Don't walk in expecting VIP treatment and you won't be disappointed.", "author": "Steven R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "I had a chicken pizza. The chicken was not dried out and the toppings were good, I would order from them again :)\n\nIt's pizza, not rocket science!", "author": "Marlyn F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-14", "description": "We ordered a pizza through Eat24 since it had 4 star review on the app BUT we discovered a hair in one of the slices. We contacted Eat24 and the restaurant wanted their pizza back for proof. Who ever asks for their food back?! Eat24 claims they will issue a refund once they get it back, we'll see. It's been over an hour since they said they will pick it back up, so ridiculous. \n\nThe pizza itself is in a square with more crust than anything else. The center is extremely soggy and it's just a really generic pizza. We will never, EvER order from this place again. Save your money and go elsewhere.", "author": "S L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-21", "description": "3.5 Stars\n\nCrust was crisp yet surprisingly light and airy\nToppings are standard, doesn't steal the show but easily forgettable \nSmall space so recommend ToGo\nSkip the wings-no texture, skin was soggy and the sauce was bland \n\nOverall Thoughts\n\nCome for the slice, forget the rest", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-26", "description": "Ordered a pizza online, paid for extra toppings but apparently there is a glitch in their system and the items did not appear on the order.\n\nI don't mind that it took an hour to get here, but it obviously sat in the box for a 40 minutes before it reached me, I am heating it up in the oven as I write this.\n\n$38 for a cold 16\" pizza with 3 toppings, and we're talking low-end pizza here, but San Francisco isn't known for its pizza afterall.\n\nCustomer service also lacking.", "author": "Ryan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Got a pizza delivered from here using RedPie. It came super fast (15 minutes) and it was hot and delicious.\n\nI've also been here in person and the owners are super friendly and welcoming, no matter the late hour of the night. Slices are consistently fresh and delicious, enough to warrant a revisit every time I stumble onto this part of Polk St. on weekend nights.\n\n---\n\nDistinguishing factor: The best pizza you can get this side of Polk and during late night hours", "author": "Nick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "This place is awesome. I discovered it accidentally three days ago while strolling through my neighborhood and have gone back every day since!\n\nTry the vegetarian slice, it's definitely the best imo and I'm not even a vegetarian. That being said, they're all good.\n\nService was good, staff was polite and apologized when I had to wait for my slices. This is now one of my favorite sf \"by the slice\" pizza joints for sure.", "author": "Philip M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "One of the best pizza place in San Francisco. Besides the shape of the slice, the taste is different than the other pizza around. The crew was friendly. I recommend highly Mustafio's", "author": "Mohamed S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "Popped by this place after Edwardian Ball across the street. They had a decent selection of pizza from Hawaiian to pepperoni and sausage. I got a slice of chicken and spinach but it wasn't warmed up enough so was really dry whereas my husband got a slice of pepperoni and sausage that was fresh, but be warned, it was really greasy.\n\nIt's fine for a quick fix in the middle of the night as they are open till 3am and the staff was really friendly which was nice! Four stars for the service and three stars for the pizza.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "My favorite cheap pizza place in the nabe! There are lots of mediocre places nearby but this place stands out for the quality of ingredients, freshness, and service. They recently remodeled the inside with new tables/seating and chalkboard menu. They accept credit cards and their pizza slices are reasonably priced. I like the pesto vegetarian slice the best.", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Best pizza and sandwiches on Polk. Hands down. The staff is alway friendly and more importantly prompt!", "author": "Damien H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-09", "description": "At first glance, it's hard to take this place seriously, as any other pizza pop-up joint on Polk St. I must say though that I have been here about 4x since they've opened because I live in the area and as far as pizza goes, this place does it surprisingly well. You can't tell looking into the window... it really looks like your average \"I'm super drunk so I don't care what I eat\" pizza. But if you can get past that, try it out - you may be pleasantly surprised.\n\nI love the way they toast their pizza up quick and the crust is all around CRISPY. This is a tough to find characteristic at joints like this. Yes, the pizza slices come at a slightly higher price, but they are quite filling in proportion and well worth the pizza cravings inside me. I look forward to coming back again as a frequent customer to try their other menu items!", "author": "Joanne Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-16", "description": "I jate to give this place 2 stars but unfortunately eveeything has changed for me since the asian guy had start working here.. Cold as stone......   My first time seen him, no one was at the restaurant i walked in. Said hi to the girl at the register,( she knows me) so i kept walking to the bathroom this new cook cuts me off saying bathroom for the customer only, i told him i m a customer then he told me i should by something i told him look i m on my way to the bathroom how do you want me buy the food, plus what is wrong with my look that you got that attitude?? Then i walked to bathroom..\nMy second time seen him he was cleaning the bathroom, was prrety much done with it Maupin out side of the bathroom.. Right before i say can i use the bathroom and angree voice came out of him. Saying restroom is closed sir.. When i was about to say can i just wash my hands another angree noise came out of him saying. Same thing zrestroom is closed sir..\n Then i said, hey uu.. U take it easy haa... Then he shot up, kept Maupin....\n  After another while i decided to give the place another chance because i really like their pizzas.. \n I walked in just to make sure he was not the cook for the night. And guess what?? He is there.. All the way in the back, laying down on something and his feet were on the wall.. I just turned my back quick and walked away...  When ever i have seen this guy there either there is no body or the least people comparing to any other place around there..\n  I seriously do think so even if this cold stone pay money to the owner not the owner to him... The owner should not keep him for one more they.... And he ahouls go do some jobs that is non customer related...\nSomething away from sociaty, so he does not mess with the air...", "author": "Wolfy E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "Friday around 11pm I ordered a Calzone as I wanted to try something new even though the pizza is great here. Usually the food arrives in 60 mins but I was fortunate and it arrived in 40 mins on a Friday night!!! I was so happy. Plus, the Calzone was really yummy and done well! Also the chocolate cake was a delicious dessert. This is my go to pizza place!\n\nI notice the haters on here.. And that's fine. U can tell these bourgeois have an inflated self-entitlement complex going on and haven't become self aware. But ask urself, do you think these haters have lived in San Francisco long? Most if not all of them have been in OUR City for under 3 years. These haters may just be part of the \"tech\" culture that have infected our streets which has manifested in them driving art and culture out of our amazing city. These are the same \"people\" that think modern art can be bought at IKEA  \n\nPlease no self-entitled glASS holes in OUR city.\n\nP.s. No Promo! But I ordered from yelp/eat24  app and it's much easier for everyone.  Calling in an order is so 1996.", "author": "Rosa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "Came here after the bars last Friday night. I'm positive it's not just the alcohol talking, but their veggie pesto pizza was on point!! The 'slice' they give you I feel is equivalent to a half personal pizza. So good I made my friends wait while I got another slice to go!", "author": "Kirsten M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-08", "description": "Pizza was not good. I've tasted frozen that was way better. Also, overpriced compared to other places in the area. For a pizza \"I can't refuse\" no seriously I don't want it.", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-19", "description": "Good simple pizza by the slice. Or should I say by the square. \nWhere Golden Boy is a deeper dish, this pizza is more like a \"regular\" thickness crust. \nI like squares better than triangles when it's by the slice. \n\n2 pieces were $8 and change, heated nicely and put in a box. Got my pizza carb fix quickly. \n\nIn the heart of lower Polk, I will come back", "author": "brian k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-30", "description": "I hate to do that but..\n\nI ordered two times through eat24. Two times the same pizza. I have eaten there several time after a drunk night on Polk.\n\nThe pizza were good. Amazingly good. \n\nThe second time, the pizza came 2,5 hours late cause \"the delivery guys has been robbed\". Sad for him, but they didn't offer any drink/or whatever to make it up for it. I ordered during the Ramadan on a Saturday night. I had eaten nothing since friday night and eat nothing after that pizza (A lot of water but nothing else, poor diet but hey, I was fasting haha).\n\nIt ended in a viral food poisoning: 4 days off of work with doc papers, 102F fiever and 5 pounds lost. And of course, my fasting ruined for more than a week. This is the worst situation I have ever been in. Really bad. I never felt that sick.\n\nAnyway. I don't know what happened, but since that pizza was the only thing I ate in the past 2 days before being sick, I would not recommend that place nor order from them ever again.", "author": "Tarek A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-26", "description": "These guys make great pizza at great prices. Been ordering from them for months and always try a new pizza every time I do. I've had the Hawaiian, the Chipotle special, the Margarita special, even decided one time to try their gyro and all of their food is really good.", "author": "Roger M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-29", "description": "Giving this spot a 4 ! Totally unexpected but hits the spot! I like this place because they serve the pizza in a big squared shape! Ufff! Fire!!!!! Blast some sriracha mayo on your slice and prepare to enjoy!!!! Nice and quick, and each slice is a decent size. Its right on Polk! Bunch of bars and stuff around.", "author": "J M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "One of the best pizza places in San Francisco! Really good service and very friendly stuff. Highly recommend this place!", "author": "Gulzat S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "Fast service and excellent pizza! Went there at 2am and there was of course a decent line with everyone out on a Saturday night. Had the veggie pizza and it was definitely up there on my list.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "Still great pizza. Still the freshest. Still Halal. I ordered a sausage, pepperoni and green pepper that was going to be served to Muslim guests as well, and it didn't fail to dissappoint.\n\nMost Halal pizzas taste like they were made with butcher's hands, but this place has pretty much got the ingredients down, to the point where my guests didn't believe it was Halal, initially (so bad is their usual experience with said-pizzas).\n\nNice thick crust on the edge, relatively thin underneath the toppings, so there isn't too much bread, and just the right amount of toppings. I like the pizza here.", "author": "Stevie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-05", "description": "I do not know how much these guys pay Yelp but they have the worse customer service ever. I ordered delivery 90 minutes ago and they never showed up.  The driver apparently showed up at my door and texted me saying the food was here. I ran down and called the driver I was coming down. No one answers and there was no one outside. I waited outside for 15 minutes while calling the driver and the pizza place. I finally get someone on the line at the pizza place and the driver was apparently back in the shop. Apparently the driver called me 3 times and then left when there was no answer....I had zero miss calls and was constantly trying to call the driver back when I got the text message that the food was here. They told me they couldn't give me a refund and that shop24 was responsible????", "author": "Gary C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-13", "description": "Decided to order from here because of the great reviews. We got back from the Warriors game, tired and hungry and just needed some good food to end the night. They said it would be an hr. I get that. It's Saturday night. One hr 20 minutes later, no pizza. The delivery driver could not find Marriott Courtyard Union Square. He had the correct address. Top it off, whomever took our order didn't put my phone number in the computer correctly. I called back to cancel when we reached an hr and a half. The delivery driver did show up and wanted to deliver it, but we said no. I didn't want my family getting food poisoning because he was driving around with our food for so long. GET MORE DRIVERS FOR SATURDAY NIGHT if it's so busy. Oh, and maybe offer to rush another order if you screwed up the first? That would be a good idea.", "author": "Linda B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-30", "description": "I just tried this place, since it is nearby, open late and delivers.  I have not been impressed with other pizza places around this area, and I can't say that I was here either.  I got the vegetarian without cheese (I am vegan), added pineapples, and then I added Daiya cheese at home (since it wasn't on the menu).  The pizza was Ok, with and without the Daiya.  It was nothing spectacular but it wasn't bad either.  Then again, I don't eat meat or cheese, so my review may be of little significance to most people.  The crust was the best part.  It was crispy without being over-cooked or too chewy.  I thought that the sauce had too much garlic and I wasn't a fan of it.  The veggies were nothing great and were a little sparse.  I tend to like fresh and abundant veggies on a veggie pizza.  I am not sure if I will order again - I may actually soon forget that I ate here because it was fairly forgettable.", "author": "Teresa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Perfect slice for the perfect price. \nTiramisu cake is also great dessert !\nGreat customer service when ordering and and dining in", "author": "King N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-09", "description": "This is very tasty pizza! Super fresh toppings, pillowy soft crust, nicely seasoned sauce, fast and friendly delivery. Driver actually ran down the hall to my door. Awesome!", "author": "Nolin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "This place hit the spot after having a few drinks around polk. I saw this place when I was bar hopping but after the alcohol kicks in you can smell this place on the corner. It's a smaller pizza joint so they only have 3 tables that can seat 3 people on each table max. I was craving pizza after the beer I had but my girlfriend wasn't but once we walked in and saw/smelled the pizza she changed her mind. They have all types of pizza ready by the slice. They just throw it in the oven for a bit and serve it to you within minutes. I've never had pizza like this before if was an a square piece compared to the traditional triangle but I have to say it was great. You get just the right amount of crust and pizza with every bite. I finished every bite and are my girlfriend crust. I wish there was one closer to the peninsula to go more often.", "author": "Kevin Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-12", "description": "Solid pizzas from nice folks. \nalways a smile. \npizzas sit in the window so you know exactly what you are gonna get when you order a slice. \nthey throw it in the oven for a few minutes, and it's pretty good. \nTV's usually showing something that you can watch when devouring a slice. \nQuick, tasty, and A-OK!", "author": "Adrian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "Pizza by the slice! They heat it up and the slice i had- some chicken pesto one was delicious. Good for a quick bite before the movies, or a little snackaroo.  They also have so many hot sauces to put on the pizza.  So i didn't take off a star for it, but the bathroom didn't have a window.  As in, there was just a hole because the other side of the window was broken and you see everything.  I took a peek out side and they're like...apartments, but I had to pee so bad that I just went because...well...f*ck it, I don't care.  If people wanted to see a vajayjay I guess it was their chance.  Still.. little weird.  Glad I only went #1.  lol", "author": "Meena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "five stars all the way! came in late one night while bar hopping on polk street and i came across mustafio's. Fresh fast pizza on the late night, was not dissapointed. I grabbed two slices of Hawaiian loved it. The customer service was great the girl reccomended the hawain and it was great. If your ever bar hopping on polk and your hungry be sure to stop by mustafios pizza. I also tried their chicken sandwitch if your not in the mood for pizza this is a must try. Great pizza place to try day or night.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "I always love eating at this place because parking is always easy and the pizza is delicious! Their service is always on point: they're very nice and fast when serving. Come check them out!!", "author": "Marie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Came with my friends today watched the Warriors game had a slice of the pesto/chicken great fast service", "author": "kenan m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-18", "description": "I thought this place was ok and used it as an alternative to victors which is great pizza (best pizza on polk) but they don't allow you to sit down for slices so this place has that market cornered.\n\nThe pizza is thick and hearty and over cooked and a little oily as well. It is kinda woodfired flavored and hard to digest.\n\nAnyway last session I got a hawaiin (decent) and a combo slice (not good). Unfortunately I got food poisoning from there and spent the next 24 hours in purgatory hell. \n\nUnfortunately this will be the last time and will have to refuse the pizza mustafios makes.", "author": "Frank T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-17", "description": "Ordered a pizza on Grubhub that was estimated to take \"35-45 minutes\" but it took 90+ minutes for the pizza to arrive. Specifically ordered from this place (and paid extra, compared to a higher rated place nearby) because of the quick delivery estimate. Clearly, they have exaggerated how quickly an order will arrive. Would not order from them again.", "author": "Andrew P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-30", "description": "Rude and unprofessional and they lie. \nSent a vegetarian a meat pizza, didnt apologize, didnt take responsibility and no refund, because we \"contacted them too late\" (we contacted them immediately through grub hub and were assured we'd \"given a refund\".\nFuck you mustafo and fuck you grubhub. You know nothing about customer service or morality.", "author": "Anastasia K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-08", "description": "Apparently I'm homeless or something because I came in here to use the bathroom, I'm not gonna lie. One of the women behind the counter grabbed my attention and asked where I was going. I said I was going to use the restroom. She asked if I could buy something, I said okay, I need to use the restroom first, give me a minute. She insisted I buy something now so I'm thinking, okay well I'm not going to bring pizza into the bathroom so I guess I'll buy a bottle of water. She took another customer's order, which was taking much too longer than I was willing to wait given the circumstances. This is a place I frequent after my long nights on Polk. I would think I would've been recognized by this point. Guess not. Pizza on the other hand is average. Nothing special. Bathrooms must be for celebrities only, so don't bother trying to use it.", "author": "Kaz K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "Not only does Mustafios offer the tastiest pizza in town, their delivery service is fast & very professional! The pizza arrives hot & the polite drivers always follow any specific directions (i.e.\"wait at gate\" \"please call when arrived\"). I always make sure to tip them well because they truly handle the delicious pizza with care. Whether it's a late night snack after a bar hop on Polk or just an afternoon delight, you will always be more than satisfied. The pizza is a unique rectangular shape (which means bigger slices!) & not to mention their irresistible crust! The quality is top of the line and you will always be left wanting more!", "author": "Loree K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-29", "description": "Eating my subpar cheese pizza as I review this.  It this like cafeteria pizza.  Very marginal.  $3.55 for a cheese slice.  I will throw the rest away.", "author": "Win C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-06", "description": "On January 6th, 2016 at approximately 10:30PM, I ordered a 14\" cheese pizza, wings and cheesecake.\n\nI can say with confidence that this pizza was flat out inedible, the worst pizza I have ever had, that includes homemade attempts at making pizza in elementary school. I would center my complaint around an ingredient I have never found objectionable before -- Tomato sauce; however, my distinguished readers will note that the whole deal was atrocious.\n\nI have literally *never* asked for a refund or 'redelivery' before in my life, EVER; however, crises precipitate change and having never been so disappointed in my life, I tried phoning through Yelp's Eat24Hours in the hopes they would make me another pizza. they refused to pick up the phone.\n\nThe wings weren't bad but the cheesecake was, as other have noted, \"woody\" (I have never disliked cheesecake)\n\nYours unduly,\n\n- Zephyr", "author": "Zephyr P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "I love it!\n\nThe pizza here is great! I've always liked pizza by the slice and this place is killer.\n\nThe slices are pretty large and they taste amazing. Personally I got the chicken pesto and the cheese pizza slices. They were both made pretty well and taste great. Other pizzas include pepperoni, Hawaiian, and other special.\n\nWhen you order, they usually heat the slice up so it's nice and hot when you get it. The crust is on the thicker side but the crust under the toppings is thinner. \n\nIf you like pizza by the slice that's a little bit greasy and a whole lot delicious, then definitely give this place a shot. \n\nMustafio's also has a lot of other menu items like salads, calzones, sandwiches, etc. I also got the wings and they were the typical hot and spicy wings. Not bad at all.\n\n100% would recommend.", "author": "Frank Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "Was in the area on a late Friday night looking for a place to eat and I stumbled upon Mustafio's Pizza on Polk. Walked into a small busy shop and decided to get a slice of Barbecue Chicken. The staff quickly warmed up my slice and was hot and ready within minutes. Their pizza was very good with a soft and chewy crust. Mustafio's gets the job done when it comes to satisfying my pizza cravings. The service is quick, fast, and friendly. I look forward in coming back to try their other pizza options on their menu.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Great Pizza! Huuuuge!! Very delicious! Nice joint to enjoy a pizza dinner! Fast service, affordable and clean.  Definitely going back again!", "author": "Enas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "I love the pizza here!! They have the best crust and sauce!  Love the square shapes too...and they have excellent salads!", "author": "Charme S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "Best pizza plus right near my apartment within walking distance from my place and always served hot", "author": "Kurt M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-12", "description": "I came here on my friend's recommendation after we were craving some late night bites after going clubbing.\n\nThe line was really short when we got here which was good because a huge crowd just left when we got there.\n\nI saw the sign behind the register that listed the usual pizzas - cheese, pepperoni, Hawaiian, veggie, and combo. However, they have others that are not listed. If you see other types of pizzas, ask the cashier what they are!\n\nI'm thankful I did, I ended up getting a slice of the BBQ Chicken and it was AMAZING.\n\nThe BBQ Chicken looked like a plain old slice of cheese pizza garnished with chunks of chicken breast but hidden underneath the cheese is a sweet BBQ sauce that went really nice with the soft crust and chicken. The BBQ Chicken was a little more than the other slices ($4.25) but worth every penny. They even let me pick which piece I wanted so I picked the corner piece cause I love the crust.\n\nI would definitely recommend this place if you're looking for some late night food on the go. I'd probably stop by even during the day for a pizza craving.", "author": "Anna F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-08", "description": "Perhaps it was just a bad delivery day, but as I experienced each layer of mixups, I became increasingly unforgiving. \nFirst off: The pizza is ok.  I was in the mood for ok pizza so this was not a big problem. \n\nThe delivery man came with two coke cans in his hand when the order clearly said 1 two liter Diet Coke.  I cant stand the taste of Coke, so I didnt take the cans and went without soda. Friday night pizza with no Soda??  I made due...\n\nLet's forget the fact that I was charged $1.00 for each topping on HALF of a medium pizza...including $1 each for onions and green peppers. \nI ordered half a pizza with pepperoni, sausage, bacon, onions, green peppers and olives...that's right folks.  $6 for 6 toppings on HALF a pizza....But I knew it going in. \n\nWhat I got was two mistakes. ONE is pure blasphemous and was the straw that broke the camels back on whether I would write a review or not.  \nFIRST mistake was there was no sausage on it. None.  They just forgot. But I tasted this...fake smoky flavor that I couldnt quite pinpoint. \n\nThe Second and most horrific mistake was the \"BACON\".\nThis was not pork bacon...traditional bacon.  This was that preformed turkey crap that uses coloring to make the bacon strip marks.  What kind of masochist does this to someone who orders BACON?????  \n\nBased on the fake bacon, I wont be ordering from them again. IT's a shame cause they kinda owe me the $$$ I spent on the 2 liter soda, the dollar for the sausage I never got, the dollar for the \"bacon\" that wasn't bacon and the $5 tip I gave the delivery guy that he really  shouldnt have gotten since he messed up my soda.", "author": "Rina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-26", "description": "Great place for some pizza or other food.  Customer service is great and they really do a lot to contribute to the Polk street vibe here.  I absolutely recommend this joint for lunch or dinner and really appreciate that they are almost always open, even late night!\n\nSee ya around here sometime (I'm the big Mexican guy with a Hawaiian slice in each hand)\n\n-Brandon", "author": "Brandon E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-04", "description": "I had a Restaurant.com certificate.  They gladly accepted it.  Just that is pretty good.  Once in a while some restaurant would claim that previous owners did it and therefore they don't take them, or other excuses like that.\n\nMy friend and I ordered a 14\" pizza, half the Mustafio's special, half the Green special.  All ingredients tasted fresh.  There was lots of cheese, which I like, particularly the Green special.  Overall a pretty good pizza!", "author": "Charlie Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-18", "description": "This has to be one of the worst overall pizzas I have eaten. I would put frozen pizzas above this place. I ordered wings also and they had almost no sauce and they were gooey. I listen to the reviews and I am amazed anyone likes this place with so many great places in the area.", "author": "Jarrett P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "If you are looking for a great pizza on a Polk street, this is a perfect spot for you! This place differs from other pizza places. They have quarter-cut pizza  slices with a bunch of filings. I especially love vegetarian pizza! Amazing! These guys are open till 3 am! You can enjoy your pizza after any party. That is what we do with my friends! Staff is very nice and friendly, doing amazing job in a rush time! Definitely, highly recommended.", "author": "Lana P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-12", "description": "Not the best pizza I've ever had, but definitely solid drunk munchies pizza. Their ranch is good too for dipping! Prices are decent, and they accept cards! Which my old go-to pizza place on Polk does not, so that is nice and convenient when you don't want to hunt down an atm at 2 am when you're tipsy and just want some cheesey goodness and to go to bed.", "author": "Courtney Anne N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-11", "description": "Great spot to grab a slice before or after going out on Polk Street... I would know 'cause my friends and I came here twice in the same night. Loved the pizza,  it's actually good and not just' drunchies' food.  They toast the pizza before giving it to you so the crust is crispy. Highly recommend the chicken and pesto pizza. The price can seem steep for just a slice but it's a pretty large slice.", "author": "Renu A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "I was in town for the week , on polk street, and decided to try the pizza and the chicken pesto. Yum! The owner was there , super nice guy. Very clean restaurant ,centrally located in the heart of the city. Will be back again. Definitely recommend the pesto..", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "I can't tell you how good the pizza is here. They always offer fresh ingredients and great menu. The owner Yahya is a small business owner of the pizzeria that has a lot of variety of choices.  The prices are reasonable and the location is a great spot for good meal.", "author": "J S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-21", "description": "You won't come here to find spectacular, off the charts pizza, but just a good old plain pizza, especially if you have a case of the drunchies (drunk munchies). They are very generous with their pizza slices and gave us real large slices (not those dinky triangle slices). Not too much sauce, crust was crispy and there was sufficient cheese and toppings (got a hawaiian pizza) on my slice. For about $3, you satisfy your drunchies and you get a decent slice of pizza.", "author": "Angela H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "solid pizza overall.  It is my go to place for delivery in SF. \n\nStay away from the bacon, it is a processed turkey bacon like products.  It tastes ok but if you want real bacon you will be underwhelmed.  If anything they should just change it on their menu to turkey bacon.", "author": "Shawn A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-22", "description": "The most important thing that any pizza place must do is to serve you good pizza. Unfortunately, this place doesn't do that, or at least the one time I visited this place, the pizza slices were stale, bland and hardly palatable. Given that this place is close to a bunch of bars and open late night, it might be the go-to place to grab something to eat when you are drunk and hungry. But if you are sober, don't do yourself the injustice of eating here. I really hope (for the sake of this business) that they up their quality of food.", "author": "Srivatsan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Great pizza. You can smell the cheese a block away. Plus, always been a fan of the square cut slices. Fast, friendly and always helps after the night is over!", "author": "Savannah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "Congratulation Mustafio's you got me. I couldn't  take it anymore, after your pizza constantly catching my eye as I walk up and down Polk street I had to give it a try. \n\nThe service was cool, very friendly and quick. The pizza itself was great I liked the rectangular shape crust which had a balance, the sweeter than average sauce and the loads of cheese they put on it. Looking back at it I should gone with extra cheese on my cheese slice.\n\nI not a huge fan of the dinning areas in these neighborhood pizza places but ill make an exception for this one giving that it has wood table top, new comfy stools and that its located around the corner. Nice addition to the hood.\n\nOver all cool joint to grab and go a slice pizza or dine in if your into that.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "Open 'til 3am, their slices are big, with lots of toppings. The crust is always crispy enough to keep the slice flat when you pick it up, which is exactly the way I like it. I'm always a pretty satisfied customer! They'll make you a pizza you can't refuse!", "author": "Richard A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-23", "description": "I think this place branched off from Irving pizza last year, but it is nowhere on par.  Usually the service is at a snails pace at best and a bit overpriced.  \n\nLast night, I ordered 9 wings.  With one cashier and 3 people working, my order never came after 30 minutes.  I was one of 3-4 other customers in that time frame.  After 30 minutes they still offered the wings but they had not even started to cook them yet so I just took a refund.  There are plenty of more solid late night eats in the area - namely Irving Pizza.", "author": "Joey S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-18", "description": "This is one of the few times I was let down by the reviews from fellow yelpers!\n\nThis place has 4 stars and I can't understand why.\n\nWe ordered a slice of pepperoni and a combo slice. We also ordered the gyro for delivery. 45 mins later we had COLD PIZZA.  WTF?? To top it off the delivery guy asked me if I can meet him down stairs instead of me buzzing him in and taking it to my door? Are you serious I ordered delivery because I'm in my underwear being a fat ass and don't want to leave my house!\n\nAs for the pizza we had to reheat it in our oven. We didn't finish it. Very low quality pizza. Very little toppings with low quality ingredients. We didn't finish our food.\n\nThe gyro was not bad. It was ok as far as being edible like I didn't want to spit it out but ate it because I was hungry and not because it was good. \n\nThe only reason they didn't get 1 star is because i didn't find hair or a roach in my food. Do yourself a favor and spend your money somewhere else.", "author": "Lyle D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-18", "description": "Sorry, but the lady at the counter doesnt understand English ( she is Russian), and is arrogant too !  I checked in at the Opal approx. 200 m walk from this place & called to clarify whether they do thin crust Pizza, we walked later on as some reviews mentioned they take long time to deliver however the lady at the counter started arguing & said she didnt understand my Indian accent ( my English is queens & easily understood ).. she said she was Russian however was a bit rude for a order taker....", "author": "Hitendra J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-01", "description": "These guys just took my order by phone, charged my credit card, never delivered my food, and won't answer their phone. Not happy.", "author": "Paul H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-01", "description": "It took over 2.5 hours for them to deliver my pizza. Every time I called in the person on the phone would lie and say it was a few minutes away. Find another pizza place if you actually want to eat a pizza instead of just think about it.", "author": "Brandon K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-21", "description": "I ordered (delivery) a calzone and I got a pizza instead. No big deal. The only thing is the pizza wasn't very good (compared to other pizza places in the same area). Also, the pizza is making me feel sick. The garlic topping did not taste very good.\n\nDelivery was pretty fast and the wings were pretty good!", "author": "Nicolas P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-01", "description": "The service was excellent. The pizza was fresh and unique to the other quick pizza places I've been to in the area. I tried the combo and it was great. It had sweet yellow pepper that was a nice touch to the overall taste and flavor.", "author": "Sam N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-25", "description": "Five stars!\n-great service! (+10000000000)\n-delicious pizza (+10000000000)\n-perfecto buffalo wings (+10000000000)\n-creamy tiramisu, can't leave without getting it (better than Schubert's!) (+10000000000000000000000)\n-awesome music station blasted. (+1)\n\nPoints added up equals 5 stars (I would put more stars if I can)! Totally recommend!", "author": "Annie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-02", "description": "if i could give them a zero i would. could not believe what i saw. they dropped my pie and still tried to fix it and serve it??? wow just wrong. and to make matters worse they told me that had no clue what i was talking about!!! shame on you", "author": "Sam S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-14", "description": "Worst delivery ever. Order pizza on a Thursday evening at 5:45pm and pizza did not arrive until after 8pm. Kept calling after an hour and they kept saying 5 minutes. I would give them zero stars if I was allowed. When pizza finally did arrive it was cold. Just. the. worst.", "author": "Melissa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-05", "description": "As a hardened NY'er, who comes from the land of amazing Pizza, I have to say, this is the BEST pizza in all of California.\n\nI've lived in LA and SF, and have never had good pizza. The reason? The water in NY is extremely clean (Look it up!) compared to California water. \n\nSo I said to them, \"This tastes like NY Pizza\" and his response \"It's the water!\" They know what's up! \n\nIf you want to know what REAL, AMAZING Pizza, there is no better place in the state of California. You'll never want to eat Pizza anywhere else!", "author": "Stephen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-01", "description": "No idea how this place has 4-stars.  Clearly a reason to suspect shenanigans with the rating system.  Tried for first time tonight.  Priced like SF's best pies.  Very expensive.  Showed up 15 min late (60 min) and cold.  Tasted like mediocre chain delivery...Dominos et al. Never again.", "author": "Mister H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "You can't go wrong with pizza! There are so many places to choose from in San Francisco and we were very happy we stumbled upon this place. Great pizza, good price, and cool movies playing. We were very satisfied", "author": "Trevor G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-30", "description": "Lost 2 stars for a simple delivery order, just wanted ranch with my damn wings... I ordered 2 ranch sauce and got 1.  I didnt get no napkins which you know I need when eating wings but the food was good tho.", "author": "Theo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-01", "description": "one day I was walking down polk street during my break when I seen this lady carrying a box eating a large slice of hawaiin pizza and It smelled so good..\nso I said \"mam where did you get that\" and she pointed me down the way to mustafios pizza..now mind you they have a couple other little pizza joints In the area but this Is hands down the best In sf..\nas far as quality and taste when I have that craving for a slice or two of some delicious pizza,my first choice Is mustafios!!", "author": "Henry M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-01", "description": "The pizza here is fantastic. Chicken pesto was the perfect combination of flavors. Yahya, the owner, is awesome. The environment is on point and overall a spectacular experience.", "author": "Allen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "This is the best pizza I've had since I got to California from the Midwest. They really nailed that hearty flavor. Also the only place to make a chicken Parmesan sandwich so good I'd walk 3 miles for it!", "author": "Bennett K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-26", "description": "Watched the warriors game with my friends at Mustafio's today, the pizza was excellent and the atmosphere was awesome! We ended up talking to the owner while we were there and he was a really cool guy! I will definitely go back especially to watch the game! He made a pizza I couldn't refuse!", "author": "olivier g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-27", "description": "This is for delivery via Eat24. The food got here on time, but I had better pizza (from the east coast). The pizza was luke warm when it arrived, they don't seem to have a heat retaining container. Crust the doughy side and cheese wasn't that good. I got a plain cheese pizza, $18 total. Had much better for the price.", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-23", "description": "Slices of pizza was very delicious. Especially you must taste pepperoni and margarita.. Thank you guys..", "author": "Onur T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-24", "description": "Decent chicken pizzas.\n\nVery good red velvet cakes.\n\nAlso they have good chocolate cakes.", "author": "MD Naseem A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-13", "description": "I never review but felt compelled to because I just wasted a lot of money. Friends and I had a late night and ordered a pizza -- nearby, open, Italianized Mustafa and 4 stars on Yelp? Yeah, totally! We just had two slices and from the first bite regretted it. Just so incredibly gross. We wasted over 30$ on food that's made us gag; actually feel sick to our stomachs. I've been waiting to try this place for awhile and am just so disappointed. We were starving and we're the least picky eaters. We just wanted something to eat, no fuss or anything. This might be a night-time shift thing. I know pizza quality in small joints can shift based on who's working and when. \n\nNevertheless, wish the joint good luck -- hope they up their game. I gave two stars just cause giving one star to a small business feels especially prickish.", "author": "Sana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "Location, location, location. This place had the perfect location right in the middle of Polk Street. My friends and I had been bar hopping on Polk Street and we had gotten hungry with the drunchies. While we were walking we saw this shop with all their different pizzas on display. It was beautiful. Pesto, combination, pepperoni, BBQ chicken, etc. all on display in the front window so all the people drinking could see. Such an excellent marking tactic. We went in and we all ordered slices. The slice prices all varied depending on the type of pizza. It ranged from $3-$5. I bought a sausage/pepperoni for me and a chicken pesto for my BF. The total came out to about $9. which wasn't too pricey for me and I wasn't complaining b/c I just wanted to it. The slices come in rectangles instead of triangles and it's bigger than my hand. The crust and pizza was really yummy and it totally satisfied me. This place is open late for all the bar hoppers and it's a totally smart idea. Great place to go when you have the drunchies!", "author": "Sofia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-30", "description": "With so many pizza spots on Polk it's sometimes hard to choose where to pop in for a bite but Mustafios is likely one of the best options. Great pizza, good price, and friendly service.", "author": "Emre G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "Delivery was a tad slow. Pizza was OK, nothing amazing, and not worth the premium price.", "author": "Steve D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-17", "description": "They pulled a slice (square?) of pizza from the window and put it in the little oven. God knows how long that pizza had been sitting there. I can't even. \nI had the Hawaiian. The ham was tough. Mediocre. \nOn that note, the Caesar salad was good and fresh.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-21", "description": "I rarely do Yelp! reviews, but my experience at Mustafio's was so poor that it warranted public comment.\n\nI had a Restaurant.com certificate, but was pointed to the fine print and told the minimum was actually $50. Fine. The staff was not even remotely polite or gracious, nor did they make any menu suggestions to meet the minimum from my order. I decided to order another medium pizza to bridge the gap.\n\nWhile waiting for the second pizza to cook, we started eating the one that had been ordered initially in the restaurant. The staff didn't offer plates or utensils, nor did they express any gratitude that we literally doubled our order. \n\nThe pizza itself was borderline un-eatable: greasy, lacking seasoning, and questionably cooked meat. We ended up tossing them.\n\ntl;dr: Rude service, terrible pizza. And I'm apparently not the only one with this conclusion, if Yelp's any indication.\n\nI certainly won't be back.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "Pizza gets 3 stars, it's OK but nothing special. Extra star for the delivery service. On time and piping hot. Thank you Mustafio's!", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-15", "description": "Got delivery.  Result was pizza too hard. Toppings kept trying to jump off into mouth. Background music was AMAZING!!! Needs more backrubs.", "author": "Dafna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-31", "description": "Been having the cheese slice regularly, Very awesome ! Especially when you happen to get it fresh", "author": "Hassan T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-20", "description": "We tried to pay with a large bill and they woke us up an hour later at 3 AM to accuse us of paying with counterfeit money! Then they tried to take a credit card number to cover the bill without returning our payment! Unacceptable as a legitimate business!!!", "author": "Max M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "My first experience with Mustafios was when I showed up to visit my girlfriend in the city late on a Thursday night, as I do twice a month. As a New Jersey native I was somewhat wary about trying anything when it came to California pizza. I scoured yelp and postmates for something open at 1am when I came in and was lucky enough to come upon Mustafios. We ordered a combo pie. Within 40 minutes our pie was at the front door, warm, smelling like afternoon delight on a sunny beach. Me and my significant other devoured the pie, and it was glorious. Yes, its not traditional and the slices are in these awkward long cube pieces, yes the crust has something to be desired, but honestly the pizza is completely worth it at the price point.  The combo is loaded with toppings, and these toppings are like starter, mvp, hall of fame quality toppings; the mushrooms actually taste like they spent some time ordering them. Since that first encounter I have ordered from Mustafio's \"delivery\" 3 times. Each time I have been completely satisfied with the timeliness of the delivery and the quality of the food received; it should also be noted that during two of these instances I had no whiskey to drink at all. Ultimately my main take away is this: A decent pie ad a good price at any level of inebriation. Cheers.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "So this is my go to spot after work. It's conveniently placed right in the heart of Polk st. by all of the bars. The employees are always extremely nice and even remember my order since I come I'm a lot haha. The pizza is amazing. You get a nice big square slice of Za that's perfectly crispy on the bottom and has cheese so nicely golden brown on top that Michelangelo and Da Vinci would bow to it. I highly recommend if you like pizza and nice people come here. Also cheapest pizza on Polk.", "author": "Roy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "Great place, along with great workers! Would definately come here again whenever im in the city!", "author": "Ahmad H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-01", "description": "The pizza here is delicious! I have a simple taste in pizza, so I ordered a pepperoni slice, and wasn't disappointed. The crust had a fluffy texture, with a healthy amount of marinara sauce and fresh cheese. The pepperoni itself was crispy and tasty. \nThe owner of the restaurant is courteous, and service was quick.\nFor the more adventurous pizza eater, there's a plethora of toppings to choose from, as well as sandwiches, desserts, salads, and calzones.\nI will definitely be eating here again!", "author": "Misha H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-16", "description": "I ordered Hawaiian and pepperoni pizza from this place for the first time as a delivery a while ago. A friend told me about this place so I thought I should give it a shot. My pizza was delivered so quickly for the first time ever in my life and they were also amazing! The guy who I ordered the pizza from recommended me to try the pepperoni pizza with jalapeños on them so I went for it and my fam loved every bite that they took! I decided to take a couple friends to this place a couple days ago to try the pizza themselves and they also enjoyed it! The service was just as I expected with very kind workers. I will be back and they will be my number one on my pizza list whenever I wanna order some pizza for delivery(: I recommend this place to any pizza lovers out there!", "author": "Janice G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-23", "description": "I stopped in for a quick slice of pizza based on a recommendation from a friend.  As many restaurants as there are on Polk St, its tough to find a worthy slice to go. That was before I stepped into Mustafio's. I went with the standard cheese. They do the large square slices here and for $3.30 it was a reasonable SF slice price. The pizza was solid, the crust was well done, and the sauce tasted like normal old school Italian pizza. Definitely worth a pop in for a slice.", "author": "Steven G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-13", "description": "NOPE! After waiting an hour and 45 minutes I get a cold pizza with the wrong toppings.  Hell no. I hate onions! dang!!!", "author": "California B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "Been around the world and had some really great pizza. I accidentally stumbled across this place last night and was surprised to find a short line and the the best pizza I had ever tasted. The chicken pesto pizza was like the first time I went to Disney land in my mouth.. Highly suggest stopping by and picking up a slice, or four.", "author": "Brett T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "Stopped in for the first time last night after an event at GAMH. Had a couple of great slices. Will be going back.", "author": "Austin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "This is the best pizza in San Francisco. I think it misses some fanfare because it's mostly consumed by Polk St drunks who don't notice. It's actually the ideal pizza and THE BEST pizza in the city. The crust is perfectly fluffy and chewy. The cheese is perfect. It's great to order a whole pie or by the slice. Mustafio's is exactly how pizza should be.", "author": "Dana W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-26", "description": "Went in to this place once and wished I never did.\nI ordered a slice of pizza and a snapple. A few minutes later (I was entertained by the noisy and unprofessional people in the back/kitchen. clowning around and giving each other high fives!\nThe guy came out from the back and served me the slice but totally forgot the drink.\nHe was in the back with his \"friends\" so quickly that I had to go near the back and get his attention!\nGot my drink and as he walked away (I'm not kidding) he picked his bunched up pants in an unflattering spot, well you know what I mean. A guy serving food?\nI was grossed out and seriously couldn't take another bite of my pizza.\nThe pizza was not very good anyway but I have gotten used to the fact that most places can't even make a good marinara sauce if their life depended on it.\nTo top it off, when I got back in my car, which was parked in front some guy from the pizza place, comes out with a broom and starts sweeping all the crap on the street right on to my freshly washed car!  These guys are truly clowns and should maybe join the circus instead of trying to run a pizza place!", "author": "Jerry S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "Pizza here is always great! Awesome customer service from Yahya the owner. House made ranch cups are great! Place is super clean inside. So happy to have found this little gem!", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-10", "description": "Omg has good reviews but i just called and was put on hold at least thats what the girl thought because i heard her entire conversation with some other girl about how cute and sexy she thought some guy was they went back and forth for 7 min about this guy and there date then this girl with a heavy Mexican accent somehow couldn't understand my perfect english i said gyro she heard calzone i said elles street she heard polk i said seven she heard three.  Dont know what my total bill is because she didnt tell me.  I will not post this review till i receive my food so i can see if the food is better than the phone etiquette that cant be to hard to do considering the experience so far.  Glad i waited the food sucks the lettuce is limp and slimy the tomato is aswell overall i waited over a hour was very dissatisfied with the food and service never trust a pizza place that cuts its pizza in squares.    Overall avoiding this place would be wise", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-22", "description": "DELIVERY.......Easy to order...ONLINE. They were a few minutes late but that's fine for me ! As for the pizza, delicious !!! I had the Special and the BBQ Chicken. Good job boys !!!", "author": "Eddie I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "They got unique rectangular pizzas and they are tasty. Also Alex is a cool guy, kind and easy to talk with. Mustafio's pizza is awesome!", "author": "Gregory K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-17", "description": "When I want delivery and I don't want to wait for Patxi's, I order Mustafio's.  Mustafio's pizza is square - not bad at all.  Buffalo wings are juicy too.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-09", "description": "Mustafio's USED TO BE the BEST pizza in the whole dang city!! No kidding. Home made, hand tossed, crust that was to die for. Generous, and FRESH, toppings!! NOT ANYMORE!! Me & Hubby were enjoying a day off and decided to call for delivery. What a disaster!! It was OLD pizza!! I mean \"old\" as in it had been previously cooked--toppings were limp and greasy. They had attempted to re-heat in in the oven. YUK!! It was BURNED. The crust was HARD CHARCOAL. It was disgusting. We were SHOCKED and disappointed. I mean, we LOVED their pizza. I called and told the young lady on duty about it. She was just silent. No apology, no offer of another pizza, just dead silence. I got the feeling she felt as if I was \"bothering\" her. NEVER ORDERING FROM HERE AGAIN!!", "author": "Sabrina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "Ordered this AWESOME pizza from this wonderful lady name Shana? She gave us her suggestions and was very helpful. Hopefully we get our pizzas soon because the party is hungry! great customer service, love this place already!", "author": "Joey K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-17", "description": "Ordered delivery and it took an hour so that was unfortunate but the food was still great", "author": "Aanand P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "Loveeeee mustafios!  Perfect late night bite in Russian Hill! Stop by, you won't regret it!", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "Got delivery from here. Chicken pesto pizza was awesome. They definitely don't skimp in the toppings!! Wings were so-so. Definitely recommend this place!", "author": "J. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "This is my go to spot for pizza. Any day any night, I can always trust mustafios pizza to have THE freshest, cheesiest, pepperoniest pizza ever. Always great customer service. You can't beat great food and great service. I would give it 10 stars if I could.", "author": "Brent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "Have used their online ordering for couple of times now. Pizza is always on time and the best I have had in my stay in SF. I'm a fan off adding extra toppings to my pizzas and they have still always got it right. Toppings are plentiful too. No complaints from me.", "author": "Mika P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-15", "description": "I've been here twice now and both times when I was pretty wasted. I was expecting amazing pizza because I ws wasted, but even my dulled out tastebuds were like ehhh this is ok. The crust is good. It's greasy with little flavor. More likely than not I'd come back for another drunk night munchie session. It reminds me of cafeteria pizza with a better crust.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-20", "description": "Hot pizza, thin crispy crust, quick friendly service. Winner!  Great alternative to that a-hole, Victor up the block.", "author": "The P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "The pizza that I just ate here is some of the best pizza I've had in sf. I love chicken pesto.", "author": "Elias G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-12", "description": "Buyer beware. I had a slice of chicken pizza and was so sickened by salmonella I nearly required hospitalization. The pizza slices also sit in the window sometimes for hours. Shut 'em down.", "author": "L T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-01", "description": "If you're in the mood for pizza. Look no further. Mustafio's is the place to eat! Excellent pizza and good service! Check them out!", "author": "Carly V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "Excellent pizza. Hot and really good tasting. The guys behind the counter waited on us and were really nice. Unexpected for a little pizza shop like this. Highly recommend!", "author": "Kory H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-13", "description": "Welcome to my new favorite Pizza by the Slice spot.  I've had every pizza this city can offer, and this is hands down the best late night pizza spot.  Not just in the quality of the food, which is amazing, but also in the quality of the service.  I've eaten here a dozen times already and it's friendly service every time.  This can be rare in pizza shops around downtown, as some of you may know.\n\nIt's simple.  If you like great pizza with friendly service, eat here.", "author": "Jason k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-10", "description": "I had a Mustafio's deliver me a vegetarian special pizza yesterday.  Super nice guys and a great pizza.  The style is thicker than a neopolitan, thinner than cheeseboard/arzimendis, sturdier than Za (but still tender), while not being doughy at all (like Victor's).  Great toppings and menu variety as well (a combo of standards and unique)\n\nDid I mention delivery? Delivery.  Also the guys on the phone and doing delivery are super legit.\n\n10/10, would repeat.", "author": "Josh F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-29", "description": "I just moved to the neighborhood and needed pizza delivery after a long day of unpacking. I chose Mustafio's because of their good reviews. I was not disappointed. Great pizza. The sauce is very well balanced and the ingredients were fresh. Delivery was fast.", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-12", "description": "Based on others reviews, it might be best to eat in here. We had pizza delivered and it took over an hour and the pizza was cold and soggy. Won't be ordering delivery here again, but might be worth trying at the restaurant.", "author": "Carly K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "this square pizza is out of this world! I remember back in the day there was Little Cesar's... this is like their brother! I found my dream pizza stop. the staff is great, super friendly, helpful, and provides exceptional customer service. the pizza is cheesy and full of flavorful toppings with generous portions. loved the salad as well. if you're on Polk, make this your new pizza spot. plenty of places to sit for a quick slice.", "author": "Price M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "Mustafio's is close to home (1.3 blocks to be exact) but not as close as a couple other pizza places less than a block from my place.  I had the Mustafio's Special which has a little bit of everything since I couldn't decide.  The online menu has descriptions and prices for each of their pizzas making it hard to choose.  It is definitely worth the extra block to go to Mustafio's, besides the fact that the pizza is always hot and fresh Mustafio's is cleaner than most of the other pizza joints on or near Polk street.  Plus if I'm feeling really lazy Mustafio's delivers!!  lol", "author": "Antoine V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "One of my favorite places to grad a slice in the neighborhood.", "author": "Julie T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-03", "description": "I ordered for delivery around at 11pm the guy on the phone wasn't very helpful infact when i called he asked for my number and address then disappeared on the phone after talking to someone while i was mid sentence. After saying hello to silence for a bit he came back on the phone, No \"please hold\".No \"Sorry about that\". Regardless, I ordered The veggie special and gave him my card number, He said \"ok bye\" I had to call back to see how long it would take, Which he then said 45 minutes, He didn't even tell me the total over the phone. So about an 1 hr and 15 minutes later the pizza arrived with literally 1 mushroom on it. Mushrooms where the first on the list of veggies. I almost called to complain but at this point we were past starving. We couldn't even finish the pizza, Even though our tummies weren't satisfied. The only thing I can say was the delivery guy was really nice although he didn't apologize for being late. \n\nWill not order again. Will not Recommend.", "author": "Alyssa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-23", "description": "Not great. They told us it would be 30-45 minute delivery. It took an hour and 10 minutes. And they got our order wrong. The crust is thick (I prefer thin). This was our first try with this place - won't be trying again.", "author": "Eve F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "Words cannot describe how awesome this pizza is. To be honest, we cancelled the pizza at first through grubhub...but they ended up giving us the pizza anyways. We ended up eating and would gladly pay double for the same pizza. They're crust is absolutely phenomenal and their service is as polite as pie. Nice customer service, awesome pizza, and a great night!", "author": "Lorenzo S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-01", "description": "Slow delivery (25 minutes slower than the \"confirmed\" delivery time on Yelp Eat24). Pizza arrived cold; cheese was hardened and rubbery and the crust was overly chewy, like it had been sitting out for awhile. And I ordered at 9 pm on a Monday, not a very busy time for delivery. Toppings were burnt! Overall, extremely disappointing. I won't be ordering from here again. BOO", "author": "K. E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "This place is amazing. I usually only order by the slice and they are delicious. The inside is super clean and organized with a tv so you can enjoy while you eat. You can easily buy a slice and a soda for 5 dollars and it will fill you up quickly. The best pizza spot on polk street, hands down.", "author": "Alexander D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-30", "description": "Pizza is oily and bland. Not worth my time or the price. Pizza taste like the 7-11 pizza. Cardboard with cheese and sauce", "author": "Allen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "Love this place their pizza is always fresh They have delicious salads and the best dessert  Highly recommended", "author": "Nico Greek S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-22", "description": "Don't do it. If it's late and you're craving pizza just go to bed. Horrible delivery service.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "Crispy crust, cheesy cheese, hella meat, homemade ranch on ranch on ranch, seemingly real Italians in the kitchen, and we haven't gotten sick yet. We offered to drink tap water & the babes fed us complimentary Crystal Geyser. We will be back", "author": "Devon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "I've ordered pizza from here 3 times through eat24.com. The first time it was so hot that we had to wait a minute to eat. The 2nd & 3rd time was just warm. The pizza was good however but trying to get that \"hot\" status again.", "author": "May G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-22", "description": "Great new addition to Polk St. Big, cheesy slices with a nice crunchy crusts. Prices are great, especially for the size of the slices and the amount of toppings you get on a combo.", "author": "Jon M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-21", "description": "terrible pizza. an hour to bring doughy soggy sloppy flavorless pie to my door 4 blocks away?  avoid.", "author": "Jim R."}
