{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "Had a couple meals here, not too bad for the area. Genuine Thai staff, seating is friendly and intimate. Foods we had were a mixed bag in quality. First, the red curries were very pedestrian, not much flavor, wouldn't reorder (and I LOVE good red curry). \n\nThe Thai steak salad we ordered both days and it was probably 4-stars for this area. Great flavor, enough for 2 to split with other items. \n\nAlso had the Pad See Ew noodles, with pork. THESE were delicious and a generous portion. Pork was cooked perfectly, noodles tasty and not much oil, vegetables delicious. Fair price. \n\nWould return for more noodles and salad.", "author": "T J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-17", "description": "+1 for friendly staff, plus the food came out quickly and was fresh and hot! But I got the Thai fried rice to-go here and was thoroughly underwhelmed. The rice was pretty piece-y, chicken not flavorful and the dish was kind of greasy.\n\nMaybe try their noodles?", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "Came here for lunch on a Wednesday and ate this scrumptious spicy catfish curry. Not busy, excellent service, and superb food.\n\nThis place is seriously underrated!  Check it out.", "author": "Margot L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "Order takeout all the times from this joint. Food is amazing and always perfecto. Green curry medium w chicken over rice is go to / chicken satay, pad Thai and lettuce cups all are standards in our household. When we move away will be a sad day as MyIvy is rock solid", "author": "Matt T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-28", "description": "So I think the standout item here is something I take for granted at other Thai spots. It's the peanut sauce. Seriously. Luxuriant with an indulgent amount of chopped peanuts on top (photo: http://bit.ly/2I3k9DD). I could take that little gravy boat and pour it directly into my mouth. I probably would have if I was at home alone in front of the TV watching something on the Food Network like \"The Pioneer Woman\" where Ree cheerily makes cookies out of caramel corn and peanut butter. But alas, I am watching my calorie intake, so the peanut sauce came with the $11.95 Param which was a plate of steamed spinach and broccoli (photo: http://bit.ly/2Jz75mr).\n\nIt was delicious if somewhat overpriced given that it was hardly an effort on the part of the chef. No tofu please. Having the sauce on the side at least allowed me to dip the veggies gingerly without overdoing it, no small feat. To complete my dinner, I ordered the $9 Fresh Spring Rolls, which were well put together with lettuce, spinach, basil, mint, vermicelli noodles, tofu, and carrot slivers wrapped in rice paper accompanied by guess what... yes, peanut sauce only it was on the plate in a pool for the rolls to sit on (photo: http://bit.ly/2KpvaNS). It also had a touch of chili to give the rolls a bit of a kick. Pretty healthy choices, huh. I can try the Pad Thai and Duck Curry next time.\n\nFOOD - 4 stars...healthy selections made especially delicious by their peanut sauce\nAMBIANCE - 3.5 stars...modern space, not that big\nSERVICE - 4 stars...quite nice and friendly\nTOTAL - 4 stars...My Ivy is Your Ivy and Your Ivy is My Ivy", "author": "Ed U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-01", "description": "Three blocks from UCSF . The food was good but why three stars ??  Minus one for service and another minus one for price . I'm in UCSF every three weeks for my moms appointments and after , I try to take her to Thai restaurant for dinner. We both like and enjoy eating Thai food . I noticed they had more togo than dine in. She was  the only waitress working and she was too busy with all the Togo that she never checked on us and Not a big portion for the price, maybe because I'm in the city . I will come back and eat because I like the food . I will update it in three week , maybe she will read this and give us a better service.", "author": "Miok C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-29", "description": "Came here for a weekday lunch as this place is close to work. They seem to be mostly a take-out place; when our group of 5 arrived around noon, the restaurant itself was almost empty and there were plenty of seats, but there were a lot of people coming in to pick up take-out orders during the time that we were there. \n\nThe ambiance is quite nice and the area is clean and well-maintained. Service was on the slow side, and it was especially frustrating that the other 4 people in my group got their dishes super fast (within 5-10 minutes) but it took over 20 minutes for my pad thai to come out, so there was an awkward period where everyone else was eating. The pad thai itself ($10.25 on the lunch menu, with choice of chicken or prawns) was decent, but I thought the portion size was a bit on the small side and it didn't have as much flavor as other pad thai dishes that I've gotten. I also wish there were more peanut pieces for more of a crunchy texture.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-25", "description": "Love this place - delicious affordable thai food with really amazing soju/sake cocktails (only $6) I got the sukiyaki and it was the perfect portion and very flavorful.  I would recommend takeout or sit-down.\n\nAtmosphere: 3.5/5\nFood: 4.5/5\nService: 5/5 (so fast)\nOverall experience: 4/5", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "As you'll see in a lot of these reviews, delivery seems to be a huge part of this restaurant's business. Maybe one day I'll go check them out since they're not far from me, and fresher is always better. Today is not that day though! Suckered in by the promise of free, quick delivery, I hit \"order\" and went for it.\n\nOne look at \"Lychee duck\" and I knew I had to try it, too. And Tom Kha soup *gush*. I love Thai food :D. My staple Pad Thai rounded out the order.\n\nSo do I start with good news or bad news? Uh, I'm feeling pretty good...let's do good news!\nThe Lychee duck is DELICIOUS, just like it sounds. Duck is already amazing; soak it in lychee water and it only gets better. Of course it's not like this is a particularly complex dish, but it sure is tasty.\n\nTom Kha was decent but a bit middle of the road. Should be a little more savory in my opinion.\n\nWould not order the pad thai again. I ordered it spicy and it was totally mild, which is excusable as pad thai is not traditionally served spicy. It was also super bland. Ho hum. \n\nOh, as if you needed another reason to love Yelp and Eat24, I tried to order this first through Caviar...where the prices are inexplicably more than a dollar higher on every item I looked at...AND they threw on a $5 service fee before tip! Nah. I ordered with Yelp, applied a generous tip, and my total was STILL less than Caviar was BEFORE tip. \n\nOh, and speed of delivery was definitely solid.\n\nIt's disappointing that they're not open late, and with the other good thai food in the area, I probably won't go back here on my own. But, if I end up here with friends or something, I won't be disappointed!", "author": "Chris S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-16", "description": "Came here on a Sunday at kind of an awkward hour. After reading reviews, I knew it wouldn't be anything more than average, but it was the only thai place open at the time and the only thing that could cure my hangover was a plate of pad thai. It was pretty bland, but it got the job done. The service was good, prices fair, and the place was clean.", "author": "Maria M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Their vegetarian noodle soup is the best in the city! I order via uber eats and they always have it ready pretty quickly. They even accommodate special requests like \"no broccoli\"", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-19", "description": "I used to live a few blocks away and My ivy was our goto spot for Thai. I moved away and recently saw they popped up on Uber Eats.\nUnfortunately The food that was delivered was terrible. I can't believe it's even the same restaurant. Bland and tasteless, it was quite simply the worst Thai food I've ever had in SF.\nAvoid at all costs.", "author": "Dan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "This is becoming a semi-regular lunch spot for me. The menu is great,and full of options! The kitchen staff is quick, which is very important when you have limited time for lunch, and the staff is very friendly. The flavors from the various items are always very well on point! Haven't been disappointed here yet! Great place to eat alone, or in a group. Many great options for their lunch specials, especially if you're looking for options other than sandwiches, or cheap Chinese food. This place is quality for any occasion.", "author": "Dezi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "A neighborhood fav for me and my fam.... I don't agree with the 3.5 stars.... their spring rolls are great and the curry dishes are all fantastic!  Great service and always quick delivery of the food.", "author": "Lynn A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-05", "description": "They are fast and the food tastes okay. My go to is the pad see eww with chicken. and the fried rice with fried chicken breast. \n\nWork orders from here often, so when I don't have lunch I'll join in sometimes.", "author": "Teeds K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-01", "description": "The service was great but the food is mild in taste all the items I ordered needed salt and all the other spices ...I looked at the food that looked so flavorful and should have been tasty but ....sadly the food tasted bland ...I don't recommend", "author": "Najla B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Excellent neighborhood Thai restaurant. Very nice server who went above and beyond. Papaya Salad was delicious. Also enjoyed the Curry Noodle Soup and Thai Hot Tea. Friends got Pad Thai, which was tasty too. Fair prices for SF. Overall highly recommend if you're craving some Thai food!", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "Reasonably priced and tasty.       Delivery was a but slow but that's become the standard in San Francisco.       Spring rolls were tasteless so skip them but Pad See Yu was good.      They get credit for the freshness of the vegetables.", "author": "chris b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-20", "description": "Probably the worst Thai food I've had. I ordered curry for take out. When I got back home and ate the food, I thought it was pretty bland. So I had a lot of leftovers. The next morning, I opened my fridge and saw that the liquid part of the curry had separated and coagulated. This goes to show you how low the quality of this curry was. Curry should not separate. \n\nSafe to say I'm not trying this place again.", "author": "Natalie Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Whenever we visit SF, we always make it a must to come down to My Ivy at least once. This is one of my favorite Thai places ever.\n\nThe restaurant is small/mid-sized, with a very hip vibe. The orders take some time to come out, so be prepared. \n\nEvery dish that my family and I have ever ordered have been very fresh and very flavorful. The Yellow Curry is really good, and the shrimp fried rice is amongst my very favorites. If you're into Thai cuisine and are up in the SF area, this is a must-try.", "author": "Adnan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "We've ordered take out from My Ivy via door dash many times. This is prolly my favorite Thai spot. I haven't had a bad dish so far.\n\nYou can taste the fishy-ness on the pad see ew (which I love bc I love salty food). Yellow curry's on point as well.\n\nThis is your local mom and pop shop with nothing faulty about it! You can't go wrong here.", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "They were super nice and the food was very tasty.  Clean and organized place.  I'll certainly come back.", "author": "Ignacio G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-13", "description": "Nice restaurant. \n\nNot very big, but there's enough room for several tables. \n\nVegetable Spring tools were very good. Peanut sauce flavorful. Red curry plenty spicy. The lamb could have been more tender. \n\nThe staff is helpful.", "author": "Jaime J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-19", "description": "Quick delivery within 30 minutes from Ivy Thai. If it weren't for the speedy delivery to prevent me from getting 'hangry', I wouldn't have ordered from this restaurant to begin with. \n\nAfter seeing the other reviews prior to receiving my order, I lowered my expectations knowing that it wouldnt be great, just fast. \n\nMy 4 dishes were delivered within 30 minutes as expected. Surprisingly, my soup was still hot enough to soften the noodles it came with once I poured them together. \n\nI ordered the following:\n2 tom yum rice noodle soups\nPad see ew\nPapaya salad \n\nThe tom yum soup reminds me a bit of pho noodle with the tomato base. It was a bit sour and tangy with a little too much sweetness. I prefer my tom yum spicy, tart and sour. \n\nThe pad see ew was on, but it doesnt taste authentic. As other reviews have stated, it has a 'california' flair to it. I eat food pretty bland, but I must saw this dish didnt have the appropriate flavors I was hoping for. \n\nI actually havent had the papaya salad yet since I was too full from the other dishes. It did look pretty standard and its hard to go wrong with fresh salad, however I did smell the salad and could tell there was a ton of fish sauce. I do not recommend ordering this to the office! :)\n\nOverall, food is decent, but not authentic and definitely not the best thai in SF. Worth giving this place a shot if you just want fast and quick food that isnt 'fast food' like mcdonalds.", "author": "Claire W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Second time here. Had delicious drunken noodles with combo seafood. Highly recommended!", "author": "Kevin F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-21", "description": "I've never had a worse Thai meal. Spare yourself. They won't be around long with all the good Thai food in SF.", "author": "Jennifer F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-23", "description": "I'm obsessed with pad see eww... this was the most disappointing Pad See Eew I've had yet. So bland.", "author": "Sofia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Great lunch menu . My wife & I stopped in for a relaxing atmosphere and great bite to eat. We had  the Crispy Catfish,  clay pot seafood & chicken, the veggie Rolls, the lunch came with a simple yet satisfying soup. Great service with a welcoming feel. It's a most stop Divisadero.", "author": "Terrance G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-19", "description": "Food is fine. BUT a waitress will confront you when you regularly eats there and you don't leave any tip. When you try to explain, she will just turn her back on you. Rude!!! Cant believe that a tip is compulsory in this restaurant. Must change the staff of this restaurant.", "author": "Ashley R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-11", "description": "It is pathetic that Pacific Heights does not have good Thai options. You'll have to head towards the Tenderloin (at Lers Ros) or Inner Richmond (at Marnee Thai) to get the traditional flavors you expect from Thai food.\n\nI was in the mood for some light and healthy salad and the mango salad filled the craving. I was digging around for more grilled prawns, but they were generous enough to put two in there. (omg) Hmm. Yes, you can make better salad at home and for $9, there wasn't much flavor to it except lime and fish sauce. The chicken lettuce wraps are a great low carb snack, but the only dominant flavor in the sauce is Hoisin. The tom kha soup is passable.\n\nThe amiable service is welcomed, especially when I'm exhausted from my core40 workout, conveniently located one block away. And the free thai iced tea is nice with the yelp check in. But I'd consider other dining options around the area and maybe curb my Thai food craving until I'm at Lers Ros.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "First time eating here and it was great. Had the drunken linguine and Thai ice tea. Great service as well.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-25", "description": "My favorite neighborhood spot. Food is consistent. Staff is sweet. They also make the food so fast, which is perfect on the nights that I do not feel like cooking on my own  I've been coming here for years and will continue to do so.", "author": "Lauren A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-12", "description": "Good choice for Thai food in the Lower Pac Heights area. Unpretentious, clean, and good quality food, nicely presented. Main dishes are around $10, appetizers start at $4. \n\nI only got to try the TOM KHA so far (cup: $4, bowl: $9) which was delightful with the right amount of shrimp and mushroom in it. The CHICKEN LETTUCE WRAPS ($8) came with a hot sauce and very delightful minced chicken. Awesome.\n\nCame on a Friday night around 7pm, not too crowded.\n\nThe next day my stomach was growling and I'm most certain it came from the Thai food, couldn't pinpoint it enough though.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-15", "description": "Worst place ever, the guy that  serves you is  rude and unprofessional. He argued with me concerning taking someone else payment while I was in line already to pay. But this other person was behind me in line.  Don't  eat here, unless you appreciate RUDE service. Usually I don't write but this one goes for the books. If there was a button for WORST CUSTOMER SERVICE this here wins.", "author": "mami m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-12", "description": "This is a great casual spot with fast service and kind employees.  Their green papaya salad is the best I have had since Thailand!", "author": "Cypris M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-16", "description": "I used to go here for lunch a lot and thought that they had excellent service but they need to fix their online ordering system. Ordered from here online and was missing an important item with my curry... rice! They didn't even give me an option to get rice on the side. How am I suppose to know that the rice is a side order. Instead of apologizing they insisted that I should have known that I needed to ordered rice on the side when it wasnt an available option!\n\nThe food was good but the service puts it down to a star. Maybe they will be nicer when you are there sitting in at the restaurant.", "author": "Fanny C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-18", "description": "So sad to find a bug in my favorite crispy calamari (see the picture attached! The crawly protein crisp comes fully intact: head, body, arms!). I shudder every time I think about it, whew, I just had a cold chill run down my spine! \nI am having a difficult time returning to purchase more of my favorite, spicy catfish and crispy calamari. Very concern that I will have a bug in my food again. I loved My Ivy. Unfortunately, I have to write this review. I hope their sanitation will improve and they will care about their customer's health and well being.", "author": "jenilyn l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "the staff here are very nice and friendly and personable. which is always a good thing. the food is not bad at all and the restaurent is warm and inviting and makes you feel safe and comfortable to spend your time. i have nothing negative to say about this place", "author": "Abigail S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "Fast service, good food. Can't go wrong. Been eating here for three years and it's consistently good. Usually quiet for lunch with good deals, so go then.", "author": "Loren K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-06", "description": "I ordered off Uber Eats the Tom Yum Soup and it arrived fast just taste was not to my likening. The soup was sweet which I definitely prefer my soup on the spicy side. They did include plenty of white meat chicken even though I'm pretty sure I ordered shrimp. Speedy delivery just lacking in taste of one of my favorite soups!", "author": "Aryn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "I love this place! I'm not *super* picky about my Thai food, just FYI. But I've never had a meal here I didn't like and they are quick for takeout. Very great about accommodating little changes or extras I want. Nice staff! I've been getting the chicken noodle soup a lot. Also like the Pad Thai, and they have good Curry and rice dishes. Large portion size.", "author": "Emma B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "Good food. Quiet. Cozy little restaurant. I had the green curry and BBQ. It was good. I like there chicken BBQ. The curry was just a bit watery but still savory. All in all it was good I will go back there.", "author": "melissa a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-26", "description": "Bad customer service and mediocre Thai food. Can't recommend and won't be coming back.", "author": "Nic L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-01", "description": "We ordered pad see ew and drunken noodles with beef for delivery. Bland, pale and sad. Veggies were undercooked, noodles seemed over-cooked (slimy and mushy), beef was tough and unseasoned. Sauce was nonexistent. I can't say it tasted bad. Just tasted like nothing. Calamari and spring rolls were good though and delivery was fast. No idea what happened here. We will not be returning.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-23", "description": "Wow, this place just recently opened and I must say, I am definitely a fan. It's a great Thai place. Came here during lunch, it wasn't too packed which was great. They offer a complimentary miso soup too! \n\nWhat I ordered for lunch: \n- Chicken Lettuce Wraps with minced chicken, water crest, carrot, fresh ginger, green onion served with lettuces. Really good and refreshing. It wasn't too heavy and the sauce adds a kick to it! \n- Spicy Catfish Spicy - crispy catfish wok tossed with eggplant, bell pepper and kaffir lime leaf in red curry coconut sauce topped with crispy basil. Definitely recommend this dish! The spiciness was just right and it is also one of the chef's choice! \n\nI will come back here again to try different dishes.", "author": "Jenn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "I found this little place lovely. Great service, good selection of drinks and the food was delicious. You pretty much know what you're getting with Thai food, but I found this a little more special. Great food and atmosphere.", "author": "Kath L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-05", "description": "3 stars at best. I ordered take out. The food tasted plain, the portions were small and it was overpriced.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "I love My Ivy Thai! Love it so much that I forget to review it for all the times I've been here.\n\nA general review - the wait for food can be long or service slow sometimes because they are busy with to-go orders.\n\nCall for a reservation (don't give up when they don't answer, when they do finally answer you can do s victory dance!) when dining with more than 4 people. This prepares the staff & kitchen.\n\nTry the cocktails! Really will surprise you how flavorful the non-vodka drinks can be.\n\nEvery dish we ordered was fresh, flavorful & delicious.  Any errors made (special requests) are corrected quickly and graciously.\n\nOur go-to dining when heading out for live music.", "author": "cailyn m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "I am\nSurpaies it doesn't have more stars! In all fairness I always order the same thing! Lol but if you like curry , they are great! Especially red curry, they out so many different vegetables, and they are never over cooked . You know it's good when the next day oil doesn't separate from the curry like some\nOther places .", "author": "Anna B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-01", "description": "Very very rude employees!!  Made me feel very uncomfortable  also they are very slow I hate writing bad reviews but I do not like when people are rude!", "author": "Samuel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "I think My Ivy is underrated. Everything I've had there is Delicious (see that capital \"D\"? I did that on purpose!), and the people there are so friendly! In particular, I like their Spicy Catfish, and their Pineapple Fried Rice, but so many other things on the menu are lovely as well. Do give them a try.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "We had our dinner here yesterday. Good food and nice welcoming people. I was from Thailand originally so I asked the waitress to give me sth authentic for Thai tongue. It was good. My husband loved it.", "author": "Lana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Get the Ivy Best Friends or the Yellow Curry Shrimp. That sweet and sour sauce is delicious. Be sure order a Thai iced tea!", "author": "Jesse-James B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "Ordered one of their fried rice to go for lunch. Very delicious but their ratio of veggies to rice was off with too many veggies. Have yet to have a bad Thai experience so this is on par with many other Thai restaurants.", "author": "Vanessa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "Every time I come here for lunch the workers are friendly and the service is super quick. I haven't had to wait super long for a seat but this place can get super crowded during lunch time as it is smaller cozy establishment in a super busy neighborhood with about 20 tables or so. \n\nThey are pretty quick to with the phone orders too as several co- workers order from here frequently and if they have it delivered, its normally to our shop within 20 minutes for delivery which is great.", "author": "Sara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "I was passing by it and decided to try and it was sooo good n yummy! And it got ready super fast me and my friend were shook!", "author": "Roxane O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-27", "description": "Terrible Thai food. We were shocked at all the positive reviews. We ordered take out via Door Dash, which was quick and efficient. However, the quality of the food was awful. The massaman curry was bland at best. What we really didn't like is that they just spoon the sauce over the tofu and veggies instead of stewing the tofu in the curry. Most of the tofu was still bland and white and raw. The pad seew was not rich in sauce or flavor, again bland and not satisfying. The only thing we really enjoyed were the veggie spring rolls. Will not eat here again.", "author": "Yvonne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "So delicious!!! The veggies were fresh, the tofu was so tasty! Great unobtrusive service.\nNice soothing atmosphere. Loved the fresh rolls elegantly served in a long platter with base of peanut sauce.   I order the yellow curry at most any Thai restaurant I visit and this was one of the best I've ever tasted.\nHigh quality vegetables. My friend thought the Thai iced tea was too sweet and too much cloves.", "author": "Mimi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-16", "description": "The place looked innocuous and was mostly deserted when we doubled in from the train. We'd been arguing about where. To go: I wanted new, he wanted one block down.\n\nI don't know exactly what I wanted but I needed His complaining to end. And once he'd supped the CoMplimentary  Thai Tea that  was (free with Yelp check in) he became less bear ish.\n\nFor mains I chose the pumpkin curry with. Tofu. It can. In's rich red a sauce, horn enough to make my nose water, and. I used chop sticks to remOve broccoli and carrot pieces from the stew.\n\nMy starter was excitingly unusual, vegetable rolls like I'd never seen. Them before, delicately laid up right on the plate with a thick peanut dipping sauce that was both rich and airy at the same time.\n\nTruly, a hidden gem.", "author": "Zara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "Closest Thai place to my house. They are very quick for take out. \n\nNot the BEST I've ever had but great in a pinch. My go-to is the Chicken Pad Thai (sometimes amazing sometimes weak. I think it depends on who's cooking it that night so it's a gamble people) and yellow curry sub veggies. \n\nPumpkin and green curry tasty too!", "author": "Rachel T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-05", "description": "I got delivery from Eat24/Yelp. \n\nBefore I even get my food, the delivery guy says \"You owe me cash!\" \nI was confused as I thought I selected the credit card option. He shows me the receipt and I see \"TIP:Cash\".\nI ask him to wait out here while I see if I have any cash.\nAfter frantically looking for a $5, I couldn't find any cash. I apologize and let him know that I don't have any cash. He rolls his eyes and storms off. \n\nThe food wasn't any better. The yellow curry was watery and bland. There was no flavor The BBQ Pork was decent but may have been undercooked. The spring rolls fell apart.\n\nWith so many Thai options in SF, I probably won't order from them again.", "author": "Enoch L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Service was quick and attentive. The food was amazing! \n\nWe ordered the pad Thai, the papaya salad with BBQ chicken. In addition to the excellent Thai iced coffee. When we return to SF, we will also be returning here!", "author": "Jesika P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-17", "description": "Horribly boring and flavorless chicken noodle soup. How there was no lime, cilantro, jalapeños or anything that would bring this soup to some life is beyond me. Basically just noodles and chicken broth. Portion was also small given the price. Very disappointed.", "author": "Zach C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-04", "description": "Apparently, at this place you're required to pay a tip even though you thought the service was awful. I tip based on how much money is available and service. My last delivery had terribly rude service and they took my food away because I wouldn't give them a tip. Last time I checked, tips weren't required.", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-15", "description": "Ordered a pad Thai and Thai iced tea to go. Pad Thai had no flavor and they didn't give me a fork, napkin, and straw.", "author": "J C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "Why they lost a star: The thai iced tea (free with check in) was on the sweet side so I had to let the ice melt a little and there was more veggies in this dish than most places I normally go to. \n\nCame in here during my 1 hour lunch break to grab a to-go order of drunken noodles (pad kee mao), a personal favorite, and a thai ice tea. The staff was quick and the wait for food was not long (I ordered when I walked in) maybe a 5-10 minuet wait. The dish had more veggies than I'm used to and had slightly less noodles in it but they had bamboo pieces which made up for it. There was also plenty of meat and the sauce was seasoned just right. It wasn't bland or salty and had a tiny spicy kick to it. It was the perfect amount for lunch and maybe they have bigger portions during dinner. The thai iced tea was good and slightly on the sweet side, but the key thing to note is that they did not water it down!!! It was creamy with a black tea taste and how thai tea should taste.", "author": "Maybo H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "The spring rolls were amazing as well as the papaya  BBQ chicken salad. Boyfriend got the yellow curry, some of the best in the city! The portions were generous , but of great quality. We will be back soon!", "author": "Kiara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-21", "description": "I had the tom kha noodle soup chicken. It was good. Had a good amount of chicken compared to other places about 3 oz and about 2 c noodles.", "author": "April A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "Delicious Tom Yum soup and spring rolls.  It never looks crowded and so I've avoided it in the past, but that was a mistake as it's really good!  I won't hesitate to go back.", "author": "Janelle F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-03", "description": "First and foremost - what a fantastic deal on interesting cocktails like a Lychee martini - $5! Whoopee, even this cheap old gal can order a cocktail at that price.\n \nI'll start by saying I never say \"let's go out for Thai food\" but I might start saying that now...\n \nThe entrees hover around $10 and they are HUGE. We stuffed ourselves and really had an entire other portion to take home. Ordered a beef curry and the pad thai, and aside of steamed veggies (for $3.50). We also ordered 1 rice, but I saw some red rice going buy that looked better - I will inquire next time.  $38 for 2 cocktails, 2 entrees, 2 sides (rice and veggies) - that seems like quite a deal considering it served 2 of us with a huge leftover portion.\n \nOne table over was raving about the fried banana and coconut ice cream.  Next time we are in for that.\n \nI will suggest they turn down their phone ringer - so loud and they can't seem to get to the phone in time - so people call (RING RING RING RING RING RING RING RING RING - the gal finally goes to answer it- but too late no one there - she walks away, and then the process repeats...and repeats, and repeats)  I can't imagine they get much repeat take out business ;)", "author": "Amy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "First time to this place, very authentic Thai cuisine. Came all the way from east bay and it was worth driving. Their dessert is must try. Will go back again.", "author": "DJ J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-31", "description": "Nice and clean restaurant. We were seated right away and our waiter (i think he was the only one working on a Sunday afternoon) took care of us and checked in with us frequently.\n\nMy husband and I had crab Rangoon appetizers that were delicious! I had the fried chicken fried rice and my husband had duck stew. Our orders came out promptly and we were able to get free thai tea each for checking in on yelp, which was also perfect, not too sweet. \n\nThe restaurant itself is on a quiet corner and they also participate in GrubHub, and they give you 5% off coupons for your next order. Food is decently priced and service is great.", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "We ordered Mango salad, curry noodle soup with shrimp and red curry chicken with BBQ chicken over rice for lunch, we like all of them, very delicious .", "author": "Barabara W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Live close by - great for takeout! Yellow curry is bomb and so is the calamari. Recommend when you are in rush. Also have $6 cocktails if you eat in which is a decent deal in SF", "author": "Rob S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-27", "description": "Ambiance is nice, the waitress was very attentive, and our dishes were delicious at an affordable price!!", "author": "East B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "I love My Ivy! So fresh and tons of flavor, not greasy. It's my favorite Thai spot in SF. My go-to's: chicken lettuce wraps, Thai curry dumplings, crab fried rice, pad see ew. But everything is good here! Oh and if you eat in, they serve Sauvignon Blanc in a frosty wine glass!", "author": "Sondra O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-16", "description": "Not sure why this place got such high ratings but we stopped here for Sunday dinner after visiting with my BFF from LA and her mom.  \nIt's not a particularly large restaurant and it was quiet for a Sunday.\nThe 4 of us spent about $50 for the following:\n1. Tom Yum noodle soup $10.  I really wanted Tom Yum soup but it was not on their menu but later, I found it on their printed take out menu!  I really didn't like this soup.\nHubby usually hates this soup because he finds it too sour.  The soup here was too sweet (Really, who makes a SWEET Tom Yum soup?) and not sour enough - it is per Hubby, who doesn't even like this dish in general.  Would not order again.  And, the soup came AFTER our entrees arrived.  There was a lot of chicken pieces in it and lots of noodles, the thin rice noodle kind.  Should've tried the Angel wings instead.\n\n2. Crispy chicken with egg fried rice, $9.  The chicken had a nice crispy crust and wasn't bad, the rice looked and tasted like plain white rice with some egg mixed into it.  I have to say the chicken is better than that at Chabaa on Irving (their food has gone downhill).\nI would try this again.\n\n3. Green Curry chicken, $10.50.  The sauce was so thin, it was like a bowl of soup, extremely watery.  Some vegts in it, occasional eggplant, chicken.  But, I thought it lacked flavor and Hubby was surprised it had more heat in it for a \"mild\" dish.  I wouldn't order this again. A small bowl of white Jasmine rice to accompany this was $2.00.\nI prefer the curry dishes at Chaya in West Portal instead. \n\n4. Thai fried rice - $9.  Was OK.  \n\nOver all, food wasn't up to my standards.  Hands down, I would rather spend the extra money and go to Marnee Thai and even Osha Thai's food tastes better in my opinion even 'tho it's a chain.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-04", "description": "It should be noted that if you're ordering delivery, rice is not an automatic accompaniment. While it may be included at lunch, these spongy kernels a is not part of the meal in the evening hours. Obviously for ease of digestion- for which we can all be grateful.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-08", "description": "It's great that they're quick to deliver, but I ended up paying $17 for green curry that didn't come with rice and only had one piece of eggplant. Super disappointed and not worth the quick delivery.", "author": "angela l."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-05", "description": "I used to frequent this place while I worked on a project at UCSF Mt Zion.\nI ordered one of their soups, there was a ROACH floating in it, only I found it after a couple of bite....yuck.\nI let the server know and he looked at me and treated me like I put that roach in my soup.\nI wasn't even rude.\nThey were rude and only offered to get me a new one. Really?!?!? Why would I want the same thing, the whole family of roaches may be doing laps in the pot.\nNever again, so gross. \nI walk to get Thai food elsewhere.", "author": "Natasha C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-13", "description": "Very reasonable prices and FAST service. I get them to go all the time and it's always ready in 10 min with no mistakes. Pretty good Thai food too!", "author": "Haley P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-22", "description": "Dear My Ivy Thai food,\n\nI really wanted to like you but your food is terrible.\nI have tried several items and the results are always somewhere in between horrified and sadly disappointed.\nYour Tom Yum soup is too sweet.", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-28", "description": "I recently had their Salmon basil for $14.25 and I have to say it was disgusting. They burned the salmon with the grill marks and let me tell you it was black. It gave the entire piece a very unpleasant smell and taste rendering it inedible. The veggies it was with were supposed to be onion, bell pepper and mushroom in garlic chili sauce but I got mainly some kind of eggplant which I hate and a few onions mushrooms and peppers. I had to throw the entire dish away. If I had eaten there I would have sent it back to the kitchen. I did not taste garlic chili or basil and have no idea what the sauce was. It was a very poor presentation and the veggies were even way over cooked. There was nothing about that dish that was any good. \nI give them 2 stars because the spring rolls I had were very good and I've had a salad there before that was also good. I do not think I will order off the chef recommendations again. Maybe I'll stick to uncooked fresh items.", "author": "Kay W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-26", "description": "We live right down the block, so this has become our go-to Thai place within walking distance.  We've ordered from them several times (once for delivery) and the order has always been 100% correct (and for the one time we ordered delivery, it arrived quickly).\n\nThe food has always been pretty good. Ingredients seem fresh, flavors are strong (the curries, rices, and meat entrees), and the appetizers are pretty good (golden calamari, salmon rolls). Prices are acceptable and surprisingly average (given this is San Francisco and everything's overpriced here). The 4 or 5 times we've dined in the restaurant, the ambiance has been fine and feels a bit more upscale than your average Thai restaurant. We enjoy eating here and it supports our local, neighborhood businesses.", "author": "Nicholas T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-18", "description": "Pricey for Thai food, but considering that it's in the lower pac heights area it's expected. I've come here for both take-out and dine-in for lunch since it's close to my work. It's about $8-10 for their lunch specials. The service can be slow sometimes during the lunch rush, but if you order via phone you can just walk on over and it'll be ready instantly. There's no place to wait inside so when it's crowded it's best to just get in and get out.\n\n+ Fave Eats:\n-BBQ chicken & papaya salad - comes with rice and a side of sweet and sour sauce; one of the best lunch dishes here in my opinion. Though there are times when the salad tastes like they put too much fish sauce/lime.\n-Pad thai w/ your choice of meat/tofu\n-Lemon grass chicken w/ veggies and rice\n\nThe curries are just okay in my opinion. They don't give you very much of the vegetables. Also, I can barely detect the \"spiciness\" that some of their dishes indicate, maybe our definitions are not the same seeing as how I love sichuan/korean/mexican food to the point of having to pop an omeprazole before heartburn sets in. Oh, and there was a beef and string bean dish I had ordered one time that was just so awful...way too heavy on the peanut sauce. You've been warned.\n\nOverall I'd only come here if I'm inkling for Thai food and stuck in the area for a good while.", "author": "Loriel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-08", "description": "Good Food Good Service...Nice mellow music playing. Big screen tea with sports channel on.", "author": "Valerie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-05", "description": "*****This review is for their delivery services******\n\nMy coworkers and I had a cankering for thai food and we chose to order from My Ivy. I ordered the green curry but switched out the chicken for eggplant, another green curry with chicken, and another pad see ew with extra egg. All of the orders came to our workplace A-OK, EXCEPT FOR MINE ----- that would happen to me -___- My green curry had the correct broth, but it literally was like a vegetable curry WITHOUT eggplants. It had broccoli (so strange), bamboo shoots (normal), carrots (meh), HELLA CABBAGE (NO ME THINKS NOT). \n\nMy coworkers swear by this place, so I'm going to dine-in, one of these days. But for now, the 2 stars are there to stay.", "author": "Kathleene E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-09", "description": "Delicious food and nice wine selection! Not overly spicy or rich like so much Thai food I've had. Try the crispy tofu starter! Easy parking on the street. My new favorite Thai place.", "author": "Lori S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-05", "description": "My boyfriend and I went to Ivy for dinner on a Friday night, and were surprised to find it all but empty (although it was almost nine). That said, the atmosphere was still fine, as the lighting was good and the restaurant looked like it had been recently remodeled.  There were some beautiful modern fixtures and art, and the tables were cleanly set. Top 40 hits played from a radio, which sounded a bit scratchy, but at least they were making an effort. \n\nThe service was fast and a bit rushed; it was only an hour before closing. The server was friendly though and was very accommodating of my requests for vegetable substitutions and fried tofu. We ordered crispy spring rolls to start, followed by pad see ew and pumpkin curry, with a side of white rice. \n\nI was surprised to find when I took a sip of water that the glasses were plastic. Dining from plastic isn't what I would call magical, as I don't even use plastic cups at home. I dislike the lack of weight and clinking sound, and the odd mouthfeel. Maybe this makes me a snob?\n\nThe spring rolls were perfectly crisp and had a nice mixture of vermicelli and vegetables inside. I really enjoyed the sour sauce that accompanied them too, so much so that I was using it as a dip for the crunch rice noodles they sprinkled on the plate for garnish. It was so tasty I could have drank it! The spring rolls were larger than usual, so I felt almost full after eating two of them. You could easily order them as a meal, so it was a good value. \n\nWhile waiting for our food, we had to suffer through a commercial break (radio), which was a mood killer. The music returned just in time for our entrées. The pad see ew was prepared with carrots, instead of broccoli, as I had requested, which I appreciated. Unfortunately, the noodles were very overcooked and stuck together, like they had been in sitting in water for too long after taken off boil. The portion was huge, but we barely ate it because of the noodles and the beef, which was tough and chewy. I would NOT recommend this dish.\n\nThe pumpkin curry was delicious. The curry base had the right amount of spice, was rich and creamy, and full of flavor. I ate tons of rice just to have more curry sauce. I enjoyed the pumpkin and veggies in the curry too, although they were cut in very large pieces. It would be easier to enjoy if the veggies were more bite-sized, especially since chopsticks are the best for cutting things smaller. \n\nOverall, My Ivy Thai seems like it has potential to be a good restaurant. The staff is sweet, the curry is tasty, and the interior is polished. There is some real work that needs to be done in terms of food consistency and attention to detail. And they need to invest in a music service, or at least stream a commercial-free channel!", "author": "Mars W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "Some people's reviews are hilarious! This place is a good thai restaurant. If you feel it's too expensive, go to Taco Bell on Geary or get a higher paying job. Do you plp understand that commercial rents ESP in nice are the business owners biggest cost. These people are not trying to rip you off, they are trying to stay afloat. \n\nGetting your Togo order messed up is frustrating, I agree. Then don't order Togo. Dine in. Togo orders are tougher and more of a pain for the employees. I wouldn't expect you to know that because the ones that are complaining have NEVER worked on a restaurant.   \n\nThe food is good. That's it guys! \n\nName me more than 5 better thai places .... U can't.", "author": "steve a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-13", "description": "Randomly found this place while looking for a quick lunch. The restaurant looks quite fancy but the prices are very fair. I ordered a pad thai and the people I was with ordered the lunch special which came with beef ribs and curry and the other person ordered the Pad See Ew. \n\nThe Pad See Ew was the best of the three. The pad thai tasted average. A little bland for my taste. The beef ribs were good but really fatty and the curry was tasty but nothing outstanding. For dessert I ordered the fried banana with ice cream. It was delicious! \n\nOverall, quite fancy dishes and the prices are cheap for what you get. However, not the best tasting thai food and the service is mediocre.", "author": "Jonathan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "Great Thai restaurant in Pacific Heights area. Food and service are both good. Especially like the Spicy Catfish!", "author": "Neha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-14", "description": "i like the ease of this place, the price and the lack of pretension.  The food is really more 3-star - it's good but not outstanding.  But when you figure in what value is there it pops up to 4 stars.", "author": "EE S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-11", "description": "This is a review for the My Ivy delivered.  It was a totally exhausting day and we couldn't face cooking.  My husband went off to solve some final workday problems and my job was to have great Thai delivery at the door in a reasonable amount of time .  \n\nOur usual Thai favorites are only available for pick-up or eat-in, and we're relatively new to this neighborhood, so after browsing Yelp awhile I settled on My Ivy.   So glad we did - the delivery time was about 15 minutes faster than I was expecting, the order (it was a BIG one) was perfect, no mistakes, and everything was hot and fresh.  \n\nWe ordered Spicy String Beans, Pumpkin Curry with Tofu, Green Curry with Calamari, fresh spring rolls, and pineapple fried rice, plus brown and coconut rice.  Loved getting a free Thai Iced Tea!  The spice was great - our dishes ranged from moderate to very spicy. Great flavors overall. \n\nThe only thing I didn't totally love were the spring rolls. They were good, but too much lettuce for me, and a bit bland, the peanut dipping sauce was OK - I'm not a fan in general of peanut dipping sauce though - My Ivy's wasn't any worse than anyone else's, it just didn't improve the flavor of the spring rolls, which were fresh but, well, lettucey.  \n\nWe'll definitely work My Ivy into our ordering out rotation.  Solid!", "author": "Sandra M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "I didn't realize how much I love this place until they closed for a week to remodel! I panicked! I tried a few places while the were closed and was disappointed each time. The food is fresh and consistent, and service is always great.I'm so glad that they are back and I'll remain a loyal customer.", "author": "Shawna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "Their Tom Kha Gai is sweet savory and one of my absolute favorites! Staff is on point!", "author": "Pete A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "There food is good! Besides the fact that I had a piece of hair in my Tum Yum soup :(", "author": "Jazmine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-10", "description": "At this point, only sampling two dishes and two deserts, it's more like 3.5 stars, but we would definitely return to try other dishes.\n\nThis place was nearly empty when we came in on a Sunday around 3:30 PM. Just a couple of people were seated. So service was fairly quick (just one person was manning the phone, serving tables and taking our orders). We had two dishes, an appetizer, and two deserts and liked the deserts best.\n\nThe appetizer, Golden Calamari, was our least favorite. The calamari was tough, and was served under a glaze of a too sweet Thai smoked chili paste. For calamari, less would have been more: they should have been served straight up with the sauces on the side for dipping if needed. And the quality of the calamari itself could really been improved by not overcooking them.\n\nThe Pineapple Fried Rice was good. Kind of a Singapore curry flavor going on, with slices of chicken, and chunks of pineapple with onions and cashews, but we did not have an \"OMG, this is amazing\" kind of moment. We had such a large serving that we took most of this home.\n\nWe also had their dish that they called \"Ivy Best Friends\" which are three things served together but separated: Boneless BBQ Chicken (thigh served dry), shredded green papaya salad, and a black sticky rice served with a thin sweet and sour sauce. Separately these items were OK (the crispy-skinned chicken was a bit on the dry side for a thigh) but really were at their best when mixed, all the different textures of sweet, sour, crunchy, chewy, tangy, cold and hot were all represented in this dish. \n\nThe execution of this entree might have been better if the chicken were more juicy and had more inherent flavor, but this dish had a great potential to be an eye-opening lesson on why Thai food is so good at combining so many textures and tastes into their wondrous cuisine.\n\nThe deserts were the stand-out for us: Mango Sticky Rice and Fried Banana with coconut Ice Cream. \n\nThe sticky rice was amazing: this warm short-grained white rice was so dense and chewy that it seemed like it was on its way to being mochi, covered in a thick, sweet coconut milk. This was perfectly offset by mango slices that were not too sweet, so they complemented the rice's sweet stickiness with a firm cold tartness.\n\nThe Fried Bananas were coated in a perfectly crisped batter that was not oily and were perfectly sweet. Again those many textures: cold sweet coconut ice cream, crunchy warm and sweet banana fritters--just heaven in a spoon.\n\nWe would definitely visit this place again to check out their other main dishes.", "author": "Glenn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-25", "description": "I've sampled a few things from their menu and I'm happy to keep ordering, especially since the food is very good, they deliver & their price point is gentle, especially for the quality.\n\nHaving had both the Drunken noodles and Crispy chicken and egg rice entrees, choose the chicken: The drunken noodles were spicy and flavorful but needed more sauce and definitely more vegetables and straw (instead of too-thin slices of shitake) mushrooms. \n\nA note: If My Ivy made Drunken noodles as well as Portland's Appe-thai-zing then I'd be ordering from My Ivy every other night. Can you steal their recipe - please (I'm begging you!)  You'd really have a dish no other Thai restaurant in San Francisco has been able to duplicate anywhere close to Appe-thai-zing's (and I've tried quite a few).\n\nI digress...\n\nMy Ivy's appetizer of almond prawns accompanied by a delicious creamy lemon dipping sauce was heaven. While the angel wings were yummy, the almond prawns are the way to go. It's a sensational appetizer I've never seen on any other menu so for me, it had that pop of trying something new and it was delectable.\n\nAnd a thumbs up on My Ivy's crab rangoons. Here, My Ivy's delicate yet flavorful spices really stepped up this delicious (and decadent) appetizer.  \n\nI would give My Ivy 4.5 stars if I could since the second time I ordered I asked if they put me higher up on the delivery rounds and they did. I requested specifically since the first time I ordered, my food had arrived disappointingly lukewarm. \n\nAnd the second time, My Ivy got it right.\n\nI'm looking forward to trying their soups and definitely one of their curry dishes.\n\nMy Ivy dishes great Thai comfort food, inventively spiced and perfect for a rainy night or at the end of a long week and the price point is just right.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-29", "description": "Great spicy edamame, more garlicky than spicy, but very good. The pad see ew was pretty bland and dry, did not keep well as leftover. However, the fried rice definitely made up for noodles", "author": "Bryanna M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-02", "description": "Super dissatisfied with my order of Tom Kha soup and pad see ew I just had delivered. It has absolutely no flavor and I even specifically requested it to be spicy. This is the blandest Thai food I've ever had in my life. The only good thing about this place was how fast it was delivered but that's understandable because they forgot to add in the ingredients that give it any taste. So annoyed, it's not even edible.", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-27", "description": "Absolutely horrible!\nTried this place for the first time and it was a huge disappointment. Ordered takeout and the Papaya salad was overly doused in chili flakes with no real flavor. Pad Thai, Thai fried rice and lemongrass chicken were all extremely bland with little to no flavor! After paying $45 for this lackluster meal, I feel like I want to call and ask for my money back. Will never ever order from here again.", "author": "Mary B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-18", "description": "Is an update necessary if it was perfect the first time... and perfect the seventh time? Hmm, let us ponder. \n\nFresh Spring Rolls - FANTASTIC. Yummy peanut sauce, fresh, non-wilted greens, crunchy carrots, and flavorful tofu. Throw in their beautiful display and it certainly puts a spring in my step! \n\nSpicy Basil Leaf - ummm better every time I order it. That's a pretty major feat. Spicy, fresh, colorful, and frolicking with flavor, this dish remains a fave. \n\nPumpkin Curry - I have a crush on pumpkin. There's something about that cute little stem poking out the top, the shiny skin oozing with beta-carotene, and don't even get me started on those touchable vertical curves... It started with carving and seed roasting on Halloweens, matured with Burma Superstar's Pumpkin Shrimp, and has now reached unconditional status with My Ivy's Pumpkin Curry. Love... \n\nOur waitress was phenomenal. She saved us from some potentially drastic ordering mistakes. When trying to sub fresh tofu for fried, this lovely lady kindly informed us that \"it's gross\" with the fresh. Who knew?! I know we all comment on service... but even compared to any fancy shmancy, hoity toity restaurant, this place wins hands, feet, and butt down (butt down on decorative chairs!). #1 for perfect waitressing. \n\nQuestion: \nWhy are plates and bowls circular? Let us consider the evolution of circular dishware. Did it begin with drift wood - rounded corners from years sand wear and tear? Maybe the pelvic bone of some animal, shaped to cup some fluids or random prehistoric mush. Whatever the original reason for round dishes, rest assured it's worthless now! My Ivy is going 21st century on us and whippin' out some square ones. I guarantee it holds your foods just as well. \n\nSo tell me, was a review update necessary? Do you stop watering a perfect flower? Stop encouraging a straight A student? Stop brushing a cavity-less mouth? It. Was. Necessary.", "author": "Zoey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-02", "description": "I love this place. The food is incredible. Nice quiet joint. I recommend the salmon basil and the curry. I don't always love rice,but the wild rice and sticky rice have awesome consistency. Just tried Thai Sukiyaki for the first time- their take on pad wood sen- and it is delicious and very fresh.", "author": "Samantha H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "good stuff, just made it before they closed for lunch. hot, fresh & delicious was my \"spicy eggplant\" dish, I also had a prawn noodle thing that was delivering the heat. I'll go back again as it's close to where I work out.", "author": "Henry K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-20", "description": "This place is definitely fancier than any other thai restraunt I have ever been to! And a different thing they do is give you a little soup appetizer, like the miso soup of Thailand! It is quite good and tasty!\n\nI ordered a pad thai and I feel that it was definitely not saucy enough and too sweet :(\n\nMy mom got the pumpkin curry with rice and the portions were too small! \n\nMy friend got a papaya salad and she was dying of how spicy it was but maybe it was just her haha!\n\nI would not come here again though just because I don't think I want to come here for thai when there are so many other thai place", "author": "Megan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "A friend and I came today to try My Ivy out for the first time.  We got there at 2pm so there were only 2 other tables taken.  She ordered the Pad Thai and I had the Pumpkin Curry with chicken.  Pad Thai was $8.50 and the curry was $9.  I liked the Pad Thai the best, but have nothing to complain about.  Wish the portions were a liiiitle more generous.  The free Thai iced tea through Yelp was nice :)", "author": "Amanda J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-08", "description": "My Ivy Thai Restaurant is pretty Americanized but that doesn't mean the food is bad.  The Pumpkin Curry ($10) caught my eye so I had to order it.  It's a pretty big bowl filled with chunks of pumpkin and veggies all sitting in a creamy soup. The aroma was amazing and I couldn't wait to dive in.  Definitively delivered everything to my taste buds...\n\nMake sure to order a side of rice for $1.50 since the dish doesn't come with rice.", "author": "Stacey P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-10", "description": "So last week I decided to order to go from My Ivy.  I ordered the tofu pad thai, papaya salad, fresh spring rolls, and chicken fried rice.  When I got home I noticed I received tofu fried rice instead of chicken fried rice.  Normally I wouldn't mind the mistake since the tofu fried rice wasn't that bad but since I live close by, I decided to call them to correct the order.  When I called and spoke with the waitress, she read back the correct order so it wasn't like she took the order wrong, it was more so they just made the wrong item.  She told me to come back and when I showed her the tofu fried rice, she took it and gave me the death stare as if I made the mistake.  As if that wasn't bad enough, she gave me more attitude when she gave me the correct order.  Please tell me how it was my fault to get so much attitude???\n\nIn a nutshell, the food was OK at best but the customer service was freaking horrible since I didn't even get an apology or anything.  I won't be going back ever again.", "author": "Derek Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-07", "description": "Order take out from here quite a bit. This place is very prompt in their service-which I appreciate. I love their Tom Yum soup and Mango salad. My only gripe is that their spice isn't very consistent.", "author": "Tanya L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-27", "description": "I decided to give this place another try before reviewing it. That's not to say I didn't have a good experience here the first time (both times I've eaten here it's been takeout), it was just that I ordered something kind of plain so I figured I'd order something more \"exciting\" before reviewing it. \n\nThe first time I ordered here I got crispy chicken w/fried rice, and it was good! I wasn't sure exactly what to expect, but it was simpler than I thought it would be. It was literally just fried rice (w/nothing else mixed in) and pieces of lightly breaded chicken. There was a light sweet sour & sauce on the side. The thing is, I LIKED that it was simple. I also liked that neither the chicken or sauce was all that heavy (and that the sauce came on the side). \n\nThe second time I ordered from here I got Drunken noodles, which were also yummy! They were garlicky (but not to heavy) w/lots of veggies mixed in. Again, this dish was fairly light, and pretty simple, which is something I liked. \n\nEven though I got takeout I noticed this place does do delivery (I think there's a $20 minimum). I didn't get to experience the restaurant itself that much, but it seems nice and the staff seems friendly. I like that there's now a Thai option in this area to go along w/all the other casual dining spots (Tortilla Heights & Godzilla to name a couple). \n\nThis place doesn't have website (that I know of anyway) so both times when ordering I looked at the menu from GrubHub (I've STILL forgotten to grab a menu from the restaurant), and both times my meals came out a little cheaper than the prices listed there, so that's good! In general, My Ivy is very reasonable price wise. The portions aren't huge, but satisfying enough. I'll be back!", "author": "George A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "I live right down the street and get take out all the time. I LOVE the curry dumplings, yum yum. Those with a side of rice are easily a full meal. I usually, however, get veggie tofu pad se ew. I'm not a cabbage fan and have asked them to give me little to no cabbage and DELISH. I will always go to my corner Thai spot and I always crave it :)", "author": "Sophia F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-08", "description": "Good spot to go grab thai food for lunch.  I had walked by several times during the lunch hour and it never seemed very busy, but it had decent reviews on yelp, so the lady and I decided to give it a try.\n\nGood lunch menu with several solid options in the $8-9 range.  I had the pumpkin curry which was really tasty, and the girlfriend enjoyed some extra spicy chicken pad thai, which was good, but not great.  Best thai food I've found thus far in Lower Pac Heights, but I'm sure there's something superiour out there that I haven't found yet though.  Cozy little place with a decent enough decor that it could quality as a date-night retaurant should you want Thai food for dinner.\n\nI'll return to My Ivy any time I want thai food for lunch somewhere in lower Pac Heights, a solid little spot.", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-29", "description": "If you've got Connect 4, Scrabble, UNO, whatever... bring it. My friend and I played several rounds while waiting for stuff like having our orders taken, the food arriving, and getting checked on by our servers. We showed up on a Monday evening with something like 3/4 of the tables occupied and two friendly servers present. It was one of those \"Hey, what's that place we just drove by? Let's try it.\" things for us.\n\nCompared to some other SF Thai restaurants, the interior is slightly more modern and upscale (but not like the Osha on 3rd St or at the Embarcadero). I appreciate that, given the setting, the vibe is still chill enough to walk in head-to-toe in sweats or Lululemon, or football (soccer) scrimmage gear like a pair two tables down from us. But don't let any of this stop you from putting on your sportcoat or that little black number.\n\nOf note among our particular items were the Black and White Sticky Rice, Strawberry Mojito, and Pumpkin Curry. I haven't seen the B&W rice on other menus. It came in a small foil wrap and had parts that were slightly crunchy. About the crunch factor, think a number of levels lower than the rice at the bottom of a Korean hot stone bowl. Actually, I'd say they weren't \"crunchy\" so much as \"not as soft as you'd expect rice to be\". The non-alcohol tones of the Strawberry Mojito were like Kool-Aid, if that's your thing. My friend liked the Pumpkin Curry as good as or better than others they'd had; it was overall too sweet for me.\n\nAccording to one of our servers, the food here is intentionally California-ized. So if you're seeking the intense and traditional, My Ivy might not be Your Ivy, per se. Given the ambience though, I shouldn't have to spell that out for you while racking up double and triple word scores.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-14", "description": "I tried calling but I couldn't get an answer. I was violently ill with explosive diarrhea on the way home from lunch today. We had the mussels coconut soup and I think the mussels were bad. I'm still sick from this lunch. This was a bad choice.", "author": "cathleen d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-25", "description": "Ordered yellow curry and pad thai to go from here for dinner. I felt sick for the entire day the next day so I figured the food was probably just too spicy and was upsetting my stomach. Turns out my friend was feeling sick the whole day too so there was definitely something wrong with the food. Very unlikely that we will be coming back here or recommending this place to anyone with so many other Thai options in the area.", "author": "Maryann S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "Great local Thai place.\nGreat pad thai, pad see ew, pineapple fried rice, and pumpkin curry.\nFriendly and fast.\nEasy to find parking.\nI often order takeout too!\nNeed I see more? \nI don't feel like being too creative.\nIt's good. Try it.\nThe end.", "author": "Heidy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-10", "description": "Not a bad Thai place. This is only for delivery.\n\nWas craving some Thai and since I've seen this place off Divis so many times, I became curious so went ahead and got some delivery.\n\nOrdered beef with basil (Gra pow), chicken pad see ew, and lychee shrimp.\n\nWell cooked and sweet like I like it.\n\nThen I read an article in the latest \"Atlantic\" which discouraged me from going to Thai places... Oh well. Would order again.", "author": "Julia P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-27", "description": "Promising place with great ambiance!  There always seems to be a spot open if you decide to dine here cause its never overly crowded.  Great spot for a big group of people. \n\nAs for the food, I think every dish I had was pretty good but not the best.  You can definitely get better Thai in SF.  My favorite is the pumpkin curry which is essentially red curry with pumpkin.  Delicious!", "author": "Nho C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-28", "description": "+3 stars for solid entries in the 'Yellow Curry w- Chicken' and 'Pumpkin Curry w- Tofu' departments. \n\nDo not sleep on enjoying the Fresh Spring Rolls. You've been told, troop.", "author": "Mark S. I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "First time here and the food is delicious! I came in for a quick bite during my break from work and I was seated quickly. I tried their grilled chicken seaweed salad and their veggie rolls. Both were really good, the salad was on the spicy side but that's the way I like it. Definitely going to be one of my pit stops for a bite from now on.", "author": "Kaisar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-10", "description": "I had lunch at \"My Ivy\" today with a group of my international friends.  I m Thai, btw. We had a great time and will definitely come back again.  Love simple yet elegant decoration.  Even though, it is relatively a small place, It does feel very open and has a lot of natural light coming from the wrap around windows. I think it makes the dinning experience even more pleasant.  The staffs were nice and friendly. \n\nWe ordered a bunch of different dishes.  My fav were \"Golden Calamari\" \n\"Salmon Rolls\" \"Papaya Salad\" and \"Seafood fried rice\"  The food tasted fantastic. Dishes were decorated beautifully.  Portions were very reasonable.  Dont worry about coming home hungry if u decide to dine at this new place.    Ending the meal with yummy dessert, Love Love Love \"Mango Panna cotta\" ; creamy with a little sweet and sour taste to it.  1 wasnt enough.\n\nI totally recommend this place ^^", "author": "Pattie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-10", "description": "Meh.  I had pad se ew.  It was solid and priced under $10, but nothing to write home to momma about.  \n\nSolid food.  Nothing more, nothing less.  I recommend because it's under $10 for entree.\n\nServers were shy or uninterested as well.  But it was not busy so that didn't impact my experience too much.", "author": "Charlie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-05", "description": "The ivy beef is so good. It is tender and I will come back again. Highly recommended.", "author": "Dong A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-14", "description": "Been here many times and it's a really good place for Thai food. It's probably my favorite Thai restaurant in the city.\n\nThe best items I've had here are:\n\n- Pad kee mao (drunken noodles)  \n- Curry Noodle Soup\n- Aromatic Duck (with steamed small rice noodle)\n- Tom Yum Noodle Soup\n\nThe different curries are also pretty good. \n\nSo so items:\n- Tom Kha noodle soup (coconut noodle soup)\n- Steak salad\n\nI would not hesitate to come back when craving Thai food. Prices are also very reasonable.", "author": "Ali F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-21", "description": "I love this place and continue to try something new every time. Gotta recommend the Ivy Beef and Carmelized Duck. The Golden Calamari may be the best calamari I have ever had.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-25", "description": "I had a friend in the city visiting so I came by to meet her for lunch.\n\nWe needed a place close to where she was staying and chose this place.\n\nWe split the crab rangoon and mixed veggies with brown rice.\n\nThe crab rangoon were fresh and well made, the filling was good and flavorful.\n\nThe mixed veggies we just ok, the chicken was a bit dry and there was more cabbage than anything else in the mixed veggies. No amazing special flavor in the sauce.\n\nIt is a simple nice place, friendly staff but the food just was not special enough for me.", "author": "Sean A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-10", "description": "This place is amazing, I have never been disappointed. We have got the yellow curry, pumpkin curry, pineapple and lychee curry and calamari and been impressed each time! Make sure you order the coconut rice too!", "author": "Joanna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-22", "description": "I love this place! I eat here at least once a month and have never had anything negative to say about the food (takeout or eat-in) the service, the cleanliness or the staff.\n\nThe green curry with brown rice and the pad see ew are my two favorite items but I also really love the spicy green beans (add shrimp) and recently tried the Tom Kha and it was heavenly. \n\nThey have some unique items like pineapple trout. I tried it and it came as a whole fish, eyes skin and everything. It was delicious as well.\n\nYou really can't go wrong with this place, take out or dine in.", "author": "Robyn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "I've ordered from My Ivy probably over a dozen times. It never fails to disappoint. The food always has a lot of flavor, they're quick on delivery, and it satisfies my thai food cravings. No complaints about My Ivy (Except I have to order through DoorDash since I'm outside their delivery zone).", "author": "Matt L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "Apps are to die for along with the curry and noodle plates this is a definite must have for Thai food", "author": "Maddox R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "Favorite Thai in SF. I order from here all the time!! Pumpkin and red curry and tom yum soup are staples. They don't over salt or load in extra sugar to their curries like most Thai places. The pad Thai is a bit sweet though, so go with pad see ew, unless you have a sweet tooth.", "author": "Christina N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-29", "description": "Had the fried rice, pad thai, curry, and coconut soup. All tasted pretty good. Pretty good service and super fast too. We got take out and it was ready in less than 10 minutes.", "author": "Vera K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-02", "description": "This place is extremely disappointing. Not recommended unless you want your order to be consistently wrong and the service to be completely unhelpful.\n\nI've given this place a few tries and they just can't seem to get it right. The last time was the final straw. I ordered a vegetable/tofu dish, specifying when I placed the order that it be purely vegetarian. I guess that is a concept that they don't understand because after making a trip there to pick up the order, and getting it all the way home, I discovered there were pieces of CHICKEN ALL THROUGHOUT the dish.\n\nWhen I called to inform them, they wanted me to BRING THE DISH BACK to prove it.\n\nSo, not only did I pay money for something I could not eat, their way of remedying the situation was for me to go back there when I just wanted to be in my home eating my dinner.\n\nUm, no.", "author": "Andi G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-12", "description": "I ordered the chicken pad thai and my mother ordered the shrimp pad thai. My mom only got two pieces of shrimp. The noodles hand no flavor and or sauce to them at all. Very bland like eating noodles with no sauce at al. Not to mention the trouble we had just trying to use the code to get a free thai iced tea. Won't be coming back.", "author": "Oriana S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-21", "description": "I wish i could give less than one star. I love Thai food but this place has so many times disappointed me. Their kee maow noodle always very dry! I also tried their other fried noodles but compared to what i had in other Thai restuarants, it always tests as if its missing a lot of ingredients. The only reason i go to this place is because its close to where i live. Today i have decided is my last day.", "author": "Rahel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "The larb and papaya salad are both spicy, tasty, and fresh.  The curries never disappoint either.\n\nI've never had to wait here.\n\nThe prices are reasonable.", "author": "David J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-29", "description": "Have only ever picked up here. Make sure you're in the right lane on Pine to pull over for pick-up.  It looks really nice/renovated on the inside and somewhere where i would feel comfortable bringing out-of-towners.\n\nGot the vegetarian thai green curry last night with brown rice. i enjoyed the spicy-ness of it, may be too spicy for non-spicy eaters. \n\nhad leftovers for lunch today and leaves a great flavor in the mouth.", "author": "Angelica M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-22", "description": "Just your average, run-of-the-mill Thai joint on Divis. Went in on a Sunday evening with my lady and had a good dinner for just a little bit more than I expected. Service was slow, but the servings were big. \n\nOther diners were mostly from the surrounding college (or so it seemed), so even though it wasn't a full house, it got kind of loud a few times. \n\nThere's nothing wrong here, but nothing to see either.", "author": "Allison S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-01", "description": "Wish you could give half-stars. Ordered delivery, so can't comment on ambiance or service. Food arrived fairly quick. Larb was decent. Drunken noodles were horrendous: too much garlic, almost no veggies, meat way overdone (chewy), and outrageously spicy. Don't know if it was a bad day or not, but I'm afraid to try again.", "author": "Annat K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-07", "description": "Came here on a friday night, was seated right away and promptly served- it's a good place to come if you are short on time. \n\nThe pumkin curry is wonderful, and my boyfriend liked the jungle lamb. Neither of us were overly impressed with the tom yon - it was a little too sweet and not enough vegetables. Thai iced tea was great. \n\nThe restaurant is a cute little place too, nicely decorated and comfortable. Not too loud- good for conversation.", "author": "Christy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-23", "description": "In the way that Thai Food goes, this place is perfectly average - and that's okay!\n\nThe flavors of most of their main entrees here are mostly unoffensive - there's nothing rich about them, but they're not exactly bland either. I've had the Pad Thai, Pineapple Fried Rice, and one of their curries. The spices (flavor wise, not heat wise) don't really stand out, but they're willing to pile on chili if you ask!\n\nOverall, it's pretty affordable and never really that busy. They are generally pretty fast here, which is nice. Would recommend if you live nearby and need to dive in for a quick bite.", "author": "Skippy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-17", "description": "We stopped in for a quick bite and got our food in just a few minutes! Pad Thai and spicy green coconut milk curry. Both dishes were well prepared; the restaurant's decor is \"ok\" and overall, the experience was just right for good Thai food in a hurry.", "author": "John H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-06", "description": "I'm not a big fan of spiciness, heat, hot stuff, etc.  I mean a little bite is OK but my limit is nacho jalapeños.  Sorry but I'm a light-weight on this flavor.\nBut if you are, you'll really like My Ivy.  I've tried a few dishes and the overwhelming memory of each is how spicy it was.  I have to ask for them to tone it down for me but it still makes me reach for my water.  \nThe food is good though.  Very flavorful, good sized plates.  All the Thai favorites are here along with the famous Thai Iced Tea.  My personal go to is the steak salad (Larb).  I love the combo of lemony, cilantro, mint leaves with everything else.\nThe have a nice dessert menu too.  The mango and sticky rice is my favorite.\nIf you like your Thai food spicy, be sure to try My Ivy.  \nParking is tough on nearby streets", "author": "Pablo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "Best Thai in SF! This place has it all, beautiful decor, hearty portions, and great prices! Their food is delicious and a dinner for two with appetizers, entrees, dessert and drinks can cost under $50.", "author": "Sara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-18", "description": "My most favorite place to eat for lunch on a workday....I love everything on their menu! \nThe food is always fresh ... I never had a bad experience at My Ivy....but my most favorite dish is their crab fried rice, there are actual crab legs in it and lots of real crab meat...and their Thai Iced Tea:)", "author": "Apple S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-25", "description": "My husband and I ordered the calamari appetizer, drunken noodles with tofu, and pumpkin curry with chicken and it was all very good! We had enough for leftovers and will enjoy them tomorrow! We got there right when it opened so it was a bit dead but the food was delicious on a cold fall night. My only constructive criticism is I would recommend they purchase a subscription for music rather than streaming Pandora. We heard ads throughout the evening and it detracted a bit from the ambiance. Other than that, it was great!", "author": "Megan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "This is my favorite Thai Place. I've never eaten in because there delivery is just too damn good. The food is delicious, the price is right, the options are plentiful and the delivery is fast and accurate. Highly reco.", "author": "Penguin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-20", "description": "Very yummy and fresh.  I had the pad thai without onions with chicken and tofu.  It was great.  My husband had drunken noodle with tofu, which was also very good he said.  Great service and very quick.", "author": "Lyndsey C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-01", "description": "Disappointed. I ordered from seamless.com for delivery.\n\nThis place had 4 stars on yelp so I was excited, but i found the food sub-par to say the least. I ordered spicy eggplant w/ tofu and papaya salad. both had more iceberg lettuce filling than eggplants, tofu, or papaya. \n\ni wont be going here again.", "author": "ellen m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-03", "description": "If you want good authentic thai food, then this is not the place to go for. Their food is okay but not good. Their portions are quite small as well, so one dish of noodles may not fill you up. I would only come here if I am desperately craving for Thai food and this is the only place.", "author": "Lucy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "My Ivy Thai is located a block away from a BFF's apartment so they eat here all the time. \n\nThey have a great assortment of dishes and I really, really loved their spicy catfish (can ya tell I'm  catfish fan??). It was actually spicy haha. So, that's awesome and kind of rare for a more upscale Thai place. The catfish had just the right balance of crispiness and softness and was served in a red curry / red chili sauce. And it was $10!! This was an amazing price considering the heaping helping of fish they gave.\n\nTheir red curry, green curry, and veggie eggrolls were also quite good!", "author": "Eileen E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-05", "description": "The Pineapple & Lychee Prawns is delicious. I've also enjoyed the Chicken Satay, the Caramelized Lychee Duck, and the Mango Salad.", "author": "Luke F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-25", "description": "My new boyfriend's name is Tom. Tom Kha.\n\nExcept he totally sucks here. I hate when my man disappoints me.", "author": "Joe T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "This review is solely for the fresh spring roll, which I order every time I go there for lunch (and for the peanut sauce that it is served with).  It's a meal for one or an appetizer for up to 4 depending on how hungry you are. \n\nI'm in love with this beautiful, large, \"Thai salad wrap\".  Don't remember if I've eaten anything else there.", "author": "HR P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "This place is sooooo good. The coconut rice is to die for and lemongrass chicken is amazing as well. I also got some sort of prawn appetizer with toasted almonds that was very tasty and it even came with its own side salad. Yum!! Very,very impressed and will definitely come again.", "author": "Pasha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-19", "description": "Friendly. Newly renovated. \nPad thai and thai Iced tea are our favorites. Low to moderate prices. \n\nThis is a nice, neighborhood restaurant near California and Divisadero.", "author": "Richard D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-07", "description": "We ate here today.. lunchtime. 12:15pm... waiter rushed to seat us, we asked if we could sit at a different place and was told no, place wasn't even full... waited to get served, then waiter rushing to take our order wth???.. after, my friends food wasn't even finished and she wanted it to go but waiter just piled up our plates without asking and her plate ended up at the bottom of our plate.. wth?... my friends food was ehhh ok.. salmon was good... if the service was better I would come back...!!", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-22", "description": "My favorite restaurant in this area. Friendly service. Totally recommend the beef noodle soup", "author": "Erika Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-07", "description": "Seems like there is a thai tradeoff in the city... environment vs food. My Ivy wins on ambiance, comfort, and cleanliness. If you're just talking about food quality there are better places (cough, cough...Jitlada...cough). But as a friendly neighborhood thai spot it works and I'll keep coming back.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-23", "description": "This thai place is literally across the street from my boyfriends and I love Thai food. We came here after game 6 of the GIants game before they made it to the World Series! I got the Tom Yum Noodle Soup which was good. It was basically the normal Tom Yum plus noodles. I like my Thai pretty spicy, and I thought id be a little more, which was what I was wanting.\n\nMy bf got the druken noodles, I tasted it, and it was good. He enjoyed it as he ate up most of the plate.\n\nWill be back!", "author": "Jess O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-27", "description": "I have always been pleased by this restaurant and never reviewed it, but today I received such rude and obnoxious lack of customer service that I can to come in and warn people to not order take out from this place.  If you do, do not expect your order to be accurate or the staff to be polite when acknowledging their mistake or gracious when correcting it!", "author": "Katrina N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-09", "description": "It was good enough and the service was great. However, I would rate this place as average and nothing really special. Which means I'd totally come back on any normal lunch or dinner but not somewhere I'd take people to try and impress them.\n\nI think the Pad See Ew was great and their papaya salad was good. I do love how much natural light is in this restaurant and not stuffy like a lot of moderately-priced Thai places.", "author": "Rylan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-02", "description": "Pros:\nThis is one of the best thai restaurants in the northern areas of the city, and pretty under-appreciated. The Mango salad and Lemongrass chicken are excellent choices, and you really can't go wrong here, and rarely need a reservation.\n\nCons:\nParking can be tough on Divis.\n\nFun:\nWalking down Divisadero after dinner you can see all sorts of interesting shops and bars..", "author": "Mike G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-14", "description": "I've been here a couple of times and can safely say that I like this place.  It's not anything that will blow you away or spectacular by any means, but it is safe.  The prices are fair, there is a lot of variety, they deliver and overall the food is tasty.  For convenience and overall quality I rate this 3/5 stars because I feel like it's hard to mess up thai food.  There are many options in San Francisco and many other places I would recommend other than My Ivy, but each time I've ordered from here I haven't been disappointed.  \n\nThe next time you are near Divisadero and California and craving thai food I recommend that you try out My Ivy.", "author": "Natan O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-30", "description": "Free online ordering, free delivery, fast and friendly service, cheap cheap cheap!\n\nI have been a die-hard osha fan for a couple years, but I was really far away, craving some thai, and My Ivy Thai was calling my name.  I am so happy I responded... I had the pumpkin curry, which was awesome.  It's also only $10.  tip: a bowl of soup serves 2 - 4 people.", "author": "Torrey R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-22", "description": "I agree with the 4 star rating.  My Ivy isn't like most Thai restaurants, it is modern inside and they serve the soups in cool shaped bowls! They have a lunch menu and most items are around the $8 range, which is very reasonable. \n\nMy hubby ordered his peppercorn tofu and veggies dish spicy, and it was SPICY, Thai style! He probably got it super spicy because he ordered it in Thai, but despite being spicy, it was very delicious. I had the tom yum gai noodle soup, which was flavorful. The chicken was a little dry to me, but I enjoyed the noodles.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-03", "description": "100+ reviews and 4 stars overall?  Hm.\n\nI ordered delivery from here a couple of months ago.  It was delivered to my house in 10 minutes.  10 minutes!  Such potential.  And then I ate the food.  Blech.  Can't remember everything we ordered but one of the items was Ivy Best Friends.  The chicken was nasty and the whole thing was cold and rubbery.  It must have been sitting on the counter for a while.\n\nWith all of these good reviews maybe I should try it again.", "author": "Guesty G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-01", "description": "I went here yesterday by myself and had the Tom Kha soup and chicken stay skewers. They were both really bad. The soup was thick, milky and sour and the satay tasted like peanut butter. They were both very one dimensional and I couldn't finish the meal. I thought I might take the rice home for later but it wasn't good either because it tasted like paper. Additionally I did not digest this well the following day. I would only give one star but the wait staff was nice.", "author": "Shelly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-09", "description": "The food is really good ! We got food delivered to us for the first time and the delivery came quicker than was predicted which was really nice. \n\nI got drunken noodles with chicken and i like a little spice so they were very good however, my friend got the same and she is extremely sensitive to spicy foods and it was too spicy for her. It all depends on your taste though. The flavoring was very good and you could definitely taste the garlic in the recipe !!\n\nAs for price I thought it was reasonable, 9.00 for a good size portion of noodles seemed very fair to me :) overall I suggest trying it !!", "author": "Hannah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "I went there  for lunch with a group of co-workers.  We had a group of 10 and called ahead to reserve a table.  When we got there, the table was ready for us and the service was super fast.  Everyone enjoyed their drinks and food, definitely a good place for tasty lunch and nice ambiance... will definitely come back.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-21", "description": "I've eaten here a few times since the name was changed. The menu is changed too and most likely the chef because the food is way better then the thai place that used to be in this location. \n\nI've had a few of the rice and noodle dishes. All were yummy! I'll be back.", "author": "Kris B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-13", "description": "Wandered here one nice sunny day when I didn't know what to eat for lunch and I'm glad I wandered in here. Lunch prices are very reasonable for dishes and they have lunch specials that come with soup too. \n\nMy favorite here is the Pad Kee Mow. Super spicy but sooo goood! One of the better ones I've had. \n\nPad Siew- not really a fan of this. Kind of plain tasting\n\nPapayra salad with Shrimp- this was huge and good too. The grill shrimp just tasted a little too grilled for me\n\nPineapple fried rice- I loved the curry taste. But I could do without the cashews and raisins in it\n\nIf you are in the area and craving Thai food I would recommend.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "It can be hard moving to a new neighborhood. You want to find your new favorite go to places. There are quite a few thai restaurants near our new place, but My Ivy is the best. We are so excited to have found you, My Ivy! \n\nThe first time we went, I ordered the spicy catfish in red coconut curry sauce. The dish was super tasty with lots of vegetables. My husband ordered the caramelized lychee duck. WOAH. I love how they have rice options other than just white. Fun soju cocktails as well. \nNow that My Ivy has won us over, we've ordered take out many times: Tom Kha, Pad See Ew, Pad Thai, Spicy Eggplant, Calamari, Crab Rangoons... ALL delicious.", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-08", "description": "I really love this place.  We live in the neighborhood and have a young child, so we are frequently in need of good delivery food when we find ourselves at the end of the day, exhausted, with no dinner plans.  And Ivy delivers, usually in 30 minutes or less (despite what they quote us on the phone).\n\nThey replaced another Thai restaurant that was at this location, and improved the food and service dramatically. They have really creative specials,  very high quality food, and they really do listen when you ask them for modifications (more spicy / less spicy / not so much pepper / etc).  \n\nI absolutely adore the Ivy Beef, the almond prawn appetizer, the Pad See Ew, and just about everything else on the menu.  The Pra-Ram has more vegetables than just spinach, which was a nice surprise. The mango sticky rice is hit or miss. It's never BAD, but sometimes it has an abundance of coconut milk and sometimes it's lacking. When they do it right, it's the best I've ever had.  \n\nThe people who take phone orders and the delivery guys are all super friendly and clearly appreciate our business.  I like that they have our information in the computer, so we just have to give our phone number and they are ready to take our order.\n\nI haven't actually been inside the restaurant, so I can't make any comments about that!  \n\nSo overall, if you are looking for super scrumptious Thai food, definitely make a point of calling or stopping by My Ivy.", "author": "Sherri H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-01", "description": "Tried this new Thai spot in the 'hood. Not close at all to Lers Ros quality and flavors but some dishes might do in a pinch.\n\nThe chicken larb had pretty good flavors, but it's served with iceberg lettuce instead of the typical cabbage.\n\nSweet basil with pork, requested Thai spicy, was unbalanced. It needed more fish sauce and the pork was tough. I asked for Thai chilies but they gave me chili sauce instead, equivalent to Sriracha, which would ruin the flavors of the dish.\n\nThe Tom Yum was fine, could have been spicier, but the prawns weren't deveined properly.\n\nLers Ros delivery sounds more appealing after writing this.", "author": "Derrick V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "I can't believe this place doesn't show up as 4 stars.  I would urge anyone who rated it less than 4 stars to give them a second chance, because their less than 4-star experience was probably a fluke.  I have come here several times for take out and a few times to dine in.  I absolutely love the catfish; it's so delicious, I can never stop myself from scarfing down the entire dish, even when I'm full.  I also love their eggplant, pineapple fried rice, and prawns.  Their service is excellent; friendly and SUPER fast (whether it's dining in, delivery, or pick up). The restaurant also is very clean.  They have never messed up my order.  I would give them 4 1/2 stars if I could.", "author": "JJ M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-26", "description": "ya'll.... it was great. We ordered online with the eat24 app. Speedy delivery. Great taste.", "author": "Jamie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "Went here on a Saturday for dinner with a group. We had planned on having Mexican but were told they couldn't accomadate our party of 8 so we stumbled into My Ivy and they took us in from the rain. I thought that the food was fantasitc. We each ordered an entree and we had a bunch of appetizers for the table. We passed around our dishes so that we could each try everything and I was very impressed. So often with Thai, you can taste the oil that they sautee the food in but not here- it was fresh and light tasting. \n\nThe best part is, even with wine, beer, probably 6 appetizers and 8 entrees, the bill split 3 ways was only $65 with tip included. A very nice, upscale dinner for under $100?- I'm sold!", "author": "Carly T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "I have tried a few Thai restaurants in the city and My Ivy is by far my favorite! Each time I have been, the atmosphere is fun, the service is excellent and friendly, the food is delicious, and it is totally budget-friendly. You can never go wrong with the Red Curry Beef. The cocktails are yummy and exciting. I would definitely recommend giving My Ivy a try if you're in the mood for some Thai food!\n\nAlso, make sure you check out the sink in the bathroom. It's super-cool!", "author": "Angie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-06", "description": "Yet another new thai restaurant near work means one more good lunch option.  We finally checked My Ivy out yesterday and were really impressed.  \n\nWe liked the clean and minimalist decor, and the presentation of the dishes was very nice (the pictures really are accurate).  They constantly refilled my water, and the food came out rather quickly, so we were impressed.  \n\nThree of us shared the crab rangoon and chicken satay appetizers.  Both were very good, very fresh, very hot.  We then shared the pumpkin curry with chicken and the drunken noodles (pad kee mao) with beef.  Both servings were very generous, and we were thoroughly stuffed.  I appreciated that the beef and chicken were large slices, rather than ground bits, and the veggies were really good on both.  \n\nReasonably priced for the nice food and the serving sizes, so I'm sure My Ivy will be seeing more of us in the future.", "author": "Anne Marie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-24", "description": "When I have no complaints about my take-out order (beef pad thai, spring rolls, Ivy Best Friends), it's appropriate to write a haiku:\n\nOrdered three items\nOnly ate half of these things\nTasty and a deal!", "author": "Jeanne L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-02", "description": "Update: This place has gone slightly downhill since it opened. Pretty bummed about it!\n\nSince the moment My Ivy moved in, I've been hooked! Their pumpkin curry is full of flavor, and the drunken fried rice has everything you'd ever want in a rice! I always order it for delivery, and it always comes in 30 min or less and the driver is always very polite! Definitely recommend!", "author": "Lizzie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-29", "description": "Stopped in here for dinner a little while ago and had a very good pad see ew. Funny something that tastes so good would have the word \"ew\" in it. But this is also a language where \"moo\" means pork. :-)", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-17", "description": "This place is always busy, they have very good lunch menu very reasonably priced. Waiters are nice and quick.", "author": "Y R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-26", "description": "One word: yummy.\n\nI appreciate that the food was fresh and clean and didn't leave me feeling heavy / oily. I've been twice in one week I loved it so much! I need to eat - in next time -- I've only tried the take out.\n\nI'm a fan of spicy food, so I loved the spicy green beans with chicken and thai peppercorn with chicken. I prefer their chicken to their tofu.\n\nGood spot - glad they are in the neighborhood!", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-13", "description": "Frustrating because I asked for rice and it wasn't delivered with my meal, spent 30 minutes cooking my own rice to go with their curry. Not what you want to do when you order take out.", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-15", "description": "I got a delivery and wasnt expecting much as most delivery food is...  well..  average and then came My Ivy to tinkle my taste buds.\n\nI can't wait to go in one of these days and eat at the restaurant!", "author": "Sumit G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-04", "description": "Food:\nI ordered the drunken noodle and the duck curry.  The drunken noodle was way too spicy for me (and I am not a wimp when it comes to spicy food).  I really enjoyed the duck curry; it was flavorful and delicious. \n\nDelivery:\nI called My Ivy to get free delivery.  It was a Sunday evening.  They promised that the food would be at my place in 40 minutes.  20 minutes later, they were at my door.  I was very pleased.  \n\nOverall, good experience.", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-12", "description": "I may be a little bias, only because this place is two blocks away from may apartment, but I'll have to say that the food is pretty damn good!\n\nI've been here for a total of three times and each time I went, 4 starts right off the back.  This restaurant is in a good location for all you Lower Pac Heighters and the prices are very reasonable.  Service is excellent and the food does not take long to come out.  \n\nGenerally, I'll order the green papaya salad, pad see eww with pork or chicken, and a side of the sweet and sour chicken.  The last time I went, we ordered the spicy catfish.  I don't really like cooked fish in general, but the spicy catfish was oh so delicious.  \n\nYou can also order takeout and delivery, but I have yet to try that.  Overall, an excellent place to get some thai loving!", "author": "Shad B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-10", "description": "All I know is I kept saying \" wow this is so good\" after every bite. That was basically the theme song to my meal. We ordered the following: \n\nChicken Satay\nSpicy Catfish\nPineapple and Lychee Prawns\nIvy Best Friends\n\nRecommendation - Eat the spicy catfish with a little sticky rice from the Ivy Best Friends. This is heaven. \n\nExtra plus- legit to go containers, no spill or mess. Food was piping hot! \n\nWonderful! Yummmm!", "author": "Alexa V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-08", "description": "This place just opened on Friday night last week, replacing the often dissapointing, and empty, Khoon Chang Thai.  \n\nLast night Morgan G. and I ate here and were stoked, finally good Thai on Divis.  Finally.  \n\nWe started with spring rolls with a side of peanut sauce.  I like to consider myself the world's foremost expert on spring rolls (as if you didn't already know) and these are some of the better ones I've ever had.  \n\nWe followed with Green Papaya salad, and it too was extremely good.  \n\nFinally, we had some Pumpkin Chicken Curry with conconut rice.  All of it was excellent, really some of the best I've had in SF.  \n\nFinally, as if you didn't need another reason to check this place out, they managed all this great food and delivery on only their 4th day open (no growing pains) and already are serving wine, beer, and soju drinks.\n\nFinally (for reals this time) the place is a little family-owned joint and they're bringing good Thai to Divis, GO SUPPORT THEM!", "author": "Carl B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-10", "description": "I had dinner with friends the other night at My Ivy and i was impress how they urbanize the place from typical Thai restaurant to cozy and nicely design place. \n\nNot only the decor that i like but also the food! Of course it's what i came here for. The food here is awesome. Me and my friend ordered a bunch of dishes like Almond prawns, Caramelized Lychee duck, papaya salad and Golden calamari. I'd say my fav dish is the almond prawns, i think the portion was just right and its comes on the bed of crispy noodle which i really like. This dish is a must! \n\nWell, if you read this long, i think you must interested in this place so why don't you just go try it yourself.", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-09", "description": "Hurrah for pumpkin curry! \n\nAdorable little thai place that will seat you immediately and serve you delicious thai food.  Easily my favorite thai place in the city!", "author": "Hillary W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-06", "description": "Fantastic mid-range, Thai spot.  It's fairly new and we stopped in on a whim on a rainy day for dinner.  Started with the crispy veggie spring rolls then the chicken Pad Thai and spicy string beans with vegetables and tofu.  Everything was delicious and brought out in a timely manner.  The Pad Thai had a great flavor and you could choose the spiciness of the string beans.  Both dishes had enough portions for decent sized left overs.  My only qualm was that the string beans didn't come with a side of rice.  The prices were very reasonable.\n\nWe didn't have to wait at all and it looks like this place does quick take-out and delivery business.  However, after all these reviews, that might change!", "author": "AJ L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-26", "description": "Excellent Food!\n Great service!\nPineapple Fried Rice, Pad Thai, and the yellow curry were AMAZING.", "author": "Diana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "The lychee duck was perfectly cooked and absolutely delicious.  The cocktail I had was probably one of the best I've had, although I cannot remember what it's called for the life of me.  My friend's lychee martini was far too sweet, but not the worst I've ever had.  \n\nMy Ivy is perfectly decorated, but the music was absolutely painful.  I've been to many restaurants that play remade version of 90's hits, which are always awful, but usually not so loud.  Unfortunately, it really took away from the meal and probably explains why so many people were coming in to pick up an order instead of sitting for their meal.", "author": "Colleen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-27", "description": "Ok, so I ate here today and I enjoyed everything on my table. Had some Fresh Spring Rolls, Golden Calamari and a unique refreshing...Pineapple-Lychee Prawns. DAMN!! Pineapple-Lychee Prawns. Oh, and coconut rice. I Like this place.", "author": "Glyde W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-05", "description": "Nasty... I don't know how this place has such a high rating. \n\nEDIT: Actually... now I think I know how this place has such high ratings... totally an artificially inflated rating. If you look at many of the reviews they are from people with 1-3 reviews and generic names. 90% of the pictures are professional looking photos added by people who don't even have any reviews... 4 stars is a scam, don't fall for it.\n\nOrdered delivery.\n\nGot vegetable Yellow Curry instead of chicken like I ordered and it didn't come with rice.\n\nThe Angel Wings were not crispy and were incredibly fatty and soggy. Also had an odd flavor - I could not eat them.\n\nPad Thai had an odd sour smell and tasted worse. I bit into a piece of the egg in it and almost gagged - stopped eating it right then.\n\nAlso, not cheap - wasted $30 and now I need to go find dinner.", "author": "Troy K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-31", "description": "Ive been coming here for years during my lunch break and the last few times service has been lacking since they've gotten two new female servers. I have to hunt someone down to take my order and to bring the bill. I was served my soup that was not hot, the same time they brought my food. They make me want to stop coming but therr are only a few choices in the neighborhood to eat. The guy server always guves good service though.", "author": "chari b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-08", "description": "I'm Thai and this place rocks! \n\nBasil fried rice is my favorite! Highly recommended. \n\nVery friendly wait staff! \n\nGreat interior design!\n\nA unique selling point about this restaurant is one particular type of sticky rice that you will never be able to get elsewhere! Ask the wait staff and they will tell you exactly what it is!", "author": "Freedom F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-08", "description": "Full disclosure..I've been to Thailand a few times...eating at street vendors, home cookoing and high end hotels in Bangkok. I've paid way too much for eats 1/2 as good as this.\n\nI can only offer 4 stars, because I did a take out order, so I really cant comment on the sit-down part of the service, but while waiting, folks seem genuine and attentive. The recent remodel adds a touch of class...think a bit below Osha, but way above the previous establishments design. \n\nThe Tom Young Goong (hot sweet and sour shrimp) was really well balanced..just the right amount kaffir lime leaves in there..several places seem really to overdo that element. I can see this will be a great item on those summer (a.k.a \"winter\" nights). Also can recommend the Pad Thai (chicken in this case). Standard fare I know, but I have had many blown attempts at this. I think the difference is they got the soaked noodles just right. Not bad for newly opened. In fact, very good.  \n\nI'll be returning many times to sample the rest of the menu, now I've got great Thai down the street.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-13", "description": "My Ivy is by far our favorite Thai place in the city and we have enjoyed becoming regulars here since soon after they opened.  It is 1/2 block from our house and a \"go-to\" place for us when we have guests in from out of town and need a quick place to have a good dinner.  \n\nHighlights:\n\n--Starters:\nMango or Papaya Salad: order extra spicy and it starts the meal off right.\nSpring rolls: top notch and not greasy\n\nMains:\nSpicy catfish\nRed Curry with Chicken, extra spicy\n\nWe have a 6 month old child and they have always been amazing in accommodating her as well.  In short, this is the quintessential neighborhood restaurant for us and we recommend it highly", "author": "Andy M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-07", "description": "Giving it 2 stars, its too bad because the food in this place has got potential. When we didn't have a kid we frequented this place. It's near a ton of other casual quick eats on Divisadero but the service and attitude we got from the people working here recently totally sucks. We ordered the pumpkin tofu curry and a bunch of other dishes for delivery. The menu indicated we can order non-spicy and so we ordered this dish for our 3 year old. When the food arrived, it wasn't just spicy it was flaming crazy spicy, so clearly we can't feed that to our toddler. I called the restaurant and they said \"we can't make exceptions the curry is pre made (Um, even though you can order it that way ). Just brush off the spice and next time YOU HAVE to order the other kind of curry\". Like FORREALS? You talk to your customers like that? \"Just brush it off\" it's in the freaking sauce, yo. A W E S O M E. Ah, how about no. Big fat no. Luckily, we placed our order through eat24, called them and they refunded us since we had to toss that firey  dish in the trash. Bye Felicia!", "author": "michelle z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-16", "description": "I am an original Thai, and grew up in Thai restaurants business. Of course I am very picky about Thai food. Mostly I cook Thai food at home but after foot surgery I am not be able to cook for myself and friends. One time, My fiance had to pick up my stuff@ Kaiser so I asked him if he could get me some papaya salad at any Thai restaurants. My ivy seems to be the best choice.\n\nSo he ordered some papaya salad and pad see ew chicken to go for me. After I ate papaya salad, I woud say It was nice balance between sweet and sour and a little kick off thai chili. I love grilled shrimp on my salad as well. But for the Pad see ew chicken, It wasn't right for my taste yet. The noodles needs to cook a bit longer, and more sauce on it.", "author": "Sasitorn O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "I highly recommend MyIvy restaurant!  I live nearby, so I frequent this place as a very reliable source for good Thai food.  My go-to is the Pineapple Fried Rice, and lately I've been enamored with the Pumpkin Curry -- these are usually to-go for lunch, but the indoor seating is also nice.  Plus, this sounds kind of weird, but the sink in their bathroom is really cool.  The servers there are super friendly and always greet me with a smile.\n\nThey've also donated for my AIDS/LifeCycle ride, so I personally can vouch that these are good people.  It's reasonably priced, and the food is fantastic.  MyIvy, you rock!", "author": "Steven L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-29", "description": "Veggie spring rolls were mediocre, nothing special. Beef & basil had way too much garlic and the beef was very tough unfortunately. I was the first customer of the day so perhaps that was the issue. Just not sure about this place at all.", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-25", "description": "It's tough deciding to rate this a 3* or a 4* establishment. This is one of the few places open on a Sunday evening within walking distance of UCSF Mt Zion. I called ahead for takeout, and ordered a curry dish along with a lemongrass chicken dish. Pickup happened without issues, except that when I opened everything up, I realized we had no utensils. Arrrgh! Okay, maybe a one time slight but I'm not deducing stars for that.\n\nUltimately, I think it's a 3* because I thought the food was just mediocre. I've had better thai food elsewhere.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-22", "description": "truly a perfect green curry served with a smile. thank you, my ivy!!! I will try the lychee martini next time xoxo", "author": "Tyler W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-07", "description": "The Tom kha ga wasn't what I expected in Thai flavor but I didn't order any of the star menu items people rave about. Seating is a little crowded, I had to wait outside to take my food to go. You're lucky if you find parking. The ambiance is nice with an intimate feel and trees decorated with lights. I recommend OSHA Thai their pumpkin curry is awesome as well. However if staying in the Fillmore/Steiner area I'm walking distance and curious to go back to try their crispy calamari.", "author": "Hollylujah W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-06", "description": "spring rolls were good. great presentation but average taste. \n\nTom yum soup: didn't like it bc it was on too much on the sweet side. it had cabbage, broccoli, and carrots in it... not authentic.", "author": "Tea Lyves .."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-14", "description": "Delivery was quick but the quality of food mediocre. \n\nThe papaya salad was a bit soggy and mostly lettuce, not enough papaya.\n\nDrunken Noodle (Pad Kee Maow) had one piece of broccoli, not bamboo shoots and was sparse on any ingredients other than just the noodles.", "author": "F S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-17", "description": "Decided to come here for the boyfriend's birthday back in early May.  \n\nWe ordered the\n-Dumpling Curry: $7 Straight up tasted like Ling Ling Potstickers. It was luke warm when it arrived to our table.  Don't get me wrong  I love ling ling potstickers.  But I'm not going pay $7 for 6 luke warm ones when I can get a whole bag from Costco.\n-Almond Prawns: $7 More like almond shrimp because it was so small.  When I see prawns, I expected big, huge prawns!  These were dinky little things, and you only get 5 pieces in an order.  Texture and flavor wasn't bad, but again not a lot for $7.\n-Pad See Ew: $8 Got this with chicken.  So little noodles.  I love pad see ew with LOTS OF NOODLES!  Chicken was very dry.  I didn't even eat any of it.\n-Druken Linguine: $8? (I think that is the price)  This dish was a little spicy for me.  Wasn't anything special.  Just tasted like a stirfry noodle.\n-Crab Fried Rice: $11 This dish had a lot of crab it in, and the flavor was okay.  The thing that got me was the rice was so mushy! Clumps of rice all mushed together.  Ew!  The texture was just horrible.\n-Caramelized Lychee Duck: $13 ALL FAT AND OILY AS HELL! Ehhh gross.  I took one bite and felt pimples growing on my face already.  I know duck can be fatty already, but this one was EXTRA FATTY.\n\nTried this place, didn't like it, will not be coming back.", "author": "Donna F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-10", "description": "It's never a good sign when bathroom sinks and a service faux pas are more memorable than the food.\n\nThings were headed towards a soft three stars after a meal of good if not great thai food. Spring rolls came sitting in peanut sauce (wished it was served on the side like most everywhere else), seafood soup was missing a lot of shrimp (or was just not very generous on portions), grilled chicken (lemongrass perhaps? I wasn't the one ordering) was solid as was the tofu with veggies. The dish I was most looking forward to, pinapple and prawns in a red curry, was good but much like the soup, light on the goods.\n\nFavorite part was the bathroom sink. Blue color with a unique design that had the water flowing from the faucet onto a plate and into your hands. More interesting than the food. Overall design of the space was good too. Loved the exposed bricks, just enough to feel modern, but not too much that it felt out of place for the neighborhood.\n\nProbably would have gone three stars if it weren't for the finale. We were a large group celebrating a birthday, and the bill was large with tip included. Everyone had paid their share and we were about to leave before we were stopped to let us know they forgot to add a dish. Really? Hundreds of dollars later? There was no time to double check, we paid and left. Those are mistakes you catch before giving us the bill.\n\nSkip. Unless you need to use the bathroom.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-08", "description": "The food is good here, but the customer service is Terrible. My co workers and I ate here one day, and I ordered a dish that had crushed peanuts on top when my dish was brought  out. It was my mistake, the menu did say there were peanuts in the dish, but we were rushing and I read it really fast when I ordered it and missed that memo. I am not allergic to peanuts, but they don't sit well in my stomach and I knew I was not going to like it. When the waitress brought my food out I politely asked her if it was possible to remake the dish with out the peanuts on top. She responded with a \"no\" and proceeded to tell me that it was my fault, I made the mistake, I should have read the menu and  if they made me another dish, I would have to pay for an additonal dish, so I would be charged twice for one plate, because of course, they were going to take the first one back. I couldn't belive what she had said, she was being very argumentatvie and rude. I apologized and stated that I was not aware that the dish was topped with peanuts, being that I had this particular dish many times from other Thai resturants and never had it been topped with crushed peanuts, so again my mistake for breifly skimming the menu and ordering, but if I ask for the dish to be remade, as your paying customer, I don't ever want my server yelling at me, blaming me and saying it was my mistake so I would have to be charged for two if the dish was remade, just simply, remake the dish.", "author": "Kiesh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-12", "description": "I've been back for many, many lunches. My comment on service wasn't really accurate. It is quick and efficient, but the last several visits the waiting staff was very attentive and friendly. This is my go to spot for lunch on Divis. Solid Thai food, large servings for a low price, and good service. Well done. \nSome specifics:\nGet there early for lunch and get free soup with your entre. I've sometimes rolled in around 2pm and they don't serve it. \nThe lunch specials are a great deal at $8, but it's really a lot of food... as in curry, rice, and BBQ chicken all on one big plate. If you're looking for an even better deal, try the noodle or rice dishes which are around $6.50 and are very filling. \nI like the soups, particularly the Tom Kha. $4 for a decent service size, or $8 for a huge container of it.\nIf they offered less expensive starters, I would definitely get the Tom Kha and a starter for lunch.", "author": "Adam F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-24", "description": "This is my favorite local little spot. Service might take a while, but you can have a specialty drink while you wait or a Thai beer. Love the mango or green papaya salad. They are the perfect size to share as a app with the spring rolls it is a meal. The spring rolls are the best ever and a good serving size. Soups and everything are right on.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "Although the name does not sound tasty the food is amazing. The Spring Rolls were super fresh and they way they were presented in a bed of sauce was perfect. The Lychee Prawn Curry Amazing a perfect balance of salt and sweet. The drunken noodles were great as well.  I cannot figure out why this place is so empty on a Saturday night. The staff was very friendly and service was impeccable. I would encourage anyone to visit for a very unique  \"original\" Thai experience.", "author": "Bill M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "I order take out from this place pretty often.  A lot of it has to do with their reasonable minimum order and free delivery, but that's not to say they don't make great food too.  I love the pad kee mao, spicy with chicken.  Their pad thai is also pretty tasty.  I haven't had their curries so I can't comment on those.  \n\nIn the area and wanting thai?  My Ivy will hit the spot.", "author": "Bobby L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-03", "description": "I enjoyed the pork chop i had and the salmon dish was yum. i know ive had better thai food from other places in sf, this one tho has an ease of convenience,since its near walking distance from work. \n\nDrinks- lychee martini was a bit sweeet, but good amount to get you warm inside. \n\nWaitresses here are VERY Sweet and VERY attentive. A+ for service", "author": "Cali L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-22", "description": "Got takeout here since I live a block away. Customer service wasn't its best but I guess because I didn't eat there. Wasn't greeted when I walked in until I reached the cashier, the lady stood and looked at me until I said something first. Said I came for a pickup and she brought me my food and with its bill and walked away. Rude -__- but I liked their Tom Yum soup. The pad Thai was okay, I've had better. The chicken was really bland, the noodles were super sticky so it was hard to eat a little at a time. Don't think I will be coming here often but it's alright here.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-26", "description": "OK for lunch. I had a clay-pot which came quickly (the menu says it can take a while). It was good - a mixture of chicken, shrimp, sausage and snow peas atop rice.   I liked it, but it was lightly seasoned, but you get a dish of the sweet-chile sauce.  You get a soup as well to accompany this lunch.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "Very good. Ordered delivery and it was all great: chicken satay, pumpkin curry and the amazing beef noodle soup. Reasonable prices and quick delivery.", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "I am a big fan of Thai food. My Ivy, it is the place for Thai cuisine. My family loves to eat  Thai food. Our favorite dishes at My Ivy are the Ivy beef and the spicy cat fish. My kids love the fish! The place is clean and the service is great. We have no complaints. Often times, we order to take out because the restaurant is close to our place. We get the same kind of fast, clean, neat, and friendly service level as we would do the eat-in. Check it out! You'll love their food and service.", "author": "Bao D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-15", "description": "We had take out from My Ivy this evening. It's our first time eating there since the remodel and menu updates. It didn't disappoint, though would likely have been better to dine-in.\n\nWe had the Calamari, which would have been better if fresh out of the fryer. As it was, the flavor was good even if the texture had \"wilted\" a bit in transit.\n\nThe Pad Se Ew and Sweet Thai Basil Pork were both tasty - the trip to our house appeared to have impacted them less.\n\nOverall, we enjoyed the meal and will definitely eat there again, though maybe as a dine-in experience instead of take-out, given our menu choices!", "author": "Karen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-11", "description": "I ordered two servings of coconut rice for one green curry.  It came in one of the smaller boxes and was tagged x2, but i still have curry and no more rice...also didn't get the toothpick I checked the box for when ordering online, which I don't care about, but whats the point in having a check box for it if they don't give you one.\nOther than that, it was good food, but not mind blowing, so its A-OK", "author": "Myler M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-22", "description": "This is a delightful spot for quick thai food. Since I live a short distance, I make it a point to call take-out a few times a month. I quite enjoy the vegetarian soup with tofu and some hot sauce as well as a fan of the tofu spring rolls!", "author": "Megan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "Pleasantly surprised!! Great service and great affordable food!! Would definitely recommend.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-29", "description": "Got takeout from here and was absolutely not impressed. The Tom Yum Soup was pretty much inedible-- bland broth with whole mushrooms and quartered tomatoes. The Pad Thai was nothing original, and it was missing lime and peanuts for topping. The red curry was decent, but nothing above average. This place seems to have pretty good reviews so my bad experience could have been a fluke with getting delivery, but I doubt I'd ever try it again.", "author": "Will A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-24", "description": "3-3.5.  I've tried many restaurants on Divis, and I finally made my way up to this one.  I came here with my boyfriend on our lunch breaks.  I ordered the yellow curry and my boyfriend got the pad kee mow.  The food came out very quickly (brownie points for that), and the portions were decent.  I liked the curry, and from my sample of my boyfriend's dish, the noodles were pretty good too.  However, the food was nothing really special; when we left, I didn't really feel the need to come back.", "author": "Can C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-29", "description": "My Ivy is a thousand times better than the restaurant it replaced a couple years ago so I'm always secretly grateful for that. I live across the street and enjoy coming down for the occasional dinner here. My friends and I love the $5 cocktails! Whenever they house sit for us they take full advantage. The service is always pleasant and the interior is clean and modern. My favorite dishes are the fresh spring rolls (so tasty!), pumpkin curry, and pineapple fried rice. My friends always order the duck fried rice (which I don't think it on the menu) and they go nuts over it.", "author": "Katelyn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-27", "description": "Tasty food, attractively presented. Nice atmosphere. The papaya salad was really good. Portion sizes generous, we took half of the food home. They offer very nice brown rice. \nThe kitchen seemed disorganized: our first entree, drunken noodles, came out with chicken instead of the requested tofu. The next dish arrived 15 minutes later, with the exact same mix of chicken and red and green peppers, with a few eggplant slices added to make it an eggplant dish. It seems they use the same prep bowl of veggies to put in all their dishes?", "author": "Patti H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-06", "description": "This place is our takeout staple in the neighborhood.  It is fast, cheap, and the food is fantastic.  Definitely the best Thai food in the neighborhood.  The people who work there are super nice and friendly.  Love the yellow curry, love the cashew chicken, love the crispy rolls.  One thing that is great about My Ivy is that the dishes seem to be less greasy and oily than any other Thai place, so when we do takeout I don't feel like I'm necessarily eating anything as unhealthy as most other takeout food.\n\nMy Ivy is definitely worth a stop for lunch if you work nearby and to add in to your rotation for take-out food or delivery in the area.  You wont be disappointed.", "author": "Aaron N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-01", "description": "My Ivy is my neighborhood spot and never fails to please.  Great food for take out, but the ambiance of the restaurant is enjoyable too, I'm surprised more people don't eat in.", "author": "Theresa O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-30", "description": "Best thai food ever! Get the pad thai with chicken it's amazing. Their lava cake is also excellent. Fast delivery too! It was so good I tried calling their manager over and over and over and over to tell them how good the food was, but I never heard back. I will continue to call until the manger hears my review personally. It was amazing.", "author": "Andrew G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-08", "description": "Fine for a quick Thai place to eat.  I was underwhelmed by the food (I ordered soup and a veggie side dish).  I have eaten better Thai food (comparing same soup) in San Francisco.  The prices were reasonable and the service was okay.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-08", "description": "This review is long overdue since I eat at My Ivy about...once a week. This place is great. A couple of the noodle dishes weren't my absolute favorite but the curries are bomb. The food is good, service is fast, and prices are definitely reasonable. This is my go-to spot for sure.", "author": "Sara V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-14", "description": "Quick terrible delivery food. Not the combination I was looking for. \nTom Ka soup: It was pretty much warm coconut milk with 2 prawns and 3 diced mushroom.\n\nMango Salad: Decent - Fresh Mango \n\nCrab rice: 2 tiny crab claws with barely anything on them + lots of tasteless greasy rice. \n\nPrice for all of this: $28", "author": "The Y s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-15", "description": "Water glasses were filled with no question, pumpkin curry is out of the world. Great place to go after a long day of work, the spices woke up our senses.  The spicy green beans with chicken were good too.\nWonderful place to catch up with old friends.", "author": "Sharon C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "We loved this place. We ate and drank like kings for $30. The only down side was that we were one of three groups eating in the dining room on a Saturday at 8pm. We have since figured out that this place mainly subsists on take out and it was a bit odd that it wasn't crowded. However, I would love to put in a plug for eating there! The dining room was lovely and every bit as chic as any other place in the neighborhood. The staff was also amazing. We started with a MASSIVE order of spring rolls that were super fresh and delicious. For dinner we had pad thai, and spicy thai basil. Both had great flavors but could have been a bit more bold. Why four stars? There is no where else in our neighborhood you can get this atmosphere, service, and freshly prepared food. Also all cocktails are $4 or $5 dollars.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-04", "description": "This is THE BEST Tom Kha soup I've ever had!  Yummy!!!", "author": "Crystal I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-10", "description": "They do not deliver to the Marina, although they are 1 mile away.  Please stop including the Marina as a neighborhood your company delivers to.  It is misleading and a total waste of one's time.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-16", "description": "Based on the food I had last night, I'd give this place a 2... but based on the experience I had, I raised it to a 4. I ordered delivery, and it wasn't good-- at all. It was really not good. I was super disappointed, so I called the restaurant to let them know that the meal I had was a total miss, and I thought one of the dishes was spoiled or something. The woman who helped me wasn't a manager, but acted more professionally than many managers I've encountered (and worked with). When I called, I was really quite certain I'd not ever try them again, but by the time I got off the phone, I knew I'd give them another try. The food may just not be to my liking, but the service was so great and so impressive that I'll definitely try it again-- more businesses need to act like this one did, and I'm very happy to support that. \n\n(Side note-- I ordered delivery through Eat24, and that is a service I'll never use again. BOO.)", "author": "Mrs. J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-17", "description": "The people working there seemed nice enough and my waitress recommended a chicken and green curry combo, which looked great when it hit my table.  On closer inspection, I saw that the chicken was pink and raw in multiple places. The beef curry was fine but my experience was tainted overall; I find Salmonella to be a bummer.", "author": "Baron C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-26", "description": "went in on a Monday, service okay, but the food wasn't spectacular, a little disappointed on presentation, lunch overall okay, needs work on entrees, no pop. \n\nOtherwise it's \"just\" another Thai restaurant in the City. Potential to do well in the area it's in.....", "author": "Edgar M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "Came here for lunch multiple times. I always get the mango salad with shrimp extra spicey.  It is awesome! As well as the string beans with ground chicken and brown rice. Gotta ask for ground chicken. Soooo much better and tastier. I got all my coworkers hooked on ground chicken now haha.  Definitely recommend this place for lunch.", "author": "Abra S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-15", "description": "Hands down, good Thai food for cheap. I love their complimentary soup as a starter and I love their BBQ pork and chicken with rice. $8-10 bucks, big portions. Yummy. I'm happy at the end it, hence the five stars. The service is fast too during lunch hour. Good call for those working within walking distance and have about an hour", "author": "Manu M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-12", "description": "We ordered in tonight. There was nothing particularly bad, but nothing good. The food was pretty bland. I think you can do better here.", "author": "Emily K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-03", "description": "Great food and service. My ivy beef was tender and not over sauced. Very hot and fresh spring rolls. Will definitely come again.", "author": "Gordon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "Yum! Friendly, quick service, yummmmmmy food (try the spicy edamame!!), totally reasonable prices.  I'll be back!!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-03", "description": "In a town flooded with mediocre Thai, My Ivy has rekindled my interest in the cuisine. Every vegetable dish I've tried so far have been amazing. My wife had a grilled chicken and pronounced it bland, so YMMV. So far this place is the tops.", "author": "Mark F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-07", "description": "So far so good. A thai place that's close to my house and is clean. That's bi-winning! Seriously, the vegetarian spring rolls with peanut sauce are great. The curries are excellent, far better than anything else in the 1 mile radius of my apt. The papaya salad is always fresh and spicy. I'm really impressed with their start, I'll be going back to this place often.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-26", "description": "tremendous menu, nice variety, great portions, priced right. Delivery service is often lightning fast. lovely servers happy to help and they hustle.\n\nnothing but good things to say about this place.", "author": "vladimir p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-04", "description": "bomb food, easy location to get to.  i live a couple blocks away yet it took me this long (6 months) to try it out.  \n\nservers are really polite and know how to bring the food out in intervals as you are finishing each dish...unlike Tortilla Heights across the street! \n\nit can be a bit noisy there so be prepared.  but again, not like TH across the street :)\n\nangel wings, mango salad, and ginger chicken were all sooooo gooooood!\n\ntry an Arnold Palmer if you havent, i should have take a picture to post on here of our meal.  \n\noverall: presentable, great service, and not too expensive for lover pacific heights. id good back an recommend to anyone that doesnt want to bring their children...or drunk friend that chats it up.  seriously!  but we did go in there after the fillmore street festival.\n\nopen till 10pm and they deliver for free.", "author": "Zach S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-11", "description": "Really good Padh Thai! Best I've so far actually. Love how tall the Thai Iced Teas Are and the cocktails are nice!", "author": "Deirdre R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-01", "description": "Recommend the chicken pad thai. Add some broccoli.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-08", "description": "A neighborhood gem! Popped in for a casual dinner while in town visiting a friend. Wow, we were blown away. Everything was fresh, delicious and wonderful. We picked the Pumpkin Curry to share as an entree and immediately regretted not ordering two!", "author": "Lindsey K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-24", "description": "Ordered delivery - Drunken rice with tofu but tofu was missing and the vegetables didn't taste fresh. Portion is on the small side. Very disappointed!", "author": "Lavinia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-31", "description": "Very good food!! I love coming to My Ivy on my lunch since the service is fast and food is very tasty! The yellow curry is my favorite, I usually get the chicken or pork, both are tasty!", "author": "Natasha I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "Yummy lunch specials. Yellow chicken curry was delicious! Quick and kind service.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-13", "description": "Live in Lower Pac heights and found this place at the corner of Divisadero and Pine. INCREDIBLE food!! Great service. Cute atmosphere. My new favorite Thai place in the city. Have been here several times with friends and always share everything, so i have tried a lot on the menu. The drunken fried rice is the best I've ever had. The almond prawn appetizer is to die for. Pumpkin curry, lychee prawn curry, fried tofu...all awesome!! Give this place a try!!", "author": "Terry G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-18", "description": "I really enjoyed the veggie yellow curry..broccoli, potatos,carrots, cabbage..delicious dish! I ordered delivery and it was fast and friendly. Pretty cheap,as well! Great neighborhood Thai!", "author": "Shelley M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-02", "description": "My Ivy is the perfect blend of your typical Thai 'cafe' type restaurant with the more upscale restaurants with great decor (Osha, Ozone).  The food here is just as good, I particularly enjoyed the coconut soup, and it also doesn't cost as much.  The reason I give it 4 and not 5 stars, is because it doesn't stand out much when compared to other Thai joints in the area.  I would like to see this place be a little more creative with their menu and add some 'fusion'. Great place nevertheless, you won't be disappointed.", "author": "Prakhar S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-26", "description": "This is my go-to Thai take out spot! I frequent My Ivy probably 2x per week. The wait staff is super friendly and even over the phone, always get your order right. I love their Tom Kha Noodle Soup... If you chose to dine in, their cocktail menu is very fun and different. Its a great little date spot for those in the neighborhood.", "author": "Marisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-09", "description": "Really good food, price is decent, portions are right. \nLove the deep fried salmon rolls served with spicy creamy dipping sauce.\nAngle wings were deep fried just right.\nWill be back to try other items on the menu.", "author": "Ol' L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-06", "description": "Great Thai food!  Great service, they are all so nice.  Prices are where they should be.  We had chicken satay, spring rolls, pad kee mao, and brown rice, and it was all great.  Cool little cocktail menu too!", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-09", "description": "My first (and probably last experience) at My Ivy:\n\nOrdered the fresh spring rolls (excellent) and red curry chicken.  \n\nChicken was raw in many spots, sent it back, they remade, but seemed uncoordinated and awkward.  No return utensils, took app plates without asking, struggled with a wobbly table.  When the curry came back, it was delicious and cooked.  \n\nI'd give it another chance if it wasn't for the inattentive staff (one person just behind the counter texting, no one was available to make eye contact with to get a new fork; had to use the fork of the person I was eating with).\n\nI tried, I really did!  :(", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "I decided to try My Ivy for lunch on a whim and was so pleasantly surprised!  They have delicious food at affordable prices and they give generous portions.  The service was friendly and timely and the interior is quite clean and minimalist.\n\nFor lunch we tried the Papaya Salad with BBQ chicken and the Pad See Ew with beef.  They gave us a complimentary soup to start, which was a nice addition -- nothing groundbreaking but a nice touch.  The Papaya Salad was really tasty and refreshing.  And the BBQ chicken had great flavor -- it had a bit of curry flavor which was nice.  And they also served it with a bowl of rice (I hate it when you have to pay extra for rice).  They grill it with the skin on in case you don't like that but I didn't mind and it added to the flavor.  My husband's beef Pad See Ew was also fantastic -- very generous portion with lots of tasty noodles, broccoli and beef.  A nice balance of salty with a touch of sweet.  \n\nI was so excited to see that they also deliver for dinner service!  Overall, a great experience...I am so glad a good Thai restaurant has come to Divis...and I can't wait to go back to try more!", "author": "J O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-29", "description": "This place is predictably delicious. I recommend the Drunken Noodle or Ginger & Mushroom entrees. The staff are sweet and I have always had fast service.", "author": "Katy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "Went in a grabbed take out on the way home from Chrissy field last week. T'was their second night open. Food was good and prepared quickly. The people were friendly. The bathroom was clean. An overall solid Thai experience.", "author": "Brian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-22", "description": "Great place for a quick lunch!  The food was fantastic and reasonably priced.  I had the BBQ chicken and papaya salad.  I am normally not a huge fan of Thai food, but this place has changed my mind!  I can't wait to go back.", "author": "Emmy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-20", "description": "Fresh, delicious food; warm, inviting atmosphere; friendly, engaged service; great value.  Menu allows you to combine different proteins with different dishes, i.e. chicken or beef yellow curry, shrimp or tofu pad thai, etc.  No problem finding street parking nearby.", "author": "Adam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-01", "description": "I just ordered takeout.  The vegetarian selection is vast and super tasty.  Their favors are defined and well-balanced.  Delivery took 15 minutes!  This is a gem of lower pacific heights!", "author": "Lara Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-14", "description": "Good service, good food.\n\nMy Ivy doesn't go above and beyond any other Thai restaurant I've been to, but if you're craving Thai and are in the area I'd definitely recommend it.", "author": "Pete S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-02", "description": "Favorite Thai restaurant in SF. Especially recommend the Salmon Basil and any of the salads.", "author": "Will H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-16", "description": "Best Thai in SF by far! The Tom Kha soup is the best I've had. Must try the spicy edamame and the calamari!", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-12", "description": "I love this place.  The service is great and quick.  The drinks and food are delicious and very affordable.  The brown rice is great!\n\nTons of veggie options for vegetarians.  Never had something I didn't like there!", "author": "Anna O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-07", "description": "Ordered Ivy Beef, Papaya salad & Shrimp Green Curry. Ivy Beef is a must have. Beef is tender and potato that come with it is perfectly cooked ( not overly and mushy) and the seasoning is excellent.\n\nThe Papaya salad presentation is really good and it taste equally good with the right amount of fish sauce, lime, chilli, maybe some basil & shrimp sauce I think.\n\nGreen Curry is typical just like any other Thai restaurant I have been.", "author": "andre l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-05", "description": "I am a huge fan of Thai food!  The food at My Ivy Thai was good, not great! The chicken lettuce wraps were too \"ginger-y\" for my tastes! The vegetable and tofu cashew dish was good, but nothing spectacular! I will most likely use this as a go to take out place but doubt I will dine in again.", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-17", "description": "We have eaten a dozen or more items on the menu both in the restaurant and for take out...everything is excellent!  The ingredients are fresh and the service superb.  A must for the Divis-foodies!!", "author": "chris r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-16", "description": "Friendly staff, laid back atmosphere, and awesome food at a good price. \n\nWe went there with a group of six, shared a few entrees and a couple appetizers family style, ordered two bottles of sake, and each got our own drink, and it was $20 even per person, tip included.\n\nGo there.", "author": "Nic H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-13", "description": "So, regarding My Ivy--- I LOVE the food, but would rather order-in from this place, than actually go to the restaurant.  Each time I've been there, the wait staff have needed some serious attitude adjustments-- not friendly, helpful, or cooperative in the slightest.   That said, the food, I'm fairly certain, is probably some of my favorite Thai food in the city. I tend to get the pumpkin curry, but when I have veered away from my staple, or have eaten family style there, I've enjoyed every dish.", "author": "Ami L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-13", "description": "I am an avid Thai food indulger and I must say that My Ivy is one of my most favorite restaurants in San Francisco.  I enjoy it for many reasons, besides the food being so delicious and very tasty and fresh, the location is a prime spot for me.  I live in NOPA and so walking a few blocks or easily taking the 24 to get there is no big deal.  It is small enough to still give it a neighborhood restaurant feel and big enough to take a larger party for a night before or after bars in the area if you're staying local.  The shrimp pad see ew and a mango mojito sound fabulous right now!", "author": "Alexa V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-10", "description": "I adored this place and am still dreaming of the crab fried rice. I live in Boston and on a recent trip into San Fran's lower Pac Heights, My boyfriend and I were jonesing for thai food. I quickly got on my food app on my phone and was directed to this restaurant. We visited at about 2 in the afternoon, the restaurant is small and has a cool modern vibe, the drink menu is small too but creative. You seriously got the cool Pac Heights vibe from this place. The fried rice with crab  was to die for and so was the beef with homemade wine sauce and the angel wings were so sticky and sweet...we were embarrassed at how much we were licking our fingers and in ecstasy all at the same time. My Ivy has a think outside of the box mentality when it comes to Thai cooking. I wish we could take this place and sit it down in the heart of Boston. I will go back to San Francisco just to eat here.", "author": "Shells C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-22", "description": "My first yelp review and I wish it was for a good experience, not a bad one. I ordered through My Ivy Thai online and unfortunately I didn't think the order went through. I never received a confirmation from the order because the web page expired. I decided to call My Ivy and place the order over the phone. About 15 minutes later, the delivery person showed up with two orders. He told me that they had an order online from me, as well as over the telephone. I told him that it couldn't be because I never received an order confirmation online. He called his boss and I spoke to her about how I should be refunded for one of the orders. She refused and was rude and unprofessional. She also said she called me three times, however I never picked up. I can assure you she never called. I told her that I would no longer be a customer, though I have supported the business from their initial opening. She said that was fine and hung up. I decided to call Eat 24 to see if they would reverse the charge. Thankfully, they agreed and were pleasant about reversing the charge. I feel that as a customer, My  Ivy should have made the call to Eat 24, not me. Therefore, I will no longer eat at My Ivy Thai. Honestly, if I was out fifty bucks for both orders, whatever, it's more about the principal and how unrealistic and ridiculous the manager of My Thai Ivy was. I hope this is helpful.", "author": "Lindsay N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "We just had a fantastic meal here. The lettuce wraps are a generous portion and very tasty, the pad thai is supreme. Their service is always friendly and the food overall very very good!", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-05", "description": "So delicious! I've never had a lychee tini. Sweet with a deep delicious melonish flavor. And not too expensive! Very friendly and wonderful atmosphere.", "author": "Crystal O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-13", "description": "Even the $7 lunch I had could not make me give this place two stars. Service was short at lunch--waiting a while before getting our order taken. As the server delivered the bowls of soup, there was a collision at the table which led to the soup falling to the floor. I guess it was considered my fault--no replacement soup for me as my dining companion ate hers. The noodle dish was soggy.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-12", "description": "Beautifully presented and tasting dishes!  SO good, we could eat here several times a week, and the Thai teas are awesome, too!  Efficient, helpful staff, could be more personable.  \n\nA little gross going through the kitchen to the bathroom, and demerits for not putting in all my leftovers to take home, guess they just picked one of the dishes, but we will go back for sure!", "author": "Lara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-20", "description": "Nothing exceptional, bu decent food and good service", "author": "Marco D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-25", "description": "We have now been coming here pretty regularly for the last couple years. The food is tasty and the ingredients are fresh. The wait staff is attentive and friendly. I highly recommend the fresh spring rolls! They are very good. We've done delivery a couple times and it's always been quick. The prices are also very reasonable.", "author": "Tyler S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "Go for lunch - the soup is wonderful, and the food is beautifully presented, and delicious. Remodeled, too.", "author": "Taylor M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-19", "description": "The food here seems to be on the higher quality end of the Thai spectrum while still remaining very affordable. Nothing is ever greasy and the service is always pleasant. Highly recommended!", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-18", "description": "Very good food, friendly staff and the food comes out quick/delivery is quick too! The portions are pretty big as well. :)", "author": "Michelle E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-20", "description": "Dropped in on a whim for an early dinner and were pleasantly surprised by the wonderful food. I had Tom kha gai and the crispy tofu salad and loved it. Can't wait to go back and try more of the menu.", "author": "Theresa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-21", "description": "Before my disastrous delivery order, I would have given this place 5 stars. It still pains me to accept that my roommates and I can't order from them anymore out of principle. We used to order from them about once a week ever since they opened. They recognized our delivery address and thought of us as regulars. A few weeks back though, they mixed up our delivery order and thinking it was no big deal, we called them to correct it. The lady who answered it was probably the rudest person I've ever dealt with at a restaurant. She pointed out that we were regulars and knew us but still didnt believe that the order could have been wrong. she challenged us on the phone and screamed at us! they finally sent someone over with the correct curry and had the audacity to charge us! we refused to pay and let the delivery boy leave...our stomachs have been left sad and hungry for thai food ever since. Goodbye my ivy!", "author": "Kara L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-03", "description": "everything is delicious! My new favorite thai place! nice modern atmosphere and fresh yummy food! The prices are very reasonable which makes it even better because I can go there more often.  The soup is amazine, the pad thai is best ive had, the spciy green beans are extremely flavorful, and I loved the chicken curry.", "author": "Erin Elizabeth K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-11", "description": "Great tasting Thai food from fresh, real ingredients, good price, warm yet professional service, and new contemporary ambiance. I was a regular of the old Koon Chang which always reminds me of my visit to Sukhothai. But the new decor, updated menu with the same, fast and friendly staff...makes lunch here more awesome than before and anywhere else in the neighborhood.  I love their grilled chicken and green curry beef and vegetables for lunch...planning to try the yummy duck dinner dish next week with my Sweetie.", "author": "rosalyn m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-20", "description": "Great neighborhood spot for a rainy night. Limited wine selection, but all wine & cocktails are $5. Food was delicious. Spring rolls were fresh and the peanut sauce was excellent! Definitely going back, love that they take reservations.", "author": "Jill I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-28", "description": "First visit to a new restaurant, two people.  The food was quite a disappointment.   The menu is very limited (particularly in vegetables), all the dishes are a lot smaller than you would expect for the price, and nothing tastes particularly fresh or good.\n\nWe ordered Fresh Spring Rolls (raw vegetables wrapped in rice paper), and asked them to omit tofu; the waitress checked with the kitchen, and reported that they could NOT omit tofu because the rolls were all made in advance, and they specifically refused to make one to order.  (The restaurant was empty at the time except for us.)  We ordered it anyway and picked out the tofu, and indeed it tasted tired and pre-made.  Another appetizer was Salmon Rolls, small amounts of mashed salmon rolled up in wonton wrappers and deep-fried; the filling tasted OK, but the wrappers were much too thick and chewy so they dominated the salmon and were hard to eat (four small rolls).\n\nFor entrees, we had Pumpkin (Kabocha) Curry with chicken; the red curry sauce was OK, with nice coconut milk flavor, but the dish was small with very little chicken and even less pumpkin (five small cubes).  Another dish was Spicy Eggplant with Pork; this lacked flavor (it was certainly not spicy, at all), had pork cut too thick, and was again short on eggplant (half a dozen pieces).  Carmelized lychee duck featured good roasted duck, but the raw spinach salad served under it had a distasteful sweet dressing, completely inedible.  Trying to get more green vegetables, we had asked for anything made with asparagus, gai lan, snow peas, dao miu, bok choy, sugar snap peas--anything, but nothing was available.  The only green vegetables in the kitchen (we were told) were broccoli, green beans, cabbage, and spinach.  We ordered a side dish of Steamed Mixed Vegetables with Garlic Sauce; it included carrots, mushrooms, broccoli, and a little cabbage,but didn't have much flavor (and in particular we couldn't taste any garlic to speak of).  \n\nTwo appetizers and four entrees made a scant dinner for two, because the portions were so small.\n\nThe wine list is extremely limited, and restricted to only a few very modest choices.  But corkage is offered at $10, so you should take your own wine.  (We did, and the wine service was fine.)\n\nThe restaurant space is clean and new, but minimal.  Very few people came in to sit down while we were there, but there was a trickle of take-away customers.  Service was competent, but not particularly attentive.\n\nComparing My Ivy to its neighborhood competition, a much better choice would be the nearby Sweet Lime thai restaurant.  Sweet Lime has a wider menu, more vegetables, larger portions, and all the food there tastes much fresher.  It also has a nicer environment, full of fresh flowers, very gracious and welcoming service, and a more-extensive wine list.\n\nI cannot recommend My Ivy based on this visit.  Based on the flood of early reviews here at Yelp, we had expected much better.", "author": "Robert G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "This is a very good Thai restaurant and the price is very reasonable!  I would give them 5 stars if it wasn't for the really awful Boys-2-Men, Spice Girls and Backstreet Boys mix CD on repeat!", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-20", "description": "First time- it was great Thai food and cheaper than I usually find in the city. Friendly staff and the food was fresh, hot and delicious. I recommend the fresh spring rolls (best spicy peanut sauce) and the mango salad for light dinner fare. Of course if you are looking for something a little more hearty you can't go wrong with their curry! Enjoy", "author": "L W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-02", "description": "zero stars!!  i found a cricket in my red curry.  literally.  a big cricket.", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-25", "description": "there were 4 of us and we ordered 3 apps and 4 main dishes. the edamame was spicy and tasty, coconut shrimp was to die for and the chicken stays came with a delish doping sauce!  our main dishes were big! the brown sticky rice is killer. we all really enjoyed the food. cheep beers and friendly waitresses, even tho we came in 20 min to close they still were very friendly to us.  everything we had was delish! I very much so recommend this thai place :)", "author": "Elise B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-13", "description": "What happened! i'm so sad because I love this place but seriously either they got a new chef or just  a bad day. Came here a few nights back and ordered the usual dishes, pad kee mow (vegetarian) and man it was awful. I had not requested for extra spicy and it came out burning my tongue. The noodles were not the right ones that are used , the broccoli was a bit yellow, the carrots had a frozen taste and it's so sad because the staff was super nice. But they really messed up that night. We also got some of the papaya salad that came with the sticky rice, sticky and glue was an understatement, we could grab the entire ball with our fork! i hope it was just an off night, i was super disappointed with the food.", "author": "sue c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-17", "description": "Went here two times for lunch. Had the chicken and pork first time and just pork second time with rice. Both times were very good. Service was good and food came out quick. Also they have an excellent thai iced coffee. Will definitely be back.", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-14", "description": "What a great find! Excellent food, excellent prices. Not in the mood to cook on a Wednesday? - no problem! - with $3.50 beers and $6 appetizers, and most entrees about $10, it's a great excuse to eat out. Plus you can take the leftovers to work the next day for lunch. My husband and I are thrilled we found this place. The only thing that would make this place better is some pillows or padding on the seats. I like a cushy seat when I'm enjoying great Thai food.", "author": "Gina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-23", "description": "Haven't been here for a month or so, but this place is very yummy. The soup is usually decent for a free soup, the fresh spring rolls are very tasty and quite unique, and the pumpkin curry is very good, as is the lychee duck and the other lunch combo duck dish. Pretty affordable, quick service, good food. Very good lunch spot!", "author": "Igor B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "Great food, friendly service, and they deliver!!  A welcome addition to the neighborhood.  Must tries include the spicy catfish, drunken fried rice, and larb chicken salad.", "author": "Erick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-28", "description": "Great, fresh, good quality, flavorful, food!  Hightly recommend", "author": "Nat S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-28", "description": "I'm sure the food is good, but the person who answers the phone for takeout/delivery is quite incompetent and doesn't seem to speak very good english.  By far the worst order experience I've ever had.  Their phone service is very static-y, which only makes the experience worse.  I had to repeat my information 4-5 times until she got it right.  Didn't even end up ordering anything because she told me to call back later since their phone service was so bad.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-02", "description": "I wasn't sure what to expect when we walked in but with my first glance at the menu I was sold. My friend and I were both super hungry after spending the day moving and the food did not disappoint. We shared the fresh spring rolls and the crispy tofu to start. Both of the portions were huge and I really liked both dishes. The spring roll was served in a peanut sauce that I thought was absolutely fab and I liked that unlike most crispy tofu, this version was crispy on the outside while being the right consistency on the inside. The Tom Yom Soup was also really good with a nice balance of meat and veggies plus the right amount of spice. I was not a huge fan of the Pad Ki Mao (drunken noodle) but it was only because of the consistency of the noodles (slightly gummy) and how undercooked the veggies were. That being said everything else was fantastic including my friend's curry, soup and 5 dollar cocktail so I'd definitely go back!", "author": "Maya H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-15", "description": "As a resident of San Francisco, I've been to a good number of restaurants in the city. Tonight, after going to the Opera Plaza for a movie, I happen to go to My Ivy because La Tratoria Food Inc, one of my favorites, was closed. I have to say that I was incredibly disappointed.  The moment I walked in (and maybe it's because of I'm a woman of color: who knows), I was treated like an intruder. The two women who approached me were rude, and continued to be so throughout my dinner experience. I could not help but to notice that while they went to other patrons to ask how their food was, I was never approached, only to sit me and give me the check. The caramelized duck was nothing other than 5 pieces of greasy duck over spinach. I barely finished it. And the wine glass was pretty dirty. I asked the waitress and she said it was on the outside of the glass. Is that any consolation? I love Thai food, but will definitely never go back to My Ivy at all!", "author": "Migdalia R."}
