{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "I'm from out of town and I was looking on Google maps for a pizza place near by that had a affordable price. I got to say I was skeptical about how big the pizza was going to be. \n\nI ordered a large Haight pizza and added pepperoni and sausage to it. Man was I impressed the delivery was on time, the delivery guy was very polite, the pizza was very tasty, and big. No complaints whatsoever, I definitely recommend this place for great pizza.", "author": "Casey L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-10", "description": "Good pizza, but they got my order wrong :( \n\nI was really excited for the deep dish Mythic pizza I ordered, but they just sent over a regular Mythic pizza instead (which is less expensive than the deep dish too, even though I was charged for the deep dish). The order also took nearly an hour. \n\nThe pizza itself was decent, but really heavy (the box felt like a weight to carry) and dense.", "author": "Alice Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "HANDS DOWN THE BEST PIZZA IN THE CITY. If I could eat here everyday I would. It's open late, it's cheap, and you will not find more mouth watering, fresh pizza then this. I may have them cater my wedding... who knows", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Hands down - best pizza I've had in the city thus far. Mind you, I'm the type of person who just wants some pizza, some good ol' pizza. I don't need it to be bougie with a bunch of weird toppings, hard crust and stingy sauce. \n\nEvery pizza that I've ordered looks straight out of Teenage Mutant Ninja Turtles. Cheesy, greasy, saucy and the crust is so delicious. I normally don't eat me crust, but this was so good that I inhaled the whole thing. Lots of happy coworkers when we get from this place. Photo for reference - those savages dug in right away.\n\nIt's also free delivery! Definitely reaching for their phone number when I'm dying for some pizza", "author": "Marissa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Generous toppings and so many slice options. Would definitely come again. I loved the Tijuana slide I just had!", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "The team behind this pizzeria is the nicest in the neighborhood. You gotta try a slice of Haight. Highly recommended!!", "author": "Jérémie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-15", "description": "Stop by for a late night snack, the service was fast and friendly. They were very helpful. The slices kinda looked like they might have been sitting there for a while. But we got a slice of cheese and added toppings and ordered a small pizza and wings. The slice was just ok, don't think I would order it again. The pizza that I ordered and that was made fresh was really good. I would come back here again and order a fresh pizza for take out. The wings were just ok.", "author": "Ron V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "This pizza was absolutely delicious! I got a veggie slice that was LOADED with cheese, bell peppers, mushrooms and onions! I added a ton of chili flakes to it and devoured it! The slice is a good size for the price, its a great place to stop for a quick bite or some late night pizza! The place itself is right between two bars, so I imagine it gets really busy late at night! Its a small space, so I wouldn't be surprised if there isnt any seating when it gets more crowded. The people behind the counter were really nice and seemed to bring out the pizzas for some bigger groups who were sitting there. Overall, I would definitely come here again! Great prices and quick service!", "author": "Kulmeher D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "The crust was light and airy,sauce was good and pizza was delicious. We ordered a deep dish pepperoni and it came out in about 20 minutes. The small is good enough for 4 I would say. Little hole in the wall kind of place.", "author": "Shaneel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Hands down best pizza joint in SF!\n\nPlenty of cheese and ingredients rather than the usual dry and seldom toppings pizza. My favorite is the Hawaiian but I've tried many others and have yet to be disappointed! Wonderful service, super friendly guys!\n\nPlace is open late for late night snack /post night out  carb cravings best satisfied here!", "author": "Oxana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "The Vegan Pizza was pretty good, service was pleasant and quick. Great \"hole in a wall\" that will surprise you with taste! I will return.", "author": "maryann t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "One of the best pizza I ever try!! I come all the way from Daly City just for a slide of pizza!! They have unique names for their pizza. Why i like is that they have slides not just the whole pizza!!!  If you like crispy crust you will love it here!! The take of the dough has a great taste! The best thing is that they make it on the moment is not been frozen or been there warm for a long time!   The people in there are sooo nice and very friendly always smiling!! My favorite pizza is the Greco with pesto!!", "author": "Rosie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Great pizza! \n\nOpen late and very friendly. \n\n10/10 Would recommend to a friend.\n\nWriting more words here to satisfy the help review minimum.", "author": "John I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "Have had pizzas delivered twice now, and I really love their deep dish pizza!  Big pieces, delivered quickly, and really good.", "author": "Sean R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-27", "description": "Mythic Pizza is my jaaaam! Doesn't matter what part of the city we end up in, this is our go to at the end of the night. Cheese with extra sauce. Yes, please! \n\nIf you're going to get a slice, just go all in and get a small. It's $4.80 more and you get a whole freaking pizza! You know you're going to eat like 53737282 slices anyways. \n\nThere's no counting calories when it comes to Mythic. \n\nJimmy is the best!", "author": "Shereen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "We pre-ordered 6 pizzas to be delivered to our daughter's birthday party today. Everything arrived just as we ordered, double cut slices, thin crust, and the pizza was yummy! A few of the party guests wanted to know where it was from because it was so good. Thanks, Mythic- you fed about 35-40 people today.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "After hours pizza! Yum yum!\nWhat does it say that I have eaten here 5 days in a row?!?", "author": "Douglas A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-31", "description": "I'm a transplant from NYC where I spent the first few decades of my life so that makes me one of those people who thinks they're a pizza expert. This is not NY pizza, but I realize I have to suspend any expectations of NY pizza goodness when eating pizza in SF. With that being said, Mythic Pizza hits the spot for eat-in or take-out. I love the amount of cheese (deliciously excessive) I get on a combo slice, and the toppings are decent to good quality. For some reason it's quite different when opting for delivery, and not as good. I much prefer to order at the counter, so that's what I always do now and I'm perfectly happy doing it.", "author": "Russ S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "I've been looking for a hole in the wall pizza joint; I think I found it! This place has amazing pizza and friendly service. There was no one around when I ordered-it's more of a late night place. The service was quick. Price was right. I'd recommend this place!", "author": "Alison J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-19", "description": "Mythic is a good stop if you are ambling around late night and want something cheap to wolf down. They load each slice with toppings and cheese until the crust can't support itself. I ordered the Tijuana, which had a ton of sausage, pickled jalapenos, and onions. It wasn't shabby for $5.", "author": "Huey N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "Bring cash (not cash-only, but don't waste our time), order a slice of Haight, and be smashing savory za in no time. The XL pie will feed a turnt group of dudes no prob.\n\nIt's not gourmet, boujee wood-fired shit. It's just solid slices by the same group of nice dudes.", "author": "Logan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "The best pizza I have tried the slices are so big and cheap its great place to eat if you are a little broke", "author": "Taha R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-05", "description": "I USED TO LOVE THIS PLACE! Is super close from my house so i would always come here, but what i'm about to tell you guys is why I DO NOT LOVE it anymore...\nThursday night, my friend and ordered a XL pepperoni pizza with extra cheese, because that the type of people we are, they took the time they always do, like 20' but brought the WRONG PIZZA, i called them back and they said \"yeah, we'll send you another one, KEEP THAT ONE and the new one is coming\" So we were super happy and just jumping around, i mean a pizza for free? my two favorites words in there, anyways...The pizza guy came and he's like \"where's the other pizza?\" and i'm like \"the guy on the phone said it was a gift\" and he's like \"No, no, no, he would've called me\" so i called him because i am 100% SURE HE SAID THAT, even my friend heard it! So i called the pizza place and told him what was happening and he said \"No, no, no, no i said that pizza is for other client you need to return it\", long story short they made me look like a liar, wanted me to pay for both pizzas(!!!!!!!!) and YELLED at me at my own effing house! He even woke up my baby! RIDONKULUS! You just lost a VERY LOYAL client, and all the people i took there, i feel totally hurt and you guys suck. Yeah, you know who i am.", "author": "Francisca S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Great pizza by the slice. Cheap. Can be taken out for a beer combo at the NocNoc or enjoyed while waiting for your laundry.", "author": "Guillaume S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-13", "description": "Must've been a Monday when we were meandering through the Haight. Midnight musings made me crave a mushroom & olive slice, Mystic's was neither mammoth, nor miniature, just medium in size. A messy mountain of cheese, a meager mound of toppings, a mishmash of mediocrity in my mouth. Moderately priced, a mere $4, much value for your money. Might return, but the likelihood is marginal. Masters of marvelous comestibles they are not.", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-23", "description": "They told me one price and charged me something totally different? It didn't make any since. They didn't own up to their normal original price they charged me. They gave us horrible service and I'm pretty sure they messed up our order on purpose. Their menu price doesn't match what they have listed. I will not be going to this pizza joint ever again! They are all rude and lie so much! Plus the pizza is not that good.", "author": "Nick Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-23", "description": "So they dont honer the prices they have on the menu. The worst service ever and when u ask for a manager 3 people came up. Ugh worst experience ever 1st time in San Francisco and this is what happens. :(", "author": "Edgard Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-31", "description": "The only reason why I'm setting this as a four star is the location is a little uncomfortable for a suburbian like me, and the place is kind of small so there isn't much room if you plan to eat there with a large group of friends. I would say it could fit 8 people comfortably.\n\nI'm unsure about why other reviewers have 1-starred this mainly because I've had my share of pizza and I've hardly seen a pizza slice this big, with the dough an impressive balance of soft and crunchy yet not breaking the bank when you're looking for a simple late night bite. I had their pesto slice and their Hawaiian. Maybe once the toppings get more complex and heavy the pizza doesn't hold on its own, so I'll come back and try more toppings to see if it holds up and is consistent.\n\nThe staff even late at night was patient, and it didn't take too long for them to whip together a fresh slice from the oven for me. They have Costco-sized chili pepper and parmesan cheese readily available if you're into those add-ons for pizza. They do put a very generous amount of what I think is mozzarella cheese, and it does look like they don't integrate the toppings into the dough. It's more placed on top than baked in, but still delicious nevertheless.\n\nVerdict: Coming back, if I'm looking for a quick and dirty yet satisfying slice of pizza while I'm in the area.", "author": "Michelle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "This place is completely underrated. For a late night slice this place is perfect! They load up the cheesiness on all their pizzas. People who work here are really nice too.  They have plenty of the toppings you'd ever want on the counter, and even have italian seasoning which is something that was so tasty on my pizza but I haven't seen elsewhere. Bonus, the price is reasonable! 2 slices for under $10? Yes please!", "author": "Monica G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-05", "description": "My love for the sandwich shop nearby, \"love and haight\" brought me to try this place on a late night before driving back to my town.\n\nI was excited for this place. It's veg friendly with various exciting options.  I took it to go for the road and what do you kno. As I bit into my slice all I tasted was a smoky burnt taste.  The bottom of my pizza tasted burnt. Although it was packed with toppings... I propose the pizzas are half cooked then extra toppings are added and it's baked again fully.  That's kinda gross.\n\nThe pizza was burnt and I was disappointed to the max. Never going there again when I visit. Better to stick to the basics and \"Love and Haight\" sandwich shop owns this heart.", "author": "Mypang T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-21", "description": "Ordered a slice of sausage. Pizza was burnt & cheese was runny. Not worth the money at all.", "author": "Richard J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-06", "description": "Never again. I used to believe that there was no such thing as bad pizza. I have never written a Yelp review (one maybe) because I have never had my morals called into question before. I breath, dream, eat and live pizza. \n\nAll of their slices start as cheese and they glop toppings on and put in the oven. Not the kiss of death but less than even your most basic pizza places. By this time there is sooooo much cheese on that motherfucker. Again, might be okay, but... it's not good cheese.\n\nI go to pick up the slice and one side of the crust splits perpendicular to the crust. My faith wavers. I scoot down the slice and guess what? It fucking happens again. What the heck and half of Georgia. I would eat two slices of any pizza. I left a mush of cheese and bullshit crust on my plate and now my stomach hurts. \n\nSave your time, money and faith in pizza. Go to Escape from New York or if you can travel get your game on at Golden Boy or Tony's. \n\nWorst pizza ever. Come on, Lower Haight. We can do better.", "author": "Cathleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-08", "description": "If you need a late night, cheesy grease pocket to soak up that Lower Haight alcohol collection you've amassed, look no further than Mythic Pizza. In all seriousness, it was a very tasty slice, miles better than Cybelle's or Nizario's or Oz or any of those other terrible pizza joints that inexplicably have more stars than this one. \n\nSort of expensive, but if you stick to cheese you're only out $3. Go for it.", "author": "Andres B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-19", "description": "My review is about the delivery service and not necessarily the pizza itself. \n\nI ordered pizza from Mythic Pizza in San Francisco through the Yelp app on my phone, which I have done a number of times. The estimated time for delivery was 45-60 minutes, and I got home about 25 minutes after ordering, around 2am. When I arrived at my house, there was a car waiting outside of my building with its flashers on, which I thought nothing of since I was early for the delivery time. I walked up my steps and began to fish for my keys. Mind you, I'm female, alone and it's the middle of the night. I looked over my shoulder and realized that the delivery person was there, but there were two men approaching me.  One guy gave me the pizza, and the other pulled out a crumpled print out and started pointing at the word \"cash\" and stating the word tip very loudly over and over. \n\nBesides the fact that all of this is done through the app, their appearance was extremely intimidating and I was worried for my safety. I was cornered at my door in the middle of the night, with a pizza being delivered by two aggressive men, which I have never had happen before. It made be nervous even to put my keys in the door as I wasn't sure of their intent.  I told them I did not have any cash and waited for them to move away, which they did, but the whole experience was intimidating and scary. Additionally, and likely not coincidentally, I had another friend also order from the same place at the same time and the SAME thing happened to her with her delivery - two guys demanding cash in a very aggressive manner. It could not have been the same people as I live in NOPA and she's in the Mission, and our pizzas were delivered at the same time.\n\nI will not be ordering through Yelp nor from Mythic again in the future as I do not believe this is a safe delivery service, and wanted to share here so that others may be aware.", "author": "Elizabeth W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-22", "description": "You know it's bad pizza when you are drunk and the pie still isn't good. I don't know wtf is going on in the lower height but nobody makes thin crust pizzas. Get on it", "author": "Yoshi V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "Athens pizza is totally the way to go.. well, at least if you like artichokes and pesto.\n\nMythic pizza is the perfect late night (and, quite frankly, any time of the day) pizza place in the Lower Haight. The cheese is ooey and gooey and the pizza stays hot for a while (so you can pick it up and eat it while walking back home).\n\nThey have pizzas with the standard toppings, but I think where they shine is the specialty pizzas. I am a huge fan of their Athens pizza, which is topped with artichoke hearts, pesto, and white cheese. Slices are each under $5 (there may be a couple of exceptions) and the quality is amazing.\n\nIf you're hanging around one of the bars around the Lower Haight and are in need for those late night carbs, definitely check this place out. Your stomach (and drunchies) will be very happy with you!", "author": "Julia N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-19", "description": "Let me preface this by saying I've been ordering from Mythic for YEARS. The pizza is good and affordable. But when your pizza delivery leaves you concerned about your safety, it's time to find a new favorite. \n\nOut of my last 3 orders, 2 left me feeling at best disappointed, and at worst, scared. Order #1 took place on a Sunday afternoon. Est Delivery time was 45-60 minutes. After an hour and a half, the pizza hadnt arrived. I called 5 times and kept being told \"it would be here soon\" with no explanation. After 2+ hours it arrived, and the guy had a car full of friends. The pizza was cold. I called and asked to speak to the manager and kept being told he doesn't take calls from customers. Eventually they gave me his cell number and I got my pizza refunded. Whatever. \n\nThis Saturday, I ordered pizza through Yelp/Eat24 and was told it would arrive within 60 minutes. I waited 90 minutes, no pizza. I called, and the pizza magically \"arrived,\" with two guys waiting outside my apartment demanding a tip, yelling in my face. It was about 1:45 am, and I am a woman, alone, with two men standing outside my apartment threatening me. They were waving a paper in my face, \"proving\" that I needed to pay them a tip in cash. I refused, called my boyfriend, and eventually they left. Strangely (or perhaps not, since it seems to be common practice), this exact situation happened with a friend of mine this same weekend.\n\nIt's a shame... pizza is supposed to lift you up! Not make you feel hungry due to a 2+ hour delivery, harassed and afraid. No pizza is THAT good.", "author": "Leslie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "very fast & excellent size slices\n\nI always get the mushroom, jalapeño, pineapple slice..\ngreat price! \n\n\nvery cool guys behind the counter!", "author": "Edwin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "The best pizza by the slice in the area. I recommend it to anyone in the neighborhood because they've got a great selection and good ingredients.", "author": "Shawn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-28", "description": "its cheap its local and they are nice. Its not trendy, organic and its too salty. But its close to home its cheap and they are nice. Never hada problem with  the delivery service. \nIf you order through an app maybe the app people deliver?  Call direct. I am loyal and now overweight fan.", "author": "Kathleen G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-24", "description": "Mythic Pizza may have changed their name to Mystique Pizza, perhaps to distinguish themselves from their Haight Street Counterpart? But that's the thing about this place, their pizza is good, that they don't even have to have predicable hours. I think maybe they are trying to change that by just opening late after 5pm everyday...All I know is that their pizza is the best I've tried out here. Their 6th St/Haight (it's the same toppings, but with different names depending on if you get it by the slice or as a whole pie), has all the toppings I love from artichoke hearts to pesto and tomatoes. If you catch this place open, say after visiting the clubs next door or across the street, Mythic is the place to eat. Expect colorful character to talk to you or offer to draw your picture if you eat inside or spend any time standing around outside.", "author": "Steve N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-25", "description": "1:50pm - We've order here a thousand times will no problems and today it's been almost 2 hours and we still haven't received our pizza. Called after an hour an a half and they said it should arrive any minute, after 15 min passed we called again and they didn't give us an apology or even give us an update or reason why it's taking so long. While typing this, they still have not delivered it.\n\n2:05pm - Still no pizza. Called again and put on hold and ignored. Asked to speak to the manager and he said he wasn't there. \n\n2:10pm - Received pizza. Driver was with a friend in his car, which was weird. \n\n2:12pm - Pizza is cold, drinks are warm, salad is soggy. Called asked to speak to a manager, said the manager would call us back on his phone within 10 min.\n\n2:26pm - No manager call. Called the driver to ask him why he was so late since the manager hasn't called. Driver couldn't give us one. Driver said the manager has called but no missed call on our end. \n\n2:29pm - Manager finally called. Finally received an apology. Offered us a refund. He was very nice. Definitely the one shining light on the whole experience.", "author": "Mickle N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-25", "description": "They've been around for 30 years and the pizza is still terrible! You'd think in all this time they'd have figured out how to do a better job.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "We're from Chicago so we're pizza snobs but YUM! I ordered by the slice The Greco (mushrooms, feta cheese and black olives) and it was delicious! The ingredients were fresh, tasty sauce and good ratio of cheese to sauce. Also the service was efficient and friendly. HIGHLY RECOMMEND IT!", "author": "Julie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "I've been going here for years.  One of the best pepperoni pies in the city.  If you order a slice, get the tijuana and substitute pepperoni for the sausage.\n\nDelivery has always been quick for me and the crew is super chill.  It's a pizza spot, so don't get too ambitious and try the supporting bites (i.e. Wings).", "author": "Zibbie N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-23", "description": "While I find that many patrons come from the bars across the street, Mythic Pizza boasts a customizable pizza menu with plenty of options. While I find that many people seem to like the place, I have found that the flavor and the dough failed to be more than just home made pizza. Knowing how many options I have in the area, I have continued to opt out of Mythic Pizza after my first try. I just can't say it was anything special, which included the wait time for a pizza nor the customer service.", "author": "Mohib Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "I frequent this pizza shop far too much. I've had all the toppings now and always go back for the mushroom. It's great value and so DELICIOUS. \n\nThe guys who run the place are all very trustworthy after leaving a credit card behind one time after too many beers, and are always friendly. Really good affordable pizza that never seems to disappoint!", "author": "Jonathan G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-15", "description": "I live in the neighborhood and have ordered pizza for delivery quite often from Mythic.  I order the same thing every week.  My wife and friends and I enjoy it.   Mediocre pizza, but hey, it's pizza.  \n\nLast week, I ordered my usual and the guy delivered a pizza with the wrong toppings.   (The pizza had feta cheese and my wife is allergic to it).  I called back and was told I would have a \"credit.\"   He guy provided no name and would not refund my money, just the credit.  \n\nSo, here we are on Friday night, I called in for my \"credit\" pizza.   I was told unless I had the name of the delivery driver, they would not give me my \"credit\" pizza.   In fact, I was given attitude and made to feel like I was scamming them.  \n\nI told them I have spent hundreds of dollars and am very displeased with the service.   Then hung up.  \n\nThey called back several minutes later and offered to send me my pizza.   Ummmm, no thanks.   Keep your spit-upon pizza.  My wife and I will NEVER order from there again.", "author": "Kelton B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "the pizza here is fucking bomb. and thats not just a drunk girl saying that. like that shit is so good. the haight. get a slice of the haight. with a lil ranch. you'll be happy you did it. \nhave fun. \nboom.", "author": "Isabel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Mythic Pizza was exactly what I needed. I got Hawaiian slice and pesto slice, all the ingredient ratios were perfect, and they had every topping you could want. Would definitely go back.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "My husband and I went in San Francisco for a concert, then we decided to have some slices of pizza. We found this \"Mythic Pizza\". \nWell, I have to say... pizza was so good! Cheap and good! Good baked, good cheese, good ingredients and kind staff. \nOh, we are vegetarians and they have many options for vegetarians. We took \"Haight\" and \"Cheese\". They were sooo goood! \nTrust me, I'm Italian! :D \nObviously it is not Italian style but it was good! (better than Domino's or Pizza Hut of course). \nIn brief, I recommend this place.", "author": "Scilla L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-05", "description": "If you come here, make sure they charge you appropriately as they like to charge more than the price listed on the menu.", "author": "Dipesh G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "We are currently in mythic with all the stools up on the counter, tables cleaned off and way past their closing time. They were cashing out and re-opened to sell us a slice. They had 5 left and we took them all. Best ever.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-28", "description": "Bad. This is a business based upon scamming drunk hungry patrons. They have no -ZERO-passion for food. The pizza sucks. It's almost flavorless. \n\nOne guy takes your order (and complains if you order too quickly in English). The other guy takes your cash (only) and banters with the other guy in Spanish, barely acknowledging you as he takes your cash in exchange for a cardboard-like slice of shit.\n\nAnd the kids don't notice or give a shit, I guess.", "author": "Kevin E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-16", "description": "DIRTY!  \nIf you're going to take my order and touch the cash register and who knows what else  ....and then go directly to making that pizza and touching the toppings without cleaning your hands first, I AM DONE!  \nJust give me my money back!\nI just threw up in my mouth after witnessing this several times while I was waiting for my pizza.\n\nNOT GOING BACK!", "author": "Little E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-17", "description": "Care for some rich - overloaded with cheese - greasy pizza?! \n\nMythic Pizza is next door to my favorite bar in SF, Toronados. After a night of drinking some good brew we were starving for something savory & cheap. We walked in next door... ordered a few slices and we were set. I could barely finish a piece - so much cheese! Every inch of that pizza was scrumptious! Service is slow & not the friendliest, but most pizza joints are (to-go service/call-in orders)\n\nI was staying in the Haight/Ashbury neighborhood so I was happy I found this little spot. Definitely check it out if you're in the area.", "author": "Juanita D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-09", "description": "No doubt this place is the \"go to\" pizza spot in the Lower Haight. The slice I ordered was very delicious. It was served on a paper plate like most pizza drop in locations. In an earlier review someone mentioned that this was just an average place.  The ambiance is just that. So I added an extra star to seal the deal. I would go here again and be content with the surroundings. This pizza location is surrounded by good taste bars with. Enormous beer taps and cool people. You won't be disappointed unless the cooks have an attitude!!", "author": "Nate C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-11", "description": "**late night review**\n\nDon't do it.  Don't do it!!   Don't be tempted by the toppings!\n\nThey do something really strange when you add toppings.  They take an already made cheese slice, add a ton of toppings, add more shredded cheese & then put in the oven (the same thing that only warms, already cooked slices).  \n\nSounds great right?  Lots of toppings & extra cheese?  It's not.  Instead you get this under-cooked mushy mess of grossness.  It's really not pleasant to the mouth, on all levels.  \n\nHowever!  With the plain cheese, you avoid that pitfall.  And voila!  Not bad for 2 am pizza.  \n\n\np.s. if you ever end up dropping said pizza on the ground, cheese side down, when trying to get into your house..... all bets are off.   Oh... and reheating it to \"kill all the nasties\" doesn't quite work...  sure fire tummy ache in the am....  = (", "author": "CatwomanRoar M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-19", "description": "This is a good place to grab a quick slice of pizza but its nothing special. Got a all meat and pepperoni slice. Pizza was fresh which was good but for 8.50 for two standard sjze slices I'd rather go to escape ny or another pizza place.", "author": "Josue V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Got the special for with a Large Pizza and the buffalo wings for $24, seriously delicious pizza. Had pepperoni and feta, but would have been just as happy with a cheese. Noted that they were voted best cheese pizza. Will eat here again!", "author": "Kuhray V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-09", "description": "I was feeling lazy, and this joint was right beside my front door so I ignored the bad Yelp reviews and ventured forth. Mistakes were made. It might have been an alright slice of pizza if it had actually been cooked. It was soggy and cold in the middle. Will not be returning.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-06", "description": "These guys have a bad rap. For some reason your scores are low? And all I have to say is it's the cheapest pizza in lower Haight area.  Yes, it's not that great and the customer Service is subpar.... But... It's cheap.  What do you expect???  Every any other \"small\" pizza in the area is $18.  Here you can get 3 HUGE SLICES FOR LESS THAN $15", "author": "Justin G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-17", "description": "My sister-in-law told me about this place. We had to visit when we were in SF over the summer. We gave the Athens pizza and the Haight a try. I felt the pesto and oil in the pizzas was overwhelming and it was literally dripping oil when I was trying to eat it. I also thought the cheese was more than we could handle. The ingredients were fresh but those things turned me off.", "author": "Varun Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "This place has something for everyone: for people who want to eat decent pizza (I mean, we're not in New York, but...) it has decent pizza; for people who want to complain, they have plenty to find, it seems.  Some people think it's gross, and maybe some of the combinations don't quite mesh, but leastwise the Athens is real good.", "author": "Scott R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-09", "description": "I used to love this pizza place and it was my go to for delivery. The pizza seemed fresh and gooey and delicious and I even recommended it to my friends. Well that is all over now. \n\nI placed my order last night and after waiting over an hour for it finally got a status update that it should \"be there in a few minutes\". 15 minutes later and nothing, while I'm checking on the status for a second time the food arrives. The driver shoves my order into my hands and walked away with none of the utensils or extras that I had requested or the bag that they automatically charged  me for (if you're not from SF there are bag fees).\n\nUpon being \"given\" my food I realize that it is cold. Not warm. COLD. Even the bottom of the box is cold and it certainly wasn't in any sort if heat saving carrier - mind you this restaurant is 1mile from where I am. I open the box and the pizza is congealed, dry, and disgusting and the wings are cold, hardly what I would call \"hot wings\" and also congealed to their foil which I had to peel them off of to eat. \n\nWhen I complained I was told they would give me $5 off and even if I wanted new food it would still take an hour and 45 minutes and would be cold again.\n\nYes, that is what they TOLD me. I will never offer this horrible restaurant my patronage again or ever recommend them. Not to mention this order ended up making me THROW UP later that night and I'm still feeling queasy this meaning.\n\nThanks a lot Mythic pizza!! Hopefully this review helps others stay clear of this horrific place.", "author": "Kat L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-19", "description": "Don't go for customer service -- that's why me and my boyfriend order delivery. He's a regular -- good pepperoni pizza. Haven't found better unless I make a trip to north beach to Tony's which is to die for!! This works in lieu of that for sure.", "author": "Neal B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-02", "description": "Mythic pizza is a perfect late-night joint when you just want a quick bite. We dropped by for a bite after a fun-filled night at the Church of 8 Wheels. The Haight pizza is really good- even for non-vegetarians! Love the combination of pesto and garlic. It's pretty quick and easy to walk up to the counter and order a slice of pizza for around $4.50. No long lines. There's also not much seating inside, and it's more of a stand up and eat or take it to go type of place. The pizza crust didn't blow my mind, but the dough was quite crispy on the bottom, and they really slathered the pizza with cheese. They also accept credit card, which is great when you don't have spare cash on hand after a long night.", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "I'm a vegetarian, and I went nuts for this spot.\n\nI had a veggie slice and a Haight slice, and the Haight slice was really, really good.  Open late and relatively reasonably priced.\n\nAlso, everyone I know called it \"Mystic Pizza\", but whatever its called, I would definitely come back.", "author": "Max P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-28", "description": "Friendly service, tasty pizza, comes out quickly, although perhaps slightly burnt. The freshness of the toppings is questionable, but it's perfect for those late night drunk munchies.", "author": "Hannah C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-12", "description": "Just had two slices of pesto pizza. It's basically sub par tomato cheese pizza with pesto gop squeezed on top. Nasty!", "author": "Patrick D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-25", "description": "They say there's no such thing as bad pizza. This is where you come to test that hypothesis. Wonderbread-like crust, gloopy cheese (a lot of it), and mostly-raw toppings. It's the kind of pizza that takes you back to your college cafeteria.\n\nMost by-the-slice places just offer three or four options -- cheese, pepperoni, and a specialty or two. Mythic sells thirteen kinds of pizza by the slice. While waiting in line, I wondered how they had so many pizzas ready to go. Did they have a back room somewhere with rows and rows of pizza waiting under heat lamps? My theory is that they really just have a bunch of cooked, untopped pizzas waiting; when you order, they pile on the toppings and throw it in the oven until the cheese melts. I got two slices, and it was hard to tell where the Veggie ended and the Mystic began.\n\nOn the plus side, the slices are pretty massive. One slice ($3-$5) will probably be all you want to eat.", "author": "Nath A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-05", "description": "Is this the best pizza on the face of the earth? Of course not. In fact, it barely falls into the gray are of the old adage \"sex is a lot like pizza...\" because honestly, even their best slices can be pretty lackluster. And at a price point of $4 per slice, it's hard to justify eating here any other time than when you're completely shitfaced and need something to soak up the belly full of Fernet you're stumbling around with. But with that being said, *an* option for late night eats is better than no option at all... so Mythic does a pretty great job of filling a void in the marketplace.\n\nThey have all of the standard variations you'd expect, but what I really dig about these cats is that they have a by-the-slice option for us wacky vegan types! The slice is loaded with all sorts of veggies: mushrooms, onions, tomatoes, peppers, olives, etc... all devoid of any cheese whatsoever. And because there aren't very many plant-based eaters coming in for drunk munchies, their slices are made to order and haven't been sitting under a heat lamp for hours on end and simply reheated in the pizza oven. It's about as perfect a situation you can ask for, frankly.\n\nIt bears repeating that you really need to lower your expectations if you choose to eat here, after hours or otherwise. In fact, I'd go as far as to suggest you should probably only settle on Mythic if Love 'n Haight is closed next door. You've been warned!", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "Pizza that hits the spot when your buzzed or drunk.  It's conveniently located next to the bars.  They get you the pizza as quickly to you as possible.  I waited like 2, maybe 3 minutes.  They charge you only like 31 cents for credit card.  I like this place.", "author": "Shinobi K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-01", "description": "Delivered to us at 2am on a Thursday night! \n\nPizza was ok, not too greasy but the toppings were laid under the cheese, making the cheese slide off the pizza very easily.", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-01", "description": "I was a little drunk when I went here, so the pizza was delicious. I'm sure that if I came here sober... Meh. But I like the fact they were open late! Great post-drinking spot to grab a bite!", "author": "John H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-23", "description": "Pluses? They're open until 3am, and they do really quick slices. Cons? The slices aren't that good, and the clientele can be unsavory. They also don't have any red pepper flake shakers. The cheese slice is only $2.50, so it's reminiscent of NY, but that's about where the relations end. The dough is really thick and chewy, and the cheese is light. The tomato sauce is almost non-existent, and when you try the Brooklyn fold on it, the crust just breaks. So sad.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-23", "description": "Gross.\n\nThis was my first slice of pizza in san francisco after moving across the country from Brooklyn, and I guess I should have known better. \n\nIn hindsight, I most likely stopped in out of some misplaced 'slice nostalgia', which was promptly greeted with a reheated piece of cardboard with a few strands of godawful cheese on top. I had to leave a note to 'drunk jake' telling him to make sure to avoid this place late at night, too.\n\nThere's some great neapolitan brick oven pizza in SF, and some awesome chicago style pizza in SF, but I have yet to find a good new york slice... and now I'm kind of scared to even try.", "author": "Jake D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-02", "description": "I give one star for service and three stars for quality of the food.  \n\nI ordered a half and half pizza through seamless.com.  I usually use eat24 but for some reason the restaurant only delivers to my house through seamless.  There was some confusion about my order because of a glitch in the seamless.com phone app.  I used the 1/2 symbol to mean \"half\" and it showed up as \"12\" on the order.  What I got was a pizza with ham, pineapple, sausage, and mushrooms, instead of half Hawaiian and half sausage and mushroom.  \n\nI called the pizza place to complain and request a new pizza because I did not want all of the ingredients over all of the pizza.  The person I spoke with yelled at me and refused to help.  The pizza was weird, but very good quality.  I would like to order from here again but I think they would spit in my pizza.  Anyone that is aggressive enough to yell at me would be capable of spitting on my pizza.   \n\nI called seamless.com and they sided with the pizza place and not me.  They didn't believe me.  I eventually spoke to a manager and got the cost of the pizza credited to my account.  \n\nSo, if you order pizza from here, don't use seamless.com and don't ask for anything remotely complicated.  Neither seamless.com nor Mythic Pizza is capable of an order as complicated as a half and half pizza.", "author": "Katherine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-15", "description": "Mythic pizza...  if I come to you in the later afternoon evening, I get a perfectly done, well balanced slice of pizza.   But in the evening, when I really need a perfect slide, why do I always end up with a soggy, overloaded slice of pizza with undercooked ingredients and soggy cheese.   Half the time, I feed those sloppy wet slices to my dog and feel totally ripped off because this could have been totally avoided if they put in few toppings and let it cook more.\n\nFor the day trippers, I'd say go for the Haight or Veggie slice.    After 8pm, stick to the safe options like pepperoni or plain cheese.", "author": "Yas E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-14", "description": "Yeah Mythic! My friends and I always come here late at night. The slices are huge! No sharing allowed. I recommend you try:\n\nMythic - pepperoni, salami, mushroom, onion, bell pepper, sausage.\n\nThe Haight Pizza - pesto, spinach, mushroom, tomato, garlic, fresh parmesan. \n\nOr make your own! \n\nEvery time I come here, there is never a line and not too long of a wait. It's right next to Toronado, an awesome dive bar offering an absurd number of beers. The pizza place is just the right size with a couple of tables and ideal for takeout or delivery. Apart from the pizzas, they have other options such as calzones, salads, and deep dish pizzas. \n\nMy boyfriend and I have delivered pizza from here using the Eat24 app at 2am on a Saturday and it arrived quickly and was melting hot. The small is a good size and comes out to be $15 online. You can never go wrong with the pizza here, it's cheap, fast, meaty, and delicious, check it out!", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-03", "description": "By far the best pizza by the slice restaurant I have ever gone to. I usually get specialty pizzas there, and as a result I don't get reheated pizzas they make me a fresh slice right there and the cheese and topping are intermixed in such a way that the toppings don't slide off the pizza.\n\nCaveat: if you are sharing a pie with someone who doesn't like a particular topping it will be almost impossible to remove that topping as a result of their method of topping the pizza.", "author": "Peter G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-21", "description": "Something about those late night munchies that has me browsing through my Yelp app to find my post bar meal. I'm one of those people that believe pizza can never truly be bad. Pizza is pizza and i was ecstatic that this so called \"Mythic Pizza\" place was open at 2am. Parking was pretty easy and i saw a bunch of people crowded around Mythic and the bar next door. \n\nI had a slice of the Haight with it's appetizing pesto, spinach, mushroom, garlic, tomato and parmesan. It's a great combo to put together and i would have rated it higher if it were cooked hot enough. A small portion of my pizza tasted a little colder than it should be and i like my cheese to be oozing hot. It wasn't the most amazing pizza but they packed on the toppings and i still left satisfied.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-04", "description": "If you're like me, and you're out at night, and maybe you've had some alcohol, Mythic Pizza always sounds like a good idea. And it almost always is.", "author": "Ben H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-10", "description": "This is the only yelp review I will ever write. This is the worst pizza I have ever had in my entire life. Thank you.", "author": "Jake G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-09", "description": "They pile on a mountain of toppings on their specialty pizzas and when I say mountain I mean mountain. I like the Haight which is chock full of vegetables. \n\nIt's probably not the best pizza in town...well it's not the best pizza in town but it's pretty good. And it's an unusual pizza experience if nothing else.", "author": "Brittany N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-21", "description": "The pizza & wings are really more around 3 stars in terms of quality, but for the price (if you use one of their combo deals) it's pretty damn good for what you get. Sometimes I don't want to break the bank for some decent pizza and wings, and this place does the trick.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-05", "description": "take out was fast,  efficient, and delicious. Garlic bread was a good size too. Good price for the amount of food! Would order from here again.", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-15", "description": "I honestly only eat here after a night of drinking in the lower haight. Don't bother ordering from here. Pay extra to get pizza somewhere else. Perfect place to fill you up when you're drunk and craving pizza (mainly because there are no other pizza joints in the area), but definitely not a place I'd go to order a pie sober. The extra star is for being open late night, when it's too late to get food anywhere else.", "author": "Cody M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-01", "description": "The pizzas looked really good in the pictures, as well as when they delivered it, but it wasn't AMAZING. Ordered two custom halves and halves. In terms of the Hawaiian, the pineapple looked pale, and the sauce was a bit too sweet. The cheese could use a bit more taste too. Other than that, it's pizza, we'll eat it anyway, hahah.", "author": "Bahar A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-09", "description": "If 0 (zero) stars were an option on yelp that's what this dump would get...  This place sucks, the pizza sucks.  \n\nPoor, rude and surly service, pizza is extremely doughy, and undercooked.  Not tasty at all.\n\nTerrible.", "author": "Matt C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-27", "description": "You gotta get the haight. Need to come back sober to double check though.\nPerfect for the munchies!!", "author": "Sebastian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "Frikkin awesome ! Was there during a weekday afternoon got a couple of plain slices and want to say mythic pizza is awesome ! I was really hungry of course !", "author": "Abraham L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-27", "description": "I find it interesting that the only people who give this cesspit 3 or more stars are alcoholics who had to make a late night stop one night for something to absorb all the booze.\n\nTry visiting this place sober. Removing that drunken haze reveals a fairly dirty eating area, rude service, and a constant stream of drunks screaming into their cell phones, tossing one another into the walls, arguing with the cashier, groping their date's ass, and stuffing their limp mouths with really sub-par pizza.\n\n\"It'll fill your belly.\"    This weird compromise comes up an awful lot in other reviews. Lots of things will fill your belly. Many of them you don't necessarily want in your gutty works. Concrete, for example. Or big handfuls of fertilizer. Or toenail clippings. The pizza here is marginally better than those random items... but there are plenty of other, better places to get pizza that are not all that far from Mythic and you'd do well to walk the extra blocks to get there.\n\nOn the other hand, if you don't live in the Lower Haight and only come down to that neighborhood, dressed like an asshole, to people-watch from inside the Noc Noc and then require something solid before your liver blows straight out of your torso, eat here because they seem to cater to your type. Jackass.", "author": "J. S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-09", "description": "This place does not have a dipping sauce. I ordered a slice of Haight pizza which was pretty good. They made the slice pretty fast.", "author": "Harshal J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-08", "description": "Location, Location, Location. This place is only worth mentioning because of its location. Their lease is worth it because it's definitely located for your convenience when the drunk munchies hit after you've been drinking in the Lower Haight. The majority of their business must come during these times. I couldn't imagine people stopping here for a slice in the middle of the day.\n\nI ordered a slice with pesto and ricotta. I was disappointed since it wasn't a true pesto slice. They simply drizzled pesto on top of a pre-made cheese slice, so there was tomato sauce and pesto. Adding ricotta as a topping definitely made it a little better. \n\nIn conclusion, I'm no better or worse for ordering from here. It was very mediocre and forgettable. I wouldn't order from here if other places were open, but I can't say I wouldn't get a slice from here again if it was the only spot open late at night.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-04", "description": "Maybe it's because I had a few beers in my system & I hadn't had any solid food all day prior to having a slice of pepperoni & a half a slice of cheese from Mythic, but I thought there pizza was pretty damn tasty. \n\nI've been by this place a zillion times, but never think to stop in. Well, I was over at Danny Coyle's watching a football game, and since this place is down the street I stopped in at halftime. They sell several different varieties of pizzas by the slice, and most slices are between 3 & 4 bucks. The place was pretty empty when I was there and the guy behind the counter helping me was very nice. He had no problem packing up three individual slices in boxes for me and didn't even mind slicing the one into two smaller slices (I'm assuming the a-hole workers others have mentioned in reviews are those who work the late-night drunken scene). \n\nAs far as the pizza itself, I honestly didn't think it was all that bad. I actually thought the crust was quite good (chewy, not too thin, but not too thick, and fresh). Sure, the cheese was greasy but given the circumstances I really didn't care. \n\nI probably wouldn't seek this place out, but if I was in the area, wanted pizza, and I'll be honest...had some in alcohol in me, I wouldn't hesitate to stop in for a slice of pizza.", "author": "George A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-04", "description": "Okay... This place serves up some super-filling, fairly fresh veggie pizza.  I just had the Haight pizza and the tomatoes were fresh and flavorful.  I was impressed. \n\nThis is not high-end pizza, but very satisfying... especially late at night.  They seem to have the base of the pizza precooked - and then throw on the toppings and another layer of cheese.... their pizzas never taste like they've been in the heat lamp for hours.  You can actually pay with CC if your order is over 8 bucks (two big slices).  I would probably be a lot skinner if that was one slice.  \n\nOne bit of feedback, their customer area always looks a little grubby and disheveled... much like my neighborhood of the Lower Haight.  They are next to two bars, so I can understand how it's hard to keep it tidy.  Also... the ben behind the counter always have the most painfully depressed expressions on their face.  I mean.. maybe they're just being real... folding pizza boxes is rarely a life calling.  But it does make me feel like I'm troubling them when I order or continuing their misery by giving money  the establishment.", "author": "Eric N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "I wanted to eat for myself and wasn't disappointed.\nThe guy made the pizza from scratch and that was very fast (10 minutes max.). Although I took the smaller size, it's honestly enough for 2.\nThe San Francisco pizza is awesome (and you can have it for two people).", "author": "Lucas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-27", "description": "Except for the annoying person hitting on my daughter I give his chicken sandwich a five star. The person who took my order was super nice. Open late.", "author": "Gina O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-31", "description": "*in mysterious voice* \n\nI don't always eat pizza.....but when i do....\n\n\n\nits definitely not fukin here. stupid drunkards and their deceived perception throwin off yelpers, hmph!\n\n\n\nEdit for clarification: the pizza was so bad I had it wasted once and it was just *ok* \n\nGave the rest to roommate's dog \n\nOf course he loved it =) til the next morning =(", "author": "Belito L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-14", "description": "I live around the corner and go here all the time. The veggie pizza is great and I'm not even vegetarian haha. The pizzas made fresh even the slices, so it's not sitting in front of a window all day.", "author": "Kalani M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-05", "description": "This pizza was delicious. I am shocked by the average ratings on yelp as this was perhaps my favorite slice of pizza in SF. Or ever. As a native New Yorker, and as I have taken my partner, Brienne (of Tarth), to this establishment, I cannot give a higher recommendation to this pizza joint. \n\nBest wishes, \nhungry panda \n\nPs. Try the Greco or the cheese with olives. Add pepper to taste.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-04", "description": "Cheap but no flavor and the dough is undercooked. Sucks... was hoping it'd be better. Throwing away my pizza as I write this review.", "author": "Anna B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-19", "description": "I freaking hate this place.  I went there Saturday night after Madrone.  The owner was a total prick.  I order two Mythic pizza slices and 25 minutes later, after everyone else behind me in line got there slices of pizza I got one slice only (and that's only because a buddy said something) and then I lost it and the mofo, I wanted my money back and the a*&^hole actually had the nerve to say \"oh your pizza will be out in a few minutes, don't you want to wait\".  I told the a$#hole to give my money.  I'm out.  \n\nImo, excluding the circumstance above, the pizza is shitty and this is coming from someone that loves pizza and tries to give places a chance to shine.  Mr Pizzaman is better than this place and that's lower than Little Caesars, lol...  If you want a good pizza, go to Pizza Orgasmic in the marina (there open till 2:30 or whenever they run out of pizza) or Pizza My Heart.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-10", "description": "I usually order delivery from Mythic, in the middle of the night, when I feel like I deserve it (because oh man, it's not low calorie). Specifically, the \"Mythic Deep Dish\" -- don't forget to ask for extra sauce on it. Thick, huge slices of melty, cheesy, meaty goodness. Fork required. \n\nI've never been to the restaurant, but their delivery is fast and friendly.  Typically I order using the GrubHub iPhone app. And I get delivery all the time at 2:00 am and later.", "author": "Philip K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-29", "description": "Straight up for the Price which is Low, this place Rocks!\n\nHuge Chicken Parm Hoagie for $5.50 and a Slice of the Athens Pizza was a good first impression for me. Toppings are Piled On, wow!\n\nYes I have had Better, but for a decent Slice I can Vouch for this place.\n\n*** For my own future reference, I will just stick to the Pizza here***", "author": "Michael D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-22", "description": "The service was terrible. They dropped my order and gave my slice (same order) to the person behind me in line. I left because I was in a rush and couldn't wait for them to make another slice.  I'm not terribly sorry, the pizza crust looked like cardboard and the amount of cheese they piled on means that one bite is going to be an instant burned mouth roof. $4.00 for nothing, not a bad deal.", "author": "Isaac Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-29", "description": "$4.75 for a slice of pizza is pretty steep, but it's totally worth it.  The pizza slices are HUGE and freshly baked - each slice is baked individually right there in front of you.  I got the Haight (spinach, pesto, tomatoes, garlic, mushrooms) - it was the best pesto-ey, gooey cheesy goodness I've ever tasted.  My friend got the pesto chicken pizza.  I'm definitely coming back.  It really hits the spot after a night out (it's open very late).\n\nIt's in a slightly shady area (next to biker bars) and there's very little street parking outside or sitting space inside, so plan ahead - you might just want to have someone grab your pizza and eat elsewhere.", "author": "Bee M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-26", "description": "Perfectly located for all your late night drunk munchie needs. I usually stick with the cheese pizza. The meat lovers is good as well. Their pizza is on the bready side, with a chewy crust. They don't go light on the cheese and everything is always served piping hot with friendly service.\n\nThe best part about this place is the people watching. I once bought a homeless woman a slice of pizza here to assuage my liberal San Francisco guilt. She poked the pizza several times to inspect it and walked away, presumably satisfied. \n\nThere was also the time some drunk white guy got into a fight with the owner. My friends and I told his girlfriend to break up with him. I hope she did.", "author": "Joann T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-06", "description": "Come on, who doesn't love greasy pizza after a night of drinking? \n\nMust be something seriously wrong with either you or the pizza if you don't. Since I can't find anything wrong with me, or the pizza....guess I'll have to give it 3 stars.", "author": "Barbara D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-22", "description": "I suggest you come here first, as a preemptive strick against the perils that await you in the nightlife of the lower Haight. $4 bucks will buy you a slice with enough feta, pesto, and olives on it to combat even the most deadliest of toxins and late nights.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-17", "description": "Well I was hungry\nand they gave me pizza in exchange for my money\nso that was AWESOME.\n\nI came here with my sister's boyfriend as they saved our table at Molotov's across the street.  We were both buzzed (and also Santas) when he revealed that he would be proposing to my sister over Christmas.\n\nWell, seeing as how he is awesome and my sister is awesome, I was ecstatic.  He reminded me it was a surprise -- but I told some civilian who was standing in line as I bounced around quite jolly.  She congratulated us and also seemed genuinely excited. \n\nAfter enjoying our tasty pizza and leaving the bar, some drug dealer kept inviting us to his RV.  We instead climbed a tree (still in our costumes.) When I hear a girl's voice \"ohh! that's the guy that said he was going to propose to that girl's sister over Christmas!\" which would have been ok, except my sister was standing there taking video of us climbing trees and probably hoping we'd fall out so she could post it on youtube.  Luckily, she's oblivious and didn't hear that...\n\nso if you don't know yet, I now have a future brother in law, and my sister was very very much surprised by the proposal.  So hooray all around!", "author": "Van W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-15", "description": "My friend and I were craving pizza after a night out and we stumbled upon this place. Maybe we have high expectations living a short walk from Escape from NY Pizza on Haight, but this place sucked. We waited 20 minutes for only 2 slices of pizza that really weren't very good. Kinda disappointing, but hey, serves the purpose of a late night snack.", "author": "Briana B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-29", "description": "After a crazy sweaty night at Vertigo, we stopped to grab a bite at Mythic. \n\nThinking I was the smarter of the bunch, I went next door to Love N Haight and ordered a huge sandwich drooling with sprouts.\n\nBut as soon as I caught a whiff of the freshly made slices from Mythic, I knew I'd made a mistake. My bf relucantly let me have a bite of his, and I have to say for late night food options, Mythic is by far, one of the best in the area. I could actually taste the toppings, the crust was doughy (the way I like it) and cheesy slice was piping steam.\n\nI'm planning on birthing an additional star to this review - once I get a  big slice just to myself.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-27", "description": "The city does not need more pizza joints where already made slices have been sitting in a warmer for hours. What the city does need more of are made to order slices like the ones from Mythic. Consider it your chance to build your dream slice. For me it was no cheese but plenty of veggies. My creation was healthy, gigantic and at $3.50, a very good deal.\n\nAccept slice mediocrity as you wish. I'll be at Mythic.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-20", "description": "Popped in here for a quick slice at around 11pm. The dude behind the counter scared the hell out of me. I said, \"two pepperonis.\" He stared back blankly, so I wasn't sure if he heard me. I said again, \"two pepperonis.\" He muttered, \"I heard you! Cash or card?!\" I said, \"CARD!\" \n\nPizza was ready in like 10-15 minutes. Nothing to right home about really, but it filled the belly.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "I don't care what you fools think about Mythic. They don't understand what it's like to have a Tijuana pizza when you really need it. Day or night or super late 'last call' night, Mythic is there for me.\n\nThe guys working there are always really nice to me. They take care of business and serve you a hot, freshly baked pizza within minutes. \n\nThink about it. You're drunk. It's 2am. A beautiful, florescent light and the wafts of fresh pizza is beaming you in from down Haight Street. You walk in and BAM 5 minutes later you're shoving a pizza with everything but the kitchen sink down your throat. It's warm. Savory. Full-filling your drunken needs. You ORDER A SECOND and they don't even judge you. Yeah, it's like that.\n\nIt's like having a cheap and dirty mistress that always answers her phone late at night, no matter what.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "yep, best drunk pizza. combo slice was delicious. great they are open late, went here after Ruby Skye", "author": "Ellie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-20", "description": "The cheese they use is really really gooey, plus the pizza crust is super thin so it seems like these folks are giving you more pizza than crust. My friends and I came by here on a weekday, so I don't know what the rest of these negative yelpers are talking about with drunken folks coming by. Seating is limited, pizza is delicious, and anyone else that posted pictures... That's EXACTLY what the slices look like.\n\nI'd definitely come by for another slice next time i'm in the area.", "author": "Jay A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "I came here and the pizza was pretty good. Haven't been to many small pizzeria, but it was amazing. I enjoyed. I was drunk but it was great", "author": "Trey L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-05", "description": "I have got to hand it to Mythic Pizza for having such a good business plan! They are so smart for posting up next to Toronado (a bar). Drunk people love eating pizza! We come here all the time after enjoying a few beers next door. \n\nI like the Athens pizza. It has pesto, artichoke hearts and garlic. The chunks of artichoke hearts are HUGE.  \n\nI'm pretty sure the pizza tastes extra good because I'm intoxicated, but there's nothing better than a greasy slice of pizza to sober you up.", "author": "Patricia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-20", "description": "Pretty good pizza. I remember it being better at 2 a.m. The pesto slice is pretty damn good. Very bready/cheesey pizza. If you're into that sort of thing, then it's good. If not... try somewhere else.\nPretty reasonable prices, too. $15 for a large cheese that's 10 slices...Share with friends for good, cheap drunk munchies.", "author": "christine c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-16", "description": "We were in town a couple of months ago for a concert, and this place was one of the only places open afterwards. We decided to try it & were pleasantly surprised - the pizza was great! The only downside was the tight quarters & some strange company while waiting for our pizza to get done - but I'm sure that's not out of the ordinary for San Francisco!", "author": "Britnie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-19", "description": "Fresh cheese slice covered in garlic and hot sauce. Good crust. Solid late night snack.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-13", "description": "Stream of consciousness review of \"Mythic\" :\n\nIt was late (11 PM), had no dinner (working in a coal mine without stopping), was on Haight St ( is this where the Haighters live ?), needed food (not a lot of options at this hour) , saw Mythic ( I like myth's, never have had a Mythic pizza),  every table filled (ok, well,  there are a grand total of four), the miracle happens (yes Virginia, miracles can happen at pizza joints @ 11PM) - two Haightsters busy texting decided they had completed their mission (probably posting that they just had pizza) and left (hallelujah), friend grabs table (like making a \"b\" line for the cab in Manhattan) , order the \"meat lovers\" pie (wished it had more MEAT, cheese was good & gooey), pie landed on the counter fresh out of the oven with an announcement \"Meat Lovers READY\"  (this would have another meaning in another neighborhood), watch the Haighsters roam in and out with their coveted slice (must be the \"go to\" source for late night bites), watch one Haightster (more like a fatster) down a giant calzone (this was a wow moment.... \"but to each their own\"), survey the decor (another wow moment ... a giant gold colored track light with giant light cans, cheap posters on the walls, large windows to watch the Haight world meander or stumble by).\n\nWould return for another Mythic experience, if I were in the same set of circumstances (see above).", "author": "Matsuo U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-12", "description": "I recently moved to Lower Haight and this was my first experience with Mythic Pizza. I ordered online through OrderAhead.com. The pizza was ready for pick-up in 20 minutes as promised. Unfortunately we didn't open the boxes there (lesson learned) and didn't realize they'd got the order wrong until we were home. When I called them to explain, the lovely owner apologized, told me that they are having trouble reading the online orders, and told me they make us a new pizza and rush it over to our door. Within 15 minutes we had a new, piping hot pizza made exactly how we wanted it. Even after all that, I'd say it was worth the wait. Very tasty pizza, loaded with quality toppings and crazy amounts of cheese. And because they don't do huge crusts, you get a lot of pizza. With that and the original mis-order, we'll be eating Mythic Pizza for days. I'm not complaining.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-26", "description": "Truth be told, I've never been here sober. Luckily, Mythic Pizza is not the pizza joint for those San Francisco foodies looking for authentic Italian cuisine.  Nope.  It's the kind of place that hordes of drunken people, with only a few bucks left in their pockets, flock to after drinking heavily in the lower Haight.  \n\nThe service isn't stellar here.  Don't expect smiles and witty banter from the staff (if you had to deal with drunkards trying to order pizza every night you'd be a bit surly too), but they will get you your pizza as quickly as they can.\n\nThe pizza-by-the-slice selection here is pretty good.  I'm a fan of the Athens (pesto, artichoke hearts, & garlic), but they are all tasty.  The pizza crust is somewhere between regular and deep dish, so they'll be a lot of bread to help soak up that excess beer in your stomach.\n\nBONUS TIP: You can take your pizza into Toronado next door.", "author": "Lara O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-12", "description": "Good old American pizza style - not deep like Chicago, not thin like NY, but just \"normal\" or even a little bit bigger like the types of pizza that's served at pizza food chains like Domino's...but obviously way better. I feel like it's hard to find that style of pizza but that tastes good; all the good pizza makers are focusing on making NY style or deep dish pizza! The ingredients are really fresh and high quality and it makes a world of difference. Yes, i was drinking beforehand, but still..", "author": "Sonya Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-20", "description": "Understand that you don't go here for good pizza.  You go here for late night sustenance.   A few slices, throw in some cokes and waters, We're good for hours.\n\nEverybody there is drunk.  At the least.", "author": "Meg W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-08", "description": "Two stars for being open after the bars let out, and being relatively cheap. Minus 3 stars for the damage this will do to your stomach. I come here once and a while when I've run out of other options for food, always thinking that it's alright pizza. Always wrong. \n\nIf you're wasted and looking for some cheap fast pizza with some shit on it that'll keep you in the bathroom for hours, then come on down to Lower Haights finest.", "author": "Joe M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-01", "description": "Ok this is the neighborhood pizza place... and it's terrible. I always always end up making the mistake of coming here when I am really drunk and it's really late. Not to say I should be known for making great decisions in such a state, but damn. Crust is like cardboard, covered in cheese and it is almost sour to me. Sadly it's one of the few pizza places in the area open late. So it's got that going for it", "author": "Greg G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-24", "description": "Ive stopped by here several times for a late night slice. Ive had mixed results, but i keep coming back.", "author": "Lando H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-29", "description": "Step 1)\nGo to Toronado and order several amazing beers\n\nStep 2)\nSumble next door to Mythic Pizza and have one slice. That probably won't be enough, so get a second.\n\nStep 3)\nGo back two steps.", "author": "David K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "Best freakn' calzone I've tasted in a long time. My mouth waters as I think of that super delicious San Francisco calzone I engulfed with pure glee. This was during a second visit. I remember coming here for the first time getting some sort of Veggie Pizza slice with garlic (my fave!) and that was to die for. I'm most definitely coming back here for my addictive fix of pizza, regardless of how many pizza places I pass by.", "author": "Maleia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-01", "description": "I've gotten slices from here a few times. It's a little inconsistent: sometimes it's great, but a few times the pizza has been over or undercooked. But all in all it's good stuff and they are open late.", "author": "Tbone M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-08", "description": "Went here instead because Rosamunde was closed for re-stocking :'( :'(\n\nWe got the Mythic (~*original*~ I know. See photo). It was decent... but I wanted my beer sausage *pouts*", "author": "S. D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-10", "description": "This place is suitable for a quick cheap filling satisfaction + heart attack.\n\nTheir pizza's okay, nothing special. But for damn sure all i can really remember is it's HELLA greasy. i had to pat it to get most of the grease off with a napkin. \n\nBut i do bet it taste real good when im drunk. =)", "author": "Tam T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-22", "description": "Garbage. \n\nTheyre open late and located beside some bars, but thats still not a good enough excuse to go here, when Love n Haight deli is literally right next door, and open just as late. For almost the same price you can get a big-ass sandwich with all the fillings at Love n Haight.\n\nSuck it.", "author": "Brendan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-15", "description": "Im not sure why people love this place? I LOVE me some pizza from any and everywhere (usually)! But this place didnt do anything for me. They are generous with their toppings but its so generous that it slides off the pizza which means its so heavy that the dough cant support it. I've been there 3 times when I first lived in lower haight because my roommates raved about it... but honestly... everytime I was there... I became pissed off that I spent my money and had to throw the pizza out! YUP... and I dont condone throwing any food away... so that should give you a picture of how I feel. \n\nMaybe its because people are crazy drunk when they eat it that makes it a favorite of lower haight-ers... not sure. Sorry Mythic... I gave you guys a chance.", "author": "roderick h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "This is a great late night drunk spot, but I've also eaten here for dinner many times.  They have tons of great options and their sandwiches and non pizza options are also pretty good.  I discovered their wings which are AMAZING and now i have to get them every time.  They do take longer than a slice though.", "author": "Julie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-09", "description": "I love this place! Every time I go to San Fran I gotta have it. The pricing is pretty good for a nice big piece of pizza that will def fill you up. Try the \"San Francisco\", so yummy!!!! :) Workers have always been nice and fast.", "author": "Myrinda A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-29", "description": "My bf has been raving about their pesto pizza for 1 month so to finally shut him up, I decided to see how good their pesto pizza really is.\n\nWe drove down to the Lower Haight in the late afternoon (1:30 PMish) and once we entered the typical, quaint pizza joint, the bf ordered 2 pesto slices ($3/slice) without a second glace at the menu. When we arrived, there was nobody else there and the wait was about 5 min. for our piping hot slice of pesto pizza.\n\nThe slice was average sized and thin (not as thin as Pizzetta 211 though) and the dough was light and just toasted/crispy enough for me to keep on eating it. The pesto was artistically drizzled on top of the cheese and the slice itself was so good, I couldn't stop eating it. I found the pesto pizza different from Nizario's in that I think the pesto is baked in the oven whereas at Mythic, they drizzle the pesto on the pizza, after it has been cooked. I prefer the latter. I just wish that they poured on the pesto...rather than lightly drizzling it!", "author": "Janel Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-22", "description": "I love this place. The pizza is tasty, quick and very reasonably priced...and it's right next to Toronado. I have The Haight more than any other slice, just a great all round place. The guy behind the counter is always friendly & he'll answer any question happily.", "author": "Robert B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-19", "description": "Once I lowered my standards and accepted that fact that pizza in San Francisco generally sucks, I was able to start to enjoy places like Mythc Pizza. \n\nIt isn't really that good, but its not horrible. \n\nI'm giving it 3 stars thinking from the mind of a drunk and stoned person late at night.\n\nIf i was sober and it was the middle of the day, it would probably be two stars.", "author": "Meowy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "living in wa. now, it's been a long time since i've been here.meaning it's been a long time since i've been home! stopping here for a slice of the athens or two after deathguild onmondays and often b4 fishing nocnoc for a onenightr/week stand was a ritual of habit in the 90's both when and after i lived on the lowerhaight!1 you might as well, after clubs,drinks& drugs what else this good can you afford?  /alexavier", "author": "Alexavier S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-08", "description": "Do you want the shIts ????\n\nDo you want to spend another $7 on a bottle of Pepto Bismol ????\n\nDo you want dribbling tomato juice (ketchup) dripping on your shirt while you eat ????\n\nIf you answered 'YES' to any of the above questions, then you should definitely eat here. Otherwise I would pass. This place is SO WEAK. Only drunk people stumbling out of Molotov's go here. Trust me. Tons of way better places.\n\nIf you're starving, go to Rosamunde next door. That place is the BOMB!", "author": "Rouz E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-12", "description": "Here's the deal with SF pizza.  With such great places such as escape, zero zero, etc, people act like any pizza less than gourmet is a sin.  I, respectfully disagree.  I think there is definitely a time and a place for middle of the road, fast, hot pizza slice.  And that is exactly what mythic is.  It's there when you need it, no surprises, exactly what you expect.  It's medium quality cheese, over medium quality sauce, on medium quality dough.  It's cheap, fast, and after a long night, can be an absolute godsend.  I can't count how many times I've been driving or biking home from a show or work and decided to stop in for a big hot slice or two.   If I had to make a complaint..it's this.  Sometime they have these bottles or red sauce.  Now most of the time, it's buffalo sauce, and it's absolutely glorious.  HOWEVER, sometimes they must run out or something, and they replace it with tapatillo.  Now tapatillo is good, but the combo of buffalo sauce on a slice of cheese, is something that should never be fucked with.  So I always have to do a smell test so I don't accidentally dump a bunch of the wrong sauce on my slice.  Good times.", "author": "Nick T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-09", "description": "i like to stop here for a slice if im feeling lazy about making dinner and cheap about buying an actual meal. \n\ntheir slices are HUGJE! i usually go for the Tijuana or Haight sans meat. They make each slice to-order so dont be afraid to be picky. \n\nif you like yr pizza well done, make sure to request it that way. \nIts not as bad as Rouz E makes it out to be, but for $5, itll fill yr belly whether yr drunk, lazy or are ok with experiencing ok pizza.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-21", "description": "Mythic Pizza,\nYou are so hit or miss in your food quality.Yesterday the sauce was oddly sweet, and the cheese was far too sparse.  If it weren't for your low prices, internet ordering options and delivery to my neighborhood ( in a timely manner I must add) I probably wouldn't order your pizza and meatball subs any longer. your calzones are delicious but hard to order for two when one person is a picky eater (not me of course.)\nI will still enlist your pizza services, I just wish you could be more consistent in your food quality.", "author": "Kelle K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-08", "description": "HOLD THE PHONE!\n\nStill drunk food.\nStill line out the door after last call.\nStill mostly made for the purposes of absorbing alcohol.\nBut...\n\n... in yet another bumbling, laughter-filled, sloppy end of a drunk evening, i got desperate and went back (even though i know i do NOT like this pizza) and I discovered that they have a vegan pizza. We ordered a whole pie, with very low (drunk) expectations. You know what? It was actually pretty damn good! \n\nThe quality was proven the following day, when sober. It's spinach, artichoke hearts, minced garlic, and sauce. Does this mean their cheap cheese is what makes the regular pizza so horrible? Despite my previous disdain, I'm going to get it again. But only when I'm drunk.", "author": "Stumbalina b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-25", "description": "Pizza isn't bad, but I'm constantly let down by their poor delivery. Just had a massive problem with them. They \"said\" they called my phone when they were outside, but I didn't receive any calls from them. I have now been waiting for my pizza for almost 2 hours.\n\nTo top it off, I tried calling them for about 40 minutes, NO ANSWERS AT ALL! WHAT THE FUCK MYTHIC?!", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-16", "description": "Don't go there expecting actual pizza deliciousness. Got burned a second time while ordering a simple pepperoni. Their toppings seem to slide off before I could even eat it, letting me know the ingredients (sauce, cheese?) Are of extremely low quality.", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-28", "description": "Thank you, Arab and Mexican group of men. The pizza is delicious and you are very very graceful at handling drunk customers. Thank you for the amazing slice of Hawaiian with Jalapeno :)", "author": "Maryam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-19", "description": "With all due respect to \"Joshua WW.\", get a life.\n\nIf you want snob pizza, take your designer clothes, pay a bundle and hit North Beach.  We don't need you in Lower Haight.  This is good pizza, offered by the slice.  It's hand-thrown dough, not too thick and not too thin, cooked correctly, AND REALLY, REALLY CHEAP!!\n\nYou can get a really tasty huge slice of cheese pizza here for 2.50.  Get off your snob wagon and get with the good eats.", "author": "Gary N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-19", "description": "The pizza is pretty good.  I had a slice with feta cheese, olives, pepperoni, and sausage.  The ingredients were incredibly fresh and the slice wasn't soaked in oil.  Maybe the quality of their pizza varies throughout the day, but I'll take it any day over the generic pizza chains.  \n\nThe ambiance of the place left a lot of be desired but it's a fun place to people watch.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-13", "description": "Everything taste delicious when you're drunk. Convenient spot to buy pizza, random bars down the street. Nothing special just good pizza and service.", "author": "Shakei D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-21", "description": "This has been the only bad experience my wife and I had in San Francisco. My wife went in by herself to order a slice of pizza and had only a debit card. An older man helped her with her transaction and was nothing but rude to her. He was short with her when she asked questions, made no eye contact and was was overall not thankful for the business. At the time of payment, and as is sometimes usual, there was a fee for using a debit card, however there was a mandatory \"Customary Tip\" of at least $1.00, PLUS when you use a debit card they do NOT provide a receipt. She specifically asked for one and he refused to provide one to her. On top of it all, the quality of food was not worth the bad service provided by this company.", "author": "Anthony R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-23", "description": "It brought me back to the college days of Fat Slice and Blondies in Berkeley..\n\nHot pizza with stringy melted cheese and a crisped thin crust... pesto pizza at 3am after the club... that is all  :)", "author": "Marilyn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-20", "description": "I can't tell you how many times Mythic Pizza has saved us from going hungry during 4th meal.  Let's just say it's been many many times.\n\nIt's definitely one of those spots that's not super clean or roomy, and you have a chance to see a drug deal on the street, but I can't imagine grabbing a slice anywhere else.", "author": "Brad J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-15", "description": "Open after bars close? Yes\nRight next door to two badass bars? Yes\nDo I eat it when completely sober? Yes!\nDo they make it when you order it? Yes\nIs every bite pesto, garlicy heaven? Yes\nWould I eat it every day if I lived in Lower Haight? Yes\nWould I do a voluntary commercial for them? maybe", "author": "Brandon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "The pizza we got taste like heaven. Thick cheese, thick fresh chewy bread.  Unfortunately we live in Australia and we could only dream about tasting it again. I wonder how much it would cost to deliver it to perth.  Mmm", "author": "John N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-25", "description": "There is a time and a place for just about anything, even lousy pizza.  The time and place for Mythic Pizza is at the Toronado once your other dining options are closed.\n\nAt the very least, the slices start at $2.50 and come out of the oven piping hot.", "author": "Suo L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-01", "description": "Late night by the slice pizza on Halloween.\n\nAmbiance (3): It's your typical late night pizza operation with few tables and a line to deal with it. Nothing more needed.\n\nFood (2): Typical West Coast pizza=weak. The cheese was lacking salt as usual. We had one with some meats, another one with some other meats, and a third with no meats but with tomatoes, pesto, and I don't recall what else...feta and spinach maybe? The non-meat one was the best, highly recommend it if you must have late night West Coast pizza. I did goof by not ordering a plain pepperoni to really test the quality of the pizza, but I just wanted to eat anything.\n\nService (3): Efficient order taking. Nothing more needed.\n\nValue (3): Slices could be bigger, but it's late night pizza so I'd probably pay almost anything for it.\n\nOverall: This is late night pizza, pure and simple. It's also West Coast pizza, so you have to make allowances for these two factors. However, would I come back here if Golden Boy was next to it and open? Absolutely not! Having said all that, this is the main late night pizza option in my neighborhood so despite the rating, you gotta do what you gotta do.", "author": "Alvaro H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-01", "description": "Wasted Archie says \"Flfiive *hiccup* snars!!\"\n\nSober Archie says \"One star.\"\n\nAverage out to \"3 snars.\"\n\nI mean, stars.\n\nTolerate.", "author": "Archie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-29", "description": "When drinking in the area I hardly ever miss a chance to get pizza here. Sure it's not the best pizza around, but when it's late at night and nothing else around it sure does taste good.\n\nThey've got pretty interesting toppings, and even though they fall into the category of putting pesto on top of regular cheese pizza instead of using the pesto as sauce, at least it's hot and crispy.", "author": "Allyson S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-16", "description": "It's alright. \n\nWhenever my girlfriend and I want something cheap and fast in san francisco, we come here. I went there twice. First time we went there a nice local suggested this place to us so we both got a slice, then decided to get a box for the hotel. The second time, we went there was for a box when we were in the city again. Third time, we were late night crabbing and looking for a place that was open so we decided to drop by. We met the owner this time (I believe)... older male, tall, slim, gray hair, piercing eyes. And by piercing, I mean... I felt like he stared us down like we were trashy kids or something... it was my girlfriend, my friend, brother, and my baby brother. We got the haight medium pizza to go because all of the seats were taken, but since the prior customers left once we got our pizza, my girlfriend decided we should stay instead of scarfing the pizza down in the car. Yeah, it felt like he didn't even want us in there and when we were going to throw the box away, we realized the trash can was full so we didn't want to just stuff the box in... that's when he yelled out \"i'll take that!\", my friend walked the box over to him and he just tossed it to the side. I don't think I could say i'll ever go back. I thought it was just me, but I guess it does send you to the bathroom and the man is rude.\n\nIf you want something fast and cheap and don't mind eliminating it a couple minutes later. Do come. Their food isn't bad, but there is better.", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-09", "description": "This place is pretty darn good. Great for late night dinning, reasonable slice prices, moderately friendly service. Pesto was a little disappointing but not terrible, just not distributed well, and too oily even for pesto.", "author": "Bobby B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-22", "description": "Mythic is excellent junk food. \n\nThere are three kinds of pizza in my life:\n\ndinner pizza (little star, delfina, gialina)\nNY pizza (escape)\njunk food pizza (mythic)\n\nEach one has it's place and time in my life, I can't substitute one for another, and all occupy an unfortunately large part of my diet. \n\nMythic is my end all bad dinner. When I've had a shitty day and am mad at the world I usually put on my sad pants (horrifyingly ratty men's PJs), watch a million episodes of Gossip Girl, and call Mythic for some food therapy. \n\nThis isn't the sort of thing I should probably admit to anyone, but that's what the internet is for.\n\nA mythic cheese pizza with pineapple is like a one night stand, it feels good that night, when you're feeling shitty and need some comforting, but is sure as hell regrettable the next morning.", "author": "Kelly Kate W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-05", "description": "The crust kind of tasted like it was made in the microwave... $2.50 is a fine price for a slice of pie, however, if you want toppings, they suddenly become a premium priced slice at a low-grade taste. Maybe if I were drunk it would've tasted better...\n\nThe pesto looked tasty, however the grease level appeared insanely high that it was wisely avoided...", "author": "Dustin P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-26", "description": "A short quick review for a place I visit only drunk. Just a grungy place to grab a quick bite after drunk induced hunger.\n\nLocation: In the Haight, so if you're into bars in the Haight you'll likely end up here drunk. \n\nSpace: Limited seating, but usually no one eats inside. There is no decoration, but it shouldn't matter, you're drunk,\n\nAmbiance: Homeless and drunk people.\n\nService: Non-existent. The guys are rude, but who cares, you're drunk!\n\nFood/Drink: The pizza is pretty gross. Too much bad cheese and oil. The oil and cheese fall off the greasy crust as you try and bite it. But again, you'll take anything drunk.\n\nOverall: Bad food, bad service, bad atmosphere, bad people, but it's open when I'm drunk and hungry, so it gets an extra star.", "author": "SF N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-14", "description": "I am currently writing this in bed as I have food poisoning.  Last night after a few drinks I decided to get a slice of pizza, knowing full well that it was probably a bad idea.  To be fair, I have been eating more or less vegan for the past 7 days (I'm visiting and trying to get as much non-dairy grub in as I can before returning home to Miami where vegan restaurants are virtually non-existent).  But give me a few drinks and my dietary ambitions are thrown out the window.  \n\nFast forward to arriving at Mythic Pizza, ordering an Athens (artichoke, pesto, garlic) slice and devouring it all within a span of 15 minutes.  Taste-wise, it was ok, definitely nothing that I would expect to violently rape my colon, intestines, and stomach a mere 8 hours later.   \n\nIt took me a while to gather the momentum to push the diarrhea from my anus, but it was only a split-second afterward, that I found myself flushing the contents of the toilet, kneeling (no time to wipe), and purging all that is evil out of my mouth and into that recently defiled bowl.  The pizza chunks flew out so forcefully that droplets bounced back up, landing on my face, beard, and lips.  There was most likely residue from the previous shitstorm that had just been, albeit probably not completely, flushed.  After 8 or so power pukes, I finally felt ok enough to get up, clean myself off, and tell myself, \"it's over.\" \n\nBut it is not over.  I have been in bed all day.  My stomach is still gurgling and I fear another ass and mouth episode happening before the day ends.  \n\nHeed my words and never eat this pizza late at night.  Yes, this review is extremely biased and perhaps unfair.  But I feel I must make this incident known, and hopefully I can prevent a similar experience.", "author": "billy h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-25", "description": "The perfect post-drinking pizza, if you're in the area. It's all about the toppings here. They don't skimp, and you can see and taste each individual layer. For ~$5, one slice is enough if you load up on toppings. I've ordered the Tijuana [replaced sausage with chicken] and the Haight [replaced mushrooms with chicken]. \n\nI guess I like chicken on pizza.\n\nThey have a sign up that says your slice will be ready in 2 minutes. Sometimes it seems that only 2 minutes have passed between ordering and attacking the slice, but other times a little bit longer. \n\nI don't mind. I don't want salmonella anyway.\n\nAnd since I sorta have a speech impediment, \"Mythic\" becomes \"Mystic,\" like the movie!", "author": "Tinna H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-30", "description": "I really wish this place was called Mystic Pizza. Then I could reminisce about watching Julia Roberts back when she wore jeans up to her armpits and Lili Tyler being all horny about doing her fisherman boyfriend in the john at the pizza parlor, all while munching away on a pie.\n\nI ordered a slice of the Athens (I think) which had pesto, feta and olives and about two pint glasses worth of grease.\n\nI'm a little mystified (another reason it should be called Mystic Pizza) about the pesto sauce on top of the pizza rather than under the cheese. It was poor man's pesto pizza, but I still ate it like I was a contestant in a pie eating contest.\n\nIt's not the most amazing pizza I ever had, but I'm pretty sure if I had been hammered while eating this pizza for the first time I would have seen stars or Care Bears or some shit like that.", "author": "Sammy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-29", "description": "How to Get Hit On in the Lower Haight:  Part 1 \n\nStep 1: Go to Mythic Pizza. Buy 1 slice pesto pizza per lady.\nStep 2: Bring said slice to bar. ex: Molotov's.\nStep 3: Avoid eye contact with all males, devote attention soley to slice consumption.\nStep 4: Single Male takes bait and joins table in attempt to pilfer said slice. \nStep 5a:If attracted to Single Male, offer bite of pizza. Mutual love of pesto goodness prevails and conversation ensues.\nStep 5b: If repulsed by Single Male, offer bite of pizza in exchange for free shot. Note: nearly finish consumption of slice while waiting for free shot. Take shot, offer crust to Repulsing Single Male, return to Step 1. Repeat.", "author": "Britt W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-02", "description": "It's not great but its near my pad and plenty greasy to calm a tummy full of beer. It's a little over-priced for what you get as there's certainly nothing exceptional about the pizza. Sober food it is not, but if you're hungry and cravin' some grease after a night on the town, its quick, dirty, and might make the next morning a little less painful.", "author": "David H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-01", "description": "Mythic Pizza should not be partaken of during the light of day!\n\nA slice of pesto pizza at Mythic---\n\nDough \nRed Sauce\nMystery green liquid (presumably pesto) squirted from a bottle\nCheese\n\nWhat doesn't belong here?\nand\nWTF?!?", "author": "R M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-06", "description": "On Friday, Starla pointed out to me that our crew doesn't spend nearly enough time in the Lower Haight. Now I couldn't agree more, but I was trying to put together a civilized dinner for our merry band of rogues and whinos. Fat chance. Before I knew it, we'd abandoned plans for dinner at NOPA and cocktails at Madrone  in favor of sausages at Rosamunde and drinks at EVERY Lower Haight bar that would have us. They don't call us classy for nothing. We EARNED that title.\n\nAnyhoo, sausage scares me. So I passed on dinner altogether. And thank god I did. Come 10 p.m. when I was on vodka soda #5 and my pizza cravings were hitting their peak, I was thankful that my tummy was empty enough to justify a slice of pepperoni/garlic/grease pie from Mythic. \n\nNot only did we get delicious slices of pizza (WAY better than every other time I've been here) but my partner in crime got unsolicited dating advice from a fellow patron. All for around $6. Now that's a deal! \n\n**thin, crispy crust means little to no beer-bread expansion once in your stomach, which means you can continue drinking like the rockstar you are. Take your slice to Noc Noc next door and eat in the dark. Because eating in the dark is the best.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-13", "description": "Foul.  I mean seriously F O U L.  Not to be confused with \"fowl\" like the bird, \"foul\" denotes horrendous, undercooked, cold, nasty pizza that by it's very existence should be tried for the treason of masquerading as pizza.  Do NOT eat here.  You can be drunk and this will NOT be your salvation.  You can be sober and this will NOT make you want to get drunk.  I would rather have eaten the parmesan cheese from the shaker mixed with ketchup and poured over a piece of wonder bread and topped with cheap imitation pepperoni.  Or one of those Lunchables pizzas that they market towards kids.  THOSE combos would have been more deserving of the title \"pizza\" than the foulness served up by Mythic Pizza.  When did reheating leftover pizza become something worth paying for?  Especially when they even fail to \"reheat\" it properly.\nW T F?!", "author": "Jill D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-22", "description": "Reminiscent of Ray's in NYC but a little saltier. I honestly don't understand why this place gets such a bad rap since the pizza is not that bad and at 2 bucks a pop, it works for a cheap lunch when you are broke as a joke (like me).  Mr. Pizza Man & Pizza Pino deserve the award for worst pizza, not Mythic.  Absolutely listen to the long lost Gourmet G on this one.\r\n\r\nPS - I went for the plain cheese, no toppings, which may have had something to do with my positive experience. What can I say? I have the palate of a 6 year old boy.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-04", "description": "Not digging this place - so much that I'm writing this review as I consume its product. Pizza is blegh, expensive slices, and they charge for ranch when escape from ny is down the street and has that and tapatio for all to share. Won't be coming here again. No amount of alcohol makes that pizza okay.", "author": "Allie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-08", "description": "Im not sure what everyone is crying about, this place has some of the best pesto pizza Ive had in the city. It is a bit greasy but it's still damn good. \n\nOf course there are better options, Love n Haight, or Rosamunde's to name a few, but you came in for cheap pizza and you'll get a damn good example of it.\n\nUnfortunately, ordering delivery from these guys is a different, much more disappointing experience, so go there in person.", "author": "William S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-01", "description": "Not bad.   I was expecting something completely unedible and tasting of cardboard, but this was pretty decent.   I'm not sure if it compares to an average NY slice, but pretty tasty in my book.   This could have had something to do with all of those beers earlier in the night at some of the neighborhood bars around, but I was satisfied.   I was taken here after being taken around Lower Haight by a friend for some bar hopping.  \nOn a side note:  don't go to the bars around this area.   Terrible.   I think I saw 2 normal looking girls, the rest appeared to be goth club rejects or some other creatures of the night.    Being taken out in this neighborhood made me happy that bars in SF shut down at 2AM.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-12", "description": "I like how the pizza here gets better and better the later it is and the more I've had to drink...\r\n\r\nOpen late, proximate to drinking establishments and cheap...It's not the best pizza I've ever had but it is far from the worst...\r\n\r\nNow when are they going to open the one on 6th Street so I can have the same experience when I'm drunk in my own neighborhood?", "author": "Todd E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-03", "description": "I can't distinguish the difference between their cheese and the plastic from my tupperwear lids.  All their slices consist of nasty toppings added to their nasty cheese pizza and reheated for 2 minutes.  Though, they do get 1 star because their product is palatable if you are wasted.\n\nThe guy who works/own this place also seemed involved in the worst taqueria in SF down the block that finally shut down.  Coincidence?", "author": "reza n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-16", "description": "This aint no five star joint and i aint the classiest of broads, but when its 1am, and i need something to soak up the alcohol so my classy ass dont hurl...Mythic Pizza does the trick.  Big, tasty slices...cheap...open late.\n\nThats good enough for me.  Grub", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-22", "description": "THEY ARE OPEN PAST 2 AM!!!!!!!!  This is not as heavy as the infamous Seniore's, less greasy not as much cheese garlic etc.  Expect to wait in line if you go there late nite and beware of stinky homeless homie that comes in every 5 minutes after they kick him out.\n\nStand outs are the greco, chicken and broccoli, artichoke hearts, pesto, mmm!  The secret sauce is tasty, but what is in it????\n\nCheap better than average slices, esp after a nite of drunken stuper.", "author": "Aaron I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-23", "description": "I really wanted to like Mythic because every neighborhood needs a pizza-by-the-slice place. I've \"dined\" here a couple of times without much thought to the pizza. The previous precedents for eating here was merely for some cheap sustenance after helping a friend move into her new apartment or after a really long day of work. \n\nLast night I came here with the intention of having two slices as my dinner. This wasn't to be a snack but my main meal. Bad idea.\n\nOne should not put so much importance on a pizza place like this. I ordered the pesto and the greco. $6 for two large slices. But oye, SO SALTY! I had to drink two bottles of water to replenish my system. And so greasy. Not the good kind of grease either. I could almost feel the oil sloshing around in my stomach for the rest of the night. And the crust wasn't even that good.\n\nBoo.\n\nAlas, this is the kind of pizza one consumes when you're not thinking about what you eating (lowered food standards)...i.e. drunk, high or extremely tired.", "author": "Viv C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "Just had a few slices last night here with my friend. I was super surprised how good it was! The slice was big, there were TONS of toppings, and the over all taste was good. Will definitely go back there!", "author": "Tyler L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-07", "description": "I have a secret that I'm not proud of but I need to get it off my chest. . .\r\n\r\nI ended up at Mythic Pizza plastered twice last weekend.  Yes that's right both Friday AND Saturday night.  Both nights were quite different so let me explain.\r\n\r\nFriday night went to happy hour with all the other lovely Yelpers.  F.U.N.  I had to leave to go to some fancy shmancy party at Frisson where you need to dress up.  It could have been great had there been a completely different crowd and dj.  Lot's of white people dancing to rap.  I had bottle service which did not make up for the ridiculousness in attitude happening all around me.  I left after about an hour dressed up but drunk.  I'm walking down Haight Street in heals and there's the beautiful light of Mythic Pizza.  Just what I needed!  \r\n\r\nI thought the slice was great.  Cheap, crispy, and fast.  Ate my pizza although I did burn the top of my mouth so be careful!  \r\n\r\nOkay Saturday night different story. . .this one I feel a little more guilty about because I spent the day hanging out having a great time.  I even ate excellent sushi for dinner, drank some wonderful wine.  I left my companions house and hopped in a cab headed for bed. . .instead I had the cab leave me out in front of Mythic Pizza!  I got another slice.  The pizza was so good the night before I thought a little snack before bed wouldn't hurt again. . .\r\n\r\nI had the Haight slice Friday night which was YUMMY, and then the Veggie slice Saturday night.  I thought both were delish and I'm not even that big a pizza eater.\r\n\r\nI feel so much better that I got this off my chest.  \r\n\r\nMythic Pizza Lower Haight Dwellers Drunken Dream. . . \r\nCheap, Crispy, Quick!", "author": "James M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-27", "description": "Pizza is OK. Nothing special here, but the location is perfect if you find yourself at Toronado. And since we were just at the bar, we found ourselves here twice in the same night. Not some testament to the quality of pizza more like we were hungry between beers. And after the night was over to. The longstanding combination of beer and pizza is a sacred tradition on a night out. \n\nThe Hawaiian was quite good, compared to some other pizza joints in San Francisco. What is unique about Mythic pizza is there is no pizza on display. Usually in your haze of booze or hunger you stare at the warm pizza through the glass and make your decision. Here you have to actually consult a menu. GASP. I\n\nInteresting to say the least because they have a sign up that says, \"All slices made to order in 2 minutes!\" How can they get away with just making anything so quick. Guess I am unclear on the secrets of the pizza industry. Obviously quality might be forsaken when you put short a time span on something. But they do an OK job. Although we were timing them and the average was more around 3 to 4 minutes. Not SHABBY at all!", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-16", "description": "Why am I always in Lower Haight when it's laight?? As I was lead here on a recommendation, I was extremely skeptical when I noticed the prices. $4.50 for a slice? I had just gotten a slice from Cybelle's, which I had to leave in the car, when we came here. This better be good!\n\nI had the San Francisco slice and wow was it packed. The amount of toppings could have equaled another pizza. The feta cheese was generous and even good. It was everything a starving, boozed stomach could ask for. I'm coming here from now on when I need a late night meal.\n\nBut don't listen to my opinion - I grubbed on the nasty, cooled Cybelle's pizza when we got back to the car.", "author": "Ryan V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-24", "description": "after an EPIC Jazz Night there is only one way to make it EPIC-er.  And that my friends is Mythic Pizza.  You know what's so great about this place that keeps us coming back?  it's open.  and it's there.  and it's in the lower haight.  \n\nThat's about it.  The pizza really isn't the best.  It's actually quite mediocre.  but they're quick and pretty cheap and when your mind has just been blown by the sensory overload that is Jazz Night at Yoshi's then you don't care what you're eating.  as long as it's Mythic.  \n\nPlus they have hot sauce in squeeze bottles that we just drown our slices in and it's wonderful.", "author": "William S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-29", "description": "The pizza is a mess....sloppy, gooey and all the cheese slides off when you pick up a slice, UNLESS, you put it in your oven and make it WELL DONE.  Then, its pretty delicious and has a great flavor.   But, you shouldn't have to go through this extra step.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-11", "description": "Girl and I were getting slices of pizza here. \n\nGirl: Im gonna have some of your slice too, ok?\n\nMe: ok.\n\nDrunk Guy: Don't be a sap! Stand your ground!\n\nA mutual understanding and respect for each other's rights and needs is the foundation of any relationship, whether it's romantic or a platonic friendship or a business partnership. You make sacrifices here and there, but ultimately if all parties involved aren't benefitting, things will end badly for everyone.\n\nI've had better pizza than what Mythic offers, honestly. The crust is a little doughy and the ingredients don't seem cooked in well enough; It almost feels like you're eating each topping seperately. I've had much worse though. It's perfectly acceptable when you're full of lower haight beer and rosamunde is closed. \n\nShe had a little of my slice that night. I ate part of hers. It worked out.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-26", "description": "They have this thing called \"Deep Dish\"...except it's not.  You want deep dish, go to Little Star or Patxi's.  Mythic's \"deep dish\" is really just way too much cheese piled onto a pizza.  How dare they tease me with those two magic words!\n\nTheir regular pizza is fine, though--and is the Lower Haight's only late-night pizza option.  And any place that turns down sports in favor of showing the Sesame Street holiday special on their television set can't be all bad!  Also, their garlic bread is cheap but irresistable when you're drunk.  And so am I.", "author": "Eric E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-02", "description": "Not knowing this place's reputation, I drunkenly ordered a slice on which \"garlic\" was a featured ingredient.  I dug in and got about halfway through before I realized *just* how powerful the pizza I was eating actually was:  As if the pickled potency of the artichoke hearts wasn't enough, I think they snuck the Gross Annual Product of Gilroy onto my slice.  I nibbled a little more before calling it quits.\n\nBut as my friend finished eating, he remarked how garlicky his plain cheese slice was.  \"Really?\" I asked incredulously.\n\nAfter determining that he wasn't just suffering from second hand garlic, I convinced him to try a bite of my slice.  It was an eye opening experience for him.", "author": "Bailey S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-13", "description": "I've been here a couple of times over the years and most recently went here after a recent Yelp happy hour...but only because Memphis Minnie's and Rosamunde were closed, dammit!\n\nI had a slice of their pesto and a slice of their cheese pizza, and both were decent. Greasy, but decent. Actually, they were better than decent at the time, but that was because I was starving...\n\nBased on my observations, I'll definitely stick to cheese or pesto slices if I come here again. I'm not a huge fan of 'let's take a slice of cheese, add a bunch of toppings and then put some other type of cheese on top of it' slices of pizza...", "author": "Art D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-11", "description": "Holy shit!  This pizza is amazing!  I don't mean it is amazing in that \"my taste buds just realized their purpose in life and have decided there is no point in a continued existence\" type of amazing.  \n\nWhat I mean is that I'm pretty sure the food here is the most exactly perfectly average food ever.  An absolute, exact 2.5 stars for the food.  The interior of the place is dirty, but not \"I think that rat is going to try to steal my food\" type dirty.  Again, I'd award it an exact 2.5 stars.  See, most places are actually \"almost, but not quite 3 stars\", or \"close enough to count as five stars\", but not Mythic Pizza - it is exactly 2.5 stars.  Amazing!", "author": "Matthew H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-20", "description": "I finally ordered from Mythic because it was featured on GrubHub.com and because I felt like I was cheating because you normally can't order online from here but GrubHub allows you to.\n\nThe pizza itself was OK.  The cheese was a little bit runny, but the pizza was delicious cold the next day.  If you do order Mythic using GrubHub, be sure to tell the driver that you left your tip through the online service; I hate when they think you stiffed them when you really didn't.\n\nI'll definitely give this place another try, but not before I've tried a bunch of other places.", "author": "John S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-09", "description": "I used to drop into Mythic while drunk a lot, & until recently I insisted it was one of the better pizza joints in the city. The turning point being that I ate there sober. Naturally.\n\nI know that sounds bad. But I don't want to seem too harsh on a place that has done me good for this long (I've dropped in on practically every drunken walk home from the Mission ever). This is still solid pizza, & I'd send anyone here for a slice without hesitation.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-19", "description": "Greasy.  Cheesy.  Meaty.  If I had eaten here like all my friends did I wouldn't have had a hang over the next day...like I did.  \n\nI did have a bite.  And it was delicious.", "author": "desiree n."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-06", "description": "First time trying this place - ordered online, so how could they screw this up?  They clearly gave us someone else's pizza which had toppings on it that I couldn't eat, but since there were people over they dug in.  The Caesar salad was mostly croutons with not much salad.  Extremely expensive for not being able to eat it, very disappointed.", "author": "Adam R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-20", "description": "Eh, it's good after drinking.  We headed over to Mythic pizza, really, because it was across the street.  The choice of slices is really nice.  The \"haight\" has the potential to be a fabulous concoction.  But, the ingrediants aren't really that great.  The mushrooms were a bit soggy.   I actually really liked the fact that is was a cheese pizza topped with the \"haight\" slice requirements then topped again with parmesan cheese.  The more cheese the merrier!  \n\nMy friends have ordered delivery here, but the whole pizza options are much more limited.  Mythic Pizza will absolutely not prepare a \"haight\" whole pizza version.  You can on the other hand order tons of slices.  This makes absolutely no sense to me.\n\nI'd eat here again if I was tipsy and needed some grease to soak up the beer.  Other than that, it's not really on my radar.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-08", "description": "If you are craving for Pizza or you need to put some food in your stomach after drinking and you are in the area, definitely try it out. Go hungry, their slices are big around $5 each! I tried their Mythic or Mystique pizza and is the bomb, really you wont regret it.", "author": "Juan Camilo R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-27", "description": "The very definition of average. Its really amazing that so few places can make a good slice of thin east coast pizza in SF and even fewer deliver. But mythic is decent enough considering it usually has a good deal on two large pizzas, and SF pizza tends to have a serious overpricing issue. Delivery for me has always been in the 45 minute range even living out in potrero.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-29", "description": "not bad, not spectactular- it is a slice of freaking pizza, drink your beer, grab a slice, and there is nothing to bitch about.\n\nI had one with pesto, artichoke, and garlic pizza- uber stinky mouth muhahah!\nHoneyB went similar w/ pesto, olive, and feta.\nthe pepperoni looked kind of gross, Bri-guy can have it nobody is stealing from that za\nI enjoyed mine without the 75 cent school pizza buttermilk ranch in a packet.\n\nyou do feel the aftermath of the grease definitely if you are walking all the way up the haight to get back to the parking lot. gurgle-egh feeling, but it wouldn't stop me from going again.", "author": "Breezy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-24", "description": "Best pizza in town PERIOD!  Been going here for years and I still haven't had better.  I've tried all the greats: Seniore's, Golden Boy, Escape From NY, and to me, Mythic is the best.  Long live MYTHIC PIZZA!", "author": "Chris E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-23", "description": "Once, while extremely drunk, I took a few bites of a slice of Mythic Pizza and threw it away.  It was pretty terrible pizza, but I was promptly shamed by my crew for throwing away pizza when there were drunk, hungry people around.\n\nI guess that's how I see Mythic Pizza.  If you are SO drunk and SO hungry that you'll eat bad pizza, it's okay.  Otherwise, you may end up dumping most of a slice in the trash and then throwing a drunken tantrum about wanting tacos.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-05", "description": "Here is a case where statistics really tell the whole story.  Every time I come to lower Haight this place seems empty.  I decided to give it a try yesterday afternoon, partially out of pity and partially out of necessity, and I learned why.  The pizza slices here are like a brick!  It's pretty sad when you can't even sell slices of pizza to drunk-ass patrons of Toronado on a beautiful Saturday afternoon.", "author": "Neil A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-23", "description": "I was going to look up the word Mythic and then describe how not mythic this pizza is. I ordered the pesto slice which was a cheese slice squirted with some green sauce like frosting on a cookie.\n\nThe crust was crispy and the pizza was nice and hot but pesto it was not. All the slices are made \"fresh\" within two minutes and they kind of have sandwiches but there was nothing mythic about it.\n\nYou wanna know the sad thing? I'll prolly end up going back in there after I have a few Black Prince Porters from Toronado and I'll try something else.", "author": "Hunter G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-02", "description": "I would venture to say this is one of the best slices in SF. I like the fact they prep and cook the slices right as you order.", "author": "Seth H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-25", "description": "Hmmm, it definitely has a good location with Noc Noc and Toronado next door and the pizza is decent. It's no EFNY in Upper Haight, but it'll do. Good selection. I have had slices that I was pretty happy with, and other times when the crust was somehow done, but the toppings were merely warm and the cheese half melted.\n\nDefinitely late night, drunk pizza place. I would never go there before midnight. Wow, I'm making it sound really bad. It isn't bad, it just isn't that good either. I still go back there, but always wish it were better.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-29", "description": "The tastiness of the pizza here is in direct correlation to the number of beers consumed next door...unfortunately I still haven't been able to drink enough to make the pizza taste good. \n\nSomehow, I imagine that there is a yet undiscovered equilibrium between drinking enough to make the pizza taste good without drinking too much so that I forgo the pizza and end up clinging to my bathroom instead.  \n\nOne obligatory star for being obligatory.", "author": "Dave R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-16", "description": "This is my go-to slice.  Five blocks from home, a door away from Noc Noc, and it's just darned good pizza.  I'll put out there that I dislike Aranell and like chicago pies, though these slices are neither style.  Thicker than NYC but thinner than standard.  Perfect mix between chew and crunch, for my tastes.\n\nMythic is consistent.  They heat 'em up just enough (I am a plain cheese slice guy, usually) and it's in your grubby little hands lickety-split.  Drown it down with a Mexican coke in a bottle.  Watch the riff-raff alternating with the hipsters out the window.  Even motorcycle parking spaces right out front.", "author": "Rocky M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-08", "description": "You bring this pizza home for me after 2am on a Friday night, and I will eat it and then I will thank you for it.\n\nYUM!!!\n\nI'd make that 4 block walk any late night over the lazy man's delivery option from Cable Car Pizza (which delivers until 3am, but it's overpriced and not nearly as delicious as Mythic's plain cheese slice).\n\nI would like to add that their single slices are HUGE.  I was starving to begin with, and I couldn't finish mine.\n\nGranted, as many have said before me... my love of Mythic Pizza might have something to do with the hour that I eat it.", "author": "Emmy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "This is a great place for pizza after you've had many adult beverages in the evening and oh sure you don't really need to eat again as you had a nice dinner earlier but somehow the evening took a turn somewhere and you ended up having one more gin and tonic than you should have and then had a difficult time finding a cab as it was close to last call and while walking home you started thinking about having a slice of pizza so you stop here and order a slice and notice wow there are a lot of drunk people in here also waiting for pizzas and you are kinda amused but also kinda annoyed and then you really have to go to the bathroom but then you pizza slice is done so you quickly scarf it down and it tastes really good and you make it home just in time to relieve yourself and that's when this is a great place for pizza otherwise its not that great.", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-07", "description": "I have had good pizza and bad pizza at this joint, it all depends what time you roll in. The late night drunken crowd can be a pain in the ass sometimes (not mythic's fault). Expect a wait around lunch time and after midnight. seating is limited and they do charge for ranch I also did not remember seeing any hot sauce on counter but they do offer crushed pepper and parm.", "author": "Raul R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-12-29", "description": "Good when drunk? You must mean Black-Out-Drunk, c'mon folks!\r\nThey should go on and change their name to Ray Bari...I know some of you katz know what I mean by that. It's hard for me to fathom how this place stays in business. There's no way those pies are keepin their doors open unless they're using them as door jams. \r\n\r\nYelp! Please add a negative star system...it could really save some innocent digestive systems from gut bombs like this", "author": "NaN K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-05", "description": "Crappy pizza literally THROWN at you by people who couldn't care less. The owner was behind the counter and his presence was nothing but detrimental. Am I the only person that likes to be treated with respect even when I'm drunk? Opening up next to a bar is the ONLY reason this place is still open.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-01", "description": "If you're drunk and you have four dollars in your wallet, by all means, step inside and grab a slice.\n\nIf you're not drunk, why would you ever want to endure an unfriendly cashier, just to get yourself a slice of sub-par pizza which has about as much care and quality put into it as an assembly-line Big Mac?", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-15", "description": "Don't go here unless you are drunk!  If you've been out drinking all night and you desperately need a slice, Mythic Pizza is your place!  It's not particularly good pizza, but it's pizza and it's cheap and it's fast.  The slices are generously sized and dripping with delicious cheesy grease.  It's that kind of pizza.  Drunk pizza.  Enjoy!\n\nConversely, if you are stone cold sober and looking for an actual meal, move along and find something better.", "author": "Laura C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-01-29", "description": "When you go in to get a single slice the pizza is AMAZING.  So crispy,  so delicious. They make every piece to order!  My favortie joint. \r\n\r\nBUT: When you order for delivery/a whole pizza beware.  It was soggy, bland, and NOT worth the money.  Avoid at all costs! Call Chico's instead.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-22", "description": "for middle of the night pizza in lower haight, there are plenty of choices, but they're all 2-3 blocks away from each other.   Mythic is not remarkable in anyway, but if you want a quick slice, and you're close by, this is the place to go.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-28", "description": "Mythic's not somewhere I'd go during daylight hours for good pizza, but it serves its purpose - to soak up booze after a night on the tiles. \n\nThe Mythic slice basically comes with everything, and way too much cheese. The only complaint is they don't cook the onions before puting them on the pie, so you get chunks of nearly raw onion dropping off.", "author": "Iain T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-27", "description": "Here's the deal. \nTheir pizza is awesome. Their chicken wings. So good. \nTheir open really late, and are right next to Noc Noc's, which is right next to my house. \n\nDownfall. The people who work there screwed me a bit.\nI got a some different things on the menu the total price was $13.15. He rang me up for $131.55. The guy then proceeded to look at me and said \"Oh no, i made a really big mistake I'm going to void it\"\n\n...Here's the thing. Not only did i overdraft $55 in my account and have to pay overdraft fees, but it took a really long time for the money to come back into my account.  \n\nGood pizza. \nI just think it's a bit ridiculous that you dont notice when you've rang someone up for $131 without thinking twice.", "author": "Amy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-25", "description": "Good, not great; this place falls right on 3 stars. I haven't been to many pizza places in SF yet. I will come back and update my review once I've had some more pizza in the city.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-01", "description": "Sometimes you need pizza, and I guess Mythic is not that bad.  It's one of those places where they pile toppings onto cheese pizza and put more cheese on top.  I'm not opposed to that as a matter of pizza law, but 2 stars not 3 for frequently dishing up slices with the toppings stone cold.", "author": "Luke M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-20", "description": "it was okay. it's great drunk food and it was pricy for its' quality.", "author": "Wendy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-20", "description": "Kristen L - yes, Mythic Pizza IS bread with cheese and sauce on it.  Perhaps this was only revolutionary to me because I was drunk and stoned.  I've only been here once, but I have this policy: if the name of the restaurant appears as an item on the menu, you damn well order it on your virgin visit.  So, as far as I know, the Mythic Pizza is the only slice they make here that's like that.  And apparently some don't like it, but I thought the glopped cheese and sauce was awesome - no less visually!!!  It looked like an extra-terrestrial's take on pizza.  So I prefer complicated pizzas because each bite is a surprise; you're never sure which combination of toppings you'll get.  In Mythic Pizza's case, cheese and sauce effectively qualified as toppings for these intents due to their uneven distribution.  Insanity.  \n\nDISCLAIMER: I may also be biased because I went on Halloween and something about being in a \"Mythic\"al place put me in the mood for an epic experience.", "author": "Doug B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-07", "description": "\"You better not give any place that melts toppings on top of already cooked cheese pizza more than two stars!!!\" -the boyfriend\n\nI, however, enjoyed my spinach and mushroom melted cheese pizza slice from Mythic late Saturday (ok...i guess it counts as early sunday morning). So, plus one more star. \n\nHe did, however, have trouble validating his argument when he tried to steal my piece and run away. I'm pretty sure he ate the paper plate too.", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-17", "description": "This is a review for economy pizza.  Remember that.\n\nConsistent, totally edible, and someone PLEASE recommend another pizza place as good as (egads I know) Round Table without the price.  And since I am from here originally... NO... no I do not like thin crust shitty NY carboard pizza, nor do I like deep dish muckedy mucked up 70 napkin soup pie.\n\nThank you very much.  \n\nTheir crust is pretty chewy.  I like that.  \n\nNo.. it is not the greatest.  But it does the job better than most others, especially after hours.", "author": "Uncle Fishbits Aeneas X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-31", "description": "NOT a place to get a slice!\r\n\r\n(as mentioned, they do the recycle thing and it doesn't do their fresh pies justice.  just forget it. i don't care how drunk you are.  stop it!)\r\n\r\norder a whole pizza (and TRY not to be boring.  you know... try something OTHER than cheese and pepperoni.  C'MON!  be a little creative, this is what they do best) before you go home for the night.  go to toronado, have a beer or get some to go, exit, pick up pizza.  walk/cab/fly home.  enjoy.  DELICIOUS!\r\n\r\nbest enjoyed after 12.  the guys who work there are really nice and they always have animal discovery shows on (mesmorizing when drunk).  \r\n\r\ni have also been sober and had them deliver, so my opinion that their pizza is good is not a whiskey-goggles syndrome.", "author": "Ge O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-17", "description": "Decent pizza if you've had too much to drink, but then again I'm sure cat food would taste like the best shit you've ever had by that point. I actually can't remember any time where I've been there and didn't just come from a long night of brew and billiards at Zeitgeist or Delirium.\n\nTheir delivery service is a bit different. After waiting an hour and a half for our pizza, the guy didn't bring us the free 2 liter we had a coupon for (and is on ALL OF THEIR MENUS!). It happens and I wasn't too upset but before I wrote the tip on the credit card slip, I told him I don't mind that he forgot the 2 liter but I still want it. I asked if he would bring it to me when he goes back  out for another delivery and he said yes. I tipped him like $1.75 and never saw the guy again. He was an asian guy so watch out for him if he delievers to you.\n\nI'm starting to think the free 2 liter thing is a ploy by all the pizza places. 4 out of 5 times they conveniently forget the 2 liter, or bring us regular coke when we ask for diet coke.", "author": "Billy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-24", "description": "Sometimes love breaks your heart. And sometimes, it makes you puke.\n\nMythic does the latter which also does the former, because I love Mythic Pizza. \n\nHow much do I love Mythic Pizza? Last 4th of July, after a long, stomach-filling bbq, Boyfriend and I watched the fireworks in Alamo Square. When the fireworks were over, the tummy was still stuffed from bbq food, but I made Boyfriend go with me to Mythic because I NEEDED TO SMELL IT. The whole thing made total sense to him - we're like a match made in heaven, or at least in a place that smells like heaven.\n\nAnyway, last night was the 2nd night that after eating Mythic, my stomach decided something was awry and pizza made an unbecoming 2nd appearance.\n\nBut I'll go back because it so freaking tasty. Sometimes immunity, like love, takes patience.", "author": "Whitney W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-01", "description": "DELICIOUS.\n\nMy 5 star review may have been induced by my blood alcohol content at the time but I do remember is being truly scrumptious !\n\nGrab a slice and go ... not really a place to sit and eat so much ... it's more ideal for that end of the night, need to stuff your face kind of establishment.", "author": "Sophie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-18", "description": "If you are in the mood for some perfect pepperoni pizza, order one here.\nThese guys have the most flavorful pepperoni I've ever had.  \nHowever, you have to order the whole pizza, because when put onto an individual slice to order the pep just doesn't taste the same.\nThe crust is thick, the sauce has a great amount and taste.  No comment on the cheese, because I pull it off due to lactose-intolerance.  But my roommate loves it.\nThey put up with a lot of drunken BS from my friends.  In store you get your order quick.  Good food, good FAST service.  Go here.", "author": "Light Bulb J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-12", "description": "Good breadstick/pizza by the slice option in a pinch. I ended up going here instead of Love and Haight because the people I was with weren't into vegan sangwiches. The pesto was really punchy and rich, crust was crunchy, breadsticks were pretty standard fare. I'd definitely go back if I was at bars in the lower haight or nearby.", "author": "Devin A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-11-22", "description": "Good crispy crust. Needs more sauce. Too much cheese. A little pricey. But, respectable for this pizza-impaired city.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-23", "description": "Seeing as this place is open until 2a.m. I would definitely categorize it as a late night munchy spot. I actually went to this spot sober for some pizza and was definitely NOT impressed! The pizza seemed warmed up rather than fresh. The two guys behind the counter seemed like they could care less about being there (which I guess I can't blame them). And the tables were dirty. Since there are only 3 tables in this small spot and no other customers were there I feel it would be a small inconvenience to take a soap rag to the table to wipe off the previous customers mess. If you see me there again it's because I've had a few too many vodka tonics and I need food STAT!", "author": "Casi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "fast delivery even at 2am. nice service, they were totally ok with us changing the delivery address. the pizza is good but not so much the buffalo wings.", "author": "Jules N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-04", "description": "Sold pizza.  Crisp and thinnish.  I will be going back to try the pesto.  Had the cheese slice $2.50.  3 tables, a \"pizza shelf\" with 3 stools and soft drinks.   Efficient, tasty.", "author": "Jeff J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-16", "description": "4 stars because they're good at what they do: good pizza fast!  They claim it's in 2 minutes, but it's more like 4 minutes 27 seconds.  The way it works is that they have pre-made cheese pizza ready to go, and they just put your toppings on the slices, add some cheese, put it back in the oven for a bit, and there you go!\n\nA testament to their quick service: while I was waiting, a muni bus double parked outside the restaurant, and the bus driver ran out and into the restaurant, grabbed a soda and his slice, and ran back into the bus!  The passengers' expressions were classic :)", "author": "Corey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-16", "description": "From ny so that's the baseline. A bunch of places in SF have partially cooked pies, add toppings, and then bake again. Not really kosher in my book, but for the occasion this place does it well. mythic piles it on and the options are pretty solid for late night", "author": "Victor S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-06", "description": "I've ordered from Mythic religiously, and have always been happy with the quality, and fast delivery.....until tonight.  We ordered online, paid with a credit card etc....40 minutes later we get a buzz, Pizza Dude is here (Yay!).  However, they didn't run the card, and need cash.....\"ok, no worries, I'll scrounge it up, be right back.\"  I say.  Go upstairs, get the cash, come back look out the gate, and Pizza Dude is PISSING ON THE SIDE OF MY HOUSE!!!!!  Its one thing for the various SOMA crazies doing their thing on Minna Street, but the pizza delivery guy?  That's too far.  How hygienic is this?  I don't know about you, but I don't piss with someone else's food in my hands...just a common courtesy.  Totally disgusting, don't order from Mythic, you might just get the urinating delivery special with your pizza.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-26", "description": "I am perfectly ok with eating this pizza, usually around 1:30am. Not the best pizza in the world, but:\n\n1. I can see it from my house, so therefore it's easy to stumble home to.\n2. It's cheap.\n3. They really do get you a slice in two minutes or less.", "author": "Veronica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-29", "description": "This place is the last place open in Lower Haight for late night munchies, and early enough in the morning for hangover helper. Does this place ever close? They deliver, their pizza is often damn good and for $5 you can't get a better deal on a full size meatball sub in the city (if you can, please tell me where it's at).\n\nUPDATE: I tried thier pizza sober and it was not quite as good as I remember. The meatball sub is still solid though.", "author": "M L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-17", "description": "Kudos for late night dining!\n\nKudos for dealing with drunk hipsters and wannbe's!\n\nKudos for being puking distance from Molotov's, Toronado, and Mad Dog In The Fog!\n\nThose expecting a near gourmet experience should go to hell.  What are you expecting, fuckin' Amicis?!", "author": "Larry A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-31", "description": "Ok, I'll preface this by saying that I'm not picky about my pizza.  I'll eat the frozen microwave stuff and I'll stoop even lower and eat Domino's if I have to.  Pizza is just one of those foods that you just HAVE to like...because...well, that's they way life is and has set itself up to be!\n\nI ordered a piece of the combo.  I liked how they had this squirt bottle of \"mystery cheese\" they put on top before re-warming my slice.  The pizza was great (went perfectly with the 2 pints of Stella already occupying the inside of my tummy) and to top it ALL off, they have HUGE squirt bottles of Tapatio randomly scattered throughout the place for you to drench your pizza to your hearts content.  And boy did I! \n\nI'd go back again on a Friday night around midnight after beers at Danny Coyles.  For sure.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-07", "description": "Four stars for the late hours, the quick service, the cheap prices.\n\nFlavor? What the hell are you so picky about at 2am after a hard night of drinking? Absorption my friend, absorption. Give that beer something to soak into other than your poor brain. In the morning, you will be oh so thankful.\n\nPlus the cheese is the kind that dangles from your chin, they always have lots of red hot chili peppers and just one of the guys behind the counter could protect ALL the customers from getting mugged.", "author": "Miel H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-21", "description": "I've been to Mythic a total of three times. I went the first time a few years ago and had a slice while drinking at Toronado. At that time, I exclaimed that it was the best slice of pizza I had ever experienced. The second time, I was again drinking quite heavily and got a slice late at night. I recall that it was good. However, somewhere deep in the trenches of my drunken stupor, a flash of clarity hit - this pizza isn't as good as I remember it. I quickly warp back to a drunken stupor and forget everything. I parade around Haight St., with a pizza sauce spattered smile. Flash forward, just a couple nights ago, after having gone pizza free for months, fairly sober and hungry, I decide to get some pizza to end the night right. Now, since it's late, about 10 pm, I decide to just hit up a corner store for some frozen pizza. I just want to make a pizza in the confines of my own home and not deal with the public intoxication going on. Tried and true, for me, a large DiGiorno always seems to do it. It's not the best frozen pizza, but I know it guarantees a certain level of satisfaction and, shit, if you bake it long enough it gets crispy. How many pizza places can get a good level of crisp? I hit one store - no DiGiorno. Shit. I hit another store two blocks away. Sold. Out. I think \"Jesus, I wasn't the only one on the hunt for some shitty frozen pizza.\" Worried, biting my nails, eyes darting around nervously in the middle of Lower Haight, I know what's about to happen. I'm going to get actual pizza. All the pressure of possibly getting screwed by bad pizza at a late night shop comes down upon me. I think, there is the place towards Wing Wings and then Mythic pizza. I think - \"Mythic can do this for me. Teach me all the wrongs of frozen pizza - set the night straight.\" Once again, I charge down Haight St. As I pass the burrito place, a thought darts by. It says \"Dude, what if the pizza actually sucks? Go for the burrito. At least you know the burrito will be good.\" I shut the thought down immediately. I'm determined to have pizza more than ever. Fuck off rationale thought. I walk in Mythic, pretending to be a regular. Couple tables filled, a few drunk people and, of course, people just like me - the look of feeling a little ashamed but also determined. We eye each other quickly and feel a bit better. We do a subconscious nod to each other - we're here for the same reason. I look at the menu, immediately land on the Tijuana because it has jalapeños. It also has sausage. How could one go wrong? I friggin' love spicy pizza. I order a small pizza. I can't be certain if I want one slice or five. Better to be safe. I want my options open. They tell me it will be 15 to 20 minutes. Cool. So I chill outside for some time, walk around a bit, come back, wait around, hands in my pockets. We all know what's up. Eventually, a man charges from the kitchen to the counter, pizza in hand, exclaiming \"Teeeaaawwhhuuaaanaaa!\" Hell yeah. I grab the pizza, slam it on the counter, throw open the top, a waft of pizza soul hits my nose. Checks out. I vigorously shake out red peppers, parm and oregano. Check. Check. Check. I hit the street, go into defensive-fast-walking mode and make it to the pad safe and sound. I plop down on the couch, place the pizza box on the coffee table and open the top. I stare at the pizza for a few minutes, allowing it to cool for a bit. A bit of panic hits me when I don't see any visible sausage. I think - maybe it's under the cheese. Be cool man, be cool. It's going to be good. After waiting a reasonable and expected amount of time, I lift a slice. Dear fucking god. The crust lifts but the pizza itself falls limp under the weight of the toppings, which come sliding off like a goddamn waterfall. A sinking feeling hits me - a feeling of darkness and loss of hope. I manage to quickly salvage the toppings and push them back on the slice, holding it now like a floppy New York fold. I do that awkward two handed grasp on the pizza and come in for the kill. I bite down. It's all jalapeño, a smidge of sauce and only a hint at what could be cheese - indistinguishable. One more bite, two more, I kill the slice. I look down at the pizza, hands messy with sauce, mouth on fire and overly acidic from the abundance of jalapeños. I have but just one thought - where's the fucking sausage? God damn, I think they forgot the sausage. Another second passes. I realized that I have no sense of richness from the cheese, no umami from the crispy oily crust, no thought of \"goddamn, pizza sauce is so underrated these days!\" No. This pizza reflects none of that. It was shit. Pure and simple, the worst slice of pizza I had ever had. I decide to inspect the pizza. Wait. The sausage is there. I see little broken up pieces underneath the cheese. I taste a piece. Flavorless. What have they done? At that moment, a tear comes down my eye and I realize what once was great pizza died a long time ago. I pour one out and turn away.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-11", "description": "If you're looking for something reasonably-priced and fast Mythic isn't bad.  I had their Mythic (which was really loaded up with tasty stuff) and something else that had jalapenos on it.  I thought it was fairly good but not anything special.  You're probably best taking this to go as the store itself is cramped, especially if you're unlucky enough to get wedged into that tiny spot by the front window!\r\n\r\nTimes visited: 1", "author": "Amy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-30", "description": "I love to haight this place...no really, I do.  \n\nIt IS good when I end up having it but it is rare that I go totally out of my way to seek it out.  \n\nI know they have a pretty good pizza and wings deal which I have had delivered in the past.  Ask about it!", "author": "Catrinel A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-17", "description": "A couple years ago, my doctor thought I might have narcolepsy and ordered some tests that required me to stay awake the night before, with no caffeine or stimulants of any kind. I had my whole night of wakefulness all planned out, but then I sliced my finger open while I was cooking dinner around 10pm and had to spend a few hours at the emergency room getting stitches.\n\nBy the time I got home, I had to scrap my dinner-making plans and decided to order a pizza from Mythic. I picked it up, brought it home, and realized that they'd given me someone else's order! \n\nBut they were closed by that time and I was stuck with one of those nasty \"white\" pizzas with clams and no tomato sauce. But I was hungry so I ate it. It was gross, and not just because it was one of those nasty \"white\" pizzas with clams.\n\nI've lived in the Lower Haight for three years, and that's the only time I've eaten at Mythic. On the plus side, I don't have narcolepsy (hence the second star).", "author": "Josh K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-18", "description": "I am not one to give bad reviews, but Mythic really earned one : (\n\nI tried to call in an order for delivery, and the gentleman on the other line simply said 'we're too busy, bye'.\n\nThat was a first.....\n\nI've also been there two other occasions after a night in the Haight, and the pizza is usually really runny and the crust is really thin.  \n\nI doubt this review will really do much to improve their service, and it's sad that they can get away with this as there are not too many pizza places in the area.  However, I'd strongly recommend that people try to support restaurants and other pizza joints that actually give a damn.", "author": "Farooq K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-29", "description": "yum yum yum!\nLots of veggie options and you can take your slice next door to Toronado!", "author": "rani s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-12", "description": "I got a slice of \"The Haight\" and it was pretty great. Mmm pesto and garlic (and spinach and mushroom and other deliciousness). A little overpriced for a slice maybe ($4.75)? But you're paying for the convenience of it being open late.", "author": "Richa A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-31", "description": "The pizza here is honestly, not very good, It's super-greasy and it will probably might even make you a little sick. However, if you've been out partying all night and are subject to certain substance, this place is open very late and really hits the spot for those late night munchies. Its certainly not the greatest pizza place, but it fulfills a certain niche.", "author": "Tian X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-13", "description": "This slice-of-pizza place is better than anything else I've had in the city thus far. Better than Escape from NY, better than Nizarios...\n\nThey make it fresh so it doesn't have that crisp, overbaked taste. And when you say extra mushrooms, that is what you get!\n\nOnly been here 3x but have no idea why it gets such bad reviews...and hopefully I won't find out!", "author": "Katie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-13", "description": "I ordered from here twice and the first time the calzone was dry and falling apart and the second time the pizza literally was so soggy it fell apart. It is not good food and not worth it.", "author": "Clara A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-08", "description": "You can get a slice anyway you want it... for a price!  Great after drinking food, good anytime food.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "Mythic is the go to spot for late night drunk pizza.  It goes down easy and lets u dive into a sleep coma.  Be sure to not wipe the grease stains on your t shirt if you decide that its easier to do that than use a napkin.  If you do so, the next day you will be convinced that someone ate pizza off your chest and will wonder who that mystery person was.  Just another Sunday AM post Mythic.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-26", "description": "When boozing it up at the Toronado, I often find that the beer tastes better after I've shocked my tongue with the strong flavors of their \"Haight\" pizza. Garlicky enough that no one in their right mind would put their tongue anywhere near my mouth (unless, of course, they are running from vampires, in which case my mouth would be a perfectly safe if stinky place to be).\r\n\r\nIt's not fine dining, it's not even spectacular pizza, but it's got a great location and at least one menu item I'll eat over and over again.", "author": "Jere K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-15", "description": "I love their pizza. Maybe it's because I used to live around the corner from it. Maybe it's because they're open really late in a city where most stuff shuts down at 10pm. Maybe it's just because, for San Francisco, they've got some of the best slices.\n\nBeats other pizza joints on Haight (upper and lower) hands down, IMHO, including Escape from NY and North Beach (which is crap, mostly).", "author": "Jim T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-22", "description": "Great late night meal. Lots of choices and one slice will have you coming back for more.", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-14", "description": "I'm not sure what people are complaining about, this place is perfect for extremely tasty slices, covered with fresh toppings at a decent price.  Yeah its not healthy by any means but I don't believe that to be a necessary category when judging pizza joints.  The crust isn't too thin and its definitely not deep dish, its a bit messy because of the all the toppings they put on but again I think thats a good thing.  If you want a dainty slice of pepperoni like you get at the mall, this isn't the place for you.  But if you want a place with a variety of slices, all delicious, it's my favorite place in the city.", "author": "Miranda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-21", "description": "They sell pizza? Who knew? \n\n5 stars for the hot sauce. I could drink that shit straight. YUM. Put that on the pepperoni pizza and Im ready to bounce from noc-noc to molotovs, to toronado to Mad Dog.", "author": "Adam L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-01", "description": "How mythic is Mythic?!\nThe best cheap late-night shady-looking pizza in town.", "author": "xavier v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-03", "description": "Cheese, Artichoke, and Garlic.  NUFF SAID!", "author": "John D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-06", "description": "Not all pizza is created equal and I'm OK with that. The thing that bugs me more than the bad pizza at mythic is the convenience.  Its located two blocks from my apartment and surrounded by bars... open late even. Even though bad pizza is better than no pizza, i would prefer that \nthey served good pizza.", "author": "Mike T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-09", "description": "Open up a can of Hunt's tomato sauce. Spread evenly on a slice of Wonder Bread. Place a Kraft Single on top. Heat in toaster oven for 5 minutes. Congrats - you're easily topped Mythic Pizza. The pizza and salad were abysmal in every way possible. I was sober. Avoid.", "author": "Ben S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-06", "description": "We like this place, they like us, not a problem with delivery, our pizza is always the way we ask for it, and we've come up with some interesting combos. The price is fine. I can't understand the negative comments.", "author": "karl g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-15", "description": "Three stars for the slice, one extra star for saving my life on a number of occasions when a warm, crunchy slice was just what the doctor ordered. \n\nIf you want a gormet slice, you go to Paxies. Here? Here you get your down-to-earth, need-something-cause-I-had-one-too-many-Bitburgers-at-the-Toronado 'za that rocks your damn socks.", "author": "Josh R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-25", "description": "The only thing Mythic about Mythic Pizza is that the pizza you order isn't the pizza they deliver.   We ordered \"the Haight\" but got a Hawaiian, which was a nasty shock.  Who orders a pizza with pineapple on it anyway? Even drunk, it didn't taste that good. \n\nThey did get two stars for being open at 2.30am and delivering quickly - so if that's what you are looking for, this is your place (Escape from New York were already closed).", "author": "George S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-09", "description": "Mythic Pizza is the best pizza you can get in lower haight.  It's perfect after a late night at the surrounding bars or for delivery.\n\nThis past summer I probably ate mythic two times a week.  I live in the mission so I'd call at about 3 a.m. and request a small cheese for delivery (or pesto...mmm so good).  But several times I'd passout before the pizza arrived.  This caused some serious friction between me and mythic.  They began to refuse delivery and stopped answering my calls. :[  One night I happened to be in lower haight, so I went in, grabbed a slice and mended the bridges burned.  Now I have no problems ordering my favorite neighborhood pizza after a night out or if I feel like some ubercheesey goodness.", "author": "Janice K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-01", "description": "I'm pretty sure that being a total fucking asshole to everyone you speak to is a prerequisite for working here, but apart from that they make a pretty adequate slice of cheese pizza.\n\nIf you're drunk and hungry... consider going somewhere else.  If you're drunk, hungry AND broke, you have arrived.\n\nGive your money to the cat with a look on his face like someone's stabbing him in the balls every time he has to break a twenty, and he'll hand it to the dude grilling you like \"the fuck I have to cook this for\" and eventually you'll get your greasy slice of pizza.\n\nNo, it isn't the best.  It isn't the worst either.  It's like that girlfriend you almost eloped with but whose name you've now forgotten.  \n\nEat here if you must.", "author": "Hebrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-17", "description": "Mythic Pizza has been my savior on many, many a drunken night out at the Lower Haight terrible three:  Toronado, Noc Noc and Molotov's.   Normally it would be a three-strikes-and-you're-out type of thing, meaning three-strikes-and-you're-on-the-bathroom-floor-all-night type of thing, but nosh two large slices of cheese pizza from Mythic before passing out and you'll be ready for a Bloody Mary in the morning. Trust me on this.  I'm a very trustworthy lady -- and I voted for Obama.", "author": "Christy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "i've eaten here probably a dozen times or more. Just never while I was exactly...sober. Perfect drunky late-night after-bar pizza stop. Good selection of specialty pizza slices. Pesto comes to mind? It serves its purpose, so 4 Stars for all of my 2am satisfied drunky pizza demands.", "author": "Shanna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-24", "description": "It's OK to judge a book by the cover here.  Mostly.  Yea, it's what you'd expect.  Mediocre crust, mediocre cheese, mediocre etc.  But I cannot tear myself away from the sun dried tomatoes.  They really make a slice spectacular (especially after a few beers at Toronado).", "author": "Christine M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-09", "description": "Adequate pizza. Nothing really stood out. Didn't live up to the hype; I think it's just the best pizza on that particular strip of Haight.", "author": "Munaf A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-31", "description": "Best pizza you can order on Grubhub. Order it!!!!! Plus they are realllly fast. Got my pizza in 28 mins", "author": "Kurt S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-28", "description": "Nothing to write home about but I've had worse. One positive is that they have the slices hot and ready.", "author": "rob. l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-27", "description": "Great place to run into if you just wanna grab a bite for cheap. I walked in this place a little after 12 and the wait was not even bad. Like they all say, you get what you pay for and for this pizza, you really do get what you pay for. At less than $5/slice, I would say they are pretty generous on their portions. Simple menu selections at this place... You cant pass this place up on a drunken night...", "author": "Chris D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-06-19", "description": "Remember that one Todd Flanders friend you had, who was kinda bland and churchy, but you hung with because he had a sweet Transformer collection. and as a kid youre shallow? So you go to his house and his Mom offers you a glass of grape Kool-Aid, and youre down, so you take it and take a sip, and off the bat you wanna spit cuz its piss warm, and then you realize that someone crushed an aspirin in it? \"Oh Mick, that has NutraSweet in it. We dont want Scott to have sugar\"....Yeah well...this is the pizza those people would serve at his lame Noah's Ark themed parties. Which, both are good if your drunk.", "author": "Mick F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-20", "description": "It seems like whenever I'm slightly drunk, in the area, I end up here. Get the greek(?) pizza. I think that's what it's called, I'm usually drunk when I'm here so who knows. But its got feta and artichoke hearts, and pepperoni(I think). mmmmmm. But you can't really go wrong with the basic cheese or pep. slice. It seems to always be crowded right at 2 am, wonder why. but the workers always remembered who ordered what, some how.", "author": "Jhoe G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-29", "description": "i used to drink at molotov's a lot.\n\ni used to stumble across the street and eat this pizza, slurping up every last delicious drunk bite before i knew what i was doing. i would always wake up at seven the next morning asking myself WHY?!\n\nalso, one time a homeless man offered me the tail end of his joint while i was in one of my drunken friday night stupors, standing on the sidewalk in front of this place. i accepted. i think it might have been laced with pcp or something, cos the rest of that night was CRAZYTOWN.\n\ntoo crazy to even explain. to even BEGIN to explain.", "author": "Irene S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-19", "description": "All in all, a pretty sad excuse for pizza.  The only reason to come here is if you're out drinking in the lower haight after places like Rosamunde , Ali Baba's, and Memphis Minnie's have closed and you MUST get something to eat before you leave the neighborhood.   The crust doesn't know what style it wants to be and easily breaks if you get anything with more than one topping on it.  The pizza in general is just too damned greasy (and that says a lot if I'm calling something too greasy).  There's a reason this place is a running joke next door at the Toronado.  If you've been drinking all night and you can STILL tell how bad the pizza is, that's some really bad pizza.  God only knows how bad my impression of this place would be if I actually came here sober for once.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-06-20", "description": "Basically, a slice here is a slice of pre-cooked cheese pizza piled extra high with other toppings and more cheap mozzarealla.    Crust gets bogged down and soggy pretty quickly.  This place only gets points for staying open late.", "author": "matthew w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-25", "description": "Pretty damn good, came in here late night and got a slice of Athens with my boy (artichoke, garlic, pesto). Was really cheesy and satisfying. :)", "author": "Anjali B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-12", "description": "not the best slice in town, but it will do the job pre or post drinks on lower haight.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-30", "description": "With the price of dough on the rise, it is nice to find a spot that doesnt jack you for a slice. $2 will get you a nice slice of cheesey goodness after a few beers next door at the Toronado.", "author": "Sean K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-09", "description": "I actually at this pizza sober(ish) one evening and it was mediocre at best. The great thing is the size of the slices (easily a small pizza itself) but the bad thing is the bland-greasy result. If you're drunk, taste doesn't really matter and pads of cheese sound like a great idea. Sober(ish) you realize that your pizza was supposed to have toppings and you'll yearn for a spice rack to add some flavor to your meal.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-16", "description": "If you asked me a few days ago, I would have given Mythic Pizza five stars. I would have raved about the cheesy goodness, praised the delicious crust, and marveled over the fact that there is a plentiful supply of hot sauce out for people to pour over their slices. However, up until last night, I had only ever eaten at Mythic Pizza while pretty freaking hammered. Last night I finally had the pizza sober and realized that my palate when I am drunk is not very refined. That said, there is nothing WRONG with Mythic Pizza -- the cheese slices are good and only $2 -- but I have had better slices at other places. However, this place is highly highly recommended if you are drunk (and all the counter help speaks drunkenese, so don't worry if you can barely get your order out).", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-14", "description": "this slice is HUGE !\n\nmy favorite is black olive & mushroom \n{with a side of ranch for dipping!}", "author": "sUper j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-23", "description": "auh-maz-ing. mythic is definitely my go-to post-bars food of choice. the Mediterranean pizza is covered in a sea of delicious pesto and the crust is cooked to perfection, recently i added \"every type of meat you have\" to the Mediterranean and it was definitely an explosion of deliciousness.", "author": "Kelly N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-28", "description": "I still love the single pesto slice here, but I've found that there is a substantial difference between the quality of the per-slice pizza and a whole pie here. They seem to cook the in house pizza longer, so it ends up a bit crisper, as the last couple times I've ordered a whole pie to go it's been way soggy in the middle, such that you can't really eat it by hand. Kind of disappointing. At least it's still good for a late night snack run.", "author": "Tom H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-12", "description": "The pizza really isn't bad. I enjoyed it.\n\nThe guy who works there calls me \"boss.\" When I walked in this evening he was like \"what'll it be, boss.\" This made me feel like I was in control. I'll tell you one thing, if there were ladies around me when I bellowed out \"slice of pepperoni, chief,\" they would have been all up on my codpiece. The sheer bass in my voice alone would have caused a panty-dropping domino effect up and down Haight street. The pizza was ready in a few minutes. You should have seen the way I shook that crushed red pepper up on that slice. It was regular pepper when I first grasped it, but after a few vigorous shakes, I crushed that shit. I'm mad nice like that. The guy must have been some sort of prophet because that ninja knew enough to call me boss in the first place. I guess this was the mythic aspect of the pizza experience. I'll be honest, I was a bit disappointed that at no point did Prometheus bust up through door and demand hot fire. \n\nThe pizza gets 3 stars. I get funky.", "author": "N S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-17", "description": "The ultimate hangover food...for post-drinking adventures in the lower Haight. They know half the customers are probably drunk past midnight and craving a slice o' pie, but even when sober--their slices are still huge, slightly greasy yet satisfying and remarkably tasty, despite what all the mixed reviews say.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-25", "description": "This is my favorite place to get pizza in the middle of the night. I always get the veggie slice and the green peppers and mushrooms are usually still raw when it's ready. I don't mind. I just gobble it up, and thankfully I'm drunk enough not to feel guilty about all the calories, fat and carbs I've just consumed. Their huge, thick slices are perfect for absorbing all of the alcohol in my belly and giving me the strength to walk home. Does pizza taste better when you're drunk?", "author": "L. L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-20", "description": "It's actually not that bad if you let the grease pour off the slice for a minute before eating...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-04", "description": "it's a good slice by san francisco standards.   i never go to the lower haight bars but i imagine if i did, and if i left one drunk, the pizza from this place would be a slice of heaven.  i frequent this place bc it's near my apt and it's a decent $2 meal.\nit's by NO MEANS east coast pizza, nor is it deep dish or flatbread.  it's san francisco pizza, and by that standard it's pretty good.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-19", "description": "Pizza in 3 minutes. Not too bad - the hawaiian is actually quite good :) It's not my top choice, but it's open late and the guys are friendly.", "author": "linda t."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-05", "description": "Marginally tolerable \"holy shit I just left the bar, it's 1am, and I'm starving\" pizza.  I wouldn't even think of eating here sober, and often times I choose to eat nothing at all, rather than eat here.", "author": "Eugene F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-21", "description": "I was hungry so I grabbed a slice of plain. My sister got a slice of \"Haight\". Mine was alright, but the crust seemed a bit doughy. I'm used to a thinner crust perhaps. I tried a bite of the \"haight\" It had pesto, and bunch of other stuff, that was pretty good.", "author": "John P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-22", "description": "REALLY, when it comes down to it - mythic makes an alright slice. They get the job done. Though the pre-made cheese slice with 'fresh' (raw-ish)toppings and 'fresh' cheese melty drizzle might seem kinda gruck, I love it.", "author": "Danielle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-06", "description": "Mythic pizza earned a legendary high reputation among Lower Haighters by it's incredible tasty pizza slices. The place itself is suited next to some small dirty bars and the tiny interior lacks any kind of luxury, besides there are often huge lines of drunken youth people queueing up on the street, but don't let any of these issues turn you away from this place; while queueing at the first time, keep in mind this place opens up it's secrets only for the true believers. Once you've tried their incredible tasty pizza, you'll totally understand why those people are queueing there day and night. My personal all time favorite is the Tijuana slice which is why I'm so happy to living only 2 blocks away from this place. Besides it's often open until 4am which makes this place purely a life saver in rough times. Just be careful and don't go too often or you might find yourself there randomly at 1am waiting for your slice without realizing you're already totally addicted to probably the best pizza in the town, just like me.", "author": "Tamas K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-03", "description": "Everytime I'n drunk in the Haight I always think of this place, it's opened late and has what I want: booze sponge with both meat, onions and mushrooms! Solid~", "author": "Jonas D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-27", "description": "Not because I use to live in NYC, but because this should NOT even be called pizza...I mean its PIZZA - bread, sauce, cheese, meat, veggies, etc...well it seems as though Mythic did not receive the memo on how to make semi decent pizza...do not waste your money!", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-29", "description": "Okay, admittedly, I've never ordered a pizza from Mythic, I've just gone in for a slice.  Be advised: this is one of those places that does the recycled slice thing.  Yeah, they have a bunch of pre-made cheese pizzas that they use for those who just want a pepperoni or veggie slice.  That's right kiddies, they slap that slice of cheese down, throw a couple of pepperoni pieces or whatever you desire on there, put it in the oven for 10 minutes, and voila -- recycled slice.  Also worth mentioning, their pizza smells like shit.  I'm not exaggerating, this was confirmed by friends and strangers alike.  We thought someone had shit in the bar, only to learn it was some poor girl who had just returned with her recycled slice in hand.  Drunk or stoned, avoid this dump and go hungry.", "author": "DamnGringo X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-19", "description": "i dont believe i have ever been to mythic sober that i can think of, so based on that fact, this pizza is not that shabby.  Not great, by any means, but not terrible either.  It sorta reminds me of a crispy thick bread with tomato sauces a ton of toppings and lots and lots of cheese, perfect for a late snack, but not really a true \"pizza\".  Pizza is thin not \"chicago\", it's thin like in nj/ny.  Anyway, this place is okay if you've been drinking, but i dont think you should go sober because that would be dumb.  I kinda feel bad for the ppl that work there because a lot of dumb asses go there all drunk.  One time I saw these 3 guys that were dressed like they were in the mob, but one guy had a high pitched voice so it was kinda funny, so yeah i can kinda see how these guys are pretty frank at the counter when they take your order.", "author": "christopher h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-13", "description": "For delivery - this pizza is cheap and fast, but a little greasy. I prefer the eat-in option, or grabbing a slice after bar. The pizza holds up better when it's directly received from the oven.", "author": "Devi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-19", "description": "Nobody else likes this joint but dammit, when I'm beering up the Haight and need my pizza by the slice, I take a grilled chicken and broccoli, maybe some sundried tomatoes, bag it to Toronado or Noc Noc and it is perfection,closest to thing to a hammock in Costa Rica by the waterfall you can get at 1:30 on a Wednesday morning.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-05", "description": "If you're hungry or drunk and it's late - plus you're broke - then by all means get a slice here. $2.50 for a slice of cheese when you need a quick fix. For what it is - a hole in the wall pizza place surrounded by bars - it'll do the trick. I find myself wandering down when I get hungry late at night and I realize that I don't have anything in my fridge so I won't complain. You get what you pay for so if you're expect gourmet pizza and ambiance, then you should look elsewhere.", "author": "Surf R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-12", "description": "Good if you're in a pinch and can't decide what to eat.  Boyfriend lives near Haight and it''s a short walk from his place.  The only thing I'll eat there is the \"Haight\".  At least I think that's what it's called.  Vegitarian with a green pesto sauce...great hot, not so great the day after cold.", "author": "Sandee Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-22", "description": "I started frequenting this joint because it is conveniently located next door/across the street from the Lower Haight bars, and is stumbling distance when you need to follow up a night of excessive drinking with a thick, greasy slice of pizza.  It was nothing more than that.  But, the true test of good pizza, I started going there when I was sober, and really enjoyed it, particularly their Greco slice (pesto, olive, feta).  That's a slice I simply have to have at least once a month.  Turns out they do make pretty good pizza.  Big, thick, greasy slices that hit the spot every time.  Good stuff!", "author": "Zach J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-24", "description": "Slice by slice the vegetarian pizza is great!  I hate going to those places where they think canned veggies and overcooked vegetables actually taste good on a pizza!  Mythic uses fresh vegetables (iv'e seen the them bring them in and they are fabulous!)  The veggies stay nice and crunchy while soaking in the heat from the oven and cooking just ever so slightly on the top.  Mythic really makes an amazing veggie pizza, I am no longer satisfied by other places!", "author": "Katii S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-03-03", "description": "Man I'm drunk. Pizza sounds good... Hey, look who's open!", "author": "Michael E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-06-14", "description": "You can really only eat here when you are intoxicated and / or stoned. Otherwise you notice that you are eating bread with sauce and cheese on it. Gross. Open late.", "author": "kristen l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-24", "description": "Like any good recent college grad and new-ish Bay Area resident, I did Bay to Breakers on Sunday. Actually, \"did\" may not be the correct word for this context.  \n\nLike any good recent college grad and new-ish Bay Area resident, I dressed as one of 300 drunken smurfs and stumbled from 9th and Mission to somewhere in Golden Gate Park before I gave up on following the course of the race, took a leak in plain sight behind a bush, and wandered back home on Sunday. \n\nAt some point, I suddenly realized I had been so busy drinking that I hadn't eaten anything. \n\nMe: I am going to babble all sorts of nonsense and also admit things about myself that I would never even consider talking about while sober. Here I go!\nMy brain: I AM RAVENOUS FEED ME\nMe: Hey, I'm hungry. Let's eat now!\nYaf: But we are going to the grocery store\nMy brain: I CANT MAKE IT ALL THE WAY TO THE GROCERY STORE\nMe: I can't make it all the way to the grocery store!\nYaf: Okay. Let's get pizza.\nMy brain: NOW IS THE CHANCE TO ORDER SOMETHING UNHEALTHY \nMe (to brain): Please try to order something including a vegetable at least.\nMy brain: ARTICHOKES\n---five minutes later---\nMy brain: NOW I AM SITTING AND I HAVE PIZZA IN FRONT OF ME WHAT HAPPENED\nMe (to brain): We ordered pizza because you were hungry.\nMy brain: HAVE I BEEN EMBARASSING MYSELF \nMe (to brain): Probably. But everyone else is drunk too so it's okay. Just eat your pizza and try not to fall off the stool. \nMy brain: LETS BABBLE SOME MORE\nMe: (continues to babble) \n\nConclusion: I don't remember anything specific about the pizza. But it totally hit the spot after a morning of heavy drinking. And I was visibly plastered and did not get kicked out, which is always a good thing.", "author": "Liz G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-12-29", "description": "Pizza was bland, cold, cheese was barely melted on the top. You definitely need to be stoned, crunk or cleepy to eat here.", "author": "Patrick W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-09", "description": "Seems like it is the only place on Haight open after 2AM.  It was standard but relatively quick.  I expected the slices to be a little bigger.", "author": "Marcus E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-26", "description": "I was trying to surprise my friend with a pizza delivered to his door. So I called Mythic, told em what I was trying to do and gave them my credit card number topay so my friend would just get this amazing free pizza. Mythic said they would take care of it...\n\nMy friend was asked to pay anyway, and when I called to complain since they told me there would be no problem, they HUNG UP on me. Terrible customer service, small pizzas for too much money, and impolite staff.\n\nDon't go here. Try Escape From New York (upper Haight) or one of the many other places to eat on Lower Haight.", "author": "Shay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-06", "description": "This is what late-night pizza should be. Very affordable ($2.50), and so much awesome greasy cheese all over it. Lots of great toppings available, and great hours. I've only gotten pizza here, but I hear the subs are great too.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-26", "description": "Hot, tasty pizza that's perfect after drinking at Toronado.", "author": "Randall T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-29", "description": "mmmmm.  mythic.  mmmmmmm.\n\nSince I'm from Chicago, I feel that I am fairly qualified to judge this sort of thing.   For you born and raised locals, let it alone ... you just don't have the skill set. \n\n.... lighten up, i'm kidding.  sort of.", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-03", "description": "I'm apparently a two-toned white boy who lost his funny. I've eaten pizza here twice (or at least once, with the latter occasion being a bit of a chit-chat and salivate instead). You may have over-heard us. A cross-sectioned sample of snipits might include, \"breast milk with my breakfast cereal would be awesome! ...and cheap.\" Or the somewhat less appealing \"I was about to lose some staring contest, before grabbing his balls and twisting.\" To which the kid on the counter with the smarting face was quick to add, \"Well, that's not very nice.\"", "author": "Marc M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-04", "description": "Was looking for a good pizza place.  I found one!  They like to use a LOT of cheese, so if you want more of a normal/average amount, ask for lite cheese.  And, ricotta cheese is very very good on pizza, so think about adding it on the next time you order!", "author": "A L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-05-11", "description": "I like my pizza with a cooked crust, no pool of grease in the middle, and oh yeah....no freshly cut hair", "author": "Marz W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-26", "description": "I love this place!! Closest thing I have had to New York pizza in California and I'm from New York. Their pizza is huge.. big enough to fold and is made fresh to order. Also relatively cheap for SF. A+!!", "author": "Dan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-15", "description": "Mythic pizza is perfect when you come stumbling out of Molitov's or Noc Noc drunk as f'*#ck. At this point you don't care what you are eating and for some reason hot sauce splashed over greasy pizza is a good idea.  As strange as this sounds...it's true that Mythic pizza is known for having this watery cheap hot sauce in a ketchup squeeze bottle. You order whatever slice you want, then you sprinkle grated parmesan and splash some wierd hot sauce on your slice. When you're drunk and starving..this is very tasty.  Strange but true.", "author": "Glenn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-27", "description": "its the best delivery pizza in the lower haight/hayes valley area, to the best of my knowledge. and open kinda late too, which is great. the hot wings are not really very good, but that doesnt matter too much.\n\nso many nights i realize i dont have food in my apartment and its too late for anything else. and, of course, i'm too lazy to go anywhere. mythic saves the day again!", "author": "Dan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-26", "description": "The only pizza on Haight that I keep returning to. I was absolutely black out drunk last night, and found out this morning that I went there at 2am. That means I have to love it. Minus one star for too much cheese if you order extra toppings. But other than that, Damn!", "author": "Edwin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-24", "description": "Oh Mythic Pizza why are you so tasty when I buy a slice and so yucky when I order a whole pie?  I refuse to enter into such a deceptive relationship.", "author": "b s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-18", "description": "Pizza pizza pizza...this place is got a great slice....located in a great spot in the lower haight next surrounded by bars and smoke shops...this place is always a stop for me when im in the area", "author": "Joe M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-02-08", "description": "Open late and cheap. Cooks each slice to order, so nothing's ready to go quickly.", "author": "Billy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-19", "description": "It is 2am and you managed to survive Underground SF (aka The Top). You are drunk and your ability to walk is getting harder by the minute. You need food to stabilize the damage of the night. MM FOOD. Just when you think you can no longer step any further you smell the sweet smells of greasy cheese pizza. Its calling out to you in a romantic way. You can no longer handle it and bum rush in and order up a fat slice. \n\nYou get lucky and sit! This place is small but in your eyes it's huge. You are eating the pizza with one eye open while grease drips from the pizza and overflows on to your fingers, splattering the paper plate like an artists paint on a canvas. \n\nYou are drunk, you are satisfied, and more importantly you are eating. It may not be the best pizza in the world but at this exact moment you're thinking it is....... \n\nRepeating the steps each week will cause weight gaining.", "author": "Jay D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-04", "description": "Giant slices....tons of different types of slices to choose from (a couple days I had the Greco which is pesto and feta cheese...oh good!!) at a reasonable price and the slices come loaded with toppings and they come fast....and it's open late night to appease your drunken hunger.  However, I went this past week for the first time and I was neither drunk nor high....I know...surprising but the slice was still good.", "author": "David C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-20", "description": "For just a slice of pizza this place is DEElicious.  I love how they add the toppings to a generous slice of cheese and then they add extra mozzarella on top of the toppings before heating it in the oven... YUM.  The whole pizza's are alright but there isn't much cheese and a lil too much sauce.  Late night after hitting the bars on lower haight, try to hit it up, I always do.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-05", "description": "Wow...how can one call that pizza?  I do give it one star for being open late on the Friday after New Years Day when no one else was open, but I think I would have rather starved then feel the grossness entering my mouth and go into my tummy, then feel the pain hours later.  I also give it another star for excepting credit cards...especially when the pub across the street is cash only.  My bf and I got a slice each of  the meat combo thing which I think had pepperoni, sausage and 1 other kind of animal thrown on top of it.  I had to scrape the sausage off quickly as it looked greyish-purple, but pepperoni is pepperoni and you really can't go wrong there.  We didn't die and it didn't come back up, so I guess it is edible, but I wouldn't be stopping in again after a long drinking binge in that hood.", "author": "Ayrn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-13", "description": "Ok , it really should've been a 3.5 stars because now I have found a new favorite pizza place which I shall review soon.In any case, I found this place because they left one of those fliers hanging on the door, so I decided to give it a try. I love the Haight (pesto, spinach and garlic), it's juicy  with a bit of oil and that's a good thing. I've ordered it many a nights when you want something decadent. The hot wings are nothing to brag about tho. If you're getting it delivered, always mention you got a 'coupon for a free soda' even if you don't actually have it (tho you should if you have the menu with you)...", "author": "Rogerio F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-29", "description": "Ok, this place is not quality... and I'm from the east coast and lament the pizza quality out here... BUT i still have a place in my heart for mythic pizza because it's cheap and decent and i used to come here all the time  when i moved to the neighborhood. I like to order the cheese with green peppers and the peppers are actually quite fresh. It's also the closest place for me to get a decent slice- Cybelle's is no good for slices.", "author": "Kate A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-22", "description": "OK Pizza and convenient for the bars around the area. Little known fact: Their subs (especially Meatball) are way better than anything else on the menu.", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-11", "description": "The pizza is definitely better than some of the shit I've had delivered, but it's nothing special. Slices are cheap and there's a nice selection of toppings so you don't always have to order the expensive specialty slices. The dudes working aren't total assholes, and the only trouble you'll find here is from the people partying at some wack bar like Noc Noc. I used to live a block away, and that was nice, but I wouldn't travel far and wide to eat their pizza. I probably won't eat there again unless I'm forced to. This place is a neighborhood favorite and it's reliable. Try garlic and pineapple - my usual slice.", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-01-21", "description": "If it was possible to give it a lower rating - I would!  I was starving and craving pizza so  I thought I'd give Mythic a try. I wish I'd gone with anything else instead.  The crust was not deep as we ordered, and managed to be undercooked, overcooked and extremely soggy all at once. The sauce was virtually non-existant and what little there was, was tasteless.  The only thing in abundance was the cheese.  The large mass of oily, congealing, rubbery, low-grade, nauseating cheese.  I wished I'd gone hungry instead. Do yourself a favor and learn from our mistake.  Pass on Mythic Pizza.", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-15", "description": "It's OK. I have a friend that's crazy about this place, and subsequently insists on buying me a slice every time we pass through the neighborhood. Three free slices and I'm still not convinced that it's \"AMAAZZZZING\".", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-06", "description": "Great place to grab a slice when I'm going to trivia at Mad Dog in the Fog on Tuesday or Thursday nights.  I like how the pizza is a crazy festival of toppings and cheese, spilling all over the place.  Every bite is a delicious mouthful.", "author": "Levi B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-14", "description": "My local late night last resort eatery.  I wouldn't say the pizza is the best I've eaten, but it's a great alternative if your looking for a late night snack.  I haven't had the guts to venture into the other options but the pepperoni and the cheese is good.", "author": "Eric A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-07", "description": "For pizza on the west coast this is pretty good. I get the deep dish \"well done\" and it's decent. I'd rank it in my top 10 for sure. Probably top 3 for spots with delivery.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-10", "description": "Contrary to my friend's belief that this is the BEST pizza ever...I have to say that this place is pretty gross. The cheese is just way too thick and greasy. It even tasted like my pizza Playdoh set I had as a child. Playdoh even tastes better. I was drunk too! Even the shittiest food is supposed to taste like Heaven after alcohol consumption.", "author": "Shereen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-01", "description": "I know it's a chain but it's so good for those late night gotta-have-grease cravings! The slices are huge and yummy and for a girl who prefers Chicago-style pizza, I inhaled the floury crust of my combo slice of pepperoni, mushroom and sausage. The Boyfriend had an all meat slice and was just as pleased. The price is great for the size and while the guys behind the counter aren't going to win any congeniality prizes, who cares, so long as they keep the greasy goodness coming.", "author": "Christine P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-17", "description": "I would give it half a star  more because sometimes the pizza is decent. But this is a rarity. The crust is bad and the cheese smells REALLY bad when you're drinking @ the noc. My only other gripe is that if you order toppings they put them on top of a cheese slice and then put some more cheese on it on top of whatever else you've ordered. And they charge you for this? That's why I haven't been back there, plus I don't eat cheese and the vegan slice is expensive for what it is: a bunch of veggies on bread. I can make that at home (and I do!) Volare's is much better.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-14", "description": "Average, run of the mill pizza place. Their 'Haight' slice is pretty good--recommended.", "author": "Roman N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-27", "description": "This place is totally schizophrenic...sometimes the pizza is really, really good (four / four and half stars and worthy of dinner) and sometimes it's almost awful (barely two star).\n\n...at first, I thought the place was just randomly inconsistent, but then I noticed the pizza was in its best form when one particularly soft spoken guy was there...it's also pretty good when the owners are around...but otherwise it can be really disappointing if you're looking for a tasty meal...though at 2am and after a bunch of drinks next door, it's the best (and only) option.", "author": "M O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2004-10-14", "description": "The answer to munchies at 2am in the morning. Bad pizza always tastes that much better when you're drunk or stoned.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-27", "description": "Decent pizza becomes superb pizza after 2am in the lower haight", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-13", "description": "Decent pizza.  Best slice is the $2 plain cheese, then just dump your own hot sauce or ground pepper on it.  If you get anything with toppings, they seem to screw it up.  Either your toppings aren't cooked, or your crust is burnt.  I have never gotten a full pizza from here, only by-the-slice.", "author": "matt c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-21", "description": "this is bad pizza. and that's a lot coming from a girl who loves pizza. I was slightly drunk the first time I had it and hungover and craving something greasy the second time. (These instances were weeks apart thank you very much). One will eat some pretty awful things in both these states, so my conclusion that the pizza sucks should speak for itself. Here is my theory on how the slices are made: they cook a large cheese pizza, leave it out for a while, and then when you order a slice they pile on all the things promised for you particular selection (except of course, if the sign says bacon which they're out of, so they use ham, hoping you won't notice) and then they send it back through the oven for about three quarters of the time necessary to actually melt this second layer of cheese or sufficiently warm up the added ingredients. This results in an awkward mound of room temperature toppings on an over-cooked crust.... and then they are a little rude overcharge you. Same experience both times, different slices. Sad, this place is right across from where I live and while a late night neighborhood pizza joint is an excellent alternative to all the other weird things one might eat at 3am, I think I'll stick to home-made grilled cheese when i need my late night cheese fix. Two stars for not having any bugs in the pizza or giving me food poisoning.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-19", "description": "BEST PIZZA I've had in San Francisco.  My favorite is the Athens (pesto, artichoke, & garlic).  Decor is very very casual, but I don't mind because they let me be all loud in there & hang around for a long time.  Pizza is always extremely fresh.  Gigantic slices; one slice is always enough for me.  Fast service.  Highly recommended.", "author": "Tuesday J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-15", "description": "Nothing better than coming home after a night of drinking and grabbing a huge slice of veggie... pretty darn tasty.", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-01", "description": "Kinda trippy to be ordering a pepperoni slice from a Egyptian Moslem guy. Is it Halal with all that pork? Open late after Nikki's dancing.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-11", "description": "Blows.  So close to home that I used to eat there all the time but the crust is too thick and the sauce is average at best.  Still, used to be hard to pass when coming home hungry after a night out.  That is until we both got super sick after eating a slice about a year ago.  Pretty much done with this place.", "author": "J.D. P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-24", "description": "Their pizza is ok. At least by my california-reduced expectations. But their house special, the \"San Franciscan\", managed to mix feta cheese and mediocre pizza into an amazing taste experience.", "author": "Keith P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-10", "description": "At two in the morning after hittin' hard it is great, twelve hours later when licking your wounds it is great.", "author": "brian m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-03", "description": "Awesome pizza! theire is nothing to it! Great crust because it is fluffy and good toppings with a great selection of by the slice or a whole pie. Try their specials like Haight and Mythic. What you waiting for?! Eat some pizza here and drink some booze.", "author": "Manuel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-18", "description": "it was... i don't know... new years day or christmas eve or thanksgiving or some holiday. it was late. really late. we were hungry and had nothing to eat in our apartment, and a bit digruntled knowing it was so late on a day we knew every store in san francisco would be closed. but in vain hope we crawled out of out apartment in search of something to put in our bellies and luckily enough mythic pizza was open like a shining beacon of... wedge shaped bread and cheese i suppose.\n\nmy roommates and i prefer efny for all our pizza needs, but mythic is underrated in my opinion. it's quite delicious and i LOVE their generous portions of peppers and onions. the price per slice is standard, and their slices are huge!", "author": "Jenn R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-21", "description": "Word to the wise, do not go here during daylight hours or sober.  What may be perfectly acceptable to eat at 2 a.m. will horrify you in a coherent state of mind.  Disclaimer aside, the Greco slice is a delicious blob of feta cheese that essentially obliterates all other ingredients and makes you want to throw caution to the wind and risk that lurking E. Coli .", "author": "Celeste A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-24", "description": "The only saving grace for Mythic Pizza is that it's open late. When drunk, it's fine. Just don't go sober :)", "author": "Dave G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-08", "description": "Mythic seems to be incredibly hit or miss. When going in for a slice it's been mostly lackluster -- I once ordered a cheese slice with roasted garlic on it and the garlic appeared (and even worse, tasted) like it'd been sitting out for days. I wouldn't mind them spending a longer time getting my slice ready if it actually tasted like food.\nMythic pizzas I've had delivered have been much better, if only because they haven't been sitting out all day on a tray waiting to be snatched up slice by slice by poor souls on Haight Street. I'll admit my Mythic delivery taste has been limited to plain cheese pizza, so my knowledge is certainly limited. Some of their pizzas have perfectly hit the spot, others have brought out subtle groans from my housemates and me, usually due to the pizza being too greasy or undercooked. I'm impatiently waiting the day I find a pizza place who gets it right every time. Is it possible? I hope so.", "author": "ashley p."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-07", "description": "So my boyfriend and I are new to the Hayes Valley/ Lower Haight area and desperate for yummy delivery pizza. We tried Mythic Pizza tonight and were underwhelmed. The buzzer at our apt. building hasn't been programmed with our number yet, so we were waiting downstairs for our pizza. A car came to a stop in front of our building, and the driver hopped out and opened up the back seat door. But a perplexed look appeared on his face as he looked back and forth between an order ticket and the back seat of his car. He climbed back into the front to take off, but Andy asked if he was here for Mythic Pizza...? Yes - came the reply - but I forgot your pizza! Ha! I was amused but Andy was confused. The driver offered an additional explanation: he delivers for (at least) two different restaurants, a Mexican place and Mythic... and he only had Mexican food in his back seat. But he promised he'd be back quickly - and he was. \n\nSo honestly, the two stars aren't for the delivery mix-up, but for the mediocre pizza. We tried half pepperoni/ half sausage and mushroom. We requested they go light on the cheese per many earlier reviews. I'm not sure if they complied because there were pounds of cheese on the pizza. It was uber greasy, but filling and the red sauce was pretty tasty. I think I would only order Mythic again after getting too drunk... maybe not even then...", "author": "Liz W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-14", "description": "Don't be fooled - My five stars are not for the taste. But sometimes you need to give respect where respect is due. First off, for all the people that seriously hate on this place, I challenge you to list off other places around that serve you food at such late hours of the night. Maybe if other people started doing so it would create some competition and force mythic to up the quality a little bit. In the meantime, no alternatives means no bitching.\n\nThe pizza is cheesy, greasy, hot, and full of ingredients. The place is open till 3. You get served in less than 10 minutes. A slice costs you as much as one of the beers you were drinking earlier. The guys behind the counter are rude and yell loud. The people around you are cracked out or drunk as hell. What more could you ask for out of a late-night pizza place?\n\nI wouldn't come here anytime before midnight but there's no better way to end a night in the lower haight!", "author": "Raphael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-11", "description": "Okay - for all the haters (Starla, I'm calling you out) - this is the closest to a real new york slice you'll find on the west coast - what are you doing ordering all that sh!t on your slice anyway (and even when you're drunk, don't you read the ingredients? - they list them out.... \n\ni've been living in new york for 2 years now and eat slices all the time.  you don't have to be drunk to eat mythic.  and sassy, it did used to be called Mystic Pizza.  But they were forced to change the name a few years ago.\n\nAnd seriously, NOPA is good - cause that area did need to be named.\nAnd Jessica - you must LIVE for PIzza Hut and Domino's cause the sauce and the cheese make their slices.\n\nAnd yes, I did just create an account to set the record straight.  Go back to suburbia or get out of lower haight.\n\nps - sarah -- you rock.  wish more people were qualified to rate pizza.", "author": "left c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-16", "description": "This is one of my favorite pizza places in SF for a few reasons:\n\n1.  It's cheap\n2.  It's pretty good\n3.  fast delivery\n4.  Their meatball sandwiches kick ass\n\nI've only ever ordered delivery from here, never been there in person...and while the pizza itself isn't the best I've had, it's definitely pretty good, plus the sandwiches are pretty good too.  I think often times I look forward to the meatball sandwiches more than the pizza.  Anyways, low prices, pretty good food (especially if stoned and/or drunk), fast and generally nice service = a very good choice.  Not the best by a long shot, but worthy of mention for sure.", "author": "c b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-14", "description": "Not much in the way of restaurant atmosphere, but that's what makes it good. All really great pizza places in my experience have been sort of \"hole in the wall\" experiences and this one follows suit. Super awesome pizza slices, reasonably priced (for what you get). Perfect place to stop in and get a slice. Sometimes I'll walk 10 blocks for it.", "author": "Eric F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-14", "description": "Delivery Service...TERRIBLE. If 1 mess up - understandable. 2 out of 3 attempts gone bad - that is a problem. Ordered in from there at the suggestion of a friend.  The first time, after waiting over 2 hours, we called and got excuses. We finally canceled the order. The second time the pizza came without incident and it was pretty good. So I went in for a third  time. 2 hours later the supposed vegetarian Greek style pizza arrived as a meat lovers \"Haight\". Too late start over and call anywhere else. We called them and rather than rush over the correct one they insisted that the onethat we got was what we ordered and then said they'd send another correct one next time the driver went out. Driver must have never gone out again. Never heard from them again! They'll never hear from me again! when at the Toronado I'd rather eat a vegetarian sausage from the sausage place or a burrito.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-19", "description": "Mythic does a competent, affordable slice of cheese. That's what I (happily) get there.\n\nWant a topping on your slice? Sure, It doesn't make a difference - throw pepperoni or sun dried tomatoes on a slice before it gets reheated in the oven, and it comes out great - simple! \n\nHowever, let's say you want a specialty slice, one of the ones further down the menu. That's where the trouble starts. First you hand over $4.00-4.75 for ONE SLICE (this blows my mind). Then you receive back a weighty wedge with toppings just thrown on without regard to the noble cheese slice they sit on. It's like dumping a handful of steamed carrots on angel food and calling it a carrot cake. \n\nExample - on the ambitious, 4+ topping orders, the bottom has been severely overcrisped from the added cooking time of the extra toppings. Sometimes a whole bunch of plain mozzarella cheese is melted on top of the toppings, on top of the slice. It's cheesier, sure, but it's not backed up with any extra pizza sauce, thereby throwing off that CRUCIAL ratio on a sauced pie. It's for people who like toppings, not a properly double-cooked pizza slice.\n\nAnd then, take the pesto slice - good idea, right? Crust, mozzarella, pesto. Beauty in simplicity. Here, however, they take that same perfectly good cheese slice and slather on a mound of pesto. Red pizza sauce and pesto do not and have not ever mixed - I've experimented before and it makes sense that no other pizzeria has ever put them together and sold the result. It's a waste of a good slice and a LOT of pesto (they drown the slices in the green greasy stuff).\n\nI'll be back for slices of cheese here and there, sure. The service is friendly and attentive, and the quality of the pizzamaking is fine. But as a place that seems to earn its bread and butter from slices, there's a lot of improvement that can be made.", "author": "Party C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-01-21", "description": "This pizza is the first pizza I have ever not liked.  It is REVOLTING!    Why?\n\nThe crust on our \"deep dish\" was thin, oily and soggy.\n\nThe sauce was watery, limited and flavorless.\n\nThe cheeze was heavy, very heavy, and also flavorless.\n\nI'd rather starve....", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-04", "description": "5 stars for the Greco slice.  Piles of feta olives and mozeralla dripping with pesto.  After you are done you will be so green people will think you made out with Slimer.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-21", "description": "Only if you're so wasted that any food will do.  Doughy under-cooked crust with a horrible cheese/topping/sauce ratio.  I've pretty much given up on pizza in this neighborhood in general.  Even walking past it is a chore due to all the moronic drunks blocking your way.  Still, make sure to DO walk past it, not into it. Think to yourself, is it Mythic Pizza or Mystic Pizza? One sign says one name and the other sign says the other.  OK, game over, that was fun. Yuck.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-20", "description": "Ordered food, waited 20 minutes to find out that they forgot to make it, did not offer a discount, reminded them, brought only 1/2 the order and it was cold, waited another 10 min for second part of order... food sucked", "author": "ian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-05", "description": "As a native New Yorker - and an Italian one, at that - I'm particular about my pizza, and there's no place in San Francisco that comes as close to duplicating a New York-style pie as this hole-in-the-wall joint in the lower Haight. A couple of small tables are squeezed into the narrow space between the counter and the door; most patrons take out or call for home delivery. Create your own, or order one of their specialty pies. Ingredients are fresh and abundant, and you can specify thin or thick crust. Their Buffalo wings - slathered with perfectly seasoned sauce that has just the right amount of heat - are fantastic, and the Caesar salad with grilled chicken - topped with large croutons, freshly-shaved Parmesan cheese, and a thick homemade dressing - is as good as any you might find at an upscale restaurant. Not only is the food terrific, but in a city where it's notoriously difficult to get something to eat after 11:00pm, Mythic Pizza - in a neighborhood heavily populated by stoners with late night munchies - wisely is open until 2:00am.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-22", "description": "Mythic pizza satisfies the late-night-after-Toronado's craving.  The range of the topping list always amazes (and overwhelms) me.  In the end, I usually ask for pesto or pepperoni and walk out happy.   I appreciate the honesty of the establishment.  The place is no frills, but doesn't promise anything else.", "author": "Mai N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-07", "description": "convenient place to grab a slice and take it to-go as you drift to the next bar. very small inside and a bit pricey for a single slice. also, they don't have red pepper flakes. they do have hot sauce but i think a pizza place of this style needs red pepper flakes to complete the deal.", "author": "Leuwam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-18", "description": "mythic is cheap, decent pizza.  not too good, not too bad.  kinda greasy, but lemme tell ya - consistency is key. we've ordered from a few places around here, but mythic always delivers in around half an hour, and i'm never disappointed.", "author": "katie p."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-06", "description": "Pretty miserable pizza... Gooey nasty cheese, came out lukewarm. No flavor to it, just the bare minimum requirements to be called pizza. At the very least, it's cheap and fast, and the staff is friendly enough, but the food is just not there.", "author": "Carl T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-07", "description": "pizza is like sex: even when it's bad, it's good. with that said, mythic is good. not great, good. open late, reasonably priced, and they cater to drunk folks in the hood. i wouldn't travel from another neighborhood to eat here, but it's a fine choice if you're in the lower haight.", "author": "Mary V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-05", "description": "a ok pizza, overall, but it tends to be VERY greasy.  they use a ton of cheese, which is good.  i wish they'd cook it for slightly longer...the crust is often almost too gooey.  i got buffalo wings today, and they were a little burnt.", "author": "Patricia M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-03", "description": "Mythic has a funny way of never ever pleasing but only seldom disappointing... what do I mean by this? Imagine for a moment you are at NOC NOC and enjoying a frosty mug of chimay. All of a sudden the beer munchies kick into high gear and you're ready to chew on the edge of some welder's art project they call a coffee table over there. So you roll out with bills in hand to satisfy the hunger and you're faced with choices, well depending on time those choices dwindle drastically to just a few possibilities. Ah yes, Mythic, my old nemesis, comrade, occasional messiah but much more often: false prophet... So you go in get your meat mountain or veggie delight and you wait the obligatory x number of minutes staring at the Parmesan shaker thinking this might be a nice snack to tide you over until the box arrives. Finally after the eternity that comes nicely wrapped in another eternity your slices are served up. You can't wait for the box so to hell with it, your friends got your seat, you bite into your pie and the first wonderful taste of that crisp crust and searing hot cheese burn the entire roof of your mouth that mixes in with your topping of choice and you are in agony and ecstasy at the same time. Douse the slice with innumerable amounts of garlic, pepper, powdered Parmesan that passes for cheese and out the door you go. Three bites later you learn why the age of aquarius hasn't arrived yet, the bloody center of the pizza is ice cold, or that mountain of dog food looking stuff, I mean sausage, is actually still frozen too... yeah, that's happened waaaaay too often...", "author": "Len S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-21", "description": "great location for quick pizza. being next to bars is for sure gonna give you some business, and yes, mythic does come through. very fast service and the slices are pretty big. well priced also. but certainly nothing close to great pizza.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-10", "description": "been going here for years. hella bomb pizza at a good price. make sure u holla at the hot sauce because it really makes the mythics pizza a mythics pizza. i hate tryin to find parking but double park in front works well. oh plus there open pretty late for a coo little snack/meal", "author": "Jeremy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-08", "description": "their pizza is pretty weak. the only flavor comes from the free hot sauce they give you. seriously, why not make some real topping pizzas and warm those up? this whole \"cheese pizza + toppings + more cheese\" formula doesn't work.", "author": "Greg A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-23", "description": "ok,  who puts these districts on here??  this is in the low-low (as in lower haight).  when did the lower haight become alamo square, when i wasn't looking?  i lived in the lower haight for years.  we're a proud people, low haightians, and i think only the gentrifiers would try to call it something it is not.  rant off.  sorry, this pizza place is only mildly ok.  if you're in \"alamo square\" and can handle a walk in the hood, go to volare pizza between filmore and webster instead.  yummy late night pizza.  also, it is not in hayes valley, it is in lower haight.  i mean, is lower haight no longer a neighborhood??? ok, i'll stop now.", "author": "Cami B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-28", "description": "Without a doubt, the absolute WORST service and communication EVER!!!  Ordered a pizza from a flyer posted on my door in SF one night, with friends, and 2 hours later, still NO PIZZA.  After approx. 10 phone calls and speaking to numerous different people, still NOTHING!  I live on Rhode Island St. in SF and they could not find my building!  After finally speaking to a supervisor and very aggravated, 2 hours later, he said I should be patient, it can take time on a busy night!  Patient???? How long does it take to get a regular pizza delivered!  DO NOT waste your time or MONEY!!!!!", "author": "Rick V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-02", "description": "Okay, maybe there's something wrong with me, but I love, love, love Mythic Pizza.  Two bucks for a giant, greasy, cheese slice!  I think if you go in expecting grease and possibly copious amounts of cheese, you won't be disappointed.  Their crust is nice and thin, and their slices have just the right amount of sauce.  The guys who work here are nice, and the slices are, as the sign says, usually ready in two minutes.  And I'm going to go ahead and say that I like the squeeze-bottle of pesto.  All in all, you'll find a nice calorie-to-dollar ratio here--that is, you get plenty of calories for practically nothin'.  Down with the low fat, low calorie, low carb crazes!  Live it up!  Eat greasy pizza from Mythic!", "author": "Alyson Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-25", "description": "i have been to many places, i have eaten many pizzas. no pizza anywhere ever has been as good as this pizza. east coast, west coast north coast, i dont care, nothing compares.\n\nAND THE HOT SAUCE IS LIKE KISSING A GIRL FOR THE FIRST TIME.\n\nanyone who does not agree that this is the best pizza in town does not agree with me and has different tastes! THESE PEOPLE WILL BE SMASHED BY MYTHIC GODS. like apollo and stuff.\n\nsuper fast, super cheap, super good, i have oft contemplated doing a super size me style diet of just mythic pizzas, i think by the end i will be super strong and super rich because 250 meals even 3 times a day is cheaper than one sandwhich downtown. or some crap piraat pizza(cant spell pirate right? ASSES)\n\nanyway, this place is a palace of pizza.", "author": "Raccoon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-01", "description": "tasty pizza.  i think i got the haight?  the one with pesto and fresh basil and tomatos and maybe mushrooms and tons of garlic.  my boyfriend loved that....it's also super convenient since it's right next door to toronado, which might have some of the best beers ever brewed.", "author": "Jenny Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-10", "description": "garlic pizzzzaaaa droooooool.", "author": "C S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-16", "description": "mythic pizza is great because it is close to toronado and mad dog, so when you have a craving after drinking, you can hop over and order pizza by the slice.  they're open late AND they deliver.  their pizza is outstanding; fresh toppings and a thin crispy crust.  try the \"mythic\" pizza, their special....mushrooms, pepperoni, green peppers and onions.  sweet and satisfying.", "author": "regina k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-07", "description": "I love this pizza.  i'm no connossieur of pizza, but here's my resume, short as it is:  i love frou-frou Cheeseboard Pizza in  Berkeley; ditto Gialina's with it's fabulous crust that i actually eat every bite of; i like Zachary's when in the mood for thick-bottomed, which is not very often - once every couple years, tops; have been to NY and enjoyed the slices of pie you can fold in half and eat standing on the street with grease dripping from your hand; AND lived in Italy for 5 months, where i have to say, i had pretty bad pizza, almost everywhere we went - BUT i never made it to Napoli, which is supposed to be pizza Mecca.  (And we tried making our own, which was woefully received by our Italian neighbors.  Of course, we were hampered by the fact that we ran out of gas in our gas oven and had to run the half-baked pizzas in the rain under umbrellas to the neighbor's house to finish cooking!) I even like Mr. Pizza Man, because i like any pizza place that offers me little pools of grease in each cupped pepperoni slice, a subset to which Mythic belongs.  Plus, it's cheap, as everyone agrees, and you can take your slice to Molotov and wash it down with a T&T, extra limes, while making out with your boyfriend.  what the hell is wrong with that?", "author": "maria a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-04", "description": "i got delivery and the food was edible but not good and they forgot part of my order. if you do order from them check the order before the driver leaves.", "author": "Travis V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-10", "description": "Great pizza, the crust is one of the best in san francisco, open late , favorite pizza slice is the haight, spinach, garlic, mushroom, pesto and fresh parm cheese..ummmmmmmm", "author": "Maloni Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "best greasy slice in Lower Haight. just don't eat it off the floor. not that i have seen anyone do that...", "author": "brandon b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-03", "description": "overall, the pizza is a little bland... but... a slice of pesto does me right everytime.", "author": "George R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-25", "description": "For awhile, I couldn't tell if the pizza was ACTUALLY good, or I was just very drunk from the bars when I would eat it. Going back during the day sober, i found my assumptions to be true. The pizza is shitty, and is only amazing when i'm plastered out of my mind. However, yesterday my dear little boyfriend who lives across the country decided to buy me a pizza and have it delivered by surprise, and then called to let me know. They told him a half an hour. Over an hour and 15 minutes later, after calling three times and having them lie to my face and say the driver had left already (i live literally three blocks away), the very RUDE delivery driver showed. He asked to see the card. Now, I know this is standard policy (to see the card to confirm it), but my boyfriend is not a fucking idiot. He asked them if that would be okay, and just to rush him off the phone (this is a usual thing), they didn't listen to him and just said yes. All I said to the driver was \"oh, i thought he told you\", please hold on for one second...\ni went to my room to find an alternative method of payment, (transactions can take a couple minutes sometimes..), and i came back, and he left!!!! HE LEFT!!!!!!!!!!! Outraged and hungry as hell, I went down there to give them a piece of my mind, only to be yelled it in a bunch of jibberish i couldn't understand. I WILL NEVER NEVER NEVER GO THERE AGAIN AFTER THIS. Granted I was drunk most of the time, but i dined there 3-4 nights a week. they all know me. and to be treated like absolute crap as a regular customer who wasn't even a big fan to begin with, is the end of the line. I can't believe such a shithole treated me as if they didn't need my business.", "author": "veronica g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-28", "description": "i'm pretty sure it's called mythic pizza because using real ingredients is unknown to them.", "author": "parker t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-30", "description": "cheap spot for pretty good pizza. i think the real name for this place is gothic pizza. if you look at the sign at the right angle it looks like gothic pizza. so i call it gothic pizza. get a couple slices and head next door and sip on some real good brewskies.", "author": "Wats C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-27", "description": "chicken parm sandwich was suspicious meat - maybe the worst chicken parm sand i've ever had. two stars for letting me suffer thru it with a good beer at toronado (next door)", "author": "Mister Z."}
