{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Probably my all-time favorite shabu shabu joint. Similar to the original location near GGP, Nabe is at the top of the list. Why? Here's why:\n-Beautiful location and interior. With a clean 'wood' interior and sake bottles on the wall, this place provides a great atmosphere to eat in. \n-All of the broth choices come with ingredients already in the pot! Except for shabu shabu, where they put it aside for you.\n-One of the only places in the city that gives you a raw egg for dipping with your sukiyaki. For those who never had sukiyaki before, you cook your meat then dip it into a raw egg, and have that thin layer of egg cook off the burning meat right inside your mouth. Sounds kind of gross, but trust me, you'll love it. \n-They have a wide selection of sake, if you're into that.\n-Good dessert selection. They have this butter mochi cake that comes out warm and melts in your mouth, yumm! \n-Appetizers are also great. The gyoza is bite-sized and super crispy. \n-They make an after meal porridge with your remaining broth at the end. Super filling and rich in flavor. \n-Great service! The wait is never too long and although they might be slightly understaffed sometimes, they still do their best and provide great service! \n\nOverall, I love this place and would recommend this place to anybody.", "author": "Jenny N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Nab a spot in line at Nabe and it will not disappoint. Having lived in Asia, good hotpot in the states is a rare find. You crave for the hot soup during those cold days in SF - \"the coldest winter I ever spent was the summer in SF\" - yet you do not want the chemical ridden; msg pervaded; overly salty variants that are all over town.  You want something legit - a light broth that warms the soul and body from the insight out.  Enter Nabe. \n\nThe hot boiling pot. The company.  The joys. But which pot to get? Each is so wonderful in its own right. My picks?\n\n(1) The spinach and tofu salad.  I like the sesame miso dressing lightly blanketing the fresh, irony spinach, with the bits of tofu for soft texture and silliness, and sesame on top. Japanese salads are simple yet so complex at the same time. \n\n(2) Kimchi hiyayakko cold tofu.  The silken tofu is creamy and cold. Set against the sourness of the kimchee and the spiciness of the chili soy, it is a palate teaser to start a most enjoyable meal. \n\n(3) The duck (kamonanban). My favorite is the duck nabe because you get a row of high quality, thick slices of duck that beautifully line the surface of the dashi infused broth underneath, slowly extracting the juices of the duck and marinating the pieces of leek, onion, and vegetables.  \n\nWhat I also like is that each nabe is in fact 3 meals in one - representing the lifecycle of a proper hotpot. There is the first stage of satiating that anticipation for the hot, boiling soup with myriad of flavors streaming down your throat like a river of magical zen garden soup.  Then, the stage at which the flavors integrate with each other and infuse the noodles (in the case of the duck nabe, the soba noodles (the type of noodle will depend on the nabe selected)).  Last, there is the stage when the flavor concentrates even more, with the addition of rice for a soft texture - add to that egg for richness and green onion and seaweed shreds for that extra kick to round out the flavors.  \n\nThe cost is what makes this place all the more enjoyable.  At around $24-$30 a pot in SF, for this type of quality, there seems to be an element of mystery (or belevolence?) behind the nabe. \n\nI like this Iocation better than the one in inner sunset because it is more comfortable - modern, more spacious, with more thoughtful design.  The staff is always very helpful and kind.  \n\nI suggest going during weekdays or off peak hours - or simply making a reservation to avoid the long wait. \n\nNabe, nabetcha I will be back soon again!", "author": "Vivienne K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-17", "description": "Great place for sukiyaki. Portion is slightly light but it's so delicious! Service is super friendly and attentive. Ambience is also very cozy and chic Japanese.\n\nAfter you're finished, the servers will make porridge out of your leftover broth. Cool concept but.. I thought it was a little gross that each table only gets to use one person's leftover broth for everyone's porridge. I came with a close friend so it was totally fine. But I'd definitely pass on it if I went with coworkers or something.\n\nWe also tried their popular mochi cake, which I thought was unique and fragrant but honestly not my favorite thing. But I can see the appeal still!", "author": "Mandy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-04", "description": "Nabe overall is a good shabu shabu joint. The location is beautiful, although they had to keep the front door open so that it didn't get too hot inside, so most customers were huddled as far away from the door as possible. Service was very light, mostly because there were only two servers who were expected to take orders, deliver food, bus tables, and deliver checks for a very full restaurant.\n\nQuality of the food itself is very good, but I would hesitate to go back until there are more servers at Nabe so we aren't waiting 25 minutes to get our order placed.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "Soup and fresh goods in the soup, for the win!\n\nNice broth and adequate selections of choice meat and veggies to be put in the broth.\n\nWooden decor and wide selections of sake. \n\nThere's a side area for private events. \n\nSpacious room and healthy meal.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-24", "description": "I love the idea of a Japanese hotpot. The service was terrific and ingredients were fresh. The broth unfortunately was too salty - I went towards end of their opening hours so may be a one time thing. Their dumplings were great though'", "author": "Paul L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-09", "description": "Solid spot for Shabu in the marina. It's not all you can eat but meat quality is high. Choice of different broths. Liked both the beef and pork. Normally I don't like Shabu pork. The seafood was interesting, but might not get it next time. \n\nGreat place to meet up with friends like 4-8 people for an extended, longer meal. \n\nHouse sake is cheaper, but the other options are pricey, yet good.", "author": "Young Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "A delight. All the makings of a good shabu place: a gray, foggy city (out of their control but still, kudos), a bright, airy dining area, and smooth, pale wood galore. As I walked in, I instantly felt like zen master. My heart was calmed by the sight of my fellow patrons sipping gently at their broth, steam enveloping their pink faces. \n\nThe sets were adequate for 2 small but extremely hungry people, although I would recommend adding extra meat. Vegetables-wise, things were definitely on the fluffier side (ie. a large mound of spinach magically transforms into 3 stringy leaves in the water), and lacked any exciting or out of the ordinary delights. I hungered, specifically, for more tofu. \n\nThe dipping sauce was a yuzu-y, ponzu-y delight. The real star of the show though was the porridge the server helps you make at the end of your meal. Rather than feeling shamed for my inability to consume all the resources so graciously placed in front of me, I felt celebrated and rewarded. No one agreed with me, but that porridge was fucking delicious eaten cold the next morning. \n\nSmall downside to this place is the intimate smaller shared tables. Would recommend coming here specifically with 3 friends to avoid this fate. Aesthetically, however, keep that shit up.", "author": "Will Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "While Nabe isn't the highest value place, the decor is beautiful, the service is friendly, and the food is overall enjoyable.\n\nWe got the duck and beef large platters, and the portions were enough to get us to a happy full. You'll have plenty of room for desserts or snacks around the area, which is probably a good thing. Meat quality was much higher than other AYCE places, but I'm not fully convinced they're worth the significant premium. Everything else was just really average.\n\nIf I'm craving hot pot but want to sit down at a nicer place with a date, I can see myself coming back to this place!", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "Delicious, clean, and nice staff.\n\nAlways walk out of here, with a very happy full tummy.\n\nKeep up the good work!", "author": "Lev E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-24", "description": "Please don't say \" Japanese \"\nIt is not totally Japanese!!\n\nTheir soup is not good\nJust salty \nNothing Umami....\n\nWe never put all food in the nabe same time....", "author": "Iguanatte S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-18", "description": "Went to get ice cream around the corner and came upon this place for dinner. \n\nThe decor of the place is just so unique which is filled with different sake bottles on the wall which made the dining experience even more delightful. We ordered a sukiyaki pot with the A5 wagyu beef upgrade (add on items: Enoki Mushroom, Fried Tofu, Daikon, and Udon) and the specialty sampler sake flight. I really like Japanese sukiyaki pots and this place definitely did not disappoint. The broth was perfect and the only complain I maybe have is that the fried tofu is not actually fried tofu, more like fried tofu skin/curd. And after we finished the pot, the server made us rice porridge (zosui) from our leftover broth, which was just the cherry on top! The rice porridge was so amazing I finished my portion even though I was so full after finishing the pot. It was a in between of the Chinese porridge and risotto texture, which was so creamy as I'm writing this review I'm getting hungry just thinking about it.\n\nIt's a pretty pricey place for shabu but I'm definitely sold with the delicious food and exceptional service. Loved everything about this place!\n\nP.S. my favorite sake from my specialty sake flight was the Joto Yuzu!", "author": "Sunny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Fun place. A bit noisy. Spinach salad was pretty awesome also. Good service. Good food.", "author": "Umut I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-31", "description": "This place is sooo good. I came here with some friends not expecting much because usually I'm not a fan of Shabu since most of the places I go to the broth is pretty bland and there's nothing that really capture my taste buds.\n\nBut the broth here is amazing. We got the Shabu Shabu Wagyu beef with Spicy miso broth and added the duck and a side order of the Kurobuta Pork Sausage. Everything was super tastey... \n\nBut the best part of all was at the end when they added rice to the leftover broth to make porridge. \n\nIt does get really busy so definitely call in to make reservations! You can make reservations on their website as well, but please note they do not open until 5pm so you will get a call sometime around 4ish to confirm your reservation. It's advised if you're making a reservation for the same day to just call in. \n\nThis place has changed my whole perspective towards shabu. Will be returning again!", "author": "Milton F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-10", "description": "Nabe remains the top in the hotpot/shabu category in San Francisco. Quality ingredients (both the meat and the vegetables), delicious and diverse broth types, and filling post-meal rice porridge to stock up on additional carbs. \n\nCome here when the weather and mood are gloomy to cheer yourself back up into a smile - and bring friends", "author": "David Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "This place is a MUST on a foggy day in the city... which is like everyday!! Came here with 4 friends and were immediately greeted as we entered the door. \n\nService: (5 stars) Great service. Everyone was very attentive. Even before we realized we needed a refill of water the servers were already there. \n\nDrink: (5 stars) great drink options if you're looking for quality and drink. Really great quality sakes. Also if you drink beer would highly recommend HOLY CRAFT. Local brewery that has fantastic tasting beer. I tried this beer first at the Giants ballpark Pub and was pleasantly surprised when I found it at Nabe. Goes really well with the shabu, super refreshing. \n\nFood: (5 stars) quality of the beef is unmatched in the city. You can get A5 Wagyu beef and I would definitely recommend trying it! All of the broths are quite delicious. I've tried the Kimchee, Miso (spicy) and Sukiyaki. Definitely recommend getting two broths which will then come with 2 meats if you're having dinner with at least one other person. \n\nNote: If you're vegan the miso broth is made I think only with mushroom so it would be a great option. \n\nAt the end of the meal they have a finisher which is the broth mixed with rice that they make into a congee like dish. Super delicious. Try your best to save room for this. They add egg if you want and also seaweed and green onions. \n\nIf you're looking for a good quality place for shabu I would highly recommend this spot. I will definitely be coming back here.", "author": "Mel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-11", "description": "Definitely warms the soul on a cold day! Came on Sun evening and luckily there was no wait. We got the spicy miso shabu with waygu beef and the duck breast broth. The spicy miso was actually not that flavorful- just sort of spicy tasting. The meat quality was quite good- we had to get another order. The duck was a bit too tough for me, the broth flavorful- but not my favorite. The veges, udon, and soba were great- no complaints. Towards the end of our meal- we had to ask for the rice porridge- but we used the duck broth and it came out way tooooo salty! Couldn't finish it unfortunately. Overall- decent food, really great ambiance, sleek modern minimalism- Japanese. Good service. Would return!", "author": "Vivian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "For date night, my bf chose this place because he knows I love shabu and hot pot. It was a quick Uber ride from union square, but the Uber dropped us off behind Nabe, so it was a little confusing at first. \n\nService: 5/5 - Once we got to Nabe (around 7pm), there was no wait & we didn't need reservations. I love spicy food, so I opted for the spicy miso soup.. but my bf's tolerance for spicy is pretty low. The server was so nice and said if it's too spicy, she can swap out the spicy miso broth for miso broth, which we ended up doing. It was free of charge!\n\nFood: 4/5 - We ordered the large shabu set with a side of pork belly, 2 bowls of rice and the ginger beer shoju cocktail & grapefruit shoju cocktail. The shabu and pork belly was yummy. At first I was worried we would still be hungry.. but after the meal is done, they bring out a bowl of rice to mix in the leftover soup to make porridge! After 2 bowls of porridge each, me and my bf called it quits on dessert too. We were too full. \n\nI'd come back", "author": "Anna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "I am a once a week hot pot/shabu type of person and Nabe is definitely one of the good ones for me. I actually like that they have set menus, it makes my life much easier as I'm usually extremely indecisive. I love the quality of the meat here and the broths are very tasty, all in all I am a fan!", "author": "Jenny E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "Nabe is one of my favorite shabu places for their zosui porridge at the end of your meal and the option of having mochi ($4) to add on. The zosui porridge is basically when they use your leftover broth and add in rice, egg, green onion, and top it with seaweed. You can really taste all the flavors of the meat and veggies in the zosui.\n\nI love ordering their standard shabu shabu with beef with miso broth and I've recently been not eating meat and ordered the mushroom shabu with udon (just as delicious for all my vegetarian friends). Great with a bowl of steamed rice and sesame sauce (request it- it's free).", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "+clean, cool interior with communal seating and also regular tables \n+short wait\n+reasonable prices\n+they make you porridge at the end \n\n-lacking flavour in the seafood hot pot\n\nMy friend and I walked past this Japanese hot pot restaurant after an event at Hotel del Sol. It was either this or Mel's diner and we figured the quality of food was more worth it at Nabe for just a little bit more $$$.\n\nNo regrets! \n\nThere were still lots of seating when we came in at around 8/9 but it quickly filled up after we were seated. It was about a 20 minute wait for our food to get to our table and then a bit more to cook. \n\nWe got the Large seafood hotpot; our waiter recommended the large to share between two people but I think you'd be okay with the regular especially if you get dessert or tend to drink lots of water with your dinner. It came with salmon, clams, veggies, noodles, and 1 bowl of rice (ordering another is extra). They give you sauce on the side.\n\nYes, as you've probably read from other reviews, they make PORRIDGE with your leftover broth/ food right in front of you at the end of your meal. It was really good and even though we were already full, we couldn't resist eating most of it.\n\nPrice- it was about ~19 per person for two people for the large seafood pot, including tip. Reasonable for SF. I'll try the meat options next time, as the flavour was lacking a little bit in the seafood pot.", "author": "Jed Mariz N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "Was visiting the beautiful city of San Francisco for my birthday. As a soup lover, I wanted to try something different. \n\nThe atmosphere is really mellow and minimal with a trendy setting. The place was set up really nicely. I love how they use a flat power stove to heat the pot.\n\nMy girlfriend and I shared the Large Shabu Shabu. The only difference in size is the amount of meat you get. The veggies and meat were really fresh and good. The soup tasted average IMO, it was very light and healthy. Although we ordered spicy, it didn't challenge me very much.  \n\nOverall, the food was really filling, and very enjoyable. They actually bring more rice and create rice porridge for you on the house with your left over soup once you're done eating. Our total came to around $25, which was decent when you're sharing the hot pot.", "author": "Derek D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "We walked in before the dinner rush and got sat immediately! They take reservations here too. I've had a couple of shabu places in SF and nothing comes close to Nabe. I'm used to how shabu is in OC with all the fixings (green onions, garlic etc). I had to ask for it here and they were happy to bring it out and guess what?! THEY HAVE HOT DROPS!! The presentation here is clean and precise. The veggie plates are smaller than I had hoped, but the porridge at the end made up for it.\n\nService was extremely attentive. All the girls were friendly especially Mai. Thank you girls for the hospitality!", "author": "Tracy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "The Shabu Shabu Wagyu beef is delicious--fatty but not too fatty. My favorite part of the meal would have to be the porridge at the end of the meal, where they cook the rice in the broth adding eggs, scallions and nori. Service was great too!", "author": "Rene C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Amazing shabu shabu hot pot experience. Been too many Syabsu-Syabsu places across the world and this one is up there as the best. Now if they only franchised!!", "author": "Joe R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "Came here with some friends - we've all tried the Inner Sunset location, but this location has a different vibe. I didn't feel like I was getting a steam facial, for starters!\n\nThe food and sake were great - between us we tried all three styles of broth and loved all of them - super fresh meat and veggies, great sake selection.\n\nNice ambience too - stylish environs. Will definitely go back to either location with an appetite!", "author": "Mi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-02", "description": "Overall, drinks and service are great, but food is not memorable nor delicious. I would stop by for happy hour if I'm nearby but wouldn't return for the food again.\n\nThey have 3 choices of Sake flight(each has 3 varieties) for $18-20. I got the one with yuzu, which is arguably my favorite drink of all time. Never met an yuzu sake I don't love. I could highly recommend.\n\nAs far as food goes, we ordered the shabu shabu with Wagyu and spicy miso, duck breast shabu, and  an extra side of mushroom platter. You don't need to order the mushroom platter because you get a free side dish with mixed mushrooms, mixed veggies, and udon, but we were not warned about that. The shabu, in my opinion, is so flat and bland, especially the spicy miso base. The wagyu beef cooked in there didn't have any spice/flavor. It was really watery, under seasoned and not spicy at all! We cooked everything in the duck breast side as the result. The sauce they provided tastes oddly sour and failed to provide flavor and saltiness. I suppose it is healthier that way? But come on, at what cost! \n\nRecommendation: Sake flights, avoiding miso soup base", "author": "Tata X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "My favorite shabu place in SF. Last time I spent a week in SF for work, I went here 3 times. The porridge at the end of the meal is sublime. Get the beef shabu and the tsukiyaki!", "author": "Amy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-03", "description": "Ok this place is overrated for sure. I don't understand what's the hype about. My friend and I came after a local friend recommended this place, 4.5 Yelp stars, sure why not. \n\nService: 3 servers weren't enough for a busy Monday night apparently. We waited a while for someone to take our orders. And we waited a while to get our food as well. \n\nDecor: Modern, clean and new. Sure, I'll give you stars for this. But the ventilation sucks here. The server had to open the window next to the entrance cuz the whole place got so foggy and stuffy. \n\nFood: We ordered sukiyaki and shabu shabu. The wagyu beef was too lean. The texture was not tender or juicy even I barely cooked it. Sukiyaki soup was too salty and left a nasty aftertaste.\n\nAnd the most disturbing part was that my friend found a MOVING bug within her raw spinach. Ewwwwwww!!! Ok I understand it happens but still pretty nasty to see that moving creature on your plate that you almost finished. \n\nWe pointed it out to our server and they didn't charge us for one serving. \n\nAnyway, we will definitely not gonna come back. This place is overrated.", "author": "Maria S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-17", "description": "Great service , servers were very helpful in orienting  a newcomer to a new style food preparation . Great food and beautiful restaurant", "author": "Susan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "Came here with a group of 14 for a friends dinner and everyone seemed to enjoy their meals. I ordered the seafood option and added a mixed mushroom plate and a mixed veggie plate. By the time we finished, the boyfie and I were STUFFED. We each ordered a bowl of rice, so not sure if sharing one order is enough for one person.\n\nThe broth itself was a little bland, but the dipping ponzu-y sauce made up for everything. They also made porridge for us with the leftover broth. It was just ok. Again, a little bland.\n\nThis place is pretty upscale looking for a hotpot place and the quality was pretty great, but it just wasn't WOW. I'd come again, but not something I'd pick on my own. Service was superrrr slow.", "author": "Anna M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-21", "description": "The ingredients were fresh, but there's nothing Japanese about this nabe at all.  The soup was just miso, I could not taste any dashi.  It was sweet and buttery, which some may like but it cannot be called Japanese.\nAt the end they give free zousui which is nice, but the staff mixed up the egg.  It should be cooked with a cover and let alone without stirring.", "author": "Dan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-09", "description": "If there's anything missing in SF it's more sukiyaki spots. Nabe offers different meat combos for your hot pot cravings. Each combo comes with vegetables, rice and rice soup. I recommend getting a large, it's big enough to share for 2. You can also order a la carte as well. \n\nFood:\n\nSukiyaki and a side of pork belly - The broth was nice, it wasn't too heavy and there was an abundance of flavor. I liked having a raw egg as a dipping sauce. The cuts were semifatty. The pork belly was chewier. The glass noodles complement the meal pretty well. \n\nWhen you wrap up, a rice soup is served. \nThe rice soup is made by your server. It's fun to watch and it was a good way to end the meal, kind of like a detox. \n\nIf you're up for splurging they do offer premium wagyu beef. \n\nDecór: I first saw Nabe by Inner Sunset. It's a very different layout/vibe compared to the Cow Hollow location. The one at Inner Sunset has a karaoke bar vibe with dim lighting. The glass windows were fogged up from the cooking. The one at Marina has a casual minimal vibe with bright lights and white walls. I guess it's designed according to neighborhood. I was pleased to find that prices are the same at both location. I thought it'd be a little higher in Marina.\n\nOverall not too shabby for a hot meal on those cold nights in SF!", "author": "Virginia Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Tastes so good in my mouf. And the staff are amazing. Also cute enough to want to chat with for longer than you would expect", "author": "tony b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "I went to Nabe in Sunset a few years ago and fell in love. But now that they opened this new one in The Marina, I was dying to come back to try! Although I made reservations for two at 6pm on a Tuesday night, we were the only table there. Better safe than sorry though since this place does get incredibly packed! \n\nMy friend and I shared the large Sukiyaki ($31), which came in a pot of mixed veggies, wagyu beef, one egg, and one bowl of rice. We also added an order of ramen noodles ($3), which we could've done without either way. The amount was surprisingly perfect for two, especially when they finish you off with the porridge. I love how thinly sliced and marbled their wagyu beef was --definitely of a higher quality, which made cooking it super easy!\n\nAlthough this place could be just another shabu spot, the Sukiyaki broth and porridge are the true winners here. Do not underestimate a sweet broth if you've never tried it. Absolute must try because once you have, you'll be hooked! As for the ending bonus, make sure you have room left in your stomach for the porridge. At the end of the meal, they mix rice into your leftover broth to create this amazing porridge topped with egg, green onions, and seaweed. It was so goddamn delicious that we each had another bowl of it --thankfully there was still enough left!\n\nI can't wait to be back! And for the price when sharing with another person is a great deal. They allow two people to share per pot, which makes for a good meal unless you're a huge eater then you can always add to your order.", "author": "Cindy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "After hearing some friends and family rave about Nabe for quite some time now, I finally decided to pay a visit. Coming in a little after 5PM, I was able to beat the dinner rush and be seated right away. It got pretty busy as I finished up my dinner, so I'd suggest making a reservation beforehand.\n\nI decided to order Shabu Shabu with miso broth and wagyu beef. Compared to a bunch of other shabu places I've gone to, I'd say that the quality of the meat was on the higher end. It was definitely fresh! \n\nAt the end of the meal, the server offered rice porridge. Give it a try! It consisted of the leftover broth, rice, egg, green onion, and seaweed. In my opinion, it compliments the over overall meal!\n\nBottom line - the food is delicious, and the service (from my experience) is exceptional. Nabe is my favorite shabu restaurant by far!", "author": "Krysta S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "Located on Lombard, Nabe is hidden next to the neon lights of Mel's diner. There's a large communal table and several separate tables. Inside is clean, modern, and cozy. \n\nService is pretty good - definitely seems understaffed. Might be helpful to put recommendations on the wall next to each table on when to put in what vegetables (like cabbage and squash first, udon noodles last, etc). \n\nThe broth is good and fair portions of meat and veggies for the regular size. You can also pay to get extra goods. The porridge at the end is amazing! \n\nThis is definitely not your AYCE get drunk hot pot meal - this is a classy shabu shabu restaurant.", "author": "Shelley K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "I really love the modern design of this hot pot place.  You might even miss it at first.  Walking inside reminds me of a japanese bathhouse!  \n\nHot pot is rather expensive (~25 or more per) in most cases but the value here is great.  They seem to have about 4-5 hostesses who handle all the work in terms of taking orders.  They are really responsive and nice.  The food is quite incredible, as I feel with most hot pot places.  This specific restaurant allows the guests to cook the meat and vegetables in the pot in front of you.  Depending on the broth you choose, a different selection of meat and vegetable will incur. \n\nThe meat selection is great, we had the wagyu regular and pork belly.  The meat was tender and works well in the broth or on rice.  As a finishing touch, they turn your leftover broth into a porridge teeming with the flavors of the boiled vegetables and meat you've just consumed!  \n\nI did not order drinks but they had a great selection of bottled japanese beers and a few draft options as well. \n\nGreat hot pot for Chestnut!", "author": "Joel Christian A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Two of us shared a large shabu shabu with dashi broth.  Loved it !  Highly recommend.  Restaurant has communal table as well as tables.  We called and booked for 7:30 on Friday.  When we got there, restaurant was full and buzzing.  We got seated right away and were very happy to share a large set between two of us and had a spinach and tofu salad, so good !", "author": "Jennifer Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "What is Nabe?  Basically it means \"things in a pot.\"  \n\nWe visited this location on a weekday and found that there was no wait around 6pm.  We were seated immediately as we pretty much already knew what we wanted to order.  I ended up ordering the duck while wifey went with the shabu.\n\nBoth were served with different dipping sauces.  They definitely complemented the broth and meat that we each ordered.  The server was very descriptive and ensured that everyone in the restaurant knew how to cook everything.  The duck was super tender and I loved the other ingredients served with it.  They strategically placed the longer cooking items on the bottom of the pot.  The shabu was decent.  Not the best we've ever had but definitely appreciated the simplicity of it all.  \n\nThe best part of our meal?  The porridge that the server makes at the end.  Pick a broth and watch them make it before your eyes.  We went with the duck side as he described it as being more traditional.  It was delicious!!!  I couldn't help but go back for the rest that was in the pot. I'd come back here just for that.  \n\nStreet parking available.  The place is a little hard to spot as the exterior is black without any signage.  At one point, I couldn't figure out where the door was.  Haha.  Just keep that in mind as you are looking around for this spot.  4 solid stars.\n`", "author": "Jen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "This place is probably a 3.5 star, but I'll round up. \n\nI love shabu so was excited to try Nabe. We decided on the sukiyaki and shabu shabu nabemono sets. They were good, but not great. I have to admit, I expected more. The sukiyaki was not as flavorful as what I was used to. I felt that there could have been more vegetables and bigger slices of beef. The udon was soft and soggy before even putting in the broth (my biggest pet peeve).The congee was good at the end, but I felt like it was overly- hyped. \n\nBeautiful space, good service, but probably wouldn't return for the food.", "author": "Peggy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "I love Japanese Shabu and this place is definitely good. The layout is unique and efficient; basically a rectangle where the servers can walk around the whole place. They have bathroom at the front, kitchen in back, beers on tap near front, and seating down the middle that doesn't have back rests and it's a big long communal table that's split into sections...it's actually a really cute compact place. Even the opening is this huge black steel looking door without a handle you just push it but apparently there's a lot of that in Japan so it's pretty cool they keep it authentic. \n\nAlthough this place is good, it can get pricey if you're super hungry. Food was actually really good meat and sauces but the one thing that was starting to annoy me was the slow service. Food took awhile to come but we at least expected the hot sake to be fast but we had to remind them 2 more times before we got it. The wagyu is the best but the pork belly is actually really good also. \n\nAsk for the sesame sauce since they don't automatically bring it. They bring the ponzu by default which is good too but great to have both, especially if you're saucy!!!", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "I'm still thinking about it and I ate here last week. So glad to have shabu in the marina. Going back SOON!", "author": "M W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "3.5 stars, with huge potential to become 4- very happy to have found a place to get good shabu shabu!\n\nThree of us shared two regular-sized beef shabu shabu with traditional kombu broth (since they say 2 people max per set), which surprisingly was big enough for our smaller stomachs. We purposefully went with kombu (vs. miso or spicy miso) b/c it's not too strong to overpower all other flavors, plus you get dipping sauces for the meat/veggies to flavor them before eating.  \n\nProbs the best part of the meal is the rice porridge at the end, using the broth used to make the shabu shabu so that the porridge has tons of flavor- make sure to accommodate for this finale!\n\nI was kinda surprised we still got a pot divided into two even though the two orders were the same, since it was a little difficult for the three of us to maneuver two sides of the pot (maybe they don't have bigger pots, but this is a minor point).  \n\nService could have been a tad faster in the beginning- we waiting maybe 20 min before even the broth came out.  It might have been because we came during peak hours but once they got the food out, things began to speed up service-wise.  \n\nThat being said, this is a great little gem in the Marina district- can't wait for my next visit!", "author": "Audrey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "Foods:\n+ I enjoyed the overall taste of the dishes. The duck breast sukiyaki was an interesting dish but would love to have more meats on the side.  \n* The sizes were a bit like 1.5 person sizes. Too much for 1 person, but not plenty for sharing portion. \n* The rice porridge at the end of the meal was nice addition. But we had 2 nabes that time, yet we only got rice porridge made from one of the 2. Wish we were given instruction if we could only get it from 1 broth. \n\nOverall, I don't mind going back to try to some of other dishes.", "author": "Rafael W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "I wouldn't compare this place to an authentic shabu or nabe spot, but it is a favorite restaurant I enjoy coming to regularly with my boyfriend. Service is good, the rice soup at the end is a nice touch and homey, and I like how they let you switch noodles to ramen. The meat is average for shabu meat, and vegetables are ok. Haven't tried other things. Restaurant itself is cute, but the bathroom is super weird (the door does not fully close and it is literally in the middle of the restaurant so it's pretty awkward!", "author": "Amina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "Very limited seating and really steamy inside but it works if it's cold outside! \n\nI think the quality of the meat is a lot nicer than other ayce hot pot spots around town. The broth is delicious too, we got the kimchi and the sukiyaki broths with beef. Two larges were more than enough for three people and they also make you a rice porridge type thing at the end with remaining broth.", "author": "RachEl L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-27", "description": "I have mixed opinions about this place - we went during their first few weeks post opening on a weekend, so maybe this can be an exception. The wait for dinner was about an hour, if it were not because we are leaving SF the next day, we might have skipped this place. But we patiently waited and got seated a little longer than what we expected. \n\nPlus points on the interiors. Neutral pallette, feels very balanced and modern. My only complaint is the ventilation system - something feels odd with the air here, I felt there was no circulation so it gets very hot over time. \n\nWe got the Kamonanban and Sukiyaki. They were a bit saltier than my liking, but loving the Porridge as the final dish! The veggies are of good quality and the mochi sides are a nice textural highlight to the entire meal.", "author": "Alicia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "Delicious but pricy. Ordered kimchi pork belly. It has the best flavor among all flavors ordered at our table.", "author": "T G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "Le bf and I came here when I was somewhat sick. I thought that by eating Japanese hotpot, it would make me feel better. \n\nWe ordered:\n1. Pork Gyoza (6 pieces for $8)\n2. Shabu Shabu with beef in Miso ($21)\n2. Shabu Shabu with beef in Spicy Miso ($21)\n\nWe sat at the center \"shared\" table. After sitting there for an hour, my back was not having any of it because we were forced to sit on benches with no back support. Many people ended up changing tables because nobody wanted to sit on the benches. Next time, if there is space, I would want to sit a table against a wall, because those have actual chairs with backs. \n\nNow onto the food. Everything was flavorful and I have no complaints in terms of the food. This place can be a bit pricy when you compare it to those AYCE places that can be around the same price per person. At the end of the day, was there enough food per person? I think we both could have ordered another portion of beef to be really full. My favorite part was the Zosui rice soup at the end that they make from the leftover broth. Once you cook all the veggies and meat in the broth, the broth just tastes so much better. \n\nLe bf and I would both come back. I tend to like the Japanese hotpot style more than the Chinese. We we will make sure to order more beef next time.", "author": "Carolyn Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "Stopped in for a late dinner with a friend. Had not been here before. The space is really beautiful - comfortable, casual, nice ambience. Also very clean and modern. \n\nThe menu is very flexible - you pick what type of dish, and then can add in other ingredients. We were having trouble deciding about what to add in, and the waiter very nicely suggested that we could just order as we go, adding in condiments as we ate. Fantastic idea. We started with the cold tofu and kimchi, which was delicious and balanced. We both love it. (And my companion doesn't think she's a kimchi person.)  We also ordered the large Seafood Yosenabe. The broth is absolutely delicious, and there were generous amounts of seafood, mushrooms and vegetables. It was lovely as is, and though we had multiple servings, we couldn't finish the whole pot. We also ordered a side of rice. That was nice, but I was underwhelmed. (confession - I almost alway prefer Haiga rice (half milled - between white and brown and much more flavorful than regular white rice, but still soft, and yummy.)  The Yosenable was served with glass noodles, which were good. However, the amount of noodles was underwhelming. Would have liked more. Each of us got just a tiny portion. Maybe the chef wasn't paying attention?  Anyway, that's my only complaint. I will definitely return. The price was reasonable, the service was overall serviceable. And I have some nice left-overs.", "author": "Carol M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "My new favorite Japanese Shabu Shabu place [4.5/5] Be prepared to wait if you didn't a make a reservation beforehand. You do have to old school call the restaurant to do that as they don't have an Opentable presence yet. \n\n[Nabe]\nI've tried the Sukiyaki, Kamonanban, and Spicy Miso Shabu Shabu. The Kamonanban is definitely something special I've never had duck in hot pot before (I always go for lamb), but the duck meat used was great quality and extremely tender. The sukiyaki wasn't that special for me, I enjoyed the high quality beef used, but didn't really like the soup broth that much. I would recommend splitting your pot and at least trying to get the Spicy Miso Broth. The duck came with soba and the sukiyaki and the Shabu came with udon. I like the nice mix of napa cabbage, spinach, mushrooms, and tofu that also came with the set. It really makes the congee that is made at the end from the cooked broth taste way better after the servers add rice! I always have a problem of overeating at hot pot meals (especially at Chinese hot pot places), but I left Nabe comfortably full and satisfied from the rice porridge at the end. \n\n[Drinks]\nGreat sake selection and the restaurant also has cold Asahi on tap. Great shabu pairings!\n\n[Service]\nI definitely feel that the place is understaffed. This probably is because the restaurant just opened and they don't have a feel for crowd control yet. However, all the servers were really nice and performed super efficiently given the demanding environment of shabu diners. I put my name down and one of the servers told me the wait would be one hour; however, ten minutes later after I had driven away, they told me that a table had opened up. I was kind of annoyed, but my desire for hotpot overwhelmed my need for instantly gratifying my stomach so I did a quick U-turn and sped right back. I'm really glad i did. \n\n[Decor]\nOne long table surrounded by smaller tables of 4 and two. Only downside that is if you are seated at the long table, it is hard to hear your dining companions over the noise. Nabe is pretty noisy. \n\nI'm really glad I got flat fares right around the time I discovered Nabe. I'll be Ubering over to the Marina way more often now.", "author": "Alice Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-04", "description": "This place has great hot pot and is excellent for a large group. This was the first time I had been here and I came for a work event with 25 other people. We sat in the middle of the restaurant and every 2-3 people shared a hot pot or two of their choice. They have great sake and an excellent suggestion of food as well. I recommend the pot stickers, pork belly and wagyu for hot pot options. We had the spicy miso stock which wasn't that spicy so a good option for sharing.", "author": "Carol Ann V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Wow, this is seriously one of the best shabu places I have been to! Obsessed and will be coming soon :) \nReasonably priced for yummy wagyu beef, yummy gyoza and when they make the rice soup at the end with the remaining broth, it's the best part in my opinion.", "author": "Hannah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-23", "description": "I made reservations ahead of time because I thought it would be super packed. I saw a person in front of me and they got rejected or the wait was super long for a wait. I knew I wanted to come here because I wanted that porridge that everyone kept posting about. You can order the main entrees which can definitely be shared with two people. I would order an appetizer too just so you can be full. I ordered the shabu which was good. There was a good amount of meat and veggies and at the very end, they use the leftover broth to make the porridge. It actually wasnt as good as I thought it would be but it did help to make us more full.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-26", "description": "The place is good, but not great. I went on a Saturday night, it wasn't terribly crowded, so that was good. But I'll get down to the specifics:\n\nMeat/Broth - I got the beef sukiyaki (one of my favs). The broth was standard, and the meat was okay. For the 'wagyu' beef, it was not quite tender and a little tougher than I would have expected for shabu beef. I feel beef I can get a XFY or Shabu House is better quality. \n\nVeggies - Good selection. Except they put it all in the pot for you before they bring it out. This causes two issues: 1) it takes forever to boil the broth now, at least 10 minutes of us sitting and waiting. 2) some veggies will get very soggy because you're not usually going to eat them all at the same time (i.e. pumpkin, napa). I can see a reasoning for this being that they want to save table space, but I'd much rather have my veggies come on a plate so that I can cook them as I want.\n\nRice porridge at the end - this is good! I love the addition of egg and negi. It's a good, cheap way for them to fill you up and use some of the broth at the end. Nice addition.\n\nService was good, clientele is very Marina however, so if you want a normal Shabu experience, I'd try Shabu House as well and pick what you like best.", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-12", "description": "I love the food at Nabe and was excited they were opening a bigger location in the Marina, but my experience last night was a massive letdown. They were severely understaffed and that made the whole process painfully slow. In fact, we spent a total of three hours at the restaurant so it basically took up our whole evening. The host was doubling as a server, and the other servers were impossible to flag down.\n\nFirst off, you'll want to make a reservation. We waited close to 1.5 hours and were hangry, to say the least. We ordered as soon as we were seated and still had to wait 45 minutes for our food to arrive. I think I heard someone being quoted a 2-hour wait toward the end of the night. The party next to us had to ask 3 separate people for the check.\n\nI will say that if you like Japanese hot pot, the broth and ingredients here are high quality. I love shabu shabu in general and Nabe is one of the few spots in the city that I know about. The sukiyaki is a great mix of beef and vegetables, and the complementary rice porridge at the end is an excellent way to end the meal.\n\nThis location is much bigger than the Inner Sunset one, but they need to double the staff and streamline their process if they want to make customers happy.\n\nOverall, the food is good but the experience was SO bad that I will probably wait a long time before I return. Please, Nabe, get it together!", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-08", "description": "We came here on a Friday evening to celebrate my best friend's birthday. This place serves traditional Japanese hotpot, along with flavored hotspots that's not so traditional. The ingredients are all pretty standards for a hotpot place, and they're good quality. At the end of the meal, they'll ask if you want to use the leftover broth to make broth. Definitely go with that option if you have the stomach space to spare! We used the duck hotpot leftover to make a delicious porridge. The only downside is the hotpot sauce. I asked for a peanut or sesame based sauce, and they were very watery. Overall, really decent hotpot place. And they take reservation!", "author": "Sharon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "Great ingredients and good service. Reservation is highly recommended if you want to be seated right away. I had the sukiyaki and the soup was very delicious. Spare some room for the porridge at the end.", "author": "Craig W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "Excellent hot pot! Portions are are very large so make sure you go HUNGRY!", "author": "Saba M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Best shabu shabu I've ever had. Meat is so fresh and the sukiyaki broth is to die for. Appetizers are delicious as well. Very cute vibes. One of my fav restaurants ever!", "author": "J M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "I absolutely LOVE Nabe on 9th and Irving, so it's no surprise that I also loved their Marina location! We got super lucky with parking, right out front! And it was very easy to make a reservation! I brought my family here (8 people) and we sat at the middle communal table. My only complaint really would be that the stools were a little uncomfortable because it lacked back support. Not great for my grandmother, but I'm sure we could have requested a normal chair. \n\nThe service here is fantastic! Nancy was our server and she is so great! She is always quick to take our order and checked in on us to make sure we didn't need anything! \n\nWe ordered the beef Shabu Shabu dinner and Kim Chi with Pork Belly. Everything was delicious!! Our favorite part of the meal is always the rice porridge at the end! Definitely worth saving room for! \n\nWe'll definitely be back soon! :)", "author": "Taylor W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-29", "description": "I haven't had shabu shabu in so long, what a treat!!!!  The decor is modern, fresh and clean.  Casual and cozy.  The service was fine, very busy!!  I would definitely go back.  Wish I could find shabu shabu on Long Island...", "author": "AM W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "This is my favorite shabu place. Not for value, but for quality and personality. This isn't the all-you-can eat kind of place, but I always have left full and satisfied. Everything tastes fresh and clean. \n\nMy favorite is the sukiyaki. The broth is so flavorful I don't even need sauce! The porridge they make at the end is the perfect finish.", "author": "Meredith M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "This japanese hot pot is definitely a cut above the rest. For starters, I really enjoyed the door entrance more than I should have (it had no handle and reminded me of restaurants throughout Japan). \n\nAfter being seated, I noticed the layout of the restaurant was quite efficient and allowed the waiters to easily move from table to table in one large circular pathway; this meant you saw them frequently. \n\nWhen it came time to eat, the meats were arranged very carefully for presentation and were quite tasty (wagyu and kurobuto), the broth (spicy miso) was delicious, and the complimentary porridge they make at the end is much better than it seems like it would be. \n\nDefinitely going back again!", "author": "Drew R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "It's been a long time since I've had shabu shabu and this was the right place to come to! Super clean and absolutely cute. The food was nicely served in fair portions. Family style pots, not individual. Several broth choices. Many vegetable and noodle options with some good protein choices. We had the seafood pot and the shabu shabu pot with beef. Assorted mushrooms was yummy! Have the fried mushroom because it's spongy and soaks up all the flavor, but be careful not to scald your tongue. Save some room for the complimentary rice porridge made table side with your leftover soup. \n\nFreezer was broken so we weren't able to try the ice cream selections.\n\nI had a Japan mule which was refreshing!\n\nInterior was clean and simple. Faux concrete on the walls, a large community table in the middle with smaller tables on either side. Comfortable modern chairs at the tables, community table has wood stools.", "author": "Ly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "Great new restaurant in the Marina area. Nabe serves Japanese style hot pot. You order your preferred meat and soup combination from the menu, and cook your food in a pot of hot soup placed on a burner on your table.\n\nWe ordered a regular sized shabu-shabu with beef and spicy miso. We got a plate full of fresh veggies and a plate of thinly sliced meat that cooked quickly in the hot soup. Your meal also comes with a complimentary rice porridge they meals at your table with the wonderfully flavored soup that you're left with at the end of the meal. At only $21 for a small shabu set we thought this was a great deal for the two of us and we were stuffed by end meal (we're moderate eaters, heavy waters may want to opt for 1 order per person).\n\nService is great and inferiors are super sleek and cool, will definitely be back here again!", "author": "Anna B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-25", "description": "You definitely need to make a reservation for this place, people sit here for a while and it gets quite busy. The flavor of the soup base was good, the food was good, but I didn't feel anything was extraordinary. The rice porridge they make at the end is a fun and unique way to finish off the meal, but by that point, I am already quite full. The place is kind of pricey, but the ambiance is cool - a modern-ish style. The servers were friendly, so that was good. I think this is a worthwhile place to try.", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "I love this spot. The service is great. It's an experience coming here. The food is delicious. Get the pork gyoza, garlicky edamame, and the wagyu beef and shabu shabu w pork.", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "After a weekend in wine country we returned back to the city for Sunday night supper.  All I could think of was a bowl of hot broth.  I always stay in the Marina with a friend and it is common knowledge that area of town is not known for good options of Asian cuisine.  Nabe popped up on my Yelp radar and I though it worth a shot.  Upon arrival we were warmly greeted by the hostess who sat us immediately.  The modern interior could have been a little stark for a cold winter night but she sat us in a cozy corner which was just perfect.  We were promptly waited on and given some tips on best approaches to order.  Selections were made for cucumber and octopus salads to start and the Seafood Yosenabe with the spicy miso broth and the Kamonanban (duck) for main. I ordered Sake as well and when it arrived I realized I had ordered unfiltered instead of filtered.  I told the waitress I had intended filtered and clearly made a mistake on my end.  She said it wasn't a problem and immediately replaced it without issue.  \n\nThe food arrived and we were in awe.  Fabulous seafood selection and enticing duck floated atop their respective broths nestled in veggies.  After about 10 minutes of cooking we dove in.  Both equally flavorful but distinctly different, I could not decide which I favored.  The fish was delicate and the duck tender.  Veggies were fresh and cut perfectly so as not to be overcooked.  At the end of the meal when only broth remained in our hot pot the waitress approached and said they finish off with broth with a rice porridge.  We opted for the spicy miso seafood version and began the creation of rice, egg, a little more broth and a finishing garnish.  It was divine!  Rich, velvety, tender rice porridge.  A perfect way to finish an outstanding meal.  I can't wait for my next Nabe experience!", "author": "Lacey W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "High 3.5 overall, with lots of potential to become a 4 star joint!\n\nI haven't been to the original Nabe - I actually called to get a reservation for my 12-people family, but was directed to this location instead as they said seating would be easier and more likely.  I was pleasantly surprised by how easy it was to make a reservation - just make a call and say the time you'd like to eat, and voila! I was also impressed that there was a followup call to confirm, as well as the advice to move the reservation slightly back just to guarantee our table. \n\nThere's still no signage on the outside of the new Nabe yet, so keep your eyes peeled! Parking wasn't too hard to find, and there's some seating at the front, as well as easy access to the bathroom while you wait.  We were promptly greeted and given an estimate on when our table would be ready, and it was pleasantly warm with the small of shabu shabu. \n\nThe aesthetic inside of the restaurant is really modern and homey with the wooden detailing - very Japanese and warm. I particularly love that you can see down the long table in the main middle area, and I'm sad that my party didn't get to sit there :( \n\nAs I haven't been to a proper shabu shabu before (and I did mention that to the waitress), it would have been helpful to have a rundown on how it works.  She explained to me what to order, but didn't mention how things would come out (I didn't realize, for instance, what veggies came with what, do I put everything down at once, is the meat still coming??), what's the typical way to do things, how pots are split, etc.  Food took a little bit to arrive - we were seated around 7:45 and we still hadn't received our broths, meat, salads, or anything by around 8:15.  We were actually wondering if there was extra preparation required for the broths or if it'd actually be cooked at the table... but when the food did come, it was good!  We had the spicy miso broth, the kimchi broth, and the soy broth, and I think I liked the kimchi and soy broths the best.  Meats were of great quality, and my favorite meats by far were the shabu shabu beef and the pork belly!  Special shoutouts to the udon noodles (these noodles were ridiculously good for some reason) and the mochi (this comes with the kimchi/pork belly platter, and becomes so soft and delicious after being boiled).  \n\nEven if you're really full, get the rice porridge that they make at the end!!! I wanted to try it because I was so skeptical of previous reviews that had mentioned it, but it really was a great end to the meal.  \n\nThere definitely are still some kinks to be worked out, as there are with any new restaurant.  For instance, they had shortages on bowls and had to collect our bowls from the table to give us our sides of rice (not a big deal, but a little noticeable since I had used my bowl already).  Also they ran out of miso after we had ordered, but came by to offer us replacement broths instead (it would actually be really helpful to have a rundown of the different kinds of broths somewhere on the menu?)  Also, that weird delay between sitting down and getting our food - I'm guessing shabu shabu should be fairly quick with coming out, but I could be wrong! \n\nService was really fantastic, though I would love to have more outgoing service (especially since this was my family's first visit and we had no idea what was going on).  Carol, the manager at this location, was incredibly polite and patient, and answered all the questions that we had.  My brother did note that we were an exceptionally large party and probably would have received better service if we weren't divided into two tables.  \n\nOverall, a very good meal (my cousin is telling me to mention that she and her sister really, really liked it, and that I burned my tongue multiple times forgetting how hot the food was), but with some things that still need to be improved a little bit. I hope to be back, maybe to the original location next time.", "author": "Cat D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "New favorite hot pot place! \n\nFirst, the design and finish of the interior was welcoming and pretty modern. I really enjoyed the environment. \n\nService was great too. The servers that helped us were friendly, and never rushing or curt. \n\nWe started off with the pork gyoza and those were delicious! My boyfriend and I got a split pot of the duck breast in dashi broth and wagyu beef in spicy miso. I highly recommend both! The dashi broth was not too salty or too sweet and the spicy miso was simply satisfying. I love duck and usually eat it more on the medium/medium rare, so it was my mistake the keep the meat in the broth for the entire meal. It was still very tender so that's probably why I didn't bother too much. \n\nI also love the fact that they offer sides of mochi as an add-on. I once had udon with mochi in New York and was obsessed with it. I have yet to find a place in the bay where mochi is eaten with a more savory/broth meal. \n\nThe porridge they prepare for you at the end of the meal was also a nice touch. We decided to have them make it with the spicy miso broth and that was a great choice because of the kick of heat. \n\nVery solid restaurant and I will definitely be back.", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "This restaurant was a big surprise.  We ordered a Shabu shabu with miso base.  The regular Waygu beef was exceptional quality.", "author": "Stink C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-27", "description": "We had a pretty good visit here. I went recently with my husband and two other friends. Our waitress was very unfriendly, after we left we all remarked that it seemed like she hated us (not really sure why - we were a mellow and happy group)! \n\nWe had mentioned right away that we had never been there and weren't really familiar with hot pot in general. Despite that, she provided no help at all to acquaint us to what we should do with the stove, when to put food into the pot, or any explanation of the menu. When we asked these basic questions, she sort of just huffed about it and didn't explain. \n\nThat said, we figured everything out, and the food was pretty good! We had the kimchi with mochi. It was spicy and flavorful, but only came with 4 small cubes of mochi, which was sort of disappointing. We also ordered it with pork belly, which seems to have just been regular strips of bacon (like you'd have at a diner breakfast), whereas we were expecting thicker cut pork with some fat on it. However, the assorted mushroom ad-on was great and a generous portion. \n\nMy group also did the basic sake flight and one other flight. It was a little confusing which way the chart went in terms of knowing which we were tasting. (Our waitress seemed very annoyed, yet again, that we asked which way the flights were organized.) However, the selection was delicious and well varied for both! \n\nOverall, the food was pretty good, the service was fine but not friendly, and the space was really nice. I would personally try some other places before going back here, but wouldn't object to an invite to this restaurant.", "author": "Jane G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-20", "description": "About time they open a second Nabe since their original location always seem to be really packed. Making a reservation for this place is as easy as their original restaurant, just have to call in and WALA, we're in. Parking is slightly better but given that it's in Marina, I'd say we probably just got lucky.\n\nThis new restaurant is definitely a step up, it's bigger (not an significant increase in number of seating) in terms of more square footage per person. It's not as stuffy and say no more to condensation on the window. I can finally breathe better and not soak up that shabu smell since ventilation is better.\n\nLooks like they transferred some of the original staff to this new location. At least I'm not being served by new trainees, needless to say, the staff is great. Even when the restaurant is getting packed and they're running around, they still manage to stop by our table to ask how we are doing.\n\nThe only drawback is that the meat took awhile to come out. Given that this place is new, I'm hoping they will smooth out things in the kitchen so it runs smoother and faster.\n\nThe food itself is still good. Everything seems fresh and honestly I have to give myself some props since I'm doing most of the cooking. I will definitely come back!", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "Fantastic experience, high quality and definitely a go back for more place. Love the rice porridge at the end. Good sake selection.", "author": "Denise W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Great service great deals on shared shabu. Meats were generously portioned and follow up orders also great. Alcohol a bit highly priced..A small portion of sake was more than price of the dinner itself but otherwise no complaints here.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "The place is nice, a bit higher end which the Marina needs.   A few doors away from Mel's diner.      It is solid Shabu (Japanese hot pot where you dip fresh veggies and meats to cook them at your table fresh.     Though in Japan they do the cooking for you).     It's a good value as you get a ton of spinach, cabbage, mushrooms, sprouts, and more with your meat - Kobe beef, chicken, shrimp, pork....for a reasonable price.    \nThe only issue is that the pot is quite steamy so just be ready for that.     Good place.", "author": "chris b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "Amazing food! My first time eating hot pot and it exceeded expectations by far! Make sure you have a reservation.", "author": "Sonja B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "Hands down the best shabu shabu in the Bay that we have tried to date. Fresh veggies, good quality meats and tasty broths for the hot pot. They leave the best for last with the table side porridge...it's included and optional, but a must try.", "author": "Alex B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "Great aroma and light setting. Very neat and on point. Waitress was very friendly and took great care of us. The food came out very quickly. Food was spectacular", "author": "Jezreel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Great place for some hot pot. When we went we were only table but it was an early weeknight dinner. Tried to go back on a Friday during prime dinner hour and really long wait. For a good reason though, waitress was really nice and seemed to like her job. Will return!", "author": "C M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "The ingredients were very good. I didnt like the atmosphere that much. Too modern and not cozy. But this is my personal taste.\nSake and beer was good too.", "author": "Bla B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "I can't recommended this place enough. Nabe's food is so clean and filling. I seriously could eat here every night. Love the sukiyaki and miso the best. And pro tip: dip your cooked meats in the raw egg THEN the ponzu sauce. It's is a winning combo.  Also, be sure to keep some room in your belly for their signature Zosui (rice porridge). F-Ing fantastic.", "author": "Marissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "This place was pretty sweet! It's a small hole in the wall spot that's still upscale enough for fine eating. Definitely good for small groups and/or a second date. Depending on how many people are there I'm sure the atmosphere varies - we were there late on a week night so we were one of the only tables.\n\nAs for the food! It was super tasty and really easy to cook everything (this is hot pot so you cook your own meat in the broth). Really easy for first timers and without the condescending manner of some places. Definitely want to go back with a small group but for all you tinder folk, I'd suggest impressing your date here!", "author": "Reyana F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-07", "description": "I don't know if Nabe was just having an off day, but I left Nabe full but disappointed. \n\nIf you're planning on eating here, I highly recommend you make a reservation since they were turning people away at the door on the Saturday night that I went. The space is beautiful, and the decor is modern and stylish. I was so excited since everything looked beautiful and the hostess was professional, but once my boyfriend and I were seated the mediocre service started. Our server handed us the menus, took our drink order, and then we didn't see her for another 10-15 minutes. When she came back with our drinks, she didn't ask if we were ready to order, and we had to flag her down again. We ordered the sukiyaki broth with an order of beef and pork with extra mushrooms and veggies.\n\nOur food didn't come for over 45 minutes, which by itself was pretty annoying. However, there is apparently a time limit because they are so busy, and they kicked out the party of two next to us who stayed too long.  I'm not sure when they time it or how long the limit is but given our wait for the food, I hope it's calculated by when the food arrives. I don't know if there was a massive backup or something in the kitchen, but my boyfriend and I were starving and we had no idea what was going on. Then, our food arrived with no apology or explanation. To add insult to injury, there was a party behind us that arrived about half an hour after we did. We received our food at the same time. \n\nThe food itself was mostly good. The beef and pork were delicious and the quality was fantastic even without the upgrade; there was an average/smaller amount of vegetables than we would have liked but they were fresh and tasty. However, we were so disappointed by the sukiyaki broth because it was incredibly bland and there was so little sweetness that you could only detect it at the end when all the broth had boiled down. We enjoyed the porridge at the end, and it was a nice touch to ensure that you were completely stuffed before leaving. \n\nWe might come back in the future to give it one more chance because the meat was fantastic, and we'll pray that Nabe just had an understaffed off night. For now, there's more places to try.", "author": "Misu S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "I've been a fan of Nabe # 1 for many years (since it open 2012). Always delicious and I love my leftovers! \n\nI was invited to the soft opening two weeks ago and this Nabe does not disappoint!\n\nI had the ShabuShabu, garlic edamame and sake :)\n\nSince this is closer to my house, definitely will be a regular. Service is great as usual and I like this location because it is a lot more spacious. Breeeaaathe! \n\nFive stars all the way and I can't wait to come back! \n\nThank you!", "author": "Emily L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-02", "description": "I enjoyed my experience here--super modern atmosphere and very clean! My boyfriend and I ordered the shabu shabu with the spicy miso broth. I thought the miso broth was just okay, and would probably go for a more creamier and flavorful option next time. The pork belly and wagyu beef quality were great, and the veggie platter had a diverse assortment of veggies. \n\nHowever, I thought the dipping sauces were a bit disappointing.. SAUCES ARE SUCH A HUGE DEAL FOR ME... and Nabe's ponzu sauce did not really hit the spot for me. I felt that it lacked flavor and was also too sour? I really enjoyed the sesame sauce though. \n\nAlso, service can be slow. You may have to wait a while before getting your second platter of meat or whatever else you order, while the broth sits there boiling. \n\nOverall though, if you want a clean and straightforward shabu shabu experience, then I would recommend coming here. They also serve you porridge at the end, which is a nice perk!", "author": "Evelyn R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "Been here twice for shabu shabu and both times have been pretty good. The quality of the meat and veggies is above average for most hot pot places in the city. Their broths are rich and a great base for the porridge they make for you at the end. If you're looking for the most economical way to order - ordering 1 set per pair and adding on extra servings of meat is probably your best bet.", "author": "Ada C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-31", "description": "Pretty underwhelming. I expected a lot due to the reviews but the broth was super salty and had an odd flavor. We shared the large seafood one and I wouldn't recommend it. Likely never coming back here.", "author": "Yasi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "so good. we ordered 1 large & 1 reg shabu shabu, my boyfriend was worried he wouldn't be full afterwards (he eats a lot!) but with all the veggies, udon, and the porridge that came with afterwards, it was a super satisfying meal. would definitely come again next time if we're ever around the area. worth the money!", "author": "Iris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "This place is amaizing. I tried the gyozas, the shabu shabu and some deserts. The meat is really good, the place is super clean. The service is good. They make a delicious preparation with the rest of the broth at the end of the meal, which is awesome.", "author": "Sara-Fleur S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "I stumbled upon Nabe after returning from renting bikes a few doors down.  I would give this place a 4.5 for food quality and 4 for comfortability.\n\nShabu Shabu dinner set with the Japanese Miyazaki A5 upgrade.\n\n-Vegetables were fresh! The cabbage especially had such a crispy and sweet taste.  You will notice a difference. And the mushrooms...so fresh and plump. haha.\n-Regular wagyu meat was very thinly sliced and good.  But paled in comparison to the Miyazaki A5...which literally melts in your mouth.  But for $89, it better be that good right?\n-They mix rice in the stewed broth after you are done...and this \"porridge\" as they call it is the main event.  Do not skip on this part as I almost did.\n\nOne area of improvement I would recommend is the chairs.  There are a limited number of tables on each side with chairs that have backs.  But in the middle, is a long table with small stools...without back support.  This makes it less comfortable to enjoy a good meal.", "author": "Jane P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "absolutely INCREDIBLE. The Duck Breast is savory, rich and delicious. Not a bad price for the quality. The service was incredibly helpful when finding a sake to pair well with our food. Great service and great food. Definitely coming back soon!", "author": "Roman K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-04", "description": "I've had almost no food experiences more disappointing than this in SF, especially with a 4.5+ rated restaurant - I'm surprised why this place has such amazing reviews! At the end of the day, not worth the hype. \n\nThe decor of the place is really sleek, the menu looks well put-together, and we started with their genmaicha tea, which set a great tone at the start of the meal. \n\nThe hot pot was very average. Ordered the wagyu beef and the seafood. They forgot to serve us one of our veggie side dishes until we'd almost finished, so we ended up just eating spinach/cabbage/etc for a while at the end...definitely not a great way to finish a meal. They do make a porridge out of your broth at the end, which is a nice touch but wasn't appetizing (they pretty much dump a bowl of rice into one of your broths). They don't give you sauces that you can mix together like other hot pot places do. Don't really have a reason to come back here! \n\nI'm also not a fan of the seating- they only have large tables that you share with other parties if you only have 2-4 people. I was on an aisle seat and there were people shuffling to their seats behind me constantly throughout the night, so my jacket kept falling onto the ground. \n\nPretty sad that we spent $40 here :(", "author": "Karen Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-02", "description": "Came here Saturday night with my friend and my boyfriend. We had reservations at 7:45pm and got there maybe 10 minutes before. Parking wasn't too big of a deal since there was parking on the backside of the restaurant (behind Mel's drive-inn). Although we made reservations, we didn't get seated for another 30-40 minutes which kind of sucks because there's no point of making reservations but still having to wait...Anyways, we finally got seated maybe close to 8:30pm. Right when we got seated we were ready to order lol b/c we were so hungry! The restaurant is pretty small and it's probably the same size as the one on Irving. We all ordered shabu shabu with regular miso soup and spicy miso soup. I like that you can split the soup if there's people in the party that wants different soup base. We got a big plate of veggies and a plate of meat. My boyfriend ordered the large one but it didn't seem like it was a lot for him lol. Like it may just have been like few extra pieces of meat for a little more but same plate size. We also ordered gyoza for appetizers and a bottle of sparkling sake. Gyoza was good and the sparkling sake was delicious. I could have probably drank the whole bottle on my own lol. It's a pretty small bottle but it was pretty sweet and delicious. Our total bill was about $120 for the three of us.\n\nI'll probably go to the one on Irving next time since it's a bit easier to find parking but if I'm ever in the area again, I'll definitely go there! Again, don't forget to make reservations or else you'll be waiting over an hour to hour and half.", "author": "Monica W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-09", "description": "The design is good, service is good, food is just OK. The rice at the end is pretty salty, wanyu and the seafood are not so fresh. We won't go back for this price for sure. It was really noisy that we could not hear each other talking. Not a good experience.", "author": "Xia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "First things first: MAKE A RESERVATION!!  My friends and I were in the neighborhood one night and thought we'd give Nabe a try but ended up waiting almost 1.5 hours to get a table.  Luckily we weren't super hungry when we got there and just passed the time chatting but I would never go back without a reservation.  Compared to other shabu shabu places I've been to I felt like Nabe was a little slow to get our broth and trays of food out but I thought everything was really fresh and good.  Also, our server was a sweetheart even when it came to the many questions we had.  Try them out!", "author": "Emi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "The Lombard location is bigger than the Irving location. We had a large party so we decided to come here instead of the Irving location. \nThe service was very friendly, but a bit slow. The servers were just overwhelmed with the crowd. Smaller parties that came after us were served before us. We came at 6 pm and the restaurant was full. \nThe wagyu beef we ordered here was not as marbled as at the Irving location. Everything else was the same here: broth, vegetables, etc.. \nTo my huge disappointment, they did not have any cheesecake or Mochi cake on our visit!! And I was telling my guests how delicious they were.", "author": "lovetoeat a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-14", "description": "The sukiyaki is good but very one dimensional with the flavor so I got sick of eating it. I think I highly prefer eating Chinese hot pot because it's WAYY more flavorful so I'm biased! The other broths taste very healthy so this is a good place to go when you're on a diet because they give you a normal amount of meat & veggies and you don't feel like food coma-ing after. I wouldn't come here though to have a delicious meal with friends! To caveat, I don't like bland foods at all though and love broths filled with flavor!", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "First off let me say, I LOVE the interior of this place, very beautiful and well thought out. Came here with my buddy because we were craving hot pot. We always go to the AYCE hot pot places but wanted to give this higher quality place a try. We ordered the Kamonanban, which has duck in a dashi broth. The duck was very high quality and tender. However, our meal left me and my friend wanting more. When we are paying $29 for hot pot, we would at least want a decent amount of mushrooms and vegetables to put into our soup. We ended up having to pay pretty high prices for a small portion of ingredients to fill us up such as noodles and extra vegetables. Another side note is that I wish they infused more duck flavor into the dashi broth with the bones or something because other that biting into the duck, the soup really didn't have special flare. Great hot pot, but for the quality we pay for vs. what we receive, I'd much rather put my money into an AYCE hot pot restaurant.", "author": "Brandon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "Soft opening at Nabe's new location, I had to come since I love the one at 9th. Had my weiners it's a must! And this time I had shabu with beef. So good so full and again they made the rice porridge at the end.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "We love to have Shabu Shabu every time we come to San Fransisco. We never seem to find the same place that we visited previously but this one was my favorite. The atmosphere was clean and contemporary. The service excellent. The food AMAZING. Shabu is pretty simple and since you cook it, hard for a restaurant to mess up if they are using quality meat. So what it comes down to for me is presentation and price.  I did a lot of research before picking this place and it was a bit more money than the others I considered but I wanted the whole experience. We even tried some Sake that was surprisingly delicious (didn't think I was a fan of Sake). We will definitely be back to Nabe!", "author": "Crystal L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "One of my favorites!  The meat is fresh, the ambiance is fun and the broths are delicious!   I'm constantly looking for a good place to have shabu and I was pleasantly surprised to find this place.  I usually go for the miso with udon noodles, mushrooms and the Wagyu beef.  Definitely try the sausage appetizer", "author": "Cathy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-01", "description": "Nabe 2 is a higher scale hot pot/Japanese restaurant and the decor as well as service are testaments to that.\n\nThe food is good, but your experience would vastly vary based on how salty you eat. For those who eat light, try the miso based pots. And for those who don't, go for sukiyaki or seafood. I also enjoyed their edamame and gyozas.\n\nBefore you leave, don't forget to order the sesame ice cream. It tasted home made and a little grittier than store-bought ones. Absolutely delicious", "author": "Lee T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "You can order one large pot for two people. They make u porridge for free . We got miso broth for our shabu shabu and it tasted light. Orders come out fast and waitress was very nice.", "author": "Hana O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "After feeling a little under the weather we discovered this delicious Japanese hot pot place! The broth was delicious (we had duck breast and kimchi sets) the service was outstanding and they make congee with your left over broth at your table! We left with full warm bellies. Thank you Nabe!", "author": "Silvia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "I had such a pleasant experience for my first visit to Nabe. Our waitress was pleasant, helpful and accommodating for our birthday group. I'd absolutely recommend others who are planning celebrations to consider Nabe as a great option. \n\nOne large dish is perfect for two people. You can mix and match meat and broth flavors. We did Waygu beef and pork with both the spicy miso and the Dashi broth. They were very complementary and great with both meats. All the veggies were ideal for these broths as well - just be careful - the squash gets VERY hot in the broth! \n\nInterior design is simple and chic. You don't feel like you're in a marina restaurant anymore, but instead transformed to a cozy nook in Japan.", "author": "Allison L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-23", "description": "The hostess has no system for determining how long your wait might be. We arrived at 6:50pm and were told that the wait would be 45 minutes to an hour. When we came back at 7:45 and we were told a very confusing story about why we couldn't sit yet but still weren't given a clear answer about when we would be seated. We hung around by the entrance until 8:15 then tried asking again, and still had no clear idea of when we'd be seated. At that point it was very clear we should give up. I had eaten there once before and it was good, but not good enough to warrant the long wait and lack of organization. Won't be returning.", "author": "Maggie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "We went here on a Sunday night around 7 and were seated right away. My girlfriend and I ordered a large shabu shabu with miso to share and got some extra pork belly to make sure we had enough food and it ended up being the perfect amount for two people. It was absolutely delicious, the waiters were all super nice and attentive, and at the end of the meal the make you rice pudding at the table out of the rest of the broth! They even brought us complementary ice cream for my girlfriend's birthday! This is one of our new favorite spots!", "author": "Madeline S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "Shabu shabu is on point here. It's in a nice place on lombard st and good modern ambiance. We went at a time where it wasn't busy but I liked the long tables and the service here. The meat itself is quite tender, and the soup seasoning is reasonable for the hotpot. The veggies pretty fresh as well.", "author": "Han S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Omg, this is the best nabe/hotspot spot in San Francisco!   My boyfriend and I shared sukiyaki and kimchi nabe, both of which were amazing. It tasted pretty authentic and was filled with lots of vegetables and even mochi. The meat was very nice, we even got the Miyazaki gyu which was so soft and worth every penny. The best part is the rice porridge they make with the remaining broth at the end. It is delicious. There was no problem about wait times and the service was great. All round A* and I can't wait to come again next time.", "author": "Miu K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Nabe is excellent, I started going once a week! I love the sukiyaki and the kimchi pots. Nabe's quality for their beer and pork is by far a cut above the rest. The Miyazaki A5 melts in your mouth. Love the standard Kobe too. I like to add extra mochi to anything I get. Start things off with the octopus salad and the pork gyoza. The beef one are good too but the pork ones are my go to!", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "YUM. Everything so good. The mochi was different but so good. Recommend the spicy kim chee and the dasio broth. The porridge at the end is the best part. Don't fill up so you get to eat this!!!", "author": "Taylor P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "The atmosphere was awesome.  When I was looking for the actual restaurant, it took a bit to fine because the entrance was so nondescript.  The door was just a big black door, no signs or anything.  Made feel like one of those secret places that only selected people know.\n\nThe inside of the restaurant was very nice and modern.  The food was awesome.  We got the duck based soup and it was on point.  The beef and pork belly was incredible.  But the best part was when we were done with the food.  They used the soup base to make a porridge.  That was the best.  \n\nThere will be a next time and many more to come.", "author": "Charles L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "I went to this place about 2 hours ago and its really good. Me and my friends got 2 items, required to get more than 1 item when the party is 3 or more people. We tried both miso and spicy miso broth and I really like the spicy. The regular miso broth is too blend and does not have much flavor. We had both regular nabe with beef and a vegetarian one. Unfortunately vegetarian one cannot have a spicy miso since one ingredient in the broth is bonito flakes, which is fish. There was not as much meat as i wanted even when we got a large and ordering additional meat was a little too expensive in my opinion. But the overall experience was great. The porridge was so good! I did not expect it but it was a pleasant surprise. I tired their house mochi cakedessert with sesame ice cream and it was average.", "author": "Hayoung K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "Came when it was cold and called ahead because we were planning to go 15 minutes to close but the staff was more than welcoming and kind. Really enjoyed the rice porridge they make with the leftover broth at the end! We were just visiting the city and the staff was very friendly and even recommended some good bakeries and cafes to check out. Food itself was warming and good since it was chilly out at night, inside was small but nice ambience with the art curtain things (there's probably a name for them that I don't know). Would recommend!", "author": "Katherine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "Wow!!!! Couldn't ask for more from a restuarant. Food awesome, service excellent, cleanliness 5 star,  atmosphere very nice.  Defintely will come back every week and I live in East Bay . Yes that good and well worth the commute even with traffic.", "author": "Simon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Came here after work with the hubz. Fast service, delicious food! Broth is definitely the best when all veggies are mixed in.  Will definitely come back!", "author": "Jessica Elaine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "First time here and it did not disappoint. The Kamonanban (Duck Breast) Nabe is a must try. Shabu Shabu Wagyu Beef was heavenly. Zosui Rice Soup was a prefect finisher to end the meal.", "author": "Betty H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Excellent Japanese hot pot. Best in SF in my opinion. I like getting the beef and Miso. Pork is good too. Try getting a raw egg and dip the beef in the sauce then egg - changed my world. They also serve this really good beer called Harajuku Girl from Holy Craft Brewing Company. It's brewed with Yuzu and has a nice citrus flavor that works with hot pot. Definitely recommend pairing. For dessert they have mochi pound cake with black sesame ice cream that disappears after about two minutes for some tasty reason.", "author": "Klaus S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-15", "description": "Not recommended for large groups (bigger than 3-4).\n\nThe hot pot here is good. I highly recommend the duck breast. However, I wouldn't recommend coming here in large groups. I just got back from there with a group of 14, and service was very very subpar. Not only did we have to wait a long time for our entire order to be delivered (our waitress forgot that we had ordered the duck), but they informed us that they ran out of rice (...what? this is a hot pot restaurant) while making our congi at the end. Also, the menu states in small text at the bottom that we only get one pot of congi per group. We asked the waiter if the rule could be relaxed, since we were obviously a very large group, and had occupied 4 hot pot tabletops. She declined, and offered us to make another pot of congi with extra udon (we would be charged extra). We asked if we would get separate servings if we came in 4-5 smaller groups instead of one large group, and she said yes. This rule makes no sense, and unless it's changed, I don't think it makes sense to bring your large group of friends to Nabe.", "author": "Anarghya M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "I love nabe on Lombard street.  It is always fun, fresh, delicious and friendly.   I have been there ten times and had a superb service and delicious dinner on every visit.  It is also great for kids and those with a gluten free diet.", "author": "Danna A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-20", "description": "The ambience is very nice, modern, and clean. Looks like a new place. The vegetarian options are very limited - there's only a mushroom hot pot dish, and it's just okay, nothing special. I wish there was more of a variety. It's $21 for the regular size. All the dishes have regular and large options. The seating is a little awkward, however, because a table for six has only two placements for hot pots.", "author": "Nitesh D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-29", "description": "this place is really hidden from the outside.  it's on lombard and has opaque windows and black on the outside, so it looks like a club.  i couldn't even find the door initially.  once inside, it was super steamy and warm from all the hotpots.\n\nfor 4 of us, we ordered half sukiyaki and half seafood.  we then added an additional platter of meat, enoki mushrooms, fishcake, and kimchi.  it was enuf food for 4 of us.  afterwards, they make congee w/ the leftover soup.  since our pot was divided into 2 broths, we asked them for 2 separate congees, and they said they had to charge us for an additional bowl of rice.  they will only do one bowl of rice for the entire pot otherwise, which is pretty lame if there are 4 people.  we ended up getting the extra bowl of rice anyway.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "Had the Kim chi and sukiyaki and it was bomb! Beautiful decor and friendly attentive staff. My girls and I had a great time. Thank you!", "author": "Connie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "I recently spent a month in Hong Kong, and never built up the urge to try hot pot. I didn't really understand how it worked, and while visiting SF my wife and I decided we just had to try it. The atmosphere and shared seating was a wonderful reminder of HK, and the food was amazing. It's a wonderful dinner setting to eat slow and enjoy great company.", "author": "Jennifer R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Hot pot was delicious! I tried the kimchi and spicy miso! Vegetable selection was awesome and the portion of meat is perfect for a full stomach. The ending is the best part! They ask you which broth you would like for the porridge they make you! Soooo delicious! I've been to many hot pot places and this place is one of the top best for me!", "author": "Sandra P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "This is a good place to have shabu shabu other than Sichuan style. They do have option to go half and half, but I always just have sukiyaki that being the reason for the visit. The downside is that there portions are small and therefore, it will cost you more than little sheep. With drinks, it usually comes down to around 150 dollars for two.", "author": "J S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "Amazing contemporary, modern, minimalistic hot pot restaurant. Service was warm, friendly and efficient. When we came, it wasn't too busy so we always had someone attending to us. The vegetables and meat quality are fresh, crisp and of high quality. They have different soup selections and I highly recommend the sukiyaki + spicy miso. After you're done with the hot pot portion, the servers will prepare congee from the broth that is left in your shabu. Overall a great experience and I would definitely come back.", "author": "Carissa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "All I can say is that I cannot go back to Shabu House or just any regular Shabu after this! You can definitely taste the difference in quality in both their meat and broth. \n\nMy friend and I ordered a split pot with wagyu beef with spicy Miso and half duck breast with Dashi broth. We also ordered the kurobuta sausage as appetizer.. and everything was just amazing. Their spicy Miso base actually had flavor! Now I've been to quite a few Shabu places and their Miso soup base is always a disappointment because either it's not spicy or there's no flavor. Not this place! It was spicy and actually tasted like Miso! \n\nRight when we were about to call for the bill our waitress told us that there was more food! Apparently they use your leftover broth and make a rice porridge with it. We chose to use the Dashi broth since we didn't want spicy porridge. It was sooo good! The porridge tasted kind of sweet and smoky. It's hard to explain but trust me, you'll get what I mean when you try it for yourself. We were literally holding our stomachs because we were so full... but let me tell you now that it is a MUST TRY! They also have quite an extensive menu of Sake and Japanese Beer. Big plus!! \n\nSurprisingly, even though it's located on a busy street we had no trouble finding parking at all. I'll be back!!", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "Not bad place to enjoy hot pot in a rainy day.\nClean hip and enjoyable environment. The pork actually is better than the beef.", "author": "Ai S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "This place is pretty new. I like how at the end, they cook you a free porridge from your leftover broth. So good! Something different", "author": "Natalia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "I been eagerly waiting for this place to open for months! I've always loved their first location and wanted to see how this compares. It is just as delicious as the first! The decor in this place is amazing. It gives you the \"Japanese street\" feel. Like always, I start with the octopus salad which was very fresh and appetizing. Me and my BF always gets our own sets. I get the duck breast while he takes a spicy miso shabu. I LOVE the dashi broth! It's a soy base broth that's savory and so flavorful. The portions were perfect and they also give you a complimentary rice porridge at the end. Make sure you try it as this is one of the things Nabe is famous for! Also, they have Asahi draft beer here. So it doesn't come from the can. It taste so much more smooth and crisp. Love this new location.", "author": "Anna Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "This place was incredible! The food from start to finish was delicious and all tasted very fresh. We tried the waygu beef and the kimchi pork sets and split it among 3 people, which was plenty. The garlic Edamame were also super flavorful and bonus points to the staff who were extremely knowledgeable and friendly. Definitely coming back here for another great experience.", "author": "Aaron E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "Enjoyed our dinner here tonight especially the rice porridge at the end. What a comforting and delicious meal!", "author": "Katrina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "Best shabu shabu my wife and I have had so far! We've been to pretty much all the popular joints in SoCal and have to say, Nabe is so legit. The wagyu beef is sliced paper thin and is so flavorful,and the spicy miso broth was perfect. Not too thick, clean, and perfectly spicy. The wife loved her spicy miso broth and mushroom/vegetarian option. The house made ramen noodles were excellent. Even though we were happily stuffed, the rice porridge with fresh egg/green onion/seaweed the waiter made with the leftover broth was the cherry on top. The signage isn't very visible and the black door makes it sort of hard to find but with no wait on a Friday night, I would say that it was a plus.", "author": "Mikia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "Amazing shabu shabu hot pot! Meat was fantastic, and loved all the side options. The broth was very flavorful, although the spicy broth was bit too spicy for my taste so I'll have to try the regular miso broth next time along with the duck. Loved the porridge at the end - such a unique thing that I've never had. Space is very beautiful and modern. Can't wait to come back!", "author": "Cathy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "Nabe is my absolute favorite restaurant in the city. Best shabu shabu ever. Period. They really know what they are doing here. All ingredients are organic and the freshest. Been going here for years since they opened and going at least once a week since and stopped going to Shabu House completely. Miso shabu shabu and the sukiyaki are the go-to's. Eat the GOUMA sauce over rice!!! Hilwin and her staff do a top-notch job. You will have the best hot pot experience of your life!!!!!", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "Great menu and no line. I think it might be due to lack of signage outside but I got the shabu shabu wagyu and Gyozo beef. I bet in like a few weeks all the hipsters will find this place and they'll be a line out the door", "author": "Mark A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "This is my fav shabu shabu in the city. They made their own sesame sauce, not BOTTLES like other chinese shabu shabu places. I don't feel that thirsty MSG feeling after. The quality is there and I like this location, because it's a bit bigger than Irving St. Service is always no complains. I'm addicted with their 'mochi cake'....oh gosh, so chewy, yet not too sweet. Japanese level sweet and with sesame ice cream, yum yum.............", "author": "Clemencia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "This place was amazing.  Got the Wagyu Beef with Spicy Miso.  Was basically the Shabu version.  Shared with my date and it was more than enough.  Was stuffed after the porridge they make with the leftovers but it was amazing wanted to finish every bite.  Good location, and really awesome ambiance/decor.  Great service too.  Check it out!", "author": "Jay H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-14", "description": "Came to check out this place on a Saturday night and sadly was very disappointed since the photos of the food looked appetizing. The broth in the wagyu sukiyaki and duck were 6/10. Additionally it felt like they were quite frugal with portion size. This wasn't impressive at all for shabu in SF, and the service didn't make up for it. The waitresses were busy running around and it was difficult to catch their attention for anything if you were seated towards the walls versus in the aisle way.", "author": "Connie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "Best Shabu place hands down!! So happy they opened a new location!! Same amazing quality food as the sunset location! Service is 10/10! The restaurant is gorgeous!!", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "This place is so good that I hope this place doesn't never gets hyped and overrun with people causing long hour waits. The broth here is on point. They're also very traditional", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "best hotpot in the bay!\n\nhave been itching for some hot pot and this is the spot to fill that itch. the interior is done very well. the food is spot on and delicious. and the kimchi, yummmmmy! and home made deserts!", "author": "michelle c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Excellent dining experience. Just as good as the original but the dining room is much bigger. I'd definitely recommend folks from North and east bay to give this place a try. Well worth the trip across a bridge. The home made mochi cake is a must.", "author": "Matthew L."}
