{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "Came in on a weekday for dinner. It's a pretty small, quaint place. Being pretty much empty, I chose my seat near the window. There's also one TV inside, but I wanted to people watch and watch the cable cars go by.\n\nI ordered the drunken noodle with pork ($10) and a thai iced tea ($3). Everything came out great. My entree came out piping hot and the iced tea was super refreshing. I added some chili sauce for some extra heat and thoroughly enjoyed my meal. Service was friendly and quick, she came back often to check on me and reliably kept filling up my water. \n\nThere seems to be plenty of options to order delivery from this place, but it was great to stop on in and take my time eating. I'll be back to try out some more dishes!", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-23", "description": "I ordered via Postmates, and it's always hard to find a solid restaurant on this app.  I was not a fan of Navin Thai.  My food was bland and made me feel uneasy after.\n\nPad see ew with chicken- of all that I ordered, this was the only dish I would say I would get again\nDuck noodle soup- usually a favorite of mine, but was not impressed\nMango with sticky rice- not good\nThai iced coffee- standard\n\nI can't say anything about service since I ordered through Postmates, but I'm bummed the food didn't work out for me because the ratings sounded promising.", "author": "Lyn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-14", "description": "I was on a stroll in China town and felt like Thai. This was the best recommendation in my area. I chose Tom Yum Ka and Panang Curry with chicken. \nThe service was fast and friendly the place looks cool but nothing fancy. \nThe food was okay. It was better than average. I found the soup a bit too salty. It had a bit of a taste of Tajin, a Mexican spice mix. I might be wrong ...  the Panang curry was good but even with an extra portion of rice it was still. A lot of sauce. \nI was very surprised I had to pay for rice. Even the first portion was charged for, as well as my to go silverware was extra extra charge. Considering I am not using the facility and clean up. That should kind of compensate for the to go materials, no?", "author": "Olivier D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "Great for lunch! I've never had to wait. The service is fast, the food is good and the prices are reasonable. The lunch menu is decently big but I wish Pad Thai is on it. The portions are not huge but definitely enough to get full. It's actually good to not be too stuffed to avoid the post lunch food coma.", "author": "Connie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "I can't believe I forgot to review this! It's been about two months I believe since I came here with friends. Everything we had was wonderful. We also had the Thai beer. The prices were cheap and the flavors were intense especially the hot chili sauce. The dessert was amazing as well. The waitress was beautiful and the service was fast. Come here soon for lunch or dinner!", "author": "Johny B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "I was craving for some Thai food, and let me tell you, those uphill and downhill walking was worth it and I would do it again.\n\nFood 4/5\n----------\nI got the chicken Pad Thai to go and it tasted delicious. The noodle was cooked to perfection, and the chicken itself was very tender. They were very generous with their portions, especially the amount of peanuts they gave me (yes, I love my peanuts in my Thai food!). This cost me $9.95, which is reasonably priced for what you're getting. I can eat a lot and I was really full after eating this! \n\nI also got the Thai Iced Tea. I love the balance between the tea and the sweetness, although I will say reducing the condensed milk just a bit would bring out the flavour of the tea. Just my preference :)\n\nService 4/5\n----------\nThe service review is solely on getting take out. The waitress offered me the menu and didn't rush me in ordering. I also like how she put the straw in my Thai iced tea with the top of the straw covered. Little things that I do appreciate.\n\nAtmosphere 3/5\n----------\nAlthough I didn't dine there, but I will say the place had limited seating (maybe about 10?), but the place is still spacious enough for you to enjoy your meal. \n\nOverall, the quality of the food was there, the waitress was very friendly, but the place could do some renovating. When I come visit San Francisco again, this will definitely be on my list.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "***TLDR: solidly executed Thai dishes that come at you fast and won't break the bank.*** If you're in the mood for good Thai food in a cozy neighborhood environment, Navin is the place to me. In addition to well known Thai noodle dishes like Pad Thai and Pad See Ew, the curry and crab fried rice dishes are also quite satisfying.", "author": "Sterling C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Came here for lunch and their pad Thai was amazing . I love Thai  food so I've been to most of the Thai restaurants in SF.   This place is one of the best Thai restaurants I've been to so far .  I am excited to try other dishes here as I live only two blocks from here !!", "author": "grace k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "Defiantly some of the best Thai food I've had. Great flavors and fresh ingredients. Their brown ride is exceptionally good. The staff was friendly and helpful with suggestions and my meal came out quickly. And like all Thai restaurants, there is a plethora of options for vegans which is always appreciate. Would come here again!", "author": "Molly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "Great lunch specials and cheap!!! It's right by Powell and their specials are until late afternoon. Noms", "author": "Love R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "If you love Thai food and you're on a budget. I definitely recommend this spot.\n\nI paid around $22 for an order of pad Thai and red curry with brown rice.\n\nI ordered it to go but the place was like a little hole on the wall", "author": "Monica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-17", "description": "This place has a homely feel to it.  Limited space with maybe 9 tables or shop.  Food its delicious. Price point is perfect around lunch.. they have great lunch specials.  I'm definitely coming back", "author": "Tru T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "I ordered a Thai Iced Tea (always great), Pad Thai Shrimp which was very delicious and hot in temperature given I had it delivered! I haven't ate my Mango Sticky rice yet, but the way everything else tasted it's not looking like it's going to let me down! Will be eating here again if I'm ever in town again. Definitely a recommend!!!", "author": "Audrey R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-22", "description": "Cheap, above average Thai food. Portions are generous. I came on a Saturday night and it was mostly empty. But it's not really a 4-star place. After eating the Pad Thai my stomach was churning all night.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "Delicious food, convenient location, and most importantly excellent customer service! A friend of mines took me here one night after hanging out around Chinatown and noticing that I hadn't ate the entire day. He said the walk wasn't too far from where we were hanging out (literally just one block from where we were at), so the place was easily accessible. We came 10 minutes before closing time, but the workers were extremely nice to us about letting us dine in and they provided such wonderful customer service and constantly brought us water (which I really, really appreciate since I tend to drink a lot of water when hungry). I really like the Pad Thai here compared to other places I've tried in SF, although the Pad See Ew was also pretty good here!", "author": "Danielle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Love ordering from Navin on postdates. My go-to Thai delivery when Im at work. I get the yellow curry and pad see ew. Great quality white meat chicken in the curry and fresh noodles for the pad see ew. my weekly treat!", "author": "Courtney S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "I like the food, I like the prices. Pad chili is my favorite and portion is decent. \n\nMy only complaint is having to wait for my \"friend\"\n\nThai food - \nRyan Wong -", "author": "Matt R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "I have lived two blocks from Navin Thai for years, and have never stopped in due to it's less than glamorous external appearance. HOWEVER, decided to check it out last week, and I was pleasantly surprised. Really tasty, reasonably priced food, with friendly service to boot. The spring rolls, chicken wings, and potstickers are great appetizers for a crowd. I also ordered the green papaya salad, which had just the right amount of spice, and fresh ingredients. The tom kha gai soup (my all-time favorite) certainly passes my test and is packed with a ton of chicken and mushroom. I have only tried the pad see ew, but I'm sure their other noodles are good as well. Quick and easy place for a meal, also good for takeout. You won't be disappointed!", "author": "Regina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-07", "description": "After having just moved to SF, I found this awesome Thai restaurant literally less than a 5 minute walk from my apartment. I've come here for dinner as well as take out. Beware for dinner if it's busy, it may take awhile to order/get food since there was only one waitress working. When I called for takeout, it only took around 10-15 for them to make my food.\n\nI've had the pad thai gai, pad see ew, and the pineapple fried rice. All of them were really good but I would my favorite is the classic pad thai. The portions they give you are absolutely huge for the price. Each dish is around $9-10 and will last me more than one meal. Personally, the fried rice and pad see ew were a bit lacking in salt/flavor. It might have just been a single case but even though they tasted yummy, they definitely could have had more flavor. The pad thai on the other hand was super good. I will probably get it every time I order take out and if it's your first time here, I would highly suggest getting the pad thai.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Had Green curry with Chicken and it's amazing. Very flavorful and fresh. The hostess was very hospitile and was helpful in suggesting dishes based on my interest.\n\nMust visit!", "author": "Adhithi A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-21", "description": "I did not receive any utensils with my order. When I called the restaurant back. They said too bad, her coworker forgot to place them in the bag and maybe grubhubb could give me a discount\".. Then hung up on me. This is unacceptable. I am staying at a select service hotel with no utensils. I had to walk to a store and buy utensils, since I don't eat hot noddles with my hands. But now my food is cold.", "author": "C C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "I came here on a late week day evening after work. The place has many options on the menu to choose from. It is a small retaurant in a neighborhood, which many residents around there seems to make to-go orders. For some reason, there were many single ladies ordering food there that night. I saw one lady with a book in her hand, another lady having dinner after yoga, and two other ladies having girlfriend time and catching up over dinner. I ordered my usual, Phad Kee Mao :) The restaurant ran out of wide noodle, so I ordered it with thin noodles. The dish was very good, and it is probably one of the better Thai place in China Town/Nob Hill area. Later on, gentlemen also starting coming in the restaurant. Maybe it was just random, but I thought it was interesting. Anyhow, the food is great, and the servers are friendly. Good place for take-out as well as dine-ins. I would go here again.", "author": "Lisa O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "I love finding hidden gems. Was walking through Chinatown San Francisco and peeped through the window and decided to stop. Soups were so delicious and authentic.", "author": "Hanio Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Ordered the Tom Kha noodle and it was very flavorful. Mild level of spice. Service is extremely friendly!", "author": "Andrea Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Navin is always my top choice when I do not want to walk too far away. Their food is very tasty. I recommend their pork stew with rice.", "author": "jinglu l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "This is a cute and comfortable Thai restaurant with friendly staff. They have reasonable prices, great service and most importantly the food tasted delicious, we'll be coming back again soon!", "author": "S D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "This small Thai restaurant is surprisingly good. I ordered the red curry with chicken, and thought it was quite good. Though I was disappointed they didn't include rice with the price. I mean, how can you enjoy a curry without a rice. That should really be included.\n\nOh well, still, it's decent value for money. The restaurant's decor is simple but cozy for what it is.", "author": "Andy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "Very friendly service! We have lunch here and the food was good, you also get a good amount for the price. Really good Thai iced teas and iced coffee.", "author": "Marcus D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "It was a cold and rainy veteran's day and my housemates and I were looking for a cheap lunch to brighten up our day. It was empty inside, but we went in and were amazed by the prices! 10.99 for a two entree combo, 6.99 for a giant plate of fried rice that couldn't even be finished.\n\nWe left very impressed, full of delicious Thai food, and needing a nap. \n\nAlso, they have grape soda.", "author": "Mia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Great, authentic Thai food. Some of the best I've had in the city. The curries are all made from fresh ingredients, not from a paste. \n\nThe place seems underrated for how good it is. \n\nI will definitely be coming back!", "author": "Dustin Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-02", "description": "Ordered Broccoli Tofu and it had almost no broccoli in it, but had odd things like mushrooms and cabbage in it. It had a light garlic sauce that was good, especially with sticky rice. I ordered veggie Pad Kee Mao with added extra beef (since there was no beef Pad Kee Mao option on the GrubHub menu. It was nearly flavorless, and also had a lot of cabbage and mushrooms in it that I didn't care for.", "author": "Niki P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-06", "description": "Yummy Thai food for a great price. Good portions. I was starving (hadn't eaten lunch or dinner), so I split a Thom Kha Gai soup with a friend, and we each got noodles--I was stuffed and couldn't even finish. \nI got the Pad Thai Woonsen, which was great. My friend got Pad See Ew, which was even better. The service was a little sub-par: our dishes came out about five minutes apart. But besides that, the food was great (if not the absolute greatest--but at less than $10 a dish, it's beyond worth it), so four stars.", "author": "Kimball S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-28", "description": "Cute little spot right on the edge of Chinatown within steps of my brothers apartment so we stopped by for dinner after a day of moving him in. Not only is this place affordable for Thai food in the city, the flavors are pretty spot on! We ordered the summer rolls, pad Thai, pineapple fried rice, and the Tom khan noodle soup all of which were packed with flavor. Also the pad Thai was deceivingly a larger portion than I expected. After I mixed the bean sprouts and peanuts with the noodles I realized the portion was enormous! Bonus points for having leftovers and not causing huge damage to my wallet!", "author": "Sam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Great food for a great price! Chicken Cutlet and Seafood Combo each for $6.99. This is great Thai food, my fave spot on the weekends. I love the consistency and the staff here! Get some dessert while you're here too!", "author": "Alison Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "I ordered for myself, my sister and mother and our meals were so delicious. The delivery came on time and the food was still hot once it arrived.", "author": "Janine B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Delicious and authentic! Recently at a conference at a local hotel and needed to find a good place to eat that was close by. Of course I went to Yelp and stumbled upon this listing. I was not disappointed! Yummy food, good prices and friendly service!", "author": "Kali B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-13", "description": "Completely good & decent Thai food, quick service & very reasonable prices. I appreciate that it wasn't overcrowded & we could just walk in and get a table on a Friday night.", "author": "Ben H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "I found this little restaurant through Yelp. And it didn't disappoint. I was on a road trip going through the coast to Los Angeles, and decided to stop in San Fran to do a little site seeing. I was tired of fast food and needed to put an actual meal besides burgers and fries in my system. This restaurant was small, and quite. Just the way I like it. Haha! Greeted by a young lady, and sat down in the booth near the window. I ordered the Golden Fried Rice, and Pad See Ew. It was good! Out of all the Pad See Ew's that I've had I'd give it a high 8. As I was eating my meal the Chef came out and waved at me and was checking if everything was alright. That made me smile because he was so cute about it. Haha! If I ever come back to San Fran, I'll most likely come back. Thank you!", "author": "Keiki-O-Kalani A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "When I am traveling I will usually only go to a restaurant once, especially when what I am trying is new. WELL I've been here 3 times in the span of a week. Their cheap food is AMAZING. Let me emphasize CHEAP FOOD in San Fran?! service is great; had a wonderful conversation with our waitress before we left. Plus, they can make any food mild-spicy spicy, just for your specific preference- not many Thai places do so. I will be here again next time I am in the city. Definitely recommend that you come and try!", "author": "Kallista T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-20", "description": "Many of my admirers know I don't dine Thai food. But I had an infrequent craving for the Asian cuisine. But this Thai place is one of the cozier one in Chinatown. The only catch is that you need to tolerate the roar and the ringing bells of the historic Cable Car.\n\nOn my only visit for dinner, I was very hungry and ordered three dishes: Spicy Chicken Wings, Beef in a spicy yellow curry with a hefty bowl of brown rice. For $5.95, I get five spicy wings. The wings were spiced cooked very well. For $8.95, the tender beef and vegetables mixed well with the thick yellow curry sauce. I also liked the brown rice offering for $2.50.  \n\nI also added an ice-cold bottle of Singha for $4.00. Beer and spicy food goes well together, folks!\n\nThe service was good. The waitress was friendly and attentive whenever Joe Cool needs something. \n\nMy Visa was accepted. \n\nA solid Thai place in Chinatown!", "author": "Matt G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-12", "description": "Thai spot located at the corner of Chinatown. Not my number one spot but it's convenient and fast. The pad see ew were on the salty side and pad thai was kind of bland, but I usually get their tum yum noodle soup. I like the thick noodles, but the most recent time I ordered it, the noodles were thin and not thick -- may have to request it specifically next time.", "author": "Christine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "Very good Thai food.  I live in the neighborhood and this restaurant always seems to struggle because of its poor location (it has gone through a number of changes over the years), but the food is very good and the new owners continue to improve the place.  \n\nLove the 5-spice pork stew which is essentially a Thai noodle soup with large hunks of flavorful pork and some pickled vegetables that provide a great taste twist.  \n\nGood, fresh, flavorful food with pleasant service.", "author": "Steve R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "After a long day of walking and exploring the city, my girlfriend and I were happily greeted when we came to Navin Thai. They were very quick with service and even more friendly! Love the food, love the restaurant. Will absolutely come back next time we're in town", "author": "Spencer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-17", "description": "Amazing food. Ordered spicy Thai hot basil from lunch menu for 6.99$. Spiciness was perfect.", "author": "Rahul K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Great food, fast service. Good pricing for nob hill as well! I recommend the green curry!", "author": "Lukas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "awesome service. food is freshly prepared, authentic and very tasty. their thai iced tea is a must have! pad thai and basil chicken great combination and their fried shrimp appetizer will leave you very satisfied!", "author": "Samuel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "What a fantastic little gem! Service was quick and friendly and the food was absolutely delicious. Next time I'm in San Francisco, this will be my go to Thai spot!", "author": "Sydney B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "Great service and delicious food. Great local restaurant with delightful ambiance. Conveniently located at the edge of Chinatown and accessible by San Francisco's world famous cable cars.", "author": "Eric R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Stumbles upon a very friendly Thai food restaurant today. Very authentic and affordable with quick and personable service. The basil chicken is delicious", "author": "Sasha F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "I flew into town, didn't know the area by my hotel, and I came across this place by chance.  I was really tired and hungry when I walked in.  I bumbled when ordering.  What I liked was that the woman at the counter took my order, was patient with my general confusion, and served me a really great red curry dish.  I was so pleased I came back and tried the panang curry the next night.  All in all, it was a really good experience.  The food was really flavorful and potent.  Great place; will definitely visit again.", "author": "P T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "I had the tum yum noodle soup. It was great! It was spicy but not to spicy. The food here is fresh. It was made to order. My wife had the beef noodle soup. The beef is chunky. The spring rolls we're outstanding! The location is small but so is everything else in San Francisco. Tip: order the spring rolls.", "author": "William B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "We love the food at Navin Thai Restaurant!  Their Thai Iced Tea is classic and yummy.", "author": "Mayo C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-14", "description": "Location is off the beaten path, but it was worth it.\n\nGiven all the Thai I've had in my life. Their Tom Ka Gai was an 8 on the 10 scale, and their Pad Thai was a 9 possibly even a 9.5. It was excellent\n\nI would go here again and would recommend.", "author": "Brad K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Delicious Family restaurant.Very friendly staff and excellent food.Try the veggie pad Thai.", "author": "Shad C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-03", "description": "Kind of split between 3 and 4 stars but I'll give it the 4 because...\n\nAsked the waitress which was better: Pork cutlet or pork chop. She suggested that the pork chop was her favorite. Alright, grilled pork chop it was. Upon receiving my take-out... I looked at the bag... what is this... TINY BOX!? seriously I paid $5.99 for a small flat box.... However, upon eating, the pork chop and the tamarind sauce was really good. The grill on the pork chop was nice. Pork was not overcooked. The pork was actually the size of the box so that's good.\n\nFood taste great. Price is deceiving because it looks cheap and affordable but the portion size was small (I can only speak for lunch special). However, if you don't care and just want good food, here's your place!\n\nFYI:Really small place. A little stuffy in there as well.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-05", "description": "I ordered the stewed beef in panang curry.  i expected this to be fantastic, because slow cooked meats are delicious and the dish was one of the most expensive on the menu\n\ni heard a microwave door closing and opening several times, and the curry came out runny and i could tell that it was not prepared correctly.  the one piece of meat i tried was a huge piece of fat.  \n\ni took two bites of the rice with curry sauce  -- It tasted like an MSG spice pack, oil, and salt.\n\nI have felt sick to my stomach for two hours.\n\ni told the waitress the dish was inedible and asked for it to be taken back to the kitchen.\n\nthe waitress did not apologize or even address the screwed up dish, and she fully charged us for the worst thai dish i've ever eaten in my life.", "author": "User N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "Service is very good and the food is divine.  Prices are very reasonable.", "author": "Joseph C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-11", "description": "Very average Thai place, but at least the service was quick. I've had a couple of take out meals here, since it's super close to gf's place in Chinatown.  I have to say that the food is over-flavored with spices, rather than letting the flavor of the ingredients come out.  \n\nAfter a couple of visits, I'm just not that impressed.  There must be better places nearby.", "author": "Peter N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-07", "description": "While staying in a hotel nearby I ordered a Tom Kha Goong soup for delivery. When the driver arrived he called from downstairs, and complained about having to come up over the phone. He forgot to add napkins or a spoon to the bag, when I mentioned this he said \"So what, I don't care.\" Very unprofessional. \n\nIn what universe, would you not pack a spoon when sending soup to a hotel room? I can't report on how the soup was, because I now have to go to a store to buy a spoon. But I am guessing it will be cold and gross by the time I return.", "author": "MJ D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "Small, intimate, quiet, good service.  So nice to be out of the hustle and bustle of the city.  But please come and keep this place open.  We ordered 10 different dishes and everything was delicious!  We especially loved the duck curry, spicy eggplant, and lemon grass chicken. Highly recommend it.", "author": "Benjamin A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-22", "description": "I only had one dish and it was edible so I can't give it less than 2 stars.\n\nPostmates delivered a green curry lunch special to me today. The flavor was good. The brown rice was good.  BUT they used zucchini in the green curry and the inside broke down into little slimy bits so it had the same texture and consistency of boogers. Imagine trying to stomach each bite. I tried to just eat the chicken and bell peppers but there were only two tiny pieces of bell pepper and the gooey bits were in the curry so I had to sift through out with my fork. Not happy.", "author": "Ruthie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-23", "description": "I am very stingy with my 5 stars but I have to say this place has earned it. I have ordered from Navin at least 3 times since my first review and it is consistently some of the most delicious thai food I have ever eaten. Here is a summary of the things I have eaten:\n\nTom yum soup: delicious\nPad thai: delicious\nPad see ew: delicious\nVegetarian fried rice: delicious\nPraram vegetables: delicious\nGreen curry: delicious\n\nDelivery is very slow, but I've come to just accept that and I plan accordingly (place my order when I am leaving work).", "author": "Rachel E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "They have an amazing 5.99 lunch menu and it's available until 4pm. I tend to do takeout from here at least once a week. My favorite is the spicy eggplant with chicken.", "author": "Henryk S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-11", "description": "Its on my walk between my office and my parking garage, so I thought I'd pop in to try it one night after work. The place was pretty quiet but they seem to derive a fair amount of delivery business and a few walk ins during the weeknight dinner shift. I'd probably recommend the delivery over sitting in. Delivery would be perfect for one of those nights you want to sit around in your pjs, watch sports or Korean dramas, and feel like a bum while eating greasy takeout. The food was kind of what I expected. Cheap, and alright. Dining in rather than takeout was a little depressing. I had the Pad Thai and a Thai iced tea. It was a cold dark night and there I was alone in a Thai takeout joint. I think the only person who didn't want to be there more than me was this young waiter who was sitting three tables down from me in this empty restaurant.", "author": "Huy V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-04", "description": "Food was decent and super quick delivery.  The wait time quoted was way longer than it actually took, so that was nice.  \n\nI had the Roti with Green Curry and Chicken Red Curry with rice.  The roti was super tasty but a little greasy.  I would probably order that again though.  The red curry was just ok for me.  It was nice and spicy as requested, but it wasn't anything special.  \n\nI would order delivery again but maybe try a different dish or two.", "author": "Lindsey S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-15", "description": "Pad Thai - waste of money. Very little vegetable and noodle was undercooked. \nCurry - ordered beef curry and there were four beef pieces. IT was more lik potato soup.", "author": "Jinn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-09", "description": "Came here because of the discovery from Scoutmob! And how can I say no to Thai food when my two friends LOVE it?\n\nROTI W/ GREEN CURRY\n[+] perfect texture and crispiness! it isn't soggy or overly oily\n[+] the green curry was simply delicious!\n\nYELLOW CURRY W/ CHICKEN\n[+] chicken was pretty darn good, wasn't too dry\n[+] curry was quite flavorful, had potatoes and carrots too\n[-] but the one thing is that it did not come with rice so we ordered that as a side\n\nTHAI SPICE BASIL W/ CHICKEN\n[+] this was pretty darn good\n[+] the first bite... you can taste all the aromas of the dish in that initial bite. It was very delicious\n\nSPICY NOODLES W/ BEEF\n[+] very well cooked, the noodles didn't stick together or anything\n[+] pretty big plate\n[+/-] other than that, I can't say much because it was actually quite spicy and I need to keep leveling up in my spice tolerance! ahah\n\n[+] very nice service but there is a slight language barrier so speak slowly and use keywords instead of long sentences\n[+] the bowls looked pretty cool\n[+] scoutmob discount! yay!\n[+] everything is decently priced and is a great value for the dollar\n\nOverall, it was a very pleasant experience. I'll bring my family here next time!", "author": "Sandy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-04", "description": "Just alright....I came here because I have been meaning to try it, as its close to my home. However, I always get turned off because there is always NO ONE in this restaurant when I walk by. Thats not a good sign right? Well, I don't judge a book by its cover. I went on a Friday night with my boyfriend around 7:30pm-8pm... supposedly a popular time to eat...However, when we arrived, there was just a single other table occupied. I ordered a tom yum noodle soup and my boyfriend ordered a beef noodle soup. To be honest, it tasted fine, nothing special but nothing too bad! I actually preferred my boyfriend's beef noodle soup more.\n\nEverything seemed ok but after I went home, a few hours later, my stomach started to hurt. I am not saying this place gave me this pain but I am not sure why I didn't feel great after eating here. I am willing to give this place another chance in a few months. However, food wise, it just tasted ok but not spectacular or 4 star worthy to me.", "author": "Eileen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-08", "description": "The waitstaff is so kind! They also have one of the best sweet sticky rice desserts that I've tried recently around the city. It's my favorite dessert so I also keep an eye out for restaurants that make it well! Milky, not too sweet, and warm and fresh.", "author": "Veena K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "Good quality - we had originally gone on a coupon but were happy with our food. I also liked their iced desserts, which you can't get everywhere. Good service too.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-11", "description": "An excellent choice for reasonably priced authentic Thai food on the edge of Chinatown. \n\nThe Chicken Satay was flavorful, and Pad Thai Gai Noodle had ample quantities of both chicken and fried tofu along with the fried rice noodle, bean sprouts, and ground peanuts.  The slice of fresh lime added a nice touch.  \n\nWe ordered takeout but the seating area was neat and clean (although small).", "author": "Wayne R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-15", "description": "This is a nice new restaurant! There's a Scout Mob deal on right now for 50% off (up to $10 off), and this is how we heard about this place! \n\nThe prices are fairly inexpensive...I think everything is under $8 bucks! \n\nWe got the Thai Pork Jerky as an appetizer, which was quite crispy and it's served with a hot sauce. We also got the 2nd to last noodle dish on the menu, under the noodle section (the 1st on the top of the back page), which was absolutely delicious and a generous portion. We also got the very last item on the menu, under rice dishes, which is a shrimp an calamari dish. This was good, but not my favorite of the two main dishes. We accidentally ordered it \"as is\" as a rice plate instead of an entree' and there was an incredible amount of rice. I wouldn't have done that ordinarily, but it ended up being nice with the left over curry sauce from our noodle dish!\n\nI would highly recommend this place with use of the Scout Mob offer! I would still recommend this place otherwise too. The prices are good, the food is quality, and the server was nice. The food came out quickly as well! \n\nAlso, they have nice hand soap in the bathroom! Duly noted! :)", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-15", "description": "Navin Thai recently opened up its doors - and we couldn't wait to go for dinner. Its location just in between Nob Hill and Chinatown fills a much-needed niche for both convenient and delicious food in the area.\n\nIt's a relatively small place, but not too cramped. There is a clean, minimal type of ambience. It's casual - there's a TV in the corner - and it seems like a good place to go for two (not a first date though), or even a larger group. The wait staff is very friendly and approachable. \n\nOur first time, we ordered: the fried tofu appetizer, tom yum gai, side of cucumber salad, pumpkin curry, and Thai omelette. \n\nThe fried tofu was very light and crispy, and came as a pretty large portion. The tom yum gai was fantastic! It's very flavorful, with just the right amount of spiciness. I'd highly recommend it. The cucumber salad was very fresh - it looked like the cucumbers and onions had just been chopped up. It wasn't saturated or soggy, but still tasted sweet. \n\nI really enjoyed the pumpkin curry. They do not ask you to specify how spicy you'd like it (I suppose you could ask if you really wanted to). It came out just right - enough of a kick without being overwhelmingly spicy. The pumpkin is cooked so that it's soft and literally falls apart in your mouth...not chunky or too tough. My only slight criticism is that the curry sauce starts to taste a bit heavy after a while. I think it's a mild complaint.\n\nI didn't have much of the omelette, but it tasted pretty good and comes with rice underneath it.\n\nPerhaps the greatest part? The prices are actually very reasonable! Overall, Navin has convenience, service, good food, and affordability. It's a win-win, and a great addition to the area.", "author": "Alyssa W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-21", "description": "So sad! Their service has gone downhill and they only take credit cards with a $15 dollar minimum. This makes me upset because this was never the case. Why must you do this? Going to Tuk Tuk from now on.", "author": "Portia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-17", "description": "Hello friends! Finally a good place to get take away in the hood, \n\nI got the fried calamari and it was good. Sweet sauce was so good. Not enough though. I wanted more. \n\nThe cashew chicken was ok. Good taste and size. \n\nI will def go back.", "author": "J a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-29", "description": "Happy to see that a successful place has finally taken over this little shop. Used to be Hotaru, not that I ever saw anyone eat there. \n\nWe had the pad thai, pad see ew, and the thai fried rice, which make up the common trio of American Thai food. Standard Thai food, with ample portions, though everything tends to be on the blander side (just dump on some of that vinegary pepper sauce). Price point hovers around $7, with $2 bump if you want shrimp in your dish. Everything reheats very well the next day, so leftovers were great.\n\nCurrently on Scoutmob, so you can get 50% your check, up to a maximum of $10. For three people ordering a dish each, this works out to a $13 meal before tip!", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-09", "description": "Overall, good food and quick delivery. Not many food choices in the financial district after 7 PM, so this place is a good option. Veggie rolls were great! They were little and individually wrapped (not cut in half) but many came to an order. Papaya salad was average.  I ordered it \"mildly spicy\" and it had some heat, which I liked. Veggie fried rice was tasty.  Solid portions of everything ordered. YUM!", "author": "Kandis P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-08", "description": "This is a favorite spot for both my family and my co-workers.  It is a cozy place with good food and excellent service.  There are daily lunch specials for $5.99, offering everything from rice dishes to noodle soups and rice soups, most in pretty generous proportions.\n\nMy co-workers and I have tried nearly everything.  What's really good: spicy eggplant with chicken; spicy tilapia with tamarind sauce; pumpkin curry; grilled pork chops; tom yum soup.  My kids love the golden rice (curry rice with meat and vegetables), pad see-ew (Thai version of chow fun), chicken satay, and roti.  What's not so good: The pad Thai is a bit too salty; the breaded, fried chicken served as a lunch special is often over-cooked and dry. \n\nOverall, this is a great place.  Good food, good value.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-08", "description": "Came here with the Scoutmob deal for 50% off with $10 max discount. I originally wanted to order to go, but you had to eat there in order to use the coupon -- makes sense I guess. When I was deciding what to order, they gave me a cup of thai (not iced) tea, which was a nice touch. They never topped it up or offered me water after I told them I had the Scoutmob deal though, haha! nice. I guess that's one sure way to turn off the waitress.\n\nAfter much debate (over their pretty extensive menu), I ordered: \n~ Gang Leang: Peppery soup with pumpkin, zucchini, spinach, mushrooms, basil, and shrimps. The soup was definitely peppery -- so much so that I couldn't finish it. It was also quite salty. The vegetables were quite basic (aside from the pumpkin), and it had maybe 5 shrimp in it. Also not sure why this was $8. \n~ Guai Diew Chiang Mai (took to go): Ground chicken in Northern Thai curry sauce served over egg noodles with shredded cabbage. There wasn't much meat with this dish, and it only came with cabbage and a few pieces of diced up peppers. nothing special -- not sure why it cost $8. The curry also had an extremely strong basil flavor, which wasn't what I expected. The dish was also quite small -- it only took up about 3/5 of the plastic to go container. \n\nI came here around 12:30pm on a weekday afternoon (prime lunch time), and there were only two other tables other than me. With all the great thai places in the city, this place really needs to step up their game in order to survive.", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-16", "description": "I don't actually like Thai food, I think it's weird to mix condensed milk with spicy curry and a ton of citrus then pour it all over your rice. I think the noodles are too greasy and the chinese versions are better, but I thought I'd give it another shot and explore the menu at this new establishment for something I'm not familiar with to maybe change my mind. \n\nFirst I got the Silver Salad, this was absolutely fantastic and the dressing tasted very similar to what they use in vietnamese bun, which I love. It's not really filling though so I wouldn't order it as an entree. I also had the Guai Diew Chiang Mai, which by the name of it I had no idea what to expect, which is why I ordered it, but it was fairly disappointing since it was nothing more than pad thai with chicken. I'm pretty sure the menu said it was suppose to be served with egg noodles, but it came with flat rice noodles. Maybe they really just gave me chicken pad thai since this dish is so exotic that they thought I couldn't handle it. Then there was a Tom Yum Noodle Soup, which was kind of a thai pho. It pretty much would be pho except the soup reminded me of thai curry. It was actually a very refreshing flavor in the broth. \n\nI have this theory that to really get a great experience it's better to go the road less traveled by, and since this place is pretty new it was a great way to test out this theory. I wasn't really disappointed, since I discovered Silver Salad, but the rest was just good, not great. But on the upside, at least I didn't end up like the Donner party when they took Hasting's cutoff instead of the northern route to get to California.", "author": "Teng L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-23", "description": "The restaurant looks nice and clean. I tried the Thai iced coffee. It is very sweet and creamy.  I can barely taste the coffee. It was OK.  I tried the Tom Yum Soup with small rice noodles. The broth is pretty good, and creamy. They must have added milk to it. The vegetables and seafood were fine. The small rice noodles are OK. They were a little sticky. After some mixing,  they were fine. I think the rice noodles were a little undercooked. After Waiting a couple minutes the noodles were pretty good. The Roti (Indian pancake) with condensed milk is really good. The roti was warm and slightly crispy, sprinkled with sugar and drizzled with condensed milk.  Customer service was good.  A good place to go to if you are in Chinatown and do not want to eat Chinese food. I took pictures.", "author": "Hiroshi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "We tried the Shrimp summer rolls for appetizer. Spicy eggplant dish and a yellow curry dish with meat. They were all very delicious", "author": "Marjan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-20", "description": "The chicken pad Thai her is awesome! They delivered to the marina in about 45 minutes. The food was fresh, light but still very filling! Would definitely order again.", "author": "Allison D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-02", "description": "I haven't eaten their food. The reason is because I ordered through delivery.com and the order never came. I called them over an hour after placing the order and they told me they don't deliver on Sundays. They told me someone from the restaurant contacted delivery.com and it was the website's responsibility to contact me. That never happened. I called delivery.com and was told no one ever contacted them and if they did not deliver they should not be on the site at all.", "author": "QC Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-04", "description": "I came here because Scoutmob had a 50% off deal with $10 off max.  \n\nI've always wanted to try this place because this location has changed hands many times and finally I am excited that there is a Thai restaurant in Chinatown and only a few blocks away from my uncle's business.  I couldn't wait to try this place because I've heard good reviews so I came here with a few people and ordered a lot of dishes.   We had the Tom Yum Goong (not good at all because it wasn't spicy or sour), Pad Kee Mao (not enough flavor but it wasn't oily), chicken satay (it was ok, nothing special), another kind of Tom Yum with chicken (the best dish so far and very flavorful), chicken pad thai (eh not great either) and that fried rice (my grandpa liked it so i guess it was good).  \n\nWith so many dishes and drinks ordered, the bill came out to about $80 and that's with $10 taken off!!! Thank goodness I didn't pay for it because it was not worth it at all.  Service was great but I would rather go to King of Thai.....sorry.....", "author": "Irene L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "My go to place since it's not as crowded as eating in Chhinatown.  The curry noodle with chicken hits the spot every time.", "author": "Eesayah O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-12", "description": "Nope. I will not order this again. \n\nFood is completely bland and hardly has any flavor. Pra ram is watery and barely tastes like peanut sauce. The pad thai is super dry and, again, lacks nearly any flavor; not to mention the chicken is pretty much non-existent. For a while, we thought they gave us jasmine rice instead of the coconut rice we ordered, but I think it was just really, really dry.", "author": "Colleen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "The food was really tasty, and they delivered it in less than 30 minutes after my order. Even the \"very spicy\" food was balanced despite the heat. Pretty decent prices as well.", "author": "Andy A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-29", "description": "Do not order delivery. The food came quickly, but was not ready. I like my veggies crunchy, but not this crunchy. The first spring roll was almost crispy, but the rest were still dough-y, totally under-fried. The red curry was totally watery, and there was not nearly enough rice even though I paid for extra.\n\nThe flavor was terrible. It tasted somewhat how I expect red curry to taste, but like the ghost of red curry. Just order from somewhere else.", "author": "Ben B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-17", "description": "I just came here for the first time for a work/ lunch meeting and it was fabulous! Don't judge a book by its cover, because this little restaurant is easy to breeze past on a quiet strip of Powell but inside is a gem! Everything from the service to the ambiance and the food was excellent, \n\nTheir menu has much more unique selections than your \"usual\" Thai place, we had a pre-ordered meal for our group of 15 and got to try a little of everything.\n\nAppetizers: \n- Curry chicken rolls: tiny, bite size morsels about the length of your thumb but packed with delicious savory filling. Not a lot of curry flavor but definitely something different from the usual egg roll.\n- Fried tofu Triangles: nothing special but came with a yummy tamarind and peanut sauce. \n- Corn Fritters: bursts of sweet from the kernels the batter is lightly fried and did seem too greasy. I LOVED this. \n- Tofu Salad: A generous portion of fried tofu over a bed of romaine lettuce with mint leaves and red onions. Drenched in a chili-lime dressing, perhaps the dressing was a little overwhelming. \n\nEntrees: \n- Pumpkin curry: BEST pumpkin curry EVER. The curry was a perfect balance of creaminess and lightness. Was not to watery or oily. THe pumpkin pieces were cooked until it was very soft and buttery but not falling apart. LOVE. \n- Golden Rice: very light fried rice, went great with the curry. Big pieces of chicken and really liked that it had crunchy cashews in it to give it a nutty flavor. \n- Pad See Ew: Typical pad see ew, nothing too awesome nothing too bad about it. \n\nThai Ice Tea: only $1.95! Sweeeettt. \n\nThe service was really nice, our waters were always filled, the food came out pretty regularly, even though they had plenty of take-out orders to take care of. I loved the ambiance- lots of natural light from the large windows facing Powell- cables cars rumbling by. The walls were a warm, light purple color with Eastern-inspired decor. Navin keeps this place classy and casual, the only thing that felt cheap here was the prices!!!", "author": "Eva H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "I think this is the best place for casual Thai in SF (and I've been to quite a few). Quick delivery, reasonable prices for Thai (though I wish the appetizers were a bit cheaper) and wonderful service. \n\nTheir Tom Kha Gai is the best I've ever had, and the curries have all been great so far. I'm glad it's near me so I can work my way through the menu!", "author": "Miguel V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "Navin restaurant is on Powell above Chinatown. iWork in Union square and slup up the hill almost daily for lunch. it's that good. they have a wide selection on inexpensive rice dishes and noodle lunch specials for $5.99. It's tasty and just the right amount. Try them. You won't be disappointed !", "author": "cory S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "We happened upon Navin Thai on our way back to our hotel room. The menu looked amazing, and as we caught them before the dinner hour, they were fairly quiet.\n\nWe ordered two menu items, one with seafood, and one with pork. They were fresh, the meats were juicy and delicious, and the sauces were soooo flavorful!\n\nIt was a great value as well for the portion sizes. I would definitely recommend stopping in if you're in the neighborhood.", "author": "Kaycie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-08", "description": "Questionable origin.\n\nName: http://en.wikipedia.org/wiki/Navin\n\nGood wine in French. New beginning in Indian. Neither have anything to do with Thai food. Questionable where the name comes from.\n\nFortunately there is no question how good the food is. Rare to find steamed dishes offered. Even rarer to find one as good as the Pra Ram.\n\nEnough chicken and veggies for two meals. Delicious peanut sauce served on the side. Perfect for dipping. Didn't need the dish ruined by excess.\n\nLess than ten bucks. Plenty of other good looking stuff on the menu. There is no question Navin earns five stars.\n\nP.S. Thanks to yelper Mai L. for messaging to say Navin is the family's last name!", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-08", "description": "11/16 delivery (quick)\nPork chop - awesome\nSpicy angel wings - just as good as king of Thai's, only 5 wings/order though\nTom kha gung - good\nChicken fried rice - average (as expected for fried rice)\n\n\n12/7 - dine in \nPad Thai chicken - good\nEggplant salad - really good - really nice grilled flavor on eggplant, shrimp was good, kinda like a larb salad with eggplant shrimp and lettuce", "author": "King D M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-16", "description": "This place is located near the upper portion of Chinatown - one of the more undiscovered places, compared to the restaurants in the main part of Chinatown. \n\nI had a 50% off coupon from Scoutmob, and my friend and I decided to come here at around 12PM or so. The only people in the restaurant were two guys and a grandma.. And the waitress, of course.\n\nWhen we came in, the waitress seated us right away, by allowing us to choose our own seats. \n\nThen she gave us menus and we just chose what we wanted. My friend got Pad Thai, and I got the Tom Yum Noodle Soup, courtesy of the Scoutmob recommendations. Our food came quite quickly. The portions were moderate - not huge, but not small either. \n\nI didn't sample my friend's Pad Thai, but she said it was good. As for my Tom Yum Noodle Soup, it was spicy spicy spicy. I love spicy food, so this was a winner for me. It was also somewhat sour, which evened out the flavors nicely. As for the noodles, it was just the way I like it - soft, but not too soft, and easily chewable. They had fish balls and shrimp. The only thing I didn't like about it was that it was hard to slurp, since it got kind of messy.\n\nWe paid about three dollars each, and the food was filling. The flavor was great, and with 50% off, this meal was a total steal!", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-13", "description": "This review is long overdue.  Navin Thai is a gem located right by my work place.  My co-workers love coming here for lunch.  The food is amazing and the people here are  simply the nicest folks.  \n\nWhat sets Navin Thai apart from other Thai restaurants (other than the charming folks there and amazing customer service) is their interesting menu selection.  You can interesting curry dishes like \"Spinach Curry\", \"Fish Curry\" , \"Roast duck curry\" among a variety of others.  Even their fried rice offers several different options.  I still have yet to try all of their dishes.\n\nI highly recommend this place.  Reasonably priced, tasty, excellent customer service, cozy place.  What more can one ask for?", "author": "Nip Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-14", "description": "I like this place! It may not be the best Thai food, but dang they get their spice right! The Spicy Angel Wings and Spicy Noodle are my go to dishes. I LOVE spicy food. I ask for extra spicy and by the middle of my meal my nose is running and mouth is on fire and I love it. My boyfriend had to order a few dishes before he found what he liked there, which ended up being one of the eggplant meals. \n\nThe staff there is friendly, the ambiance is nice, and it's a cool place to sit and people watch. I'm a fan.", "author": "Victoria D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-31", "description": "My coworkers and I love eating here! We probably go once a week or every other week. Everything is tasty, though my absolute favorites are the pumpkin curry and tamarind fish. I love the tea too! And prices are very fair, around $7-10 per dish\n\nSince we come so often, the owners recognize us and treat us very warmly, which is always appreciated! Today we got generous samples of their Navin smoothie (fresh lychee, pineapple, mango and some other fruit?) It was sooo refreshing and delicious. Definitely try it on a hot afternoon!\n\nApparently they are getting a liquor license soon, so that will be nice should I ever decide to come for dinner instead!", "author": "Mai L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-25", "description": "I don't know what it is but it's really difficult to find good thai in SF. Nearly every place I've tried has been a let down, and Navin was no exception. The best thing going for them was the quick delivery to Pacific Heights during midday lunch rush -- barely 30 mins. That's what merited the 3rd star, otherwise woulda been 2.  \n\nThe food:\n- spicy noodle (aka pad kee mao at most other spots), asked for extra spicy and it still barely had any spice. Overall flavor was bland and I got lots of plain noodle taste  \n- red curry chicken: curry was watery but spice level was good. Not much else to be said \n- chicken fried rice (freebie for ordering $20+): exactly as expected. Really this was the only thing that didn't let me down. \n\nProbably wouldn't order from here again. I'll stick to Osha Thai, despite its higher price point.", "author": "Farhad M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-15", "description": "Went here with pretty low expectations and was still surprised by the mediocrity of the food. The service was excellent, but that was about it. The chicken in the chicken satay appetizer was pretty bland and rubbery. I'm fairly convinced the base of the panang curry was tomato soup. The spicy noodles were decent, pretty spicy but that was about the only flavor in the food. \n\nI'd recommend it for quick, cheaper, mediocre thai food. If you're looking for anything beyond that, this isn't your place.", "author": "Ashvin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "I've gone here many many times. The quality is consistent, the staff are friendly, the health rating is good....everything you could ask for from a local Thai restaurant.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-24", "description": "It would be a okay thai resturaunt, if they let you pay with credit or debt without such a fucking high minimum. Lunch specials are 5.99 min is 15.00... im not buying 3 fucking meals for lunch wtf is that. Also they don't even post thier lunch specials online and tell you to come in and take a picture. Wtf is that.........the point of the online menu ia to know what you sell.", "author": "Anthony M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-15", "description": "Nice, friendly neighborhood Thai joint. The food is pretty good, the service is fine, and the Singha beers are $1. Appetizers: I liked the fried tofu and the potstickers, but the fried calamari was slightly overcooked and tough. Entrees: The Pad Thai was good, and the Golden Noodles too. I've had a couple of tasty noodle soups as well. \nThe restaurant is clean and the wait staff friendly and attentive and I enjoy the relaxed ambiance. A good if not challenging place to get a meal.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "Okay, I admit it.  Lately, I've been bargain hunting for food.  So yes, I chose this place because they were featured on Scout Mob for 50% off.\n \nAfter a long trek over, we finally arrived at Navin for lunch.  There was only one other table of people, so there was obviously no wait.  Service - friendly, quick.  Interior - clean, with nice natural sun light.\n \nI ordered the broccoli in oyster sauce w/ rice (brown rice is available for 50 cents more): $6.50 or so.  My sister ordered the calamari salad, which was somewhere around $9.\n \nEverything came out about 10 minutes later. And...yum!  My vegetables were really fresh and perfectly cooked - no soggy broccoli, carrots, or anything else.  The sauce was really good too - it was light, and perfectly flavored.  My sister's salad was delicious - the dressing was tasty, and there was chopped mint in there as well, making the salad very spring roll-esque.\n \nOverall, a great lunch, and with the Scout Mob deal, we each paid around $6-something including tip.  Get it while it's still available!", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-15", "description": "Literally a month old, and I saw a Thai restaurant FINALLY hit the Chinatown border. About time. \n\nTAKE AWAYS: \n- Dine-in/Take-out, no delivery. \n- Prices are very competitive with Chinatown just a block away. And it shows. \n- Their side menus are super deep (you can peanut sauce all the way to fried eggs). Deploy as you will.\n- The decor is fresh and new...a nice break away from the local dive eats. \n- The staff were very friendly, and though it takes time to prepare, it's worth it. It has a very made-at-home-food taste. \n\nBottom line, as a resident in Nob Hill, this is quite a welcome addition and worth the extra $2 to not walk all the way to King of Thai (local win).", "author": "Abel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-13", "description": "We have been here a few more times since the last review and each time has been a pleasant surprise. I suppose we don't really have high expectations of Navin when it always seems empty, but the food is good, fairly priced, and the wait staff is nice. While the decor is really nothing special, the space is peaceful and clean. \n\nTonight, we had the duck noodle soup and the flank steak salad. Both dishes were simple. The flank steak was cooked medium rare and surprisingly tender. The salad was dressed in a mint/basil fish sauce concoction that got a little salty towards the end. Still tasty though. The duck noodle soup could probably benefit from a little more duck and bean sprouts, but the dish still hits the spot. \n\nNavin is consistent and open until fairly late, so it's a good dinner option when your fridge is empty and you are out of ideas.", "author": "NickJess S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-01", "description": "Last week I was feeling particularly lazy, decided to get takeout and Navin is the closest place to my residence without venturing into North Beach.\n\nTo go items:\nPumpkin curry + rice (it doesn't come with): amazing. I love pumpkin!\nTom yum gai: not exceptional, a bit salty for me.\n\n3 items + tip = $20 and a filling Wednesday night dinner.", "author": "Sara P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-16", "description": "Tough to give this place a four star rating which personally I reserve for \"excellent\" dinners. I might be a little tougher than most but I actually think this is a real solid little neighborhood spot.\n\nI would recommend this place for a.) If your feeling lazy and live around Powell, Clay, Mason, Washington Streets of Nob Hill. b.) Want something cheap and pretty darn good Thai food that's hassle free.\n\nI will note that many other reviews state on here: DO NOT order DELIVERY from them as I made the mistake one time and it took them 1 hour to deliver my food after I had to call them to check in and I only lived three blocks away. They haven't figured out how to do delivery right yet but take out is really solid.", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-21", "description": "I really like this little place.  I had some sort of prawn and calamari dish with bamboo shoots and green curry paste.  It was nice and spicy and the prawns were fresh and sweet.   The Japanese place that was in the spot before was ALWAYS empty even though the food was decent so maybe the location is cursed.\nI'm rooting for this spot!  Give it a try if you live nearby or are in the neighborhood.", "author": "Nico B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-19", "description": "This restaurant is a great value. The food is delicious and their prices are very reasonable. Most people in the SF area are familiar with King of Thai when it comes to cheap Thai food. Navin is much, much, MUCH better quality food and only a little bit more expensive than King of Thai.\n\nThey do not have a liquor license yet so there is no beer, wine, or spirits of any kind. For that reason I'm bringing my review down to 4 stars, but other than that this place is definitely worth checking out.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "Been eating here for the past 3 months for lunch.  Best lunch menu. Very generous portions and very fresh ingredients. Try the pork chop beef stew and basil chicken. They are delicious.dinner was great too. My kids love the smoothies, lumpias and the papaya salad is the best in town.", "author": "uncle m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-06", "description": "--------DINNER ONLY-----\nGREAT duck noodle soup. This was my favorite dish. The restaurant is pretty solid in terms of price (pretty cheap) and quality (it's not the best but it's pretty good). Never empty, super conveniently close and they had a Scoutmob deal. Pretty win.", "author": "Diana Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-12", "description": "Docking 2 stars from my original 5 star review. Ordered for a 2nd time and it completely underwhelmed.  I don't want to trash the place- it's ok.  But just that:\n\nOrig review:\n\nGreat menu - varied Chinese and Thai dishes.  I've only eaten here once so far but it's CLEAN FOOD - non oily and NON MSG goodness.  This will be my go-to spot for chinese or Thai in the hood from now on!  Timely delievery too.  But yo, how about some napkins and utensils?", "author": "Kyle K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-01", "description": "Ok, was your normal thai thought the service was friendly but I was just expecting a little more infusion and creativity.But I was most disappointed that my favorite dish padseeew tasted very plain and bland", "author": "Giovany P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-14", "description": "14.09.29  Updated\n\nFood ----- 3 1/2 - 4 stars (depends what u order)\n\n       They have a lunch special these day.\n       A lot of construction people working on either\n               new hospital and/or new underground subway, and other\n               local workers ordered  the \n\n                  grilled tamarind pork chop on the lunch specials\n\n       Like many restaurants there are some dishes a hit and some ok.\n       Like I always say never be shy to customize your order ... ex\n             thicker sauce\n             more spices or spicier or sauce\n\nDid not try everything even though I have been there more than 50 visits for 2 yrs\n    Personally I order (some w mods)\n         Country Fried Rice (asked to mild ... regular is pretty spicy for me)\n         Grilled Pork Chops\n         Moo Dang Rice (both style wet and dry)\n         Red Curry ... (asked for thick sauce)\n         Fried Corn Fritters\n         Fish Cakes\n         Pork Cutlet\n------------------------------------------------------------------------------------------------\n\n12.10.02\n\nNote: If u have the original menu when they opened... check the internet\n       for the lastest one. Yes, a good sign of a good chef willing to change\n       his lineup to make it stronger. The eggplant salad mentioned below \n       was a good additional to the old menu.\n\nLike I said in the past ... every restaurants have some strong and weak dishes.\nIt is a matter building a list of strong dishes and/or \n      on the next visit ask for some modification to fit your needs like\n            less or more spicy\n            regularly cooked salmon or medium rare\n            etc ... you get the point\n\nAmong my favorites lineup:\n          - Curry Duck\n          - medium rare cooked salmon salad\n          - Masmun Curry Ribs\n\n   new- I add the eggplant salad ... requested medium spiceness because \n                    of the heat wave...\n                    Did a takeout on this\n                           quartered tender soft boilded eggs seated on each corner\n                                        of the box\n                           grilled eggplants\n                           grilled shrimps\n                           ground pork\n                           romaine lettuce\n                           red onions\n                           shallots\n                           chili lime dressing\n\nCan't wait to checkup the other new additional players.\n\n---------------------------------------------------------------------------------------------------------\n06/14/2012   \n\n\nFood      3 1/2 stars and rising\n\n       Tried another one of special that they post on the window.\n       It was some ribs marinated thai spices and slow cooked in a curry.\n\n       I belived they used beef ribs and good portion. There was at least\n           6 ribs worth. Huge amount of meat ... unheard of for this dish.\n\n       It was ...74. Masmun Curry Ribs $15.95\n                          Tender pork ribs slow cooked in southern Thai curry \n                                       with onions, and potatoes.\n\n------------------------------------------------\n05/31/12\n       Saw the new specials posted other than the main menu\n\n       The pork belly cooked in thai spices and fish sauce was delish.\n       It also had loctus root that soaked up the sauce. Glad I tried it\n\n------------------------------------------------\n02.01.2012\n        Back again...\n        They are fast ... placed an order and it was ready within 5 minutes.\n        They are now accepting credit cards even Discover ... rare find\n\n\nThai Fish Cake\n        A little softer in texture than most places.\n        The flavor was pretty good.\n        Served with 5 pieces along with a sweet thai sauce toppped with \n                 cucumber and (Peanuts?)\n\n\nSpicy Noodles\n        Good portion of rice noodles\n        Moderlately spicey for me\n        I would try another type of protein instead of grounded beef\n        \n\n\n-------------------------------------------------------------------------------------\n01.17.2012\n\nThe Pad Thai with Shrimp was pretty good\n        There was about 7 pieces of shrimp ... pretty good amount ...more than \n                 some other places.\n\nThe beef with red curry plate was not bad ...\n\nThe corn cake came in 4 pieces and spicy & sweet dip  was not bad.\nMinus\n    The small calamari was fried a little bit too long.\n\nThe place was average to me.\n\nmore details ...\n\n\n------------------------------------------\n12.01.14                         \n\nThis place took over \"Hotaru\", a struggling Japanese restaurant several days ago.\n\n\n01/14/12 - 08:37am  \n                   In the morning the place still had paper plaster on it's window.\n\n01/14/12 - 05:45pm \n                    Papers on the windows removed.\n                    All the lights were on.\n                    \"OPEN\" sign  was lit.\n                    Did not know if it was a test. I was on the cable car as I passed by it.", "author": "S.K. Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-10", "description": "Was in the area and wanted to find something cheap to eat, so my friend and I decided to come here and use the Scoutmob deal. Ended up VERY satisfied and only paying $10 each for a feast!\n\nOrdered the tom yum noodle soup, pumpkin curry, chicken wings, and thai iced teas. Yes for two people...don't judge! \n\nChicken wings with sweet and sour sauce (appetizer) - the chicken wings itself were fried to a nice crisp and had a good garlic flavor to it. They make their own sweet and sour sauce, but it's very similar to the one you can get in a bottle. 5 pieces per order.\n\nTom Yum noodle soup - very flavorful, perfect balance of herbs/spices and ground pork, and a HEAPING amount of noodles. The broth was gooooood. Tangy and light.\n\nPumpkin curry - vegetarian dish, comes with jasmine rice. Can't go wrong! \n\nPrices are super reasonable. Our server was very attentive and helpful. She even noticed I dropped my fork but before I had a chance to pick it up, she was already there with a new fork. Impressive! Granted we were the only people dining there at 3pm on a Friday afternoon...but still.\n\nI do want to come back and try their crab cakes!", "author": "Moraia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-08", "description": "To be honest I didn't have too huge of expectations for this place. I was starving and just literally looking for a place as close to the place I was staying as possible. It was super cheap for the amount of food, which was absolutely deeeelish! And when they say it's spicy, it sure is spicy!", "author": "Rowena L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-18", "description": "Crab Fried Rice and Mango with Sticky Rice delivered. \n\nThere was a giant hair in my crab and lots of shells. Sticky rice was dry and hard.\n\nNot good.", "author": "Brandi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "The food was real good.  Portions were a little on the small side.  I ordered for pick up and it was ready when I got there.  Excellent service.", "author": "Amy V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-05", "description": "Stopped into this little restaurant to fulfill a craving for thai food while I was visiting the city.   Easily within walking distance from our hotel near Union Square.  Tiny inside, but our waitress was extremely friendly and fast.\n\nWe ordered way too much food for two people - servings are quite large.\n\n- Vegetarian Spring Rolls were yummy (and hot), the sauce was very good.\n- Pumpkin Curry wasn't very spicy, but it was definitely delicious, I wanted to drink it. Mmm!\n- Pad Thai Gai with chicken was flavorful (had to add some spice to this one), not the best I've had, but it got the job done.\n- Bangkok Fried Rice was HUGE, would have liked it a little drier, but it was still delicious.\n\nWish we wouldn't have been visiting because the leftovers would have been well worth it.\n\nA lot of people were stopping in for take-out orders - their website allows you to order online.", "author": "Lindsay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-22", "description": "This is the first Thai place in Chinatown I've ever been to and I was born and raised in Chinatown. New establishment and great cheap prices comparable to Chinatown restaurants. \n\nTheir thai ice tea and thai ice coffee were too sweet for my taste but their pad see ew was AMAZING! I like that the chinese broccoli was crunchy and the noodles weren't super greasy.  \n\nDon't know if they deliver but if they did... :D!", "author": "Linda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "Ginger Rice - Simple but goes great with Duck or Chicken Curry!\nDuck curry is my fave so far just bc I love duck!\nAffordable and the staff are super friendly! \nWill be back!", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-29", "description": "Food is delicious and delivery service is awesome!  Price is very reasonable!!", "author": "Mercy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "For the price, the food is pretty good. For some reason, the food tastes better if you don't order it out, but it eat in the restaurant. Weird--I know, but every time I ordered the food to go it did not taste as good as it does in the restaurant.", "author": "Lisa Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "Very good and traditional Thai in the neighborhood.  I have been very disappointed at the local selection of Thai and have searched for a great place.  The Tamarind Fish is one of my new favorite neighborhood dishes and I have been back a handful of times.  Every thing is really good but that Tamarind Fish dish really draws me back.  Delivery and online ordering is super easy and they usually have a fee item which have always been a significant portion and delicious. Thanks!", "author": "Nathan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-31", "description": "I ordered the pumpkin curry and it missed the mark.  Good spice, good pumpkin, but overall too salty.  Also it only had a little pumpkin, three slices of raw bell pepper, and nothing else.  I'm used to other veggies (at least onion) and chicken or tofu in my pumpkin curry.  There was not enough pumpkin in the curry for it to solo.  \n3 stars because the staff was very sweet and I want to go back to try other things.", "author": "Esembee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "Great thai place! Quick delivery and consistently good food. The pad thai is the best I've had in the city. The menu is fairly extensive and reasonably priced.", "author": "Tina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-06", "description": "I've eaten there twice and was pleasantly surprised by the polite service and fresh tasty food.  The first time I had some Prik King and Spicy Angel Wings for a sub 20.00 lunch, and a tasty Thai Hot Tea.  Beans were fresh and cooked perfectly, and was spicy enough for me.  My second time, I had Veggie Spring Rolls, Spicy Noodles w/Beef, and a Thai Iced Tea. Again was treated to a perfectly cooked meal, an excellent value and a nearly empty restaurant (which I didn't mind).  Clearly their delivery business is robust, but it's on the edge of Chinatown and Nob Hill, so not the busiest corner on the hill, after a long day of attending a crowded conference--it was a welcome relief.  Great food.  Will go back again (maybe tonight)!!!", "author": "Daniel O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-14", "description": "This place is close to my job so I eat here about twice a week.  They have $5.99 lunch specials if you order before 4pm.  However, there is only 2 protein choices: chicken or tofu.  The food is definetely good for the price.  The service is quick and friendly. I tried a few items from this restaurant, but  I recommend the spicy basil ground chicken or the tom yum noodle soup.", "author": "Eva E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-25", "description": "Ordered food at 7:50pm on a tuesday which was tough because the woman who answered the phone DOES NOT SPEAK ENGLISH....how are you going to answer the phone and take orders if you cant speak english?!?!? So frustrating. 9:20 pm I have to call and ask where my food is...she has no idea. I call another place, order, walk 4 blocks and pick it up and when I get back to my place the driver is there...its like 945 pm by then. I tell the guy Im not interested.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-23", "description": "This restaurant is on my block.  It is a bit hit-or-miss for takeout.  I've had watery curry and greasy noodles.  However, the service is good, fast, and it's convenient for me, so I'll keep ordering when I'm too lazy to make it to my favorite Thai spot.", "author": "Lei E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-22", "description": "HANDS DOWN THE WORST THAI I HAVE EVER HAD.  Thai has been my favorite cuisine since I went to college, so I have lots of experience.  I got the panang curry and it was DISGUSTING.  It tasted like pool water (same consistency) and the vegetables were essentially raw.  The manager called me back when I complained, but just said \"That's how we do it. Go ahead, give us a 1 star, I don't care.\" He's rude and I'm embarrassed for the restaurant.", "author": "Kate B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "Kind of tastes like generic Thai food. Nothing too special, but at least they don't mess up any dishes! Great find in Chinatown!", "author": "Mel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-11", "description": "I've never been to the restaurant but I've ordered out from here a few times. The soups at Navin are so so so good. I love spicy food and even the \"mild\" spicy is hot enough for me. The Tom Yum Goong is the best. The Tom Kha Gai is also delicious. You can order a cucumber salad for a few bucks more, which I'd recommend. They also make a great Thai Iced Tea. And the delivery is very fast.", "author": "K F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-26", "description": "Another very good Thai restaurant in SF - had the gwaei deu ubon or something like that - amazing curry over rice noodles...super good and not a typical thing to be on a thai menu, scoutmob got me 50% off, but i would be back and pay full price any time.", "author": "Ben B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-22", "description": "It's not the best Thai food I've had, and it's not the worst. Every dish I've tried is good, but just about misses the mark to being absolutely delicious. I go back because it's in a convenient location for me to dine in or order pick up. I do appreciate the great customer service, and that Navin smoothie too.", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-18", "description": "Been eating in SF for over 50 years and this Thai food is great. The service is warm and friendly , so I looking forward to a second attempt to see if we match the first visit.", "author": "Darius B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-25", "description": "The food was awesome! The pad thai tasted really good. I love the ginger rice! Always loved ginger anything and this ginger rice was cooked to perfection! I especially like the soup with pumpkin! The pumpkin was delicious, the texture was just right and so sweet.", "author": "ikakeh i."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-29", "description": "Had lunch there, nice location to watch the cable cars and the folks riding.. I was lucky to get a window seat :)     Well kept. Clean, Nice decor.  Big bowls of great tasting soup, pretty reasonably priced...  Wait staff was attentive and pretty.  Rice noodles in my soup of  mixed meats & spicy were done perfectly ( no lumps ).  Wish I knew how to use chopstix. :D", "author": "W M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-15", "description": "Why is there no zero stars option? I can't rate the food because they canceled my order after teasing me with \"10 more minutes\" for an hour (now been waiting 2 hours). Terrible. Service. Starving girl. :(", "author": "Faith S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-18", "description": "Pretty dry chicken pad Thai.....disappointing.", "author": "Ray W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-25", "description": "In town on business, went in for a quick bowl of soup. The Tom Kha Gai was delicious!", "author": "Diana V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-15", "description": "This is might be the weakest Thai I've had in SF.  The spicy level is pathetic for Thai and the food just tastes \"off\".  Like the meat is low quality or they cook everything in the same dishes without cleaning them first.  I would never go here again.  They delivered extremely fast though - less than 30 minutes.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-10", "description": "Just ordered this place for the first time for some casual delivery food. Got the tom kha soup and was so salty it was inedible. Definitely not ordering from here again.", "author": "Caleb S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-06", "description": "I used love this place for lazy nights in because of their fast delivery and friendly service.  However, when it comes to the food it can be up and down.  I usually get red curry and always order medium, but sometimes is not spicy at all and at others its so spicy I cant eat it.  There have been multiple times when you can see chunks of chili peppers and a layer of grease on the top.  Also, on many occasions they have gotten my order wrong and I didn't know until after I opened up the package.  Luckily they are always willing to make up for the errors and often include a free app.  I think I have given this place enough tries to not order from here anymore...(sad face)", "author": "Liz R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-27", "description": "Tried Navin Thai on a Tuesday night. Per usual my girlfriend and I used a scout mob to lead us to a place we haven't tried. From the outside the place looked cool-- small, and inviting. We overlooked the fact that the restaurant was empty because it is relatively new. \n\nWe ordered Guai Diew Chiang Mai, or as I prefer to call it, #43 (easier to say). #43 is a ground chicken and curry dish served over egg noodles. The dish was decently spicy without overwhelming the taste. We also ordered the Duck Curry w/tomatoes. Both of the dishes were winners. The only problem with the meal was putting up with my girlfriend not being able to pick a dish, they all looked so good. \n\nNavin's menu is extensive, I will definitely go back to try some other dishes. The price is good, as is the food.", "author": "Andy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-11", "description": "Sat down for a nice dinner her a few weeks ago. I had to take several stars away for the cockroach walking around on the back of our bench. \n\nSo, good food+not clean=won't be back.", "author": "Jane A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-22", "description": "Bad flavors...either too spicy or too bland. All of it greasy. Delivery was late. No utensils.", "author": "Julia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-26", "description": "I love discovering new places, so when I saw the grand opening sign at NaviN Thai Restaurant , I was curious.  What a great place for a terrific, inexpensive meal!  First, the place is clean and freshly painted.  It was late, so the room was not crowded; still it took a while for the food to come out. To me this means that everything is prepared fresh.  I am not getting stale lettuce that was chopped hours ago.  I was right.  We got to talk to the owner who was very welcoming.  His emphasis is on serving fresh food at a reasonable price.  I had the gang leang soup, peppery soup with pumpkin, zucchini, spinach, mushrooms, basil, and shrimp.  So delicious!  The spiciness did not overwhelm the other subtle flavors and the pumpkin added a creaminess that was excellent.  This soup is only $7.95 and can be a meal by itself.  We also had the BBQ salmon salad with a mango-lime dressing.  The combination of the dressing with ginger and mint leaves was perfect with the moist salmon.  Many restaurants serve this salad, but they do not prepare it as well.  I will return to sample the other items on the menu.  For a delicious, inexpensive meal, I don't think you can do better.", "author": "Esther Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-29", "description": "order Pad Thai, it was bad, the noodles weren't fully cooked; no flavor, and the chicken were dry.", "author": "Karen L."}
