{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "If you grew up in New England and miss that style of Chinese food this place is for you! Also really hits the spot when you're in the mood for unhealthy comfort food. Their pork dumplings are a good substitute for peking ravioli - an appetizer unique to Boston (if you're really interested in food look up the NPR story about Boston Chinese food- I promise I'm not totally crazy). I also like their crab rangoon, chow mein, and general tso's. I've only had delivery from here so I can't speak to the experience of a sit down meal. \n\nThat being said if you grew up with authentic Chinese food you are unlikely to agree with me and would probably rate it 3/5 stars.", "author": "Emma B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-18", "description": "I believe this is now Tai Chi --- but they respond to 415 567-2888 ( formerly Country Sky ) . We recently ordered Broccoli w/Waterchestnuts ( $9.00 ! ) and Cod Fish ( $12.00 sent the tiniest carton ) . Broccoli arrived yellow and way beyond edible . Cod Fish arrived absolutely ammoniated-spoiled and stunk to high heaven . Immediate gagging by aroma alone . Not borderline these , but dangerously putrid and smelled-up the hotel room , hideously . Phoned back to privately , respectfully request a refund ( b/c this could have merely been a massive mistake ) of $23 to include tax , and the woman I'd ordered from refuses ! I was shocked and asked  \" Do you respect your reputation ? \" \" Food is fine ! \" she retorts . Could not believe this recalcitrance .  I was letting her know what happened , quite confidentially . However , by now , I'm out of patience :  \" Do you want me to Yelp this ? \" And she hollers \" You are being rude ! \" \" You sent us rude food ! \" I replied , shocked again . And she slammed the phone . What is going on @ this absurd Tai Chi operation .", "author": "Denise D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "Great service,  I ordered delivery but mistakenly choose pick up on the yelp app and when I called they agreed to deliver My order right away!!!!  Thank you!!!", "author": "Ana B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-02", "description": "So I was watching Netflix and found a documentary about the \"Generals\" chicken. Turns out this is a super popular dish with an interesting story even though the documentary was more about the general history of Chinese food in the USA. I would recommend checking it out.\n\nBack to New Country Sky, after watching the documentary I had a craving to try General Tso's Chicken and so got on to Yelp to find my local place. The chicken was delicious and a complete comfort food, I can imagine myself growing old and fat just living on the deep fried saucy goodness. Although this is the first time I have tried it so maybe there is better stuff out there. I am now on a mission to try it everywhere.\n\nThe other food was average, fried rice was good, house special fried rice not as good, dumplings okay, egg rolls were suspiciously spring roll looking (have a feeling the order got mixed up), chow mein noodles were greasy but lacking flavor to justify the greasiness and I have a feeling my fortune cookie won't come true!\n\nAlso delivery took less than 15 minutes when it was quoted as 45-60 min!", "author": "Tristan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-10", "description": "This restaurant has moved to 3321 Steiner Rd. San Francisco, CA 94123.", "author": "Corbin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Absolute BEST Chinese food in the SFO area. Cozy place and good arrive to go. Out go to spot", "author": "Kylie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "My go-to Chinese spot! I've been ordering delivery from here since they were at their old location, and the food has been fresh, delicious, hot, and consistent the whole time.\n\nDelivery is always extremely quick, even on weekends. Food is hot when it arrives. There's the occasional mix up here and there with drink items, however, I always have my food. I am a little bummed out they don't deliver through Eat24/GrubHub anymore, but the website is just fine for ordering, I've never had problems with it.\n\nI'm just now reading about this new ownership/name controversy... and I noticed a review about Tai Chi having some health inspection issues. I did some surface level digging (Checking out Tai Chi on Yelp) and checked out their Health Scores. It seems like the health scores have been consistently on the up with past violations corrected, so I'm not sure I'm worried too much about that... especially if they are the same owners from New Country Sky's previous location. I will keep checking, however, I will definitely keep ordering from here... no matter what they're called!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-28", "description": "This was my go-to Chinese spot but now they've \"relocated\" but actually were taken over by Tai Chi? I don't understand but the delivery guy said I ordered from Tai Chi although I ordered on New Country Sky's website. Very sketchy! Tai Chi has been known to have health inspection issues hence why I've avoided them in the past. The fact that this new ownership isn't clear is pretty concerning. What else aren't they clear about?! I will not be ordering from here until there it's made clear what's really going on. :(", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "They've moved!!!\n\n2035 Polk Street\n\n\nThe best Chinese food in SF hands down!!!!!!!!  YUM YUM YUM!!!!!", "author": "Scott H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "We used to order from their location in the Marina, and continue to get delivery from their new location on Polk. Typical Chinese takeout menu. They do a great job with their chicken lo mein, chicken with broccoli, and pot stickers. Delivery is faster than most places (granted we live nearby - but still impressive to get our food in under 30 minutes).", "author": "Christopher J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-15", "description": "The wonton soup lacked flavor, even saltiness. The Green bean prawns was more flavorful, but you could see the ends where they were cut was old. Kind of pricey, but what do you expect in that part of town? I would say more geared towards non-Asians.", "author": "Brayden R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-16", "description": "My neighbor introduced me to his local \"go to\" Chinese spot when my wife and I were over.  The delivery time was ridiculously fast though aided by the fact that we live ridiculously closeby.  We ordered egg rolls, chow mein, spicy eggplant, schezuan shrimp, and chicken and string eans to share.\n\nDespite the non-sensical name (though I'm curious if there's a direct translation into Mandarin or Cantonese that makes a lot more sense), I'm officially naming New Country Sky Chinese Cuisine my own \"go to\" spot to order Chinese food in the Marina.", "author": "Sebastian N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-11", "description": "Very good sesame chicken and chow mein!\n\nTimely delivery.\n\nRecommend it.", "author": "Marc B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-07", "description": "Thank you for ending my relationship with New Country Sky tonight. The general's chicken was soggy and no spice. The potstickers, undercooked. And the only explicit instruction I had on my order was that the broccoli was to be mild and with very little sauce - it was spicy, over cooked and swimming in sauce. The wife is furious. \n\nNever again.", "author": "Brendan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "I rarely have Chinese take out because my dad, for many years owned a Chinese restaurant. This is the only place where I order and I am never disappointed. Always delicious, great price and portions. Just recently they moved out of the Marina so I've been forced to use their delivery service. Again, does not disappoint because the food arrives fast and hot. YUM!", "author": "annie w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-26", "description": "Ordered delivery through the restaurant's website. The food that arrived was excellent--mongolian beef, orange chicken, chicken chow mein, spicy eggplant, hot and sour soup--but the delivery driver rudely asked if it was our first time ordering, that our apartment is very far, and didn't we know where the restaurant was located? \n\nWhen I order through a restaurant's website, I expect that service to tell me if I am outside of the normal delivery range. The restaurant did not reach out to contact me beforehand, so if it was such an inconvenience, either let me know and do not deliver or do not be rude when you show up. Their website states they deliver within a 2 mile radius of the restaurant: on Google Maps, we are apparently 2.4 miles away (though again, customers shouldn't have to do this legwork), but never fear--given the 2 mile radius you SHOULD be able to get food delivered off the coast of the Marina and in the Bay. \n\nWe will follow this restaurant's instructions and will not order from them again for delivery. Given the service received, we likely will not show up in person either.", "author": "P D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-15", "description": "Okay, I don't know what is going on here, but New Country Sky Restaurant which is supposed to be located at 2035 Polk is actually Tai Chi Restaurant at 2031 Polk.\nFor some unknown reason, it is not being made known. They have two different telephone numbers and they answer the phone Tai Chi or New Country Sky depending which number you called.  I quit going to the newer Tai Chi Restaurant because they had totally changed their menu, taste and quality from the original fabulout Tai Chi, and I quit going there.\nI ordered food recently twice from New Country SKY (AKA Tai Chi) and what I ordered was actually pretty good.  Specifically The Szechuan Beef, Singapore Rice Curry Noodles and\nChicken Corn Soup.  The Sesame Chicken had a good sweet and sour sticky spicy sauce to it\nbut it was deep fried and for that reason, I was not happy with it. The oil tasted old.\nI wish they would be more upfront as to what real name they go under, as they actually show a\nred awning on their photos which is from the Steiner Street address, which I understand is now\nclosed.  When I finally called to ask about the actual name of the restaurant, she said that they\nhave combined their menu with Tai Chi. \nPrices seem to be different for the same item between New Sky and Tai Chi, another\nstrange thing.\nI hope Tai Chi will improve from this so-called changeover and the food will continue to be good.\nWhat is the secrecy all about????", "author": "Girly Foodie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-16", "description": "Asparagus and beef lunch special for only $7.50?! And out of season? Uh, hells yeah! Place order for take out via iPhone 6. Stinky pee in no time. Nom nom nom", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-07", "description": "Very standard Chinese takeout fare. I didn't expect much, but it didn't make me want to come back. Ordered the mixed vegetables with tofu. There was a LOT of tofu but lack of vegetables. The Mogolian beef was tender, not bad. The inside of the restaurant was spacious but a bit cheesy/old/sad looking.", "author": "Nessa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-23", "description": "The best Asian food I have had in a very long time! That deserves 5 stars. I ordered beef fried rice & orange chicken. Fried rice isn't too greasy & the egg was made just right & the beef made it great! Orange chicken has a great glaze over it with just the right flavor and spice! I would totally recommend if your in the area! & the cherry on top was having it delivered to our hotel room!!", "author": "Breanna P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-04", "description": "Country Sky is a perfect little spot to fulfill your Chinese food craving.  Service is speedy, the food is cheap, and most of the items I've ordered are pretty good (special shout out to the chicken chow fun with black bean sauce).  I will say that the quality of the food is markedly better when you eat in the restaurant versus ordering delivery (which is a nice way of saying that I usually order from somewhere else when I want delivery).", "author": "Connie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "Best kept SF secret! We love coming here for their delicious Chinese food and excellent service. For lunch they offer the incredible deal of small pot of tea, egg flower soup and your choice of various entrees for 6.95. And again the food is freshly made and delicious. It's a small intimate restaurant you cannot afford to miss!", "author": "Yvonne H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-06", "description": "We saw this place looked good, so we ordered delivery at 6:30. When food wasn't ready yet we started calling at 7:30, but didn't get through until 8:00. When we did get through they told us they hadn't even started it yet. We ended up cancelling the order and eating food at our hotel. Very bad experience.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "Tried New Country Sky for the first time today.  I ordered a half order of dumplings and crab cheese puff and a Curry Chicken.  The dumplings and chicken curry were a good time.  The curry chicken comes in a soup like format.  The crab cheese puffs (Rangoon everywhere else) was interesting.  Normally they are spicy with diced jalapenos inside, but these were slightly sweet which was a little weird.  All in all, I'd go back.  The whole meal was $20.", "author": "Shaun W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-09", "description": "I ordered three things to go, shanghai dumplings, pork sui mai and chicken and corn soup. The server told me it would be be twenty minutes, okay not bad. I ended up waiting fifty minutes to find out that they ran out of soup. The lady asked if I wanted something else instead, and kept trying to get me to change my order when I even told her that I didn't have time to wait and that I was already running late. If they didn't have my food, they should have just told me when I ordered it instead of making me wait fifty minutes. Not even over exaggerating about the wait time. \n\nNot coming back here for a long time.", "author": "Ivy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "This is by far my favorite Chinese food of all time!!! The Bbq pork steamed dumplings are a must, and the chicken chow mein is amazing. If I could eat here every day without becoming obese, I would", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-03", "description": "Delivery Dim Sum ... ? YES! \nI found New Country Sky on eat24 and have regularly ordered dim sum from them. I tend to order the same 5-6 dishes : dim sum of all varieties and Singapore or Hong Kong noodles -- perfect!\n\nThey have a dim sum sampler which is cost effective and delicious -- you get to pick which dim sum you want. \n\nOF COURSE this isn't the same as going to some fancy place in Oakland or Chinatown for Sunday brunch dim sum -- it's delivery, but still quite good.\n\nThey've always been fresh (except for a pork bun, but I don't really like those anyway) and speedy with their service.", "author": "Yasi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-19", "description": "Yeah, I'm surprised too. I grew up in the Richmond district so I've had my share of Chinese food. This is one of the best places I've had in SF. I regularly order their fresh made noodle chow mein, the potsticker (a meal in themselves), the my shu, and the sesame chicken. Have had a couple things that weren't that great- the wonton soup, the fried rice is hit or miss, and something else I forgot. \n\nThere is defiantly NOT a better place for Chinese in the marina.", "author": "Francesca S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-16", "description": "If you want to order Chinese food for delivery, this is the place to consider.   It's clearly 'Americanized' Chinese cuisine, but they use fresh ingredients and they do not skimp on the portions.  If you order for delivery early enough, the food will arrive piping hot with the perfect consistency: the Orange Chicken is hot and crispy and the vegetables are bright and tasty. And the prices are reasonable.\n\nWe would give the place five stars, but we had an issue with delivery on one occasion.  After we called to check on the order they admitted ( to their credit) that they would not be able to deliver in a timely manner, so we cancelled. We were disappointed, but  we came back. \n\nThis place is worth checking out.", "author": "Barry G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-19", "description": "Before I met my wife my Chinese food experience was limited to Panda Express or Safeway...now after experiencing many different restaurants in many different places I think I finally appreciate good Chinese food.  When visiting San Fran this place is in our top 5 of must haves...the Hot and Sour soup is great, the Wor Won Ton soup is out of this world.  All of the entrees we've tried have huge portions and are super tasty.  General's Chicken was our latest meal and no surprise, was great!  They also seem to do quite a bit of take out business, which is probably good because I think they might only have a dozen or so tables.  \n\nWe enjoy staying over in Cow Hollow and this restaurant is part of the reason.  If you find yourself on the Northside of the city craving good Chinese - this is the place :)", "author": "Jason E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "Super delicious super friendly!\nI usually get the Mongolian Beef it's so delicious! Lots of meat, good spices and always fresh and hot.\nMy other favourite is green beans and shrimp although there could be more shrimp!", "author": "Victoria R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "I've dined in, taken out, and gotten delivery here and the food quality has been consistent. It's pretty decent, kinda greasy chinese food.\n\nFood:\n+Hong Kong Noodles- these are the crispy noodles with beef and broccoli. Large portions, but a little too salty. Also, when you do takeout or delivery, they put the noodles on the bottom making it very soggy when you finally eat it. I'd recommend they package it separately to satisfy customers.\n+Meatless Sesame Chicken- OMG. they nailed it. the first time vegetarian chicken tasted just like the original, the flavoring was perfect\n+Brown Rice- was too hard; needed to cook it more\n+Fried Rice- decent\n+Crab Rangoons- expensive and way too much cream cheese and not enough cram\n\nService:\nMost recently, I ordered take out and there was a piece of hair in my food. I immediately called them and they offered to deliver to me a new dish free of charge. So, even though it grossed me out and I was starving, at least they tried to make up for it.\n\nAmbience:\nThe restaurant itself is pretty empty all the time and nothing to write home about. I think most people do take out or delivery from here.\n\nLarge portions, decent Chinese, and good value. All my entrees last me 2-3 meals each!\n\n-Hungry Hungry Pongy", "author": "Sangita A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-26", "description": "Had Mapo Tofu and Beef with tofu. \n\nFood is not too greasy. \nBut not the best favor... Chow fun is a joke, DONT GET IT! \n\nFast delivery, Fast cooking, good portion :)", "author": "Jinn C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-08", "description": "Extremely noisy, even with few or no sitdown customers. The staff shout at each other, and there is a lot of clanging and banging.\n\nThe front door has to stay open to ventilate for the kitchen - there is no back door.\n\nChicken salads in Chinese restaurants are usually light, refreshing, delicately flavored, and sometimes beautiful. This was not. The chicken salad was a clump of fried white meat chicken tenders with a forgettable sauce atop a bed of boring iceberg lettuce. \n\nI was told that the shrimp wonton soup would be hot and spicy. It was. It was pretty good.\n\nThe staff was friendly, and inattentive.\n\nCould be okay for takeout.", "author": "D N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-18", "description": "Oh my word what huge portions! \nThis is a very busy place and it has more of a feel of a takeout business as there are only a handful of tables.\n\nThe staff are attentive and friendly and just happy to see you there. Clearly they have regular take out customers although people coming in seemed fairly random, like us. Did I mention the food portions? I'd share one and get more if you're still hungry!", "author": "Rickie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-27", "description": "We were visiting SF and my son recommended Country Sky.  It was only a couple of blocks from the place we were staying in the Marina so we decided to order out.  Very good choice.  Some of the best chicken with broccoli I've had. The sauce was savory and sweet with thinly sliced chicken breast and crisp tender broccoli.  Also tried the General Tsou's chicken which was also really good with a sweet, spicy sauce that boasted a generous amount of red pepper.  The fried rice was standard but acceptable.  The fried prawns were mostly breading and the filling in the egg rolls was a little mushy and too much of some spice...I think ginger?... so we wouldn't order either of those items again.  Keep in mind that this is what I think of as American style Chinese food.  If you are looking for authentic Chinese food, go to Chinatown.  However, we were pleased and would order from here again.", "author": "Alisia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-12", "description": "Amazing food at reasonable prices. This is the best Chinese place I've found with the myriad of mediocre Chinese in the city. I love the crab cheese puffs! Everything tastes fresh and the service is great. The restaurant is also very clean.", "author": "Adrian D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-21", "description": "Utterly terrible service.\n\nOrdered delivery food at 1pm. Got a confirmation email from their website saying it went through. The email said the delivery time would be 1:56 pm.\n\nNothing ever showed up. Called the restaurant at 2:46 pm, they had a bad phone with very noisy background, and the woman I was talking to could not hear me half the time. Asked me for my confirmation number, I tried to read it to her 5 times, but it was hopeless. Said they would call me back later. So far no-one did.\n\nI guess I should be glad I decided to pay in cash for delivery and did not give my credit card to these people.", "author": "Victor K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-29", "description": "My boyfriend and I love the orange chicken. Yes, orange chicken. You may think that orange chicken can be found in any Chinese restaurant, and I ll give that. But you must try this orange chicken. The chicken is well seasoned, and the sauce is so thick that it becomes caramelized. This is the best orange chicken I had ever tried, and trust me, I live in Little Saigon where you can find a Chinese restaurant at almost every street corner. \nWe also tried fried wontons, hot and source soup, and prawns and string beans. Everything was very well seasoned. Oh my god... My mouth is watering as I type this review lol\nGone here twice and looking forward to come back :D", "author": "Hao T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-02", "description": "A lovely chinese in the Cow Hollow/Marina area\n\nOrange chicken... Check\nLarge portions.... Check\nGreat value..... Check\nGood and friendly service.... Check\nFree green tea.... Check\nExcellent coconut rice.... Check\nFast ... Check \nUnable to finish owing to massive portions (but that's a good thing no complaint) .... Check.\n\nAll in all, very content.", "author": "Tim W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-10", "description": "1.  Review of delivery from Country Sky Chinese Cuisine.\n\n2.  Easy to order via Grubhub.com.\n\n3.  General Tso's Chicken - This was a bit of a different take on the dish of many names.  It was sweeter.  It still had a little heat but the sweet really came through.  It was warm.  The chicken was crispy on the outside and relatively tender on the inside.  It wasn't amazing but I did enjoy it.\n\n4.  Mongolian Beef - This was pretty much a normal take on Mongolian Beef.  The beef was tender.  The vegetables were not super over cooked and had a little crispness left.  For Mongolian Beef, it needed more zip.  From a temperature perspective, it was still very warm.\n\nhttp://tinyurl.com/3tpdvlo\n\n5.  Steamed Rice - It was good rice.  It was pretty much right on.  \n\n6.   I requested paper plates.  They did not bring any.\n\n7.  I requested hot sauce.  They did not bring any.\n\n8.  Delivery was very fast.  The delivery person was professional and polite.\n\n9.  The food was packed well.  There were not any leaks.\n\n10.  My fortune was \"You deserve to have a good time after a hard days' work\".\n\n11.  Lottery numbers - 07, 15, 28, 39, 42, 02\n\n12.  Overall, this was decent Chinese food.  The service was pretty good.  The delivery was fast.  I enjoyed it and would consider ordering from them again.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-23", "description": "Frankly, really horrible. I used to like this place, and sometimes I still offer from them, but there's nothing positive to say. The food is inconsistent, the service bad. When it's good, it's good, but not worth the frustration when it's bad. Skip it if you have better alternatives.", "author": "Emily K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-08", "description": "I had cashew chicken yesterday, and I found it to be very good authentic Chinese food. It's healthfully prepared with fresh ingredients, and was served with a bowl of white rice. Just right. I am going there for lunch again today. This time I will test them with my long-time favorite Ma-Po Tofu.", "author": "Brion K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-15", "description": "Generally, I love this place. That was until today when my co-worker and I, per our usual routine, went to order delivery to realize they had raised the price to $15.00 minimum. While I understand that generally, this is cheap for a minimum, we just don't need more food than $13.00 worth, so despite our disappointment in the change, we decided to pick it up because the food is good and cheap.\n\nThis would have all been fine if my co-worker hadn't come back with an order of general tso chicken, when I ordered general tso tofu, therefore forcing me to walk back to exchange it for the right order. Not to mention that this happened last week when the minimum delivery charge was still a glorious 13 dollars, and they had to drive back with my correct order. I called today and told them I was coming to exchange it and the woman on the phone told me \"can you give 10-15 minutes, we are crazy busy\". Obnoxious considering I ordered my food way before everyone you are serving now, and you got it wrong, but I held my tongue and walked to pick it up anyway.\n\nI waited another 10 minutes when I got there and watched everyone in the restaurant enjoying their lunch while I stood there cranky. I still didn't say anything because I am passive aggressive and felt like writing it on Yelp instead. My co-worker also once slipped and fell on water from the fountain in their entry way and all they said was, \"Are you okay? That will be $6.80\"", "author": "Natalie R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-12", "description": "I came here a little late, and it seems that they prioritise delivery over eating in. This is made especially apparent by the fact that the front door was left open because the kitchen has no windows, leaving the dining area freezing. I had to donate my jacket to my girlfriend. \n\nWe ordered sizzling rice soup and chicken with broccoli, not an overly complex order, and the soup took around 15-20 minutes to arrive, while we waited another 10-15 after that for our main.\n\nAs for the food quality, the soup was extremely salty. The waitress, as well as my girlfriend and myself, were all quite surprised that the crispy rice in the sizzling rice soup was neither crispy nor sizzling. More of a fizzle.\n\nThe chicken and broccoli was close to inedible. The meat, while abundant, had an off flavour to it - granted, it may have been the sauce - and the broccoli was EXTREMELY bitter (note: this was NOT Chinese broccoli or broccoli rabe, which one would expect to be bitter). \n\nWe eventually paid after another long wait, and took off. Maybe I'll give them another chance for delivery. Maybe.", "author": "Harley C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-28", "description": "Thought we would try a different place for delivery. Mixed results.\nDim Sum excellent\nWalnut prawns overcooked and dry. Bit down on a piece of walnut shell\n       Lucky it did no damage\nSweet and sour pork very good, lean meat\nGinger beef with vegetable - beef tasted good but the vegetable was all  \n        Onion and 4 slivers of red bell pepper. I was counting on a good portion of vegetable as I need to keep my carbs down.\nArrived in timely manner and hot", "author": "Linda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-08", "description": "I called their restaurant for delivery last night and was told I couldn't get delivery because my order was under 20 dollars.  Instead of trying to figure out a way to make my order work, the lady on the phone rushed me off as if she didn't want my business.  I explained that the minimum amount was only $15 on seamless, but still wouldn't let me order from her; instead, she told me to go online to seamless.  Crazy!  After some push-back she finally let me order from her.  Said it would be 90 minutes....ended up being over 2 hours.  Food was great (ordered the mango chicken and pork fried rice) but their service didn't impress at all.  \n\nFocus a bit more on your customer service and I would give this place 5 stars!", "author": "Bonnie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-31", "description": "I've been having such great luck in San Francisco lately by yelping good local food and just trying it.  This place is a prime example of that.\n\nMy friend and I were driving around SF and were getting pretty hungry. We looked for a good chinese place nearby on yelp. We found this one, lucked out with good street parking and were SO glad we tried it. \n\nThis place is small but VERY clean.  Cleanliness is one of the most important things to me when it comes to chinese places in the city. \n\nWe ordered sesame chicken, hot and sour soup and chow mein. Everything was great but the chow mein was exceptionally good. I'm not much of a noodle person myself, but these were the best chow mein noodles I've ever had! The rest of the food was good as well.\n\nI am also very picky about meat, having been a vegetarian for almost 12 years growing up I don't like cartilage or weird stuff in meat and the chicken was perfect moist breast meat with no weird stuff in it.\n\nGive this place a try if you're in the area! Heck, give this place a try if you aren't in the area and just want great chinese food!!", "author": "Katlin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-28", "description": "We went here with my parents when they wanted to try dim sum.  It was cheap, they offered a million kinds of green tea (and it turned out well), they brought food out extremely quickly, and our server was really nice.  \n\nI recall that the food was really good although apparently unmemorable, as I now can't remember anything but the sticky buns and some dumplings.  \n\nThe one major problem: this place was freezing!  They had the window open, which thankfully we weren't sitting by...and they have the front door propped open.  It's a tiny place and I imagine their fire alarm goes off the moment they shut it, but it definitely decreased the enjoyment of the meal to have to keep your coat on and clutch your tea the whole time.", "author": "Molly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "Takeout (in general) is so hit or miss when ordering Chinese. I'm constantly in fear of being stuck with mushy noodles, old veggies and gross sauce. I was pleasantly surprised with Country Ski Chinese. The food is high quality, fresh and tasty. You can order online which is great.\n\nWe loved the veggie pot stickers, hot&sour soup, Garlic Shrimp and Kao Pao Chicken. All of which were excellent and appetizing.", "author": "Jessica A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-09", "description": "Good place to dine out if you need a quite place, and a great place to do lunch if you just so happen to be in the area.  Price is right, and the service is like any other Chinese restaurant; nothing special. Ever since they switched owners/chefs, it has been a completely different experience, they've really improved the quality of the place and dishes. Kudos.\n  Besides the usual dishes; Orange chicken, beef broccoli, mongol beef, sweet & sour anything fried etc... Go ahead, be bold, and order dishes you normally wouldn't (ask the waiter =P ). They seem to have an experienced chef, and I am confident to say that Country Sky have much more to offer than what is on a typical panda express menu. See for yourself. \n\nSide note: They also carry variety of wine, classy, but nothing fancy.", "author": "Wayne L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-05", "description": "I placed an order at 6p. I called at 7:35 to check on the order.  I was asked to hold, the phone was put down and I heard background noise for 8 minutes before I was hung up on. I called back and was told the food was ready and would be picked up to deliver soon. Since it wasn't even en route yet, I asked them to cancel the order, The woman convinced me it was leaving at that moment and would arrive soon. I said I would like a refund if it did not arrive by 8pm. TBD when it will get here. We've ordered from them before, and the food is good but the last time we ordered, they put a duplicate charge on our credit card. I don't think I'll be ordering from them again. I couldn't even find the restaurant on yelp because their webpage still has the Steiner address and I didn't realize they added \"New\" to the name. Also, health score of 81 (old location, I assume)", "author": "M S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "This is great Chinese food. Its a must go! Went here with my mom. I ordered the chicken chow mein, shrimp fried rice, and orange chicken. It wasnt too greasy, the portions were good, and it was well priced. The staff was friendly. I had a great experience here and would come back again. You need to stop by here and grab a bite.", "author": "Jared M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-04", "description": "The food came out quick and it tasted great. I will return.\n\nI had sweet and sour chicken and hot and sour soup.", "author": "Captain B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-10", "description": "Love this place. Has been my go to spot for Chinese take out for years. Delicious food, great service and speedy delivery. Singapore Rice Noodles and Chive Dumplings are my fave.", "author": "Erika E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-06", "description": "It was a good meal. The dining area is small but clean and kids are welcome. Friendly staff reasonably priced.", "author": "Machelle B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-26", "description": "After an extremely disappointing attempt at eating at Izzy's and being told we wouldn't be served because the kitchen closed (20 min after placing our order), we were starving and went to first open restaurant we could find... Country Sky.\n\nI was starving so anything would have been fine.  We just ordered a small amount of food, Baked Pork Buns, General's Chicken and steamed rice.\n\nThe buns appeared to have been microwaved and were a bit of a disappointment, but the general's chicken was one of the best I've ever had.\n\nThe chicken was coated with just the right amount of breading and fried extremely crispy (the leftovers actually held up for the next day, which I've never experienced before).  The sauce was thick and almost caramelized, it was sweet and spicy and perfect.\n\nThe rice was slightly undercooked.\n\nI would definitely head back if I was in the area, I'd like to try some more items on the menu.  Would love a fresher bun and properly cooked rice... they would have definitely gotten a 4th or 5th star.", "author": "P K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-25", "description": "No buenos. I ordered the Kung pao chicken and it had this taste--like a cardboard box. Icky...just icky. Pot stickers were OK and huge--weird. White rice was the only thing really worth eating. Also, don't know if it's Eat24's fault but I chose a delivery time of 8:30 and it arrived at 7:45. Food was cold for guests coming late.", "author": "J M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-20", "description": "A decent Chinese place that deserves 3.5 stars. It's pretty cheap for the neighborhood, the food tastes fresh and of good quality, and the service is speedy and efficient. \n\nMy main complaint is that the dishes tend to be too salty. \n\nI will ask for less salt next time I go in. \n\nOverall, an excellent Chinese resturant for a primarily gwai-lo area.", "author": "Jacqueline A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-27", "description": "I give them 3 1/2 stars.  I thought the food was so well priced for the portions they give.  I've only been here once and ordered the wonton soup.  The noodles was not any I've had in wonton soup.  They do not use the wonton noodles, which was different.  It was good, but I would prefer the egg noodles that I'm used to having.  I love trying new food and different ways in which they're prepared so it was fine for me.  I would come back here again, but next time ask for no MSG as I think they use MSG here.", "author": "M. T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-29", "description": "Mom was looking for Hong Kong style fried noodles but we were in the Cow Hollow area and this was all I could find. Got nervous when I looked into the joint and  they only had 1 customer. (It was empty compared to its neighbors. Saturday past 2pm, though.)\n\nWe had House Special HK fried noodles and it was too salty, even for me who likes salty food. If it had maybe less soy sauce it would have been a lovely dish, just what we were looking for. Lemon chicken wasn't oily despite being fried, but it didn't have enough flavor, it was a let-down. Combination fired rice was good. Siu mai was good. Service was a friendly and quick, but the food took a while, maybe 15-25 minutes total). I was surprised the siu mai came in last. And of course having ample parking on the block was great (Pierce coin-metered garage).", "author": "Paulyne R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-31", "description": "This has been our go-to Chinese place for years, but they have closed their Steiner location and moved to Polk street (inside another Chinese restaurant...) and the food is not as good, and the portions are much smaller. Total bummer.", "author": "Jess J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "Bessssst General Tso's chicken! General Tso's is like the equivalent of a cheeseburger for American Chinese food, but this was really a standout. Chow fun and spring rolls were good too. Delivery was fast. I was impressed!", "author": "Olivia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-21", "description": "Customer service is bad most especially the 2 young ladies who work there... U're in marina lady! Have a class and be polite to ur customers!", "author": "Ryan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-06", "description": "I ordered Hunan Wor Noodle Soup and Szechuan Beef last Saturday. Delivery was pretty faster than what I expected. It took about 20 mins after I ordered.  Food wasn't too bad, but a bit salty and sweet for me although I chose 'spicy' option lol In addition, there were not any noodles inside of the noodle soup lol However, the soup helped me to feel better. (I had a terrible cold...) Well, restaurants have mistakes sometimes when they are busy, so... I will try again :P", "author": "JS C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-21", "description": "Ever since \"Country Sky\" turned into \"New Country Sky\", you just gotta love it... I noticed the \"new\" awning/sign, and the \"new\" higher prices but still extremely affordable enough to eat here everyday. \n\nAlthough they tell you to wait 30-45 minutes for fast, free delivery, when I say fast, I mean, Jumpin' Jack Flash Fast as in 25 minutes or less which is a great surprise when you're starving.\n\nAnd the portion is big enough for you to eat half and save it for later, or share it with a loved one, or even try to scarff down yourself and hate yourself afterwards. But their food actually tastes healthy, is satisfying, and isn't oversalted or loaded with tons of oil or msg.   \n\nI haven't found a Chinese place in the area that even comes close... \n\nWill I be back? Heck yeah. Tomorrow! The usual scrambled egg with prawns please. \n\nThe only thing I wish for is that they would give fortune cookies everytime...", "author": "Joraine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-28", "description": "I'm *so super duper* hesitant to try Chinese restaurants. I'm surprised when it's good because I always expect it to be bad due to past experiences.\n\nTaste being as random & subjective as it is, I can't even tell u what makes a Chinese restaurant good vs. bad. I just know that if something taste like a bite outta my childhood, I consider it good & when it's fishy or I see skin/fat or the won ton soup taste like dishwater, I call that bad. \n\nCountry Sky is very, very, very good. Exceeded all my expectations (admittedly, low ones) & didn't make me regret trying a new joint, hence 'very' repeated thrice!\n\nCS is different from other Chinese restaurants I've been to; The space is clean & well maintained and the waitresses are pleasant instead of eternally angry (don't even get me started on *other* recently visited joints.) I think they were amused at how much we ordered, necessitating them to push over a vacant table to accommodate our dish overload. I initially thought, I'm only coming here once so I'm trying everything! Had I known the food would be so on-point, I wouldn't saved trying some dishes for next time. \n\nWe ordered: \n- 3 kinds of dim sum (3 pieces each) for $11.95: shrimp dumpling was not very flavorful (I was hoping it would be, given that everything else was), chive & shrimp dumpling was fantastic & bf enjoyed the steam BBQ pork buns. \n- half orders of fried wonton, pork potstickers & eggrolls--all winners.\n- pork fried rice for bf--it got his approval & so did the sweet & sour pork \n- general tsao's chicken- fried, breaded, sauced. What made it better than other restaurants was the white meat chicken! Hallelujah for that!\nTotal before tip: $ 47\n\nAnyone with a more sophisticated palate than mine (isn't hard to find!) would call this Americanized Chinese food but the flavors & textures are familiar to me. I'd definitely return to CS, but next time I'll order more like a normal person & less like a starved monster who's carb-loading for a double marathon.", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-23", "description": "We were staying in the area and had a craving for some asian food( well i did anyways).  We had our kids with us so we were hesitant to go to a \"nice\" or expensive Chinese place, so we opted to try New Country.  It looked pretty plain from the street sandwiched between a couple of higher end restaurants, and when we walked in, it looked like any other teriyaki restaurant I've ever eaten in.  We ordered the pot stickers, egg rolls( which were actually spring rolls), cashew chicken, and the general tso's.  The food showed up lightening fast, and was really good....the only thing I would change would be the General Tso's chicken, I wished it was spicier...My daughter loved it, but i like it hot...But aside from that, i would recommend this place to anyone in the area.", "author": "Mr. C S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-04", "description": "Whenever I go somewhere like Country Sky or Panda Express, I get hate mail from my friends, because I'm Chinese and should know how \"real\" Chinese food should taste.  But then again, I live in the Marina and my options are severely limited when I feel like sitting on my couch, watching Shrek 4, and my stomach starts to rumble.\n\nThere really is only one thing worth ordering from Country Sky (if you're used to \"real\" Chinese food) is the Hunan Wor Won Ton Soup.  It's spicy, flavorful, and chock full of yummy chicken, beef and chashu.  Oh, and wontons too.\n\nEverything else is seriously kind of nasty, like bland and greasy dumplings and green onion pancake.  I'm open to trying other stuff, especially because I live a block and a half away, and because delivery took them exactly 30 minutes.\n\nCan't wait for a cold day so I can have a large steaming bowl of wonton soup.  But until then, I'll have to stick to my CCG Chinatown ways.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-14", "description": "Always solid. Fresh ingredients, fast service, they will make food to order for special requests. Just a solid Chinese spot. Eat here if you want some good food. Dim sum is good too", "author": "auclair k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-19", "description": "Went with a friend.  Very nice, small, intimate atmosphere.  The service was fairly good, and the food was absolutely delicious!  However, they were out of every other thing I tried to order (chow fun and brown rice), and it was extremely disappointing.  They did nothing to try and make it up to us either, which I found frustrating.\n\nStill, really great kung pao tofu, Hong Kong style noodles, and sizzling plates were great!  The rice portion was a bit small (and we got two of them).  The sizzling plate was THE BEST.  There is thai basil in it and the onions were caramelized.  Would definitely recommend that dish to everyone who goes!", "author": "B L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-01", "description": "Ordered delivery, so keep that in mind:\n\nChow Mein with Chicken - fantastic! I really struggled with what to order for our main; this dish did not disappoint! If you like your noodles soft and tasty, this place is for you!\nSpicy Green Beans - pretty good, nice crunch (no not a fried crunch, a healthy fresh green bean crunch) but not really spicy (I wanted spicy)\nPork Dumplings - not so great; dough felt a bit inconsistent and was a little thick for my preference. \n\nI will definitely order here again. \n\nBest of all, the delivery guy arrived almost 30 minutes ahead of time! Very much appreciated!", "author": "Cristina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-26", "description": "Great food, haven't had this type of quality in a while! Happy I decided to eat here. The place is a bit small inside so I don't suggest a party bigger than 5 but great service with a good attitude. They seem to get a LOT of there business through delivery but I would I would recommend this place without a doubt.", "author": "Felipe B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-24", "description": "Food is consistently tasty (favorites include wonton soup and shrimp dumplings) but delivery is a crapshoot. Sometimes it's fine, other times it's ridiculously late and/or orders are wrong. They are apologetic when it happens, and do their best to fix things, but it's still a little annoying. I think I'll try calling from now on (rather than ordering online).", "author": "Ellen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-25", "description": "In the Marina, there isn't many Chinese restaurants around.  This is the only clean Chinese restaurant near by me.  The food they serve are the normal Americanize Chinese food.  Nothing traditional.  \n\nI order from this place a lot.  The items I enjoy most are:\n-Chicken and Corn soup- chucks of chicken and corn in a light chicken broth\n-Seafood Soup - has chucks of white fish, prawns, vegetables in a light broth\n-Prawn with mix vegetables in a light garlic sauce (My favorite healthy choice and I eat the sauce with brown rice.  Very generous with the prawns)\n-General Tso Chicken (Vegetarian style) - pretty much made with tofu.  Delicious!!\n\nThey deliver fast and the food only takes about 15 minutes to cook. It's nice to find a place with healthy choices:)   I really enjoy eating at this place!", "author": "Ying F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-18", "description": "I CAN\"T STOP COMING TO THIS PLACE!!\n\nIt's a short walk from my uncle's apartment on Steinhert and Union and Amy, the owner, is SUPER NICE AND ACCOMODATING!\n\nThe ambiance itself is peaceful and comfortable. It's near Chestnut street where there's always a lot of action as far as places to eat and bars to drink at, but I always find myself coming here..\n\nThey serve good wine and they have yummy dim-sum!\n\nOne thing that I have to mention is that I've never liked duck. The smell, the taste. It just never appealed to me my whole life.. UNTIL I CAME HERE. THE PEKING DUCK IS SOOOOOO DELICIOUS!! My uncle, mom, boyfriend, aunties, and I are ALL HOOKED on it and we ALWAYS order it when we come here.\n\nAnother one of my favorites is the HONEY WALNUT PRAWNS!! OMG!! The prawns are HUGE and unlike most places, they put just the right amount of mayo on the prawns so it doesn't become soggy or overwhelming. It's warm, still crunchy, AND CREAMY!\n\nThe salt and pepper prawns are also delicious. Perfect amount of spices plus a little chili for a kick. \n\nVegetable fried rice is yummy too.. \n\nYikes. I don't know what else to say. I haven't tried anything here that i HAVEN'T liked. And the prices are really reasonable for the quality and taste you get. \n\nI am a regular here even though I live in the East Bay. I'm here once a week so that says a lot!", "author": "KimberLy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-18", "description": "Finding a good Chinese restaurant in the Marina is petty difficult.  Particularly bad is Feng Shui Restaurant on Lombard Street.  Don't go there unless you want a stomach ache.  \n\nNew Country Sky serves dim sum and the typical lunch rice plates and dinner entrees.  My employees order lunch takeout from here all the time.  This is how I first heard of them.  I was reluctant to try until one night I promised to bring takeout over to the East Bay to my boyfriend's place.  He requested Chinese food.  So I walked over there and ordered chicken corn soup, spicy green beans, sauteed shrimp with mixed vegetables, and rice.  \n\nThe food costed about $35.00 and took 15 minutes to prepare. I was in and out of there and on my way to the East Bay in no time.  The food smelled amazing on my drive over.  The food was still hot when I got to his place.  We attacked the food and everything still tasted very good 45 minutes after it left the restaurant.  I found my new favorite local Chinese restaurant!  It is New Country Sky!\n\nI will definitely be back for more!", "author": "Gloria Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-12", "description": "I love how Chinese restaurants have menus with 5 million things on it...but I really love it when you can blindly order any of the 5 million things and each one is delicious.  There are so many cheap and \"I cook PF Chang's plastic food\" places out there that I'm not over the moon when walking into a new Chinese place, but Country Sky is the best.  It's fast, super fresh, and everyone there is overly friendly.  Glad to know I don't have to find another Chinese place near my house.  \n\nWhat to order other than anything?  Twice cooked pork, garlic chicken, black mushroom and tender greens...great stuff.  Hell, even the fried sesame chicken is outstanding...and everything is under $10.  Can't beat that in the Marina.  Also, who knew they'd also have good dim sum...go figure.\n\nHigh-five to this place.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-22", "description": "Do not order from this place! At least not online.. Ordered at 8 pm for delivery. Got an email saying that The order would be here at 8:46. I finally called them at 9:30, and they said they never received the order. They took my order again, then said that they would have it here within 45 minutes. I asked them if they were willing to give any sort of discount, or something free, since I had to wait for an hour and a half, and they said nope sorry. STAY AWAY!!", "author": "Ian L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-12", "description": "Food was decent. Although things were coming out at an erratic schedule. The thing that annoyed me the most was the service. They seemed to take offense to me and my wife as we were a mixed race couple.", "author": "M S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-06", "description": "After a day of furniture shopping, my girlfriend and I decided to peruse the various delivery menus that she had accumulated to see if we could find a good Chinese delivery place in the Marina.  After consulting yelp, I didn't find any of the delivery places whose menus we had worth trying (due to low average reviews or horror stories) .  After entering a search for \"delivery food\", Country Sky Chinese Cuisine was at the top of the list for my area.  And for good reason.    \n\nThe online order interface is fantastic and we were able to place our order in a matter of minutes.  Expecting the 45 minute wait time that the order complete page suggested, I was elated to hear the door buzz less than 30 minutes later.  Our delivery person was very cordial and pleasant during our brief transaction and the order arrived 100% complete.\n\nWe ordered a small Hot and Sour Soup, two egg rolls, Sesame Chicken with brown rice, and Mongolian Beef with white rice.  Everything was hot and well prepared-the Sesame chicken was the standout and I really enjoyed the Hot and Sour soup.  Fortune cookies were thrown in and a $5 gift certificate was added to the bag our order came in!\n\nI've definitely found my new go-to Chinese food delivery place.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "Fast delivery. Definitely go with the sesame chicken! The orange chicken was just alright but both of the portions were huge. Good go to place for a lazy night on the couch. Also tried the chicken wonton soup which was full of chicken and large wontons. Can't really complain about any part of the meal and will definitely be calling this place again.", "author": "Dave H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-12", "description": "Awesome take-out Chinese. It was a cold SF night and my friend and I didn't want to move from our warm laptops - so what to do? Find a good Chinese spot. I am very happy to have found Country Sky.\n\nThey're very friendly and efficient on the phone- once you get them. They promised 45 minutes max and they were right on the nose. We ordered: mongolean beef, sesame chicken and steamed veggies. They were all excellent and not over sugared or over sauced like most Chinese is. And it wasn't cold, score.\n\nI've got their number on speed-dial for when the next craving or rainstorm hits. Shwing!", "author": "Meredith R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-30", "description": "I really liked the place. If anyone feels my pain on how hard it is to get good Americanized Chinese food in this town, this place was one of the first I've found. I find that most Chinese restaurants in SF suck, unless they are serving authentic style, in which case I rarely feel like it.   \n\nIn fact, their Sesame Chicken was the best I've had in town. The skin was perfectly crispy and it wasn't a cluster f. It was presented really well. \n\nThe service was really great up until the very end when we wanted our bill. The price was excellent and there was enough for left overs. \n\nThe only thing keeping me from putting 5 stars is that it's not a fine dining establishment. The flavors were all very basic, though very good, they weren't outstanding. I will go here again and again.", "author": "David L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-18", "description": "I just ordered some delivery from this place and man ...this place just ruined my day.  I was still busy with my work so the front desk have to sign it for me. He basically yell at my co worker, asking where is the person that order this?!?! and he demand for tips? LOL you got to be kidding me. If I wasn't busy, I will go to the front desk and handle this situation myself. And the foods I order. The Mango Chicken, it is like chicken swimming in watery sauce. It is salty enough I can't taste anything else. Mango is like straight out of a can, it tasteless and look gross. I will never every going to call in for delivery, non I will not even go there in person. This place disgust me from customer services to foods.", "author": "Kat S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-08", "description": "Easy to order, friendly and competent staff\nI order for delivery once every few weeks and they deliver in under 30 minutes every time. I would definitely recommend for easy chinese comfort food", "author": "SF H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-17", "description": "Seafood soup served with visibly rotting vegetables? (used the mobile app to upload images of the rotting snow peas). I might be more understanding if it was just one and the oversight could be blamed on a supplier and an errant chef but literally 1/3rd of the vegetables were rotting. It's inexcusable- Somebody grabbed a handful of that rotting mess and tossed it in with the rest of the soup.  I'm afraid to know what other horrors are going on in that kitchen.   I'll certainly never return- that was disgusting.\n\nI wish the yelp mobile app for iphone also had the option to forward to the health department.  This place should be shut down.  I'm looking forward to seeing a \"For Lease\" sign in the window soon...", "author": "Spidermonkey J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-05", "description": "I like this place! I went out looking for a custom made vegetable fried rice, and they did exactly right! The ambience of the place is good for a place that is probably mostly takeaway and delivery. I love the mural of a Chinese village with a river in the restaurant.", "author": "Jigesha D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-14", "description": "Just moved to the Marina and was hoping to find a good Chinese deliver place.  Further, I really wanted one that could be ordered online.  Once I searched Yelp, I found that place in New Country Sky Chinese.\n\nI ordered online, the food was here fast and it was exactly what I was looking for. BUT, it was even better than that.  The portions were perfect, especially for a little leftover action.  The veggie fried rice was full of veggies, good ones.  The items weren't over fried and appetizers were quality.\n\nIf you're looking for cheap, easy, and fast, look no further.  Perfect for date nights at home!!!", "author": "Andy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-28", "description": "I had some mushu vege delivered. It showed up in good time and the portion was good so for now we'll say 4 stars but I need to try more things as it's hard to mess up mushu :)", "author": "Christopher Steven O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-07", "description": "My favorite Chinese spot in the city.\n\nMy favorite is the hunan fish, but their hot and sour soup is also great.  Food tastes good and the place is friendly and clean.\n\nMostly a take out spot.  In fact, though the entire front of the store may be empty, you still may not be seated depending on the volume the kitchen is doing.  There is a steady stream of delivery guys and take out customers taking plastic bags out the front.", "author": "Matthew F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-26", "description": "Loved this place! Was on vacation in San Fran and came across this little place. Absolutely loved the food we ate here twice ... I just wish they delivered to so cal :)", "author": "Michie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-12", "description": "There are few reasons worth venturing into the Marina for, but coming to Country Sky for their sesame meatless chicken (actually, sweet n' sour, topped with sesames) is one of them; that dish is out of this world.  Even if you still don't think that's reason enough, they do offer delivery.  They also have over 20 items of dim sum on their menu.  You, too, can have dim sum delivered to your doorstep.  \n\nTables in close proximity with pillows as seat backings, inside is quaint and cozy.  Just don't get so comfortable that you fall asleep after your meal.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-23", "description": "Food is excellent.  Would come here everyday for my lunch break until I moved away. A year later I'm back and have gotten my delivery order wrong twice.  First time I let it go.  Second time I called about 15 minutes after my order was delivered letting them know that I had asked for no vegetables and there were chunks of onion.  \n\nI forgot to mention that I told the person on the phone that my order had been messed up last time and she told me she would double check it before it went out.\n\n\"Oh, onions are good because they make the gravy have more taste.\"\n\n\"That's not what I wanted.\"\n\n\"I'm sorry about that.\"\n\nAwkward silence.\n\n\"This is the second order...\"\n\n\"But it tastes better, don't you think?\"\n\n\"I guess I won't be ordering anymore...\"\n\n\"I'm sorry about that.\"\n\n*click*\n\nSucks.  Two stars because the experience was good for two years...", "author": "Dan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-25", "description": "Okay yeah...the dim sum was pretty good...passed AAT (authentic asian tasting)...\n\nThe food was yumm..but seriousely..a bit on the greasy side...\nI spent half an hour cleaning off the drips of grease on my rug....\n\nNote to Mimi: Avoid the scallops next time..but double up on the dim sum!!", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-27", "description": "I think I have written fewer than 5 reviews on yelp, and after getting take-out from this place, I was compelled to write a review.  \n\nFirst off, I placed my order online and made two special requests that were BOTH granted.  Not extreme requests, but was skeptical about follow through on the restaurants end.  \nI ordered chicken with mixed vegetables.  Holy REAL chicken.  I'll admit, when I'm craving chinese food, I know that I may be in for some mystery looking meat.  The chicken in this dish was great! \nI also ordered pork potstickers, loved 'em.\nWe also got an order of hot and sour soup, but were full before we even got to it.  I have high hopes that it will be good! \n\nOverall, I'm just impressed and was very pleasantly surprised by the quality of the food!", "author": "G W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-29", "description": "We were at a road trip and have not had a chinese food for about 10 days. So this restaurant really saved us. It is not a authentic chinese restaurant but food is fresh and ok. The prices are reasonable too.", "author": "Yang Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "Fiancé showed me this place about a year ago. Wouldn't say it's hands down best ever Chinese food, but it's always really good and they have quick delivery.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-07", "description": "Lucky for us we were able to get delivery, in 20 min the food arrived on a friday night. \nThe mooshu chicken and pot stickers were tasty. The salt and pepper prawns were spicy and crunchy. General tsao's chicken is not something I usually order but It was one of the best versions I have eaten. Brown", "author": "Drew H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "While the service was a little slow (taking A LOT of to-go orders when we stopped in) the food was totally yummy and they were attentive about gluten sensitivity. My spicy eggplant was perfectly cooked, the chicken lettuce cups crisp and flavorful, and my companion's mongolian beef looked delightful. He orders delivery from New Country Sky frequently, and has never had an issue.", "author": "Gigi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-21", "description": "Wednesday night in the Marina. Drop by this place, took a look at their menu, hmm doesn't seem bad.\n\nMy friend and I entered into what literally looked like the \"hole in the wall\" restaurant. It was early so we were the only ones present. The waitress made decision making easy with her recommendations. We split the fried rice, orange chicken, and broccoli beef. Delicious!! \n\nCraved the chinese food and was definitely surprised at how good this place was! 4 stars!", "author": "Ezequiel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-05", "description": "Food is delicious! But it's oh so freaking hot every time i receive it! It's like right out of the pan! But it's really good, and the portions are very big! #Nom #Nom", "author": "Coraline J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-07", "description": "DO NOT ORDER ON-LINE FROM THIS PLACE!!!!!!!\nI ordered on-line because their phone was busy for ten minutes.  The system told me I would have food at 8:12pm at 8:30 I started trying to call and when I did I got a FAX tone.  After several tries, I faxed them the confirmation copy of my order and asked where my order was.  NO RESPONSE!  I tried calling again (now about 8:45pm), finally a person answers and says she doesn't have my order.  When I explain that I have a confirmation, she then tell me \"We don't get those orders, we are not responsible\"!\n\nNEVER, NEVER ORDER ON LINE AT THIS PLACE!  Can't tell you if it tastes good or bad because THEY NEVER GOT THE ORDER!", "author": "Sharon W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-23", "description": "I think a lot of their food is heated in a microwave.  I sat right beside it and it was constantly being used.  Also, the food didn't seem like it was that fresh.  It's not a horrible place, but I'd go somewhere else next time.", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "Ordered take out the other day. Had 3 dishes (2 chicken 1 beef), plus curry rice and dumplings. Food was very good and not greasy. Generous quantity and reasonably priced. Would definitely order again.", "author": "Aziz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "Pretty solid food overall. It's all better spicy I think. Quick delivery in the Marina. Very reasonably priced. Better for take-out I would argue.", "author": "Phil L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-25", "description": "I love this place.  I don't know what it's like to dine in but the delivery food is amazing.  Their menu is extensive and spans many regions and countries and everything is not covered in the same sauces. i.e. brown sauce, lemon sauce, sweet and sour sauce, etc. They definitely use those sauces but only when appropriate.  The noodle selection is fantastic.  I LOVE Singapore style noodles and they have the best I have had in the City.  The curry flavor is subtle yet a bit spicy.  I `hold' the chicken and they never forget.  The meat they use is not random chunks of weird textured fried unidentifiable nuggets.  The vegetarian food is amazing.  Garlic Eggplant on the appetizer menu is very tasty and the garlic is actually cooked instead of thrown in raw as an afterthought. Speedy and friendly delivery.  The one time they were running behind they actually called me and let me know they were behind but it would be there soon and hot!  Their minimum is $10 and they don't push or try to guilt you into ordering more.  Their website is strong.  Now downloading a PDF menu or resizing issues, etc.\n\nEveryone has different taste when it comes to Chinese but Country Sky is worth a try and maybe you'll love it as much as I do.", "author": "emily b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-28", "description": "This is my go-to Chinese delivery in this part of town! I absolutely love their chicken fried rice and egg rolls! Good customer service and always reasonable delivery times!!", "author": "Mia M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-08", "description": "Ordered delivery and the food was pretty weak. The mongolian beef was decent, the orange chicken was mostly batter, and the chow fun pork had no flavor. Maybe dine-in quality is better, but I won't be ordering from this place again.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-22", "description": "I think I've only ever ordered the dim-sum and while it's pretty tasty, it's DIM-SUM DELIVERY.  How have other people not thought of this concept?  I don't think I've met anyone that does not like dim-sum but it's typically only a breakfast/lunch option.  Yes, you can find better dim sum at plenty of other places in the city during the lunch hour, but at 8PM?!?! Not a chance!\n\nOrdering tip: their best deal is to pick 3 items (which typically come with 3 pieces each) for $10 or so.", "author": "Niall H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-17", "description": "While visiting SF I used Yelp to find a chinese place close to my hotel to grab some lunch. CSC was a few blocks away and fit the bill well. \n\nMy friend and I both opted for the \"pick 3\" Dim Sum for 11.95 and it worked out well. Pork Siu Mai, Cilantro and Shrimp Dumpling, Steamed Pork Bun, Sweet Rice Tamale, and Sesame Seed Ball were all very good along with the tasty green tea. \n\nService was friendly and super fast. If I lived in the area I would surely come again.", "author": "Eric O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-22", "description": "Oh goodness!  We got kind of forced into coming here for my boyfriends birthday when our plan to go to the steak house got thrown out because we had no reservation.  We decided since we were starving, we would get the closest thing.  We couldn't have been happier when we got our orange chicken.  It was by far the best orange chicken I have ever had, and I always get orange chicken, it's my favorite.  I definitely will visit here again, and tell friends to stop here if they are ever in the area.  The food and service were both great.  Very speedy and huge portions, we had tons of leftovers.", "author": "Kaysha H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-14", "description": "I am surprised by some of the bad reviews.  I really like this place. It's hard to find a good quick bite in the Marina off of Chestnut. Plutos is a usual stop for me.\n\nI live in the Marina. Randomly stopped by Country Sky one night and really liked the food and service. I've been to a few Chinese food places in the city and this is the best one so far. \n\nDishes you must try:\nDry Braised Green Bean (awesome!) \nWalnut Prawn\nSeafood Soup\n\nI tried the Sesame Chicken, I know its an \"Americanized\" dish, but it was good!", "author": "Kennie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-09", "description": "10:30 on a Saturday night.  My wife and I had just decided that we wanted some Chinese food, and I was having absolutely no luck finding a place that was still delivering to the Inner Richmond, which seemed bizarre for 10:30.  Anyhow, Country Sky was still open, and came to the rescue!\n\nWe tried the pork potstickers, chicken and broccoli, mixed veggies, and an order of brown rice.  The potstickers were fantastic.  Not too greasy.  It was nice to have the brown rice option instead of fried rice.  In all, pretty tasty for inexpensive Chinese delivery.\n\nThe folks on the phone were super friendly, and kept good on their promise of a 30 minute delivery.   Reasonable prices too.", "author": "Tim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-12", "description": "The sauteed green beans and vegetable lo mein were respectively delicious and the people-watching, an added bonus.", "author": "Shannon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "The best place for chinese delivery! Our order always arrives earlier than the estimated time and is hot and fresh.  Our favorites include general tsou chicken, pork potstickers, and fried rice with BBQ pork. They are accommodating to our requests for low salt/light oil. We love country sky!", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-15", "description": "Pretty exceptional for a local Chinese place. Fresh and delicious, not greasy or overcooked. Not crowded. Friendly staff. Clean. Great place for dine in or takeout.", "author": "Peter R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-15", "description": "Country sky is great if you're looking for a quick chinese fix.  That being said, I've had better.  Their entrees are generally good, but they will not knock your socks off, by any means.  The chicken corn soup is good, but the fact that they put crab in it deteriorates from the overall dish. The seaweed egg flower soup is absolutely disgusting, no additional commentary necessary.\n\nThe sesame chicken is very good, the fried rice is fantastic, and the beef and broccoli is so-so.  Overall, I'm a fan, but I'm not a superfan.", "author": "Joel K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-07", "description": "We ordered delivery from here one night. The driver arrived sooner than the 45 minutes they said it would take, but didn't bring us any silverware or napkins. \n\nThe egg rolls tasted like they bought them from Safeway and popped them into the oven. You can get better Shrimp Fried Rice at Panda Express. The General Tao's Chicken was too sweet and not spicy at all. The food was simply sub par, and that's stating it nicely. Being that we were in San Francisco, I expected so much more. Disappointing!!!", "author": "Mr. G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-25", "description": "Excellent hot & sour soup. Fried rice highly recommended. We ate at the Restaurant a Sunday evening. Service was a bit chaotic given the amount of take out and delivery orders coming in all the time. \n\nKids enjoyed a lot a the home made lemonade made when we ordered it. Overall a good Chinese restaurant.", "author": "Miguel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-31", "description": "Great neighborhood Chinese restaurant. Reliably tasty fare. Excellent value and exceptional deals at lunch.  Nice and friendly staff.", "author": "Duke K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-11", "description": "We decided to give this place a try. The sweet and sour chicken and ginger beef quality and taste were mediocre compared to other places. We also ordered chow main, but when we opened the packs at home, discovered that they had given us rice instead!! Also all packs leaked sauce by the time we got home (~5 minutes). Definitely not going to order from this place again.", "author": "O N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-20", "description": "Great food and service. Started with hot and sour soup, lovely. BBQ beef sticky bun was delicious. Cilantro and shrimp dim sum was refreshing. Wife had the chicken chow mien and the meat was super tender. Love this place! Katy is on staff and made great recommendations.", "author": "Hugh A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-28", "description": "After almost giving up on Chinese takeout, I found Country Sky - this is now my only Chinese take out place is SF...easy on-line ordering, speedy delivery, piping hot and delicious food...yum yum...We love the General Cho's chicken and the Cashew chicken is also excellent...Orange Chicken is also tasty. Love this place and will be back next time we are craving a great Chinese meal!", "author": "Pam R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-05", "description": "It is still the good Country Sky, worth the price and darn good food. I love this place for take out, delivery or eating in. The prices are really fair and the food is great plus the service is too. They are quick any way you get it and great portions. I love the ginger beef, well actually anything. I have ate there for years and happy to go back any time. It is the BEST Chinese in the Marina.", "author": "Natasha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-11", "description": "SO, so yummy! Best orange chicken I've had. Still craving it... :)", "author": "M T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-02", "description": "Good for takeout and dine in. I've done both!\n\nLast time we ordered take out, it took them 30 mins from placing the order to delivery! \nfood was great and as to be expected. \n\nLove their green beans.", "author": "Hilary A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-24", "description": "San Francisco Sundays have a way of embracing your resistance to Mondays and allow you to slow the pace of the world just a bit.\n\nWith the August gray blanketing the hills, we decided to stay put and do a bit of couch dining.\n\nA friend suggested we order from Country Sky and I thought we would be ordering from an elderly home with chicken fried steak specials. I was quickly corrected.\n\nThe prices are extremely reasonable, and delivery is free which always helps. The food on the other hand...\n\nThe Mongolian Beef was decent, but the portions were severely disappointing. Not much beef, a lot of unnecessary fill, but the sauce had a great kick.\n\nThe Chicken Fried rice and the Chow Mein came in delicious portions, and although the Chow Mein was a bit greasy, expecting anything different would make you the odd one.\n\nThe potstickers barely crossed the limbo line of average ( I prefer mine fried ), but my friend couldn't have been happier with them.\n\nOverall, it curbed my Chinese food craving on Sunday and I'd order from them again, but they haven't solidified themselves as my go to.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-07", "description": "I've lived in SF for 10 years and was resigned that there is no \"good\" chinese delivery.  A lot of \"passable\" delivery places, but I want really good chinese food- like Eliza's, but without having to drive 15 minutes to pick it up.  I've ordered from country sky twice and I'm thoroughly impressed.  Both times everything has been delivered quickly and everything I've ordered (especially the spicy basil chicken) has been awesome.  Also, they are super nice on the phone.\n\nI rarely write reviews (maybe one a year?), but I'm excited to finally find a good chinese delivery spot in my neighborhood and I want to make sure they stay open for a long, long time.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-31", "description": "Phone is okay but I think they raised prices of their appetizers.  2 egg roll for $4.75 and a full order is $6.75?  that's crazy,  \nAlthough food is sometimes tasty, depending on what you order ... I like their combo chow mien but I just can't see myself paying almost $7 for 4 eggs rolls and they are not huge egg rolls.", "author": "Ynez S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "I have been to restaurant twice and was pleased to see I could order on-line and even tip the driver, and charge to a credit card.  I wanted my fried rice made with fresh vegetables, not the frozen peas and carrots that are used at most Chinese restaurants.  They added fresh broccoli, bok choy mushrooms, fresh carrots and okay, frozen peas (too hard to shuck and find fresh year round).   The mushroom and chinese green veggie dish was also made with low salt as requested.  The portions were so generous that I had enough for two complete meals!  It cost about the same as McDonalds, but the food was fresh, scrumptious and delivered in less than 30 minutes.  Loved the convenience of eating at home without dealing with parking and getting dressed!  On the times I have eaten at restaurant, the staff was friendly and accommodating.  The only dish that disappointed me was the minced chicken in lettuce-cups, Betelnut makes the best in town!", "author": "blaine s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-26", "description": "i'm so excited I found this place.  I've been looking for a good chinese food delivery.  Their pork chow mein, house special fried rice and hot and sour soup are yummy.   Looking forward to try the other dishes on the menu.", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-19", "description": "We will never go back to this place and we say that without having tried a bite of their food.\n\nWe took our two, young sons to Country Sky for dinner on Sunday. When we got there, there were 4 tables with diners, the rest were empty. The waitress signalled us to a table where we sat...and waited...and waited. Almost 15 mins after we sat down, I went to ask why no one had come to set up the table, give us water, menus, etc. At that point I was told that the kitchen was closed...it was 7:45p, they're open 10p. She explained that they had too many take-out orders and that they didn't have time to serve people in the restaurant. When I pushed back and pointed out that we had two, hungry little boys with us, she said that we could wait an hour and then *maybe* they'd take our order. While this discussion was occurring, I overheard the man who works there taking another phone order and saying that it would be ready for pick-up in 20 minutes.\n\nI will never patronize a place that so clearly prioritizes on phone business over the business of those who have actually walked through their door. Moreover, the really bad attitude of the owners of this place completely deters me from wanting to give them any support.\n\nObviously, we can't speak for their food. However, their service and policies are so bad that we will never go there ourselves and would encourage others to go to places where they value the customers that make the effort to patronize them.", "author": "Jon Y K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-08", "description": "Food quality is horrible and service is even worse. Very rude staff and food tastes like it came out of a microwave.", "author": "Jack B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "Great for dine in and delivery. Generous portions, solid Chinese food. Great hot and sour soup, and Singaporean fried noodles.", "author": "Esther W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-06", "description": "The dim sum and people are wonderful! It's best to order take out.", "author": "Julie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-01", "description": "Was super yummy big family group of 8 and they brought all of our different meals out fresh and hot :) loved my Hong Kong style noodles yum!", "author": "Andrea N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-27", "description": "Stayed in a hotel down the street, and got real hungry at night so I went to check this place out. Service was fast, food was really good (cashew chicken) not too expensive, what more can you ask for?", "author": "Anon G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-05", "description": "The food was OK. But the service was really bad. We had to wait a looooong time for our food. I think they prioritize the to-go orders over dine-in orders - we saw the kitchen pump out many orders for the to-go customers while waiting. When we ask the waitress for something, she would always forget and we would have to ask again, even for our check. What's really unacceptable is that they listed a 15% service charge as a mandatory tip, without mentioning to us, and maybe expecting us to pay more tips. We didn't even want to pay the 15% in the first place, but we were forced to.", "author": "David Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-08", "description": "Delicious food, great service, comfortable atmosphere, and very affordable. Can't think of anything else you need. The food quality is surprsingly good for the price. I've done take out and sit down multiple times with zero complaints. Very thoughtful and efficient service as well. \n\nIt's not easy to find affordable options in the Marina, but New Country Sky is the exception. Well done, team.", "author": "Brendan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-30", "description": "This place is absolutely one of my spots in San Francisco . They're food is delicious, very affordable , and the restaurant is clean. The staff is super friendly and very attentive. Highly recommend this place (:", "author": "Daisy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-21", "description": "Restaurant #3 on my quest for delivery vegetarian chinese food.  Country Sky was crips and had balanced flavors.  I was surprised by the lack of sauce for my dumplings and steamed buns, although the soy sauce packets managed to cover enough of my needs for consumption.\n\nCountry Sky hews to the traditional literalist menu; ie. I didn't get any side vegetables with my entree.  The food was better than most, and the guy on the phone was probably the most polite chinese food order-taker I've ever encountered.\n\nOverall, a solid 3 stars.  I'd be willing to try it again, see if I can get a better flavor medley with a different menu decision.", "author": "Nelson A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-20", "description": "The service was sweet and quick!  I have an acting class in the Fort Mason Center and many of our actors go to dinner together afterward and we have been trying out different spots in the Marina.\n\nMany got chicken dishes, another a beef dish and another a chow mien dish and another a broccoli dish and I got the Mongolian lamb.  As Rachael Ray would say, \"Yum-O!\"  I can't eat beef right now, so lamb hit the spot.\n\nThe only thing I could think of that warranting only 3 stars, was that the door was open for some reason so the joint was a little chilly and although it's probably a better that the portions were smaller (for everyone in America's health), I was starving and thought the portions could have been just a tad bit larger.  Remember, even though I am a small girl, I can overeat someone 20 pounds heavier than me any day.  I also got to taste some of the other chicken dishes and they weren't all that special.\n\nYou can find cheaper Chinese food that give you bigger portions.", "author": "Susan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "I enjoy this little place. The lunch menu is definitely affordable, and a good cheap option in the Marina. I was hesitant to order the meatless chicken, but it had a great flavor. Have tried both the Meatless sesame chicken, and Mango Chicken. The wonton soup is great, not too salty like some places.  Sometimes you have to flag down your server for a refill, but not a big deal. It is kind of nice to be left alone to enjoy your food. A good place to go solo - you can sit by the window and watch passersby.", "author": "Erin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-27", "description": "I enjoy their choices of dim sum dishes -- a rarity here in the Marina. The owner is a gem, she's nice and very accommodating. And they deliver! If you crave chinese food during the day, their lunch special comes with soup.", "author": "Beverly R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-03", "description": "Country Sky is quick, reasonably cheap and pretty delicious IMO! If you want somewhere to go for lunch in the Marina and don't like big crowds, this place is for you! They also do takeout although the food isn't as tasty once you get it home. I think its because its all in generic packaging and you aren't in the quaint atmosphere of the restaurant. \n\nThe dim sum like appetizers are really good. And if you order one main plate with rice and dim sum.... its yum!", "author": "Leila H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-22", "description": "It's almost a cliche.  The server who doesn't write down your order, even if you're with a party of four, like in my case last night.  Every time this happens I think to myself... \"I don't care if she doesn't write down the order as long as she gets it right.\"  But last night she messed it up.  She offered to fix her mistake but we were with our two and four year old kids, so waiting an extra 10 minutes was not an option.  I was pissed that they didn't adjust the bill and let them know when I paid.  Oh yeah, she forgot about us after serving our meal, so I had to walk to the back and ask if someone could ring up my check.  That's when I told them my complaint and their response was...no I'm not kidding...wait for it....\"Sorry, some times they get too busy in the kitchen to pay attention to the details of the order.\"  Yup, word for word.  This might all be forgettable if the food was better.  It's average.  Period.  You can throw a rock and hit 3 other places just as good but with better service.", "author": "Mister H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-15", "description": "Mediocre - overpriced, decent service\n\nStandard Chinese food with a hefty price tag, relative to other good places. Chalk it up to location and sit-in dining, but that's just smoke and mirrors.\n\nWalnut Prawns dish (standard Chinese fare) is breaded as though it was Sweet and Sour (is it just a big dough ball?). Inedible.\n\nEven Dragon Well (pricey, marina-ized Chestnut St. outfit) does it better, and at similar price point.  Come to think of it, this place rivals Dragon Well in price, but NOT in food.\nBeef, chicken, and pork dishes use meat that is strangely soft and seemingly undercooked.\n\nA couple things are ok, if you're REALLY in a pinch, but seriously, if you're ordering in, so many places on Lombard are better (ie. Feng Shui).", "author": "Bamboo T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "Amazing peking duck! Have ordered it like 8 times since I've been here (3 month period).", "author": "Joseph G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-03", "description": "got take-out and nothing was good.  the mu shu pork was the best thing we ordered.  won ton soup was ok.  the dim sum was not edible.  the dumplings were terrible.  giving two stars because the delivery was fast.", "author": "Auren H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-03", "description": "For those who know Tai Chi, Country Sky is what Tai Chi used to be. Giving that it is run by their old chef and manager. Food is really great for what it is and prices are good too. Every dish we had was great and can't wait to go back again.", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-16", "description": "Always on a quest for the perfect Chinese Delivery, I turned to Yelp and came across Country Sky. Our order guy was pretty friendly and also gave me the heads up that they were busy that night and would be about an hour (was 45 minutes in actuality, I like that, am easy to impress I suppose).\n\nDelivery guy was also nice and courteous, so far so good. Foodwise, I should give this place 3 stars but am going with 4 overall for the service. Our General Tso's Chicken was a disappointment - more limp than crispy, but our steamed pot stickers were pretty tasty. The shrimp fried rice was also prepared well, although we could have been happier with more than four shrimp. The real standout was the moo shoo pork, which was perhaps the best I've had in sometime; sadly the hoisin sauce was a little watery.\n\nWill we order from here again? Perhaps not as sure as the sky is blue, but I'm guessing another shot is deserving.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-27", "description": "Sesame meatless chicken is soooooooooooooooo good.  Its fried but the batter is very thin.  Its a sweet and sour sauce but its not over the top sweet.  Anyways, its the best tasting meatless dish ever!!  (Eat it all hot, not good as left over. Its not real fried chicken after all.) \n\nFive stars because its clean inside and they have this awesome sesame meatless chicken dish.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-18", "description": "We are definitely fans of Country Sky.  We ordered take out and the food was super hot even after our drive home. Our order included the following: \n\n1. Honey Gazed Walnut Prawns-delicious probably because they are deep fried! So happy to find a place that doesn't pair these shrimp with a mayo based sauce. \n\n2. Veggie fried rice\n\n3. Chicken with Black Bean Sauce\n\n4.  Mu Shu pork (their pancakes are amazing; we think homemade!)\n\n5. Veggie Chow Fun \n\nEverything was delicious, not greasy and seasoned well. We haven't enjoyed Chinese food this much in a long time.", "author": "Romeo And Lola K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-24", "description": "Three words for you, my friends: DELIVERY.  DIM.  SUM.\n\nI simultaneously praise the god that gave me such a thing and curse him for introducing me to it only right before we're about to move out of this hood and no doubt out of Country Sky's delivery area.\n\nThe first time we ordered Country Sky's delivery dim sum, I expected it to be semi-crappy, because, really...delivery dim sum?!   My mind just couldn't wrap itself around the concept.  Imagine how pleasantly surprised/addicted I was to discover that their dim sum was in fact, quite good.  My favorite pieces are probably the Siu Mai, the Shanghai pork bun, the shrimp dumplings (which use amazingly good and fresh tasting shrimp - something you don't always get at good dim sum restaurants), and the chicken bun, which reminds me of a dim sum version of Jimmy Dean's sausage biscuit.  I realize this may not be a winning description for some of you, but a) Jimmy Dean's sausage biscuits are delicious, and b) I am a classy lady with sophisticated tastes.\n\nTheir menu has a large selection of vegetarian choices, even in the dim sum section (although be aware - the fried chive dumpling contains shrimp).  Delivery can take a little long (~30-45 minutes), but this is due to the dim sum being steamed immediately before delivery, and the piping hot pieces make the wait very worthwhile.", "author": "Tanya N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "We were visiting from San Antonio and happened upon this place while walking around the neighborhood.  It was so good!  The sesame beef and chicken were awesome.  The hot and sour soup and pork fried rice were terrific too.  We ended up going twice before heading back to Texas.  Enjoy!", "author": "Monica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-02", "description": "I was very pleasantly surprised by Country Sky.  Not everything that we ordered was \"authentic\" (I have very high standards when it comes to authenticity of chinese food) but in terms of taste, I thought the food was great.  \n\nWhat I love about this place is the dim sum menu, which has about 15 standard items.  The pan-fried turnip cake was maybe one of the best I've ever had -- it had the crispy outer layer that so many sub-par turnip cakes are missing.  We also had the chive and shrimp dumplings, which were tasty but had a bit too much cilantro. \n\nMy boyfriend ordered the General Cho's meatless chicken, which I had mixed feelings about.  First, General Cho's chicken is the equivalent of Panda Express chinese food or chop suey.  It's not real chinese food.  Second, meatless chicken?  Even after reading all the reviews on yelp about the sesame meatless chicken, I had some reservations.  However, one bite in and I was sold.  It's almost like eating meat -- the texture of the meatless nuggets (a mixture of soy and egg white, battered and deep-fried, per the owner) was almost like chicken (or rather, chicken nuggets)...and the sauce was pretty tasty, however inauthentic the dish actually is.    \n\nThe one little thing I was disappointed by is what they call the \"steamed won ton\" -- when I asked the owner what this was, he said it was \"hong yo chao tso\" (aka wontons in hot chili oil, a standard taiwanese dish).  What appeared before me was not what I was expecting -- it really was just won tons with a hot sauce/soy sauce mixture.  Sigh.   Also, they did not have white pepper for the hot and sour soup, a requirement for any chinese restaurant.  My hot and sour soup is just not complete without that little kick of spice.\n\nOther high points -- good service; clean, well-decorated space; reasonable prices; and a take-out menu!", "author": "Mitzi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-19", "description": "1) They do dim sum for delivery and the dim sum is better than anything you'd get in Chinatown.  It might not beat that random spot down at 42nd and Balboa or the corporate dim sum you get at Yank Sing, but it's great for delivery.\n2) People who rate a place based on the quality of their Chow Mein need to think again. The fried rice and chow mein here isn't anything to write home about, but they do mostly delivery and so that's par for the course.  It's not bad, just not mind-blowing.\n3) The orange chicken is 1000% better than anywhere in the city.  It isn't like Panda Express, though it is still lightly fried.  It just has full flavor and taste.\n\nThe delivery is usually 45 minutes, but they do it well, package it up well, and seem to be consistently good.  I've gottan taken out about a half-dozen times over the last six months from this place and it hits the spot.", "author": "David U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-13", "description": "It's the tastiest chinese joint in the marina.  If you live up here like I do, diversity is tough on this side of town.\n\nHot & Sour Soup.  Oh yeah.  That hits the spot.  This place nails it for me, 100%.  It's the perfect balance of hot and sour.  Some places pour in 3 cups of vinegar for every cup of water, and then some.  I love CSky's soup because it's perfect (for me). I'm uber picky about my Hot N Sours, and any place that can whip it up like this has my vote!  The Szechuan Beef was crispy and delicious, as was the pork dish I ordered but I can't exactly remember which one....\n\nTheir restaurant is small and casual, but their food is better than one would think.  We've also ordered from CSky for my office when working late and everything we had was delicious as well.  \n\nI think this is as good as it gets, especially for the Marina.  Not better than some of my faves in Chinatown, but damn close.", "author": "Joanne D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-12", "description": "Great service. I never knew this place existed until I walked by. They have a lot of veggie options, which is pretty rare for Chinese restaurants. I ordered won ton noodle soup, which was pretty good. My hubby got kung pao meatless chicken, which was yummy. A lot of people order delivery from here, and I will too in the future.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-26", "description": "We order from this place all the time and it is always great. We usually go for chicken or vegetarian dishes. I always get the green onion pancake. It is the best I have ever had! We order delivery and they are always super fast with nice customer service.", "author": "J F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-07", "description": "Pretty darn good food with a great Dim Sum menu. Quick delivery and they take credit cards. What more could you want when you don't feel like cooking? Beef and Broccoli is good and they even manage not to over cook the broccoli. Tasty little BBQ Pork Buns that you don't see too often.", "author": "Drea L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-15", "description": "Food is great and affordable. You'll probably have to flag someone down for a refill but definitely recommend it!", "author": "Beryl W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-06", "description": "As part of an ongoing project to try new places, my girlfriend and I decided to walk into Country Sky.  We had seen some other yelp reviews, and figured meatless sesame chicken screams out for some experimental tasting.  Well, we skipped the meatless sesame chicken and went all in on the meatless General Cho's chicken.  I hate myself already for the next sentence I am going to write, but you have got to try this stuff.  The owner explained that it was a combo of tofu and egg whites.  I don't know how they made it so tasty, but they're probably guarding the secret more closely than the formula to Coke.  \n\nThe other bonus to this place is that it has dim sum at night.  We had the best turnip cake I have ever had.  It was like a massive but tastier hash brown without the guilt.  The shrimp and chive dumplings were a little too steamed and watery, but that was my only complaint.  \n\nThe actual space was a little small, and it took awhile to bring us our meatless chicken.  (It's not like they had to kill and pluck the chicken.)  Otherwise, I recommend this place.", "author": "Chris I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-18", "description": "I was literally sitting at home, minding my own damn business, doing a little Yelping, when I saw Liz L's review of Country Sky pop up on my screen.  The words \"general tso's meatless chicken\" almost made my heart stop.  Ever since leaving Atlanta, home of my beloved Harmony Vegetarian, I have been on the hunt for another restaurant that makes a dish as fabulous as the general's chicken at Harmony.\n\nSo, my fiance and I ran to Country Sky post haste.  OMG.  I think we have a new favorite Chinese restaurant.  It was so good!  The general's chicken was very different than the version at Harmony, but it was delightful.  We also had the string beans in black bean sauce, also yummy.  We totally scarfed it all down.  The man working there came to gather up our plates and seemed shocked by our clean plate club status. :)  Delish!\n\nAlthough the restaurant itself is small, the decor is really nice.  Everything about our meal here was wonderful.  We'll definitely be back.", "author": "Squirrel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-23", "description": "I live in the Tenderloin, so I am cursed with a small selection of places that are willing to come out here to deliver.\n\nThere also isn't very much dim sum around here.  Most of that is in the Sunset/Richmond.\n\nEnter Country Sky Chinese Cuisine: a Chinese restaurant in the Marina that not only delivers to the Tenderloin, but ALSO has dim sum on the menu!\n\nI'm used to people being pretty grumpy/impatient with me on the phone.  However, the man who took my call was VERY patient with me, even after I told him that I didn't have a menu and would be trying to order some of my favorite dim sum items based on memory alone.\n\nMy order:\n\n1) Steamed pork bun (3 pieces)\n2) Chicken bun (3 pieces)\n3) Siu mai (3 pieces)\n4) Sesame seed balls (3 pieces)\n5) Turnip cake (2 big pieces)\n6) Shrimp dumplings (3 pieces)\n\nTotal: $22.\n\nHe explained that my order would take about 30-45 minutes to deliver, since they had to steam it first.  No problem.\n\nOh and also, all items mentioned above taste FANTASTIC.  My only disappointment was due to the fact that they didn't include a menu in the bag.  But if ordering sans menu didn't stop me before, it certainly wouldn't stop me from doing so again!\n\n($15 min. for delivery; and no I'm not eating all these things tonight in one sitting.  I am definitely saving leftovers, since these pieces are a good size.)", "author": "Dwigt S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-10", "description": "This place is awesome.  Not only is the food fresh and fantastic, but the people are truly delightful.  It is my go to place for good Chinese food and in my opinion one of the better places in the city.  \n\nThe veggie pot stickers and veggie fried rice are amazing as is everything else I've tried on the menu.  As for the people, I must say they are great too.  Last night, unbeknown to me I dropped my wallet and credit cards while picking up an order.  Boy was I surprised when the Country Sky delivery driver showed up to my door to bring them to me.  That is customer service and a perfect illustration of how the people are just as great as the food.\n\nThanks Country Sky!", "author": "j b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-18", "description": "Overcooked Kung Pao Chicken - more like Kung Pao Jerky. Added some veggies to it and was charged an extra $6. Never again.", "author": "Sean E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-02", "description": "Absolutely delicious. \n\nNot sketchy, but still cheap. Knocked Oriental Pearl out of At&T Park. Country Sky is my new favorite .\n\n- the food was fresh, not very heavy or greasy. Big PLUS. No MSG!!\n- the dim sum combo- 9 large piece only $8, yummy in my tummy!\n   (try the shrimp dumpling, soooo good)\n- they give REAL Mu Shu pancakes (not dry, rubbery, or paper thin)\n- when ordering won ton soup you can chose between chicken, shrimp or pork (chicken was delicious, lot's of fresh veggies too)\n- also try the Honey Walnut Prawns - crispy light battered,(not soggy, like so many other restaurants)  sweet, and large prawns\n\nA++  \n\nand the restaurant was intimate, relaxing, and the servers was very nice!", "author": "Cary Elizabeth L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-13", "description": "Pretty cool place to have a meal! The food here is pretty good And you get a lot of it. Lots of items to choose from and it's all well priced. Service is pretty good and Everyones friendly. Only compliant is it's kind of small and when it gets crowded it can get very cramped in there. Definitely a place to check out.", "author": "Brandon D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "Seafood Delight - Also good!!! I have yet to find a dish that I don't like!!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "This place was amazing!  Excellent food.  excellent service.  We went for lunch and tried the dim sum and several dishes...all were great.  I'm not an expert, but the food was tasty and well priced.  also, we went with 2 kids and they really enjoyed it.  Cute neighborhood too.  Would go back for sure.", "author": "Tammy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "I was looking for a good Chinese restaurant that was easy to get to from where we stayed recently. I found Country Sky on Restaurant.com and saw the good reviews. We enjoyed the Hot and Sour Soup  immensely.  The Prawn with Triple Mushroom and Beef with Snow Peas was very good as well.  The staff was very friendly and patient with our slow decision making. We will try to make it there again for future visits to the City.", "author": "Carolyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "This place has a very good variety and not too salty or overdone with sauces.  I recommend the take-out for when you want to take a break from the kitchen.  Not the best in town, but EZ, convenient and timely when you place an order.  Good overall and generally, can't go wrong!", "author": "Craig A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-31", "description": "Oh, if only Country Sky was not in the Marina, it would be getting a 5-star review. I rarely ever get Chinese food that's not delivery. Mainly this is because most sit-down Chinese in the Mission is forgettable at best. But I was pleased to discover such a nice place with delicious food, but still with low prices.\n\nThe pot-stickers are great - very doughy and not overly greasy. We had two veggie dishes - the Ma Po Bean Curd and the Buddha's Delight. They were both awesome. The tofu was cooked really well in both cases, very fresh vegetables, and light but tasty sauces.\n\nThe staff were very friendly and attentive. My only complaint was that there weren't a lot of vegetarian dim sum options. But the entrees are so good that it barely matters.", "author": "Sharon T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-12", "description": "The food is so so for the high price. Dishes are overly salty. They charge extra for rice.", "author": "Kenneth Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-04", "description": "I've been here twice in a matter of weeks, always dining in. A small dining area but always very nice service and fresh food.\n\nWe've been sampling our way through the dumplings on the dim sum menu, and they're all pretty tasty. The chive dumpling wasn't something I thought I would like, but it is a little ball of goodness. \n\nAlso, the dumplings and noodles here aren't extravagantly greasy and won't leave you feeling like you just swalled a balloon filled with ball bearings and send you back home to your sofa to sleep it off. \n\nI've tried quite a few Dim Sum places near Chinatown (I live in North Beach) and this place overall is clean and pleasant, and at no point have I been yelled at by 2,438-year-old Chinese women. I have no idea why, but there are places in Chinatown where it seems I could walk in with fifty-dollar-bills hanging out of my pockets, wad them up and throw the money at them and they would still start screeching at me for no good reason. Mind you, I still go back when I'm in the mood, because some of those ancient ladies make some mean noodles and dumplings...but for a nice, quiet and pleasant experience, this joint has always come through.", "author": "Drew H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-28", "description": "The best thing about living in the city is that you can stay cozy in your home when it's pouring outside and order delivery!  I was in the mood for Chinese and thought I'd try Country Sky because it was in my neighborhood, inexpensive, and had decent reviews. I'm not sure if I ordered the wrong things or what because it was terrible!\n\nI had the Black Bean Chicken which was sour and tasted rancid.  How hard is it to stir-fry veggies, chicken and an already-made sauce? Apparently PRETTY HARD! The vegetarian Mapu was flavorless and bland.  I had to add soy sauce to get a decent bite out of this entree. Needless to say I'll be picking something else the next time a rainstorm rolls through SF. (which won't be too long! ha!)\n\nSheesh!", "author": "Candice M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-10", "description": "precise, personal (even if a little perfunctory) and prompt service. a little peace right off chestnut. say hi to Amy.", "author": "Matt J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-18", "description": "The New Country Sky has excellent Chinese food. As good as its going to get in the Marina if you are not willing to haul yourself to Clement Street. Good food at an affordable price. Perfect for take-out/delivery on those lazy days. Shrimp Lo-Mein and Eggplant with Garlic Sauce are among my favorites.", "author": "Tammy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-05", "description": "The best chinese food delivery we've ever had  in San Francisco. \n\nThe portions are generous, the price is very reasonable, and the quality is very good.\n\nMu Shu Pork: 5/5 stars\nLemon Chicken: 5/5 stars\nBuddha's Delight: 4/5 stars\n\nthey can customize your orders too.. We had Scrambled Eggs with BBQ pork as a dinner entree and it was deliciousss.\n\nTheir deliveries are very prompt (can you beat 30 minutes?) and their delivery guys are always very friendly and cheerful.\n\nUpdate: the mushu pork hadn't been as good lately.. I think I should downgrade it to 3.5 stars.", "author": "Sheren H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-07", "description": "I'll start with a 3 star. This tiny little place justed open in a place that turns over every couple of years. Situated in Marina's \"restuarant court\" of Steiner between Lombard and Chestnut, it offers a nice menu and even soon Dim Sum!\n\nStarted with the lunch special of Garlic Chicken and veggies. Nice flavor but however, light on the garlic. Will update as I go back.\n\nBeen back many times for lunch and it's good, so 4 stars now.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-28", "description": "I ordered seasame chicken and brown rice for delivery last night.  I specified all white-meat chicken, so no promises if you don't do that, but it was awesome.  Very crispy, and arrived on a bed of lettuce, which I enjoyed.  You don't get a huge portion like at some delivery Chinese food places, so you might not want to order one entree and share it across two people unless you are not a big eater.\n\nI also ordered some dim sum (bbq pork buns, chicken buns, shumai).  I got the 3-item dim sum combo, but didn't realize I would get 3 of each item - a pleasant surprise but I guess what I should have expected for $7.95.  Everything was tasty\n\nThis is my new go-to Chinese when I want more traditional fare (i.e. not Dragon Well).  I will definitely be ordering again.", "author": "Ashley K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-10", "description": "Horrible service. They keep talking and fighting in Chinese to one another and ignoring the customer. Have received dry, burnt fried rice more than once. Also cheap assess when it comes to giving hot sauce with your to go order. Every time I have to ask, and they still forget to put it in the bag. The only reason I still go to them is because they are the closest to where I work unfortunately.", "author": "Ferhen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-04", "description": "This place is wonderful.  I ordered delivery and the service was quick, polite, and most important delicious!!!  I tried the broccoli chicken and the wonton soup.  Both were piping hot and delicious.  The wonton soup wasn't just watery broth, it was slightly thicker with tons of flavor, veggies and dumplings.  I would have been just as happy with the soup!\n\nThe only reason I gave this place 4 stars is that I have only tried to 2 items on the menu.  I reserve judgement for in-restaurant eating and more tasting.", "author": "Sasha R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-06", "description": "After a long busy sightseeing day while on vacation in SF my family and i found Country Sky within walking distance of our hotel. Tired and very hungry, we stumbled into this very cute and very tiny little restaurant. We were promptly greeted and seated by our server. We were still in time for the lunch specials and each of us ordered some dim sum and a different lunch item. The food was served quickly and was fresh and tasty. The sesame chicken and sweet and sour pork were really tasty and all of the dim sum we tried were really good. Now if you know anything about San Diego, you would know we are severely lacking in good Chinese restaurants, I wish there was a place like this closer to home. Country Sky may not be the best Chinese that SF has to offer, but to me it was a delicious lovely little place with friendly service and very comfortable atmosphere.", "author": "jeanette d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-26", "description": "LOVED IT!!!! While vacationing in SF my family and i found this little place and absolutely loved it.. we ordered the house fried rice, chow mein, and orange chicken...the staff was nice and the prices were reasonable... too bad i live waaayy out of their delivery radius.", "author": "M S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-24", "description": "The good:  small, casual, and laid back atmosphere.  Sauces in dishes was PERFECT! no room for improvement there.\n\nThe bad: meat quality!  I got chicken and broccoli, and my friend got some beef noodle dish.  They were both to die for, but we both picked around the gross meat (no joke it was rubbery in texture and ground up) and left hungry. \n\nIf they ever decide to pony up and pay for some decent quality protein, I would eat there every day!  This place is probably perfect for vegetarians, but I just have to have chicken or pork in my chinese food.", "author": "Ali G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-13", "description": "This place is AWESOME! I am Chinese and weary of Chinese restaurants. The quality of Country Sky's food is excellent. The vegetables are always fresh and plentiful. Chinese food has a bad reputation for being greasy and unhealthy; however, the reality is that Chinese food has a huge potential for being healthy and Country Sky embraces this. The people that work there are also very helpful. Even the dim sum is good and I doubt they make it there...but who knows, they might. The only downer about the place is that the menu doesn't come with descriptions; therefore, they have to put up with all of my questions regarding the contents of their many dishes.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-05", "description": "The service here is amazing, and the food is delicious. Dim Sum and their meatless options are so great! Amy, the store owner, is a delight. Ask for the Thai ice tea and her mango pudding special!", "author": "Kevin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-04", "description": "On recommendation, I tried the Spicy Chicken with Basil.  It was tangy, a little sweet and absolutely delicious!  Thanks for the suggestion!  Great service as well!", "author": "Sharee V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-18", "description": "This is a thrid times for me to go to Country Sky ( 2 times order food to go and once stay over there). the food is great, especially hot and sour soup. I love it. The staffs are super nice. I'm willing to go back there again.", "author": "thao h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-07", "description": "Awesome food and very friendly staff! Their hot and sour soup was delicious", "author": "nit p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-12", "description": "Country Sky was a great little hidden Chinese restaurant on Steiner near Chestnut Street.  It was Sunday at 4pm and there were a lot of restaurants in that area that either weren't open yet for a sit-down dinner or closed on Sundays.  It's an intimate little restaurant with great service.  The Sweet and Sour Chicken was fantastic.  We also had the fried wontons, honey walnut prawns, chicken chow mein (with mushrooms!).  Everything was good.  Even their Zin was tasty.  Definitely recommend stopping in here- food was provided fast and hot.  Beautiful presentation and large tea list.  Wander off Chestnut for a nice little hideaway.", "author": "Shannon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-23", "description": "I just got back from Country Sky Chinese and it was great! \n\nMy dish was the Sesame Meatless Chicken, the sweetness of the 'sweet n sour' thew me off at first, but it was still great. My partner had the General Cho's Meatless Chicken and it was out of this world delicious- crispy, and just the right amount of spice. Cozy atmosphere as well, I think I found my new take-out obsession, that is, when I am lazy to walk the four blocks.\n\nIf you go, try a pot of Blue Tea- refreshing!", "author": "Ronnie Ray H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-18", "description": "Good solid Chinese food at Great prices!!\n\nFresh vegetables and meat...etc...\n\nStill a secret in the Marina.\n\nCan you say lunch for 5.95!! Bingo!!", "author": "Ken G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-30", "description": "We were very happy with this place. Dim sum was quite good. So was the orange chicken. I agree with one of the other posts that the Crab rangoons were a little skimpy on the  filling, but decent nonetheless. We try to order from somewhere new every time we get delivery and have eaten from numerous different chinese delivery places. \n\nI would have to say that this is the best so far in the Marina area for delivery (Ho's, Andy's, Tai Chi, etc.). Though Tai Chi might beat it out in some regards. If you're looking for good Chinese delivery I'd say give this place a try. We liked it slightly better than Tai Chi (which is excellent). Ho's and Andy's tend to be rather greasy. The fact that they do dim sum is an added bonus :-). \n\nOh yeah, portions are not as large as other places too. So there's one caveat.", "author": "Jonathan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-06", "description": "I love Country Sky Chinese! They have never let me down, from the first time I ate in the restaurant  to every time I have ordered delivery from them. The selection is amazing, the food always arrives hot and tasty and sometimes they even give me extra fortune cookies!", "author": "Brenna L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-31", "description": "Don't get me wrong, I love the friendly service, but the food is just lackluster.  I would rather spend my money at Dragon Well.  The place has kind of a greasy smell when you walk in, but not so much so after you sit down.  I had the pot stickers, sesame chicken, hunan three delight with prawns, fish, and scallops, and brown rice with a couple Chinese beers.  It is plain okay; as I said there is better in the neighborhood.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-04", "description": "The delivery guy here is one of the most awesome men in the Universe. After having difficulty with our front door buzzer/entry-system, he displayed his displeasure by executing a full roundhouse kick on the apparatus.", "author": "Scott W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-30", "description": "Awesome Chinese food in the marina.  I was really impressed by everything we got here.  The hot and sour soup was great, the crab rangoons had real crab, and the entrees had high quality vegetables.  A great option for Chinese in the marina.", "author": "Heather T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-20", "description": "One word. Incredible.\n\nI moved here in 2000 from New Orleans and my favorite cuisine aside from Cajun is Chinese.\n\nFor all of the places I've been to since I moved here this is my favorite. \n\nFirst impression: From the outside looking in you can tell the place is clean. It's a hundred steps above \"House of Nan King's\" dirty floors, musty air and rude staff. \n\nThere aren't staff members making egg rolls on the tables next to you. There isn't a weird sense of potentially getting overcharged for add-ons with illegible checks that you can't dispute.\n\nThis place is Top Notch.  The food is extremely flavorful and not greasy like most other places. The service alone makes this incredible find even more amazing. \n\nI haven't even mentioned the hook of the best Dim Sum I've ever had and the Hot Tea selection that the owner personally goes over with you. Try the BLUE tea and ask him to explain why it's so good. \n\nI had a selection of Dim Sum and my favorite \"Shrimp Chow Mein\" last time I went, and again, not greasy, incredible flavor, and VERY economical. Two of my friends and I ate there for WITH a bottle of Pinot for under 50 bucks.\n\nThey are new and not that busy yet. By the time the word gets out this place will be jam packed with everyone including Michael Bauer who chooses the Top 100 restraunts in San Francisco. Get there while there is still time!", "author": "Dustin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-01", "description": "From New York to Phoenix and now living in San Franciso I have gone from the best Chinese in the country to the worst.  Luckily I found Country Sky when wondering in the Marina.\nFirst this is the only Chinese place I can get the wife to eat at, that is saying a lot.  Country Sky is clean and the staff is very nice.  The fried rice is not my favorite but over all the food to above average for San Francisco.  I really do wonder why it is always dead in there,  I have been there many weekend nights and it is rare to see anyone else there. \nIf you are looking for good consistant Chinese, check it out.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-04", "description": "So happy to finally find good Chinese food take out and delivery in SF.  I had the sesame chicken and beef and asparagus, and was very pleased.  sauces are flavorful.  their dim sum is also legit.", "author": "Adam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-15", "description": "I was in the area and it was dinner time so stopped here to eat. I was pleasantly surprised at the service which was excellent as was the food. I mentioned to my waiter that I was in kind of a hurry and he was very accommodating. I'm not very knowledgeable about Chinese food so asked him for his recommendations. I walked in at 6 and at 7:15 was in my car and on my way. I had an excellent experience and put this address into my nav system because I plan on returning.", "author": "Carlie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-10", "description": "The vegetable chow mein is pretty bomb. The schezuan tofu is alright. If you're getting take out or delivery and have rice at home, I would skip getting the rice, because it's not the greatest.", "author": "Rani M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-25", "description": "The worst chinese restaurant I have been to.  It's a joke really.  Ordered shrimp salad and shrimp was completely frozen - they didn't even bother to defrost it, wtf?!  Crab wontons had no crab in them and were burned.  The only reason we went there cause they have \"they love us on yelp\" sticker on their window.  I guess I have to take those with grain of salt.", "author": "Ruslan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-06", "description": "I think the quality of the food and ingredients was good but the portion was a 1/3 of the size that you get at other places and much more money. I don't think that it's worth it. Plus, I ordered the fried banana desert and I got 5 small pieces for $4.50. That's almost a $1 for each inch of fried banana. Bummer :( It tasted good though.", "author": "FA B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-11", "description": "the general tso's meatless chicken made my night. this is fake meat at its best. not too chewy or meaty that makes you wonder about the fake substance you are eating. and its lightly battered which I feel compliments fake chicken very well.  The sauce had a little spice, a little sweet- very yummy. and they deliver for free. I'm sold. i'll be back here many times.\n\nUPDATE: their sanitary score is a 53 out of 100- that is disgusting. im not going back here until that changes.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-13", "description": "a friend and i went to try this new spot in the Marina last week and we won't be going back, The service was fine, but the food was greasy and we both had upset stomachs later that night. appetizer and shrimp were covered in greasy batter. Chow fun was ok - but add that to the other two items and you'll need Pepto Bismo for dessert.", "author": "Amy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-25", "description": "The food was pretty good, especially the dim sum. If I could, I would actually give this place 3.5 stars. You get what you pay for, considering the place isn't expensive. The dim sum was really great, very light and tasty. I also ordered the chicken kung pao, which was okay, but not quite 5-star quality. The real problem was the delivery time, which took over an hour and half (they estimated 40-60 minutes). The delivery guy was friendly and apologized, but if it's a busy night they should just elongate the estimated time.", "author": "Tali L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-14", "description": "We first visited Country Sky after a very disappointing visit to Dragon Well.  We loved it and have since been back many times and even had it delivered.  The service is impeccable.  The food is flavorful and fresh.  We've had shrimp, pork, veggies, soup, and dim sum and everything has been made to order and delicious.  We'll definitely keep going back and highly recommend you give it a try!", "author": "Bette K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "My roommate always raves about this place so my friends and I decided to stop in for dinner last night after a couple long days of drinking -- and boy were we happy we did! Everything was amazing and very fresh, from the potstickers to the BBQ pork buns. Our server was very attentive and friendly and was happy to offer suggestions when we were stuck deciding between things. When the bill came, we were even more pleased. $50 for all four of us to dine, including a 20% gratuity! We all left feeling very full and satisfied. I will definitely be back.", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-04", "description": "This is the only decent chinese delivery i've had in this city (though i haven't made an exhaustive search.) The food was very good, and delivery took about 15 minutes on a saturday night. -1 star because one of our dishes was wrong.", "author": "Julia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "The positive reviews are true!  Quality Chinese food (including dim sum) with fast delivery (less than 45 minutes).  I had sesame balls, shrimp dumplings, and orange chicken.  Warm, fresh, and really good.", "author": "Michele F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-23", "description": "I wasn't expecting much out of a small Marina Chinese restaurant, but Country Sky had GREAT dimsum.  A limited menu, granted, but still excellent.  The chow mein is good, too, and so are the tea specialties.  Very friendly owners and cute restaurant in general :)", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-06", "description": "5 stars becasue it's NOT in the MIssion....sorry Sharon T, I just had to\n\nof course I used to be one of those \"edgy mission people\"....damn, was I cool\n\nordering delivery tonight, if it lives up to expectations, the 5-banger remains!", "author": "david s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-20", "description": "Very good service and food. Very quick, very nice, goog price.", "author": "Josu A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-06", "description": "I mostly like this place because they care about the interior design and a respectable dining experience. There are big chairs, booths, mirrors, brick, lanterns, and a mural along the main wall.  Their extensive tea menu describes the functions of each leaf--digestive aid, relaxing etc. Prices are reasonable and the service friendly. I thought the food was what you usually get for chinese (deep fried/stir-fried), but tasted better on the artistic plates that changed from appetizer to entree! I liked the intimate feel and the waiters did not make their presence obvious or obnoxious. Surprised me that most people on yelp get delivery. Not so crazy about the sesame meatless chicken. Next time I'll try the dimsum.", "author": "Kim G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-10", "description": "Ugh. Work across the street and decided to give a Chinese restaurant other than Dragon Well a chance - BIG mistake! I ordered the chicken chow mein (my standard order in a new place, 'cause I figure it's the hardest to screw up - chicken and noodles???), and what arrived at my table was a plate full of wormy-looking noodles, bits of chicken that had the texture of calamari, and limp soy sprouts that looked sad to be there. Ate two bites and now glare at it when I walk out the door every day.", "author": "Annie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-28", "description": "I came during an off-hour in late afternoon when I was the only customer.  Full staff, though, including a very loud kid. Didn't mind him, though. The service was polite and attentive.\n\nI tried it out after randomly passing by the menu and noticing meatless General Tso's. I'm no vegetarian, but I'm all about lowering the meat intake. The meatless GT's were good, even if they did first strike me as being a little too reminiscent of Morningstar chik nuggets smothered in Chinese spices. The bright side is that the pieces are plumper and... well, meatier... than chik nuggets.\n\nI had a side of brown rice, so I was too full to try any dessert. But I'll definitely be back. And maybe I'll experiment with some of the teas, too. Very nice tea menu! As fancy-looking as any wine list.", "author": "Joseph R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-03", "description": "This place is great!  The delivery is quick and the prices are reasonable.  The food is really good and not greasy.  We will continue to order from Country Sky!", "author": "Jeffrey T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-03", "description": "I've experienced better, but not much worse than this.  I'll chalk up all the good reviews to \"different strokes for different folks\", but I'll never get this food again.  The delivery was fast, but so was the onset of my MSG-induced headache.  Our chicken had straight up,  huge chunks of pure gristle and fat.  The beef was gray.  Veggies, smelly.  Wife, pissed.  Yours truly, crying.  I tried the leftovers just to make sure -stomach, pissed.    Should've ordered pizza.", "author": "Geoff M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-08", "description": "Yum!  We just ordered delivery from here, but probably shouldnt be telling you because it will make the place more busy!!  The food arrived hot and fresh and fast.  In particular I noticed the attention the food received, both in the preparation and in the presentation. To me, fresh food and clean packaging indicate a place worth ordering from.  I am glad they are in the neighborhood and give Dragon Well a reason to step up their game.", "author": "Mary W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-24", "description": "After hearing of the opening and reading the reviews here, I was excited to order delivery. Monday, after a long weekend, I was thinking about Chinese food for dinner all day.  Barely in the door 2 minutes, I picked up the phone and placed my order. No problems ordering. I waited with great anticipation.  The food was at my door within 20 minutes (I live close by). I grabbed it, ran to the kitchen (not very far from the front door) and dug into the packaging.  My anticipation ended like the first glimpse of a bad blind date.  The food looked weird. I ordered General's Chicken (listed as a Chef's Specialty), bbq pork appetizer, hot and sour soup, and fried rice (anticipating leftovers for Tuesday).  The General's Chicken smelled burnt and was covered in a shiny sauce type thing. The bbq pork seemed to have the same sauce.  I decided to only eat the soup and pork and save the rest for the next day.  The soup was good, but no meat of any kind (isn't hot and sour soup supposed to have meat?).  The bbq pork was so salty, and covered with a horrible sauce that I could not eat it (I really am not that picky either.)  \n\nThe next day, I had a feeling I would be tossing the General's Chicken.  The rice was good, but as much as I tried to eat the chicken, I could manage only one bite.  It was as burnt as it looked, the sauce tasted like vinegar, and the chicken just seemed weird. Too gross to eat.\n\nOh well, I will continue to look for good Chinese delivery.", "author": "Brad Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-09", "description": "Wow...\nSo many reviews touting that \"the food was good.\" The food was good... really? Man, this place should be submitted to the Guinness book for most overrated restaurant in the history of man kind. \nSorry, the food was not good--not even close to it. My standards are not that low, especially in SF when you should expect a good plate of Chinese (considering your not so broke that you have to eat at the crappiest of places just to scrape by). Even the people at the only other occupied table next to us had complained about a very grotesque sounding desert. \nI'll tell you this, if you have any standards whatsoever... if you want to taste tomatoes in your tomato beef chow mien, rather than some fishy crap that I can't even describe... if you don't want your honey walnut prawns to come with an assortment of walnuts that are so frozen that the steam that escapes them isn't steam, but frosty mist... if you want hot and sour soup that's actually hot AND sour--do not go here! If your new to SF, or visiting SF from whatever east Jesus place that serves subpar Chinese, knock yourself out. But for the natives who know good Chinese, I just did you a fat favor, trust me!\nStay safe!", "author": "Mike S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-12", "description": "I never write reviews but I had to give a shout out to Country Sky! Was totally craving Chinese and they totally delivered (in so many ways).\n\nFirst, they delivered so fast and the food was literally steaming hot when it got here.  Second, I ordered Mu Shu Pork (yum!), Orange Chicken (yum!) and got Chow Mein for free.  All of that food for less than $20 and free delivery!  Cannot be beat!\n\nDefinitely will be my go-to for Chinese delivery in the future.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-09", "description": "I loved their meatless dishes. Super Yummy. The Dim Sum was yummy too. The food was good and not really greasy, big plus! Delivery time was quicker then quoted. Overall good experience.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-10", "description": "Quick delivery and reasonable priced.  We ordered Hot and Sour soup, Lettuce Cup with Minced Chicken, Beef Broccoli, and Dim Sum Steamed BBQ Pork Dumplings.\n\nThe Hot and Sour soup was great, a bit of kick to it but not too hot for my mom.  The Lettuce Cup with Minced Chicken was not that great, possibly because it's not what I expected.  The place close to my home (Long Beach, CA) dices up the chicken much finer.  This chicken seemed soft and lots of frozen peas/corn in the mix.  I'd pass on it next time.  Beef Broccoli - Mom liked the fact that the Broccoli was still crunchy but the beef was just OK.  I loved the Steamed BBQ Pork Dumplings.", "author": "Cheryl D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-13", "description": "The guy who runs the place is like the nicest person in the world. If you're not sure what you wnat, he will take his time with you and try to help you figure out exactly what you're craving (which is a challenge with Chinese food because you crave everything). And the dim sum is great. Try the \"peach buns,\" or any kind of dim sumbuns really because they're all delicious.\n\nupdate:\nthe general tso's mealtess chicken is AMAZIIIING! i get it every time i order now. this palce keeps getting better", "author": "R M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-04", "description": "Ordered from here on a few occasions, very fast delivery, affordable, yummy, and the only chinese food in san francisco that doesn't give me explosive......", "author": "sean f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-11", "description": "I was walking around the Marina and I bumped into this cozy little restaurant, I was impressed. I tried the combination sea food rice, it was tasty and spicy, I also tried their kung-pao chicken it packs a potent punch. They also have a good collection of tea, I tried the black lychee tea, and it was a blast.", "author": "Robie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-08", "description": "This is my second choice chinese restaurant in the Marina.  Got the General Cho's chicken (Spelled wrong on Menu) which was eh and the crab rangoon which was burnt.  The service was friendly and fast but the food wasn't very good.  Definetely prefer Dragon Well.", "author": "Shannon B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-11", "description": "*Based on Delivery only\n\nI would actually give this place a 3.5 if I could because while I haven't had anything earth shattering, it has delivery dim sum which in itself deserves at least 3 stars for difficulty.\n\nThat being said, it has been all about the dim sum for me. When you need a fix, it does the trick. Quality varies I've found, but more often than not its surprisingly decent. I can at least say its better than a most of those take out dim sum shops in Chinatown with stuff pre-made.\n\nBased on what I've had, I would say beef dishes are their weakest point. A little heavy on the garlic for my taste, and meat can be chewy.\n\nI had some fish in a spicy sauce from the special menu that I thought was pretty good. For dim sum, the shrimp dumplings, the pork and veggie pan fried dumplings, and the bbq pork buns have been winners.", "author": "Pete L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-07", "description": "i got delivery yesterday. the food tasted pretty good, chicken and beef were tender, etc.\n\nthen my appetite and overall experience got ruined by a FILTHY, DISGUSTING, and UNSANITARY cockroach or other bug that was mixed into my chicken fried rice that was luckily not bitten into. now i have to go listerine.\n\ni purposely reactivated a useless yelp account just to say this to all of you.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-19", "description": "I was craving Chinese food last night. I ordered some food off of their website and walked the 5 blocks to pick it up. The atmosphere was quiet because it was less than an hour before closing. I ordered something to test how well they did on things I love (egg rolls, pot-stickers, Chicken chowmein, and pork buns). I'm pretty picky when it comes to Chinese food and to have to walk more than 2 blocks isn't a big deal but it better be good to get me to walk that far. This place is AWESOME!!!! The chicken in the chowmein was good, clean, good sizes of white chicken meat. Most places I go to have cartilage or fat that only gets found after you chew on it. I will definitely order again (probably have it delivered next time ;) ). The person that gave me my order took the time to mark on the menu all of the dishes they sell regularly. The other restaurants I've gone to would just say, \"Oh everything is great,\" or just act like they didn't hear me. The fact that they are on Seamless.com will be helpful for me so that I can order my food on my cellphone and pick it up on my way home.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-29", "description": "First let me just state that I'm a HUGE dimsum lover.  And lucky for me I live in Inner Richmond, where Chinese restaurants, authentic or not, are abundant.  So naturally I was very excited when my boyfriend told me about this Chinese restaurant he'd found in the Marina and how good their dimsum was.  \"Good Chinese food in the Marina?  Are you kidding me?\"  But the way he raved about the place made me decide to give it a try(let me also add that my boyfriend isn't usually crazy about dimsum - so this was huge)\nWe got to the place and I immediately gave him my first nod of approval when I saw the decor: tasteful, cozy, and very clean.  We started off by ordering a pot of tea(Ging sen oolong, which was VERY good), then looked over the menu: standard Chinese dishes, with a section dedicated to dimsum.  The dimsum menu isn't super extensive, although it does include all the standard items, such as shrimp & chive dumpling, BBQ pork bun, pork suimai, fried turnip cake...  The owner, who was waiting on us, and who was by the way very friendly, told us our dimsum would take sometime to prepare, as they're all fresh-steamed or fried.  No problem.  The fresher the better.  \nWe ended up ordering six dishes(I was really hungry, and plus I am extremely greedy when it comes to trying out new restaurants):\n- shrimp & chive dumplings\n- chicken suimai\n- steamed BBQ pork buns\n- fried turnip cake\n- sweet rice tamale(which is often called \"sticky rice with pork wrapped in lotus leaves\" at other restaurants)\n- pan fried chive dumplings\n\nWe got the shrimp & chive dumplings first, and one bite into the juicy and decadent shrimp & chive dumpling I was sold.  It was delicious and I swear I could TASTE the freshness of the food.  We polished off our plates quicky, eagerly waiting for more.  I was just as impressed with our other dishes, especially the turnip cakes.  There's something about the way these cakes are prepared here that really sets them apart from the turnip cakes we've had at other dimsum places.  \nThe owner kept our teapot full the whole time, and really chatted up with us when he found out I'm from Taiwan(that alone should be indication of the authenticity of the food!)  It was overall an extremely pleasant dining experience.  And we left with our stomaches full and feeling content.  \nI strongly recommend this place for dimsum(as since I haven't tried their regular main dishes I can't really vouch for those), and you should definitely have the dimsum there(as opposed to getting it to-go or having it delivered).  I'm planning on spreading the word to my dimsum-loving friends, and I can't wait to go back, only with a bigger group next time!", "author": "kristina h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-17", "description": "I have no idea why so many people like this place.  I ordered dim sum for delivery and the food was terrible, so bad that I threw it out.  The delivery guy was very nice however.   Don't fall for the other reviews like I did and go elsewhere for you dim sum fix!", "author": "Pam F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-08", "description": "It was so good, I fought the Fleet Week traffic and went back the next day. The boyfriend was sick all weekend and I was searching for some good hot n' sour soup to clear his sinuses and calm my nerves. We ventured into the Marina, finally found a parking space (fuck, I hate parking in this town) and went into Country Sky. Weird name for a Chinese restaurant and the music was odd (piano instrumental of Amazing Grace), but the place was clean and comfy and the food was fantastic! I had one of their hot teas, of which there was a nice selection to choose from, hot n' sour soup, pot stickers and orange chicken. The soup was spicy and freakin' hot, just the way I like it! The pot stickers were doughy and soft with an incredible dipping sauce and the orange chicken was not greasy at all. I must say that this is the very best Chinese food I have had since I moved to SF. Try it and I promise you won't be let down.", "author": "And e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-30", "description": "In a city filled with food delivery options, this is one of my favorites.  I am often too lazy to cook and as a result have a manila folder two inches thick filled with delivery menus.  I love that this place delivers dim sum.  I mean pretty decent dim sum.  And they deliver it promptly enough that it does not get soggy.  Everything from the siu mai to the pork buns to the shrimp dumplings are awesome.  Their regular entrees are excellent as well.  The pork pot stickers are very good.  I have a thing for Hong Kong style noodles made with chasu and bok choi.  Crispy noodles with a delicious gravy.  The string bean pork is one of my favorites too.  While I try to stay away from too much deep fried food, the sesame chicken is too hard to resist sometimes.  I like it because the sauce is not too sweet like others I have had.  The mongolian beef is pretty marginal.  Not much flavor.  One of the cool things is if you order two entrees, you get a free chow mein or fried rice.  Get the BBQ pork fried rice.  It is delicious.  They are always very good about telling you if you expect a delay with delivery because they are busy.  Really good value and delicious food.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-07", "description": "very very fresh dim sum. everything tastes homemade and delicious. highly recommend", "author": "alisa o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-10", "description": "The atmosphere is cozy, modern, clean. The service was excellent. Very attentive wait staff and awesome owner. They made sure we enjoyed every course we ordered and refilled our beverages constantly. We had a couple main entree's (mushu pork, sesame chicken) and hot and sour soup, it was really good. We also had a few dim sum items, those were average. I guess overall we enjoyed the atmosphere, friendly service, good food and reasonable prices. We will definitely come back!", "author": "D B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-16", "description": "Quite possibly the worst Chinese food I've ever had.  Talk about mystery meat.  Both the beef and chicken were questionable at best.  Both tasted like the grinded remains that aren't suitable for eating.  Disgusting!", "author": "Jacob S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-01", "description": "My boy friend and I were walking around Marina area and found this little chinese restaurant.  We decided to give it a try and we're glad that we did.  We really enjoyed the food and the excellent service.  This is the best chinese restaurant (definitely way better than Dragon Wells on Chestnut St.) in the Marina area.  We have actually gone back to this restaurant the 2nd time and once again we enjoyed it very much.", "author": "Bella L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-10", "description": "first of all-- i know what you're thinking. why is this in my \"why the inner richmond rules list\" when it's on chestnut & steiner? well, because they DELIVER TO MY HOUSE IN THE INNER RICHMOND!! i heart delivery, and when hungover i realllllllllly heart delivery. anyway, i've never had any of the meat dishes here but the vegetarian stuff is great. they have two kinds of meatless \"chicken\" and delicious vegetarian hot and sour soup. one time i ordered veggie pot stickers and they turned out to have pork in them which was super gross, but mistakes happen and since i figured it out after one small bite i'm not deducting any stars, but just wanted to suggest that checking your pot stickers before you dig in is a good idea for all you other veggies out there. anyway, the soups and veggie dishes are great, and i so appreciate being able to enjoy them from the comfort of my own couch while watching 90210 or the golden girls. thanks country sky!", "author": "Jessica C."}
