{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-19", "description": "Long time, small Hookah/tea lounge tucked away in the Tenderloin. Intimate ambience. The house tea made with milk rivals some of the best Pakistani/Indian chai I've had- a must try. \n\nHookah- 3.5 stars\nA good quality Khalil Mamoon base- but hose tubing is plastic-corrugated but had a decent pull. (A rubber hose with metal end would be better)  Comes with three coals- a bit harsh, I had to take off two of the coals- for a slower better burn. (Ask for tongs).\n\nHouse tea (ORDER IT WITH MILK!)- 5 stars \nUnbelievable- it's Chai- and quite possibly one of the best chai's I've ever tasted. Perfect for chilly SF evenings. \n\nRandom fact: This is where I lost my hookah virginity over 15 years ago. It's been around that long. That kind of longevity for shops like this is becoming harder to find these days.", "author": "Sami A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "This place is a great hole in the wall to relax and enjoy alone or with friends. Great ambience, crowd, music, and selection.", "author": "Mariam J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "Aside from being an obvious hookah lounge, this place serves the best tea ever. I seem to always Uber from the other side of SF, when I'm in the city, to get my tea fix. They will never give you the recipe, but I ask all the time anyway.\n\nWhen it's slow, the people working are willing to play your song preferences if you ask. Score!\n\nThe bathroom here gets 0 stars. It's disgusting and never stocked with anything; soap, toilet paper, toilet seat covers, or paper towels. They will, however, stock up when you ask them to. But fear not, they have a sink in their corner so the employees clearly wash their hands.", "author": "Love K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-03", "description": "This place was terrible. Limited hookah menu and their bathroom was disgusting! I went in and noticed there weren't any tissues so I asked the employee for one and instead of going in there and putting it in himself (and perhaps clean up a bit too),  he just hands the roll to me. Like what? \n\nSave your money. Not worth it.", "author": "Kimberly B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-06", "description": "They are reasonably priced than most hookah bars in the city!\n\nTheir tea is decent too.\n\nBut they always leave the door open which makes the place soo cold! I only hate that about this place!", "author": "Deebs M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Mohammad and EB thanks mate!!!! 3 tables outside, 4-4tops inside, many 2 tops inside maybe 8+ Music was slapping!!!!!\n\nFirst time here Friday 1am and there was about  3 tables sat. Mohammad friendly greeted me and my friends and sat us. \n\nWe ordered the Obama which cost $25 plus tax. We really enjoyed our stay because Mohammad demonstrated some smoke tricks, as well as, regularly changed our coals.\n\nI see myself coming back here with friends. \nThanks for the great service!!!\n\n#JrayEats", "author": "Jray M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-01", "description": "Pretty disappointed after coming here. I'm guessing San Fran isn't really big on hookah bars because it was almost impossible to find some decent hookah bars around here. After desperately searching, we decided to come to this place. Their hookah menu is very limited and they only use coconara coals which i thought was kind of weird. I ended up ordering and the hookah they brought out to us didn't come with a clean pipe, you have to request it and pay a little extra for it. Here in the DC area giving people a new pipe is a given. Well we asked for a new pipe and started smoking. The hookah was good for about 10 minutes and after that it got really harsh and would burn my throat. I didn't have a pair of tongs to change the coals myself so I had to wait for one of the workers to come by so I could ask him. The service is kind of slow but not too bad. Another thing that I noticed is that it states on their menu that they only change your coals twice and thats it. I'm not sure if this is something common in the area or if its just that hookah bar but i have never heard of any hookah bar putting a limit as to how many coals you're allowed to have. Well it turned out that there was no need for a change of coals because we ended up leaving cause our hookah was so bad. Despite the hookah being terrible, the servers are very nice.", "author": "Nargis A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-12", "description": "Super expensive for nothing special. Dirty ass bathroom ... and I believe this place is owned by Muslim. Cleanliness is next to Godliness. Not a big variety of flavors but the Obama was good.", "author": "Khadeejah S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-14", "description": "This is actually the worst hookah bar I've ever been to. \n\nFirst of all it's TINY--we came as a group of about 10 people and the only place for us to sit was at the cramped bench area next to the door (we were on the verge of sitting on top of each others laps lmfao). This place is definitely more for smaller groups of 2-4 people and nothing more. Secondly, the service here is TERRIBLE. Apparently there is a rule that one hookah must be shared between two people. But the problem is not everyone in our group wanted to hookah, we just wanted to chill together, but they said we HAD to order a hookah between two people...that's 5 hookahs (each ~$20+) are you kidding me? We tried to kick a deal to order 2 hookahs and some tea for our group but the guy wouldn't even let us do that. This place is ridiculous and not chill at all. If you're thinking of coming here with a big group just don't bother", "author": "Christy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "This is still the best hookah lounge in town! Nice music, great hookah and awesome tea. Simple and a wonderful place to relax. If you want to hang with your friends and enjoy a hookah this is best place for a great value.", "author": "Christopher F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "Great tea amazing tea and their Obama flavor hits for hours on top of hours. And the young gentleman who work their are very nice", "author": "Laid C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "This place is so fun and chill! The employees are awesome and love having fun with the customers. They recognized me by the 2nd time I was in there! If I'm ever in SF in the evening, looking for a spot, this place is my go to! Also can't forget their delicious tea :)", "author": "Angela M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-11", "description": "Hookah (reviewed by a friend) - had to pay extra for additional coal ($4 for two coal?!) when it burned off.\n\nI bought a mojito for $5 which was literally a mint leaf in sprite. \n\nVery disappointing. I don't mind paying for quality, but I don't want to be paying for nothing.", "author": "Raakin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "This place perfect for chilling out with guys. Awesome hookahs. Something really unique about the hookahs is they burn for an hour easily and they don't use coals. They use some secret stuff guy explained but I can't write his secret. That thing doesn't hurt ur throat at all. To end good smoke you should order the Great Turkish coffee. Very reasonable pricing. Actually cheap by SF standards.", "author": "Ninad N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-08", "description": "total rip. prices - ridiculously high. accommodations (compared to standards established by other hookah lounges) - extremely weak. smoke - extremely run of the mill. \n\nbeen to many a hookah lounge. worst prices and set up i've experienced.", "author": "Tyler D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "What sold me was the fact that this hookah bar isn't so smokey! Considering that this place is pretty small, I definitely did not feel suffocated with all the hookah smoke. Awesome place to hang out with friends while listening to great music (music playlist is awesome). Tobacco wasn't harsh at all which was great, no headaches or light headedness! \n\nBetween 4 people, we ordered two pots of tea and it was soooo good! Perfect addition to smoking hookah.", "author": "Shela D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-26", "description": "Hookah is ok. But the management rejected to take a request for a change of music. Kept playing some lame tracks from the 90's. Even when my group was the only one present there. Disappointing. Horrible service. Will never go back. Laguna Cafe is way better in service and hookah than this horrible place.", "author": "ShoAib S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-22", "description": "I have been to this place so many times to have fun with my friends after drinks for Hookah and everything goes as good as usual. Lately, i went with 3 of my friends and only\n2 were going to smoke hookah and the others were getting hot beverages. To our surprise, they asked our friends who are not smoking hookah to pay $10 charge for no getting hookah!!!!! Which makes no sense and the server was rude about it, he didn't care for loosing customers.", "author": "Gina T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-04", "description": "A small, cozy hookah lounge on Jones street. The decor is cool and they offer a great milk tea. Selection of shisha flavors is alright, but man they char it every time. Getting replacement coals is a struggle (staff is very inattentive) and the pricing is not competitive for the quality.\n\nDuring my last visit I also noticed a massive splotch of black mold on the ceiling, calling the cleanliness of the whole place into question.\n\nNile will do the job if you really want a hookah - but it's far from ideal.", "author": "Irina P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-31", "description": "Not much seating, overpriced, and semi-sucky service. We got kicked from our spot so that a larger group could sit where we were...insteAd of having them wait or putting them somewhere else, without any sorry or compensation of some sort (e.g., discounted bill) especially since we had to ask twice for coal change because they forgot when we first asked!", "author": "Natasha K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-17", "description": "I can call myself somewhat a regular here, I've been to this place around 10 times, and my experience has been pretty much the same every time. Their space is small, so it usually gets packed by 11PM on Friday/Saturday. Good hooka flavors, not too many options for tea, they ones they have are pretty average and too sweet at times. Their service depends on who your server is, sometimes okay-ish other times great. Usually they have arabic music playing on Fridays and sometimes take song requests.  Their bathroom is really tiny and mostly dirty, but looking at the size of the cafe I'm just glad they have one.", "author": "Reema B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-18", "description": "This is what you call a shit show. \n\nPacked as hell on a Friday night, my friend and I walk in and ask for a table for 2 and we're sat right near the door. 15 mins goes by and someone says do you want to order and we're like, can we have a menu? We just order mint hookah without opening it up. Now another 15-20 mins go by and our hookah hasn't came. We asked the guy 4-5 times where it was and he runs back confused and places the order. 5-10 mins later we get a shit hookah, in a hot/humid room even with the door open. They are cash only too, stay as far away from this place as possible. \n\nYou're better off walking down Jones St to the heart of the TL and taking in the second hand smoke if you know what i mean lawlz.", "author": "Daanyaal K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-19", "description": "I can smell the hookah almost everyday when I walk by so I decided to go there and truly it out as it seems like an ok spot. Let me tell you this place is so small you can't make a U turn. So I ordered one of the hookah flavor that the employees recommended. The hookah was ok nothing special actually it gave me a headache it must be from all the hookah smoke inside the place \nIt gets overwhelming after a short time.\nIf you go there I suggest an outside table.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-22", "description": "Mediocre hookah cafe in the middle of the city. Good place to stop for some hookah if you want to stay close to bars and restaurants nearby. Their Jasmin tea was pretty good. We tried the Nile mix, it wasnt as good as the staff told us it was. The hookah was actually pretty harsh even after they tried to make it better. Dmitri is great and takes good care of his guests. If you sit in their outdoor seating area expect to get approached by bums, prostitutes, and general street hustlers lookin for a come up. The staff does everything they can to make them leave and prevent them from coming back but theres really so much they can do. It is San Francisco so you kind of get that just about evey where you go in the city.", "author": "Vince N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-10", "description": "THANK THE LORD THEY REPLACED THE BATHROOM DOOR.\n\nAlso we are recognized as regulars now, so the service has improved markedly.  This is nice, in fact they remember our order as well, so we don't even really have to say much when we arrive.\n\nThe music can be kind of a mixed bag, sometimes it's middle eastern (Egyptian?) music videos, one of the last time we were there, though it was wall to wall Taylor Swift.  I can't really complain, who among us doesn't love a little Tay Tay from time to time?  It was just a bit of an unexpected departure.\n\nThey also did a bit of a renovation recently which had them make more efficient use of their space; they can accommodate many more parties without the space feeling more crowded, so that is good.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "cool spot, but can only eat outside food in their outdoor area.  verysmall too but i like it.", "author": "Tasha D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-31", "description": "This hole in the wall spot does not represent anything great that you love about hookah. My small group of four were the first ones in on a Sunday night, but we waited over 20 mins. after two more groups that came after us got their hookahs before us.  If you read other recent reviews you'll see the same thing I'm about to say:\n- They're always out of flavors (took us 3 tries).\n- Not only are their hoses these cheap little vacuum extensions, but their hookahs are so cheap they use paper towels for proper seal (pictured).\n- The service is the worst. Oh let me count the ways.  I had to tell the cashier how to use his own register to split the bill which he emphatically insisted couldn't be done.  It could.\n- The \"service\" has to be the rudest, most unprofessional service you'll receive anywhere for anything.  Case in point: one of us asked for sugar for tea.  The guy grabbed a sugar shaker, turned it upside down to see if sugar poured which it didn't, and then gave it to my friend.  \"Does this work?  No?  I'll give it to 'em anyway.\"  \n- Their cup ware is dirty and CHIPPED like crazy.  \n- Did I mention the service sucks?\n\nSkip this abysmal disgrace.", "author": "Nick J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-02", "description": "We usually like to get \"The Obama\" which has very good and sweet flavor. The service and music is good.", "author": "Manish K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "Best hookah spot in the city! Great staff.\nGood tea too!\nMango is THE BEST! (Mango the manager, not the flavor )", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Love this place. Hookahs are pretty good and the tea is the bomb. I get a pitcher of the house tea and the Obama (not sure if that's how you spell it) flavored hookah.", "author": "Tony S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-08", "description": "Have you ever walked into a place and instantly realized you entered an alternate world of absolute trash? That's this place in a nutshell. Overpriced garbage.", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-27", "description": "The gentleman serving is here is so nice. Get a pot of their black tea it is delicious! And the hookah is very very good!", "author": "Sarah E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-09", "description": "Super rude. Refused service to my friend and I even though they were clearly still open. We arrived at 1 and they state their hours until 2. We promised to smoke and be out diligently but they adamantly refused us even though there were other customers inside", "author": "Briana G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-31", "description": "Best chai tea in the city!!!\n\nNow lets get to the hookah part. \nHookah here was fabulous. We sat outside & puffed until we choked on the mint chocolate/strawberry concoction we had smoked. Lovely. Super crowded on a Wednesday night so the service was on the slow side. \n\nMet the owner who is very polite, professional & accommodating.\n\nThe flavor choices are intriguing. Next time ill try the Obama!\n\nCash only- ATM inside for fee of $2.50.", "author": "Court S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "I love this place! It's my favorite place for hookah in SanFrancisco! The people who work there are really cool, kind, and helpful!", "author": "Husam A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-08", "description": "Wonderful small, chilled out hookah bar with fantastic flavors and well prepared hookahs. Visiting here from Michigan and this kicks the crap out of every hookah bar back home. We ordered a bowl of \"Obama\" sheesh and two Chai Lattes. Both are fan- fucking- tastic. Only thing missing is a comfy seat.", "author": "Brain W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-18", "description": "I pity people who've been hit with the stupid stick. \n\nYou know, the idiot at the office who stands in front of the printer asking \"Why isn't this fax going through?\" Or the cashier at the grocery store who looks at your ahi tuna steaks and says, \"I never knew 'Ahi Tuna' is a breed of cow\". Or when you ask for a half dozen eggs and the response you get is \"It doesn't come in half dozen, just a pack of 6 or 12.\" WTF?!?!? If I didn't feel so guilt-ridden afterwards, I would try to slap the stupid out of these people. \n\nJust where do all these stupids end up next on the \"corporate ladder\"?  Nile Café & Hookah Lounge. Never in my life have I seen such display of horrible customer service from blatantly careless and dumb-as-bricks employees as I did at Nile Café & Hookah Lounge on Friday night. \n\n10:45 PM - Arrived\n\n10:50 PM - Seated and ordered drinks\n\n11:20 PM - Stupid #1: *Drops off water* \"Ohh umm, I forgot to place your drink order.\"\n\n11:35 PM -\nMe: \"What flavor is Sweet Sensation?\"\nStupid #2: \"Sweet.\"\nMe: \"What flavor is Sex is on the Beach?\"\nStupid #2: \"Sweet.\"\nMe: \"What flavor is Nile? Oh let me guess, 'Sweet'?\"\nStupid #2: \"Sweet.\" *walks away*\nMe *thinking*: What the f*ck just happened here?\n\n11:45 PM -\nMe: \"We want to order Jasmine Mint.\"\nStupid #1: \"We don't have Jasmine Mint.\"\nMe *opens menu and points*: \"Jasmine Mint which is also called Paradise.\"\nStupid #1 *blank look on face*: Ohhh, yes. \n\n12 Midnight -\nStupid #1: *Comes back with coals and NO hookah* \"We don't have Paradise.\"\nMe *clinches fists and looks at friends*: \"GIVE ME A F*CKIN' SHOT!\"\n\n12:10 AM -\n*Manager walks by*\nMe: \"Excuse me, we've been waiting for 25 minutes for our hookah.\"\nManager: \"Ohh, who helped you?\"\nMe: \"Guy in sandy blonde hair, umm he's a bit...\" *bites tongue*\nManager: \"Oh, he's high...\" *walks off*\nMe *clinches fists and looks at friends*: \"GIVE ME A F*CKIN' SHOT!\"\n\n12:15 AM - *Hookah FINALLY arrives*\n\n12:45 AM -\nStupid #3: \"You have to pay now.\"\nFriends: \"We still want to order more.\"\nStupid #3: \"But you pay now...\"\nFriends: \"So we have to start a new tab every time we want to order more?\"\nStupid #3: \"Yes, you pay now...\" *hoovers over table until we paid*\n\nME *clinches fists and looks at friends*: \"GIVE ME A F*CKIN' SHOT!\"\n\nP.S. - Yes, I AM PMSing. \n\nOTHER NOTES:\n*$20 for each hookah flavor (over 50 regular or mixed flavors)\n*Order the House Tea which is like a sweet Armenian Chai tea\n*Indoor couch seating and outdoor patio seating (good for people watching)\n*Expect to be harassed by druggies and crazies when sitting outside\n*CASH ONLY", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-10", "description": "It was my first time here with a friend. We asked for peach the guy went to get it and came back to tell us that they don't have it. So we wanted to get strawberry and they didn't have that either. So we had to settle for blueberry. The place was super small!", "author": "Anahit J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-26", "description": "If I could leave a negative star I would!\n\nJust left this place with a few good friends looking for a good time. We ordered two hookahs to split between four of us and it took them over a half hour to bring them to us on a not so busy night. We also ordered tea. The tea was never brought to us. Because we had two extra people who weren't smoking they told us that we needed to order an extra hookah because it needed to be two hookahs for every two people... Even though the two extra people weren't smoking. The bill was brought to us and they charged us for the tea and got mad that we didn't order an extra hookah. When informed that we never received the tea they told us they couldn't take it off the bill and proceeded to rush to bring us our tea even though we didn't want it anymore and wanted to just leave. The servers and manager were absolutely 100% rude and argued with us the whole time even though we were paying customers. Never coming back to this place again. Rude slow service and not worth it at all.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-24", "description": "Greatest thign about this place is the hours. It opens until 4am which is the perfect place to come to after bar hopping until 2 am a couple blocks down. Ambiance is dark but has loud music glaring in the background. Not a hookah expert but I assume prices are decent. We were group of 4 ordered 2 hookahs total came down to $40. So about $10 a head. Hookah flavors were okay. Nothing unique from the flavors you can buy at tobacco shops.", "author": "Jude N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-11", "description": "Open seats three of us, staff puts in the smallest area ask to be move told no. So they rather have empty tables, than paying costumer... Wish I could have tried it.", "author": "Wanda M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-14", "description": "Never come to this place. I have had the worst service experience ever. You will sit at least 15 till someone takes your order (if you find a place to sit). The seatings are horrible btw.\n\nTheir hookah tastes like crap. I have ordered double apple and there was all flavors in it (wtf?) \n\nIn addition, they don't have anything but hookah to serve.\n\nYuk!", "author": "Faisal A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-25", "description": "Garbage! Hookah was ok..ambience not so much..tiny place..loud music...poor service..overpriced...used to be my go-to place..not anymore", "author": "Joe D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-16", "description": "We've been on a hunt for the perfect hookah bar in San Francisco and this place certainly isn't it. The service is incredibly unprofessional. Though the hookah wasn't bad, we just felt like the servers were ignoring us. There was a 2 people per hookah rule and even though two people from our party of six aren't smokers we were still asked to purchase a hookah between them. Overall, I wouldn't recommend this place unless you want to deal with unprofessional people.", "author": "Shabbir V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "One of my favorite hookah bar in the city.its very tiny place but still good atmosphere . They have only one good flavor which called Obama. They really need to work on the other flavors. Customer service is awesome. Ask for mango or ahmed they both great . Friendly.", "author": "Al-Sheikh Rabby A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-14", "description": "Looking for a chill place to hangout after last call in SF? This is it.\n\nDon't bother calling - they will say they're closed at 2:30am. They say that because it's super busy, to discourage it from getting even more crowded, creating a wait. But it's full, and people are on the move. We waited maybe 15 minutes before a group left and we were able to sit down.\n\nThe service is iffy.. we ordered a hookah when the 5 of us were squeezed around the end of a table. BEFORE the group next to us sat down. And yet they got all their hookahs, tea, etc well before ours was even brought out/set up. By that time (when we'd moved to a spot big enough to fit 5 of us) there wasn't properly enough time to finish our hookahs before they closed. And they never quite got it to smoke properly. Until right about 4am when they were strongly encouraging us to leave. Sigh.. still, a good time overall. Not enough late night spots in SF.\n\nFYI - we got the rose mint hookah + green tea - great combo!", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-29", "description": "The young guy that works there hates white guys. Was so disrespect. Asked to buy something from them and was told to return tomorrow. The guy talked badly about me as I walked away and when I returned to make purchase he said said to return the next day.", "author": "Jason M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-11", "description": "This place has decent hookah, but the service is the worst.  I've come here a few times now, but this past Saturday night there were 3 of us smoking hookah when 2 friends that were in the area stopped in to say hi. The staff immediately freaked out and said 4 or more people need to order a second hookah ($20+).  Like, they would not leave us alone for even a minute just to greet each other.  I explained that my friends were just stopping by, they would be leaving in a few minutes, we would order drinks or tea, and that they don't smoke anyway. To no avail.  Finally we all just got up, paid the check and left so we could hang out in peace.  I won't be back and neither will any of my friends.  It was honestly one of the most ridiculous interactions I've ever had in SF.  To make it worse the owner was sitting at another table and the staff kept pointing to him, egging me on to \"go talk to him myself,\" because if we stayed the owner would get really mad and the staff would get in trouble. WTF?!", "author": "Sara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-01", "description": "If I wanna talk about flavors all the hookah places in the city they have it but if I wanna talk about super friendly service with an awesome attitude the the only one is here Nile cafe ! I have been in the city for a long time and went to smoke hookah I so many places but since I met Mango the young guy who works at Nile I loved the place and I started to come here at lest once a week , he is super cool and friendly guy that I really enjoy talking to him !!", "author": "Ghazwan A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-25", "description": "A blight on the neighborhood. Noise until 4am regularly from their sidewalk tables screaming at each other for hours. Shut this place down.", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-24", "description": "Very bad hookah and bad service being cheap in the tobacco when we asked them to flex it thy said if you don't like it leave", "author": "Mohamed M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "Relaxed atmosphere, feels very authentic. Kind of a smaller space but lots of chairs. Had a grapefruit flavor and also the house tea (which paired very nicely). The staff was very nice and helpful.", "author": "Steph D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-06", "description": "Well, I only went here to kill some time before work, but I waited for service and that killed most of the time.\nThe hookah was mediocre, hardly hinting any flavor, and the pipe was crap with a really cheap plastic cable. And don't get me started with the service. The young man needs to smile, instead of being rude as fuck. And other older guy needs to work instead of stay in the back. Not coming back. Awful service and shit hookah.", "author": "Joselyn G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-12", "description": "Great tea and hot coco, decent selection of hookah.\n\nThe issue is the service.  The coals didn't get turned, it took forever for the hookah, tea, and coco to come out and we barely saw the staff.  It was good enough, though.  Good noise level and upbeat yet chill music.  I could spend time in this one but it was pretty small and didn't feel the cleanest. :) I have been to better but it was good enough for the experience.  I would probably return.", "author": "Lyndsey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-01", "description": "I have to say that Nile Cafe is probably the best spot in the city to get your hookah / shisha / nargileh on.  It's a cozy little place, but also quite happening on weekend nights and popular with both young middle easterners and others in the know.  \n\nThey use good quality tobacco (Starbuzz), are pretty good about coming around to refill coal, and employees/owners are always super nice.  Come for the hookah, but also don't miss out on the Arabic tea.  \n\nNile Cafe really does make for a fun, chilled out alternative to the bar scene in SF.", "author": "Joanne G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-03", "description": "My cousin and I came to San Fran for a trip and we are middle eastern so we can't go too long without some hookah. We yelped this place and stopped by. Honestly, not the nicest neighborhood, but the lounge was nice, our hookah was well made and they had a nice beverage menu. My only complaint is that there was only one person working the whole place so we had to ask several times for something until we actually got it.", "author": "Linet O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-18", "description": "Good tea. And may be good hookah, but I would never know. We were 10 people, and most of us just wanted to sit, drink tea and eat stuff, while some of us wanted to smoke Hookah. But the waiter tried to force atleast 1 hokaah per 3 people rule or leave. I would have been more than willing to pay a cover charge, but I am not accepting that rubbish rule.\nAnd when we told him that we prefer leaving after paying for the tea that we already got, the waiter's attitude definitely convinced me to not go there again.", "author": "Rohit J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-28", "description": "Small with outdoor seating. No alcohol. Went on a Tuesday night. Was disappointed by the service and by the hookah. They were out of mint so I tried the highly recommended (by server) gummy bear flavour. Tasted like rose, which I despise. When I told server that I didn't like it he still charged us for another one, despite having two puffs of it. I think they gave me wrong flavour or an old hose (although they advertise that they use disposable hoses). Ended up with double apple. It took forever for it to \"open up,\" because unlike most hookah spots, they don't get the flavour/smoke going for you. You have to sit there puffing for 10mins before you get a decent smoke, and even then then flavour is minimal at best. \n\nThe service was abysmal which is a part of my hookah experience, note the place wasn't very busy so there was no reason for such poor service. \n\nI wouldn't recommend this place unless desperate.", "author": "Adrianne D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "Good place to hangout and relax with a hookah. \nThe Obama flavor was light and smooth. Agave was a little rough for me, but I am non-smoker in general.", "author": "Malathi R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-19", "description": "Pros\n- They have Hookah and tea\n\nCons\n- Horrible service\n- Pricey\n- Sketchy neighborhood\n- The place is small\n\nOverall\n- There are much better places to go", "author": "Dipesh G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-07", "description": "I had a good time here only because I was with friends but I wouldn't go back if we're going to smoke hookah again. I know they're busy and the house is packed but the guy who's in charge could have treated us better. We ordered three hookahs and two of them were really light that we'd to ask the staffs to fix them.", "author": "Yanakon D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "My first visit hookah place in san francisco was nile cafe. They have very hard working waiter and very sweet. I love how they greet and serve the customers. I love coming here. I really love shamsu, shady, matt, bruno and paula as well ulzhan. Beautiful. I will give them 5", "author": "Nanita B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-15", "description": "This place has a good ambiance but service could be better.\n\nSuggestions:\n-samples to smell\n-tongs to move the coal around\n-smaller sizes, $20 is a lot for one person to spend on some shisha but makes sense for three people\n\nGood experience overall but it could be a lot better too.\n\n-", "author": "Ken F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-21", "description": "HORRIBLE HORRIBLE HORRIBLE. The absolute worst hookah lounge i've ever been to. \n\nFIRST, the hookahs are all different sizes. At first, we literally thought that this was a \"bring your own hookah\" kind of place, because there are literally no 2 of the same hookah- they are all different colors and sizes, the latter being the issue. \n\nSo we ask for a nice, tall hookah because at $25 a hookah, I expect more than a 6 inch hookah like many that we saw in there. You can literally BUY your own hookah of that size for $25!!! \nSo we ask for a decent hookah, and apparently you can only smoke the tiny ones inside BUT there's a group of 6 guys smoking a gigantic one inside right next to us (what the heck!!!!) and they still refuse to allow us to do this. \n\nFurthermore, we settle for a medium sized one, and order 2 teas and a Rose/Mint Hookah, then they come and tell us that they are out of Rose, so we ask for Jasmine instead. Then, they tell us they are out of Jasmine too, and that Rose and Jasmine are the same, that if we order Rose or Jasmine, it doesn't matter because they are going to serve us the exact same thing. SERIOUSLY? These people don't even know how to differentiate one flower from another. They are completely different! SOOOO rude and not customer-oriented. \n\nThe tipping point was the table, which my boyfriend ruined his $300 jacket on, because the table was covered in some sticky red stuff that stained his sleeve forever. \n\nWe could not take ANYMORE, and left without another word. \n\nOh, and if this review isn't enough to get you not to visit here, there are crazy psychotic people with killer dogs walking around outside. We literally saw a crazy girl walking her gigantic pitbull struggling to keep it from attacking one of the millions of sketchy people walking around outside. STAY AWAY from this place. Not only does this hookah lounge suck, but the neighborhood itself is enough to make one think twice about walking from the car, into the lounge.", "author": "Paola M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-31", "description": "Ghalib \"Mango\" has been our server every time we come to Nile Cafe and has made our hookah experience just outstanding. He's been on top of it even when it's crowded. The service at this cafe is always above and beyond our expectations. Thanks for making it great!", "author": "Berké B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-27", "description": "Nice intimate environment, cultural and good hookah.", "author": "Anna B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-26", "description": "It's 2AM and we're stranded in the Tenderloin with alcohol in our veins and nowhere to go. Like a mirage in the tranny filled concrete dessert, Nile Cafe was spotted in the distance. \n\nWe managed to get a table inside next to \"cool\" Arab teens and their Asian girlfriends pretending to be experts on all that is shisha. It was pretty hilarious. \n\nAll in all it was an OKAY experience. Nothing too special. The seating isn't particularly comfortable and there isn't much space. BUT when you're inebriated it doesn't really matter all that much. \n\nWe ended up paying $30 for one shisha/hookah and three chai teas for four people. We tried the mint guava, which was pretty good.\n\nThey DO NOT serve alcohol here so bring your own flask (BYOF).", "author": "Raha G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-21", "description": "It's a very simple place, the staff was nice.\nWe took a fruity& mint Hookah, which was tasty, and their tea (obviously).\n\nI would definitely go back, it's nice to chat with friends over a nice hookah.\n\nDon't expect something fancy though, it's a small terrace (3 small tables) and inside there is room for prob 20 people.", "author": "Alexei C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-02", "description": "Came to smoke hookah with a friend after getting shitty manicures. We tried the Obama flavor, which was described as a fruity/minty flavor. Got a nice nicotine high from it, but I felt as though the hose was clogged, so I didn't get any clean hits. \n\nNice experience but huge downside is they were out of ice and couldn't make any of their cold drinks, which is pretty odd for a cafe. Oh well, I'll probably give this place another chance next week and leave an updated review!!", "author": "Clarissa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-20", "description": "We got there 4 people at 2:30 am , the place was empty the owner want us to get 2 hookahs per 2 people , we told him that only 2 is smoking and we just want to have a good hookah time . He refuse and say that's the house rule , we all feel like it's a rip off and they only want to over charge you and not give a good service . When my girlfriend explain him that he was yell at her instead to welcome new customers . \nThere is better places to HO that respect their clientele \nDon't go there!!! \nBig rip off!!'", "author": "Ron H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-09", "description": "Nice comfort place.  Really friendly and smiley staff. The choice of music is really relaxing.", "author": "Boris S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-18", "description": "Absolute rubbish. Never come here. Worst service.\n\nthe guy tried ripping us off! after getting the receipt , we gave him the cash and receipt. He later on comes running after us saying that we didn't pay him enough and that we were trying to not pay the bill.", "author": "Abhi M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-26", "description": "Contrary to what the business might say, they do NOT accept credit cards. They will always use the line, with customers, \"our machine is broken...\" So that part on yelp, at the moment, is incorrect. \n\nThey were unattentive and we had to go up to the cashier and let then know we had to leave. \n\nNever moved our coals around until I blatantly mentioned, in front of the manager, that our shisha was harsh. He flicks the coal with his finger and that's about it. \n\nIt was my 2nd time here, because I always believe you should try things at least 2 times, but I think that will be my last time here.", "author": "Alexander M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-14", "description": "This is an update from my first review in 2009. This place took a NOSE DIVE since then. \nI consider myself a connoisseur of the mighty Shisha, and the last time I went to the Nile after being out of the country, I was so disappointed. Something happened to this place, it used to be such a gem.\nTo prove it wasn't just me, I'll list what changed:\n\n-No more lounging couches inside, just hard tables\n-No more wood coal in a brazier outside: now they use that coconut stuff that over-burns. That would be fine, if they gave you tongs to shuffle it around yourself, but they don't, so your shisha just burns black.\n-No more starbuzz. Not sure what it is now, but it's not starbuzz you're smoking,\n-No more prompt service to help, which sucks, since you don't have tongs.\n-Prices went up to match the competition (possibly exceed).\n\nBasically, this hookah is what you make at home, nothing impressive at all anymore. For some reason buttloads of Middle Eastern looking kids still like to come here in big groups. If you're with them, I guess this place is the sh*t. But I'm pretty sure their moms hang out at Pride...so I'm probably going to start going back there.\n\nI'm leaving one star for the super nice Russian (?) sounding waitress and yummy coffee blends and mint tea.\n\nOtherwise, skip it. I hate how hard it is to get a decent hookah in this city. F*cking hippies harshing my mellow.", "author": "Diana H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "Hookahs taste great, came all the way from Sacramento and was a little hesitant on coming here due to some previous bad reviews I'm really happy I overlooked that and came. Service is not bad, a little language barrier but if you take your time and explain what you want you'll do just fine. Hookah lasted 2 & 1/2 hours without loosing flavor or taste! Definitely would come back and recommend to anyone looking for a late night place to smoke some amazing hookah. Place is small but what isn't in the city. Perfect for 2 or 4 people. Don't let those few bad reviews discourage you. Check this place out!", "author": "Mo T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Mango provides 5 star service!!! He is the best and makes best hookah and house tea!!! Really good person to deal with!!!!! Ask for Mango!!!!!", "author": "Max Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-14", "description": "Went 2 times the first time the hookah was okay the second time it was not the best, but i will give it another shot", "author": "Ghenwa S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-19", "description": "Nice hole in the wall. Friendly staff. Fair service. A little overpriced. Only like 10 flavor options though and were out of half them. I'm more of a fruit flavors person but all they had was mints. Also very cheap hoses.", "author": "Ivan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-28", "description": "I have been away from home - (LA) for about 5 weeks and the Nile Hookah Cafe was my favorite place to be after a long day at work. I enjoyed each day I was there- the hookah was the best- specially the house special tea and Obama Hookah. lm3allem", "author": "ari A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-29", "description": "Took 20 minutes for service. Asked for guava and double apple. They gave us mint instead of guava, didn't even let us know they ran out. Tried to order some drinks, they said they weren't able to make anything. They only had the house tea, which they never gave us. The mint was pretty smooth, not very flavorful. I really liked the double apple, but it started to get very harsh after a few puffs. Terrible service, I won't be back.", "author": "Sandy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-21", "description": "This place has a homey feel from when you walk in. With dim lights and comfy seating a comfortable and inviting atmosphere is created. We seated ourselves and we were attended to within minutes of seating. We ordered a guava flavored shisha for our hookah that was flavorful and sweet. It had a pronounced guava taste that was quite surprising and he came to change our coal roughly after 45 min. Since I was with my friend, I was hoping we'd be given a 2 hose hookah, but we were just given a one hose with 2 mouth tips. We have no issue sharing a hose, but I feel for others it may be inconvenient to change mouth tips every time the hose is passed. Overall, I'm very satisfied with the place and will likely come again. \nWe were charged $20 so we split $10 each which was very reasonable since we were there for almost 2 hours.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-05", "description": "I'd only go back to this place if Michael Jackson came back from the dead, told me that I'm just ignorant and this place serves hookah in a 18kgold bong that you get to keep afterwards.\n\nNobody acknowledged us when we entered the lounge so we just stood there like idiots wondering if we could sit outside since it was a nice night. We got tired of standing around so we sat down at an empty table while one of the guys went to confirm with the waiter that it was okay for us to sit there. CONFIRMED.\n\nIf you enjoy waiting around for 45mins to place (yes, you read correctly), just to even PLACE your order, this is the place for you.\n\nOur waiter didn't even know what flavors they even offered -- We asked for the strawberry watermelon mix and he told us that they didn't have strawberry. Then as he's reading back our order he asks us if we want the strawberry flavor. Thought you said you didn't have that flavor, buddy.  Wait, you do have it? You don't have watermelon. Actually, no scratch that, you don't have strawberry. \n\nWe went with the rose. He comes back 30 mins later and tells us they don't have the rose either.  It takes 30 mins for you to figure out that you don't have rose? Didn't come back with the tea and 3 bottles of water we ordered either. \n\nWe ended up waiting around for an hour and 45 mins before we decided to leave. Why didn't we get up at the 30 min mark? We were curious to see just how awful this place could be. And man, it is really just the most awful place I've ever been to. \n\nThe employees seemed more interested in saying hello to their friends and seating those they know. Is this a business or is this some kind of friends and family gathering establishment? I guess it's more important to fist pound and one arm hug your homies who get served with 2 hookahs before us even though we sat down a good 20 mins before them.\n\nI don't understand how this place has 4 stars.  Are SF's hookah standards just really low? If so, I need to go back to the east coast and take SFers with me.", "author": "Cindy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-07", "description": "The first time I came here was great. Each time I come here afterwards has become worst. The place gets busy for such a small place. \n\nThey get the hookahs to the people very quickly, but are slow in filling it with charcoal. Another thing slow about them is the drinks, ordered our drinks and they came half an hour later. Did I mention they were the wrong ones too. \n\nThey did a little remodeling recently; putting in a bench where a few chairs were before. Part of that remodel was replacing the door on the restroom, they just forgot to put a lock there. So there are no locks for the restroom.\n\nAnd the guys who work here often just stand outside and socialize with their friends. Friends who often just have their car double parked in front of the place because parking is so hard.", "author": "M C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-21", "description": "Love this spot especially the sweet lady working behind the counter but the saudi arabian guy is an ass very disrespectful and a smart mouth you need to fire him", "author": "Eman Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-09", "description": "The mya hookah is really cool and small. It blows clouds like crazy!!", "author": "Nolim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "Nice place to smoke shisha and the turkish coffee was great and employee was nice yok but the place is a little small.", "author": "İsmail Cem E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-09", "description": "New ownership? Things are suddenly different and not for the better at Nile Cafe. I'm very surprised their yelp rating is as high as it is and honestly question if some of the positive reviews were written by employees of the establishment. The service was poor and their bouncer was rude. On top of that, their selection of flavors were extremely limited and the flavors they did have were mediocre, at best. There are so many other hookah bars in SF that I would recommend over this establishment. The Nile Cafe I once knew is dead.", "author": "Robert B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-09", "description": "Terrible place!!! The lounge itself was cramped and poorly lit, the hookahs were in questionable condition, and the hookah flavoring was marginal - which I think the owner recommended. This would all be forgivable if it was somewhat cheap or if there was good service but I think you'll find those elements lacking as well ($20 a hookah?? GET REAL). Do yourself a favor and patronize one of SF's many other lounges, you'll be happy you did.", "author": "James M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-23", "description": "Awesome place to just chill out and pass the time on a Friday night. The place is really tight though in the literal sense especially if you're seated on the side since the tables are cramped together. It's $20 for the hookah and it comes with 3 coals which lasted me and my friend a good 3 hours. About 20 flavors to choose from (we chose the Obama), and the smoke is smooth even till the end. If you come here, just make sure to come here with a friend since there has to be at least two to three customers per hookah set and they also provide hose pieces for each guest for sanitary purposes. Great service and atmosphere as well. Will definitely visit again next time i'm back in town.", "author": "Arvin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "I've been to Nile Cafe almost consistently in the weekdays for a little over two months now. The spatial wise is honestly quite confined and I would not recommend large group gatherings in such a place; ideally 2-4 people. I've only ever really popped in before sundown and Mango (the person who usually manages the place when I am there) has been of excellent service thus far. He familiarizes himself with his customers very quickly and delivers what his regulars want almost promptly shortly after arrival. The place works very well for me, i often travel with my work so the coffee table setting was a bonus when I discovered the place. There's a limited palette for hookah, or shisha, flavors and the taste usually runs after about an hour, so I wouldn't fret about getting more charcoals unless you favour some sort of a burnt flavour; it's also a good sign to let your lungs breathe some fresh air.", "author": "Mabel T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-23", "description": "This placed sucked I love hookah and I came here and got 2 hookah cut the limit is 3 a hooka and we had 4 I had no Idea this place was low tech the space small 20 bucks a hookah come on this guy recommend a flavor so I took it said no one complains it's great yeah they do but you don't do anything the flavor was horrible I told him it sucks everyone here hates it but no he said you probably don't know it's hookah or something  um not my first time they use napkins as gaskets to hold the hoses in wow come on you need use something better horrible Un satisfying", "author": "Jonathan R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-12", "description": "The waiter told us to get the fuck out because we wanted to cancel the tea which took over a half hour to make. So rude. He should get fired", "author": "Reem A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-26", "description": "After much disappointment of the area, atmosphere and selection of tobacco. I receive my hot tea and the server spills it on my leg. No apology and no means of rectifying the situation I had a mediocre hookah and which in la wouldn't cut in for a minute. Ewwwww", "author": "anna j."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-24", "description": "Really? charge for charcoal? First place in the world that I've seen that. And no Visa, and their debit machine doesn't work, so if you only have $19 in cash, they'll threaten to call the police. Slow service as well.\n\nWorst I've seen.", "author": "K A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-06", "description": "This place was a lot of fun!  I don't usually do much in the way of tobacco, but I was convinced to come hookah after a few drinks earlier in the night.  Inside was too full to fit our group (they seem to be pretty packed most of the weekend nights) but there were a few tables outside for us to sit at that were a bit cold, but otherwise fine.  \n\nService wasn't as good outside as I could've hoped, but the servers came by whenever we asked for refills of coals, tea, and even gave us a hookah at half off because we'd made a mistake and ordered the wrong flavor.\n\nOverall a pretty fun place to come chill and hookah with a few friends.", "author": "Keith C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-29", "description": "I wouldn't suggest that you go here. The people working seemed to be more confused than a fish in the forest. The pipe was pretty bad and the coals were a low grade coconut shell coal. The place is tiny and the seating is ridiculous. There are small hookahs that are at a large bar area in the middle but they clearly don't change the water and admitted this to us when we asked. We would be ignored for far to long and would have to travel inside to remind them that we need new coals multiple times before actually getting any. All in all if you are in the area I suggest you just stay away from this place.", "author": "Matthew W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-28", "description": "Went here for hookah with a bunch of people from work. Great place to chill and sit outside. We had the rose hookah which had a great flavor to it. \n\nTheir card machine doesnt work so make sure you carry cash. \n\nIf you sit outside , be prepared to be greeted by the homeless guy walking by. We had the same guy come and ask us for money 5 times in an hour. \n\nHookah is reasonably priced and would surely recommend this place.", "author": "Priyanka P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-09", "description": "I so hate that place! it's so expensive, owner is so rude and the most important thing is they fool you with tobacco stones that has flavors and they only put a lil bit of a real flavor ! Also, i don't recommend anyone to get hot drinks from there. It's so unclean.", "author": "Bela M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-18", "description": "The venue is super small and narrow. We were told that they only had about 5 flavors out of their 10-15 they advertise on their menu. We had to ask 4 times for our water and they had to fix our hookah twice to get the smoke going. Overall, the service is really bad, the hookah apparatus seems cheap and wasn't the best atmosphere.", "author": "Sarai Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-18", "description": "This place is ok for what it is; it's one of the only hookah places in the neighborhood let alone a place that actually serves its own tea, it's a small place, and there's barely any parking around. The reason why I gave this place 3/5 stars is mainly because I almost felt discriminated against by one of the servers of this hookah lounge. \n\nMy friends and I asked this one particular server over and over again for water and new coals but after every time we asked, he either 1) went back to the kitchen and would never come back 2) when he did come out with coals he only went to the people outside and people sitting on the pillow area who didn't even wave him down beforehand or 3) or walk by and completely ignore us. \n\nI know for a fact that my friends and I were not being rude either; we always said please and thank you and never told him to hurry up or anything. I actually timed him in one instance to see how long it would take him to come back with coals (from the point we asked and the point to where we actually got coals) 24 minutes and 17 seconds. How does it take that long to fire a thing of coals and put them in that little silver pan? The place isn't that big either; it has 3 booths, a few small tables on the side, one large pillow area, and one table outside.\n\nI don't know, bottom line is that he gave very poor customer service.\nThe House Tea is as good as everyone says, but I'd rather have good hookah and better service than good tea, sorry.", "author": "Greg H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-01", "description": "Horrible place. The service was so slow. The workers were rude and all extremely drunk. I asked the same guy like four times to bring us new coals and he kept forgetting. We finally asked another employee ( he had coals and was distributing them to others) so he finally stopped and gave us some. The hookah wasn't that great and it was pretty Damn pricy ( 23$) per hookah when I usually go to places who have it at ~$10. Place is incredibly small and you barely have any room to enjoy your hookah . Will not be coming again.", "author": "Giselle V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-25", "description": "Place is worth to visit if you're too lazy to find 724 :) anyway, shisha was great and the guy who made it was helpful and friendly. \nThis bar is too small to relax.", "author": "Nikolay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-05", "description": "Good spot in the Tenderloin after a good meal next door at Shalimar. Comfy pillows in the front window seat if you can snag it. The bathroom door does not lock, so it's a precarious wait. They're pretty good at replenishing your coals and taking your order. Good friends=good times", "author": "Naomi K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-04", "description": "$20 for a hookah is a tad steep... but the flavor was choose was good.\n\nTheo, Chuck and I split a their Nile flavor, which was a mix of a ton of awesome. It was floral, minty, fresh, clean, almost like smoking a plethora of sweet alcoholic drinks and perfumes, which sounds kind of weird, but thats the only way I can explain the randomness from the tobacco pack. It was seriously really good and smooth.\n\nAlso, they do pack the tobacco in densely, and the coals are ultra slow burners and hold shape, instead of ash out easy and crumble into the pot. This prevents you from getting a really harsh burn.\n\nBut at 20, I think its a bit more than I'd pay for. Then again, I have friends who have hookahs, so maybe thats why the price turns me off just a bit.", "author": "Marc T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-05", "description": "Nice place to piece together the night. The tea is so relaxing accompanied by friendly service.", "author": "Eve C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-07", "description": "Alright, so I guess these guys added a new edition to their lounge and they now have an outdoor patio section right in front with a few tables and a bunch of chairs. It's pretty awesome, if you are properly dressed for a San Francisco winter night. I.E. it gets really really cold, but it's nice to have fresh air (as fresh as you can get in the city) and not be crammed into their little lounge inside. Anyways, I'll make my review easy.\n\n1. Unless you get there early, expect a full/packed little cafe that can/will be noisy.\n\n2. If there on said packed night, EXPECT A WAIT! They are understaffed, over-populated, and have a huge demand! \n\n3. They guys working there however are nice, and doing their best.\n\n4. Really nice selection and variety of Hookah for a reasonable price.\n\n5. Excellent house tea! Order it! \n\n6. Excellent Armenian coffee! Get some! \n\n7. Sitting outside = the best people watching entertainment ever & maybe some new friends!  (or annoying drunktards who talk too loud and you hope to leave soon)\n\n\nlast thing... and the reason you do not get 5 stars\n\n8. The bathroom. This is the most disgusting bathroom. For fucks sake, can't you guys get a freaking toilet seat THAT ACTUALLY STAYS ATTACHED and maybe DO A LITTLE UPKEEP THROUGHOUT THE NIGHT!!!!?????!!!!!!!!! \n-If you expect to pee at all through your hookah experience, maybe just don't.", "author": "Bee S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-04", "description": "the worst customer service i ever seen. i always come sunday but last time i come with my friends on Tuesday     27,may 2014 the guy who was working there is really stu****d it took him 15 minute to give me the hookha .... \nwith really light Measel....\nhe didnt want to add charcoal  i dont now why? \nits really interesting  I  asked him like 6 times but he didnt add the charcoal \n    and he charged me $25 for hookha only not new hose. \ni have to stap back fom this st***d guy who work on tuesday", "author": "Davied M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-10", "description": "Best hooka ever! Ignor thoes who tarnish the place. You have to go and discover the differnt flovers of hookas this place has to offer. I would recommend obama and nile mix.", "author": "ahmed a."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-29", "description": "Nice place and atmosphere, but the service was a lackluster.\n\nThe way they price seemed ridiculous to me, but i may just be used to LA prices.\n\nI'm sure the tea would have been better if we didn't get it just above luke-warm, and the hookah coal was never offered to be changed.  \n\nThe bathrooms were in need of cleaning when we were there.\n\nI'd pass on this one.", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-07", "description": "Really slow service. took 30 minutes to get the water we ordered because the waiter forgot, same with out bill. hookah was decent, wait was unacceptable.", "author": "Dan H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-01", "description": "This is a first for me! I am actually sitting in the place and that is how mad I am, writing this right away! \" the owner is not here!\" This is a sentence that was mentioned to us by all the employees here whenever we ask for something! The hookah we got was burnt the moment it came, we asked to change it but they are like we will charge you for a new head coz the owner is not here!! Ok!! So he asked you to treat costumers like this!! I am not coming back to this place again!! It used to be really good! Not anymore, better not come!! I wish i can give less than one review!", "author": "Dalia Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-20", "description": "House tea. It'll leave you feening. Don't miss it.", "author": "Mansi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "They make really good hookah. And their house tea is amazing. The place is small and gets packed easily but the environment is nice. I like the arabic music being played in the background. \n\nIt will be great if they start accepting credit cards. It is cash only", "author": "Hani A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-28", "description": "I came to this cafe last night . Their serves was too bad . If you like to have good time with your friends do not come here. There is no option to give them 0 star .", "author": "Mohammed R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-17", "description": "My boyfriend and I were looking for a hookah place in SF and this was the nearest place. It was too crowded to sit inside so we decided to sit outside. It was super cold (no heat lamps) but the hookah was decent. It's also in a bad area so be aware of your surroundings and belongings!", "author": "Kat P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-08", "description": "This place has so much potential, but the staff manage to mess it up by being lazy. \nThey use 'natural' coconut coals and have a decent selection of hookah flavors. The atmosphere is also pretty laid back.\n\nThe problem:\n\nCustomer service. They don't have any. I've been in a few times, and each time, I've had to wait for far too long for my hookah. Even when it is not busy. The last time we waited for almost almost an hour, before we finally decided to cut our losses and just left. As we finally left, the owner had the audacity to ask why were leaving after having ordered.\n\nThe hookah: Its hit or miss. Sometimes its very good, sometimes its very bad (depending on who makes it). The problem is, when they get it wrong (i.e. pack the tobacco incorrectly, too much/little water), they will go to any lengths not to change it. \n\nA real shame, as they have a lot of potential.", "author": "Fooda H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-03", "description": "Good service. The hookah flavors are really good. The neighborhood can be a bit intimidating to some because of the homeless people, but they're harmless. I sat outside a few times with people asking my company and I for money, but the waiters inside will literally stand in front of you and ask the person to go about. The last time I visited they let my friends and I try some of the and it was amazing.", "author": "Rochelle R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-26", "description": "I've been here twice and they are always out of something! Kind of ridiculous. Otherwise, their prices for a hookah is pretty good. It's only $20, but that's only for up to 3 people. This place is pretty small and has just one bathroom with no lock.", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-27", "description": "This is one of the few hooka places left around SF. They have a good hooka flavor selection and they refill the coals several times. The tea is the best! Don't let the neighborhood fool you. There may be some homeless people outside asking you for money, but they are harmless. It also seems like they remodeled the place, so they don't have the pillows on the floor anymore. Did I mention the tea is delicious?!", "author": "Nadia M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-12", "description": "$20 per hookah, three people per hookah. If you have four they make you drop another $20 on another hookah. THAT BECOMES $10+ PER PERSON.\n\nI just wanted to make that clear because this place is a rip-off. I came here three times and have vowed never to go back. It is only enjoyable if you come during one of their slow times, otherwise it is cramped and loud. As many other reviews have said, awful service.\n\nOnly positive things I can say: Arabic tea is to die for. I've yet to find/make another as addicting as their recipe. The place has an authentic and unique Arabic vibe.", "author": "Mary M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-15", "description": "Very unprofessional and unaccommodating. Will not even serve you any tea if you don't plan on smoking hookah. I've been coming here for over 3 years and for the first time today, I decided to not have hookah and just ask for the adini tea. They refused and asked me to leave. How rude. Very disappointed.", "author": "James H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-22", "description": "This little hole-in-the-wall is easy to miss. We dipped in here for a hookah after a lovely dinner date and had a great time. It's a really unassuming place. The furniture is threadbare, and the decor isn't really inspired - it's kind of thrown together - but I liked that. It didn't seem pretentious at all. There were two other tables there during our visit and everyone seemed relaxed and comfortable.\n\nFor $20, we had an hour-long, flavourful cardamom hookah. The clerk topped us up with fresh coals regularly. He wasn't very talkative at all and didn't attend to us except with coals, but I didn't mind - I wasn't there to hang out with him. We also had a pot of sweet Arabic tea which complemented our hookah perfectly.\n\nWe'll certainly go back, if only because it's a cheap and delightful way to spend time with friends. Something about hookah inspires deep, honest conversation.", "author": "Malloreigh M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-09", "description": "We had a 45 minute wait...he called us, as we were waiting two blocks away at the Hilton (killing time and stayin' out of the cold).  We ran and got a table...woohoo!!\n\nTea = totally yummy.  I love the house tea.  I had three individual pots of it...heh...\n\nHookah = awesome.  Lots of flavors.  We loved the Nile Mix #2...guava and blueberries...omnomnom.  \n\nService = okay.  Friendly but they're busy.\n\nDecor = cozy. Lots of arab music and music videos, w00t!\nSize of place = super tiny.  Bathroom = total traffic jam area.  lol \n\nPrices = decent. One flavor, one hookah, up to 3 people and 3 coals = $15-20/total.  So....we had two hookahs, some tea, and it was $42.00.  Not too shabby for six people.\n\nPictures of 'purple' smoke (via camera phone) = priceless.\n\nBut yeah...get over here, if you have the time to wait.  Although...my only dislike for this place, is actually to do with some of the clientele...drunk mofos and assfaces.  Rude to the staff. :-(\n\nThis ain't exactly a very 'cool' area, so...you've been warned. :)", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-27", "description": "THE. TEA. \n\nThat's all I have to say. It's amazing. The location is majorly sketchy; the location of Shalimar and Dottie's makes it a pretty active street. \n\nI'm not a hookah expert but I can appreciate a place that has reasonable prices, a causal atmosphere, AMAZING TEA and lets your sit back and enjoy the evening clouded in smoke. \n\nSadly a group of friends went again last night and I couldn't attend BUT I will be back to enjoy with another set of friends.", "author": "Jade W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-11", "description": "We were not quite sure why everyone was ragging on this place. So we went to check it out.  Except for the price, it is a top shelf bar.  We took out bar-tender,  Teddy's advice and tried the Nile Blend which was very pleasant.  We have tried other bar's and this one rates right up there.  Good music, comfortable surroundings and great service.  \nBring some friends with you because the neighborhood is super sketchy.", "author": "Keith D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-11", "description": "This place is super awesome. Late night, midweek it is less crowded and the staff are able to serve better (and be social). The guys who work here are awesome and the hookah flavours - of the few that I have tried - have been great. \n\nThe best combo is sitting outside on a warmer night by the heater, hookah in hand and sipping on some masala tea with a handful of evening conversation.", "author": "Dilip R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "Really nice atmosphere and great cold beer,  no hookah anymore though,  SF cracked down on a lot of hookah places and this one didn't make it through. If looking for a nice bar with good beer though,  I definitely recommend it.", "author": "Wilbert S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-25", "description": "I.  LOVE.  NILE.  CAFE.  I've been here so many times with friends and it's quite possibly my favorite spot in the San Francisco.\n\nThe place is small, but it's cozy...and if you like the people you come here with, then you probably won't mind sitting next to them.  \n\nStill can't figure out what's in the tea... My educated guess is cardamum, white sugar, honey and traces of crack (because WTF it's so addictive).\n\n*Secret Menu Item* - ask for the \"Obama\" Mix... it won't jumpstart the economy, but it will definitely give you a good buzz .\n\nThe owner also is very friendly and you can tell he's a good business man.  He always says hello to the regulars and makes sure we're all at home.\n\nMy only complaint about Nile Cafe - not enough staff.  There is usually one guy working there and poor thing, he is SO overworked!  Despite that, he is always very polite and never gets frustrated.\n\nOh, I guess my other complaint is that the music is too loud sometimes...\n\nOk, that's all.  I'm not removing any stars for my complaints - this place is totally worth it for the hookah and tea :).\n\nOH, I have one suggestion - they should have a \"Frequent Hookah-ers\" card or something...for as much as I go, it would be nice to get a free session every 15th or 20th time :).\n\nOKBYE!", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-25", "description": "It was an actually cute little spot, its just ... the feng shui of it (so I think) is a little off. The tables are by the wall, there's one huge one in the middle and its a tiny little place. The service was great and tea was absolutely wonderful! It's just ... I had anxiety just even walking in, I'm used to being around tight big crowds... but having the tables spread out they way they were and having to be seated next to a wall... with no other space to move, was difficult. On another note, I didn't like that they played Hip Hop because all the ratchets came out and got crazy. If they just had made some adjustments, this place would be better 8) Just my two cents!", "author": "Marevie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-30", "description": "Well, the place is tinyyy. The only really cool thing about it is a corner with pillows for everyone to sit in.\n\nThere was 4 of us, and the guy made us get 2 hookahs (1 hookah/3people and he couldnt make an exception for us..)\n\nAnd, it wouldn't have hurt him to crack a smile here and there, considering we were probably his better customers of the night.\n\n2 stars for our great chai tea lattes.", "author": "Irina Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-19", "description": "After having an awkward experience at Shalimar, my friends and I stopped in here to smoke a little. It was a Monday night, so it wasn't the most bumping place, but there was a big group on the floor, smoking while using the wifi and a few other people looking busy. We sat down in super comfortable chairs, and tried the lemon mint, as well as a bit of tea.\n\nThe lemon mint was really refreshing. I'm usually not a fan of fruit flavors, but the combination was a perfect balance of the two flavors, and it left a very clean feeling in my mouth. They also had individual mouthpieces for each person, which impressed me, but I haven't smoked at a shisha bar in the United States, so I don't know if that's just par for the course. \n\nThe TV was tuned to Melody Arabia which provided quite a bit of entertainment for me and my friends, and led to a discussion on what kind of women middle-eastern men find attractive. (By watching Melody Arabia, one would believe that all women in the middle east are incredibly skinny and act like 12 year-olds, but I suppose someone can make that same commentary on MTV). \n\nThe ambiance was great, and they had an extensive selection of flavors. While I'm not itching to try their guava lemon mint combination (I detest guavas), there were several others that I would definitely come back to try. Four stars.", "author": "Angeline P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-29", "description": "Nile's Cafe is the place to be for excellent quality hookah, tea, friendly service, and most of all a relaxing and enjoyable time with good social company. I've become a regular every other weekend, as I have scoped other outlets of Hookah in the city but none exceeded the same quality standards as Niles. As I became more acquainted to the place, I befriended the owner. An upbeat awesome guy who truly caters to his customers' needs and taste. The best seat is by the front window on carpet floors and soft satin pillows. Whenever, I'm feeling down or stressed from work or school, Niles is my go to for instant and lasting relief through out the day. It doesn't matter whether I'm going with a single friend or a group, everytime has always been a pleasant experience at Niles with it's contemporary/chill music on or the happy go lucky waiters standing by. Niles lives up to its 5 star quota!\n\n**2009 edit: \" I tasted Obama ;) \"", "author": "Fat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-23", "description": "The tea at Nile Cafe is truly extraordinary. It's not super cheap, but with 3 friends, we shared pot after pot of this magical concoction. It's sweet and delicious... really the best tea I have EVER had! \n\nThe hookah is also very good and everyone at the cafe (visitors and staff) are very friendly. They were quick to re-load our coals when they started to burn down... many awesome flavor options too from coconut to other fruits to just about anything you can imagine... \n\nThe hookah bar is medium-sized, cozy, and very comfortable. At one of the tables, you get to sit on the floor but most are more regular tables. \n\nNile Cafe is a great spot to relax over many pots of tea and maybe some hookah too!", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-07", "description": "Time stands still.\n\nIn this tiny little place, you feel like you've been transported to an Arabian cafe and that you're miles and miles away from America.  The hookah lasted us ages (over an hr and a half) - had the double apple which was good.\n\nThe dont serve alcohol so we tried the house tea which is highly recommended.\n\nI highly recommend this place if you're looking for a nice chill spot to smoke some hookah and have a conversation.  Watch out, you'll look at your watch and realize its far later than you thought it was.... you've been warned! :)\n\nEnjoy it!  I know I'll be back.", "author": "Julie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "The Nile Cafe & Hookah Lounge is the place to be if you are in the mood for some hookah, tea, or chai tea latte. They have great flavors; my favorite is the Mint. \n\nThe ambiance is also  great due to the decor and the music they play.", "author": "Shayan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-26", "description": "I was there siting outside having hookah. Very pleasant the Staff works very hard. Good tea and the hookah was ok. I was very annoyed that the owner was sitting in his car out in front of the place double parked the entire time I was there. That  was the big turn off", "author": "Eugene K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-14", "description": "One of the first hookah lounge that my friend introduced me to when we went on our date. I didn't really like the song choices, because I didn't understand what they were saying but that didn't bother me. Service isn't the best here either, I would say sometimes it would take a lot to get their attention. I tried their house tea and I would say with the hookah and house tea together that really helps hit it off. This place is relaxing and chill, and is a good place to do hookah and just talk about life or whatever. My favorite flavor here was the guava, and this place isn't too spacious therefore I would recommend checking out other hookah places if your going in a big group. Overall, the price was not too appealing to me, but  if your just with a few friends and its convenient then feel free to check this place out because they're alright just not the best.", "author": "Katherine N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-03", "description": "Hookah lounges are great for groups. For this small and tight space doesn't do good for me and my friends. However, the flavors were awesome. I recommend the mint and watermelon :)", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-16", "description": "This place can get crowded but if you're looking for hookah and tea in the middle of the night and don't mind TL then it's a great place.  The people working there are so friendly given how busy it gets.  \n\nIt's a small place so there's a lot of bumping around but it's nice, cozy, and the hookah is stronger than other places I've been to in the city.\n\nDid I mention the tea?  It's so awesome!  When I get old and need an IV put in me for fluids I want that tea running through my veins.", "author": "Vicky C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-13", "description": "by far the worst hookah experience I've had to date. To say the service was awful is an understatement. We had to wait a full hour to get coals - and this was after we waited 20 minutes to be seated and another half hour for an unlit hookah. I'm not from SF, but I'm sure there are wayyy better hookah places to spend your money.", "author": "Naureen H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-21", "description": "HORRIBLE CUSTOMER SERVICE! Absolutely horrible. I have never experienced a server having that much disrespect for their customers. Everything from yelling at us to threatening to kick us out to mean mugging. I just wouldn't recommend such terrible service for anyone. Id rather NOT smoke hookah than have to come here. JUST DON'T DO IT.", "author": "Jyoti K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-09", "description": "My favorite hookah spot in SF. Wide selection of shisha including some hits like Apple-Cinnamon and Lemon-Mint. Nile offers nice sidewalk seating with a ringside seat to the daily tenderloin churn. Unfortunately they're not open on weekday afternoons, but they make a great evening destination.\n\nTheir clientelle, location, and tobacco selection beat Marakesh, Kan-Zaman, and Pride of the Med. hands down, no question.\n\nOne star deducted for not having Lebanese Cedar shisha and for pawning off a weak-drawing pipe on me.\n\n[ To the reviewer below who made the racism accusation: I don't believe you. ]", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-19", "description": "Love, love, love, I am definitely impressed! My friends and I came here last weekend after a terrible hour and a half of waiting in line for a club with no success. Having paid the ridiculous fare for parking (as is customary for San Francisco), we were pretty bummed that we didn't get in. Lucky for us, we had a backup plan! We walked the two blocks down to Nile Cafe, and we almost missed it because it just looked like a tiny little coffee shop. It's definitely a small space, but the atmosphere is relaxed and comfortable. They have music videos that play on the TV in the corner, but it's not so loud that you find yourself shouting over it to talk. We were seated in the corner on a floor mat with plush pillows and we weren't allowed to wear our shoes on it. We were so grateful to finally take our heels off and relax, because standing in line is the least fun way to spend a Saturday night.\n\nWe ordered the Nile Mix, which they wouldn't tell us what it was comprised of. This was fine - I'm all for a little mystery! The flavor was smooth and delicious and oh-so-easy to smoke. The service was good, although nothing to rave about. They came by and replaced our coals often enough, and brought out our drinks in a timely manner.\n\nIf I'm ever back in San Francisco and find myself not wanting to stand in line again, this is definitely going to be my backup place!", "author": "April B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "This is not a nice block.  But the way this manager here keeps his customers safe.  It is a great oasis and hangout.", "author": "pilou o."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-06", "description": "My first Hookah experience.  It was a great time...very relaxing.  This place is small and the seating wasn't the most comfortable.  However the service was great and the Hookah was enjoyable.  The highlight however was the house tea.  That was amazing.\n\nLast tip...don't do Hookah before a long run the next day.  My lungs were screaming \"you are a dumb-ass\" the next day.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-19", "description": "It may be small, but it is one of my favorite places to smoke hookah and snag delicious tea. I love that this place doesn't cater to teeny bopper 18 year-olds, playing top forty and whatever lame hip-hop is in at the moment. The music they play helps set the mood. I wouldn't mind even more traditional music, though. I also love the floor seating by the window. Whenever I have a larger party or the place is a little more empty, they'll let us sit there. It's the perfect excuse for taking off your shoes :)\n\nThe only thing I don't really like is the 3 person limit on a hookah. I wish they would bump it up to four, because 2 hookahs for for people is sometimes too much for me =/", "author": "Magda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-28", "description": "I haven't been to a lot of hookah bars in the bay area, but I had a great time here. The service was certainly a little slow and inattentive, but overall a really enjoyable evening. The server recommended the house tea which was a sweet hot tea and it was magnificent. The Citrus Mint hookah was perfect and delicious.", "author": "Benjamin K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-16", "description": "The hookah was good, but the tables were a little flimsy. They shake almost every time you go to hit the hookah (at least ours was).  The service was a bit slow. I really enjoyed the music. It's a nice place to just eat and hookah with some friends. I would go back there again.", "author": "Haley W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-24", "description": "Nice place where you can get best tea. Awesome Flavor! It has good flavors for hookah too !!!", "author": "Review G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-06", "description": "This place is definitely awesome. The people there are really friendly, and you can usually chat it up with anyone. They have a wide variety of shisha to choose from. The house tea is amazing! I love the variety of music that plays. It gets really crrrrrazy late at night- in a good way! Definitely worth a visit.\n\nEDIT: I knocked off a star because of the management. I'm not going to say any more...", "author": "Aryn B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-02", "description": "This is a very small, hole-in-the-wall place.  We had a group of 7-8 that kept whittling down until 4 am (it's open THAT late on Friday/Saturdays).  We sat in a booth on the floor with lots of colorful & comfy cushions.  There's great Arabic/Turkish music playing, and music videos.    \n\nThe hookah was really good, we got two flavors and they were both strong (one fruity, one floral).  The coals were refilled regularly.\n\nGreat place to hang out late at night with your close friends.  Personally, I like Morac in the Mission better (it's significantly more upscale, but correspondingly expensive - more of a date place).", "author": "Bee M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-29", "description": "After having some great indian food across the street. My BFF and i decided to go hookah since it was a Monday night we were the only ones in the Lounge.\n It was awesome, we got the mango flavor. Let me tell you it was every penny worth it, it lasted it us like an hour and a half! The taste was looong lasting. It was a shame we didn't pick one of the EXOTIC FLAVORS but i will for sure be back for the sex in the beach.\n\nI would give this place 5 star but the asian guy that works there wasn't too friendly or helpful and they kept looking at us weird( but again we were the only ones there). Also they don't serve alcoholic drinks.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-28", "description": "Bullshit place .. I came here at 2:30am on Friday and they told me they don't serve hookah after 2am but on yelp it said they r open until 4am ...  I asked the manger and he said they only serve hookah until 2am but the people who are already smoking have until 4am to leave and then I saw the anger give his friends hookah.. .. It's shitty place and no place to sit.. I would never recommend it.", "author": "Akash S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-14", "description": "This place is amazing, hands down. Sure, it's cramped, but the service is great. The people working here are hella friendly, and their tea is to DIE for! Every time I come here, whether it be with one friend or more, I always make sure to order a large pot of tea firsthand.\n\nSome of my favorite flavors are:\nDouble Apple\nPineapple Crush\nIrish Cream (tastes kinda' like chocolate, but in a not-so-awkward way)\nPomegranate and White Grape\n\nNot only do they have great hookah and tea, but they have interesting music, and their music videos are extremely interesting to watch, if you like Indian music.\n\nI seriously wish I could rate this place even more stars, that's how much I love this place!!!", "author": "Isaac D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-10", "description": "I like this place in general. Service is a little slow. Note that they no longer takes cards and the cost of hookah is now $20. That price has gone up a LOT.", "author": "M-C R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-04", "description": "Cute little spot!! IF you're claustrophobic, DO NOT go here though. It's very small and always PACKED. You'll probably  be rubbing thighs with your neighbor so get to know them or find another place to go. They have a little area towards the front you may enjoy if you have a bigger group. They also have outdoor seating with heat lamps if you're ok with the occasional bum asking you for money. Nile cafe has a great variety of flavors and the service is very friendly. Along with our hookah the boyfriend and I tried their arabic tea which was super strong, or maybe it was just super sweet. Either way small tea pot and the tea cups were enough. That's all that would be needed to keep you up or on a sugar high for days. \n\nIf you're in the area looking for a night of fun with no alcohol~ I'd recommend this place. It's a great time.", "author": "Rie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-12", "description": "I feel bad, my friend and I came here to burn off some steam and obviously I found this cute little place on our beloved yelp.  We thought, hey this is going to be pretty chill, I guess.\n...Yeah.. it was chill...sooo chilly, they left the door open and it's fucking like... 25 degrees outside with wind, gosh!\n\nWell we got pineapple crush (tasty, yes) but they gave us a hookah that just totally fell apart quickly, and when we inhale, air leaks out from the pipe connection thing, so we have to hold on to the fuckin thing like you're holding a _____  ...\n*SIDENOTE* NOT FROM EXPERIENCE\n\nso yeah.. We only came here for literally like 10 minutes and were a bit disappointed, not many people were there and the atmosphere doesn't make you feel all dancey inside or anything (like Cairo Nights does) so we just bounced.\n\nFelt soo bad because the cashier looked at us with puppy eyes and asked how their hookah was. Yah it was good!! But uh... We're about to hit the clubs now (more like switch to Cairo Nights)\n\nOhhhh okay, hehe I see.\n\nAwww!!! I feel so bad!  The people are soo nice but we fucked them over. Well.. at least they still got paid, not like we walked out on them too ;)\n\nOh yeah, the music is poppin'!", "author": "Frankie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-27", "description": "Came here recently with two friends and I loved it. It was my first time trying hookah outside of my home so I didn't know what to expect but I was pleasantly surprised by the vibe. We tried the guava and lemon mint suggested by our waiter and it was damn good! We got there at about 8 and by 10 it was packed inside and out front get there early if you want to a good spot. Some cons for me would be the small space and it being cash only so be warned and prepared.", "author": "Beaky L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-03", "description": "This place had a wide selection of flavors and the server had great recommendations. The Turkish coffee was good too. It was a relaxing and fun place to hang out on the patio. We met the the owner and he was nice and informative. I'll definitely be back when I'm in town!", "author": "Mariel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-25", "description": "I came here once on a Friday night, my first time trying hookah. Its pretty chill, everyone was friendly and they have a variety of hookah flavors so that was good. I went with my friends and we order some smoothies, i order mango and it was really goood! \n\nGood service too, the only complain is that since the place was busy we had to wait for them to put more carbon or give us some attention. But its a cool place to chill i recommend trying it out.", "author": "Vale O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-01", "description": "Best shisha in the city! It's a little hole in the wall so its best to get here when there are no crowds.  I ordered lemon mint shisha which was really good and the arabic tea is to die for!!", "author": "Snoopy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-12", "description": "Best hookah I've ever had. Hands down. The price is a bit high, though. $22(if I remember correctly) and only 3 or 4 people to a hookah. But, is it worth it? Yes. I recommend the angel something(I can't remember the name of it right now, because I went in July '12).", "author": "Ashley T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-06", "description": "Went late night on a Friday for some hookah. We had a group of 8, and there was no line outside. We finally got a table together and the server/owner said we had to get 4 hookahs or leave. That's one hookah per 2 people, which is excessive. We offered to get 3 instead, since 4 would just go to waste (normally a group this size needs only 2), and he still refused. Two of us don't even smoke and we offered to buy tea or food or coffee, but he still refused. Finally I decided to leave the group and go home so the rest of the group wouldn't get ripped off. He STILL made them get 4 hookahs for 7 people. All in all, very poor service. They are one of the few late night hookah places in SF, but I don't think I'll be going back.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-07", "description": "Worst hookah experience. Not from the area and found on yelp. Decided to give it a try. \nWe had to sit outside because inside was full. Not that there were many people inside just small small place. Meanwhile outside every 2 mins getting asked for change by people walking right up to our table. It was a Saturday night around 10pm. HORRIBLE area. Clenched my purse to my side while trying not to make eye contact with the desperate poor roaming the area.\n\nHookah flavor was bad and they never came to check on coals.", "author": "Bailey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-26", "description": "Kind of a hole in the wall but this place I definitely recommend. Parking garage is across the street, $10 bucks until midnight, it is your best bet, you don't really want to park your car around this neighborhood. The place had a great selection of flavors and also a tasty menu of cafe drinks. The prices were fair, we shared one hookah and ordered two chai teas only cost us about $24. Very intimate setting, kinda crowded because it's a small space but we had a great time, the owners are very nice men and run a fantastic spot.", "author": "Andy .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-21", "description": "A wonderful experience! A comfortable, low-key environment, exactly what you would imagine for a traditional hookah bar. The shisha was tasty, and well-served; it lasted for about an hour, at which point the server came to change the coal promptly. The house-made milk tea was INCREDIBLE, slightly pricey and you have to wait (because the tea is home-brewed, over slowly heated milk), but well worth it!! The owner introduced himself at the end of the night, but refused to give away the \"top secret\" tea recipe.  Service was friendly, if a bit slow... but you don't come to a place like this if you're in a rush. \n\nOne downside is the location; the constant parade of homeless people passing by can make you feel pretty bad about sitting their with your $20 hookah, trying to relax...", "author": "Sasha N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-10", "description": "So THIS is what great shisha tastes like?! \n\nWe walked into this hole in the wall, smack dab at midnight, and it was packed.  The manager said, \"Two? Don't worry, I'll make room.\"\n \nSqueezing my wide ass and my date between two other couples, we managed to sit down and find ourselves lost in a haze of sweet, sweet tobacco blowing in from all around us. We sat so close to other patrons, that we might has well have been having sex. I don't know if they minded the wide load, but they were extremely friendly.\n\nI also found myself surrounded by an inferno of hookahs on both sides.  They put the hookahs on the floor for safety, so the tops of the burning coals were practically singing the hairs off of my (once) hairy arms. No more shaving for me!\n\nWe had the sour apple flavor and coming from my hot date that's never even touched tobacco, she said, \"wow, this is great!\"  We also ordered a small bit of arabic tea. and jee golly wizz it tasted as if you diluted a pound of sugar into each sip. I like sugar.\n\nOne of the servers, couldn't serve us anything but hot coals for some reason.  We had to ask the other for our shisha and sweet arabic tea when it appeared that the former server didn't understand anything but the universal sign language of pointing.\n\nAside from the lack of service and the cramped conditions, it was an awesome experience to finally understand what great hookah is all about.", "author": "Alfred Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-27", "description": "I love this place! My besties and me found this places after we could not get into Cairo Nights. When we got there around 11:30 it was not crowded but i guess that was because it had been raining that night. We came in an order one hookah and then another. Both favors were great; Guava and Cola. Cola tasted just like Coca Cola, my new favorite favor! You could really taste the favors while you were smoking it, the favor wasn't an after taste. \n\nThe atmosphere was the best. It was chill and the music was perfect. They played Middle Eastern, Arabic and i think some Indian pop, with some American pop mixed here and there. It was not a club atmosphere and the crowd was a little bit older maybe in there mid-20s (perfect for me!). If your looking for an Americanized, club, and late teens atmosphere go to Cairo Nights, this is not the place for you.", "author": "Krystle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-10", "description": "I've been going to Nile on and off for a long time. Few years ago I wouldn't give it 4 stars, but since the owner stepped aside & realized he is not cut for customer service and got pros to run it for him, it became a completely different experience at Nile!! \nTheir hookahs have been and still are, at least 4 stars. Hookahs are always clean, no leaks and topped with natural coals! \nTo get your money's worth, stay away from Arabic tea, it's too expensive for no good reason. Hookah and coffee or smoothie is a much better choice. \nIf you want a classier spot with same quality hookahs try Morac, but of course expect to pay much higher price..", "author": "Carl T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-11", "description": "I walked by this place numerous times but always thought it's just a cafe until a friend brought me here for hookah. It must be some strange coincidence, all of a sudden, everyone I know smokes hookah... \n\nThis place is cozy, warm, inviting and friendly while burning coal by the door and also outside that gives a very close relationship with the shop. \n\nThe owner and the servers are very friendly. We had tea and double apple. All great and they kept coming by refilling the coal. They only have 1 sitting on the floor area but other areas are good too. Definitely a great to hang out with friends and socialize!", "author": "T L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-17", "description": "Prices posted were innacurate. Think the attendant was pocketing the difference. Rude, forgot our orders, hookah ordered was apple and blueberry, thought it tasted like licorice and soap. Think the african guy was high.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-03", "description": "Wow!  we've tried a other hookah lounges in the city, but this place... well, Nile Cafe... well... WOW!\n\nOk, let me attempt to spit out a few lines of why I loved this place.\n\nQuality: The shisha was very smooth and so fragrant.  We also had two Turkish coffees, delivered to the table in the cevze/ibrik/briki/whatever-you-call-it.  The coffees were the best yet!  Pace yourself better than I did, though.  The coffee is so delicious, but sip it slowly since it's deceptively strong.\n\nService: The owner and his staff are all very attentive and pleasant.  They were really on top of things, especially the coal!  I like how they use broken-up pieces of coal... much more work for them, but a much better smoking experience than the larger coal discs.  Despite how busy he was, the owner didn't mind taking the extra minute to snap a photo of my boyfriend and me.  I also appreciated that the owner had a sincere smile on his face the whole night!  \n\nComfort:  Everything was very comfortable!  The seating was much better than other places we've been (*ahem* bar stools at Sunshine Coast, wtf?!? *ahem*).  The lounge is cozy and intimate.  We were never rushed, rather we felt encouraged to sit back and relax.  Perfect for a night with friends or with that special someone.", "author": "Christena T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-22", "description": "Its hard to find good hooka spots.  I own a smoke shop so I know cheap tobacco and coals when I see them.  I got to Nile Cafe and was pleasantly surprised.  The service was quick, they changed our coals often and the Arabic tea was strong and tasty.  The spot is a little small, but well worth the trip to the city to try it out.  Its open very late on the weekends too which is great....especially considering you can smoke after the clubs!", "author": "Naji E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-13", "description": "I give this place 3.5 stars, bc I was expecting a lot given that it had good reviews.  This place is smaller than it appears in the pics.  We got the white peach.  There wasn't much white peach in it, just smoke.  Our bowl became harsh after awhile.  Service was alright, could have been faster.  It took 15 min to get our bill.  However, despite all these, I will prolly go back later.  In SF, it's so hard to find a half decent hookah bar.  This one is decent, therefore, I will go back.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-15", "description": "This is the WORST hookah restaurant I have EVER been to. Do NOT come here. Go to Mela down the block because they actually know what they are doing and know how to treat customers.\n\nMy friends and I went to Nile last night and watched as three people that came after us went in before us. When we FINALLY got in (they said it would be 15 minutes and we waited a half hour) they crammed all ten of us into a tiny little corner and told us to \"squish together.\" We ordered apple, white peach and guava and, after waiting another ridiculously long time period (i smoke hookah a lot. i know how long it takes.) they finally brought out guava, white peach and LICORICE. we figured it wasnt that big of a deal and continued to smoke. well, we TRYED. two of the hookahs didnt work for 90% of the night, despite the fact that we talked to them about the problem three times.\n\nfinally, everyone was just frustrated and wanted to leave. i thought i would try reasonably talking to the manager to express the fact that it seems a little unfair to pay for an entire hookah that no one smoked the entire night. i walked over to him and calmly expressed my feelings in a reasonable manner only to be screamed at back. he started yelling at me  saying that his hookahs worked, and that he could fix them. this service was just ridiculous. it was the WORST customer service experience i have EVER HAD IN MY LIFE.\n\nFUCK YOU KENT. learn how to treat your customers.", "author": "Sammie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-22", "description": "This place is noooooo joke! It's legit and a great neighborhood place to chill out. We had a party of 7. We started out at a table but eventually moved to the small space in the window. The 7 of us snuggled closely together, smoked 2 hookahs, ordered tea and had a great time. It was SO relaxing and I could totally see myself doing this every now and then. Loved it! I highly recommend the apricot flavor! The young guy who tended our hookahs and tea was nice enough to accommodate us. \nThe TV on the wall played Middle Eastern music videos. At one point a girl was rubbing kittens on her face. ? \nMind you, this place of business is in the TL so be prepared for a show. When we were there a lady in a purple shirt was doing the leannnnnn. For those of your unfamiliar with the activities of the TL, the lean is when you're so high on heroin, you fall asleep standing up but then wake yourself up again every 15 seconds. Also, if you plan on sitting outside, forget smoking your hookah in peace. Take it from me- sit inside to avoid being hit up for $0.42 and a cigarette.", "author": "Amanda W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-03", "description": "Thank you for helping me blacken my lungs in style.\n\nThe logo on the outside looks a bit like the Starbucks siren, though the crowd of misfits milling about Jones Street with their unique taste in fashion and vocabulary will set the record straight right quick.  You're in the hood, son.  But that doesn't mean we can't have us some smoke and argue about Jihad and Zion.  Hope you're not in a hurry.\n\nThey have pillows for you to sit on and they let you smoke inside, any time of day, no lame \"after dinner only\" or \"outside only\".  You see the good people of Egypt kicking it inside with a newspaper and a hookah, like it's their own living room.  Class.\n\nIf you're brave enough for the elements and the local gentry, they have these big censers they set up outside so the real pros can get their own charcoal straight from the pit of fire.  There was this guy with his own mouthpiece.  Looked like a cobra.  The mouthpiece, not the guy.  Hardcore.  \n\nDid I mention they have like 30 flavors on the menu?  It's insane.  To be fair, they don't actually STOCK all of them.  And the blond foreign girl who was helping us was inept to the point of comedy, so I kept the order simple and the words small.  I will surely come back and try out the other flavors.  This beats Baskin Robbins any day of year.", "author": "Cassio P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-31", "description": "One of my new favorite joints on one of my favorite blocks in the city. I went there tonight and smoked some smooth hookah and drank the best tea. \n\nThe best thing is that, despite having a  blast, I have a drop of alcohol, so I'm gonna feel great in the morning. \n\nThe space is small, but in my opinion that lends to the atmosphere of the place. \n\nI'll be back for sure..how could I not? It's next door to Shalimar and across the street from my parking garage.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-06", "description": "This place totally sucks! The waiters are beyond rude and horrible service. They force you to sit at the table they desire. I'm an expert at hookah bars and I can guarantee you that this is the worst one I've been to. Avoid it at all costs!", "author": "Nora M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-26", "description": "Tea is superb.  Shisha (Hookah/Nargila) is sublime.  There is nothing else there.  Sometimes I want to shake Kinani, the owner, and make him give me other yummy food and drinks.  He does not.\n\nSometimes I ask Kinani to let me use the secret door to go to the Happy Endings Massage Parlor upstairs.  Kinani does not like this joke.\n\nIn addition to the best tobacco flavors, Kinani has real charcoal.  Other places tell me the virtues of the smoldering plastic hockey puck that they serve.  He used to steal it from Shalimar's tandoor next door.  Now he has his own furnace of good taste.  Sometimes Kinani's dad is there.  This is an opportunity to practice one's good manners.  Sometimes there are young hot Arab women there.  More reason to polish up one's good manners.", "author": "jawad a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-31", "description": "I sometimes wish to MAGICALLY appear sitting down with my white peach shisha & a cup of the arabic house tea while watching stuffed & plucked lebanese singers on there TV.  This place puts me at my comfort zone.", "author": "Mia R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-23", "description": "This place was right across from the bar I went to so my friend and I ran across the street fOr some random hookah craving. We had smoothies and hookah. And it wasnt expensive. It was fun.", "author": "Elvira G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-18", "description": "Wow, it's so sweet to see this place succeeding.  It's owned by the cousin or inlaw of Hussein, who owns the corner liquor store up the block.  There's almost no cooking facility, it's such a tiny place, but they have some of this and that, some coffee.  Hookas, tables and umbrellas out on the street and in the window so you can while away the hours, a brave forray into one of the most cracked out blocks in town but also one of the most lively.  Think about this place for an after-joint to Shalimar, Millennium, Clift, Osha Thai, etc.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-05", "description": "Clean Narghile and good coffee and great house tea, no baklava :-( but overall the best place to Hookah out.  Also they have outside seating (if you don't mind the homeless) that is great.", "author": "Peter K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-10", "description": "Minus one star for jacking the prices. I'm not spending $60 for a group of 4... And it's gotten a little run down- not a fan of the place by the window. I went a few nights ago and saw a dead bug on the carpet. Fucking nasty. \nMinus another star for waiting 20 mins on a refill on a wednesday night.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-16", "description": "First things first, kids-- The lovely thing about Nile Cafe is that you could potentially get a smoothie with your hookah-of-choice. The smoothie option remains a possibility-- kind of like getting extra large fries and a diet coke. Feels good. Honestly.\n\nI wound up at the Nile after a friend completed the last day of the bar exam (hoooray bar!!). We rolled into the low-lit room to the sound of loud Middle Eastern fusion music, excellent live drumming and strumming by intoxicated patrons that decided to play over the fusion, and really entertaining Iranian music videos that...were sadly on silent. \n\nBest part about Nile?? The BYOB factor! Use it to your advantage-- have a 40z party while inhaling mint chocolate chip. Better yet-- sip a soothing RED STRIPE while you realize you just might lose an eardrum from the entertaining cacaphony and generally boisterous atmosphere.\n\nGo with a large group of friends and enjoy-- just make sure you lock your car and hope it doesn't get jacked while you are indulging.", "author": "Yaamini R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-13", "description": "I had a great experience here the other day. A frequenter of many hooka bars, I know what I'm looking for...and simple enough, it's the hooka! Quality, flavors, how big the smoke gets, can I make rings, etc. Well, maybe not all of those things have to be there. \n\nBut they were definitely there at Nile Cafe, plus one more thing, which was great service. My friend and I got there quite early, and they had pretty much just opened. They were cleaning the place and making the nice \"lounge\" area clean for us and were friendly about it the whole time. I don't mind waiting if the service is friendly and I feel taken care of. They were almost too friendly and talkative but then totally left us alone too..I like that. Sometimes service can be too much, you just want to talk with your friend after awhile. It was a good balance here. \n\nAfter the lounge area was ready for us, the awesome factor went even farther up when I tried their house blend for hooka and was blown away by how good it was. Very smooth, they use good coal, and they refilled those coals like no other place I've ever been to! I'm anal, so I always ask..but I didn't have to ask here! My friend and I stayed for like 3 hours...literally. We were just so happy and relaxed there; I'm sure we'll make it one of our usual hangout spots after work, so I'll be back in no time. If you want exceptionally good hooka + quality service, this is a great place to try.", "author": "Nebula H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-05", "description": "Awesome place to chill on some tea and hookah with a couple friends!  Beware of the 3 person per hookah limit.  I like that, a lot.  But if you've got a big group, stay away from here and go to Cairo Nights or some shit...\n\nThey play arabic music here and the owners are really nice!", "author": "Michael K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-28", "description": "Very disappointing. The only star goes to the friendly woman behind the counter. \n\nSo... it's after 10:00 PM on a Sunday, cabin fever has started to set in from sitting on me ass too long, and I think... what could we (me + boy) POSSIBLY do? I had Yelped hookah bars/lounges/whatever you call them a while back, and thought, maybe this was our only late night option for this evening. So why not? It's a cold night, I'm bored, so why not do a little lung damage?\n\nFast forward through a 25-minute car drive across the city to one of the crappiest neighborhoods San Francisco has to offer. Weaving through the dodgy crowd up a hill, we finally get to the Nile Cafe. We browse the menu, and quite reasonably decide we don't want to pay $20 for a hookah when they were closing in about an hour. Between two people that's a little steep... so, we'll just have a seat and order a pot of tea and a smoothie instead. And perhaps hang out for a half hour at most. Harmless enough, right?\n\nSo when the otherwise kind gentleman comes over to take our order, we politely explain that we didn't want to get a hookah but we wanted to order drinks instead. They (he) wouldn't let us! They said we couldn't order, or sit down, without getting a hookah. So we had to leave so we didn't take up valuable table real estate. Because any moment now, a flood of patrons would ensue and we would be hogging one of the ten empty tables? I don't know. \n\nBeing a hookah lounge virgin I cannot comment on the establishment's overall impressiveness, but the boy insisted that of all the lounges he's been to, that was by far the crappiest and most expensive one he had seen. Duly noted.\n\nSo fast forward through another 25-minute drive home, filling the car with mumbles of \"that was dumb\" and \"how retarded\" and \"fucking lame. I'm going to leave them a bad Yelp review, dammit.\" \n\nAnd, here it is.", "author": "Andrea B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-06", "description": "Undoubtedly the best hookah lounge I've been to so far.\n\nI visited Nile Cafe with two of my friends at 4:30 on a Saturday afternoon, wanting to try their hookah before the place got too crowded. The place is a bit small, but the owner doesn't really have a problem with it: the location of the building is very accessible as it's only three blocks away from Union Square.\n\nThe atmosphere of the place was great: Bob Marley sang through the speakers while a handful of sexy Middle Eastern music videos played on the plasma TV. And I agree with the consensus: the owner is super friendly and loves to chat without imposing on your friends' session. He suggested that we try a bowl of the house mix (Nile Mix 2), which I thought was a very delicious blend of fruity flavors and a hint of mint. Contrary to my friend's preconceived notion, it was nothing at all like smoking menthols; the mint was very subtle and even enhanced the taste of the fruit. The best part was, the owner didn't give us a time limit: we stayed at Nile for a good hour and a half, with a renewal of (legitimate, not prepackaged) coals halfway through.\n\nNile Cafe may be my new hookah joint. This place is worth its word-of-mouth advertising.", "author": "Daryl L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-19", "description": "beware, the place is tiny.  that being said, you've got to love the hookahs, the house tea, and their turkish coffee.\n\nthe 4-stars is for the neighborhood, not the best place in the city, but i don't mind.\n\ntry and get there early if it's on the weekend.  again, it's a small place and once it gets packed, who knows what the wait time is going to be.\n\nas for Hookahs, the Double Apple is awesome, just make sure to keep on the guy running coals, as he sometimes seems to get distracted easily.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-14", "description": "The guava lemon mint is lovely, not too sweet, not too bland, it lasts long, and it tastes so fresh.\nThe spot is intimate; the staff is friendly and attentive. \nReal coals make all the difference.\nThe tea is excellent. It's warm, sweet, it tastes comfy (if that's possible).\nNile Cafe, The best hookah bar at 2:30am is a wonderful end to a long night.", "author": "Shanna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-20", "description": "The hookah is the best I've ever smoked, and the tea is awesome too. Check this place out if you want an authentic hookah experience.", "author": "Sean A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-17", "description": "I LOVE this place. I went here for the first time on Friday, and I found it very chill, unpretentious, and overall a very friendly hookah bar. Even if you don't smoke hookah, you can try their AMAZING tea. I swear, the best I ever had. I went with some friends, and I drank the whole pot of tea literally before they even had half of the pot. The manager was a super-chill guy, and I met these two guys who worked there, Vijay and David. Vijay was really nice, and David was uber interesting to talk to. Even if you don't really have anything to do, you can pretty much talk to David (who's a really interesting guy from East Africa) all night long (if they're not too busy) without getting bored and without the usual awkward silences, I swear. \n\nThe only iffy of the night was a high school girl (I know!) who decided I was being unfriendly and picked a fight with me. I was like \"chill\" and it was sort of funny how she got really mad at me in retrospect. that's how chill this place is. I literally forgot about how I nearly had my first catfight after some quality hookah and tea. How fitting it was to be this chill place to have my first fight (kinda).", "author": "Janet W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-24", "description": "The perfect place to relax and chill out after the thrills of walking through the Tenderloin.  The oft-raved about house tea, though tasty, was a little sweet for me, especially since we were smoking sweet shisha.  Maybe the Lemon Mint would have been a preferable complement over Nile mix 1 (our server wouldn't tell us anything more about the mix besides that it's \"fruity\" - having smoked it, I don't have much more detail to offer.)  So many flavors!  \n\nIt's a tiny spot, but there's a lot going on to provide entertainment - a pillowed area near the front window for max-relaxin, and some booths near the back with a TV playing india-sexy music videos that don't correspond with the music in the cafe.  The music that's actually playing is a hilariously random selection.  When I went there was a really excellent bongo player who occasionally interrupted his puffs to bang along when he felt moved to do so.  And there was a drunk girl who shares my name (kind of rare) who kept introducing herself and shimmying suggestively to the bongoing.  Entertaining indeed.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-12", "description": "My friend has been telling me about this place since I met him, and today I finally got a chance to check it out.  Located in what he has dubbed the 'tandoor-loin', it was rather nondescript, but could be quickly picked out once we looked for the little sun shaped sign protruding from the wall.  As we walked in I first noticed the tidy, near-eastern feel of the place.  It may be small but it certainly didn't feel it.  How they did this without mirrors I do not know, though I admit it was a bit early and therefore not very busy.  My friend and I opted for a seat around the floor hookah stand (the rest of the hookahs are seating only but I'll take pillows on the floor anytime) and ordered the jasmine flavor which he so highly recommended.  Though the owner tried to dissuade us, directing us to the tamer 'fruit' flavors, we stuck by our choice, and did not regret it.\n\nHaving tried their shisha before (you can buy some to take home) I knew to expect a very flavorful experience.  However, trying it from one of their beautiful hookahs heated with real coals was something else again.  I am being completely honest here when I say that the shisha itself lasted over an hour before dying down.\n\nTry the tea.  It was hot.  It was spiced.  It was delicious.  He asked us what we thought of it, and we replied emphatically that it was delicious.  When we asked the man (owner, I assume) what was in it he vaguely cited 'african spices' as the ingredients which gave it that special oomph.  It may have been just us but we both agreed that we tasted clove in there somewhere.  And it was undoubtedly sweetened with cane sugar and not the 'refined' stuff one normally encounters nowadays.  Absolutely delicious, I only wish I could have brought some home with me.\n \nMy friend, who had never been there during the day before, said the atmosphere was much different at night.  Though I took this to mean a night time jaunt would result in an improved experience, I was more than satisfied with the day time vibe.  However, now that I've been here once, I absolutely must come again.  And next time with a group- because unlike some places, the tables here (though few in number) are quite accommodating.", "author": "Nicolas M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-22", "description": "There are times when you just want to chill, away from the bustling club scene and rude people.  This is the place to do it.  Brought some Red Stripe and ordered Guava, tres good.  Tutti fruiti, not my fave.  Donnie, the owner is awesome and let us stay as long as we wanted.  He hooked it up w/ some tea (chai honey?).  Whatever it was, it tasted like nirvana.  Nile Cafe is definitely a jewel. :) \n\nThey have a really clean bathroom too! 6th star", "author": "Joellene B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-21", "description": "This is such a cute place!  I did not know it was small though.  We had traditional cherry hookah and it was amazing!  Total cost was about $16.00.  I would definitely come back on a Thursday night to chill.  Great place!", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-28", "description": "I love hookah joints and own one myself but the reviews really let me down on this one. I went in here with a friend last Monday evening. We ordered a hookah and it didn't pull right. i asked for more coals which helped a little but it wasn't the amount of smoke that I'm used to in other places. \n\nTo top it all off, the single bowl was 16 dollars! wow. I've never paid more than 8 dollars for a bowl so that really blew my mind.\n\nIt's a small cramped place and luckily there were only two other groups with us. The 2 stars is because the staff was very friendly and they gave us complimentary very tasty tea. 2 stars for hospitality.", "author": "Adam C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-18", "description": "Came here on a sat night after a disappointing hr of waiting in line at Ruby Skye and not getting in.  Boy did this place save our night, pretty small, but cute little cafe that was only 2 blocks away.  The atmosphere was really nice, they had music playing that wasn't annoying or too loud to talk over, and I loved the floor corner with all the cushions where we sat.  Hookah and service was great, I'll have to try some of their drinks next time I come here.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-27", "description": "Kinani's shisha is like smoking Valium (in a good way).\n\nTake your shoes off.", "author": "Fattfreddie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-19", "description": "Excellent spot.  Typing this up while I enjoy a nice cup of Arabic tea and some Sheeshah.  I was looking for a spot like this for ages in SF and finally discovered it.... phew.  A backpacker's stop for a quick rest. All this after a super sweet meal at Shalimar (right next door).", "author": "Manny F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-15", "description": "This little place is cute. We showed up around 3ish in the morning, where people were just starting to leave. We had a plum flavor because white peach was out. I ordered a chai latte and HOLY SHIT it was the best thing ever. I have never had anything so good. I even asked the owner what he put in the chai to make it so good and he responded with \"it's a sceret\" Kind a creepy huh? Anyways, I'd go back for the drinks and I feel that the place could be a little bit cleaner.", "author": "Ozzy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-10", "description": "Very good hookah. Very nice and helpful service.\r\nWe were surrounded by many businessmen and the place was packed, but the owner made it so 7 of us could sit. All the other folks around were super nice too. \r\nWe had a special blend of melon and vanilla and it was very very tasty. \r\nWe were there for over an hour and the smoke kept billowing nice and smooth. \r\nPair this place with Shalimar down the street and it is a tasty, relaxing night for all!\r\n\r\nFree WiFi and apparently awesome tea (i will try it next time, for sure!) makes The Nile a keeper.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-12", "description": "My friends and I got the hankering for hookah, as they had recently got addicted to the stuff. We found this place on yelp and went searching for it. \n\nIt's a tiny little hole in the wall, but we could smell it from Geary street. Yum. They had plenty of flavors of shisha and for a small fee, could mix flavors. And prices were VERY reasonable (15-20$ a flavor) for good quality tobacco. We tried the tutti-frutti. It must have lasted us an hour without getting harsh. The mint tea was very very good and also very sweet. Yum. I think we'll be regulars to this place soon. :)))\n\nThe owner was very friendly too. He asked us where we found Nile and we said \"Yelp.com!\"", "author": "Regina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-16", "description": "This has a great, mellow atmosphere.\n\nI recommend the \"Nile Mix\" and a little pot of Turkish coffee.\n\nIt makes for a lovely, social evening!", "author": "Brock H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "A++ rating across the board, I came up from LA for the weekend and located this amazing hooka lounge. The shishe was fantastic, everything was good from the tobacco to the coal to the good service. If you are high maintenance an want food and someone waiting on you every two minutes this is NOT the place for you..if you want a good atmosphere with reasonably priced hooka and good service look no further,,.. Ali is a really nice guy who works there and he makes a tremendous pipe!! Enjoy!", "author": "David I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-14", "description": "The hookah is great. They use real coal instead of the instant light crapy coals that other places use. Ask the owner for his special tobacco mixes, really good stuff.\n\nYou must try the tea with your hookah. I'm sure you will love it.", "author": "Mohammad M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-19", "description": "Great Place to hangout at in the Tenderloin!\nSmooth sheesha!\nFantastic tea!\nRandom entertainment!", "author": "Steve A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-30", "description": "First things first, if you can't handle this part of the TL then you have no business being here. Sure the block isn't the best, but it's far from the worst the `loin has to offer.\n\nSecond, if your idea of a good time is you and your 19 best friends (how you could have 19 best friends is beyond me) you obviously aren't going to enjoy the charm of an intimate place such as the Nile Cafe. Like others have noted, go find yourself some commercial hookah bar someplace else where you can fit in with the crowd.\n\nHowever, if you can appreciate the fact that while this is in the `loin, and is not the best place for a large crowd, please go to the Nile Cafe. They have a fantastic selection of tobacco (Shisha, or Sheesha is another name for hookah, not the tobacco) and the house tea is a marvelous compliment to your smoke. I've tried over 10 of the varieties on the menu and have never once been disappointed, they're all fantastic.\n\nThe owner is one of the most gregarious guys who, regardless of how many people he sees in a month/year will remember you if you weren't a jerk. The guy is fantastic and actually handed out bottles of Martinelli's on New Years to people who got a hookah.\n\nAll in all, if you can handle walking through a neighborhood that's about as San Francisco as any other normal neighborhood (you really aren't in any danger on this block)  and can handle the intimate venue, you will be rewarded with one of the best atmosphere's for enjoying a relaxing hookah.", "author": "N S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-18", "description": "Great Hookahs, in a nice cozy location off Geary. You must try the Tea, it really makes the experience much more authentic, and enjoyable. They have multiple flavors to choose from, so you can't go wrong with any one. They recently just added an outdoor area, which is really nice to do when the weather is nice in SF.", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-16", "description": "Very authentic hookah bar feel, like the hookah bars I went to in Morocco. Simple seating, strong hookahs. Lovely cha (tea) options. Sketchy neighborhood but great Turkish food everywhere around regardless.", "author": "Brinda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-09", "description": "The Nile is a great place to relax, sip tea and smoke the hookah with friends.  Their tea is fantastic and they have a huge menu of different flavored tobaccos.  Though, they never bring me what I order.   The guy who runs it is so nice and he always reassures me that he gave me \"something special.\"  Fair enough.  \n\nThe atmosphere is very conducive  to smoking the hookah.  No shoes, big pillows on the floor, weird music videos playing on the tele, men laying around, speaking in foreign tongues.\n \nIt is almost a shame that i was recently gifted my very own hookah courtesy of Rachel H.", "author": "Alexis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-27", "description": "Love, love , love the white peach!! Hmmm.....so good!!!\nWe went on a Saturday night and got a floor seat by the window so that was really cool! Service is a bit on the slow side. Price is reasonable. Music is good. The cafe is small, full of people, has outside seating, kinda dark, a bit dirty.... Definitely worth coming back (although I try not to come back twice for a place in SF) and try their tea!!", "author": "Gabriele A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-28", "description": "Nile Cafe has a variety of good hookah flavors as well as tasty drinks. Their house tea and chai tea lattes are some of my favorites. There is a good atmosphere and fun music playing. Can be very busy on weekends at night before and after people go to bars.", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-03", "description": "Great hookah, good tea. Just took forever to get served and the place is way too small.", "author": "Jabeen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-12", "description": "This is the kind of place to go relax and have a conversation with friends. The music is very chill and the shisha flavors are all very tempting. I actually convinced my buddies to go with \"Sex on the Beach\" and no one had complaints! It's also a great place to people watch. I can't wait to come back!!!", "author": "Lisa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "this place was great. they didn't have much drinks there when i went. hookah hits pretty good, service was good, and the music was ok. .. the price of hookah was pretty much the same price as san jose  20 bucks.", "author": "Jewl B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-09", "description": "A Hookah Lounge in downtown San Francisco?  I gotta check that out!\nStep into the door, everyone is relaxed in the dark middle eastern atmosphere.  They have couches piled with elegant pillows and intricately designed hookahs.\n\nWhen you get the menu of the shisha selection, you are probably going to be overwhelmed by it.  I asked for the house special and the house tea, which both consist of secret ingredients...  It was good though.  I definitely recommend the tea which is very sweet.\n\nThe employees were cool, but service was a bit slow.  We ended up waiting anywhere from 20-30 minutes to light up and a pot of tea.  Overall, I thought that this place was small and stuffy, but the quality of product was good.", "author": "Walter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-04", "description": "After a late dinner at Katana-ya, we walked back up to Geary to Hotel Adagio where we were staying. It was our first night in the city and we were not quite ready to crawl into bed so we decided to walk around the block and check out the interesting, somewhat sketchy Tenderloin district. By the way, I don't recommend doing this unless you're with someone that will be ready to kick some ass...in this case, I had my boyfriend. \n\nWe stumbled into the Nile Cafe shortly after we made a left on Jones street. A guy ushered bright red coals from the side of the street to his customers sitting on the patio. The sweet hookah smoke and techno-like Arabic music sneaked through the little door. Right at that moment, we knew we're up for an adventure. Luckily, we were able to find a corner area to ourselves in the small, crowded cafe. The environment was lively, yet intimate. Loud, yet relaxing. \n\nSince we had no idea what to do other wanting to smoke some hookahs, we let the owner decides for us. He gave us the Nile mix for the hookah and tea. The tea was like Indian chai tea without the milk...sweet with a cinnamon, cardamon flavor. The hookah tasted just the same and we were very happy. We sat on some semi-comfy cushiony seats, drank 3 pots of tea, smoked, and people watched. It was the most relaxing and fun thing we could've done that night. \n\nAnyway, I just love this place! It's local, it's genuine, and the owner and server were very friendly (true from other reviews). Next time, I am bringing a deck of cards or some silly games with me to play!", "author": "J B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-02", "description": "Decided to hit up a hookah place while in the city and looked up the reviews for a place and found that Nile Cafe wasn't too far from where we were. (although we accidentally ended up walking through the Tenderloin, which was totally fun) we still enjoyed our time here. \n\nWe got two hookahs and flavors (they do a up to 3 people per hookah rule and since we had 6, ya you do the math). We had the Triple Apple (which I didn't like that much because the after taste was too much like licorice) and the Sunkist (which was a light orangey/fruity flavor). \n\nWe had the booth in the front with the pillows on the ground and it was comfy for some of us (the corners) and not so comfy for others. The tv was blasting some awesome music videos/movies, totally reminded me of where I grew up. \n\nIts not that big of a place so it does get a bit crowded so I would come a bit earlier and hang out for a few hrs before going out in the city. We definitely had some fun and great conversations over some sweet hookah. :)", "author": "Erin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-01", "description": "I am by no means an expert on hookah, I indulge once in a while, normally with friends just to relax and chat. So go figure I love the atmosphere of this place and the cafe portion. I went last night and admittedly not able to take deep pulls of the hookah so instead I enjoyed the adeny tea. WHICH IS DELICIOUS. My friend and I split two pots of this delicious tea and it was so good. Go, if not for the music, or the hookah then do it for the tea. They serve espresso drinks and coffee, but the tea is where the gold is.", "author": "Shauna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-04", "description": "Friendly staff, nice teas and hookah. I really liked the place.", "author": "dogan kaya b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-06", "description": "In one word, perfect.\n\nThe shisha at this classic hangout is the best in the United States--and maybe even in the world. With real charcoal and over 75 different flavors to choose from, the sky is the limit.\n\nWhether you're looking for the classic double apple or something a little more adventurous--try the fakhfahina--this is the place. Be sure to check out the tea and the Turkish coffee.\n\nGo. Be seen. Have a night to remember. It's worth it!", "author": "Matthew P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-23", "description": "This is what a hookah lounge should be, lots of arab music, arab tv, the best cardamom tea I've had in ages and really good smoke... the only thing that got me was the bench seating, not terribly comfortable, should've lay on the floor/dais near the entrance with the pillows...", "author": "Len S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-10", "description": "Very cool little place. Extremely friendly staff. Would definitely come back.", "author": "Tony M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-18", "description": "First time ever going to the Nile Cafe, I must say I liked it.  I can see myself returning again, and again.   The Chai Tea Latte was AMAZING!! I woke up craving one this morning.  The Hookah was tasty, no complaints there.  I wish they would serve some finger foods, because after about an hour of puffin on the hookah my stomach started to feel a little queezy.  I cant wait to go back and try some new flavors!", "author": "Krystal D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-22", "description": "Went to the Nile Cafe the other day with a buddy. A decent Hookah bar in the middle of the City. Although slightly pricey it was top notch shisha being imported from Dubai. The hookahs them self were very nice and not like many shabby ones you tend to see else where. \n\nMy friend and I got one of the mixed flavors called \"Obama\" made by one of the employees. I recommended to him that he package it as is and sell it cus it was that good. I also recommend the house tea. \n\nThe employees and owner were great. While the service and atmosphere were very decent. Plenty of plush pillows to go around. The only potential downfall of the Nile Cafe is its location hidden within the Tenderloin. But still wont keep me from coming back.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-21", "description": "Been here several times and each time I enjoyed myself. The hookah is very tasty and I think they put ice in their base because the smoke is very cool/chilled. The have a pretty big menu for hookah. Prices are average ( 15 dollars a pop and 17-18 for certain mixes ). I'd come here again but hopefully on a night and time where it isn't TOO crowded. You have the choice of sitting inside or outside, and we've done both. They have this comfy little seating in the front where it's carpeted with many throw pillows and you have to take off your shoes before you enter the carpet seating. Very relaxing when you just want to kick back and smoke some tasty shisha. =)\n\nTheir house tea is REALLY good. It's chai, gingery and slightly sweet. mmm..", "author": "Bonita C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-25", "description": "My friend and I were looking desparately at 1:30am for a place to cap off the night's festivities.  Dropped off deep in the 'loin, there was no doubting our ability to run into some sort of late night score...\n\nLike a surreal real-life episode of \"I Dream of Jeannie\", a waft of smoke obscured our path and thick tendrils of the haze beckoned us to step into Nile Cafe.\n\nAlthough the place had cleared out, the owner was more than happy to let us lounge hedonistically on the pillow strewn floor while he hookahd us up with some very nice blackberry shisha.  Though I'm not a  smoke guru, I will admit the flavors were intense and long-lasting.  Add to that an insanely tasty house tea and we were steaming ourselves into a completely altered state.\n\nWe had a great conversation with the owner, and learned about the history of the place as well as his aspirations for the future.  Meanwhile I was puffing away like some wisened sage from lands farther east than Danville...  Dig anyplace that makes be feel \"wisened\".\n\nI give this place an A for the classiness of management, an A for the quality of their product and a B for the location and layout.  I certainly hope this guy brings the love to the East Bay - we are in dire need of something to make us feel cool over here.", "author": "Brett L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-06", "description": "Great atmosphere, hookah is good (but avoid the overrated Obama blend). I recommend the coffee, chai tea lattes are tasty.", "author": "Mario C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-18", "description": "This place is pretty cool compared to the other hookah spots in town. One things for sure is that it isn't as crowded as many of the other spots; Cairo Nights in particular. Great place to hangout and \"chill\" with your buddies. Hookah is fantastic as well. Customer Service is much better than other places; they actually come regularly to replace your coals unlike other places where you have to keep going up to ask the employees to come do it. If the $10 hookah deal was until late night, it would be the best spot! Go and try it for yourself :)", "author": "Moe L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-12", "description": "A better than average hookah bar in a city that lacks in many hookah options. Service is always somewhat slow, but it's hookah, you're there to relax, not grab a quick smoke over lunch. The shisha is just fine, the tea is pretty good, and while small the atmosphere is enjoyable enough. I've not been on any crazy busy nights, but it's usually got a few people, but not too bad. Wifi rounds out the mix, though I've only used it once. All of this is tempered by the fact that it is pricey as hookah places go. \n\nHonestly I was going to give this four stars but had to adjust it down to three. A lack of major negatives but a lack of big positives makes this a solid \"Alright\" in my book. Check it out if you don't want to deal with louder crowd at Cairo Nights.", "author": "Scott R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-08", "description": "Inexpensive and serves a long lasting hookah. No food, but they usually let us bring our own from Shalimar next door.", "author": "Jono S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-01", "description": "Your typical hookah bar with middle easter videos of belly dancers, lots of arabic men and smokey, great hookah. Obama is my favorite.  I hope it doesn't close down like most other SF hookah bars.  Check it out now before it's too late!", "author": "Ava D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-21", "description": "I stopped by here on Thursday night with a few of my friends.  The place wasn't hard to find and there seems to be decent parking around.  Just be careful, I knew by looking at the address that it wasn't the hottest location as its in the Tenderloin.  Not the worst neighborhood but definitely not the best.  Lots o characters hanging out if that's your thang.\n\nThe joint wasn't that large and only two other parties were  here.  Pretty chill setting.  I'd say there's about roughly 5-6 tables to sit at.  We sit down and ask for a menu.  He handed us a menu with roughly 50 flavors.  We got our hooka pipe quit and smoked for roughly an hour and a half.  \n\nIt is also a cafe as my friends and I were able to get coffee and some Arabic Tea which was pretty good.  There's more selection for food and drink but  we didn't partake in any of it.  I'd definitely come back here and the people working here were cool and helpful.  It was also cool to not have to get up but request you get more coal by just turning my head.", "author": "Jason Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-03", "description": "A boy and I went there to smoke some hookah. We were really excited to tryt this place out as both of us are some veteran hookah smokers (can we say that??). Anyway, the service was a tad bit slow in the beginning, but soon we were greeted by a charming employee named Vijoy (Spell?), and he fully entertained us, and I got the feeling that he genuinely wanted to get to know us a little bit. Oh, he also got us coals. We had guava flavored tobacco and towards the last hr, the hookah smoked fabulously. Oh, and can't forget the scantily clad persian women on zhe mtv....\n\nIt's a great spot- close to everything downtown/union square/ hotel, but not pretentious, and very down to earth place. We ended up picking up some tobacco and coals- fully enjoyed everything about this place!", "author": "Mihae J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-18", "description": "If you go to Dottie's and find a line halfway down the street when you get there, try this cafe, which is what I did. \r\n\r\nThe atmosphere is slightly lacking, or at least it was when we were two of the few people in the place, but the service is helpful and friendly. My companion and I shared a veggie taster (big enough for two) and it was delightful. I heartily recommend their iced tea which is spiced instead of the regular black tea brew.", "author": "Michelle J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-20", "description": "Ehh, the  hookah prices are a little high, the tea pot they bring to the table is tiny, and the seating is so uncomfortable,  but overall this is a nice place with a friendly owner. With a few improvements it could be great.\n\nI've been here twice, last time there was a Saudi guy playing dotar (a long guitar) and a girl belly dancing. She put on quite a show.\nYes, I've had much better hookah, but the crowd here is fun, which makes for a pleasurable experience.\n\nParking is a nightmare, travel in groups.", "author": "tara n."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-26", "description": "This is a cute place with some interesting (non-alcoholic) drinks. However the quality of the hookah is not that good and because of poor ventilation they always have to leave the door open which means you are freezing most of the time!", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-24", "description": "the price is high, the hookah taste is not so much,,,\nand place is small and noisy,,, not very much for a joy-able hookah", "author": "Ckoka C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-27", "description": "I LOVE coming to Nile Cafe with my friends and just relax. They have the best hookah in town and the best customer service. Kan is always interacting with us and making sure that we're doing great. His staff are always very attentive and helpful carrying huge smiles whenever I see them. \nPrices are very affordable and its obvious that customers not only enjoy the yummy teas and awesome hookah, but they also enjoy the atmosphere that Kan and his staff have created for us. They are so laid back and always remember their customers. If the place is full, then they try to make it work creating a very homey atmosphere.", "author": "Veronica G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-19", "description": "Great find on the same block as one of my favorite restaurants Shalimar. Long waits for a table at Shalimar. So what did we do? We checked in with the manager at Nile Cafe and ask him if we ordered take out could we eat it there. As long as we ordered a hookah it was fine with him. It turned out to be the perfect way to end another long awaited lovely sunny day in the Bay. Fine food, fine company and fine hookah atmosphere. Try the house tea, cold or hot. The sweetness mixed with the cardamom awakens yet comforts the senses. Can't wait to drop by again.", "author": "Farah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-05", "description": "Stopped by here for some tea. Tried the Morroccan Tea which was very good. They also have a wide variety of Sheesha flavors. Did not have time to try it out, but they have \"Al Fakher\" brand which is pretty good brand of Sheesha. Will have to come back and try it out next time I'm in the area!", "author": "Irfan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-06", "description": "Going to Nile Cafe was like dying and going to sheesha heaven! I'm from the East Coast and I wanted to make sure I would have plenty of hookah while I was in San Francisco, so I did some research online and found this place. The reviews on Yelp were very positive so I decided to give it a try since I consider myself a sheesha expert. I've smoked in all corners of the world and I must say that I was really impressed with the hookahs and tobacco at Nile Cafe. There is a wide variety of flavors, but I decided to stick to my usual double apple and mint and it was amazing. Later on I decided to check out \"sex on the beach\" flavor and even though I'm not much of a fruity flavor smoker, I really enjoyed this one. \n\nThe place is small, but it's very cozy.  And sometimes you end up chatting with the people next to you which is pretty cool. And of course no one will bother you if you'd rather not socialize with the others. There's also an area where you can sit on the floor, which is perfect for larger groups. The owner there is an awesome guy who's very friendly and always tries to accommodate everyone. It's just a very chill atmosphere. \n\nI had a list of other cafes I wanted to try out while in the Bay area, but I decided against it since this place was just perfect. The owner was so sweet that he would let me try the hookah HE was smoking just to see if I liked the mix he had made. And if I did, he'd make me the same one. The Nile Mix is good too if you want something light and a little fruity. \n\nAlso, this place doesn't serve food so the one review on here about food doesn't make sense. The owner of this cafe only serves drinks. He makes pretty good lattes and the tea here is amazing. \n\nAnd for those of you who consider yourselves experts in the sheesha department...this place uses natural coal which makes the flavor even better. They don't use the fast lite kind of coal. \n\nI was a bit worried about the location of the place after reading a few reviews on here that said the area wasn't the best. I asked my friend and she confirmed this, but when we went we felt fine and we weren't scared for our lives or anything like that. There's also a police station down the road so...yah you might see some strange people walking around, but you'll be fine. There's also a parking garage right across from the cafe which was pretty convenient!\n\nThis place definitely deserves 5 stars. Go there and you definitely won't be disappointed. The owner is awesome and he'll hook you up. \nI'll always remember this place as having damn good sheesha and would recommend it to all my hookah-loving friends.", "author": "Na3Na3 L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-11", "description": "good place to wind down or hang out late night.  place opens til 4am some nights/all nights.  small cramped space but hookah's pretty good.\n\nfavorites i've had here...obama...some other mix...hookah prices are average [i think about $15-$18].  loud middle eastern music :] i like it.  i like their arabic tea [it's on the sweet side though for those of you who might not like it].  maybe you could ask for a sample before you get a larger size.  told the owner there was a particular flavor we weren't thrilled about once and he took it into consideration.  asked us for some input on why and things like that.  it's in the tenderloin so go with some brave friends if you're afraid of crackheads and strays that hang out around the block.  it's not bad though lol", "author": "J K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "I have lived in SF for a long time and this place has the best service and style you could find in the finacial district.... They have remodeled the tables and chairs and it much more improved and is friendly and convenient from where I work.  The owner is very accomidating and helps everyone and always welcome me there! Thanks Nile this review is for you guys!", "author": "Adriana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-21", "description": "I loved this place so much that we went two days in a row. Right when it opens around 4pm, nobody's there, you've got the place to yourself and you can watch the \"Now That's What I Call Arabia\" music videos on repeat. The \"Obama\" flavor was excellent, and our coals were changed three times while we were there, without us even asking for it. Plus the house tea and the green tea smoothie are excellent beverage choices.", "author": "Nika S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-23", "description": "i love LOVE how they have a extended list of shisha. my favorite is probably the guava. i also love their exotic spiced teas. yummy! the place is so chill & cozy...it can just get a bit tight & crowded which gets a lil annoying when u  have to scoot ur seat in so ppl can walk by.\n\ni gotta come by next time to try their mint chocolate chip :P\n\ni bought my very own hookah after visiting this place. lovess it!\n\n:)", "author": "Rosalynn D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-20", "description": "Their Arabic tea is some of the best that you could taste. Especially when its brewed with milk. This was my favorite spot during my last trip to the Bay Area. The place is very cozy making it a great winter spot.", "author": "Ahmed H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-05", "description": "It's chill but also lively. The small yet roomy interior came alive when the DJ/Owner turned up the volume and a designated tabla player started matching the beat. The choice of flavors for the charcoal is overwhelming and off the hook-ah. The owner and his dad were really friendly and showed us how to properly toke it and smoke it. Was entertaining having a smoke exhaling contest with them, as well. They even allowed one of us to bring in alcohol from a liquor store right around the corner...they just don't serve it. Neighborhood isn't as bad as some say, it's just not for the fainthearted.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-04", "description": "This place was great. We went the day after new year's and didn't have to wait long for anything. The employees were very kind. The guava was good. The house specialty tea was pretty good too. We sat where we wanted. We might've gotten points for having an Arab guy with us though.", "author": "Sharee R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-08", "description": "So, I've been to about 10 different hookah lounges in 3 states. And while i think Yelp is an awesome site, I have always been a little bit hesitant to join. However, after my experience last night as this pathetic excuse for a hookah lounge, I felt motivated enough to actually join. So, what's so bad?\n\n1. Crappy and shady area. However, can't really blame this on the hookah bar. And I've been to shadier places (that were WAY better). So it is excused from this accusation.\n\n2. Ambience- Very cheesy. If I could come up with an analogy, it would be Cafe Nile: Middle Eastern :: Taco Bell: Mexican. \n\n3. Service- Employees are EXTREMELY rude and if you try to ask for help or attempt to get them out of their routine, they respond with extreme arrogance. Manager is a stress-nut who cannot handle customers questioning the service. \n\n4. Hookah quality- There are plenty of positive review on Yelp about the quality of hookah here which makes me wonder just how experienced the people reviewing Cafe Nile are. Coals are red hot and abundant but flavors of tobacco is mediocre at best and hookahs are the ones you can buy at an outlet plaza for about 40 or 50 bucks. Not worth it for 15 dollars per hookah. \n\n5. Food- I didn't actually order food but from the looks of both the plates and faces of customers who did order food, it looked like food you could get at a food court in a mall. Again, think Taco Bell for Middle Eastern. \n\nOverall, this is the absolute WORST hookah lounge I have been to and I would highly recommend one of the neighboring lounges over this sorry excuse for a Hookah lounge. Go to Cairo Nights.", "author": "Vadim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-09", "description": "Very cool spot...I stumbled in this cozy little nook one night after eating after at the Indian Restaurant across the street. We were able to get a nice little couch/ table spot and inhale away. I felt totally dreamy after leaving the favors were great and the complimentary tea was awesome. Very nice crowd of people too, what more could one ask for?", "author": "Leslie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-13", "description": "Delicious flavors, cozy, tobacco didn't give me a headache, and owner Ronnie (I think that's his name) was welcoming. He treated me like a friend which is rare in the city. I would love to return. This place was the perfect ending to my Girls night out.", "author": "Nelly Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-22", "description": "Lean back and enjoy an exotically flavored hookah while listening to Arabic business men conduct their deals.  At several points in the evening, my companion and I were the only ones speaking English - everything, including the television made us feel as if we were in the middle east.  They have 23 different flavors for the hookah and are willing to combine flavors. \nKen, the owner, was amazingly helpful and friendly.  He let us know that he makes the tea from scratch.  It was so good that I couldn't bring myself to try the banana milk, but I suspect its a must as everyone in the cafe had one.  (The coffee was also superb.)  The food was very good, but different from an Ethiopian meal that one might get at the much missed Blue Nile.  The flavors are similar, but the presentation and ingredients were different.  I'm not certain if its more of an influence from the middle east that I've had with Ethiopian food in the past or if its a greater emphasis on fresh produce.  \nI almost don't want to post this review, as I'd love this little gem to remain private, but must share.\nThe decor is modern - clean lines and bright paint.  It's also small, but its great.  A perfect first stop before hitting the tender nob bars, or a great place to wrap up the evening.  (Closes at midnight Fri & Sat).", "author": "She-Ra .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-05", "description": "Ok This place just popped up on yelp 30 min ago and I thought it was a fake review. So I decided to call the place and it does exist. I ordered the Sega Ferefer (Meat dish moistened with ingera-Ethiopian bread) and let me tell you it is gooooood. The place is set up like a coffee shop with the usual coffee,late etc but they also serve Ethiopian and Mediterranean food on a limited menu. The decor inside is simple and clean. It would be a great space if you live in the Tendernob and want to hang out at a discreet coffee shop that is not popular yet. I will definitely go back to get food to go.", "author": "Teddy d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-15", "description": "my last few visits were hugely disappointing... the service and hookah quality have gone downhill, while the prices went up... next!", "author": "Yaz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-25", "description": "Awesome hospitality here and the seating areas in this small space are so cozy and clean.  Gold stars for that soothing herbally sweet tea AND the shiny samovar it arrived in.  We had the apple flavor, but must try out all the other flavors soon enough.  I'm just sayin, what a pleasant alternative--for everyone-- to smoking cigarettes.  It lasts longer and you can do it indoors-- perfect for those philosophical discussions that should last longer than your tolerance for standing out in the cold wet sf night as you burn the last drag to the filter.", "author": "Marjorie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-27", "description": "Great place to go after you've left the bars / clubs. Went there on a Thursday night after going to Slide. Loved it. We had the GUAVA flavored hookah, and it was one of the best tasting flavors I've ever had. It was a nice place to chill, relax, hang out, and end our evening.", "author": "Samir P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-23", "description": "My friends and I were suppose to eat at Shalimar, but I had gotten there way too early and wandering around Tenderloin wasn't my idea of fun. So, I wandered into Nile Cafe where I struck up a conversation with two nice guys visiting from Oklahoma, and there you have it! I got to try my first hookah! Then I told my friends to join me there first before Shalimar. We had such a great time that after Shalimar, we came back and tried our own hookah. We're going to definitely come back and try their different blends. Their house tea is also quite yummy!", "author": "unhei k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-14", "description": "This place is money and the best hookah I have had in SF.  The price is great and the quality is par none.  I think the menu is going through some adjustments but the core of it is authentic and excellent.  The owner is hands down the nicest bar/restaurant owner I have ever met and I implore you to visit and prove me wrong.  Ask for the Nile mix on your hookah and you wont be disappointed.  Its small place with a lot of heart.  The ladies are starting to show up as well which was great to see.  If you hookah, you must stop by", "author": "Porfirio R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-14", "description": "REALLY enjoyed this place. I'm not a huge hookah person, but this place had great ambience, and the staff was extremely friendly and nice. The clay pot filled with hot coals kept us warm outside, and the 'sex on the beach' flavor and the 'obama' flavored hookah were great. Afterwards we moved inside to an area where you sat on the floor, surrounded by totally comfy cushions. \nThe TEA was the best part. I don't even like tea. And I definitely don't like cardamom flavored tea. But this was awesome ... we all had multiple little cups filled of this fragrant, sweet hot tea. \nThe only reason this place is not getting 5 stars is that it doesn't serve food or alcoholic drinks. But they let you bring your own booze, which is fine in my books. There is a Turkish hole-in-the-wall joint next door, from which you can order your hummus/tabouleh/baba ganoush/etc and bring it over if you want ... next time we'll try that, and perhaps move it up to 5 stars :-)", "author": "Antara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-24", "description": "This place serves the best hookah in San Francisco, without a doubt.  The owner is soooo nice and always helpful.  It is best to ask the owner to create a mix for you.  The tea is the perfect mixture with just the right amount of sugar and they have just expanded their menu (although I haven't had anything yet I know it will be good).  I love this place, my roommate and I try to come here at least once a week.  If you get here early enough you can get a great place to sit and study while you smoke.  I love love love his hookah, it is the best.  EVERYONE MUST COME HERE!!!", "author": "Kathleen O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-28", "description": "This is my favorite hookah place as of last night.  It's reasonably priced, they have GREAT flavors, and it's ridiculously chill.  There's no skeez and no pretention here, it's just plain simple hookah.", "author": "Rose H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-03", "description": "cool spot other than the location in smack middle of the tenderloin and having to put up with the lady upstairs screaming out of the window and pouring water out on the outside smokers. This place is cool.", "author": "Nael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-10", "description": "really small but i liked the intimate atmosphere and although they didn't have half the things we wanted his suggestion for the hot coco was spot on ! plus the hookah was perfect:) the table was rickety so i was kinda scared I'd break it but I had fun", "author": "Cassandra P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-27", "description": "Best Hookah in TOWN! Good peops and really the best hookah. Beats Kan Zaman, Marakesh, Pride of Medeterian, Zyrabs. They take  care of their hookas and will make sure u have a good experience. Place is full of great random acts of after and pre party.", "author": "agil m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-23", "description": "Very small and intimate, I don't like the camera inside makes it feel like someone is watching every move. Friendly people but when we came here today we were the only ones and it just made us feel that our every move was being watched so we split and left but not before I ordered a green tea latte (which was very good I might say!). I guess it is better to come here on weekends? They have quite a selection of menu's in their hookah flavor tobacco's, a few names stood out like \"obama\" and  \"sex on the beach\".. I thought those cleaver names were in cocktail mixes only..I guess not. I might come back but not on a sloooow day like today.", "author": "Ateh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-06", "description": "I enjoyed the nile cafe, good atmosphere, decent prices.. the only drawback is that the place is so small, I came with a small group and we had a bit of trouble finding a place to sit. I would go again, I had a great time.", "author": "Starr R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-24", "description": "I would add a couple of caveats to all the rave reviews below -- this is not a place to go in big groups neither is it a place to go with empty stomach. I would say though that this place seems to be a great joint for hookahs. We went there in a group of 9, we were given the biggest corner but it was   probably only big enough for 6 people. And did I tell you we were  hungry, but with the small table in center which was probably big enough to hold  food for two -- we gave up. The owner then ushered into a shop couple of doors away -- which was just a sequel to the disappointment that Nile Cafe was. Overall, if you are not there solely for the hookahs, pick a different place, drive to Haight, goto Kan Zamaan or some other place.", "author": "Kumar S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-12", "description": "Seriously best shisha in the area and nice warm hospitable owner:) oh not to forget Amleset, she gives the best of her to serve costumers! She is amazing with best tea she makes and best shisha:) trust me guys this place is worth the visit! There's also a good Turkish restnt nxt to it!", "author": "Invincible M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-16", "description": "Try the house special mint (blue mist - blueberry mint? and guava) hookah/shiesha/nargila.  The staff is nice, the shiesha flavors are plentiful and the location is great, right next to a bunch of halal restaurants.  Cushy seats, Arabic music, Egyptian TV. Love it!", "author": "Cara J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-16", "description": "I visit Nile Cafe about once a week for their amazing tea and hookah. The staff is helpful and knows how to prepare a mean (hookah) bowl. I also recommend the fresh baklava", "author": "Benjamin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-21", "description": "A hooka/cafe joint located in the TL. Many hooka flavor to choose from I think the menu had 40+. Small place though probably 6 tables in there however the Thursday night that I went, nobody was there so we were fortunate enough to get a table. They have a plasma TV and since it is a coffee shop, you have your standard choice of drinks of latte, espresso, coffee, etc. Prices are fair but neighborhood ain't the best. I think it was a couple spaces away from a rehab center.  Since I went there for the hooka, I cannot speak for the food they serve there. I will go back but the neighborhood and sitting space are drawbacks.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-08", "description": "The service here is AWFUL!!!!! First of all, the waiters took at least half an hour to finally acknowledge our existence and give us service (probably after realizing how persistent we were on staying to hookah) and one of them was even rude to say, I know I see you, after slowly cleaning up the empty table next to us while still keeping us waiting to order. tNext, after the long wait we decide to move up closer and thats when a waitress comes up to us and we order. We asked for watermelon mint and three chai lattes and a mocha. The waitress tells us we cant combine favors which turned out to be a lie because we overhear the table next to us ordering flavor combinations or possibly the waitress didn't understand her own menu. After over another half hour the waitress comes back with three chais that taste more like coffee and a white chocolate mocha after we specifically said not a white chocolate mocha, just a regular one. And finally, they even took their sweet time to give us the check. I could tell the patrons at the table by us were also getting frustrated as one of them told the waiter they were leaving if they didnt get their check at that precise moment. The incompetence and negligence I have observed at this hookah cafe was enough to assure that I will not be coming back. I have never witnessed such horrible service and if you dare to come, try to not come on a Saturday night because you will also most likely get frustrated.", "author": "Adriana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-28", "description": "This place is awesome! So low-key, so chill and perfect place to smoke hookah. You should go on weeknights when its not very crowded and you'll get to sit on the floor in their nooks. Their mint tea is OFF THE HOOK. I think our group of 8 got like 15 pots of it last time. This place no longer serves food (Even though I heard their ethiopian food was amazing!) but you should still check it out....", "author": "Preeya J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-11", "description": "So this is where Saturday night got started. We weren't even suppose to come here. We wanted to go to Marrakech, but when we walked into Marrakech it was DEAD! Just some old men literally rubbing up against a scary looking stripper turned belly dancer. So we said screw this and went to Nile instead. I had been here once before and was not impressed- probably cause myself and my friend were the only ones in there. But this time I really had an awesome time. It was chill, but an upbeat chill! Lots of people having a good time. Had the house tea which I thought was alright. But I'm not the biggest tea drinker in the world anyways. In fact I've only started enjoying tea the last 6 months or so. The play list was also pretty cool. A nice mix of Arabic, Turkish and Indian pop. Also a little American pop, which can also be cool. You have to love it when Believing by Journey starts playing and everyone gets excited- some even sining along. For our shisha flavor we chose guava, which was pretty tasty and smooth. No joke a crack head came in and asked if he could \"hit yo shit?.\" Nah foo, you cant hit my shit!", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-09", "description": "The sheesha is definitely the best I have smoked in the bay, they keep their hookahs extremely clean, and the tobacco they use is very high-grade, really the best smoke I've had in the bay...\n\nThe downside for me (as a girl going with 2 other girls) was the overabundance of men gawking at us...this is obviously more of a boys hangout, or might even fly if you go there with a co-ed crowd, but honestly, me and my friends felt very uneasy...\n\nThere really isn't any food here (and the waiters didn't know what was on the menu anyway), just tea/cafe, etc. which is completely fine - just remember it's a place to go after dinner or for a snack, etc.\n\nAnyway, loved the sheesha, didn't like the ambiance, but will probably return again with more of a mixed crowd rather than just all girls...", "author": "Rollio R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-13", "description": "Went to the Nile Cafe right after the St. Patrick's day parade. Originally we were going to go to Cairo Nights but despite the posted hours Cairo Nights was closed. So we went to the Nile Cafe and it was a much better choice. As we got there we were warmly greeted by our kind and courteous host Kume. We purchased guava flavored shisha and it was delicious. The coals that they use do not have any harsh undertones which is often common in hookah bars. Also Kume makes amazing smoothies and coffee drinks. Overall a truly nice experience.", "author": "Joseph N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-30", "description": "Best Hookah In town...Only four stars because I do not live close enough.\nGotta try the blackberry!!!!\nThis is the spot to chill with friends after dinner or before/after a nice evening!", "author": "arch v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-01", "description": "Even though it can get a little cramped, this place has a good vibe to it. There's a portion of the cafe where one can recline. That's a killer combo with shisha and hot tea! Fun place to hang out with friends and catch up. Not to mention the good middle-eastern music playing in the backdrop.", "author": "Arnab B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-14", "description": "not a bad place.  good prices.  hookah service was really fast (they keep a huge bowl of coals burning).  coals were maybe a little too hot though and hookah got a little rough.  lots of young people in the night time (i.e. under 21).  music was really loud.  not the most comfortable seating.  on the whole, pretty good bang for your buck", "author": "albert s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-27", "description": "very ghetto and scary late night.. we came to this place looking for a relaxing after hours spot, but instead were crowded around by a bunch of baggy clothed tweekers who were trying to rob us of our ugly girls we picked up from the club.. i mean this would have been a problem if they were good looking, so yea.. be careful who you bring here!", "author": "Jensen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-28", "description": "One of the best cafes around. The owner is an especially friendly guy who goes out of his way to accommodate his customers.", "author": "Faisal G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-02", "description": "my review is perhaps influenced by the fact that i'm not necessarily interested in hookahs. the atmosphere, however, was delightful - mostly because there were pillows everywhere. it took a while for our hookah to get started up, but the flavor selection had a nice, large, tasty-looking variety.", "author": "Jamie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-16", "description": "I Love this place! This place is really chill if you just ever want to relax sit down and smoke. I went here for the first time with my friend and we got the Peach flavored tobacco as well as the House Tea and they were both soooo amazing! The tea is really sweet and gingery and the Peach is really nice and soft. They had a range of flavors to choose from and I had no idea what to pick. Some of the mixed flavors they had were really interesting: Obama and Sex on the Beach...Anyway this place is really small but it is so chill, you have hookah and some nice tea(great combo btw!) and some really cool arabic/bollywood music. My friend and i came here pretty early and so we had seats to ourselves for 2 hours and it was nice. The waiter was also very nice and helpful. I find the prices are a bit pricey tho and that is one thing that bothers me. I am also really shocked that they didn't even card me or my friend, but oh well. I will definitely go back to this place late at night or in the very early morning if i just want to relax from partying or if im just chillin out with buddies. I recommend this place!", "author": "Clementine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-30", "description": "When you want a low key evening hanging out with your friends, look no further than Nile Cafe.   It's a cozy place where you can relax and enjoy a hookah while watching Middle Eastern and Indian music videos.  I love the tobacco mixes here.  They are light and smooth.  I've had the apple mint and the Nile Mix 1 which is fantastic (if you like a fruity flavor).   You should also definitely get a pot of the house tea.  It makes a perfect complement to the tobacco and has just the right sweetness.", "author": "Roy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-20", "description": "Honestly, I am no hookah specialist but I know what good tobacco taste like and it's Nile Cafe. The environment is outstanding and the service is great, the tea is amazing and the manager or maybe he's the owner made my visit here very welcoming! I loved my visit here and will return again when I come back to the bay!!", "author": "Mai H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-11", "description": "We went to this place yesterday with my family and we ordered two hookahs ( one mint and one jasmin mint) and one teapot of arabic tea, and the bill came out as $60!! Secondly, the service was horrible, the hookahs were served inside since outiside was cold and there was something wrong with their heat lamp. There are so many cons about this place that I do not know where to begin with. The place had these round little cylinders that were lightly covered with blankets as chairs, that were good and fancy, but not even in the same zip code as comfortable! The atmosphere gave me a very bad headache since they were burning the coals inside and they left it on a spinner next to the wall and every 30 minutes they would add new coals to your hooka. They had this small plasma tv that was relatively fit in comparison to the size of their \"cafe\" that played a previously-recorded DVD on a loop of some of arabic music videos, the music was loud and when we politely asked him to turn it a little down, he just frowned in the most unprofessional manner for a business owner and blatantly ignored us. They also had this group of the owner's friends who had a VIP lounge and were telling jokes to each other as loud as a PA system! It was like a radio Al jazeera that you couldn't turn off! The place was dirty and the the music was on a loop, and what's worse is that they don't ID you for hookah, this place should be reported to the police because they serve tobacco to underaged minors, I saw at least 8 arabic minors who were friendly with the owner receive hookahs, and I'm very sure one of them slipped some marijuana in it because the we could all smell it very well, Nile Cafe very professionally turned our great night around and made the entire experience in the city bitterly unpleasant. I do not recommend this place if it was the last cafe on earth.", "author": "Aryo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-05", "description": "i heart you nile cafe. thank you for being open late and having the best & smoothest hookah flavors evar. amazing...!", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-02", "description": "Very intimate classy sheesha joint. The best Sheesha in the Bay. The mint tea is like heaven.The owner is extremely friendly  and willing to bend over backwards to help us with our needs.  Great place to chill out after a hard day of work.   The place can be busy all week long. I remember one Monday it was packed!..so it might be wise to get there early to truly enjoy the ambiance.", "author": "Naa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-14", "description": "This was my first hookah experience and I must say, I was very pleased. The patrons were very friendly and answered all of my questions. The cafe is nice and small, and wasn't too crowded. Even though I know nothing about Hookah's or Hookah bars, the product was very tasty and lasted over an hour for 2 people. The Arabic teas was delicious. The music was also fantastic. If there was one bad thing I had to say about this place, it would be that seemed a tad bit expensive, but then again, what isn't these days? I'll be sure to return many more times in the future.", "author": "Dane K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-25", "description": "I have never been so disrespected as a customer before in my life. If you want to be treated like trash as soon as you walk in, then give this place a try. I feel like if I go into detail about my experience it will be giving them more credit than they deserve. Two thumbs down......", "author": "EGYPTO H."}
