{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "Very good bagel place! I'm not a fancy bagel person, I like onion or garlic bagels with cream cheese and that's it. I enjoy their spread selections, and while it's not a true NY bagel, it cures my cravings! Their coffee also smells and tastes delicious, I'm not even tempted to visit the Starbucks right next door.\n\n4 stars for the bagels, very good but not the best I've ever had. Extra star for the accurate calorie information available on their website! Who cares how delicious a bagel could be somewhere else if it's only good because they drown it in added calories.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "I like Noah's Bagels. What is the deal with Posh Bagel? I'm confused. In any case, there are some Noah's Bagels locations like this one still open. I got an apple cinnamon bagel toasted with strawberry shmear. It was very good and not overpriced at like $3.50. Noah's is dependable and has a lot of options.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "Whoa - delicious!\n\nI got a Sesame bagel and coffee. The bagel was the softest and fluffiest (while maintaining that nice bagel outer shell) that I've had in my entire life. I can't recommend it enough. The other reviews make me wonder if it was a fluke, but oh well. Hopefully you all can get just as wonderful bagels!", "author": "Nic Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "I'm a bagel fan, and a deli sandwich fan, which means that even though these aren't 'Authentic' bagels, I get stuff from Noah's a lot. They are fast and inexpensive and used to have some great sandwich deals (they may still, but I haven't gotten any sandwiches lately).\n\nThe people who work at this branch are the nicest folks you will ever meet. I had to pop in here and give a shout out to Erica - not sure her last name - but she was a one woman cash register operator this morning, taking orders, getting bagels, putting together boxes, all at the same time. Powerhouse! The other people were working double time, too. It was really something to watch!\n\nThe other people are just as great. They are all friendly, smiley, and very hard working. I see a couple of the women on the bus every now and then, and we always say hi.\n\nThe bagels and sandwiches are fresh and they even do catering.\nThanks, Noah's!", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "Horrible service. These you girls seem lost making the bagels. They made a mistake on my bagel and didn't apologize after not knowing what bagels belonged to my bf and I. They were unprofessional and rude and because of this my bf and i will no longer come to this location.", "author": "Lupita H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-10", "description": "I had a Noah's bagel back in the day when I worked downtown. It was never an authentic New York style bagel mind you, but it was a pretty good wannabe bagel. Fast forward to today, I was in the area running some errands and I ordered a toasted sesame seed bagel with butter on the side. I see that they have a sign inside that they pride themselves on their dough blah blah blah. This is a very POOR excuse for a bagel! They obviously changed the dough they are priding themselves with. The texture of the bagel is soft like a soft French bread roll NOT a bagel! This is a piece of bread shaped like a bagel! Shame on you! For those of you who never have tasted a real New York style Bagel, hop on a plan to NYC. Don't bother with this.\nAND I went to their website to see if there was some survey I could do and it stated that in order to complete the survey I needed a code on the receipt. HOWEVER, there was no survey code on the receipt! So, obviously the company doesn't care what the customer thinks. So, between the fake Bagel and the inability to complete the survey, they deserve 0 stars!", "author": "Review L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "While Noah's is a chain, this location feels like my friendly neighborhood bagel shop. The staff always remember my name and that means a lot to me. And on top of that, my bagels are consistently terrific.", "author": "Ross H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Who doesn't love bagels??? I always order the pretzel bagel and the Asiago bagel for him!!! The staff is very friendly and they kick out the orders on time.", "author": "Summer M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-09", "description": "Rude cashier. Came in to order a bagel and coffee 10 minutes ago, the cashier (Smaller skinny girl, nose piercing) blank expression on her face, no hello or any type or greeting. I asked if I could get the one bagel with the cheese on top ( it was the only one without a name tag so I couldn't tell what it was called) she looked at me as if I was stupid, shook her head and said \"I don't know\". Seriously? I don't think that I need to go out on a limb to nicer to her and make her feel better while SHE'S at work. Plus, they forgot to add cream cheese to my bagel.", "author": "Peter Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-26", "description": "I have learned that if you ask for your bagel toasted twice that they toast it to my  liking.  It still seems odd that you ask for two toastings, but it gets the job done.\n\nI like the egg white sandwiches, especially the Southwest Turkey egg white sandwich.  The classic egg sandwich version is also very good, it includes salsa.\n\nI come here often, and enjoy the speedy service. They do suck at fully slicing their bagel sandwiches in half though.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-19", "description": "Noah's is one of my favorite bagel shops for my bagel cravings. Plain toasted bagel with cream cheese and a cup of fresh squeezed orange juice - very delicious and satisfying. In addition to soda and coffee, they have boxes of juice and cups fresh squeezed juice available. If you are looking to pack Protein, Calcium and Vitamin C into your meal, then a bagel and juice is here for you.\n\nReasons for rating:\n- line wasn't long when I came in\n- friendly staff members\n- good service\n- clean facility\nOverall, positive first experience here!\n\nFYI: they have Free Wi-Fi at this location!", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-18", "description": "Gave this place a try just because it was walking distance from our hotel and am I ever glad we did! I saw negative reviews about not enough cream cheese and over toasted bagels... couldn't have been more opposite! We had 2 different bagels both toasted to perfection and a perfect amount of cream cheese and I love a lot! My husband got a sandwich on Challah and he thoroughly enjoyed it! So happy we tried this place even after seeing the negative reviews.", "author": "Ariana G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-08", "description": "I really like this place bagels, but they should wear gloves!!!! The cashier woman is ringing up transactions while preparing bagels; I wish she knew how much bacteria she is making us eat because she is not applying her food's handlers guidelines.", "author": "Ale B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-29", "description": "Food is fine thus the 2 stars. Employees stand around and chat and lack basic CS skills, like hello, eye contact, and/or thank you.", "author": "Nyla S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-11", "description": "I came in this morning to pick up bagels for my coworkers. I got a bakers dozen and then a half dozen because I have like 15 coworkers. I ordered what I want and the manager took a bag and put the bagels in the bag. I asked for a box and the person said that they were out of boxes, then I asked another person for a box. The person gave me a box, the manager said it won't fit all of them. I said I don't care at least put most of them in the box then the rest in the bag. Just putting them in a bag is not appetizing. I'm paying $25 at least give me what I want and not give me a hassle!", "author": "Alix J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-27", "description": "This place must be rated at a low rating because of its poor service. Seriously, this cashier greeted everyone in front of me with a \"hello, how are you doing?\", but when it comes to me her mood was all shitty! WTH. I did nothing but just waited in line to place my order. \n\nDuring my order, she carries a conversation in Spanish with her all coworkers about her birthday and how people should bring flowers... really? Smh...", "author": "Lani U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "A line forms here every single morning even before the doors open. People love their morning bagels. I just pick up a dozen for work along with 2 coffee jugs.", "author": "Sebastian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-21", "description": "Went there at 4:41 they told me they would not sell me a hot bagel they have to clean a very unfriendly about it I don't understand why they would turn off the toaster oven and it wasn't even 5 o'clock guy with the blue hair very unfriendly manager that was on duty unfriendly I patronize no was bagels all over and never had this experience", "author": "Jeannine P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-21", "description": "Terrible , just terrible!! I don't know what it is about Noah's in general because every single time I come into this place it takes 15 minutes alone just to move through the line!\n\nThere are 3 ladies making bagels and only 1 girl on the cash wrap for a line of 10 people !! The ladies making bagels asked whoever was in the back for help and no one has come out! \n\nIt's just ridiculous... This whole company needs a makeover !", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-07", "description": "Back again for the forth time and they still don't have bananas for my smoothie and no bagels. Why and how is this place still open?     And just came back again and still no bananas. Wtf is going on with this store?? I seen someone come in with arms full of bananas and they said they weren't for sale yet??? Don't go here it literally is the worst location. They didn't even have a onion bagel!!?? They only been open for 30 mins!! Get it together!\n\n\n\nGood thing I called be for I came. Because they still don't have bananas. I think it's funny that they always give me a different reason why they don't have them.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-09", "description": "Bought dozen but some are already sliced.\nMay be some used ones back in the case and re-sold to me. Some are slightly shrunk \nand don't look so good.\nTaste OK.", "author": "S S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-30", "description": "I can see why this place has little stars. They really could care less about customer service or even about what they are doing. Bagel was burnt with barely any cream cheese. Asked the lady to fix and she was irritated. I love Noah's bagels but I hate coming to this location as it's always the same!!!", "author": "Megan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-08", "description": "terrible service bad attitudes... I know a few people who would love to have their jobs... \nI understand running out of products, but when a person walks in you're allowed to speak and ask if they can assist us.\nThis  place has been going downhill for awhile... needs a thorough cleaning,  the employees need to wear gloves.  On a few occasions, it was noted that the heavy set female behind the counter continued to touch her face and then proceed to pull a bag out in an attempt to place some bagels in a bag...NOT for me!!  Food service employees need additional training on cleanliness... it's real important in this day and age...\nAfter this visit, I will not give them another chance to correct the problems I've written about in the past... just felt like writing in the event a manager or supervisor actually reads this!", "author": "deborah s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-01", "description": "Who needs cake when you can have bagels for birthdays!\n\nEvery 2 months, our staff celebrates birthdays from the previous 2 months.  We use to buy cake but I came up with the idea of having a bagel breakfast party instead.  Online ordering is super easy and convenient.  The bagels are always delivered on time (at 7:30 in the morning!).  This review is not only for the service and fresh bagels, but they included a fresh box of baked cookies with my last order!  At first I was hesitant about the cookies because #1 they were oddly shaped and #2 cookies from Noah's?  I took a bite and was hooked!  These cookies could probably go up against some of the cookies in well known bakeries.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-21", "description": "Craving a quick snack, I headed over to Noah's Bagels.  Seeing as they serve breakfast all day and I wanted some extra protein in my diet today, I opted for the turkey sausage and cheese breakfast bagel. Apparently choosing your own bagel from the display cost an extra 55 cents. Still, I just had to get the pesto bagel. It's been calling my name every since I walked in the door.\n\nThe restroom doesn't require a key, which is rare for this neighborhood and it's fairly clean in there aside from the slightly muddy floor. There are toilet seat covers and paper towels a-plenty for your hands. They use the foamy soap which I'm not a fan of because the smell can linger for hours...\n\nMy bagel finished rather quick and I grabbed a cup of cold water which is conviently located along side the other drinks. My bagel was alright at best. The sausage had no appeal whatsoever and was a bit too cheesy for me which is hard for me to say. Because the entire bagel was around 650 calories, I opted to eat half and save for later.\n\nAfter 3pm until closing, they have half of on coffee drinks which is nice if I need another pick me up.", "author": "George Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-02", "description": "I used to think of bagels as bad news. I used to blame it on the carbs, the calories and fat - but now that Noah's Bagels has made thier reduced fat versions of shmears and skinny bagels, I don't have to be a stranger to the morning bagel. \n\nI order the onion bagel with reduced fat cream cheese (250 cals) or go for the Bagel Thin with reduced fat cream cheese (190 cals). Keeping tracking of my calories allows me to use them wisely on other things. \n\nThe only thing I dislike about this place is the disorganization of the lines. You order in one and pay in another, they are always away from the counter and therefore it's hard to figure out where to order and pay. \n\nIf you are not in some kind of line or aggresively stalking a bagel, they will just skip right to whomever looks like they are ready even if you have been waiting. If you say anything, you get dirty looks like you are a grouchy morning person in need of a bagel. Which could be the case too.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-08", "description": "This location is ok. I love that it is at a shopping mall. I came here to get a bagel with peanut butter and a lemonade. It was good. The bathroom is ok here. This place may not be the best Noah's Bagels location to go to unless you are in the area or live in the area.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "Sandwhich taste yummy. Great Deal in the city for $8, Far better than the one you find at Safeway", "author": "Prabin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "I came by when it was almost closed on Friday. I wasn't really hungry but needed a snack. So I just bought a bagel from this place, I wanted a little more on the savoury side, so the guy recommended everything bagel to me. It was a decent bagel, soft in the inside and crusty on the outside.", "author": "Joan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "We are a local business and for the past 2 months we have a large order every Saturday. Noahs potreo hill is the place to get your bagels; the're always on time with there delivery. Their has been many times where we make the order with an hour or so notice and they always have our order ready before or by the time we get there. They are very helpful and with taking the orders to the car and always having a great attitudes. I recommend these guys for catering bagels for sure.", "author": "Rob O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-09", "description": "***This Noah's did not offer a great variety of bagels (my go-to here, blueberry, was not available); it was later in the day though; they did have a pretzel bagel here, which I haven't seen much; I purchased a gift card as well as a chocolate chip bagel that came at a good price (less than a dollar); service seemed pleasant enough, but when I asked to use the restroom, I was greeted with a slight pause and then a \"I just did something to it, there is a bad smell and you wouldn't want to go in there.\" To be honest and I could be wrong, but I think she was actually just lying (for what reason, I do not know); Trying to find a place to go to the restroom in Mission is not easy***\n\nThis Noah's is part of a huge retail plaza that also includes a Safeway, Jamba Juice and several other businesses; despite being in San Francisco, this retail plaza features a huge and free parking lot.", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-19", "description": "I always seem to order the chocolate chip bagel with cream cheese (http://www.yelp.com/biz_photos/CP5ZFig_e06EgR1GcJiUuw?select=3EnuzGtOMgjwOPGiksGKSA), sometimes getting it toasted. But, toasting does soften the cream cheese and eating it is messier. Add a regular-sized coffee (http://www.yelp.com/biz_photos/CP5ZFig_e06EgR1GcJiUuw?select=wTPZs1vw764wfCNbrBAoIg) and you're good to go (http://www.yelp.com/biz_photos/CP5ZFig_e06EgR1GcJiUuw?select=ENZ9-A_WIrBBr4tuG7sXFA) for the day. Nantucket fruit juice bottles are $1.99 a pop. A lox & bagel sandwich that comes with a small salad is $7.49.\n\nThis Noah's is bright due to its paint job and large glass window. The employees are friendly, willing to wait and not rush you. Not a lot of seats besides the counters looking out and a couple of tables for four. Located in the Potrero Shopping Center (http://www.yelp.com/biz_photos/CP5ZFig_e06EgR1GcJiUuw?select=9AJPdEGyjOyxVb0kjT8Alg), with lots of parking. Also lots of outdoor seating. Worthy of a visit each time visiting the center.\n\nNote: There's a  framed picture of the 1955 Brooklyn Dodgers World Series Champion team. It's not the LA Dodgers, so it's all good (go Giants!).", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-04", "description": "lie can get long, especially on the weekends\n\nnova lox!", "author": "Long C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-22", "description": "Nothing special. \nIt's like the Subway of bagel places. \nA bunch of options for combo style prices.\n\nThey had a cute patio area and the service was friendly but I'd rather take my business to a privately owned bagel shop who puts a little more love into their goods. \n\nOr maybe I'll just go to Subway and get a footlong for the same price. :P With more fresh looking avocado.", "author": "Nora N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-17", "description": "ALWAYS keep your receipt so you can do the survey after and get a free coffee.\n\nCame here on a Thursday morning.  Order Plain bagel toasted with salmon and tomatoe.  something told me to watch the production line (only 1 girl) make it and I saw her put cream cheese.  I stopped her and told her i didn't want the cream cheese so she gave me this pissy look and annoying threw the salmon aside.  From this point on, I HAD to watch every step she took to make my new sandwich (make sure she wouldn't spit on it).  she handed it to me and i asked for no bag.. another PISSY look on her face!!!  so i opened up the sandwich to make sure it was done right.  the salmon was all on one side leaving part of the bagel with just tomato.  WTF!!!  i completed my survey and gave them a bad review and asked to be contacted.  \n\nThe area manager sent me an email 1-2 days later apologizing for the staff's behavior and gave me a $10 certificate to come back and speak with the manager.  That was a great move on his part that I appreciated.\n\nThese production line people shouldn't behave poorly with their customers.  I work for a global company and we tend to give Noah's ALOT of business.\n\nI will come back this week, use up my certificate and will speak to the manager.  These people need to learn good customer service!!!", "author": "R M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-24", "description": "My go-to bagel spot for breakfast. \nIt's close to my job, the staff are friendly.. I just wish they'd toast my bagel a little more :(", "author": "Sara L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-31", "description": "First time here and i ordered a ham, swiss bagel sandwich. I couldnt hear the lady call it out it sat in the front for a while. I then took a bite into my sandwich only to find a squished mosquito chilling in the box ..... Never coming back here again. The cashier was nice thats the only bright side", "author": "Priscilla B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-06", "description": "They'll mess up your order then act like it's your fault. :( When they get it right it's tasty!\n\nThere aren't a lot of great bagels in SF, but service at nearby Katz's is better.", "author": "Amit G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-22", "description": "Noah's used to be good. I don't know if it's just this location but the bagels tasted like they were from Safeway. The transaction experience was frustrating too. The lady at the cashier was hard to understand, things had to be repeated multiple times and she still got my order wrong. Worst of all was the potato salad - the dressing tasted like Elmer's glue for christ's sake. I don't think I will come back again.", "author": "Wayne T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-16", "description": "Came here around 12:30pm on a Sunday hoping the service was as fast as it usually is... It wasn't. Very insufficient way of dispersing work. There's a separate 'Order' and 'Pay' here window. While the person in front of me didn't know what they were ordering I was trying to give my order to the person standing in the back so they can get started. She didn't speak English so she called another person standing around over to help... They didn't. I was told I needed to wait to order. I don't know why, but I felt irritated by that. They need to use the 'order' and 'pay' window some more to keep traffic flowing. \n\nEven though the food is great and it's only place I'll eat microwaved scrambled eggs I'm giving it 3 stars because the service was terrible for the situation. Two people standing around and no one would take my order even though I was next in line. \n\nBtw: the guy in front of me was getting a box of bagels with one person helping him. The other two could have taken orders to speed up the flow.", "author": "Krystle A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-05", "description": "This used to be my favorite place to grab a bagel and the Chelsea coffee but, over the recent months I stop going in there because the staff isn't as friendly as a used to be especially the African-American cashier. She doesn't come off as friendly and is very short with you even if it's not busy. I used to buy boxes of bagels and coffee for my pharmacy but after today I won't be going there anymore I will get my coffee and bagels from Safeway.", "author": "Jim W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-07", "description": "Bagels were good but I was expecting a cleaner establishment. There aren't many places to sit and most tables were dirty and sticky. I even wiped down tables but it didn't really help. There was a couple of items on the floor too. I also didn't see any compost and recycling bins either. Shaking my head.", "author": "Josie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-27", "description": "I love Noah's bagels. I can't seem to get away from them. An assortment of bagels (i.e. raisin, asiago, sesame, onion, etc) and cream cheese are delivered to our office daily. The only thing missing from the delivery are the big fixins you get when you go into the physical store.\n \nThe Potrero location works fine & dandy because there's lots of parking available, more so than the other SF spots located downtown. \n\nTwo things which get my day going great in the morning are the scrumptious breakfast sandwiches and a cup of their freshly squeezed OJ.  I tend to switch between the following:\n\n(1) Egg Mit w/ spinach, mushrooms, and swiss cheese w/chives.\n(2) Nova Lox & Scallions\n\nBoth are ultimate yums... especially when you pair them w/ a toasted asiago bagel. I like that it's slightly buttered & has the right amount of crisp to each bite. The Nova lox is sandwiched between a layer of cream cheese, sliced tomato, red onions, and filled w/ a few capers for a little bit of pickled tang to the bite. Either sandwich is complemented wonderfully w/ each sip of their freshly juiced OJ. Simply refreshing!!\n\nBottom line: you can't go wrong w/ Noah's for breakfast!!", "author": "Joy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-06", "description": "Could be organized better...but I always love their lox bagel!", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-03", "description": "Bagel was ok.  Staff does not understand the \"order here\"  sign, despite people waiting at sign,  they took orders at the \"pay here\"  sign.   I saw three people messed up by this and others walked past the sign and placed their order first. Minor irritant. Sandwich maker did not build a good sandwich.  Two tomatoes on one side, none on the other.  Ugh,  how hard is it to make a proper sandwich?", "author": "Dura M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-14", "description": "Called in an order and it takes you to a catering service who takes the order and then calls it in to the store.  I guess it streamlines the order process for the store level but seems to take longer to order.  \n\nOrder is ready and waiting when I get there. Fast and efficient.  Everything from the bagels, schmears, napkins & plastic knives in a small bag are packed and ready to go.  \n\nThe bagels are tasty and chewy. Some like them chewy and others not so much.  Personal preference but I can get them early in the morning when I need them.  \n\nEasy parking too!", "author": "Good D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-18", "description": "Blueberry bagel toasted smothered with blueberry whipped cream cheese.\n\n'Nuff said.", "author": "Serena F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-12", "description": "The absolute best bagels I've ever had. The 6 cheese bagel is not to be missed and certainty don't forget the various kinds of cream cheese available. You will not be disappointed.", "author": "Jerald C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-30", "description": "I love coming here for bagels...it's next to Peet's. LOL", "author": "Carla F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-12", "description": "The pumpkin bagel and smear is back...so good. Get here early on weekends or else you may have to wait in line for a while. Another thing that I like is the coffee drinks that they make here, the iced ones are better than the crap they make at starbucks.", "author": "Jorge P. G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-04", "description": "Dirty... and not in a good way because it's about food here people. The guy behind the counter who looked like he did too many whip its on his break put a tray of bagels (the ones you will pick out) on the recycling bin. YUM! I can't imagine what he is comfortable doing when he's not in front of customers.\n\nI also have to say for the money I paid for my breakfast bagel I was surprised at how little egg was in it. Are they trying to tell me I'm fat or they just stingy? I can get cleaner, bigger, and taste better. I'll go somewhere else.", "author": "Daria M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-14", "description": "A bagel is a bagel is a bagel.\n\nGood for hangovers - hard to mess up. \n\nThe people seemed to really not like their jobs here. Pretty entertaining to watch.", "author": "Ezequiel R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-28", "description": "Gummy and kinda bland. Sorry we ordered a baker's dozen. I was done after 1.", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-18", "description": "Pretty ok :))\ntheir bagels and sandwiches are good! for quick and easy on the go type of thing. I wish the restaurant was a bit bigger and roomier because when there is a line it gets too crowded in there. Customer service could do a lot better too..\n\nI do like their Strawberry Cream Cheese!", "author": "Sophia W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-02", "description": "I love Noah bagel but the guy who worked here on Sunday Nov 2nd AM at the order counter was very rude. I will not get anything from here again. If you decide to work in a restaurant, then you are committed to provide services to your customers.", "author": "Pim H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-24", "description": "You know, I like the taste of Noah's bagels just fine. And I gave this store a few chances to make me happy, but every time I go in there, the employees are rude, irritated at each other, and seemingly irritated at customers for trying to order. I leave feeling bad about my transaction every time I go, so I'm not going to go anymore.\n\nI wish mgmt would step up and improve the quality of their employees. It really makes for a lousy experience.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-26", "description": "It's been forever since I've had a bagel. I walked into Noah's and everyone greeted me while no one rushed me. I felt welcomed here. When I finally decided what to order, the cashier even asked me if I wanted to try out the spreads before I put them on my blueberry toasted bagel. I tried out strawberry, blueberry and honey almond. All winners! By I chose their strawberry one bc it tasted just like strawberry ice cream (my fave!). I also ordered a small coffee and found out there were FREE Bottomless REFILLS for any of their (3-4 selection of coffee). How good can It get? I'm a huge coffee fanatic and I must say their SoHo Dark Roast was not bad at all. I'd say their at least equivalent to Starbucks regular coffee. I got my bagel before I finished paying and my cashier (older lady) said \"here you go, Corazon (love in Spanish) when I'm obviously Asian. They totally stuffed my bagel with the strawberry spread too... mmm I'm in bagel heaven.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-17", "description": "This place is on my way to work, and I've been stopping by 2-3 times a week for a few months now.  The experience is always exactly the same:  \n\n- I place my order. Yes, the same one every time.  I'm boring that way.  \n- It's written on a yellow carbon paper form by one of several regular employees.  \n- The person asks me the same set of questions to clarify my order.\n- The person asks for my name.  I clearly enunciate the spelling.  It never winds up on the form.\n- I pay at the cash register.\n- I wait for my order.\n- They announce it by describing the order, because they couldn't figure out my name.\n- The food is fine. It's a cheap, decent meal near my office, so I keep coming back.\n\nSo what's wrong?  Nothing.  This place is just eerily fine.  Neutral.  Impersonal.  It's not like it's a requirement for a business to recognize its regular customers, or remember their names or usual orders, but it seems almost like the employees at Noah's must be instructed NOT to do so.  The tone is definitely businesslike overall, with no chatting or gratuitous \"how are you today?\" type of chitchat, but how can you see a person dozens of times and still have to ask for her name? And always get it wrong, no less.  \n\nSo yeah, Noah's is fine.  Just - fine.", "author": "Janna M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-26", "description": "Being a native resident and patron of lots of food services around Potrero Hill, I just read the reviews on Noah's Bagel cafe near Safeway's on 16th St.  Most comments are not flattering to say the least.  But inasmuch as I am just an occasional bagel eater, and no expert of what makes the best bagels, I have to agree with those unpleasant comments.  What seems to be a consensus is that the bagels, when bought before mid afternoon, are good with right texture.  But the service is definitely inconsistent due to high turnover and employees who just met bagels for the first time the day they were employed.  I love hummus.  Their hummus meets my taste expectations, but their version has entire garbanzo beans into what is supposed to be a smooth dip texture.  Microwaving any bagels should be considered a travesty.  \n\nDoes the corporation have any Jewish stockholders or key executives monitoring the chain anymore?  I can't blame the under paid employees and management.  There is obviously no corporate incentive to encourage employees to rise above apathy.  Most of us middle class consumers should feel lucky that bagels, cheese and other food items are not first made in China and then shipped to our local eateries. All of Noah's critics should aim complaints at headquarters of these corporate chains. Your concerns reach the top heads faster.  Top corporate heads usually ignore their employees at the lower pecking levels.", "author": "Lizabeth G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-23", "description": "Been here quite a lot, as it's close-by and for a quick bite it's convenient and cheap. The bagels are okay. Not great, not good, okay. They get the job done, but if you really enjoy your bagels then this is not for you.\n\nOther than the sub-par bagels, I have yet to have a satisfying item from the menu. The pizza bagels are disgusting and extremely greasy, the breakfast sandwiches are worse than dunkin' donuts. The coffee is pretty good, with some tasty blends. However half the times I've been there, most of the coffee was not available or not refilled. \n\nThe service is about as bad as it gets. The employees really like to ignore people, so placing an order, especially with FEW customers, can take a while. It's also set up very strangely, with 2 cash registers, but only one of them does transactions, and the other is for placing orders. It's very confusing and it creates 2 separate lines for no particular reason.\n\nMy order has been wrong countless times, and usually they will apologize and fix it, but sometimes they are very rude and are disappointed that I actually wanted my order corrected, acting like It's a huge request. \n\nIn particular, once I ordered a breakfast sandwich, and ended up with a bagel. I mentioned politely that my order was incorrect and asked for them to make it right. The woman behind the counter looked at me with a smile, and shook her head \"yes\". And thats it.. So i asked again and she again looked at me smiling and says \"Yes, Thank You!\". Clearly she doesn't speak english and thats a pretty terrible trait to have in the customer service industry.\n\nLately I've been putting grades for different aspects of the business at the end of my review, but It wouldn't make much sense in this case. This place is pretty terrible, and I really don't know how Noah's does so well.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-24", "description": "Dear Noah's Bagels,\n\nThank you for thinking of little ol' me. I can now enjoy your bagels along with my mommy and daddy. \n\nNow only if you can make a shmear for dogs...\n\nSincerely,\n\nTeddy, the always hungry Pomeranian", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-05", "description": "Always great service from the manger Rafael. I was happy to see that he has returned to this location and the service there is better for it.", "author": "Monica R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-15", "description": "Good food, bad service.\nskip over to another location unless you want the music so loud that you cant have a conversation as well as surly guys behind the counter.", "author": "Pablo K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-30", "description": "Stopped in to this bagel shop on a Saturday morning looking for a bagel, egg and bacon sandwich.  The sandwich was just fine and tasty.  Coffee was hot and good.\n\nWhat I don't get is why, with nobody in the restaurant besides me, the woman takes my order on one POS machine, takes my name and then asks me to move about 4 feet to my right to another machine to pay.  She actually moved to the POS device, looked me squarely in the eye and asked what my name was.  I looked around, like I was in some practical joke. I'm the only person in the restaurant AND she JUST TOOK MY ORDER!\n\nI don't get it.\n\nThe bagels and coffee are good, but they only get 3 stars for their stupid ordering and payment system and for the idiot cashier.", "author": "Todd M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-25", "description": "The bagels are good but the staff at this place operated like the 3 stooges. They ran out of blueberry bagels and didn't bother to tell me. I had to ask them why my order wasn't ready while everyone else was getting their orders, lame. I ask them why I was not told, they just looked at me like I was from outer space. The Bagels are good the staff is lame.", "author": "Jill T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-16", "description": "I stopped by here because I'm part of a collective that is looking into establishing Bagel Fridays at work.  Not to mention, I'd be able to have my fave bagel and eat it too.\n\nI love this location, despite the strip mall feeling.  My Safeway is here, as well as the Shoe Pavilion (hey, every woman's fantasy), a Jamba juice (my boyfriend during those warm summer months), and Noah's, my favorite chain that sells these heavy dense starchy rings of a 1,000 calories.\n\nI went in, where the service staff were friendly and asked if I needed any assistance, since I was bobbing along the display cases.\n\n\"I need 24 bagels to go?\"\n\nShe motioned to the already packed blue boxes on top of the display.\n\n\"$11.99 a dozen, with your choice of shmears.\"\n\nShoot, whatever happened to 2 bagels for 50 cents?\n\nIrregardless, I touched the boxes and it was still warm!  I nearly jumped with childish abandon.  \n\nI purchased two boxes and chose 4 shmears: Plain, Reduced Plain, Strawberry, and my all time fave, Honey Almond.  In addition, a large coffee.\n\nMy total was around $25 but worth every penny spent for the people at work (hey, smiles are the best rewards) and my own very soft, warm sesame bagel with a good shmear of the Honey Almond whipped cream cheese. My Friday of bliss, off to a great start.", "author": "Miika M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-30", "description": "I was a little sad that it wasn't better. HOWEVER, I was so happy to be eating a pizza bagel, I could barely speak.", "author": "Evan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-28", "description": "Their breakfast bagel sandwiches are pretty greasy. It tasted good but there was oil all over the wrap. I felt gross after eating it. I've been to bagel places before where it doesn't come out greasy even with meat and egg, so I know it can be done. I'll opt for something else next time.", "author": "Rosie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-21", "description": "The bagels here are just fine but the service is awful.  The management here clearly provides no training or understanding to the staff that the customers pay the bills.  More than once I've been left standing at the counter while several staff chat away, and today I was ignored for several minutes before an annoyed young lady came up and asked \"yeah?\".  The second girl who took my money didn't speak to me at all.  Not hello, no smile,  no thank you.  Nothing.  The location is convenient but that's all.  Why is everyone working here so unhappy?", "author": "Russell D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-17", "description": "This place has gone downhill over the past year. I think they're under new management. Staff is not knowledgeable and are rude. Today, I ordered an Italian Chicken Panini and it tasted like they put a rubber chicken in the sandwich instead of a grilled chicken breast. \n\nI can't vouch for the bagels, as I haven't had them in a long time. I'd definitely pass on the lunch menu though.", "author": "Sasha A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-01", "description": "Bagels are fine. The service is worthless. They don't seem to have a production line at all. Wait and order then wait and pay then wait and get your food. The iced coffee is about the worst thing ever. Thin and watery, kind of wish Starbucks would just buy them out already.", "author": "Alston A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-02", "description": "Order placed at 1:07, bagel received at 1:30.  They got the bagel wrong, but at least it included cheese and a few other things I specifically asked they leave off.  During the wait, I got to relax with an empty coffee cup since they were all out.  I'll definitely be back, but next time I'll speed up the process an order a \"any bagel that's convenient with whatever you want to put on it\".", "author": "Bernard W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-20", "description": "I'm extremely disappointed in this Noah's.\nI usually order a breakfast sandwich. \nThe cashier who took my order was not patient with me. \nI did not understand her when she said, \"sal,peppa, chedda\" (I could only understand salt and pepper)\nWhen I politely asked, \"Excuse me?\" She said it even faster. Then I replied with a ,\"Pardon?\" and then she said it even faster. You'd think she'd get the idea if she spoke slower. \nAnd to top it off, this sandwich was piping hot. The paper was stuck to the bottom of the bagel. It's not like the other hot bagel sandwiches in the past I've had in the past. \nSince I work in the shopping center, I'll be sure to avoid the Sunday afternoon shift. They seem to not like having customers at that time.", "author": "Cerina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-12", "description": "I'm normally a fan of the salmon cream cheese spread... when they're not so darn cheap about giving it to you!  \n\nI ordered the Asiago Cheese bagel with salmon cream cheese spread.  The result?  a rather dry bagel due to lack of salmon spread!  \n\nWe also had their Veggie Breakfast Wrap... a great consolation prize for the not-so-great bagel experience.  It was very hot with a slew of flavors kickin' with every bite.  Great!\n\nAs I was eating my way through my dry bagel, I saw a guy order a bagel and lox.  Having only visited a Noah's Bagels a small handful of times, I never knew they served actual smoked salmon.  I went back up and ordered me a sesame seed bagel, cream cheese and lox.  Finally, redemption.  It was exactly the breakfast I'd intended to have.  Thank goodness to that.\n\nAs for the service, I wasn't a huge fan of their approach.  They didn't seem interested, rushed me along my order, and just seemed somewhat unpleasant.  \n\nEven though I wasn't all that jazzed about my overall experience here, I'm sure I'll give them another shot at some point in the near future.\n\n3 Stars", "author": "Johnson N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-25", "description": "Make sure you clearly specify your order here, I said bagel with salmon smear, but ended up with a bagel sandwich with lox and cream cheese smear... I was trying to figure out why basically a bagel with cream cheese would cost $7.  Oh again... you guys just fucked up I was being nice by not being an asshole and sending it back.", "author": "B H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-04", "description": "This location is clean. I'm always satisfied with the bagel options, however customer service here is seriously lacking! Staff seemed indifferent and they messed up my order. The girl said\" I know it says we have caramel swirl but we really don't.\" Her supervisor quickly added caramel to my drink and apologized.", "author": "Lauren J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-10", "description": "Noah's Bagels is my choice when I want a more than just a bagel. I love their Egg Mit Sandwiches. Especially the spinach, mushroom, swiss. What does egg mit mean anyway? So good but the choices are skim -- I only ever choose from the egg mits.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-21", "description": "I ordered a bagel w/cream cheese this morning.  The cashier asked if I wanted my bagel in a bag, then proceeded to charge me 10 CENTS for a little bag!  I confronted him about this extra charge, asking why he neglected to inform me of this extra surcharge when asking me if I wanted the bag, and he told me it was the store policy to charge 10 cents per bag.  I said that's fine, but why wouldn't you inform me of the extra cost when offering the bag?  His answer:  We're supposed to offer the bag, then add 10 cents to your bill.  When I accused them of being sneaky, he told me he's just doing what his manager told him to do.  Customers beware!", "author": "Davey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-17", "description": "Mmmmm New York Bagels AND they give to the community. Winning combination!", "author": "Tina F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-23", "description": "Bagel stores just shouldn't be antiseptic and soulless.  But, a even homogenized  shop would be okay if the food maintained its quality.\n\nThat isn't happening at Noah's.\n\nThe rye bagel I had was Wonderbread spongy and only vaguely flavorful.  And, the sun-dried tomato schmear was sour and free from tomato flavor.  \n\nNoah has the mass-produced, corporate-yet-individually-prepared rap down in it's pretty and bright store.  But, it's a loser as a place to buy actual bagels.", "author": "Galen W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-17", "description": "My boss and I occasionally stop here to get lunch between meetings. The oriental chicken salad is pretty decent. The bagel dogs are decent too, yet pricey. \n\nLast week I had a breakfast bagel. The menu being so ADHD, I wasn't sure if it came with any kind of meat. Turns out it came with an egg, cheese of my choice, and a chew toy in the shape of a bagel. Woof! \n\nYesterday I had a hot beef jerky sandwich. They call it a \"hot pastrami sandwich.\"", "author": "Kevo M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-06", "description": "In a word, disgusting.\n\nThis is my second visit to Noah's and likely my last.  Each time i've ordered up one of there signature hot bagel sandwiches and each time I have been bitterly disappointed.\n\nThe problem is with both the ingredients and the way they are prepared.  The purported bagels lack any kind of texture and are more like rolls than anything else.  This time around I had the turkey sausage and cheddar breakfast bagel on a sesame whole wheat.  The sandwich was assembled with bland tasting turkey and cheese and then shoved in the microwave.  Of course anyone with half a brain knows that bread + microwave = disaster.  The bagel was rubbery and tasteless and the chives they added tasted weirdly synthetic.\n\nThe service didn't do anything to lift my perception.  I ordered up my bagel and they took my name and then I sat there and waited, and waited.  They called up order after order and I was getting bored and a little impatient went to the counter to find that they had already made my bagel but had captured my name incorrectly.  Tony has somehow become Sammy and my food had sat on the side getting cold.  When I presented myself and the confusion became clear the man serving the food told me that I should have been clearer with my name.  I know I have a crazy British accent but please, if you make an error recording my name please don't try and make out it was my fault!", "author": "Tony S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-26", "description": "The best bagel store found so far in SF\n\nUPDATE 01/17/2008: It's my moral obligation to inform that the workers don't pay attention to giving you the right bagels that you ordered. This has happened more than once.\nI CLEARLY and SLOWLY spoke the order to the clerk, while looking at the nice, pretty bagels laid out in the case that you are looking at. Then then proceed to walk to the back rack and take whatever bagels they want. The first time, a young man did it and I didnt' check (didnt bother going back, too far). Then second time a vet female did the same thing, but I said, hey I ordered 2 good grains and a sesame wheat. She said you ordered a plain. NO I SAID LOUDLY AND CLEARLY, SESAME WHEAT. It's like they dont pay attention to your order, make you repeat it and still get it wrong. So just be sure to eyeball what they are doing and double check once they give it to you\n\nI'd consider myself a top breed bagel critic, being from Brooklyn and living on that ish for 20 years (like most cyclists)\n\nGuess I've been bagel-deprived, \nYou know that  craving feeling, like when ya got a hankerin for a steak and once you tear into it, binge satiated...\nAte 1 and a half of the moist , fleshy , goodness (dry) while riding my bike/in the next store on a lower potrero post xmas jaunt. Then got home and 'did' the other 1.5 with some cream cheese that I applied myself,\n\n\nBagels are fairly large, fresh and come in a variety of types\nAvg Bagel Size (ABS) larger than Katz's in mission/2nd and lightyears ahead of Noahs in FiDi\nGreat Grains (various seeds on top make it look like bird food) was good and first choice\nCinnamon sugar is a hybrid bonut / dagel called v which u guessed it had cinnamony sugar on top\nSesame wheat rounded out the order of 6 for 4.39\n\nThe egg sandwich prices are 3.89 for basic egg and bagel, and they didn't even appear to have a greasy flat diner-y grill to cook em on, just microwave, blecch, so that's a definite pass\nJust get em dry, take home/office and schmear, or cook away with eggs , pepper jack and bacon\n\nNeed to try that house of bagels, but it's far, and that kinda defeats the whole purpose of a bagel, eat anywhere , anytime , quick fufilling nourishment with little/no planning\n\nPS: Don't know what's up with some other bad reviews of this particular location next to Safeway, compared to all else around SF, this place is waay better, makes one question their other reviews *could they just be whiners or is that just SF in general*?", "author": "G K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-26", "description": "It's a shame I can't seem to write a review for an entire chain, as opposed to just one location, because if I could, this place would be the first one up against the wall. I know calling out fellow yelpers on their opinions is poor yelp form, but I am shocked, SHOCKED, to see that this place gets an average rating of roughly 3 - 3.5 stars in the SF area. If there is one NY Jew out there who thinks this place clears 2 stars, I'd love to hear from them.\n\nThis place doesn't sell bagels. They sell bagel shaped bread. I'm not entirely sure where their process goes so far awry, and I'm not quite ready to drop that most egregious bagel accusation of \"non-boiled\" on Noah's bagels, but there is definitely something up with the consistency.\n\nOne thing previous reviewers seem to agree on is the low quality of service, at this and other locations. I'll agree with that. It's like a half a step above BevMo on the employee coherence meter.\n\nThe name. Noah's New York Bagels. I hate the fucking name. I hate that they refer to those as \"New York Bagels\" when nothing can be further from the truth (I don't think they even have locations in NYC). I hate that they stuck my perfectly good name on the front of there too. \"Should we call it Moshe's Bagels? No? Too Jewy? How about David? Not Jewy enough? I've got it, Noah!\" Most astounding of all is that when I've gone in to order a sandwich (which I've now foolishly done at multiple locations), the people behind the counter can't seem to get my name right! It's on the door fool!", "author": "noah c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-07", "description": "The past few years the menu at Noah's has exploded.  Multple knishes, pumpkin bagels, chocolate bagels, cranberry \"schmeres,\" reduced fat schmeres, egg salad, chopped liver, whitefish salad, dog bagels (not to be confused with bagel dogs, of which there are at least four \"regular\" and \"gourmet\" varieties), soups, three kinds of fresh bread loaves, pastries, bagel and pannini sandwiches, five fresh coffees, and on and on, all of which are okay and decent if somewhat bland and underachieving.  The stores are smallish so either they have a great distributino and cooking system or else there are some mighty overtaxed workers in there.\r\n\r\nOne odd thing is how they commodify old Brooklyn and things Jewish.  That's nice, actually.  As someone  vaguely ashamed of being ethnic my whole life it's nice to see that we're so marketable.  Someday I'll have my face on a bowl of cereal, Uncle Gil's white assimilation flakes.  Oy Gevalt.  \r\n\r\nOkay, you want real Jewish?  Read The Bialy Eaters (http://www.mslit.com/details.asp?bookid=076790902X) Mimi Sheraton's sweet but tragic history of the dish and the people who invented it.  Noah's sells Bialys too but I guess genocide doesn't sell like baseball does.\r\n\r\nOh, ample parking here.  Between Peet's and Jamba Juice in one of SF's few strip malls.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-28", "description": "This place was clean, and the service was quick, but when did bagels get so expensive?", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-07", "description": "Came here for a bagel sandwich on a Saturday at lunchtime.  The employee that took my order was nice enough but clearly incompetent.  I have very little patience when employees don't know their menu or \"specials\" clearly advertised at the counter.  She ended up charging me too much and for the wrong sandwich. All I wanted was the advertised $5 meal of a thin sandwich with a bag of chips...a long line started to form behind me as she struggled (language barrier on her end) to figure out what is (clearly) written on their ad placard.  Sigh.  I gave up.  Also, this place overcharges for their sandwiches.  Also overcharges for their beverages.  $2.79 for a Honest Tea, really?!  WTF.  To pour salt on the wound, the sandwich totally sucked.  What a mess.  Won't be coming back any more.", "author": "Tracy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-17", "description": "I guess it isn't cool or trendy to like Noah's, although I think it is both cool and trendy to start a review explaining how uncool or untrendy you are for liking a place, which therefore ensures your coolness and trendiness.\n\nAnyway, on those mornings when decadent brunch isn't an option, and when I hate whatever food I have in my house, Noah's is always there.  Well, not really there, as it is nowhere near where I live and I have to make the trek to the city to go there, and then I feel guilty for wasting the gas so I make sure I do something else apres bagel like go to the gym or tutor or something.\n\nBut I digress: I have been a fan of Noah's since high school, through college, through several teaching jobs, through 1.25 graduate degrees, and now here we are.  Now, I GET that Noah's is no New York bagel, especially if you are comparing Noah's to Ess A Bagel.  But, I also don't really care.  \n\nWhat matters to me is being able to get a whole wheat bagel, toasted, with Strawberry cream cheese, OJ and/or Coffee with minimal human interactions (for THOSE mornings if you know what I mean).  Noah's always fits this bill, even when there is some confusion as to where to place your order (this happened last weekend at this location).\n\nNoah's gets three stars, then, for consistency.  And comfort.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-24", "description": "Meh indeed. What is up with bagel places charging you a buck fiddy and not putting enough fatty fatty two by four cream cheese on your breakfast treat? \n\nIced coffee = burnt remnants of once-hot coffee + water.", "author": "Alyssa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-22", "description": "wonderful for catering breakfast.  The most cost effective solution I could find.", "author": "Gina I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-05", "description": "Oh, woe is me!\nHopped off the bus on the way to work to get my rave-reviewed tuna bagel sandwich for lunch.  It was 11:30am on a Friday.  When I ordered at the counter I was nonchalantly informed, \"Oh, we're actually out of tuna\".\nSERIOUSLY??  OUT OF FREAKIN' TUNA??!!  Half an hour before lunch rush on a Friday?  There were 6 employees standing around apparently doing nothing, and NO ONE COULD MAKE SOME TUNA SALAD????  Please understand, I was not told \"I'm sorry, sir but we're just making more tuna salad.  Can you wait 10 minutes?\".  I was not even told \"I'm sorry, this should never happen, but we just don't happen to have on staff right now anyone capable of making tuna salad, or any management capable of insuring that we are not without staples before a lunch rush begins.\"  Just \"Oh, we're actually out of tuna\".  Unbelievable.  This is like walking into a Baskin Robbins and being told \"Oh, we're actually out of vanilla\".  \nI own a customer service business, and I can say without doubt that if my manager/ staff offered this kind of horrendous customer performance, everyone involved would be fired.  I expect more from Noah's Bagels, and have gotten more from this location up until now.  I don't know if I'll bother to decide to spend my money there again.  If I do, a repeat of this kind of ineptitude will be the kiss of death for me.  There are too many options in  SF to put up with poor respect for customers.", "author": "Gary N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "The bagels here are delicious. They are a bit on the pricey side but they are worth it. -1 star for all the dodger memorabilia in the store. Go Giants!!!", "author": "Darius A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-25", "description": "Ya'll are haters!!!\n\nThis is my 'cheers' cause everyone really does know my name, and my order here.\n\nYou can get a bagel and an odwalla anywhere, but you can't get such love at every bagel shop. I love everyone who works here.", "author": "Danielle G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-04", "description": "Perfect example of a formerly good place to eat which has gone rapidly downhill in the past year.  My visit in early April 2012 demonstrated why this store is now so awful.  The order taker was disinterested, rude & slow.  The food took a really long time.  The bagel/egg sandwich had no taste.  It was just a bland, hot mess.  I used to really like Noah's & go out of my way to eat there because it used to be good.  Now, the bagels don't even taste like bagels.  A similar thing happened when Noah's used to have a location in the Castro in the late 1990s--& it went downhill with rude, angry staff & bad food.  They finally lost a customer in me", "author": "Robby B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-15", "description": "99 cents bagels, especially chocolate bagel! need i say more?\n\ni am a sucker for toasted bagel and cream cheese.\n\ni was really hungry when i went here and was on the verge of passing out so i decided to order a chocolate toasted bagel with a combination of peets. \n\nno complaints. :]", "author": "Anna P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-11", "description": "I've stopped into Noah's a couple of times after a safeway run or something to grab a bite to eat - and every time it's just so so.\n\nthe bagels aren't horrible don't get me wrong, but they aren't super great. I'd also steer clear of the jalapeo cream cheese.", "author": "David D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-01", "description": "Utterly disappointing. The bagels aren't actually proper bagels! It's bread with a hole in it. Although mine was made fresh, it still somehow ended up soggy in places. Don't waste your time, money or taste buds on this place.", "author": "Liz C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-13", "description": "I have never been to New York or the east coast.  i have lived in the Bay Area my whole life.  So I have nothing to compare this place to except other Cali bagel shops.  So for me it gets 4 stars because I like them.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-10", "description": "Waah .... So much hating on noah's bagels!\n\nI liked it? lots. Loved their lox spread and whole wheat bagel. But if you're feeling adventurous (and ready for the extra calories), highly recommend the pizza bagel. Crunchy but soft at same time. Yum.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-24", "description": "This is the closest bagel shop to where I live.. and that's slightly unfortunate. Although not amazing bagels -- still a hell of a lot closer to what you'd get at the neighboring Safeway. These are at least palatable (and as mentioned by every other yelper ever -- there's tons of parking) \n\nI also agree though with Sharon S. -- they have some audacity using the word \"schmear\" to describe their cream cheese. \n\nAnyway, I'm off to try Izzy's Bagels 2 next because Izzy's 1 in Palo Alto definitely does not disappoint.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-08", "description": "Everybody knows what they sell here, so why go into it.  Instead I'll point out the negatives.\n\n- The bathroom is always \"out of order\".  What's the deal?  Are too many homeless folks wandering in there?  Sucks for everyone else that has bladder problems. \n\n- The smell of piss lingers in the air.   I dunno if bums are taking their morning leaks in front of this store, but it sure does smell like it.  \n\n- Bagel dogs are super pricey.  I remember a couple of years ago they were $2.99.  Today they are $4.49.   Hmm... gas was $2.99 around the same time, now it's around $4.50.... hmmmm....", "author": "Larry A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-09", "description": "Ok so sometimes I like chains. Shit who doesn't like McDonald french fries. So one of my favorite things to do is on a saturday or sunday afternoon is to go grab some coffee from Pete's then grab a bagel with all the fixings. Cream cheese, lox, capers, cucumbers, tomato, onion. Yah it's probably not the best bagel place in the world but its yummy to the tummy and convenient.\n\nI used to go the one on sloat when I lived in the sunset now we go to the one on 16th. Grab some brunch get some coffee do a little shopping and have a great day.", "author": "Hyung L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-14", "description": "I hate to say it, but somehow this is a compliment, the is the worst place that I eat at most consistently.\n\nIt bagels, its bad for you, its a chain, its in a strop mall in the mission.\n\nAnd I love bagel dogs, I come here 1 a week.", "author": "Ken p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-06", "description": "This is the best Noah's Bagels that I know of. A lot of other Noah's I've been too appear to be staffed by homeless people. \n\nThis is a somewhat clean store, though seating sucks. Luckily there's seating outside, presuming it's nice out. \n\nThis is a good place to go for lunch. I even did a lunch order for my work here once, but they weren't good about getting the order right (we even FAXed the order in to avoid confusion). \n\nThey also have fountain drinks, which some other Noah's don't.", "author": "John S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-19", "description": "This place was horrible. The employees \"helping us\" were a bunch of a-holes. I just remembered this place when I looked up bagels on Yelp. The bagels were good but the service is horrible, it wasn't even busy in there. Either they had an attitude towards me or they were having a bad day but I won't be returning with my money anytime soon or at all for that.", "author": "Garrett B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-27", "description": "This place gave me explosive diarrhea while I was at work. Enough said.", "author": "M K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-14", "description": "This is a pretty decent place, good for what it was, and was probably a 3 star.  It's a chain, and it's not trying to wow you, so you can't hold them to something more than that.\n\nGotta give it 1 star or zero after the last time I walked in (6/13/2009) I saw the cashier handling money with her plastic food preparation food gloves on, then preparing food with the same dirty gloves.  Health code violation, maybe?  Yuck.", "author": "Adam C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-08", "description": "Food looked great. Service was terrible.\n\nOrdered a fairly simple order. Got no receipt which was the first sign of trouble. After a long wait was handed someone else's. After returning it I watched them make mine and give it to someone else. After waiting awhile longer they finally made mine again. Except they put chives on it, which are the grossest thing in the world and it was specifically ordered without them. Rather than wait (it was over half an hour at this point) I gave it back and said thanks but no thanks. Some dudes who seemed to work there gave me a free sandwich card for my trouble. I threw it away rather than risk another waste of time & money.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-12-07", "description": "Oy gevalt is right . . . Noah's doesn't come even remotely close to achieving anything that resembles either Old Brooklyn or Jewish - they're as bland as Uncle Gil's white flakes. What a waste of ample parking!", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-20", "description": "Mmm. bagel. Yum-o. I love their bagel dogs.  Don't get the plain ones though because it can be a little too plain even if you had mustard or whatever. I still ate it though.  Can be pricey though. who cares. Bagel. Good.", "author": "Mel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "my mom and I went in today and were helped out by the new asst supervisor, Dulce. this location needs more people like her working there! after a horrible experience yesterday with another lady that works there, I'm hoping Dulce's awesome personality will rub off on this other individual! thanks to Dulce, we will keep coming back!", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-07-11", "description": "ok, first of all, this is not anything like ANYTHING in new york city.  noah's new york bagels my ass!  second of all, this thing i ate here the other day was not even a bagel.  it was more like a roll with a hole in it.  i have decided that a far more appropriate name would be noah's perth bagels, because perth (the most remote city in the world) has \"bagels\" that were far closer to this noah \"bagel\" than any i ever had in my years in nyc (ps the bagel i ate in perth made me actually laugh out loud.  i think it actually *was* a roll that someone had stuck a hole in.)\n\nby the way, bagels are savory (not sweet).  and cream cheese is savory (not sweet).  the saltier and stinkier the better.  what's with all these flavorful sweet bagels?  they might taste good, but no.  not new york style!  also, no self-respecting new yorker or jew would actually use the word schmear (or however they spell it) or anything close to it.\n\nthis place made me angry and thus i am allowing myself to be self-righteous!", "author": "Sharon M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-04", "description": "They only get one star because zero isn't an option.  INCREDIBLY rude and uncaring staff and frankly their bagel sandwiches are awful.  Never again.", "author": "Cameron W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-11", "description": "Is the staff actually earning money??? If so, it must be peanuts! They often get the orders wrong, they don ' t care and seem really bored! Moreover the place looks filthy! Who really wants to eat in these conditions?", "author": "Anastasia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-14", "description": "So, this Noah's is near my work. I often stop by in the mornings to grab a peppercorn bagel or a fresh-squeezed orange juice or a nova lox sandwich or whatever.  I'm usually assisted by a rather unassuming  little guy. He always seems a bit intimidated by everything going on around him. Day in, day out the same thing.\nLast week, however, something was different. I got up and put my pants on one leg at a time as always. I had to take a cab because I was running late - just like always. But, when I arrived at Noah's something was different. Was I still feeling the effects of the 5 dirty martinis i had had the night before? Did I forget to put in my contacts? Wait - I don't wear contacts.\nThe unassuming bagel guy was now a bagel GIRL.\nThat's right. Tucked underneath that Noah's visor was a long, flowing ponytail. His (her) lips wore a striking shade of red lipstick and - most surprising of all - she (he) had become miraculously busty overnight.\nHmmm.\nI say again...hmmm.\nI love San Francisco :)", "author": "Jamie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-09", "description": "I went here earlier today with 2 of my friends.  There was nothing realy special about this Noah's bagel.  Some of the things they could have done better was carry the cheddar jalapeno bagels (disaster! they ran out).  Even the super onion bagels tasted less than par.  Also, their definition of \"toasted\" really means lukewarm as if it had been sitting in someone's pocket all day.", "author": "Brian N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-05", "description": "Ok, fine, I came back and found something decent: the Egg Mit Sandwich with nova lox and scallions on a toasted poppyseed bagel. The poppyseeds make up for bagel blandness. \n\nNow if only I could get them to apply \"not too much\" butter, which is not the same as \"no butter,\" or \"only butter.\"", "author": "Mia L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-10", "description": "While the bagels might be generally pretty good (try the spinach, it's delicious) I must say that the service at this location has been extremely hit or miss.  I've had entire orders done completely wrong and wouldn't venture outside of just a basic toasted bagel with cream cheese.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-22", "description": "This is not the best bagel shop I've ever been to, but I keep going back. Why? I'm a sucker for bagels and that garlic herb cream cheese! The bagels are usually pretty good, but they definitely do not put enough cream cheese. It typically is pretty quick, but the customer service is only okay. A lot of times, they can't really understand what I'm saying... and vice versa... so that in itself trips up customer service. What really saved this place for me was their coffee this Christmas season. It was called Winter Blend, and I kid you not, it tasted like WINTER!! It was cool and refreshing and spicy and perfect. I love coffee, and this was amazing. I'd go back just for that coffee.", "author": "Bridgette A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-08", "description": "If you like fluffy, pillowy, rolls, then this is the place for you.  Noahs Rolls.  That's more accurate.  Not bad, not bagels.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-16", "description": "My usual is a blueberry bagel, toasted with butter.  I think Noah's blueberry bagels are quite good.  Fortunately, an order this simple is hard to screw up and as a result they hardly ever do screw it up (the rare error being barely any butter).  Noah's also makes a good tuna sandwich, which I prefer on an everything bagel.  I personally have never had a problem or issue with the staff at this location.  They seem to run a pretty tight ship.", "author": "daniel g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-11", "description": "This place is what it is.  It's a chain.  That being said, you should be prepared to expect certain things.  Flavors that suffice the general population not simply 'bagel snobs.'  And that's what this place does.  Are you going to Pizza Hut for your New York style pizza fix? Or do you order Pizza Hut because that's the only crap around, only that delivers and only still open after a night of drinking?  (fyi - I don't eat Pizza Hut)  If you don't want to call it bagel don't.  If you don't like it, don't come back.  It's pretty simple, no?  New Yorkers, if it's so much better over there then form a collective and do it better?!?  Or simply stay in New York?  Overall the \"food\"(i.e., non-bagels) are good.  It's filling and tasty.  I like the bagel dogs though they are probably 1,000+ calories a pop.  I enjoy the breakfast sausage sandwiches as well.  Is it the greatest thing I've tasted in the world?  No. Did I expect it to be?  No.", "author": "Rafael s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-11", "description": "I haven't been impressed with the bagels on the west coast.  What is wrong with this city??? Why can't someone do a bagel right?", "author": "Jessie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-29", "description": "this place makes me really miss new york bagels.  and the prices are way higher than in nyc too.  i go here sometimes because i almost have too (routines and all).", "author": "e w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-29", "description": "the bestest freshest bagels in the citay! round an fluffy straight from the oven. my fave is the cheddar jalapeno deliciousness.", "author": "Hella M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-24", "description": "This is my favorite Noah's! The manager, Sean, is a rockin' good guy who really cares about the community!", "author": "megan p."}
