{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "I got a chicken shawarma  wrap with cucumber yog. It was pretty good. Chicken was decent quality but didn't taste like much. Nice fresh vegetables gave it a good crunch. Ordered it spicy but it was barely mild so get it extra hot if you need spiciness.\n\nSide of falafel tasted like falafel.\n\nI wouldn't seek this place out but would definitely come back if I'm in the area.", "author": "Johnny R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-12", "description": "Order: gyros - spicy. Result: gyros with no spices, no nothing. Just plain :(\n\nOrder: gyros - extra spicy. Result: the stingiest amount of spice.  Disappointing :( \n\nSpice is not my kryptonite nor have my tastebuds been colonized to only handle pepper. You would think when you ask for spice it would be included. \n\nLong time customer, very disappointed.", "author": "A. M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-23", "description": "If you're in SOMA and looking for a late night bite, Oasis Grill will hit the spot. It's not the best Mediterranean food I've ever had, but the gyros, Shawarmas, and falafels here are legit.\n\nOn my most recent visit, I ordered the Chicken Shawarma, which is like a Mediterranean burrito served in Lavash bread. Although the meal was tasty, the chicken was a bit sparse and dry... and the whole thing could've benefitted from a bit more spice. But then again, it was 10pm on a Monday night, there were no other fast-casual spots open near my hotel, and I was hungry/bordering on \"hangry.\" So when you take all of that into consideration, Oasis Grill was pretty much Shangri-La.\n\nI'd definitely give them another shot. Maybe next time I'll go for their lamb gyro.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-17", "description": "Location across from the convention center is how I ended up here. I grabbed 3 wraps. Good sized. Tasty. The foil will leak some sauce. A variation on the typical falafel in that it is in flatbread and not a pita. And they put some hot sauce in. Pleasant service. Clean. I enjoyed the food later on the airplane.", "author": "Harold L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Great place and fresh food- \nBest place to eat when at Moscone.\n\nSome of the best falafels and lamb shawarmas !", "author": "L T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "If you're pressed for time, do not spend money here. They take much too long for the quality of food served. \nWaited 20 minutes to get a mixed grill and 3 falafel to be served. \nThis our second  visit to Oasis Grill with similar results. \nDue to the location, choices are limited so there is no choice.", "author": "Geordie E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-18", "description": "On my feet all day at the Moscone and wanted some good eats within walking distance. Noticed Oasis on our way in and decided that would be dinner. Reviews were middle of the road in my opinion, but I said heck why not, I'm tired and hungry so let's give it a whirl. The other reviewers were right in terms of customer service, absolutely no violins with the cashier. She acted like our questions were slightly bothersome (it was crystal clear this was our first dining experience), annoyed look on her face, and she'd rather be doing anything else besides helping hungry folks get some grub. I ordered the lamb and beef gyro which was delicious. Too much lettuce and not enough meat, but it was dee-lish. The pita looked more like a tortilla so I was worried the gyro would disappoint, but it had amazing flavor. Hubby ordered the lamb shawarma, and it knocked my flavor-meter out of the park. Uhmazing taste, I immediately regretted my yummy gyro and wanted a shawarma lol. The sweet potatoes fries (barely a shareable portion) for $4.99 was just plain unacceptable. Not lightly salted, not crunchy (too much oil) which was fine, the price point was out bounds, add some potatoes or reduce the price. Sandwiches were great, totally worth returning but we will not, due to our cashier experience. My hubby who never comments or complains, even mentioned his unwelcome experience with her, so it's pretty bad if he comments lol. There's another Oasis location near our hotel, may try them tomorrow!", "author": "Candace C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-21", "description": "The first time I came the food was amazing, the wraps were delicious, the curly fries were full of flavor and everything was just great. I decided to come here again last Sunday and it was okay. The big guy that took our order was friendly (he let me put ice cream in the freezer) and the rest of them were nice as well. My only problem was with the food, it's not as great as the first time. The kebabs were good but the chicken shawarma were not chicken shawarma, it was shredded chicken mixed with some vegetables. I got two chicken shawarma wraps to go and they were wrapped in tortillas (?), the last time they were wrapped in Greek style pita bread which was way better. All in all, I might go here again because of their service and to try other menu items.", "author": "Shontelle W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-20", "description": "Very rude customer service! As I was placing my order over the phone I told the guy that barely spoke any English I want 3 shawarma and he kept repeating \" so you want 3 shawarma right?\" Yes yes yes I told you 5 times yes 3 shawarma! Kept me on phone 5 min when this could have been a 30sec phone call. Thought I'd give this place a try since they have multiple locations around me, but I guess there's a reason why all locations are 3 stars or lower! Shut this place down, truly Mediterranean is much better and worth the uber ride to 16th street", "author": "jay f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "The falafel is excellent. It's not the best location but they're super fast and the food is great. Not sure why the 3 star reviews but I've never been disappointed eating here.", "author": "Ben B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-19", "description": "Super fast service! Made after you order. Light & thin bread, but a little too much for my tastes. Some parts of the wrap had 3 layers of the bread folded on itself. \n\nI ordered the veggie deluxe, cuz after peeking behind at the counter, I had to try their falafel! It was good, not too fried. You could taste the veggies in it. As for the wrap itself, I loved how much veggies were in it, but would have preferred more grilled eggplant, since that was supposed to be the star of the show. Only had a few pieces which was disappointing. \n\nThey have a large selection of bottled drinks , including kombucha, teas, fruity stuff, and yogurt. I took forever looking at everything, that our wraps were done before I came back with my drink selection :p thats what you call fast service!\n\nLots of seating available. And tvs playing sports.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "Oh, man. This review is 6 weeks overdue. My mother and I went to this place six weeks ago from today. We went to Burlington Coat Factory down the block. She remembered that her niece or somebody told her of a Middle Eastern place around the neighborhood and so we went. \n\nWe both ordered Shawarma. I had the chicken and she had the lamb. I could show you better than I could tell you how good it was, so I uploaded a lot of pictures (with captions). I added 14 pictures. \n\nThe price of the meal was about $15, each, which is a better deal than a lot of restaurants who give you far less while demanding more money. After finishing my second Shawarma, I couldn't eat what was left on my tray. We ended up taking ours home.\n\nWould I come back? Oh, hell yea!", "author": "Justice A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "Walking into San Francisco for an event, a colleague and I were hungry as we headed to our hotel.  Looking at Oasis and seeing their menu, we headed in with a desire to have one of their menu items.  Looking at the diversity of their menu, it truly made us want something they offered.\n\nWe both ordered a Lamb Shawarma and ate in true delight.  The various items in it and the lamb made us very pleased with what we ordered. The Lamb Shawarma craved us to come back and eat again. \n\nLooking at their menu, it ranges from Shawarma and salads to diverse food dishes, side orders as well as desserts (Baklava) and drinks.  With it being Halal and creating a variety of delights, Oasis is truly an asset in every way, shape and form.\n\nPlus, the service was very well and they always ask how you are doing along with what else you might want!!  Next time I head to San Francisco, Oasis will, to paraphrase the 1960's Hippie song \" Truly be a favor being there!!\"\n\nBottomline:  As a retired teacher and educator, I grade Oasis with an A+!", "author": "Steve H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "Stopped by after Movies at Metreon. This place is one block away, we had to try. \nMixed Grill Plate.\nChicken, Beef, Kefta Kabobs. Greek Yogurt Cucumber Salad, Hummus, Rice and Salad.\nAbsolutely Delicious. \nHummus n Salad very tasty. Chicken not dry at all. Kefta was my favorite. \nIf I'm in the area, Definitely will return. \nTwo thumbs up.\nYummy", "author": "Pure M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "I go there when I need my food quickly. Mixed grill shawarma plate is nice. It has all kind of meat and kabob. Love their sweet, baklava and others. Service is very quick. Normally I get my order in 5-10 mins.", "author": "Salman M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-04", "description": "A decent casual mediterranean food place to grab a quick fix meal to go or to eat there. It reminds me of the kebab places in Germany.", "author": "Sophie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "Not only is the food here amazing, but they were really helpful and attentive, so definitely a 5/5 for customer service. They were really busy, but I had placed an order online when something went wrong with the website so they never got my order. Which was really unfortunate because there was a huge convention that day and the line was humungous. I had a hungry crew waiting on lunch, so I was sort of stressed out, but someone (owner I presume?) noticed and helped me promptly without making me wait in line.", "author": "Vianca N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-15", "description": "I have been coming here for lunch the past year and each time the food and service has gone down...Last time my Gyros had Little meat and all lettuce and wrap.at $12 its a Rip off..I Will Not be back..", "author": "Ken F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-08", "description": "Haven't been to any of the other locations but this one suuuuuccks. \nStopped by for some quick take-out Sunday evening on my way home. When I got home and looked in the bag I realized that instead of a gyro I got a wrap. Yes, they heard me and I ordered correctly. \nI was disappointed but still hungry so I gave it a go. The wrap itself was terrible. Halfway into it I finally reached the meat which was sparse, bland and room temperature. \nThe fact that I paid $13 for this bag of sadness made the sting even worse. \nJudging by the incoherent snaggle-toothed kid that handed me my order on the way out I can clearly see that this place does not give sh*t. \nYou've been warned.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-24", "description": "Honestly they deserve 1 star but 2 stars for service.  Their wraps are 95% sauce and yogurt. I got the lamb gyro I'm lavash wrap and only middle has good amount of meat. Rest was just one small layer of meat and sauce. Hard to eat with sauce dripping. Way over priced for what you get. Not recommended.", "author": "Kourosh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-13", "description": "I'm giving this place 5 stars because it's fricken amazing!! \n\nRight when we walked in it felt like Ferry Buildings Farmers Market. There was fresh vegetables everywhere. Everything was so neatly organized and restocked. I felt like I was getting healthier by the second! \n\nThe guy who took our order was nice. Did not rush us, but triple checked our order because my husband is a health nut so he wanted to make sure there was no sauce and the tahini on the side. I was the easy one. Just make it how it is and I'll be happy!! He even was nice enough to teach us how to pronounce shawarma. It was our first time there and we didn't want to butcher the name.\n\nMy husband ordered the chicken shawarma wrap. He said even though he had no sauce and the tahini on the side, the wrap was still excellent. The chicken was tender and juicy and all in all it had a lot of flavor. He liked how the wrap was full of ingredients. They were not skimpy one bit!\n\nI had the falafel wrap. I loved how my wrap was filled with fresh lettuce with the falafels. The first two bites I didn't taste the falafels, but every bite after that there was a ton! I also had the curly fries! \n\nWe would definitely come here again! There is no parking, but we parked at the Whole Foods parking lot and just walked.", "author": "Darlene M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-28", "description": "Solid option for mediterranean food. \n\nThey mezze plate is a good deal and the portion size is great. The dolmas are some of the better ones I've had in SF\n\nIf you live close by the delivery from here is prompt and the food arrives hot and fresh. \n\nThe menu is a little limited but this place definitely hits the spot", "author": "Matthew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "I got a chicken wrap , service was fast and nice and the wrap was in my opinion good and fresh. I would come back for more.", "author": "Simon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Oh man I ate my food so fast. 2 Chicken Shawarma and 2 cokes. So amazing and the guys working here are really nice and polite. Normally I do not write reviews but my belly is so happy tonight. \n\nDefinitely check this place out if you're hungry in San Francisco, great price for amazing food.", "author": "Nero D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-23", "description": "A-OK Mediterranean food.\n\nOasis Grill offers your very typical Mediterranean dining experience.  Shawarma and Falafel are the staple dishes with multiple varieties and sizes to choose from.  Oasis also offers a variety of drinks from standard soft drinks to more Mediterranean choices. \n\nService is a bit slow and food is a bit overprice.  But you will typically get enough food to make yourself full.\n\nNot the best in Mediterranean, but Oasis will still meet your expectations for skewer cooked meats.", "author": "Nadav P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-08", "description": "I ordered a roughly $11.00 gryo wrap and it came out with one thin slice of meat.  I complained about the lack of meat and the lady told me it was because it was a special wrap.  I had one bite and left.  Total rip-off.", "author": "Randall T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "Needed a quick bite and was feeling Mediterranean so decided to \"take a chance\" on this 3-star spot. WOW I don't think I've seen any other average star rating on Yelp be so far from reality. I got the falafel wrap and asked them to make it extra spicy. It was on \"lavash\" bread instead of the more common pita that other spots in the city often use and therefore was HUGE - bigger than 90% of the burritos you can find at any of the taquerias in the city. Inside it had just the right ratio of filling to sauce (tzatziki aka white sauce + hot sauce aka red sauce + hummus applied directly to the lavash). In addition to the falafel there was lettuce and lettuce plus some tomatoes and onions. I saw that they also had a vegetarian mezza platter with babaganoush which I absolutely love and asked for a side fully expecting them to charge me for it but they happily gave me a small container of it- note for next time to ask for it in the wrap while ordering.\n\nI will definitely be back and will be exploring more of the menu. Only thing I wish was that they had beer because nothing beats a nice beer with some delicious food but other than that WOW. I just hope this will help their rating - it'd be a shame if other people missed this incredible spot because of some bad reviews.", "author": "Karan H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-14", "description": "Worst shawarma ever. expensive and its not that good. ugh so annoying. i been wanting to eat shawarma lol its hella dry too!", "author": "Lara J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-25", "description": "Food was fine, but the customer service was shitty. Ordered a wrap and fries, and my fries never came.\nI saw the person from the kitchen putting my fries on the counter, but the cashier didn't even paid attention. I finished my wrap like 10 minutes after the fries were standing on the counter and I decided to leave.\nWhen I was leaving the cashier asked me \"You still have fries, right?\" Then I asked my money back for the fries. The guy didn't apologize and returned my money in a very rude way.\nI'm never coming back again.", "author": "Israel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-01", "description": "Good: Clean and pleasant service\nBad: The food is below average.  I have only had the chicken shawarma: dry boiled chicken, bland sauce.  The portion size was good.", "author": "Martin B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-09", "description": "We made an online order because we had just a little time for lunch, but we ended getting our order 40 minutes late. The cashier was absolutely not helpful and didn't do anything to help. And finally the food was not even average for Mediterranean cuisine. That was my last time at this place and you should also pass your way.", "author": "David O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-25", "description": "Now, I'm not anything close to being an Oasis Grill fan boy, on top of the fact that this isn't exactly a glamorous location, but I'm still kind of surprised by all of the mediocre reviews.  It's clearly not going to blow anyone away, but if you're in the area and have a serious hankering for some gyro wraps?  Not too shabby, friends.  Not too shabby!\n\nA mini-chain of sorts, Oasis Grill has five different locations in the Bay Area, though they're mostly concentrated around downtown SF (there's one in Berkeley).  While this particular one has a relatively decent amount of seating, they're primarily a grab-and-go type of joint.  However, the food is better than just convenient, as it more than satisfied my cravings both times I've been here.\n\n-- BEEF & LAMB GYRO WRAP and CURLY FRIES...$8.49 and $4.00, respectively\n(https://www.yelp.com/biz_photos/oasis-grill-san-francisco-2?select=GmwXMMVzicuI_MxYSStQ6A)\nOn the one hand, this really hit the spot.  Not only were the veggies super fresh, but the cuts of lamb and beef were quite flavorful.  At the same time though, I wish it had more meat!  As for the fries, they tasted fine, but it's hard to say just how good they were since they were a bit soggy by the time we got back to my friend's place.\n\n-- MIXED GRILL PLATE - Beef, Chicken, and Kefta (Ground Lamb) Skewers with sides, including Rice, Hummus, Cucumber & Yogurt Salad, Green Salad, and Bread...$16.99\n(https://www.yelp.com/biz_photos/oasis-grill-san-francisco-2?select=ACXAkXxyrIzwOpFyPrvFag)\nThe price is somewhat hefty, but it's both filling and a great way to try several things.  All three meats were pretty good, but I liked the kefta the best - kind of like a lamb burger patty and not at all gamey.  As for the sides, some of them were actually pretty interesting, especially the rice (it tasted like buttery popcorn...).\n\nAlthough Oasis Grill is a solid spot for a relatively quick bite, coming here should really be a result of already being in the area.   Street parking is at a relative premium and, while the 5th and Mission Garage is just a block away, this probably isn't/shouldn't be your ultimate destination that'd you be willing to pay by the hour for.  However, if you're already nearby?  Hey, you could do a lot worse.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "Yummy ! Food is light on my tummy. I like it ! :) I will be back ! \nI had a a chicken shawarma I recommend it. Good portions as well.", "author": "Vicky R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-18", "description": "Food: The food is above average overall.\nRating: Three stars\n\nService: This is a walk-up counter scenario and the staff will bring the food to you after your order is ready.\nRating: Four stars\n\nAtmosphere: The atmosphere is casual and functional.\nRating: Two stars\n\nLocation: The close proximity to Yerba Buena Gardens is convenient.\nRating: Three stars", "author": "K F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-15", "description": "I needed something fast, easy and inexpensive for a late dinner after a long day. Oasis was near my hotel so I popped in for a chicken shawarma platter. I was followed into the business by someone I assumed was a customer but who ended up just being a random guy who wanted to chat me up. Ugh! I distanced myself and found it annoying that no one in the business seemed to notice or care that this happened. \n\nMy friend was with me and she wanted a snack, so she ordered some stuffed grape leaves. I was surprised to see that they were pulled out of a large can. She told me today that the grape leaves were pretty mushy and I can't say that I was surprised. \n\nFortunately for me, my platter was quite solid. I didn't like the baba ghanoush which was served instead of a green salad (which is what is stated on the menu), but everything else in the platter (rice, chicken, cucumber/yogurt salad) was good. \n\nSan Francisco has tons of great food options, and I think I'd be more likely to seek one of those out over a second round at Oasis.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Most delicious food made with the freshest ingredients!! My favorite is the vegetarian Mezza plate (\"heaven\" on a plate)!!!", "author": "Tesla S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-12", "description": "I am still surprised this place is still open given the mediocre food, poor customer service, and high price menu. I only stop by this place occasionally when I am tight on time and this is the closest and fastest option from my office. The annoying part is you will randomly be charged higher price than what is being adverized on the menu. Their excuse is they have not yet updated the board and will refuse to honor the price they are still advertizing to the public. It has happened to me three times out of five I have been there the last year and is absolutely unprofessional. I don't think I will visit this place again.", "author": "Ilhama A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-30", "description": "Really friendly chefs, it seems that many customers here are regulars and the chef remembers their usuals. Price about 10 dollars. The burrito is very saucy, but you can get a plate and a fork if needed.", "author": "Lisa O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-03", "description": "The gyros are not Greek. They are rolled tightly like a burrito, stuffed with red peppers, and contain a spicy sauce-all not proper per the Greek gyro encyclopedia. They are also $11 plus tax  I also ordered a ginger ale and was charged for a kamboucha, whatever that is.  Luckily, I looked at the receipt and was given the difference (but not the tax). Stay away. This place is weird.", "author": "Soy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Come here if you like casual Mediterranean food at a reasonable price.\n\nOrder the chicken shawarma plate with Greek yogurt cucumber salad, hummus or baba ganoush, and rice.  They also add eggplant in the rice.  It was tasty.  Another option is chicken shawarma wrap.  If you like pita, it was hot and fresh from the oven.\n\nThe service was good as well.  We came in with a large group.  The staff rearranged the tables to accommodate our large group.  Towards the end of our meal, they gave our group Turkish delight on the house.      \n\nI would come back if I'm in the area.", "author": "JM L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "This place has the BEST chicken shawarma I have ever had in a long time. The first time I had them with my family we all enjoyed the deliciousness. I went to Oasis Grill again a few days ago just for the chicken shawarma and got 5 to take home for my family. We all loved it. The people that were serving were really nice, and respectful. It's the only place I would go to eat when I'm in downtown. Knowing it's Halal just makes it easier to go and get a bite. Hope to come again, InshAllah. I'd recommend everybody to go and try their Shawarmas=)", "author": "Fatima 4."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "This is totally the restaurant to visit for lunch, due to its close proximity to the Moscone Center & Metreon. Their Beef & Lamb Gyro and Chicken Shawarma (including the plate version) are all very delicious.\n\nI came in right after my workout session at the gym with the need to munch on a Gyro. Next moment, I found myself in here. I ordered the Beef & Lamb Gyro and munched away on it. This was certainly one delicious Gyro, I enjoyed it. Also, the portion of this Gyro is big enough to keep me filled until dinner.\nThe guys in the kitchen were very friendly and the lady doing the cashiering seemed very friendly. Overall, good experience here so I'll definitely be back. Oasis Grill - my favorite spot for Gyros and Shawarmas.\n\nThere are seats available to accommodate around 20-50 customers (I actually counted 42 seats). I thought this is a very good amount of seating for a restaurant in the South of Market area. As I have mentioned, it is close to several hotels, a theater and a convention center. Whether you work in a nearby building or just passing by, Oasis Grill is the restaurant to patronize. Especially when looking to satisfy your Mediterranean cuisine cravings.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "Good gyro, which is huge, very busy when there's a convention across the street. Nothing fancy but not bad.", "author": "Julio L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-30", "description": "I like the Oasis Grill by work on Market, but I wanted to try a new location. Decided to stop by the 4th Street location for lunch on Wednesday, July 22nd around 1:30pm. I got take out which took about 10-15 mins to make.\n\n*Mixed grill ($16.99): one skewer each of beef, chicken and kefta kebab plus sides - rice, hummus, cucumber & yogurt salad, green salad & bread\nI'd been craving Mediterranean food for a while, so this was great! I love variety so having one skewer each of meat hit the spot. I didn't get a green salad (not sure if it actually comes with one, but it didn't come with my order) nor did I touch the rice or bread, but I finished everything else. I was definitely satisfied and maybe a little too full after eating this meal. It was delicious!\n\nSo why 3 stars? The location. I don't know why, but it seems a little dirtier than the one on Market by 3rd. I wouldn't want to eat here. Other than that, the food was still worthy of 4 stars. But next time, I'll just go back to the Oasis Grill by work.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "Crowded place but efficient \nGot the order quickly. Curly fries and lavash falafel wrap\nWill be back when in the area", "author": "Pramee K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "I love this branch of Oasis grill. I sometimes came here when I was on this side of Lotta's fountain, and a rash of wrong orders sent me here for good from one of the other locations. I love this place. Rarely a deep line at lunch prime, I get my correct order, and the chicken avocado deluxe wrap is ridiculously good and filling. A+ for these good folks. I walk six blocks to get lunch from here and I do it often!", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-05", "description": "the food is fine, not exceptional. The service is scattered and disheveled. It might be a rush or something but a better system is needed for staff! I waited way too long for a simple gyro....", "author": "Phoenix F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-26", "description": "I grabbed a bite to eat here for dinner before heading into an event at the Moscone center. Didn't really pay attention to the atmosphere or any of that junk. I walked in, ordered at the counter. Waited for my food to be prepared. Then ate it. \n\nOasis is a chain. They're all over. It's also like most Greek shops with falafels, gyros and dolmas. I got a shawarma wrap this time around. It was good. Very solid spot to get a Greek fix when you're in a pickle, but you will pay a little extra since it is SF. Not a top must visit since it's a chain. I'd rather save money at a small time place, outside of the city.", "author": "Jeromy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-06", "description": "Greek on fleek! I came here with no real expectations. 3 stars can go either way, so I didn't have high or low expectations. There's like 3+ of these Oasises in the area FYI. Seems silly :)\n\nAnyway. They were very quick. I got a chicken shawarma wrap - spicy. It was somewhat thin, but long (hold the jokes). Still very filling. I was pretty full halfway through, but continue to eat it over the next hour because it was tasty. Yes, I graze like a cow sometimes.\n\nThe spicy was perfect!! Went so well with the chicken and sauce. Next time I want to try the beef/lamb shawarma. Maybe even the deluxe....but lets not get too wild yet.", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "Came here on a whim with a coworker and ordered the chicken shawarma with spicy sauce and it came out awesome! The portion was big in my opinion, after chowing down one of these, you'll be solid for a good while. The spicy sauce is what really makes this shawarma awesome.\n\nthe staff here is friendly and the person who made the chicken shawarma was like an artist, drizzling the sauce like he's painting or something, haha.\n\nThis is a casual spot so plenty of seating and wasn't busy, normally not busy and they're open late, past 10pm. Overall I'll definitely come back here for some good shawarma.\n\n*they also have a frequent buyer program, I think it's like buy 10 get 1? not sure...just know you can sign up for it.", "author": "Hao B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-25", "description": "This place is run by the same people as Ziggy's burgers but not as good. This joint focuses more on  Mediterranean food like gyros etc. I got chicken with rice that came in a tray with tzaziki, chili sauce, vegetables and baba ganoush. The food wasnt bad but the chicken lacked flavor. It seemed a little overpriced but the meat was halal so that is understandable. Not a bad place to go if you want fast food. Side-note: they use canola oil and can work with food allergies but have food with nuts.", "author": "Rida S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "Solid shawarma, tabouli, and hot sauce that keep me coming back.\n\nThis fairly large lunch spot is a little further from most offices, which makes the lineup a little shorter during the regular rush.\n\nOne important exception: during conferences at the Moscone center, this location is usually overwhelmed by people with nametags hanging off their neck -- would be a good time to check out their Market st. location.", "author": "Artem A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-21", "description": "TERRIBLE. The food is ok but the place is run by whole bunch of lazy morons. We ordered 2 shawarmas which were ready 10 mins and they just let us wait there for 30 mins while the food were just laying there. No sorry or any remorse for what they did. DONT EVER COME", "author": "Tri T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-11", "description": "Generally the falafel lavash sandwich is really good but today they decided to short cuts and ruined it. They decided to use pita instead of lavash and didn't inform at the time of payment, then they serve the sandwich half cold and half hot... Why the hurry? Let the pita heat evenly at least.", "author": "Snigdha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-22", "description": "Excellent beef shawarma. I had it 6 times during my week long conference. Chicken shawarma was not my favorite but ok. The grilled meat plate was good. Fries aren't that great, basic frozen shoestring that wont do much to brighten your meal. There tahini sauce is spot on, i asked for some extra on the side.", "author": "He M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "One of my favorite places to dine or order out. They have an amazing staff, great menu, and offer an exceptional experience. I love ordering from Oasis every time I'm in the city. Highly recommended!", "author": "Rami S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-18", "description": "Beautiful store on a corner with big windows. Unique offerings for sale by register like chocolate and baklava. Baklava was we priced and tasty and came in a beautiful to go container. Bottom was a touch soggy and sweet. Top crunchy and delicious.", "author": "Stefan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "These guys have a process for huge crowds I gotta hand it to them every big conference I attend at Moscone Center I know I'm going to get a yummy chicken shawarma wrap!!", "author": "A R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-02", "description": "Expensive for what you get. Dining room was dirty. I waited a long time to order, with staff ignoring me. I waited even longer for food... probably 20 minutes from the time I walked in. \n\nMy $15 kefta plate had only one small skewer of meat. The rest of the plate was pretty good, but nothing special. There are way better places very close by: Grove, HRT, Tropisueno, Garaje, Dennys....\n\nI will not go back. Dirty, slow, bad value for food that was just OK.", "author": "Adam R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-22", "description": "Convenient location, but below average food. The bread is very thin, and the flavor just doesn't do it for me.", "author": "Sean L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-30", "description": "Yummy shawarma!\nYummy baklava!\n...and a full selection of drinks and chocolates you'd normally see in Europe. \n\nThis is my standard lunch place when I'm attending conferences at the Moscone. There's another location in the financial district that I'd frequent even though it was several blocks from my office. \n\nShawarma - Fresh veggies and meats with spicy sauce all wrapped in a grilled soft wrap. \n\nBaklava - crispy flakes yet yet gooey from tons of honey\n\nThe ambiance leaves something to be desired. A jumble of chairs and tables. \n\nThe prices are reasonable. $12 for a shawarma and drink. \n\nI'll definitely be returning.", "author": "David S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-20", "description": "I hardly ever give bad reviews but here it is. The hours for this restaurant say that they will be open at 10 on Sunday. We came a little before 11, and they still weren't open. We could see them inside and they said it would be 5 minutes. We took a walk and came back about 20 minutes later-they will weren't open. Someone was outside and said it would be another 20 minutes but we just ended up leaving. We were definitely excited for the food but didn't even eat there.", "author": "Amy E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-20", "description": "We were searching for a veggie meal and a kid friendly place for lunch. They have a friendly staff the place has room for seating. We ordered the Mezza plate and a grilled veggie sandwich. The grilled veggie sandwich was yummy. The mezza plate had a very small portion of tabbouli, grape leaf with rice, hummus, yogurt/cucumber sauce, small portion of salad and pita bread and about four falafels.  I didn't care for the mezza plate. The veggie sandwich was great.", "author": "Ruby O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-16", "description": "I was craving for Super Duper during my lunch break and when I went inside, there was a long line. So I needed a second lunch option and so I saw Oasis. No line, woot.\n\nI ordered gyro falafel wrap and specifically stated, mild or no spice at all into my order. When I opened it, I was already smelling the spice and was like... this is not good. So when I took my first bite, boom, it was spicy as fuck! Like, I specifically state mild or no spice and yet they gave me a wrap that was so spicy. So disappointment when you spend 9 dollars for a food that you specifically noted to them that little to no spice and yet they don't listen. \n\nThe gyro was just okay. It could have been better. The spice overpowered the flavor or the dish itself. \n\nNot going to come back again.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "I've always loved Mediterranean food. I've always seen this place. It's only been a few years. But I've finally tried it. Not bad I guess. My kebab wrap was pretty good. I inhaled it before going to my car. Falafels were pretty good as well.. I'ldd definitely come back for the other dishes.", "author": "John Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-16", "description": "Came here the day after my first visit and they forgot to put the hot sauce in my wrap. Which was basically what I had raved about in my original review!\n\nNot sure if I'll be making the frequent visits that I thought I'd be making since now they're 2 for 2 on the messing up my order front.\n\n...Unfortunately I'm kinda expecting something to go wrong again on my next visit.", "author": "Tina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "This is located right across from the convention center. The meh reviews were a hint, but i was hungry, had just finished a convention, and wanted something close. I got the spicy shawarma and it was actually very good. The sauce has some distinct flavor and spice to it. Overall i think better than is given credit for.", "author": "Adam L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "I was pleasantly surprised by how great their wraps are! Walking into the place, it seemed like an average Mediterranean chain restaurant. My friend and I both ordered the falafel wrap, which was SO GOOD. The falafel was crunchy on the outside and soft on the inside-- just how I like it. The tahini sauce was creamy, and complimented the wrap perfectly. Also, the wrap itself was perfectly sized-- not too big, not too small. If I'm ever in a rush and have a craving for Greek food, I'll definitely pay another trip to Oasis Grill.", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "This place is delicious and fun.  Service is fast and pretty good.  Falafels are the best I've had in forever!  Good for vegetarians and carnivores.  Great selection of drinks and candy from Europe as well.  Went back 3 times in one week.  LOVE this place!!", "author": "R007s M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "Went to store at 9:30pm to try to buy something before a movie. Even though Oasis is not supposed to close at 10pm they were already closed. Ended up late to the movie as I had to find another restaurant. Lazy owners, will not be returning.", "author": "Teresa Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "The tabouli chicken wrap was a good lunch and break refresher for me this Saturday after class. All the flavors of the tabouli, hummus, and the kalamata olives worked with the chicken kabob.   As for the wrap size, it is a good lunch size dish that won't make you sleepy when you return to class. Oasis Grill may be a recurring habit soon.", "author": "Marck N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-06", "description": "It appears they are everywhere.  It's very convenient to the Moscone convention center, but that's about it.  Got a beef/lamb gyro.  Nothing really special, when they say wrap, they aren't kidding.  I was expecting to have my gyro wrapped in pita bread, instead I got it wrapped in a tortilla.  Inside was the meat, some veggies, yogurt and chili.  Chili was a surprise, luckily it wasn't too spicy.", "author": "Kent H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-05", "description": "I've eaten gyros here a few times and found them to be pretty tasty. The staff is great. \n\nStopped in for a gyro tonight (delicious) and after I finished eating, I lingered a bit to read for a paper I have to write...as I sat there, they brought me another gyro (all wrapped up to take with me). They had no way of knowing it is was my birthday, but I thought that was pretty cool.  How awesome is it to order a gyro and then to be given an auxiliary gyro?  Pretty cool in my book. \n\nI recommend this place!", "author": "Wayne S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-29", "description": "Against my better judgement, I came here because the spot was recommended by a number of people. \n\nNOTE: if you're thinking of going to Oasis Grill, don't go to this location, go to the others in the Financial\n\nThe food was about the quality of the ambience. It was about half a step up from Mcdonalds, and half a step down from Wendy's. \n\nWe ordered: \n- Veggie Mediterranean Melt (spicy)\n- Chicken Shawarma: Bland\n- Chicken Shawarma platter \n\nAll of it was 100% mild, and completely bland. I didn't even bother eating my whole lavash, despite being hungry.", "author": "Dimple B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "The improvement since my last review is far away from then...\n\nfood **** cost $$ service ****.\nGET IN LINE FOR THIS GYRO, FALAFEL AND SHAWARMA.", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-03", "description": "I passed this place, walked across the street, turned around and came back to it and didn't regret the backtrack one bit. I got the Chicken Mediterranean wrap to go which comes with grilled chicken, veggies and some kind of garlic sauce and it was really good. The wrap was huge so I only ate most of it. The chicken was good and tender and the garlic sauce added to the flavor. I like how the they grilled the whole wrap so that the tortilla is not super soft.\n\nOverall, it was a good last minute meal, the portions are big and it has good flavor.", "author": "Sophia Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-16", "description": "Average Mediterranean prepare to underwhelmed. Charged me 17$ for a falafel lavash, 2 baklava and a Coke. They didn't give me a receipt but I'm pretty sure they got my order wrong and charged me extra the falafel was a little less than 8$ which means I payed about 8-9$ for a Coke and 2 baklava I didn't even notice they had charged me that much until I went to a vending machine and my card got declined. Oh and they asked me if I want it spicy which doesn't mean any more than putting shitty grocery store hot sauce on the lavash. The falafel was broken on the inside. Cashier had pretty bad customer service skills looked very annoyed. So yeah don't go here I only went because it was across from my work but I won't ever go there again that is for sure.", "author": "Gabriel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-17", "description": "Pros:\n1. The lamb shawarma (7/10) and tabouli (7.5/10) were tasty.\n2. Timely service.\n\nCons:\n1. Consistency of babaganoush felt a bit off.\n2. Lot of gristle in the shawarma. The wrap was also a bit off balance - bites were either all veggies or all meat. \n\nSummary:\nOasis Grill was a fine stop for a quick bite, but not quite worth revisiting.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-25", "description": "I went here under the guise of pita filled goodness when I saw the words Gyro.\nWhat I received was a lettuce filled tortilla with lamb and beef. Of course it was already pricey, but I was very disappointed.", "author": "Tegan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "I like this place just fine. \n\nSeems to be a chain of restaurants around the city, so they must do something right. Major pro: it's just down the street from my workplace, and they have a vegan falafel wrap that is pretty tasty. I really like that they label it \"vegan\" on the menu so I don't even need to specify what I need. \n\nI do think the service is a little bit slow (10-15 minutes for one wrap, especially when there are no other customers around, seems snail-paced), so I probably won't be stopping by here too often for my 30 minute break. Other than that, the customer service is friendly and the food hits the spot. \n\nI would recommend ordering one other side if you are super hungry. I've had the falafel wrap twice, and the first time it was quite large, but the second time it was a lot smaller, very skimpy on the fillings. When in doubt, Oasis Grill, bigger is always better. ;)", "author": "Brandi W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-14", "description": "I'm in town for a conference and decided to pop in. The place is very unorganized and I didn't get what I ordered. Instead of a couple kabobs and lavash on the side, I got 2 wraps and lavash on the side. The order was taken by the person I assume was an owner or management from my side of the counter on a piece of paper. When I told the guy at the register what I got, he charged me for whole plates instead of the two skewers I ordered. I didn't hear the price when I handed him my card (it was loud in there) and he couldn't figure out how to refund me. He instead gave me $10 cash. This ended up putting my skewers at $10 each. Not happy with the incorrect order nor being overcharged. I tried one of the wraps and  it was pretty good. I won't be coming back for the rest of my trip. I would have expected better organization for a restaurant so close to the event center.", "author": "Rob D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "This is an awesome place to grab a bite. Fresh food prepared in front of you. If you are looking for Authentic Turkish/ Mediterranean food , then this is it! Their desserts like baklava and Turkish delights with rose, orange and pistachio will surely leave your taste buds in delight. \n\nWe ordered minced lamb kebab and chicken shawarma and it was phenomenal. I am glad to have discovered this place in SF.", "author": "Jay K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-03", "description": "Came here today with a couple friends before seeing a movie. Never have been here before and I've read some mixed reviews on the place. I ordered the chicken shwarma plate and got a bottle of water. The food wasn't half bad. I'm not a fan of mushrooms though and there were quite a bit in the food. The hummus was good, the yogurt was good, but there was some kind of paste in the top right (seen in my picture) and it was super bad not to mention it smelled. My friend got the wrap and it looked way better! The place was clean and the lady was nice, but I just didn't order the right thing this time! Next time if I drop by I will definitely grab a wrap instead!", "author": "James R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "Great food, quick service, value for money. \nBaklava is good.\n\nBig portions so you won't go back hungry.\n\nThere's a public parking close by, otherwise finding a parking space on the roadside is very difficult.", "author": "Honey T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-01", "description": "These ppl take advantage of drunk ppl- you purchase a $10 13 inch wrap and all you get a strip of gyro meat filled with salad and yogurt sauce. Ive posted a pic, hopefully you can see it see it but i would say 2.5 diameter the thin meat strip occupies less than 3% litterally. They know your druck so they'll but less meat and you wont mnow cuz all u wanna do is cram the thing in your mouth.\n\nOn a side note their wraps are descent if it had\nMore meat. 3/5 for wrap", "author": "Samim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "Excellent freshly cooked lamb gyro. The sauce was a light explosion of taste, you can taste every single ingredient that was put together", "author": "Susan A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-26", "description": "$11 for a mid sized shawarma wrap is honestly pricey! Also the place is freezing, I could use some heat to be warm at this time of the year. Tap water isn't offered. Menu isn't informant on drinks, chips and chocolates. I would expect a meal for $11. Most defiantly not coming back, first and last.\n\n\nBTW offer more meat than cucumbers, plus who puts cucumbers on shawarma!!!", "author": "Ali S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-01", "description": "I'm not sure why I had high expectations of this place. Perhaps it's so well-lit and on a prominent intersection, so I thought that their very survival was indicative of them doing something really well.\n\nFirst off... I read somewhere that this place was cheap. I'm not so sure I'd call it cheap. Upwards of $15 for a gyro, fries, and a Coke isn't exactly inexpensive, when you think of what you can get for $20, elsewhere. The gyro meat was a bit dry, the pita was a bit stale, and the flavor just didn't really pop. The fries were fine, but standard, and there were no sauces offered to accompany them. The ($2.75) 20oz. bottle of soda was about as expensive as you can find outside of a ballgame or a movie theater.\n\nYeah, thanks but no thanks. With a few better options just a block or two north on Market Street, there's really no reason to come back here.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-06", "description": "In short: overpriced, meager portions, mediocre food, and bad service. \n\nI was given the wrong number when ordering such that I essentially had to reorder my food after waiting for a few minutes. Plates are very small for the cost. The kabobs were fatty, dry, underseasoned meats.  Cucumber and tomatoes looked like they were a month old. \n\nUnless this is your only option during a short break while attending a conference, steer clear.", "author": "Andrew R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Best chicken shawarma in the bay, their falafel sandwich is kinda of good just need more sauce . But the shawarma is addicted.", "author": "Steve A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-07", "description": "While looking for a quick lunch option close to the convention center, I spotted this spot. I'm a sucker for Mediterranean fare.\n\nFor a first timer, the menu can be a bit overwhelming. You can feel a bit of of pressure as your spot in line quickly approaches the cash register. \n\nI went for the vegetarian mezze platter since it meant I could try the most menu items. The portion is quite generous. It could be ordered to share, split into two meals or serve as a very filling lunch. I chose the latter route.\n\nThough it wasn't the best I've had, the dishes were all very good. The atmosphere is nothing fancy and a little crowded, but it was clean enough.\n\nI recommend this for anyone looking for a break from the catered food that comes with conventions. It's very close, so you don't have to worry about being late to your afternoon sessions.", "author": "Leigh W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-25", "description": "Horrible gyros. It's not real gyros from a flaming meat spinner. No it's the cheap kind they buy packaged as slices then they throw on grill to heat and it was still cold tasting. \nI chose spicy but the untrained preparer put so much hot sauce it was on fire. Y don't u ask how spicy moron!\nOverpriced for cheap meat that cost them 50 cents!\nNeed a real Greek place damn it", "author": "Marcus Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-18", "description": "- 20 minutes to prepare a falafel wrap and a mezza plate \n- Our order was incorrect\n- The food is barely mediocre and obviously not fresh.  I'm amazed that Mediterranean food could be this bland.\n\nHow is this place even in business still?", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-30", "description": "I've been wanting to check this place out because of the shwarma. The last time i ate was years ago back home. The shwarma at this place was good not exactly the way i ate before but it had good taste and it was spicy (which was good and they offer if you want it spicy or not) The server was helpful and nice and the service was fast. Will go back sometime", "author": "Aaron G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "We were shopping in San Francisco. We walked by this restaurant and wanted to try it. Bought a shawarma and a falafel sandwich. Awesome food and as good as sandwiches back home. We will definitely be back. \nI wish they had their restaurant name on the white paper bags they gave us :). We sat at union square to eat the sandwices and a few people asked where we go them.", "author": "Z M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-19", "description": "I ordered Uber eats from here and they were so rude to me. First of all, I ordered the hummus bowl and the picture showed simply \nhummus and pita bread. There was lamb in it and if I ate meat, I would be open to try it but i don't. I also paid more for extra pita bread and they gave me none at all. When I called them to clear things up, the woman on the phone tried to tell me there was pita bread in the bag........ Then she hung up on me!! It was so rude and unprofessional. They took my money", "author": "Vanessa P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-17", "description": "A small corner restaurant with not so much seating area. HALAL.\n\nWe ordered our food and sat down. It's a bit pricey for the portions and the food in general. So right off, I wasn't impressed and was a bit let down. The food came and we picked it up and sat down. It was OK. I wouldn't say that it tasted great or \"authentic\" but it was cooked properly but was missing flavor. \n\nThe hummus didn't taste like hummus but more of the \"out of the can\" flavor. \n\nPricey and no real flavor...eat at your own risk!", "author": "Hina Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-19", "description": "Very disappointed with my 1st visit. Saturday evening and there were no other customers. It took 20 minutes to get a veggie plate and the order was still incorrect. \nFalafel was cold and not tasty at all. Hummus was OK. Everything else was not worth the $11 for the veggie plate. And the portions were paltry. \n\nI hope I caught them on a bad day. They seemed friendly.", "author": "Nina B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-04", "description": "Two stars for awesome service, one star for delicious chicken. -1 star for high cost, -1 star for wood slivers in my salad.\n\nOk, grabbed a chicken kabob salad for lunch (15! Ouch), for the price I expected an amazing lunch, but it was just ok. The chicken kabob was really delicious with a lot of flavor and it tasted fresh. However as I was eating my salad I kept getting black wood slivers stuck into my gums (painful!), the slivers were from the kabob sticks.\n\n*UPDATE: I have been up sick all night from the meal I had here, it's definitely food poisoning. Not so fresh I guess. I'll be getting my money back.", "author": "Miss M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-11", "description": "So like there was this really groovy movie made back in '68 called \"Wild in the Streets\" where the youth of America took over Washington, D.C., and an underage rock star was elected President when they put LSD in the water supply. What a trip, man. What does this have to do with Oasis Grill, you may ask? Not much except the place appears to be managed by the same apathetic youth in the movie if you just flash forward the story 43 years. I assume this location, formerly the gawd-awful Jollibee's, is related to the original one on Drumm Street across from the Hyatt Regency on the Embarcadero. \n\nI like the original place, this one not so much. The cashier really seemed bothered that I wanted to order anything, but I persisted and asked for a $7.75 Kefta Kebab, a grilled lavash wrap with a combination of ground beef and lamb, lettuce, tomatoes, and doused with tahini sauce (see photo). What was tasty at the original location came out as dried-out and nearly inedible at this one. So disappointing that I couldn't finish it - which as anyone knows me, almost never happens. Jamie W. was similarly unimpressed, and neither of us were happy that the tables didn't look like they had been bussed all day. I wish I knew to bring my sponge and Formula 409. \n\nFOOD - 2 stars...a kebab that went kaboom \nAMBIANCE - 2 stars...anyone know where I can get a mop? \nSERVICE - 1.5 stars...some vocational guidance may be needed here \nTOTAL - 2 stars...think I'll need to haul my butt to Baladie if I want quality lavash wraps", "author": "Ed U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-03", "description": "Preface: came here on Labor Day for dinner given the slim pickin's open out there. They didn't have any fahtyre on hand when we went, darn. Falafel is kind of meh - it's not as flavorful as a lot of other places I've had; maybe it's their sauce as well? Also, their fattoush salad is a bit of a lie. Instead of the radish and red onions (among other ingredients) listed on the menu, they threw in olives, along with red and green bell peppers which appeared to be a part of one of the salad mixes in the bins. Worker said the radish was not in season and they didn't have red onion... Gonna skip this place in the future. :/", "author": "Linus W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-17", "description": "This is the 2nd SF location of this Mediterranean food chain, it took over the corner that used to be Jollibee. Same standard menu: shawarma, gyros, falafel, hummus, etc.\n\nThe space is larger. But I like the original branch near Embarcadero Center better, because it has friendlier service.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "Excellent Food\nImpeccable Service\nChill atmosphere\nCheck this place out if your in the area!", "author": "Wana A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-05", "description": "3* Oasis Grill\n200 4th \nSan Francisco\nMiddle Eastern\nFast food, healthy\nTasty Chicken shawarma\nNice Greek salad\nOrder at counter; crowded at lunch time", "author": "Rosquete B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Quality of the falafel wrap here is greatly improved. Wonderfully made. Perfect heat.", "author": "Keane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Great gyro and falafel.  Had been traveling all day and needed a quick bite.  Service was quick, fast, and polite.  \nFood was hot, fresh, and lots of flavor.  Ended up going back two more times while visiting buds in SF.", "author": "C. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Everything is made from scratch here. Thoroughly enjoyed the beef shawarma. Super delicious and fast. Great for gluten free, and they were super helpful verifying ingredients for another allergy.", "author": "S D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-11", "description": "Awesome falafel wrap. Tried the beef and lamb wrap with their hot sauce, so good. Their Greek salad was missing olives -1.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Quick and easy and great food. The fatoush salad with falafel and hummus substituted for chicken is a great and filling veggie option. Also enjoyed the eggplant and pomegranate wrap.", "author": "Nikolais L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-09", "description": "Gyro wrap was not bad, filling and pretty tasty. Would probably get it without the spicy sauce next time. \n\nWent around 2pm and there was no line, but I imagine it gets extremely busy during lunch hours.", "author": "Stephanie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "Never disappoints.  While not the absolute best Mediterranean food I have had it is always solid and consistent. I always ask for extra spicy and they don't hold back on it.  The Shawarma is my favorite and have had a few of the plates on occasion. Perfect to go or to eat in!", "author": "Chris G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-12", "description": "Good food. Unfriendly service and dirty tables (we had to clean our own while the workers behind the counter did nothing).", "author": "Randy F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-23", "description": "Disgusting. Ordered the spicy Shawarma, and as a world traveler, this was hands down the worst.  Never again", "author": "Edwin G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-16", "description": "Atmosphere and service : C-\nFood : B+ \n\nWe came here for dinner a few nights ago. The restaurant was empty aside from our party, and the door was wide open in 40 degree weather. When my mother in law asked them to close it while we ate ... He had to check with the kitchen. They did close the door eventually, but I found it off putting that the comfort of dine in customers was less important than that of the staff in the kitchen. \n\nThe food was excellent! i got the beef shwarma plate, and it was fresh, hot, well portioned, and delicious. Be sure to try the Harissa hot sauce with your meal. It's excellent! I also loved the Baklava. Great recipe. \n\nI would recommend this spot for a quick lunch, not a sit down dinner.", "author": "Katie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-03", "description": "This place sucks Royally!! There veggie plate is $11.00 & it's not even organic veggies. Over price junk franchise, not really good quality food. Same garbage that's over priced.", "author": "Repent Seek Salvation Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-14", "description": "Got so distraught as we were eating and some crazy man came in and started digging in the restaurant trash bin. nobody from the staff noticed...and he started yelling at our table because the table was stationed by an exit door. So crazy man, got mad at us diners. \n\nOne of my friends had to get up to get one of the server's attention.\nSo yah. that's kinda crazy. \n\nAs for food though... pretty slammed with meat.My boyfriend and I ordered a chicken and beef shawarma.. The tzatziki sauce was yummy... The beef though was more tasty than the chicken. It wasn't extraordinary..and it wasn't bad. It was decent. \n\nFor this restaurant to take over the old Jollibee? hmmm... i wish they kept Jollibee.", "author": "Monica H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-25", "description": "I ordered a beef and lamb gyro and what I received was a cold, soggy, pile of poopoo. But seriously, it took like 25 minutes to get my food and it wasn't even the lunch rush yet. By the time I got my food it was cold, the pita bread was soaked through because of the mess of tzatziki sauce they put in there, and the \"beef and lamb\" they put it in it tasted like a hamburger patty.\n\nPossibly the worst gyro I've ever had.", "author": "Angelo D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-18", "description": "I was craving a lamb gyro for lunch and thankfully, Oasis Grill was a 2 min walk from me.  When I walked in, I was surprised to see it was pretty dead since it was lunch hour.  The girl who took my order seemed very negligent, she just hands me the cc receipt to sign without saying anything and walks off to make food.  So I just signed the receipt and left it out on the counter.   Even though there were only 4 or 5 people my gyro took about 10 mins, and she forgets my hot sauce.  I couldn't finish my food not because I was too full, but because it was bad.  The gyro was bland even after I poured two containers of hot sauce.  The lamb which was nonexistent, was dry.  I felt like I just paid $8+ for plain lettuce and tomatoes.", "author": "Erica C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-29", "description": "The gyros aren't that great. The meat is dry and the service is slow. They only survive because it's right next to the Moscone Center so they get a huge rush during lunch hours whenever there is a convention in town.", "author": "Binh D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-15", "description": "food is ok \nshawarma was cooked on grill \ndoesn't taste like the one that  is cooked on shawarma grill\nand also the seasoning  sucks\nbeef shawarma tastes like Korean beef", "author": "Carla L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-26", "description": "FOOD POISONING is the experience my friend and I had at the 4th st Oasis Grill.\nWe BOTH ordered the (expensive) beef Shawarma and BOTH got sick 12hrs after that w similar symptoms, the ones you get when you eat sh*t.\nThis place needs to be inspected asap.", "author": "Eolus C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-15", "description": "Had the Kefta Kebab platter. Was OK, but problem was about an hour later got stomach ache and needed a trip to the bathroom...", "author": "Tinou B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-16", "description": "Good promise but soggy and too much spice to taste the meat. Given the manual ordering a lot of mistakes for large group of people. \n\nSalad looked best of all.", "author": "Leo U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-01", "description": "Is this Oasis Grill owned by the same people as the Oasis Grill on Drumm?  If so, they should enhance their training program because this location's food does not stand up to the food at the Drumm location.  If not, whomever is making the food at this restaurant should go over there to see how it's done right.  \n\nI work around the corner, and was excited when I saw that there was an Oasis Grill near by.  I used to frequent the location on Drumm street all of the time before my office moved, and it was amazing.  Anyway, I ordered a Chicken Schawarma Wrap.  At under $9, it's a pretty good option for lunch in the area.  Also, they give you a pretty big portion.  The flavor was nice, but there was way too much sauce in the wrap.  I think that a wrap should be able to be consumed without using a plate, or 75 napkins, but the minute you bite into this wrap, the sauce gushes all over the place and the wrap starts falling apart.  I'm not a chef, but if you lighten up on the sauce a bit, the thing might stay together, be less messy, and taste better.  \n\nI would go back to give it a second shot just because the flavors were OK, but if I get another sauce bomb, I'm donezo.", "author": "Nick T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-28", "description": "The one star is only because the food is tasty. Negative 10 stars for \"Rebecca\" that is apparently the manager at this location. Here's the conversation between us:\n\n\"I'd like a chicken shawarma please. Can I get it in a bowl please? I don't want the wrap\"\n\n\"We have the platter for $12.99\"\n\n\"No, I want to shawarma, which is $8.49. But the contents in a plastic bowl\"\n\n\"Okay but you will be charged the platter rate\"\n\n\"What? You want five bucks to not do work?\"\n\n\"Yes, it's the laying out of the contents in a platter that costs money\"\n\n\"What if I was gluten intolerant or allergic to the wrap?\"\n\n... Blank stare. Then \"then you'd have to pay for the platter\"\n\nOwners of Oasis Grill, if you're reading this, please don't hire people like this at your two new locations. Please please please. Hire someone who can use the brain that nature has provided us.", "author": "Kunjal R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "Good quick place to eat. Efficient services and great shawarma.\n\nThey take your order as you stand in line. Really a good system when it's crowded.", "author": "Kyler K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-22", "description": "Food is nothing short of fantastic. Friendly staff. If I lived in San Francisco or stayed longer, I'd come here again!", "author": "John A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-29", "description": "After passing this place so many times while walking along 4th, it was about time we tried this place. Walked over on Thursday night and it wasn't very busy at all. I tried the falafel wrap since you've gotta have some good falafel's in a Mediterranean place right? It was ok - not great, not horrible. The wrap was filled with cucumbers - which I hate, so that made it a little hard to eat, I had to dig out the falafel to give it a fair try. The menu didn't show a list of ingredients so I guess thats my bad for not knowing what would be in there. I also had a side of hummus which was just ok as well...", "author": "Leina K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-26", "description": "Food was just plain okay, didn't particularly taste like Mediterranean food. A Chicken Shawarma for less than $10 though, guess you can't complain about the prices.", "author": "G G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-09", "description": "I Love SF!  All the great, diverse culinary choices open late and just a stroll away has my heart!\n\nOrdered: \nGyro plate - The gyro meat was seasoned to perfection, the wrap was a nice thickness and texture.  This gyro has me thinking of the cart in NYC that ruined my gyro experience anywhere else.  This gyro however brought back all the great memories of what a gyro should taste like!\n\nCome here if you're anywhere nearby!  It's that good!", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-04", "description": "Yikes, how can a chain have such a broad quality spectrum? The Oasis Grill on Drumm street is MUCH better. This one, MEH.\n\nFor one, the fries are soggy! Gross.\n\nI came here twice. The first time I got the lamb & beef gyros it was pretty good. I thoroughly enjoyed it. It's about $9, which is the norm. But the fries I got were really bad. I got them to go, and I'm not sure if that was the cause for them being soggy, but I ate them within 45 minutes. And if fries get soggy that soon, that's not ok!\n\nThe second time I steered clear of the fries and got the gyros again. And oh my was the gyros terrible! It was bland, the meat was burned, and it as like eating a lettuce wrap with no flavor. I asked for it spicy and I tasted no spice. Absolutely disappointing.\n\nThat's something that is unforgiving. There are other Oasis Grill's around that are far better quality!", "author": "Junel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-17", "description": "Oasis Grill is pretty great. I just had it for lunch today! It's one of my favorite lunch spots near my work or near Union Square. The food is pretty good here, but my absolute favorite thing to get here is the Veggie Mezze Plate. I am obsessed with their falafels and the selection of mezze. All the mezze items are fresh and tasty. I love taking little chunks of the falafels and little spreads of all the mezze on a piece of pita, and stuffing it all together in my mouth, and I feel so comforted. And even when I take it home, and everything isn't at fresh, it still tastes so good. LOVE this plate. I know a lot people like the shawarma here, but I cannot live without the veggie mezze plate. I just hate that is is so close to Moscone. And so when conferences happen, I can't eat there or I have to wait in such a long line!", "author": "April D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "Best Mediterranean food I have had in a long time! Shawarma was juicy and all the veggies were as fresh as it gets. Most of the places I go use pita for the wrap but the wrapped in a lavash was awesome!", "author": "Richard R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-06", "description": "(See pics)\n\nReview #1027.\n\nMore of 3.5 stars.\n\nThe Mediterranean place replaced the old Filipino fast food joint. It most likely will do better since it's more main stream.\n\nThe place has a decent selection of food and although I didn't see the rotisserie spit, it might be somewhere back there.\n\nI opted for the Shashlik (beef cubes on skewer) on platter. They grill by order and the meat was okay marinated but was slightly undercooked. It also looked like the eatery is big on vegetables since it came with a big side of precisely cut cucumber with tomatoes (kind of like Tabouli), very finely chopped parsley (salad style), cucumber with yogurt a full bed of tomatoes, lettuce and zucchini. It also came with Tahini hummus sauce (very good) and lavash bread.\n\nAs paying I saw they also carry baklava. It was quite tasty.\n\nOverall the kitchen has an impeccably clean feel with bright lights and some Mediterranean tiles.\n\nExcellent service with some chuckle sense of humor made this place more friendly and enjoyable.", "author": "T L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-31", "description": "Vomit wrapped in vinegar sauce... \nI guess the food is at least a match for the bitchy girl at the register who explained it as \"it's like... Meat... We cut it..\" \nFirst time in years and years I couldn't finish food I had purchased - wouldn't wish this wretched crap on an enemy.\nAll that topped off with craptacular service - it's a recipe for something - just nothing you want.", "author": "Shaun B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-12", "description": "Not that good. We dropped in only because it was close to our hotel and we were walking buy and wanted a snack.  The shawarma was NOT good.  It lacked flavor and the rest of the meal was also bland.  The saving grace, surprisingly, were the onion rings!  The onion rings were amazingly flavorful and nicely breaded!  \n\nAnd, oh, they do have Orangina.", "author": "Alice T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "Why the hate for this location, I was expecting a higher rating. I love Oasis Grill after trying out their location in San Leandro. The food here was pretty good too, can't go with the Gyro (yeero).", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-02", "description": "Good flavors and selection, the experience was kind of ruined by the fact that my food to a very long time to come out, however it was yummy none the less. It was kind of pricy however it was Downtown SF.", "author": "Gabriel D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-21", "description": "Located near the Metereon in downtown SF, Oasis Grill offers a great Mediterranean option for your movie or shopping experience.  I came here to grab a quick bite on the go before watching a movie.  We ordered two chicken shawarmas and I was quite pleased.  They were fresh, toasted lightly, and the spicy sauce was delicious but not too hot or overpowering.  For $8, it was a great on the go choice as well as made others in the movie theater jealous compared to their overpriced hot dogs and candy.\n\nFor the time-crunch, ease of purchase, and flavor, I would recommend this place if you are downtown.", "author": "Robert T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-13", "description": "Excellent shawarma, all configurations.  Gets crazy crowded and disorganized during lunch rush, so get there early.", "author": "Tim S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-25", "description": "For being the restaurant directly across the street from the Moscone Center, I expected much better from Oasis Grill. In the end, it was just OK. Nothing outstanding, no amazing burst of flavor from my chicken schwarma wrap. Your standard thin flat flour wrap, standard large-ish size, very standard chicken pieces. A lot of yogurt sauce and lettuce inside. I ordered mine spicy, and got no spicy sauce at all inside the wrap, and no spicy sauce offered with it when I went to pick up the order - disappointing, despite the Game Developers Conference lunch rush in the restaurant that day.\n\nThey also have international candy bars lining the counter all the way from the beginning of the line to the register to lure you in; the prices are not indicated anywhere around these bars. The line gets long, almost out the door, and it gets crowded and noisy at lunch with conventions going on.\n\nIn the end, I only ate half of the wrap and didn't feel compelled to eat the rest. I've had much, much better from many other Mediterranean places. It just lacked good strong flavors overall. For how much business they get from the convention center being across the street, I believe they've probably gotten lazy about their food because they can get away with it due to their location. And that's too bad.  I would only eat here out of necessity, not out of choice.", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "Clean place, yummy platter, prices aren't too high like other places, nice area &  cool crowds. Also they've Middle Eastern goodies!", "author": "R C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-16", "description": "Close to convention center. Moderate wait. Medium prices. Chicken shawarma was very tasty. Another day tried the kibbe plate. Tasty, but long wait.", "author": "Lynne B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-07", "description": "Pretty good Mediterranean food. I like the lunch combos, pretty good deal and good sides. Very convenient if you are in the Moscone Convention Center, it's right across the street.", "author": "Peter K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-11", "description": "Went to get some food for the family. I got the chicken shwarma and it was great. I loved it. But my brother and my parents got some kebab food and it wasn't as great. I'd say stick to the shwarma here. Decent amount of food too. \nP.s - get it spicy. Makes it a lot better.", "author": "Eun Taek L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-19", "description": "In need of a quick lunch while attending a conference at Moscone West, I happened on Oasis Grill with a coworker. We were told to get the chicken shawarma - \"the best thing we have on the menu\" - so we ordered it with medium spice. Note: if you like heat, go for the full on spice. Medium didn't cut it. \n\nMy sandwich was okay, pricey for what you get, but at least I didn't have any gristle in my wrap. My coworker wasn't so lucky. After a few bites, she couldn't eat any more. So we went over to Starbucks to get coffee and for her, a warm piece of pumpkin bread.\n\nBottom line: Oasis Grill will do in a pinch, especially if you get your order to go. The restaurant is small, and the tables apparently do not get cleaned between diners. But if you have time, you're better off at one of the joints off Market Street.", "author": "Maria S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-25", "description": "I would not even give it one star. The Worst Falafel I Have Ever Tasted! They asked me\nif I wanted it hot as in spicy I said yes. There was nothing that was even remote that tasted hot. No harissa sauce nothing at all. Serving it hot was obvious, it wasn't even that, old dry yet greasy tasting falafel 3 small croquettes, some kind of mayo/yogurt, diced tomato and cucumber on a stale and hard lavosh. Total shit. This is the first time I ever expressed myself to an owner's face about how spectacularly bad a meal could be.\nI think the majority of their trade are conventioneers who they will never see again. I would rather eat a subway 5 Dollar Footlong than that slop.\n\nAVOID AT ALL COST!!!! GO TO MCDONALD'S INSTEAD", "author": ".James A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-09", "description": "Great food! On my first visit I if the lamb/beef gyro and came back for the falafel wrap. Both were delicious. They are also very good at handling a crowd.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-24", "description": "After attending a conference at Moscone, we were ready for some lunch. Something quick and inexpensive. Most places around Moscone tend to be overpriced so having seen this place on numerous occasions, we give it a go. \n\nGetting to the restaurant, we stand in line to order from the large menu on the board. They have the usual schwermas and other Mediterranean foods but schwermas are what we want. I get the gyro but this isn't the usual gyro with a pocket pita filled with meat but it's more of a wrap. Not what I was expecting. \n\nThe gyro wrap is a bit dry and crisp. Fortunately, the interior is filled with moist meat and veges dripping with tahini sauce. Flavor-wise, nothing remarkable to report. I've had better schwerma with a smokier flavor from the meat, more meat, better tasting special sauce inside and of course superior tasting hot sauce that's more tart, spicier.\n\nBasically, it's pricey for the quality but it's convenient if you're in the area for a conference.", "author": "Norman S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "Had a great experience my first time dining here. The staff is friendly and knowledgable about their menu items. The prices are reasonable, the portions are very large (I did not finish) and the chicken shawarma wrap I had was delicious. My only complaint is that they asked if I wanted it spicy, I said yes, but it was not spicy at all. Maybe this is just a personal preference of \"spice factor\", but overall I would definitely go back and would also recommend to others! Note: There is another location very close by to this one in the Financial District. That one is larger and has more seating.", "author": "Sara D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-29", "description": "The only 'Oasis' here is the code-entry bathroom where I can find a moment's shelter from every chemically imbalanced whackjob in SoMA. \n\nAmazing roll-ups though; almost as good as the ones grand-mère used to make in Alajtoun, Keserwan, Mount Lebanon (24 km north of Beirut).", "author": "O. Reli-yah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "Great chicken shawarmas here!\ni absolutely love the food here and especially the location\n\nAlso the white guy their is cute ;)", "author": "Tamia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "Second time here. Love it. Falafel wrap last time. Chicken Shawarma plate tonight. Consistently delicious. Great staff. I'll be back", "author": "George E G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-07", "description": "$3.49 for 1L bottle of water? So turned off by this place. This water better blow my mind! This was my thought as I sat and waited for my food.\n\nStopped by, not by choice, but because my travel buddy needed food ASAP. I had the veggie plate and I might as well had plaster. I just couldn't find a source of flavor. I've tasted better hummus from a grocery store.\n\nI was just bothered at the audacity of charging $3.50 for water. I know it's in front of a major conference center and many unsuspecting out of towners, but that's just trashy.", "author": "Keesy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-02", "description": "Flies everywhere, dirty tables and floors, food was extremely overpriced; not coming back.", "author": "Mrs I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-01", "description": "Nothing spectacular about this place. I ordered a Gyro for my boyfriend and they used pre-frozen boxed meat, not the real thing on the spit. Also the bread is just pre-packaged, not fresh. We've had much better. Also not a good value for $9.26.", "author": "Sonya S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-20", "description": "They ignored me when I walked in, and the food was average (at best) quality. Not going here again. :(", "author": "Tim R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-11", "description": "Drove here, Just to eat here all the way from Daly City.\nI have already found a great place where they make badass shawarma and kebabs-good frickin chicken in Mission-but decided to explore and came here.\nthe service is nice(the girl cashier was very sweet) and a place seemed clean. the fridge is filled with good choice of drinks and I was so excited to try my Kefta wrap-disappointment.\nIt totally lacked flavor. Hummus and the cucumber salad has totally dominated, and the kefta had disappeared in all that mixture. \nSo sad :( really wanted to love this place, as I pass by it a lot.", "author": "jamila u."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-07", "description": "Not real shawarma. Ordered beef shawarma but it was ground beef. Pita bread wasnt real Pita either.", "author": "Mohammed D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-25", "description": "I was staying at the Marriot which is on 4th St. also and stumbled across this place while on the search for food.  This is a great place to grab some mediterranean food in the area.  The seating was spacious here and a bit dead when I came in (though it was around 5 pm on a Friday).  I got the chicken schwarma plate which came with 3 sides.  It was plenty of food for a starving person.  I also go the baklava which was a bit sweet for my taste, but still delicious.  It was a bit on the expensive side but that is expected from the Financial District area.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "Great flavors,excellently prepared food and good service. I have had most everything on their menu and not been disappointed.", "author": "Gerard C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-16", "description": "I would love to give them 4-stars but I am little disappointed that the lady at the counter does not show enthusiasm (-1) at work and provide little or no help when I asked question. Overall, the meal is good and good level of spices to make it tasty and not very blend but I am not a fan of eating out from bento box in the restaurant (-1). I think it is good for take away but not when I am in the restaurant. I like to have my meal on a plate and plastic is fine but not from a box. We like the spicy sauce on the side and the bread is warm and soft. (1). All the meats are Halal (1) and they have plenty of table inside (1). Parking is very difficult to find here for dinner.", "author": "Sam M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-23", "description": "I'm always searching for Halal Food in the financial district of San Francisco. I wanted to give Oasis a 4, but I just couldn't bring myself to do it. Don't get me wrong, this place has decent food, but It's not mind blowing or anything. I've tried the Falafel and at times it's been delicious and then other times I've found the Falafel wrap to be a bit dry. The Chicken Shawarma is fairly tasty and filling as well. I have to say that I'm a bit spoiled when it comes to Shawarmas and things like this because I've lived in Southeast Asia and enjoyed small Indian and Middle Eastern shops that were very authentic and tasty. I was searching for this back home and I guess my standards are quite high. \n\nOverall the food is good though and if you're hungry and not as much of a Shawarma snob as me then you may be inclined to give it 4 or 5 stars.", "author": "Rich T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-16", "description": "Same old story.\n\nSimilar to the other location: http://goo.gl/Yyg3T\n\nFood was once again good.\n\nVeggie wrap was the perfect blend of red peppers, zucchini, tomato, lettuce, onions and spices inside a toasted lavash. Hummus swapped for tahini no problem. Delicious.\n\n(includes cheese and mushrooms for those who want it)\n\n(kebab burger that was on their launch menu is unfortunately nowhere to be found)\n\nService was once again good.\n\nFelt my requests were heard and special attention given to make sure they happened \n\nPrice was once again too high. Charged eight with tax. Worth six.\n\nMore good than bad earns them three. Could be so much more with a better balance of quality/price.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-12", "description": "I came in and got the beef shishlick plate and fried sweet potatoes.  Sweet potatoes came quick, liking this, until 15 minutes later when I'm still waiting for my plate order.  \n\nI was being cool and asked what's going on.  Turns out something went wrong in the kitchen.  One of the lady who was getting orders murmured something and the other explained I was there even before all the people came.  Yeah, know-it-all-lady, I was waiting for a long time.  \n\nI was asked if I wanted something else so I didn't have to wait longer.  I said I'll get the chicken instead.  Now, this was $1 cheaper but nobody mentions about giving me the difference back.  I was starting to get annoyed, I was super hungry so I opted not to make a big fuss.  \n\nWhat happened is not cool at all.  Good thing I'm always slow to anger and the nice lady who initially took my order was nice.  Food tastes great - I give them that!", "author": "Pam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "Why does this only have an average of 3 stars? Perhaps everyone else is ordering wrong. Here's what you do: Order the falafel. (It comes wrapped in lavash.) They ask if you want spicy sauce. Say you want *some* spicy sauce. Pay ~$8. Consume deliciousness.", "author": "Shannon R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "This place is pretty good. Word of advise - if there is a conference going on at the moscone center it would be best to order your food over the phone and then pick it up. The restaurant gets crowded with long lines.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "I came here for lunch in a rush, needing to grab my food and go. Though parking was a pain (we ended up parking at the Moscone Center), I was pleased by how quick the service was. I ordered a chicken schwarma, and my food was ready within 5 minutes. When I finally sat down to eat it, the chicken was really tender, the sauce was zesty, and the wrap nicely rolled so that I didn't make too much of a mess. My only issue is that all the sauce seemed to have concentrated at one end of the schwarma, so the flavor was lacking throughout in comparison. However, great place to come for a quick fix and tasty schwarmas at a great price.", "author": "Hurnan V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-05", "description": "Just because you have a endless supply of clueless out of town visitors passing your door  every day does not mean you should offer so so food and uninterested service. The prime location across from Moscone Center has allowed the service and food quality to be sub par. It's too bad  because this cuisine is fairly easy to do and really tasty when done right. Everything costs $ 9-12 ( that's about 4 more than other mid east places) and it's essentially a take out  joint.\nThe girls working there must be sedated , you know that distant stare and your order comes out without the hot sauce you requested, plus they don't even offer you a drink? That's what greeted us, even before the lunch rush on a Wednesday.\nThe food was slim ( as in small portions) even the server could not tell the falafel wrap from the lamb. The wraps are thick with carb laden lavosh bread and thin with fillings.\nThe real crime is the old and soggy baklava. Fresh baklava is a sublime experience, with crispy filo & layers of nuts, honey and pure yumminess. Avoid their impotent soggy bottom triangles, It's an insult to good pastries everywhere.\nThese guys should to step it up a lot, but with all the visitors walking by who will never return, there is no real incentive. There are way too many good options within  200 yards of Moscone to waste your lunch money here.", "author": "Aaron Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-07", "description": "Yuck, the gyros taste plain and bland.  The tomatoes are those typical cardboard variety, and the chicken takes like it has been sitting out in peanut hummas overnight.   Maybe I am spoiled by going to Ayola, which is nearby, and more much authentic.   There really is no comparison. Oasis charges the typical $10 for a gyro, but the quality is not worth the price tag.  The fries are also soggy.", "author": "Jackson W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "One of the best Gyros I have ever had! I came here for lunch during a Trade show since it is across the street from the Moscone Center. The prices were in line with the portion sizes so make sure you go with an appetite.", "author": "Justin F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-17", "description": "This place is newly open so when I order I don't know what is in what so I asked what is the dish, she just yelled back A or B ?! I asked again what is in the dish she yelled again A or B?! I have to guess what she means then reluctantly ordered. Come out with very little meat in a bento box. $15? Not worth it. Nothing is specially good. Probably would close out in couple month. I want to shout back! Don't go there!", "author": "Shin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-28", "description": "Since I eat at the Oasis in Hayward weekly, imagine my delight when I saw they were opening a location mere blocks from my house!  \n\nI ordered my usual chicken shawarma wrap extra spicy. Hubby got the chicken something platter which came with 2-3 salads and tons of rice.  Of course I got a piece of the world's best baklava.\n\nThe young lady working the counter was fantastic. Very knowledgeable about the difference between the chicken shawarma and the other chicken which I can't recall the name. She kept those boys hustling in the kitchen.\n\nFood didn't disappoint! Everything was tasty, juicy and spicy. One star off because things cost $2 more per item than in Hayward.", "author": "Kim W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-12", "description": "This place is really close to my work and I seem to have a craving for Mediterranean food/ wraps every other day so I figured I would check it out with my co worker. It's a little overpriced at almost $10 for a chicken schwarma wrap cause the chicken is on the dry side and there are so many other lunch places around but they are VERY quick and their spicy sauce is really good!", "author": "Clarice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "When at a conference at Moscone center, you must exit the facility, avoid their crappy food and go eat here. It is right across the street from the center. Yes, there will likely be a line out the door, but it is worth it. Delicious falafel wraps and MiddleEastern simple foods. Lunch will be under $10 and you can get a few minutes of fresh air.", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-01", "description": "Order it spicy...  I came here three times on my week long business trip.  I loved it.  First visit I had a Chicken Shawarma Platter (with humus, cucumber yogurt, and Tabouli).  It was fantastic.  Next stop, I had a Gyro which was made with humus and garlic yogurt and I ordered a side Greek Salad.  Once again, it was very good.  Third visit they were closed :-(  It was after 11PM and the open sign was lit but the doors were locked.  I wish we had food like this in Central IL.", "author": "Mike N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "Vegan friendly with falafel and the veggie melt (hold the cheese) and both are under $10. The place itself is small and extremely casual... I wouldn't recommend eating there unless you're in a rush.", "author": "Marie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-15", "description": "Came here once.  I was hungry and left full.  And went again on the way home on new year's for a drunken night's sober food fest.  And even then was left feeling like I could have eaten some fried goodness to satisfy late night hunger binge.  Don't get me wrong- the food isn't bad; it just lacks the flavor expected.  Fresh veggies though but that's not what I'm looking for ..I'm eyeing and wanting delish meat that I did not find here.", "author": "Kimberly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "I love this place for its quick service and great value. The chicken shawarma rolls with the spicy sauce, hummus and salad is a great combination and I've not had to wait more than 5 minutes during some of its busiest hours.", "author": "Harish D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-13", "description": "I love the first oasis grill on drum street but this one needs to get it's act together. The food tastes just as good but this location is just having some serious problems. It really needs to filter through it's hires better for one. Total \"meh\" don't care attitude with everyone. They don't understand what they are serving, how to wrap it, or to include a napkin.  \n\nI came the day they opened. It was khoas, but i figured that they would get up and going soon and be as good as the other one soon enough. The staff all seemed confused and unsure about everything though.\n\nToday I came in and they had rap music on so loud it, I couldn't think. I ordered a chicken shawrma wrap. The guy wrapped it like and idiot and 30 seconds out the door I had hotsauce/taziki sauce down my leg. The guy couldn't  figure it out and twisted the bottom up then bent it. Complete fail. For a $9 wrap it's not worth it. \n\nI won't eat at this location again until they retrain their staff or fire the people up front.", "author": "Zac B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-16", "description": "Decent felafel wraps, but i wouldn't recommend this place.\nQuality can be questionable as they've once served me unfroozen raw fresh-fries.\nA bit over priced too.", "author": "Ayall S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-01", "description": "Pretty crappy falafel wrap. The sauce was way too liquidy and not hot as requested. I ate it because I had just had a really long flight and was starved but didn't want a full meal, but definitely wouldn't stop by again.", "author": "Rowena L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-22", "description": "Their location in Hayward is one of my wife's favorite restaurants so she was really happy when they opened a location near us.  We had to go check it out shortly after they opened and have been back a few times.  Both of us really enjoy the chicken platters that come with chicken, rice, hummus, babaganoush, a couple of salads, and some hot sauce.  It was very good and we'll definitely be back.  The only downside is that the food isn't exactly cheap and I understand their location in Hayward is a few bucks cheaper, which is understandable.  One other thing I wish they had is some outdoor seating which would be nice, especially on a nice sunny day.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-22", "description": "Get the Mix Grill with an extra side of red sauce; add a chicken skewer and the meal is good for two people to share the lot", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-16", "description": "Great little quick, middle eastern food. Had the falafel wrap. It was so good but could only eat half as it was pretty large for lunch. A bit cramped dining area but decent views of the hustle & bustle around the hotels & Moscone Center.", "author": "Simone W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-17", "description": "As I keep trying the menu I get to be a happier camper. The food is delicious and healthy. It is light and filling. Thank goodness there is some good Mediterranean food near work. \nThe music is fine now, they pay attention to consumers input. I have never eaten it, I just grab the food and go. Yet I look at the seating and all the painting they have done to  spruce the place up and its appreciated. So not the Fast food join that they took over. \nNot that they are slow, heck usually they are pretty quick and friendly. Start at the end and work your way to the cashier. Depending on what you order its gets specially cooked.", "author": "Natasha M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-14", "description": "Mediocre and tasteless chicken schwarma, mealy tomatoes, no dressing on wilted Greek salad.  My two stars are generous.\n\nHowever, they have another location close to the Embarcadero where the food is delicious.  Try out that one.", "author": "Clever Chick I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-13", "description": "I drive by every week, never crowded and today wanted to stop being curious if good or not. Chicken kebab plate, kibbe plate and falafel  wrap. I smothered the dry falafel with yogurt because it was salty. The chicken had a nice grilled taste and was moist. Kibbe was good and made up for bad rice, baba ghanoush, and hummus. The $4.50 Specialty tea drink with chia was fizzy (it is highly perishable) and then my friend noticed that the drink expired that day. The girl at the counter tells me that it is supposed to taste that way. I won't be back.", "author": "Mo O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-12", "description": "I've always loved Mediterranean (especially when it's fast) & this spot allowed me to grab a quick bite. The chicken Shawarma was very tasty, but it was the male clerk behind the counter that truly made the experience as he did not stop smiling. It's amazing how much impact a simple \"smile\" has on a customer - it could change your whole day. I believe his name was \"Akmei\". He was delightful.", "author": "Jules F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-28", "description": "We had some time to kill, and wanted a good gyro and hummus.  We ordered two gyros without onions, two orders of fries and an order of hummus and were disappointed in nearly all of it.  The gyro meat was chewy with an unexpected texture, the gyro itself had way too much sauce.  The hummus was as bland as day-old oatmeal and just as tasteless - I don't know, but it tasted like it was poured from a can.  The fries were fried up on-order, so they were decent.\n\nThe upside is that I picked up some kinder surprise eggs from my kids.", "author": "Travel A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-01", "description": "My \"First to Review\"!! This place use to be Jollibees. Just came in for lunch today since it's right by my office (eating the gyro right now actually). Kinda pricey for the type of food you're getting but everything in this neighborhood is kinda pricey due to the convention center. The menu starts at ~ $8 and it goes up from there. There were four employees behind the counter so they were moving the lunch line pretty quick. Got the beef and lamb gyro ($7.75), decent but a bit too salty for my taste.\n\nNeed agua.", "author": "Terence H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-08", "description": "Awesome chicken kabob salad. I've paid a lot more for a lot less in quality and quantity. Tasty, fast and reasonable price.", "author": "Lilly J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-16", "description": "Two stars for opening late. The food is shit though.", "author": "Ross P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-24", "description": "I really wanted to like Oasis Grill, but the $9.30 chicken shawerma sandwich was not up to par. The chicken was under seasoned and the only other things in the sandwich were lettuce, two slices of tomato, chicken, and a tiny bit of hummus. Sorry, but that doesn't cut it for me. \n\nBesides that, I ordered behind a couple of ladies who were ordering for their office and so placed 5 orders. But after they got their 5 sandwiches, 10 people who were behind me got their sandwiches (some, the same chicken shawerma) first before me! They need to figure out a better way to keep their little bags with orders on them in the correct order to avoid pissing people off.\n\nAll in all, sorry Oasis Grill, but I'll stick to Gyro King down the street in the Civic Center. Way better food and you can't beat the price ($6.25 for a chicken gyros wrap--very similar to the shawerma).", "author": "Sahar B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-30", "description": "Love the Shawarma and Gyros wraps here. I order mine spicy, think Sriracha hot. Always freshly made and quick enough I always forget to check-in.  Try the Baklava.", "author": "Rick B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-01", "description": "Not good. Every ingredient in the falafel wrap--including the falafel & the lavash bread--was stone cold. One extra star for decent tasting tahini sauce, but the tiny wrap only deserves one star. Would rather take my chances at the Metreon food court from now on.", "author": "Wan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-05", "description": "Sandwiches were good. Not all menu items are available at lunch :(. Watch out, once you get to the end they drip and explode sauce like crazy", "author": "SnwBuni M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-10", "description": "Great people and service. Veg.medi. wrap. was carefully prepared with fresh ingredients. Liquid yogurt was great.", "author": "D P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-01", "description": "Love this place.. and the one on Drumm. I always get beef and lamb gyro... extra spicy. Good food. Nice people.", "author": "Justin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-12", "description": "Wow!  Delicious and healthy food served by very nice people!  The next time we go we will take as many folks along as we can - we'd love to see this wonderful business thrive and grow.  \n\nThe food was absolutely deliriously spiced and seasoned.  We left feeling good and sated.", "author": "D G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-08", "description": "I come here for lunch just about once a week. I love Med food and grew up with my grandma making it. This place does a great job and is very fairly priced. I dropped it down just one star because it's not quite as authentic as how my grandma cooks, but it is still fantastic!", "author": "Megan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-15", "description": "It was my first time to try their falafel and shawarma. The taste of these wraps is Ok i expect a better spicy mediterranean taste. The size of the sandwich is large and its a little bit pricy, and the service is average.", "author": "Li A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-15", "description": "The chicken shawarma is okay, as is the \"russian salad\" (potato salad). A tad expensive, IMHO.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-28", "description": "The food is tasty.  However, for the price, the portions are too small.  I spent $8.49 ($10 with tax and tip) for a chicken schwarma.  Like I said it was tasty, but the size was smallish, such that I am still hungry.  I don't want to spend $10 and still be hungry for a take out lunch.", "author": "Karl B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-15", "description": "What a prime location, right outside the Moscone Center.  I'm assuming this place must be crawling with convention-goers, like it was at Intersolar.  Why anyone would pass up this place for the GOD AWFUL prison-food served at the portable vendors inside the convention halls is completely beyond me.  It's relatively fast (considering the long line out the door), the beef shawarma was juicy, and overall a pretty decent experience.  Now... would I be as thrilled if I weren't a starved dog from sitting at my booth all day?  Probably not, and that might account for the sub-3 stars from other reviewers, but IF YOU'RE HERE ATTENDING A SHOW, AND DON'T HAVE TIME TO SIT DOWN AT A NICE PLACE, DO EAT HERE.  You'll appreciate the advice, and you can thank me later.", "author": "Jeff J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-28", "description": "Poor customer service. Very pricey for the amount of food. Graffiti all over dirty bathroom.", "author": "A W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-07", "description": "Beef and lamb gyro. Meat was tough, spice was lacking (ordered it spicy). Overall extremely bland. Never again.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "Yummy falafel wrapped in lavash with hummus and lettuce, tomatoes, cucumber and yogurt sauce.  The texture of the falafel balls was perfect. But the BF was not a fan of the gyro because it came in lavash (not pita) and there \"wasn't enough meat\" for my meat-eater.", "author": "Julie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-14", "description": "Least flavorful Greek meal you could encounter. The falafel was rock solid on the outside and slightly undercooked on the inside not to mention brow raisingly expensive.", "author": "Greg A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-18", "description": "Terrible customer service!!! I called requesting an itemized receipt, repeatedly I might add, and they never responded. I've been calling all week because I need it in order to process a reimbursement, and the ghetto waitstaff just gave me attitude. God help you if you need a receipt for reimbursement and forget to ask for one. You'll be s*** out of luck.", "author": "Carol F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-04", "description": "Had the beef shawarma wrap- wonderful- definitely say yes to spicy!  Greek salad was good- pretty standard, but tasted very fresh and light. Hummus was aiight, but we had to ask for something to dip it in.", "author": "Ashley F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "Solid add to a lunchtime rotation.  Avoid during conventions given the lines.  Food is fresh and looking forward to their new location.", "author": "mike s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-23", "description": "Expensive and dirty for a fast food. Every table is dirty and trash overflowing. Not impreseed.", "author": "J E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-05", "description": "I never write reviews on Yelp.  Ever.  I was to compelled to write a review for this place because it was the BEST Falafel plate that I have had in years.  The falafel, babganoush, hummus, and salads were fresh and tasty.  Only $10 for a large portion.  I'm not sure why there are below average reviews. Perhaps the other items are not as good.", "author": "Mona P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-08", "description": "As a picky eater I was a little skeptical about middle eastern food but after popping my first freshly fried falafel in my mouth I was hooked! my sister got a chicken shwarma and loved it also. The employees were very friendly and helpful and I loved the selection of chocolate next to the cash register. Nice reggae type music softly playing in the background. Overall I can't wait to go back!!", "author": "Caroline R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-29", "description": "Tourist / conventioneer trap!!! Stay away!\n\nThe most disorganized \"restaurant\" I've ever seen in my life.\nI placed my order and paid with a $20 bill--the cashier promptly took the money and then walked away!  No change, no receipt, no thank you.  Another woman eventually walked over and gave me a blank stare--I finally had to ask for my $8 change.  To make matters worse, they managed to lose my order (surprise surprise).  I had to stand there and watch while 10 people placed and subsequently received their orders.  I told them that I thought they lost my order---more blank stares.  I would have asked for my money back, but the food actually looked good and I was hungry---WRONG!   The food is just as bad as the service.  The chicken shawarma was mealy and tasteless. Like another reviewer said--it's stewed first and then heated on the grill.  Also, the wrap was as dry as cardboard. I'm still sick thinking about it.   \n\nThis place survives solely based on its proximity to Moscone center.", "author": "Sam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-26", "description": "me and the cast of \"Bite Me\" went over because it was the closest spot to our hotel and it was raining.  I was iffy about the spot walking towards it, but I must say I was happy.  The food was authentic and tasty.  The workers were nice and very accommodating.  I got the gyro meal and it was worth the 8 dollars i spent.  I've been to other places that served Mediterranean food and it was just over priced and not good at all!  I'd come back", "author": "Donald R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "Great food, great for catering. My favorites are the shawarma plate and the falafel!", "author": "Leah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-30", "description": "So I have been sort of cautious of this area for a bit. Things pop up and usually are ok. But this place was actually pretty decent. I came here for a gyro and it was pretty good. They do the lavash style, not pita. Ask for spicy and what do you get ... spicy :)", "author": "Greg G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-06", "description": "Chicken Kebabs are delish! Perfectly seasoned & served w your choice of 6 different salads. Yummy!", "author": "April F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-01", "description": "I was wandering off from Market street a little before 21:00 when I noticed it on the corner and decided to try it. The interior is bright and open, though it is not big. The floor layout is a bit odd. I ordered the Kefka Kabob plate. Ordering was a breeze. The attendant is attentive and friendly. I did see him help the next customer figure out coin denominations. The cook staff was not very fast and tended to get distracted. Maybe it was because it was the end of their night? I got my meal it was in a portable plastic clam shell. The meat was served on a bed of veggies over rice. A cucumber yogurt, red cabbage slaw and hummus accompanied the plate. In the center there was pocket with a generous portion of sirracha/hot sauce.  The portions seemed good. The kefka was delicious, moist and spiced nicely. The rice was tender and tasty. The hummus was good. I am not much of a humus nut, but enjoyed with the pita. It did seem zestier than most others. A very tasty satisfying meal.", "author": "Angel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-16", "description": "I am from Phoenix AZ and was there for a conference last weekend, this place has been a life saver for me. The food is of great quality, and well priced in the middle of the business district of SF. The owner Hisham was on top of everything, lunch time when hundreds of people were looking for lunch, he was taking care of everybody. The line was down the street and he was running between all people taking their orders so you don't wait too long.\nNow the food, get the plates not the sandwichs, there is lot more value in the plates and you get Hummus, salad, Tabbouleh, rice and much more. Hisham was very nice he offered my elderly dad extra rice and pita bread. The grilled mix is absolutely worth it and the Mezza plate (has falafel, hummus, etc...) a veggie plate is an excellent choice too. The meat is tender and delicious, the falafel is amazing too.\nThe prices ranged from $8 for sandwiches to $13-17 for the plates, but it is absolutely worth it.\nI will go back there again for sure", "author": "M A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-13", "description": "Halal meat is served here, per signs outside restaurant. Was pleasantly surprised to see the Oasis Grill sign on my way home from SF.  We had to stop and pick up some chicken wrap melts (chicken kebab wraps with cheese) to go.  Great stuff.  Parking is hard to find at this location.  Limited seating inside, so more of a take-out place.", "author": "Irfan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-29", "description": "Compared to the location on Drumm the chicken shawarma wrap from this spot wasn't quite as big/generous, but still just as tasty. Extra space in this restaurant  (again, compared to Drumm) makes it much more inviting - less hectic feeling. Great addition to the neighborhood.", "author": "J. R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-21", "description": "Went in for a quick lunch and I can say as a positive, they were prompt with getting our food out.  But the food itself was not good.  We ordered two greek salads with gyro meat on top.  The dressing had no flavor at all and the gyro meat tasted and looked like something you would get from a mall food court - not freshly carved from the rotisserie.  The feta was so mild that it was almost flavorless as well.  There was really nothing I liked about the meal and at $28 for the salads an Orangina and a bottled water, we were very disappointed.  We won't be back. (I guess I am a little spoiled - we have a fantastic greek place closer to home and everything is compared to it.  But honestly - the food was bland and blah.)", "author": "Allegra G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-17", "description": "The falafel is okay, The gyro is dry and flavorless. I've given them two chances, and I won't be going back", "author": "Britt T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-29", "description": "I had the $12 kebab salad. Tasty, Yes. Good Service, Yes. I knocked one star off because if a salad is going to be $12, it should be much bigger. Otherwise, great experience.", "author": "Stan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-14", "description": "I've been to Oasis Grill in Hayward and that restaurant is fantastic! Here in SF I decided I'd give this place a try, not once, but twice. Each time I've reminded myself not to go back.  For $9 I got the beef and lamb gyro. Last time I had the chicken shwarma...not good. The meat used is precut, grabbed from a container and reheated on the grill. It's tasteless and has similar texture to a garden burger, and tastes just as bland. What saves the gyro (wrap) from complete failure is the sauce, but in terms of value and taste $9 is steep, and it's not even downtown. The gyro needs to be bigger, and have more taste, before I'd really want to shell out $9 again. Staff also seems more preoccupied with personal matters and chit chat amongst themselves.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-02", "description": "Went to oasis expecting a great food experience across from Moscone center. I ordered the chicken schwarma plate. Why they call it that. It could not be further from the real dish. The chicken had some sort if coating on it. The chicken was tasteless and dry. The young staff did not seem knowledgeable or helpful. I would not recommend.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-11", "description": "Jolibee's was out of place at this location. Service was good, couldn't decide which wrap and person making them said get the chicken. Either was overcooked or days old. Was very, very dry.", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-13", "description": "Ate there with my now former girlfriend. The food is fantastic and the people who work there are wonderful and accomodating. If only the former GF had fit that description :)", "author": "A. D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-19", "description": "Was nervous because it looked like it was designed for speed not quality.  It was both fast and good. Lamb gyros, fries and rings were just right. Price is median for sf", "author": "Bruce M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-07", "description": "Only a small area with 2 chairs to wait for your food. The park is close so you can go eat there, or the peir...\nAnyway, I ordered the Maui? something? it was $10... I thought it was a bit pricey but it says half chicken with rice and salad, so I gave it a whirl thinking I'd share it with my 16 month old. \nI was asked if I wanted is plain, a little spicy, or really spicy. I chose \"a little\" and it was perfect. Even my 16 month old had some and it was fine for her too.\nThe chicken was a little dry, but thats what happens with cut up chicken right after it's cooked usually. Veggies were mixed in a bit over done, but still good. I chose the greek salad and tabouli salad to go with it. The tabouli went well with the dish (cooling when the spice started adding up) The greek salad was just salad with tomatoe and bell pepper and olive oil. :-/ They should take out the bell pepper and add feta cheese and olives (thats GREEK salad!)\nOver all it was still pretty good. I ate it ALL. It was a lot of food! The chicken and rice part reminded me a bit of chicken cacciatore, minus the tomatoe sauce of course.\nI'd gladly order it again.\nMy husband ordered a chicken shawarma and said they suck at making them. He said it wasn't even close to being a shawarma and that they added the tabouli salad to it when he asked for the greek.\nI would of taken another star off for his experience, but I was too busy stuffing my face with my chicken cacciatore...er...maui something or other...\nThis place is also Halal :)", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-03", "description": "Not sure what cuisine this is. It is not Middle Eastern by any stretch of the imagination. I am from the middle East and was dumb founded by there food. The sandwiches are a disaster. The \"gyro\" is a fromed kafte patty and not cut from a vertical grill. The mixed grill pieces of meat were tiny for the $16.00 and the kafte was the thickness of beef jerky.", "author": "bassam l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-09", "description": "I am so happy to have the Oasis Grill in SOMA!  It replaced the horrible Filipino burger joint that previously occupied the space on the corner of Howard & 4th.  The service is fast and friendly and the food is fresh and really good.  They seem to have a steady flow of customers.  Best of all, it has awesome falafel wraps served on a lavash.  I think they acquired more store space, because they have a dining area offering plenty of seating.", "author": "Sandra M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-24", "description": "Beef Sharama was good, extra spicy. tahini and hummus on the pita. fries were fresh and crispy. grabbed another to take on the plane. enjoyed that one too", "author": "Lawrence P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-07", "description": "I was thrilled when another Oasis Grill opened, i am a big fan of the original one on Drumm Street but it was a bit of a walk. so now i have been to this one couple of times, while the food is generally tastes the same the service is awful. Just today it took them 10 minutes to take my order and i was the ONLY person in the line. they are almost clueless for some reason even though there were 4-5 people working behind the scenes.\nAnother good thing about this place would have been the fact that there is place to sit, however they do not clean up often at ALL. there was food scrap all over the floor in more than a few places.\nwe ordered falafels and asked for both to be extra spicy, when we got to eating them the spice levels were way off - one was extra extra spicy and the other one just a little.\nmaybe having some folks from the Drumm location teaching them how to do stuff could help. i will most likely walk a little more to Drumm location.", "author": "Dinesh R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-07", "description": "The only thing halal about this place was the meat and that they didn't serve alcohol. It was the rudest service I've ever received at a halal restaurant in my life, and was treated different from the other customers. When I ordered they didn't bring the food to my table or call my name. It wasn't until 15-20 minutes of me waiting did I walk over and ask where my food was and they said it was sitting there--no longer hot by then. Thinking it was my fault for not hearing my order being called I took it and said nothing. Then I noticed the employees delivered the food to the tables of all the other customers. My boyfriend noticed it too and asked the employee if they brought food to the customers when they ordered...he said they did and did not answer him when he asked why we were treated differently. Right when that happened I noticed hair in my pita bread then threw it in the compost bin in frustration. The most disappointing thing was that I really wanted to support this restaurant and have them cater events I organize but I guess that won't happen.", "author": "Catherine M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-10", "description": "I went for lunch at around noon on Monday, 9 December.  The place is OK -- nothing special.  It is a small place and suffers from a lack of organization.  I ate a gyro wrap, which was very unremarkable.  Convenient to Moscone Convention Centre.", "author": "Danny B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-14", "description": "Went back recently and the falafel just tasted like flour. Sure, it can re-bind an overly moist mixture, but it won't make it taste like $8.20.", "author": "Nicholas J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-12", "description": "I came here looking for something nice and heavy to hit the spot.  What I got was a gyro with barely 3 pieces of meat in it, it was barely warm, and I could see the guy basically reheating the meat over the grill (he was not cutting it off the big slab of meat which gives it that juicy flavor).  The tzatziki on the gyro was good, and the veggies were fresh, but I wouldn't go back and pay $9 for that. Pretty much the hot sauce and tzatziki were the only reasons it had any flavor.", "author": "Megha A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-06", "description": "the worst shawerma sandwich ever , cheap ingredients the meat was not cooked well ,  the sandwich didnt have any tabouli or baba ghanouch ,  i say it again the worst shawerma ever , also is so expensive for the kind of ingredient , not worth it , never go again", "author": "Walid H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-10", "description": "Meh. Veggie plate was mostly chopped up cukes, not much delicious hummus, etc.", "author": "Elise A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-22", "description": "Food was great. The b---h at the counter treated us like she hated us. Unbelievable! Don't go there late or you will up-set the fuzzy headed b---h.", "author": "Dennis B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-20", "description": "Clean, earnest, prompt, courteous and very fast. Now for the food:\nFresh, yes, but flavor? Salt, garlic and onion - don't be afraid of them! Cucumber salad was completely bland - could have used lemon juice and salt AND olive oil. Kefta Kebab Lavash Wrap had flavors of tahini sauce, grilled lavash bread, fresh crispy romaine and tomato - and halfway through the wrap the meat vanished.\nNow for the meat:\nI got the PLAIN Kefta Kebab - no \"hot sauce\". The Kefta Kebab is missing the flavors of a seasoned meat - such as garlic, onion or even drippings of beef and lamb. It tasted sauteed not grilled. Where's the flavor? Fat? Richness?\nI can see plenty of chopped parsley, bits if red and the meat is soft and finely ground. yet it is neither pink nor brown - neither tastes cooked or raw. I do however get large bits of gristle throughout. Also, the meat is distributed at the ends and is missing from the middle. I'd put up with all of that if it just had great flavor. How about salt and garlic?\nHowever the pre-packaged \"nut bars\" in front of the cash register, especially the sesame bars, are spectacular - soft and chewy, for $2 apiece.\nI could have gone to Ayola on 2nd for a really flavorful \"kebab\".", "author": "Nan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-02", "description": "Was in town for business and had a craving for Greek food. Read the reviews online and thought I would try Oasis. Walked in and was greeted with \"Yes\"? I saw that they offered shish taouk so I ordered it. When my order was ready they called it out and as I walked up to the counter my food container was tossed to me. Now the Shish taouk was good along with the rice and tabuli. When I was done there was no thank you or come again. Overall, the food was ok but service was poor.", "author": "Rene A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-11", "description": "The beef shwarma is very good, as are many of the vegetarian items.  This is a hole in the wall type place that has good food and little else, but for a quick lunch, that's all you need.  They sell interesting world candies, but they are overpriced (almost as much as some of the meals).  The cleanliness of the restaurant isnt great either, but the food is!", "author": "Andy F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-21", "description": "Tough meat, meat-to-veggie ratio was not good, the one tomato was grainy.  The sauce looks like it's going to be good but is tasteless. Definitely not worth $9.", "author": "holly a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-05", "description": "Visited several times in January 2012, enjoyed very much. A bit pricey but so is the city. I also recommend kombucha drink they sell.", "author": "Ivan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-10", "description": "I ate here for the first time yesterday with my boyfriend and we were both very happy with the service and food. It is difficult to find something we both agree on because I'm a vegetarian and he loves meat. This restaurant has options for both of us and the staff is knowledgable and friendly  so we will be back soon!", "author": "D d."}
