{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "Just as I remembered!\n\nThe location on market Street offers seating which we didn't get when we visited the takeout store closer to the waterfront. I wife had wanted to go here for a long time since we moved out of the city. So I first trip back in a while was not disappointing. \n\nTheir newer store allows them to offer many things including a couple of items that are vegan focused. We got a wrap and a plate that will both vegan and we're not disappointed. Their hummus and tabouli etc. are all top-notch. And despite the fact that many other well regarded Middle Eastern places cannot give you decent pita bread, these guys do a good job of me giving you soft pita which goes really well with the plate I had. \n\nAnd when I asked for extra they have no problem giving me another serving which gives them an extra star in my book!\n\nSo overall good pricing, great food, vegan friendly, and great people working there. An excellent option for a quick healthy satisfying food, especially when you're on the run.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-14", "description": "Inconsistent service. Inconsistent portions. \n\nEat here regularly on my lunch break because it's very close and the food taste pretty good. \n\nAlways order the chicken avocado deluxe, sometimes with extra meat. Sometimes they tell me their is double meat but I know it's not because the size of the wrap is the same as the Regular one. Also for being a chicken AVOCADO DELUXE wrap...I rarely taste avocado except for in 3 bites usually at the end. For spending $20 on a wrap with extra chicken, it just wasn't worth it. Sometimes it's on a plate and they bring it to you, otherwise they yell out your number.\n\nToday they threw away my meal before I was finished while I was up getting water. \n\nUPDATE.\n\nConsistency has gotten better. I've been back twice  now and it seems this review got some mention down the line. Will continue to come back for a decent lunch.", "author": "Alexander H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "I work nearby and this place is my usual lunch spot..i tried almost everything in the menu and truly everything is delicious with the right amount of flavor and spices! The portions are big and the prices are reasonable you can taste the quality of the ingredients in their food!\nMy favorite thing is lamp shawrma on pita its the best in town! \n\nVery recommended!", "author": "Areen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-02", "description": "This place was okay. Good option if you're on the go. \n\nFood wasn't that warm despite it being the first dish out. Wait was about 15 min and we were the first to arrive and order. \n\nLamb and beef gyro: mostly lettuce so it was okay - couldn't taste the meat much\n\nKefta kabob plate - the bread was warm, rice was bland, everything else was pretty decent \n\nOverall, it was forgettable. It was clean though, so that was nice. Not sure if they have bathrooms.", "author": "Joan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "I have been coming here every time I am in the area, and since my work is closer to market I'll probably be coming more often! Every time I come here I am greeted and my food is made fresh to order. Today I had the chicken and beef shawarma wrap, it was delicious. Especially the beef, juicy and tender! Definitely recommend the beef if you were debating on which meat to get.\n\nEmployees here are great and, your food is made pretty quick as well. \n\nDefinitely recommend.", "author": "Shabnam N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "Stopped by my favorite lunch place again today they added a few new things to the menu. I tried the crusted sesame chicken which I don't eat too much fried foods but this sandwich is delicious super juicy and flavorful ask for it spicy!", "author": "Jacqueline M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "Food was great. I got the mixed skewers plate, which came with beef, chicken and lamb skewers. They were all very delicious. The hummus and bread was good, and the rice was great as well.\n\nMy only complaint is the location - that part of Market St. is pretty dirty, and the tables near the entrance of the restaurant had actual garbage and some outside dirt under them, which wasn't very inviting.\n\nThe food also took a bit, but I think they had to grill the meats from scratch so that's understandable. The serving size was decent as well.\nMy friend got the chicken skewer salad, and that was also a large plate.\n\nNot a bad option in SF.", "author": "John L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "This is my first time at Oasis Grill in the Sf I always go to the one in Berkeley , I was attending the Dreamforce Convention, and my co-workers were looking for a good place to eat so they told us to go to the Oasis Grill on 200 4th ST but it was closed for a Private party so we went to their other location on 711 market st. They were so busy but they were very fast with service and really friendly except the cashier it looks like he wasn't in a good mood that day. I hade the sesame chicken sandwich and to be honest it's one of the best sandwiches I ever had and my friends really enjoyed the food and the atmosphere there..\n\nKeep up the good work", "author": "Rami A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "love the sesame grilled chicken sandwich! perfect.\nand the fries are just right: not soggy or oily.", "author": "Ray H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "Falafel wrap was super spicy just like we had ordered - props!\n\nGinormous sandwich with lots of freshly fried falafels, lettuce, tomatoes, cucumbers & I think there were also bits of jalapeños as this thing had quite the kick\n\nLines took a bit but after one bite, it was so worth it.", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "If you are looking for a quick, delicious and affordable meal then this place is for you! Their lunch bowls are flavorful and hefty enough portions. Staff is friendly, too. It's nothing extraordinary but hits the spot!", "author": "Rob M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-18", "description": "The Bottom Line: A serviceable, quick, and decent lunch stop, but ultimately forgettable.\n\nPro: Service is fast, as they have dedicated lines, and the wraps are filling and just the right amount of spice.\n\nCon: Nothing bad to say, it is simply a quick place to grab lunch.", "author": "Carlos G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-26", "description": "Thieving so and sos. \nMy 11.99 Shawarma plate and 2.75 baklava came to $22.32. I was told that the price changed on the shawarma and that the one piece baklava was actually two pieces, even though the two-piece baklava was on the counter, next to what I chose. There are myriad choices for good lunch downtown & plenty of opportunities to make a profit. No need to rip people off & hope they swipe blindly. Shame on you.\n\nAs you can see by their comments, the fish stinks from the head. The posted price of the lamb shawarma is $11.99, not $15.99. And I chose the one-piece baklava, was charged for two pieces and when I brought it up was given double talk how that single piece was really two. I don't begrudge you your pricing and cost of doing business. What I take umbrage with is misleading pricing, bait and switch, or outright thievery--take your pick.", "author": "Dizz A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-12", "description": "Went here with some colleagues while at a conference. Food was reasonably priced, wait time was low. It was the epitome of a fast-casual Mediterranean joint. I ordered the spicy falafel lavash. The pita was dry, but the falafel was flavorful and the tzatziki seemed like it was fresh-made.\n\nIt was good, but I'm not eager to go back to San Francisco just for this place. If you're craving falafel specifically, this is a good place to go, but I think you'll be better off finding Mediterranean food elsewhere.", "author": "Taylor M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-27", "description": "Don't go here if you're a vegan. I ordered the falafel wrap. They gave me a lamb wrap and labeled the foil. Disgusting", "author": "A'njalee G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "We enjoyed our lunch at Oasis\nTheir chicken is well cooked \nThey have some\nTwists from your usual shawarma and gyro spots, which makes it less authentic but flavorful for sure \n\nRecommended: Kebab sandwiches and chicken sandwich (any)", "author": "Jad A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "Those Vegan Deluxe wraps are incredible. The actual wrap is perfectly, lightly toasted and the sauce is just amazing. It's also perfectly wrapped and eating it is never toooo messy (depends how hungry you are). My mouth is watering just thinking back to it. I come here just for this. I would normally suggest a business add more vegan options, but honestly, I think I would just always get the Vegan Deluxe wrap*.\n\nWait can be long-ish (5-10 mins) during the lunchtime rush hour, but faster than somewhere like Chipotle and much faster than Super Duper Burgers which is next door. I can also tell they're working as fast as they can, so there's not much they can improve there.\n\n* How many times can I use the work \"wrap\" in a review?", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "We originally went to their location at 200 4th street during the Dreamforce convention but when we arrived we noticed it was being rented out to another company. So we walked towards market street and found this location. They were super packed and the line was out the door we thought the wait would be too long but an employee was taking orders in line and he took our order from outside. By the time we paid for our food they were calling our number. The service was great and very fast I'm glad they took our order while we were waiting in line so we didn't have to wait long after paying. They have a great strategy. I will definitely come back when I'm in the area. The food was delicious, we were a group of 25 and everybody enjoyed what they ordered.", "author": "Otaman Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "Had a falafel wrap and it was delicious!! I don't eat meat but my friends really enjoyed their food and they got a mixture of meat options. This place is conveniently located next to my office so if I'm ever unsure of what to get, this is my place", "author": "Alexandria D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-05", "description": "One of those grab and go places if you're in a rush. When I was working in the City, this was my go-to in the downtown area. The menu selection is extensive since it ranges from falafels to gyros. I always get the beef and lamb gyro! There is an option for the petite version since the portion size is huge. I like that they cut it in half for you without even asking! Opt for spicy since it's not too strong and adds a nice kick. Even if there is a line, it goes by quickly and food comes out under ten minutes. There are a couple of tables where you can sit, but I usually just order and go. Prices are more on the expensive side, but that's SF for you. Compared to Super Duper next door, I prefer Oasis Grill more! Faster service and the price is worth it for the portion you get. I'll come back next time to try their shawarmas or signature plates!", "author": "Vinni C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-13", "description": "The food was decent. I was kind of underwhelmed for a place in San Francisco. The chicken seemed to be over processed.", "author": "A M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Amazing Mediterranean food! The Mixed Grill Plate is to die for. The atmosphere is great especially if you want to sit down for a lunch break or grabbing something to go. Always on my mind when I have a short lunch break from work. I would recommend to anyone in the Financial District or close by for fast amazing Mediterranean food. The staff are also great and the cashier always has a great recommendation if unsure what to get from their amazing men", "author": "Marc L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-22", "description": "I've tried chicken shawarma and it's not bad, but would go better with different sauce (or may be it was a salad , cuz it was bitter a little ) . But the sweets and hummus were nice", "author": "Anna Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-04", "description": "Not sure how I ended up going here again after my first disappointing visit, but sometimes I want to give a place another shot - oh, and I was CRAVING some falafel.\nCame to Oasis Grill on New Years day with my fiance.  Most places in the area were closed for the holiday so we stopped in here to grab two wraps to go.  I went for the vegan deluxe - stuffed with eggplant, peppers, tomato, lettuce, hummus and falafel with a drizzle of tahini sauce. My fiance got the chicken shawarma.\nService was quick as it wasn't too busy during our visit. We grabbed our wraps to go and headed home. \nDiving into my 'vegan deluxe' at home I noticed something was a bit off. Oh, THEY FORGOT THE FALAFEL. I put up that extra 1.50 for some falafel goodness and all I got was soggy veggies overly doused in tahini sauce. Pretty disappointed, again, in oasis grill.", "author": "Kelsey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Delicious, economical and quick! \nI ordered a beef and lamp wrap, the meat was tasty with smoky flavor. Good place for late dinner if you eat along. Will come back again.", "author": "Avery Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-02", "description": "Bull shit servings size ! Only go here as a last resort if ur a hungry peasant who has the hook up. Chicken kabobs were 5 bites of chicken that was a dry as ur granny feet", "author": "The Jewbador H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "3rd time around to order frm here, Oasis Grill, since it's also close frm my office n Westfield Mall in Market St.  I'm addicted to their lamb n chix shawarma plate plus w mixed veggies/salad on the side. It ranges frm $8-15 depends on what u order. The plate I order is good for 2-3 servings so I share it w my daughter n hubby(if its chix). Really good n reasonable $ to satisfy mediterranean/greek cravings. Their desserts r good 2! I tried their baklava, pistachio, rose n hazelnut mini pastries.", "author": "Theresa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "One thing I noticed is this place is clean and neat. Their plates are well seasoned, fresh and just the right portions.", "author": "Mia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-07", "description": "If you're looking for Mediterranean food this is not the place. The food here is very lackluster to say the least. The hummus was bland and my food had peas, bell peppers and avocado. Seems more like Tex mex meets Mediterranean/California cuisine. Very disappointed.", "author": "Alvaro C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-31", "description": "I recently tried lunch at this place. I had a chicken shawarma wrap and it was just OK. This place was not too busy even during lunch time which is a plus given that most place nearby in Market street gets pretty busy. The wraps are made very fast and it might be a good to order to go. If I am in the neighborhood I will go back to try the mixed meat or beef plate.", "author": "Raman S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "I never had shawarma rap better then this place. Its just the beast place for Mediterranean food but i necer tried thier combo so next time ill tey that too.", "author": "Atharva S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-14", "description": "How very disappointing? I ordered their Fattoush Salad with chicken and hummus with extra dressing and there was not a drop of dressing on the salad. Being middle eastern it's a must to have dressing on this salad. $13 later I am not a happy customer especially since I won't be able to walk back.", "author": "Karen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "If I could give oasis more than 5 stars lets just say I certainly would. My first experience with oasis I was so impressed with the food I had to come back, every time I have gone I choose something new from the plates that come with the pita, to all of the wraps that are all excellent ! The food is always so fresh and doesn't leave you with that \"greasy food\" feeling. They really use fresh products and no matter how long the line the food is always so fast. The staff truly take care of their customers and even remember you when you come in. If you are in the city and looking for a satisfying meal, oasis is the place to stop !", "author": "Taylor K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "Amazing! This place is the real thing, always fresh. Great food, excellent service, nice people. The owner treats everyone like family.", "author": "Jane D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-26", "description": "EHHH. Never tried the original shop, but if this is what it tastes like, I'm okay with it. A quick lunch spot in the hustle of this area, if you needed to grab-n-go.\n\nCame here Saturday around 3 pm. I ordered:\n1 chicken shawarma wrap // $9.99 It's interesting, because most of the time chicken is the cheapest option but this was the more expensive of the wraps. (\n+Plenty of chicken! \n+NOT a tortilla wrap...YAY! \n-Sauce is meh...\n-Vegetables were fresh but old. Aka, the tomatoes are real, but they were too soggy. \n-Chicken was too dry! It wasn't properly marinated either. \n\nPros:\n+Quick service. Grab and go! \n+Good portion size. \n+Decent/standard price.\n\nCons:\n-Ehh. I've had better. \n\nOverall, would stop by again if I was super hungry. Needless to say, this area doesn't lack other restuarants to try first.", "author": "Hurjane V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-16", "description": "Good quick food joint. Pretty reasonable for the city. Good portions enough to fill up. Good spices and even amount of filling for the lamb and beef gyro. I over looked their salmon wrap and petite wraps, which the petite are a bit cheaper. May be a better pick on a petite wrap if you don't eat too much, I haven't seen the size of it yet. I'd come back on lunches, I came around 3:00pm.", "author": "Anita P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-12", "description": "This place is ok if you want to have a quick bite. I had the veggie Mediterranean wrap and ordered it to be spicy but it was not at all spicy. Also, they give Lavasha wrap which is a hard bread and not pita wrap which is usually soft. However the place has a nice ambience to it.", "author": "Varun S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-01", "description": "I had to wait 23 minutes for food because they forgot my order. There were 7 people behind the counter doing apparently nothing. I mean I could have fermented garbanzo beans and made my own hummus in the time I waited.", "author": "Ashlyn R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "I LOVE this place!!   I'm vegetarian, and it's lovely having several options here, all of which are delicious!   Everything is fresh and flavorful, in good-sized (filling!) portions, and it's usually prepared pretty quickly, even when they're busy.  I particularly love the Mediterranean veggie melt (I always have them add some of their fantastic baba ghanoush) and the vegan wrap.   My carnivore husband had a little of that, and plans to order it next time.  Super-satisfying.  It's a great combination of things you don't typically find elsewhere, and has just the right balance of flavors and textures... SOOO so good!", "author": "N G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "Oasis Grill has some of the best Mediterranean/Middle Eastern food in San Francisco! Super tasty falafel and baklava!\n\nBut they are also owned and operated by some very fine people. They support civil rights work and feed the homeless. Just today I went there for lunch, like I do several times a week. When I walked out, there was a homeless man who was crying, having just had a bunch of his stuff stolen. I gave him my falafel wrap and went back in to buy another. They didn't charge me. \n\nThese people make really tasty food and definitely deserve your patronage.", "author": "Vlad K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-26", "description": "These guys \"hooked it up\" with a last minute company party.  We walked in at 3pm and placed an order for 40 people...I left it up to them to decide what we would have... only said that 30% needed to Vegetarian.\n\nThey did Deliver! the two Wraps they made were delicious! one Gyro and one Falafel.... I might actually say that I think about going back on my own to get another.  Thank you and & Happy Holidays Team Oasis!", "author": "Cameron C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-04", "description": "Oasis is fairly near my office, and I try to eat here at least 2-3 times a month. Fresh, flavorful, and well-priced food (I usually get the falafel wrap, which is under $10), quickly and cheerfully served.", "author": "Jethro B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "We found this place while shopping. The owner was very accommodating. The Food was mediocre. Will I go back?  There aren't many Halal/ Kosher restaurants in the Vicinity, so I guess I will stop by", "author": "Asma P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "Ordered the Vegan Deluxe sandwich which is the Eggplant pomegranate wrap with the add of felafel. Wrap is delicious and the veggies are fresh. The felafel are also above average. The place itself looks newly opened but could be a little cleaner considered I visited between 4:30 and 5 pm which is pretty dead (on one else in the restaurant beside me). Staff is friendly.", "author": "Davide S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-03", "description": "Ordered Chicken shawarma plate which had\n- boiled chicken which lacked any flavor\nWith bell peppers\n& boiled cauliflower\n& steamed brocolli\n- watered down hummus\n- yoghurt sauce with cucumber\n- some potatoes\n\nFirst of all I don't expect all these veggies in my shawarma plate, they thrift on the meat! \nWho eats cauliflower and brocolli with shawarma.\nSecondly, it's pretty expensive 14.99$ for this pretentious platter.\n\nIt could be the weirdest non-appetizing shawarma you will ever have", "author": "Zeba S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-16", "description": "The worst mezza plate ever! I've been going to the location on California street and I've always enjoyed the food.\nTried the location on market today and it was so bad, I couldn't finish it. Everything was bland and tasteless. The salad came without any dressing and pretty much everything was gross. The staff who took my order did not even look at me when she was taking my order.", "author": "Nazanin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "Amazing food! I come here all the time for my lunch. The service is always great and with a smile.  Highly recommend this place!", "author": "Ling W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-07", "description": "Tried out this new Oasis Grill on Market St, not far from Montgomery Bart Station back in Sept 2015.\n\nGot in line to order, service is slow, paid and had to wait a bit.  I got Chicken Sawarma - it took a few minutes to get.  It was cut in half for me, I was able to finish it so not that huge.\nChicken can be dry, get extra Tahini sauce and their hot sauce is spicy!  Get them on the side and maybe mix them together.\n\nNot in any hurry to return.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-18", "description": "The beef and lamb gyro was obviously made with frozen pre-sliced meat. Prices were too high considering the portion size and effort put into the food. Toppings were not terrible, although pretty much all I could taste was the chili sauce (I ordered it spicy). They included lettuce, tomato and a rather forgettable tzatziki sauce. The wrapper itself was not made in-house either. Over all it was not a bad lunch, but there are many other places that are simply better value.", "author": "Eric F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "11/6/2015:\n\nI was originally craving for a Chicken Shawarma, but have decided to try something else after looking at the menu. This item was the Chicken Shawarma plate and it came with Pita Bread. I came in 10-20 minutes before the lunch rush. My order taken, I paid for it and after 5-10 minutes of inputting the order, food was ready for pick up. This is exactly how quick and speedy the team here ensures every order is complete.\n\nAfter ordering the Chicken Shawarma (original flavor) at the Drumm St location yesterday, I decided to order this item as a plate. The Rice, Chicken, Cucumbers, Greek Yogurt and Hummus were all very delicious. Flavoring of this lunch is perfect, it wasn't very dry or greasy either.\n\nPros:\n- Clean store facility\n- Good food and prompt service\n- Chairs and tables are available\n\nOverall, positive experience and the Chicken Shawarma plate combo is delicious. I enjoyed this lunch and am so craving for another one while writing this review. Oasis Grill is definitely an excellent choice when it comes to satisfying those Shawarma cravings.\n\n11/10/2015:\nI came in for lunch right after a workout session at the gym. This time I ordered the Beef & Lamb Gyro, it was absolutely delicious and I am craving for another one. There are plenty of reasons for me to visit Oasis for Gyros and Shawarmas. One of them include friendly staff and customers plus clean facility.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-15", "description": "I wish there was an option for zero stars. The staff in this location were rude and acted like they couldn't have cared less that I was in the restaurant. No wonder why I was the only person in there and Super Duper Burger was packed next door. The cashier looked annoyed that he even had to get off of his stool to put my order into the register. Terrible customer service. Will never come back here and do not recommend, based on the poor overall experience. The food also took way too long to come out. Stay away and find somewhere that appreciates your business.", "author": "Brad P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-19", "description": "Finally gave this place a try and was quite satisfied!  Clean interior and everything looked fresh.\n\nI had the Vegan Deluxe wrap and it was perfectly delicious.  A good combination of sauces, spices, and ingredients.  Super tasty!\n\nGreat with a side of fries and hot sauce for the dip.\n\nI recommend you try it based upon my experience.  I will definitely be back!", "author": "John M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-14", "description": "Good lunch spot if you are caving in on some Greek gyros and salads.\n\nChain spot, so expect the norm and standards to hold up.\n\nClean seating area with window views.  Great for people watching.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-17", "description": "Amazing food! Food was great  but the cashier's service was horrible! He seemed preoccupied with something else while I was ordering and after I paid he threw the receipt. Aside from his horrible service, I'd come back any day for the food.", "author": "Sarai L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-26", "description": "How a Shawarma place takes 30 minutes to put together a wrap is completely beyond me. I am from the East Coast where a falafel/shawarma joint is a fast, flavourful, cheap option that is literally in every corner. This place managed to miss on all 3 of those qualities that make a joint like this a beloved place for people of all walks of life.\n\nI ordered a very simple chicken Shawarma wrap, usually in places like this, I'd watch them put it together in front of me, total time is around 1-2 minutes, at this place however, I sat down, waited and waited, 20 minutes in I asked if it was going to be ready soon, \"it is coming up\" I was told. 10 more minutes have passed, it finally arrives. I have been to pizza places that makes an entire pizza in front of you faster. \n\nThe wrap itself was insanely bad, I am not a snob by any means, but after 30min of wait time I expected it to be hot, it was cold in the centre, no not luke warm, cold. It lacked any quality that makes it a Shawarma, there was no taste of spice, doesn't taste of any camelization, the whole thing seemed like it came from a freezer, then microwave, then my plate. Forgot to mention, that there were about 4-5 people working behind the counter, there was no line, except people waiting for their food.\n\nCherry on top was that when I checked Yelp after, it had a warning pop up saying that this place was below the standards of cleanliness, horrendous experience, avoid at all means, I honestly wished I had just skipped lunch at that point, because I would only be hungry and not pissed off at such a sad excuse of a restaurant.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "I've enjoyed middle eastern classics like falafel, shawarma, and kefta kebab from a couple locations including this one and the one across from Moscone. It's definitely tasty and fresh, service has been friendly. Their hummus could stand to be a little more garlic & lemony but overall very good. I'm originally from Detroit where middle eastern places are everywhere. I wouldn't say Oasis is best ever, but it's definitely an oasis in the Bay Area which is pretty much a middle eastern food desert. Only knock is it's a bit pricey but so is everything in this part of the city.", "author": "Bob M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-16", "description": "I didn't want to write a bad review, but my last visit to this location was not so great. I read some  reviews from other Yelpers and agree with them that the service here is terrible. \n\nI came here for lunch. There was only 1 couple in front of me, but I waited at least 15mins. I almost turned around and walked out. But I didn't want to be rude. The cashier was rude. He didn't even smile. I thought it was me; but someone said he Never cracks a smile. Ever. So I won't take that too personal. \nThe other workers behind the grill smiled at me. I think the cashier Should be friendly if he is working the front. And also, they play their music\ntoo loud here. I like hip-hop music, but I don't think Everyone wants to hear that on blast. I feel like there are a lot of kids working here. \n\nI ordered the Veggie Mediterranean Melt. It was just ok. Nothing great about it. It was hard to eat because the sauce was very drippy. They didn't even give me any napkins. They keep the napkins behind the counter. I noticed other people where asking for napkins too. If you are going to serve Mediterranean wraps and gyros with the sauce, you really shouldn't be chintzy with the napkins. Just saying. \n\nI will not be coming back to this location. If I want Mediterranean wraps I will go to the Drumm St. location. Better service there.", "author": "Edie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-25", "description": "I like that there's so much seating here, and it's conveniently located. Usually I go to the Oasis Grill on Drumm St, but I happened to be nearby this one. The people that work here aren't as friendly as the Drumm St location, but I was here to get food, not experience amazing service.\n\nI ordered the beef shwarma plate, but the food tasted different from all the other times I've been to Oasis Grill. The ingredients tasted like they had been sitting out for awhile and just generally tasteless. Very unsatisfying. \n\nThe next time I'm craving inexpensive mediterranean food, I'd rather walk to the Oasis Grill on Drumm St. There isn't seating inside the actual restaurant, but there's always seating around Embarcadero Center. Lesson learned!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-18", "description": "I remember when I used to go to the Oasis Grill on Drumm all the time since I agreed with everyone else that they had the best lamb shawarma in the city. But something happened to the mom-and-pop shop run by Mohammad Zughaiyir and his wife Muna Azzghayer. Success. They multiplied in a manner much like La Boulange, which started as a lovely little French bakery on Pine near Fillmore and turned into a very packaged chain. I had a dismal experience at the Oasis on Fourth and Mission because it appeared to be run by kids who really weren't paying attention to the customers since it took them away from their mobile devices. This location is more visible to passing pedestrian traffic since it's on one of the busier commercial stretches of Market, so they are much better behaved here.\n\nThe only challenge is that the server never cracks a smile. Ever. It's a bit distressful because I wouldn't mind a warm smile to go with my pita bread. But no, not gonna happen so time to move on. The familiar menu is on the side wall - mostly wraps, some signature plates, a couple of salads and some house specials that they state vary with the location (photo: http://bit.ly/1cKaPkb). On our initial visit, Jamie W. tried the $7.85 Falafel Wrap which was good-size and hearty eating with the falafel particularly flavorful with the right consistency (photo: http://bit.ly/1Kfpt1a). I ordered the $12.99 Kefta Kabab Plate which looked like an airplane meal from the 70's, a plastic tray with individual compartments that made me feel like I was in a prison cafeteria (photo: http://bit.ly/1L0CIzB).\n\nTheir version of kefta combines both ground lamb and beef and mixes it with grilled vegetables and places all of it over white rice. The other compartments contained a diced cucumber and tomato salad with yogurt sauce on top and a seasoned yogurt dressing bu itself. Isn't that redundant? Completing the tray was some hummus and some watered-down harissa. They give you a rolled up piece of finger-burning pita in foil to sop up all the sauce in that tray. It was all reasonably good but a far cry from the euphoria I used to have at their Drumm Street location. However, the new location offers surprisingly spacious seating and a clean restroom in the back. I've been back a couple of times by myself when I wanted a quick, non-controversial dinner before heading home. Still no smile though.\n\nFOOD - 3 stars...wraps beat the plates but sometimes you want the whole meal\nAMBIANCE - 3.5 stars...you can always find a table here\nSERVICE - 2.5 stars...such a stern look\nTOTAL - 3 stars...as they multiply, Oasis Grill seems to lose a little bit more of its soul", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-10", "description": "This place was not good at all! The food was bland and dry, the service was ok the girl taking the order was nice but the owner didn't even acknowledge us.  Seemed like a copy cat place of an authentic shwarma place! Save your money people.", "author": "Sami K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-11", "description": "I came here for lunch yesterday as my girlfriend and I had this on our list to check out. She ordered a chicken shawarma sandwich with fries, while I had the ahi tuna salad. This place is not fancy, but quick with your orders.\n\nShe enjoyed her sandwich as she modified it quite a bit, and it came out correct. I enjoyed my tuna salad, however I do think for $15 the salad was a bit on the smaller side for the price. The salad itself was tasty, however it did not have as much toppings as I am used to when ordering salads. \n\nI can say that I have been here, however will be more interested in checking out other lunch spots in the area in the near future.", "author": "Tracy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "Oasis Grill has been my family's go-to shawarma and falafel fix for the past decade (at least). I've been to the Drumm St location but enjoyed lunch at the Market St location yesterday afternoon. As always, Oasis Grill did not disappoint. \n\nI went for my usual Spicy Chicken Shawarma, my cousin went for the Chicken Shawarma, and our friend chose the Shish Taouk Plate. I enjoyed my shawarma to the fullest extent - the chicken was tender and flavorful (and hey, it's halal!), the veggies were fresh, and the entire combo was well-wrapped up in lavash. Although this shawarma does not taste identical to the shawarma I've had in the Middle East, it is most certainly reminiscent of the real deal. And trust me, you'll be craving more Oasis Grill shawarma the second you're hungry again. \n\nAfter lunch, I enjoyed a slice of their baklava for the first time and it was SO good. Just enough flakiness, not too much syrup, and pistachios on top.\n\nI didn't get to order any falafel during my latest visit. However, I've had it enough to tell you that it is by far the best falafel that I have tried in the United States. I've spent a great deal of time in Dearborn, Michigan where the Middle Eastern food is supposed to be top of the line. However, none of the falafel there has even come close to Oasis'. It's definitely freshly made, not the falafel that comes out of a box mix. \n\nUltimately, this restaurant is a quick, delicious lunch/dinner spot and it's just walking distance from Union Square which is a huge bonus. Especially when you don't want to get back into your car and drive around to find another lunch spot. \n\nOverall, this is a solid Mediterranean/Middle Eastern restaurant worth visiting and trying.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Stumbled upon this place on our walk back to our hotel. By far the best Mediterranean wrap I have ever had. Ordered the chicken shawarma deluxe and it was amazing. Chicken flavored perfectly. The workers there are great, was handed a menu while waiting in line so I didn't have to take my stroller up front just to see what they had and lose my spot in line. I did not wait longer than 5-7 minutes for my food, which worried me a little until I tasted it. Highly recommend", "author": "Veronica D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-11", "description": "I was TOTALLY look forward to this place, because their sister store hooked me (by Embarcadero)!  BUMMER dude.  I paid $15+ for a Lamb Shawarma & Izze.  The lamb was dry dry dry and super chewy.  I'm eating it right now and it feels like a chore to eat.  The flavor is there from the toppings but this lunch was not worth $15 (although you can't go wrong with an Izze).\n\nCustomer service was okay, the cashier I had seemed new so can't really judge; not fair to her.  What was really nice though, was that this place was super fast and I was in and out in less than 10mins for lunch.  So it's SUPER convenient, since it's right next to my workplace. They had plenty of seating and it seemed clean & open in there, they also had patio space to eat.  Next time I come back (one day someday), I'll make the effort to eat at their patio space & peope watch (rather than eat at my desk and write an yelp review haha)\n\nOverall, I'll probably try something different and cheaper on the menu, but if I go for a shawarma I'll go to the own off Embarcadero.", "author": "Mimi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "Came here a couple of times already, though I prefer the location on 4th & Howard because the sauce is better there for some reason, that or they just add a better portion so it hits the spot.\n\nAs usual, ordered the chicken shawarma here, had it twice here and pretty consistent and solid. Owner here is really nice and they do an awesome job handling the demand, cause on Market St, you get most of the business. I just think they can do a bit better on the spicy sauce here, whether it's tweaking it or they just need to add more, cause both times I've ordered from here, they're not as saucy/spicy as the other location on Howard & 4th.\n\nThe baklava is also delicious here, really sweet of course, just like any other baklava, but definitely a good treat to have once in awhile.", "author": "Hao B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-06", "description": "I always get a shawarma when I'm here - both the chicken and beef are equally as good. The shawarma is huge! It gets pretty messy to eat towards the end because the hummus gets liquid-y from all the other ingredients. The yogurt sauce balances out the spicy sauce really well, and there's a good ratio between the meat and veggies. \n\nIf i'm craving a snack I like to get a few pieces of their falafels with a side of yogurt sauce. The falafels always taste like they were just fried and not sitting around under a heat lamp. The yogurt sauce adds a nice creaminess to the falafels.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-18", "description": "I had frequented this place for a to-go lunch and occasionally dined in. It's a great place for some good quality Mediterranean, especially falafel. \n\nFood:\nThe falafel wrap tastes fresh and delicious. So does eggplant pomegranate and vegan deluxe (which is eggplant pomegranate + falafel). Unfortunately, it doesn't have other great Mediterranean items on the menu like spinach pie and dolma while baba ghanoush is in the sides. Baklava is good and very close to the original one I ate in Dubai. Rest is all meat. But with limited options, the food is nice overall. \n\nAmbiance:\nLot of whiteness!! It's quite spacious as well. The arrangement is good but just that you need to go searching for forks, spoons, tissue etc as they are located in a secret area, not supposed to be found easily - unless you are purchasing something to drink. \n\nService: \nPretty okay overall. Easy and fast. They can be a little polite, if they try hard. In their Menu they mention the price of 1 Baklava piece but they usually sell it in a piece of two. When I asked for one, the lady mentioned that I need to purchase two since it comes that way. So, I asked why do they print the price of one when they can't sell it. It went on for about a minute until finally she gave up and sold me one, reluctantly. \n\nOverall, a nice place to have good food but try not to make the trip much interactive.", "author": "Jay M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-12", "description": "My boss decided to buy everyone lunch last Friday from Oasis Grill. Perfect, since I've been meaning to check them out. I love Mediterranean food. Especially a good Mezza platter.\n\nMezza platter ($11): This vegetarian plates comes with two falafel patties, hummus, Mediterranean salad, tabouli, Greek salad, cucumber and yogurt, red cabbage, dolma (stuffed grape leaf) and pita.\n\nPackaged well and beautiful for a take out order. The platter came in a container similar to a bento box, so everything had it's own section. I love that they also give you hot sauce as I like some spice with my food. Everything was super tasty. My only complaint would be the falafels were a little hard and the salad wasn't really dressed. But nothing a little hummus and yogurt couldn't fix. And the platter came with 4 pitas! If you like your bread, they give you plenty.\n\nI'm also a sucker for a good Mixed grill, so I can't wait to try that next time!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "This place is as good as people say it is. I got a Gyro, which was good size and pretty tasty. The owner even brought out complimentary baklava. Will go back again!", "author": "Erin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "Great place for consistently fresh food. Large serving sizes on the plates make for a good dinner. I mainly go for the kabobs. The chicken kabobs are white meat chicken, yay!", "author": "Eva B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-24", "description": "We should have checked the reviews before stopping here, popped in for a quick lunch and it took forever to get our food, I had to go up and ask about our order and I think the forgot about us because they had to talk about it and then started 30 minutes after we ordered. You know that annoying feeling when several people that arrived after you get their food before you, that's what went on for us over and over again until I had to get up and say something, didn't want to be late for my afternoon appointments and I was. the food was dry and mediocre, not impressed, hopefully they can get better.", "author": "Carl B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-16", "description": "Wow, I had totally forgotten that I had given this place a bad review over a year ago when I went in on my lunch break...\n\n\nIf I could give this place negative stars, I would. \n\nFirst off, I had like a 2 minute conversation with the girl taking my order, which was the falafel wrap, about how I didn't want the cucumber salad in my wrap and she said it would be no problem, then I get back to my place of work, and it has the cucumber salad in the wrap! I felt played, I really didn't want to return it because I no longer had any time, but I was hungry and I had tipped them. So, I call and try and be polite, and they said to come back and I'll get a refund, even though he seemed hardly apologetic over the phone. \n\nSo, I go in and make him search for my receipt that I left the tip on, which by the way was SIGNED BY THEM since I had forgot to, THEY SIGNED FOR MY SIGNATURE, pretty sure that's against the law. I cross out the tip I left them, he gives me back my refund in cash, and they he gives me another wrap free of charge, which makes me feel like kind of an asshole at this point. \n\nI get back to my place of work, trust that they got my wrap right this time, I mean they would have to right? I bite into the new wrap, and I BITE INTO CHICKEN. I've been vegan for 10 years, and vegetarian for close to 16 years, and the only reason that I got the falafel wrap was because it actually says vegan on the menu, and now they put chicken in my wrap?!?!? I immediately spit it out and head back over to the restaurant, ready to throw it in his face, but as soon as I come in, he's explaining that there was a mix up, still he didn't seem too apologetic. He finally gives me a third wrap, which he cuts in half in front of me so that it has the right stuff in it, and I finally eat that for lunch, even though my lunch is far gone at this point.\n\n\nThe final/correct wrap I received was very bland and boring, super small and mostly bread. Don't go here, there food sucks, the people are rude, it's overpriced, it's just lame AF and totally non authentic, the only reason they get business is because it's market street.\n\nOh and I've had the fries there before... super duper next door has better ones.\n\nThumbs down for this place all around.", "author": "tony d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-29", "description": "Waited over 30 minutes for a chicken wrap, after someone who ordered 15 min after me got their food first I went and asked the cashier where my food was, they had \"forgotten to make it\" and said it would be ready in 2 minutes. I will not be coming back.", "author": "Marisa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "Been wanting to try shawarma for a long time. I finally have in San Francisco. It's really good and the Oasis Grill is good! The lamb shawarma is fantastic!", "author": "Troy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "This is my first time getting food from Oasis Grill. I ordered the Mezza Plate (vegetarian). WOW! WOW! WOW! The food is so fresh with tons of variety of taste, color and flavor!! The portion is HUGE as well. If you have not tried this place, you should!! I definitely will come back again", "author": "Tesla S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "This is one of my favorite restaurant in SF. I get Chicken Shawarma almost every week and it's the best.", "author": "Praniti S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-16", "description": "Not terrible, but way overpriced for what you get and it doesn't taste like they use quality, fresh ingredients. The rice had corn, carrots and mushy peas in it, which is not the vegetables you'd expect to find in a middle eastern restaurant.", "author": "nancy s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-02", "description": "I had high hopes for this place since there were a lot of people in the restaurant and the food looked good when I walked up to the counter. I ordered the mezzanine plate since I am vegetarian. The hummus was the only thing that was even remotely tasty. The rest of it might as well have been cardboard. I won't be back. Fresh but flavorless.", "author": "Sue S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-10", "description": "Love Middle Eastern food. I will have to return and try. Here's a few points. \n\nThis place looks very bright and clean. \n\nFriendly staff & great menu choices.  \n\nAll natural meats with no hormones. \n\nLavash Wraps are about $8-$15. \n\nHouse Specials (e.g. Chicken Kebab salad) are anywhere from $12-$15. \n\nSignature plates (e.g. Kefta Kebab or Chicken Shawarma ) are $13-$17. \n\n$8 Salads (+chicken for $4) and other ~$4 sides (like sweet potato fries) too!\n\nMouth watering yet?", "author": "Glenn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "The mixed grill keeps me coming back all the time.", "author": "Rob S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-13", "description": "My husband and I ordered the lavash wrap and the plate. ( both beef shawarma) \nThey were only a very few pieces of meat and mostly salad. The dishes weren't flavorful and not at all worth the price.", "author": "Ghazal P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-20", "description": "After finishing a meeting near the Montgomery station, we walked down Market Street intending to head for Westfield mall for an early lunch. We walked by the Oasis Grill and it looked okay and decided to stop in.  We had the Chicken Kabab Salad ($13.99) and the Lamb Shawerma ($11.49).  It was easy to fine seating, but you can tell it was going to be crowded as people started pouring in lunch.\n\nThe salad was good and flavorful.  The shawerma seemed minuscule, cold, and flavorless.  We had asked for the sauce on the side, but they didn't bother with it. I would expect them to serve a better quality plate since the place was not busy.  Additionally, this place is a little pricey for the quality of food. We've eaten at Sunrise Deli many times and find that place to be heads and shoulders above the Oasis Grill. \n\nIt is unlikely that we will eat here again.", "author": "Robert J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-14", "description": "The food is average but it gets my taste buds the satisfaction. I would rather have my falafel wrap on a soft pita bread. I'll mostly come back for a quick bite since I love hummus and falafel. \nThe garbage is always overflown other than that it's an okay place.", "author": "Nadav M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-18", "description": "#aintnobodygottime to wait for Guffman #midnightatthisresto bc from walking in hangry to walking out w shawarma took like 5 mins during FiDi lunch rush. Gave me more time to chinchillax w the Avengers after credits. Matter of fact it's taking me longer to write this review than the whole time I spent there.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Food in the Financial District that is actually good. I love the optional spicy sauce they put on the wraps. They also have petite wraps if you just need a little snack. Service has been pretty quick when I've gone ~3:00PM", "author": "Lindsey F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-08", "description": "Great food and staff! Solid portions and food is prepared quickly.", "author": "Niloy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-20", "description": "I have lived in the Middle East for over five years so have some idea of the cuisine. As much as I like Locali for the Shwarma, the Falafel and the salad at Oasis is far more superior then Locali. The falafel is always fresh and their salad is really crisp. The hummus, tahini and the spicy sauce are really nice. The yoghurt and the garlic paste is a lovely touch to an already yummy dish.\n\nWill come here for Falafel wrap and my salads any given day.", "author": "Sony B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "Not quite up to quality of Drumm location, but nice to have seating and zero crowd vs. Drummer.  Had the usual, chicken shwarma.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Tasty food and desert. I recommend the beef and lamb gyros.", "author": "Julia Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-06", "description": "Came here for lunch...\n\nGood: \n- Line was short\n- Food came out fast\n\nBad: \n- Spicy chicken shawarma wrap: dry, spicy sauce isn't consistent, super messy (all the oil, sauce, or whatever was dripping from the bottom through the foil wrapping), the wrap is really thin adds nothing to the overall taste. \n\nNot sure if I'll come back, but I'm definitely not getting the spicy chicken shawarma wrap again.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-12", "description": "Am in town for a conference, so I was excited to find nearby Middle Eastern restaurant. I ordered a chicken shawarma sandwich. Sweet girl at the counter, and my order came quickly, which was nice since I needed to get back to the conference. Unfortunately, I did not care for the sauce on the chicken shawarma sandwich. I was also put off by the smell...couldn't decide if it was from the pita or the paper the sandwich was wrapped in. I am pretty picky about shawarma since my hubby is Syrian.", "author": "Laura H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-20", "description": "I ordered a chicken shawarma plate, it came out to $15. It was bunch of cauliflower and broccoli on rice with tiny bit of chopped chicken sprinkled on top of it. Im giving them 1 star for selling a $3 meal for $15. Garbage, wont come back.", "author": "Milan E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-21", "description": "Good but great. The food was average. I got chicken and the chicken was so dry...\n\nI expected better but maybe I'm biased, the one near embarcadero was better.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "Was in the neighborhood and dropped by. Ordered a standard chicken shwarma sandwich and it was excellent. Good amount of chicken and flavored well. Got tahini sauce and hot sauce in it as well and they seemed to take it to another level. The damage was around $10. I've been to the location in FiDi before and this location is just as good. Will definitely return.", "author": "Izzat A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "The vegetarian super deluxe falafel wrap is my all time favorite at this great quick takeaway place. Lots of falafel, they also make it spicy on request. Wait times are not too long and they do a great job of taking orders while patrons are waiting in queue during peak lunch break times", "author": "Harshad M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-03", "description": "First time coming here since my friends and I were downtown shopping and hadn't had dinner yet. We got here around 8pm so it wasn't full of people but it wasn't empty either. I got the chicken shawarma and ordered it to go but ended up eating it there. It was funny because me and my friend both received ours in the paper bowl yet mine was \"to go\" and hers was \"for here\". I thought the food was delicious. The shawarma was cut in half and was pretty big (like a big burrito). I liked the sauce used in it but it was spicy so I wished I had a pitcher of water when I finished the whole thing. I don't know if it was originally spicy or if it was because when the cashier asked if I wanted spicy sauce, I said yes. My friend had the beef version which looked a bit skinnier than mine but it could be either because hers was actually wrapped for \"to go\" or maybe she just had fewer ingredients. Hers was also good, not as spicy since she had a hummus sauce that tasted like peanut sauce. \n\nIt is a self-serve type of restaurant so you place your order at the counter, pay, and then pick it up when they call for you. Water is self-serve in the back along with all the utensils and whatnot.", "author": "Diana C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-16", "description": "This is not the kind of falafel places I am used to .... but spending so much time in NYC has definitely spoiled me.\n\nThat said, this spot is a solid choice for good tasting food.\n\nNot the best thing ever - but the beef/lamb gyro was full of interesting flavor and I enjoyed it.\n\nThe staff was super nice and the place is well lit and clean.\n\nI'll definitely consider it again the next time I am in the neighborhood.", "author": "Wendy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-04", "description": "Not worth it. Went here out of convenience, the food was tasteless and I was charged $3.25 for tea to go. The tea consisted of a tea bag in 4oz of hot water. I won't be going back.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-14", "description": "Super Duper or Oasis? Hmmmm. Oasis it was. Won't do that again. I ordered the spicy chicken shwarma wrap to go and added hummus. \nI hope the person who got my wrap with hummus enjoyed it at my expense. Huge fail.\nThe spice was glopped on and every other bite was covered in flavorless hot sauce. I threw the remaining half of this wrap in the garbage. An $11 lunch should not leave a person feeling ripped off, but it did for me.\nAdd in the overpriced  $4.50 Kombucha and I really feel as though I might as well have given my money to the nearest homeless on the street instead.\nVery disappointing experience. This is a huge foodie town. Go big or stay home. There are far many other places that will deliver a quality product than to tolerate subpar food at this place.", "author": "MissMimi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-30", "description": "This place is fast, reasonably priced, and takes credit card. The food is also pretty delicious, aside from one slight quirk:\n\nI ordered a spicy chicken schwarma wrap, which was tasty and seemed really fresh. But there was one issue: the spiciness was really uneven. I ate the wrap like a burrito, and the level of spiciness was a gradient: no spice at all at the top then gradually increasing to nearly unbearably spicy by the time I reached the bottom. The ideal level of spice was around the halfway point of my wrap. Either Oasis Grill should work on evening out the spiciness, or they should warn us to \"shake before consuming\" to spread out the flavor.\n\nI also ordered fries which were, surprisingly, really good. I would have given this place 3 stars but the fries bumped it up a star. Just the right amount of crispy and just the right amount of salty, these fries were fantastic. \n\nIf you get a spicy wrap, give it a few shakes first, and definitely order a side of fries.", "author": "Brittany C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-17", "description": "I have heard a lot of good things about this place but I found out that  food here is not that great after all. The food is pricy and not very delicious. I liked their baklava but I felt it was too sweet.", "author": "Deeksha R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-28", "description": "My dad and I came here for lunch before a 2:00 p.m. showing of Elf the Broadway musical. We almost went to Super Duper Burgers next door, but I didn't really want a burger. My dad ordered a beef shawarma plate and a bottle of diet coke for himself, I got the chicken shawarma plate and a bottled water. The total came to about $33. \n\nSeating: Seating was good especially since we arrived at about noon. The place filled up pretty quickly after we ordered and sat down. \n\nFood: Our shawarma plates were delicious! I didn't really care for the yogurt dip or the cucumber salad or the red spicy sauce. The hummus was fine, but I expected the bread to be better, like Indian naan or something (shouldn't have expected that). The rice at the bottom of our shawarmas was great! I wish there were a way to order just the shawarma part of the plate and not the rest of the stuff. \n\nAtmosphere: The music soundtrack for the first 15 minutes we were there was the new Taylor Swift album 1989. I am not a huge fan of this album, nor do I hate it, so I really could've listened to something else, like Jackson 5 or Earth Wind and Fire (I'm a big soul music fan). Towards the end of our meal, a homeless lady came in asking some patrons near the door for money. The cashier had to come to tell her to leave if she wasn't going to buy anything. The homeless lady was compliant, although stepped out of the place and briefly stepped back in before leaving. The cashier who told the homeless lady to leave also apologized to the rest of the patrons for the disturbance.\n\nP.S. My dad was sitting faced away from the door, so he didn't see most of the incident, but after lunch, we went to Marshalls where I bought a four-pack of black socks for $8 to give to the homeless people in downtown SF. They appreciated the socks so much! I wish I could've given a pair of socks to the homeless lady who came into Oasis Grill, but I couldn't find her after Marshalls.", "author": "Di W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "shawarma shawarma shawarma. i just like saying that word. i came here with some coworkers and ordered a chicken shawarma with curly fries. the shawarma was really filling! i almost finished it but i gave up (i was also eating some curly fries) there was a lot of sauce in my shawarma so you can imagine how messy it was to eat it haha. i definitely enjoyed my shawarma and my curly fries. i was full up until dinner time and i'm usually hungry 2-3 horus after lunch!", "author": "Sylvia H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-11", "description": "In short...no flavor whatsoever!  I ordered a Kefta Kabob wrap which was disappointing all all fronts.  I had high hopes after reading the description, but it just didn't come through in the end!", "author": "Gene D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "I have been there 2 times, and both amazing. the first time i tried the \"Lamb Shawarma\", and was good, but the last time i tried the \"Chicken Shawarma Deluxe\" and was delicious.\n\nIf you are not spicy lover, you have to be very specific while ordering the shawarmas without spicy, because they put on it, and its really strong, so you may no enjoy the taste of the shawarma.\n\nThe location is normal. \n\nThe attention is ok.\n\nRecommended!", "author": "José Gregorio T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Thank you Hairstylist Shaun for the great hair and the referral to Oasis for a falafel as good as NYC. Having a great falafel was so wonderful ,can't wait to go back for their crunchy outside soft inside not too spicy super yummy falafel", "author": "JoAnn W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-03", "description": "I had a really bad beef shawarma wrap here today. Truth is that it came in as a wrap however it was mostly lettuce inside cheap cold flat bread! No beef shawarma to be found. Literally a few specks of fatty beef with a ton of tahini sauce. I got sick to my stomach that it was so horrible. Not to mention it is $12 something dollars plus tip and no sides. Steer clear and go somewhere else.", "author": "Emre T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-11", "description": "I haven't gotten my food yet... they got busy and someone took orders on paper and I think they must be filling them in reverse order. Meanwhile I'm standing here and a roach just ran by. They're working hard, but it doesn't seem sanitary. Dirty aprons are touching every wrap when they reach for stuff. They've filled almost all of the orders taken while I was in line. Down to 2 papers left (of at least  and haven't called my ticket yet. I should have canceled the order. I'm not going to eat it.", "author": "Heather M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Really good food and clean.  Very friendly people working here!! Best chicken shawarma!! And the best BAKLAVA dessert!!", "author": "Cristina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-13", "description": "Good food but no sauce.\n\nWent there for a quick lunch bite. The place was pretty crowded but the line moved quickly. I got a beef shawerma wrap and it was pretty good. The meat was juicy and the quantity was OK. What was missing was the typical chilli sauce. \n\nAnyway, it's a good place for a quick bite but not really special.", "author": "Di H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "BOMB (dot) COM! \n\nBe gentle, I was a newcomer to this chain, but I thought the chicken gyro w/ that medium spice level hit the spot on every level. Every bite was delicious and the heat was just right. I definitely will come back! \n\nPro: BOMB food, comfortable seating, acceptable portions", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-01", "description": "Had a craving for falafel and I decided to give this place another chance as it is close by. Food was fresh and the service was prompt and friendly. I feel that last time I was overcharged was an honest mistake. If you go for spicy it is a pretty good kick, I'd probably ask for it to be a bit lighter on the hot sauce next time though. Note: interesting selection of drinks!", "author": "william c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-14", "description": "The lamb and beef gyro is pretty good and is affordable for the area. The line move pretty quick and they have customers oriented cashiers.", "author": "Master R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-13", "description": "Very bad service and the food isn't anything to write about. Wonder how they are still surviving with so many good Mediterranean places nearby. Will never go back!!!", "author": "deeksha l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Best chicken shawarma and hummus I have had in SF. Tidy place, friendly folks (gave me a free extra pitta). Fattoush looked really nice and fresh! The bread is done there too (could see a clay oven at the back!).", "author": "Faisal K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "I like the Veggi and Vegan food here.. Falafel and Vegan Delux are my favorite so far!", "author": "Andrew I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-05", "description": "First the location is super convenient,second the establishment gains your immediate attention for its cleanliness,thirdly the Customer Service is great. But hows the food? I ordered a Beef and Lamb Gyro with a side of fries-heavenly! The fires were pure perfection,and more importantly the Gyro was authentic the meats were so well textured and flavored, the entire thing comes together to be a pure eating delight.", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-02", "description": "Chicken kebab and hummus were both good.  Not enough to ear 4 stars, but definitely good to earn some repeat business at future lunches.", "author": "Lewis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Love Middle Eastern food. I feel like home back in Middle Easte . Here's a few points. \n\nThis place looks very bright and clean. \n\nFriendly staff & great menu choices.  \n\nAll natural meats with no hormones.", "author": "Moaid M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-25", "description": "One of the best Mediterranean places I've been to in the city.\n\nPros:\n- The food is good, nice selection.\n- The prices are great, for both quality and quantity\n- This particular Oasis serves french fries @ lunch while the other one in the FiDi does not.\n\nCons:\n- Large lunch crowd (of course)\n- Not a lot of seating inside, but on good days you can go around the corner and sit outside\n\nWe get this catered at the office sometimes which is great, but I often like to come to get the freshest gyro possible.", "author": "Wes H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-27", "description": "I've been here a few times, I've tried the falafel and the chicken shawarma. I usually stop here on my way home after work when I don't feel like cooking. I enjoy both, they always ask if I want it spicy but I always opt for the not spicy. Service is always pretty fast as I'm in there well past the lunch rush. The staff is always friendly. Great place for a quick meal when you don't want to cook and it's not pricey.", "author": "Kim L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-11", "description": "Food is good, not as good as the other locations. \n\nPrice is insane though! $4 for a tea! \n\nCustomer service: 1:40pm Wednesday, I do apologize you're life is miserable but be somewhat friendly good lord. \n\n3.5 stars on food\n1.5 stars on price \n2 stars on customer service", "author": "Tom S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "I always walked by this restaurant and ignored it because I thought it seemed like some strange empty fast food place. But upon looking at it on yelp, I was intrigued since it had a lot of reviews and I love Mediterranean food. Finally gave this place a try with my friends one night after shopping in downtown. \n\nYou go to the cashier and order your food, then you get a number and you can choose your own table to sit at. I thought the prices were a bit on the pricey side (around $9-10) for shawarmas, but its downtown SF so not too surprising. I got the beef shawarma which was delicious- meat was flavorful, the hummus and the vegetables went really well with the beef. It was really spicy though (I believe the cashier asked me if I wanted it spicy and I said yes), and it made my tongue irritated because it was so spicy- but I powered through because it was so good. \nMy friend got the chicken shawarma which was even better than my beef one, and $1 cheaper, so I'd recommend that one! I tried hers and had entree envy, lol. The chicken was not dry at all (which is what I feared) and the tahini sauce was delicious (it tasted peanut buttery). I wonder if I could get that sauce on the side because it would've made my beef shawarma 10x better. Hers was quite spicy too, but still really good.\n\nI'd come again for that chicken shawarma if I'm ever in need of a quick lunch or dinner on the go.", "author": "Kathleen Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-08", "description": "3.5 - good gyro, housemade hummus, decent prices.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-23", "description": "I have never had Mediterranean food in my life so my boyfriend dragged me here to try some. I thought it was OK.\n\nFirst off, this location has no where to sit which was fine because the Embarcadero is super close and we just walked it over there and ate on the pier. However, the men working there kinda of rushed me to make a decision on my food and they were abrupt and not very friendly. \n\nThe back where they were cooking looked super messy and there was a pot in the back boiling over the sides and the white mushy stuff was falling i the stove and it made my stomach turn a little before I even got to try anything...\n\nI got the Mezza platter ($11) and its a decent amount of food but the best part (the falafels)was the smallest portion. They gave me a metric ton of this yogurt stuff  other white goupy stuff and hummus and then two tiny falafels...I felt like I was eating a giant platter of dips. That said, the dips were good, I just wish I had more falafel or pita to dip into them.\n\nTL;DR They give you a plate of dips and nothing to dip into the dips.", "author": "Loryn F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "Halal meat is served here. Owners are known Muslims. Decent sized location near Westfield Shopping Center on Market Street. I ordered the Chicken Shawerma Melt (with cheese), but they didnt have that at this location.  They were able to make it for me (charged me $1 extra for the cheese) and a \"snapple\" like drink. The cost with tax was almost $15 which I was very surprised about.  The food quality was good, with a lot of meat in the wrap. Friendly service, but prices are bit on the high side.", "author": "Irfan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "Delicious food! I love the chicken shawarma and beef shawarma. Very flavorful and filling. Owner is a very nice guy who really cares for his customers. Will be returning for sure!", "author": "Wana A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-21", "description": "I love their spicy falafel wraps here - have always been consistently good. Service is usually quite fast too.", "author": "Julian F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-09", "description": "They dont know how to cook lamb. They use pretty old lamb and almost no spices or venegar. Smells and tests horrible.", "author": "Oleg O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Love Oasis! Come here at least once a week for the Chicken Shawarma and hummus. Its a very cute family-run business with their food made fresh daily. The cashiers are friendly and the food is always ready less than 5 minutes of ordering. I would also recommend the Mix Grill if your really hungry which comes with a chicken, beef and kefta skewer on a plate full of sides.  Definitely 5 star all around!", "author": "Deirdre C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-25", "description": "Well.... this is place is super awesome... if you have a strong affinity for food poisoning, rude service, and a fleet of staff that would rather be doing literally anything else than their job. The location is prime for a mid shopping/ work day snack but you really shouldn't take the risk because the rest of your day will be violently halted (I'll spare you the details)", "author": "A. B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-03", "description": "there was plastic saran wrap in my shwarma..... see pic above, disgusting! i will never go back here", "author": "Joan J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-13", "description": "So I walked in here by chance, mainly because super duper had a really long line for lunch and no place to sit. The place itself is very airy and it wasn't too crowded. The cashier counters seemed a little chaotic, but things were moving. The food itself was OK, but it seemed to be fresh.", "author": "Ketaki S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-02", "description": "Dear Oasis Grill,\n\nI have been frequenting your locations since my arrival in SF in 2010. From the Shawarma to the Gyro to the Hummus and from FiDi to SOMA, I have always been pleasantly satisfied with all aspects of your service and cuisine.\n\nHowever, today marks the day of an all-around undesirable experience. With my busy work schedule, I ordered the Mezza Plate to save time. My coworkers ordered the Chicken Shawarma wraps after me, and to my surprise, they received their food first. No problem...frying a falafel can take time, right?\n\nMinutes and customers pass by and I watched two other Mezza Plate orders go out, with nothing left on their assembly line resembling my order. I glanced at the tickets on your window, and my ticket was gone. I approached the female cashier, who seems to always look annoyed and never smiles. I asked about my order, and she said that they were making it. My eyes spot falafels sitting on the fryer basket, so I inquire once more looping in the manager(?) this time.\n\nThey explain that the Mezza Plates are all pre-made, so all they need to do is put the falafel on before giving it to the customer. My puzzled look was met with assurance that it just finished cooking as they scrambled to produce my order. The lavash was quickly and half-heartedly heated on the grill, and they sent me on my way.\n\nI left feeling disappointed and lied to, staring down at my Mezza Plate decorated with stingy portions and excess condensation. Why did I spend 30min and $12 on a cold vegetarian dish? Maybe they could tell I need to shed some Thanksgiving weight. \n\nI won't be back for awhile likely due to the fact that my coworkers regretted letting me choose today's lunch spot. I'm hoping things will be better when I do.\n\nHappy Holidays,\nNick W.", "author": "Nick W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-02", "description": "OK, I've definitely had better shawarma, and most definitely had worse.  This location hasn't been open that long, and compared to their Montgomery ST location, at least you have seating... not a lot, but some seating.\n Not too bad for a quick stop for lunch, but it is pricey for what it is.  Let's face it, you can get better shawarma or gyro off a truck, and for half the price.  I recently read that my favorite NYC shawarma cart is opening a location in San Francisco, but until they do, this will have to do.", "author": "Scott T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-24", "description": "This place has amazing food!\nEven though I'm a vegetarian I have a nice verity of option to eat in oasis grill.\nMy favorite thing there is the falafel- if this is the best falafel I had in SF and Bay Area!!\nIn addition to the food being amazing also the service is very good, all the employees  are really nice and friendly and the food doesn't take long. \nGo there, eat there, also desert (amazing baklava) !", "author": "Debbie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-06", "description": "This place isn't that great. Seating is awkward. The food doesn't taste very special and it's expensive. Grilled ahi tuna wrap for $15? Beef melt for $11? Why?\n\nI witnessed a lot of confusion going on in the kitchen, arguments with customers, and managers reprimanding their employees. Not fun. \n\nAlso, no hot sauce? And ketchup in little hunts packets? \n=[", "author": "Dan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-24", "description": "Fast, delicious, and fresh. What more could you ask for? This is a fantastic option for lunch or dinner in the Financial District/SoMa area! I've been meaning to try this place since I saw it open and I'm glad I got a chance to do so. I will definitely be coming back!\n\nI got the spicy chicken shawarma, which had sliced chicken breast, hummus, lettuce, tomatoes, house garlic sauce, and spicy sauce wrapped in a lavash. I will admit, it was pretty spicy, but the spiciness did not hinder the amazing flavors that were in the shwarma. I didn't taste much of the garlic sauce though. \n\nWhat really amazed me about this place was how fast the service was! A woman took my order while I was waiting in line and by the time I got to the front to pay for my food, my food was ready. I just paid, grabbed my food, and left. It was almost like I ordered beforehand and picked it up! Also, love that you can get to see the cooks prepare the food.\n\n Overall a great place and if you haven't tried this place yet, you definitely should.", "author": "Hana K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-08", "description": "This restaurant gives the finest cloth-like paper napkins I've ever seen, period.\n\nThe chicken shawarma plate and salad is my favorite. The cucumber and yogurt salad is very delicious!", "author": "Brian T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-11", "description": "I like it!  I picked up an early lunch to go for the first time (early lunch on a Sunday, not too busy so good time to go).  I got two wraps (falafel and chicken shawarma) for about $17.  I took it home and we were pleasantly surprised as the wraps were huge! (we cut them in half and switched halves to try) and oh so tasty!  I can't wait to try more!", "author": "Maile N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-25", "description": "It's just good, not amazing. Would go whenever I have a craving but willing to try other spots.", "author": "Grace C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "Great Mediterranean food in the city. Big portions and quick service. I thought my pita could have used a little more of their sauce but my mom said hers had plenty. Will be back.", "author": "Brittany S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-19", "description": "This is my second time here. The first time I got a tuna something and it wasn't great. Today, to give it another try. I got the Spicy Falafel Wrap. It was absolutely delicious. I really enjoyed it. Service was prompt and the guy was friendly. I got my food within five minutes. I didn't think it was incredibly pricey for a vegetarian wrap, it was big. The spicey sauce stuff went to the bottom of the wrap that was kind of annoying, but it was still really good.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-02", "description": "Customer service was fine but the food was terrible. I had ordered a beef swarma wrap. It was a decent price for its size but the problem was the smell. I am not sure if the meat was rotten or if the sauces and ingredients made my wrap smell terrible. I could distinctly describe the smell similar to, the tarter gunk between your teeth.  The smell of my wrap was so bad that I had to throw it away. Sorry to give a bad review, but this was my experience.", "author": "Chan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "I am a Oasis Grill fan in general, so I eat at all of their locations! But I love this one when I am at shopping Union Square, where there is not decent healthy food unless you want to pay a lot of money in fancier restaurants or get a burger. Their prices are reasonable for the amount of food you get on your plate. This location is little bit fancier from their other locations, I love their custom made tile mural it's so beautiful! I got the shish taouk plate, omg it was so yummy . It's probably the best I ever had and I am from the Mediterranean so I know this food! I have gone to places in LA and none compare to Oasis Grill even in SF they truly have the best food and especially for the price. I asked them and everything is made fresh house marinates, hummus salads are done In an old fashion manner all by hand and time consuming,Their halal meat is superior to their competitors as they get it locally all natural and fresh. The owners are super nice and dedicated to making their locations serve great food but affordable.  Oasis started almost 20 years ago and talking to owners they say to do business in SF is real expensive and sometimes people don't understand that. But when I compare them to other businesses In Their price range and the quality of what they offer is superior to a sandwich and salad place, there is no comparison as they are a full service restaurant and sometimes that gets overlooked!", "author": "Warriors G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-12", "description": "The staff is rude, they swore at my friend when he needed to use the bathroom would not recommend. I did not like the atmosphere either.", "author": "Charlie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "After Aisha informed me of the proper pronunciation of Gyro.... things were much easier. Have not had Mediterranean food very often, it was a nice change. Had the beef and lamb gyros.. very good.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-25", "description": "Worst Shwarma ever. They would have had to make the chicken out of sawdust to get it any tougher or dryer. Nothing else that you typically get in a Shwarma was in there like hummus. Their lamb was the stuff you get from the restaurant supply 20lbs for $15 so I avoided that. Could only have a few bites. Taking rest home to my dog. And their water cups are like 4oz in size. Super annoying.", "author": "reza n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "Don't understand why or how this only ha 3 stars. This food is amazing and so fast. Perfecting you work around here and need something quick. Never mess an order up and you are in and out. Get the Greek salad with chicken spicy. I'm addicted.", "author": "tricia m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-23", "description": "Very quick and tasty! I had a falafel wrap. Not a very cozy place, but the food is good for the money, and was made rapidly.", "author": "Kristina K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-15", "description": "I walked over to go to this burger place and it was crowded so I thought I would try this other place. The lady barely listened to me and when asked how spicy j said I wanted it mild what I got burned my mouth a\nI asked them to make another and they did but acted like the problem was with me. The place was nearly deserted at the height of lunch hour with the place next door was packed with a line out the door.  Will never return to this restaurant", "author": "Eric P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "This is the place to get a Kebab or Gyro in the FiDi. I love all of these mediterranean wraps and it's great there is a place so close to work that does them so well. \n\nFirst, the Kefta Kebab. A lot of people look at the meat on the skewer and assume that's where all the quality comes from. \"No!\" I say. A very underrated component is the sauces and fixings. The combination of Tzatziki and whatever their spicy sauce really compliments the meat. It doesn't overwhelm, but it adds that zing that I've never been able to replicate when cooking on my own at home. I like a bit more of a kick, but just a warning that some people sensitive to spice might want to mention it before you sandwich is made. \n\nBeyond that, the prices are good. $8-10 for most wraps, which I think is incredibly reasonable. You get more than enough food, and the platters look like they have enough food for a left over snack later. Otherwise, this place is noticeably cleaner than you'd expect. I'd hit it up again for lunch in the future.", "author": "Jake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-20", "description": "Fast, fresh and delicious! Stopped in for an early dinner at about 5pm. No line and I got my food within 5-8 minutes. My beef lamb gyro was warm and the veggies were fresh. Also go a tabouli salad that was packed with flavor. Good sized portions and even better flavor.", "author": "Claudia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-08", "description": "Walked in and ate here for the first time, and wow, this place has amazing food. I wish they advertised photos outside of the restaurant so I would find it sooner. Subsequently, the food is a 10/10, however, the cleanliness is a problem. There were 5 employees/workers, and not one cleaned off the tables for us. There is no trash near the exit, and that posed as a slight inconvenience. With that said, astonishingly delicious place, and I HIGHLY recommend it. I will change 4 out of 5 stars to a full 5  if the tables are clean for me to eat the amazing food on. :)", "author": "Vadim F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "I came across this place a whim while desperately seeking somewhere that wasn't filled to the brim. This place was almost empty at the time, so I went in after seeing the reasonably priced food on the menu. I ordered a falafel wrap and wasn't expecting much. However, this reminded me of the ones I'd get while I was studying abroad in Spain, but better since the spicy sauce was actually spicy!", "author": "Gloria A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-07", "description": "First time here. The food tasted pretty good and is economical. We ordered a platter and a shawarma and the shawarma was good. The platter was too much for a single person (but that's just me).", "author": "Zaki S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-10", "description": "Do not mistake this for the \"Oasis Grill\" on Drumm St.! I don't know how they are allowed to have the same name as a place that is half the cost and ten times better, but somehow they are getting away with it. These people, while friendly enough, do not put love into their overpriced wraps.", "author": "Skeptical Spee .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-23", "description": "This place has the FRESHEST awesomest food!!! Lunch was amazing!! The decor and atmosphere was comforting!! This place is a must! And did I mention how great the staff is??? Everything is clean and organized everything is cooked right in front of u!!! It's a MUST to eat here!!", "author": "Tami S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "The falafel wrap was packed with flavor. It was delicious and I am picky about my falafel. The beef and lamb gyro was out of this world. I love this place. Too bad Oasis Grill does not have branch in Los Angles", "author": "Ankeen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-03", "description": "The service was excellent. Very friendly and our food came quick. \n\nI had the gyro. The meat was tasty and there was enough, but not too much, veggies. \n\nHowever, there was too much of the wrap and not enough meat, so it seemed a little dry. I wish they gave more meat. I'm not a local, so if I want another gyro, I'm going to try elsewhere.", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-04", "description": "Quality is fine, but quantity to price ratio was low.", "author": "Quinn S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-25", "description": "Good food, rude staff, first time I went there I was ordering in Arabic, this time the guy refused to talk to me in Arabic and treaded me in a very rude way!!!!", "author": "Mimo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "I was pleasantly surprised by the quality of the chicken spicy shawarma. I would definitely get it again. It is a little bit on the dry side but they add sauce to it to make up for the chicken dryness. Priced about right and filling.", "author": "David S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-04", "description": "My husband ordered his wrap to go. His wrap was a faucet of runny yogurt sauce, splattering on the sidewalk and ruining his black trousers. He had to hold the wrap over a trash can to finish it while we tried to wipe his black trousers clean with diaper wipes. It didn't work. We didn't attempt to wipe the trail of yogurt sauce behind us. \n\nThe kebab itself tasted terrible. Low-grade meat. Nice and soggy thanks to the yogurt bath.", "author": "Zara Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Fresh food and healthy, the platters and wraps taste authentic and does not taste like fast food. The protien and greens combination are very balanced. Even the fries taste fresh. The place needs ambience improvement because its too bright and white but overall, the food is really superb.", "author": "James Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-13", "description": "They should know Americans refer to a gyro as lamb/ beef in a pita not a lavish. A lavish makes it a shawerma to us.", "author": "H K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-12", "description": "Do u like shwarma that are half the size as the other place? If so come here, this new place sucks!!!", "author": "christopher h."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-06", "description": "Extremely mediocre and overpriced food. I came in craving a light lunch and just ordered a Shish Taouk plate. The amount of shishtaouk I got is comical considering I just paid around $14 and some change for this. The portion size for the rice is equally hysterical, not that it matter because the rice is bland and does not have any traditional middle eastern spices to it (in fact, there is corn and carrots of all things, in it.)\n\nNow legitimately more half of this so-called platter is a giant ass helping of tzaziki sauce, hot sauce and a truly subpar attempt at Shepard salad ( the finely diced cucumber and tiny-barely-there-tomato pieces taste so bland and not fresh like someone did not even bother to try). I can't stand when I pay for something and not get what I paid for and mind you, I do not even eat big proportions and wasn't even hungry when I came in here. That salad could've at least used some dill and olives -- jeez how can anyone label their cooking mediteranean and sell it like that.\n\nTo seal the deal, the hummus is equally bland in both flavor and texture which made munching on the generic pita they served seem like the way to go.", "author": "Mia F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-27", "description": "Went here for lunch. I was sad it replaced Del Taco but I love Mediterranean food and was eager to check out the new kid on the block. The salads looked really good so I decided to get the Mezza platter with chicken on the side. The falafel and dolmas were solid, but the rest of the options were just whatever. Three of the salads were underdressed/not dressed at all and the tzatziki was also missing something (flavor). The biggest disappointment was the chicken. It looked tasty and well seasoned, but when I tried it, it was dry and bland. Definitely not worth the extra $6. If I go back, I'd stick to the vegetarian options.", "author": "Christy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "Love this place! Excellent cooked beef and chicken. Large portions and they include bread and rice, salad, hummus, tzatziki dip and the meat of your choosing. They get you in and out with good tasting food. They don't have a lot of seating. I love this places great food of excellent quality and good service.", "author": "Jannet H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "No stretching the truth by mixing yoghurt in Tahini.  Just super fresh Middle Eastern foods (wraps, salads, signature plates with fresh, thoughtfully seasoned meats or falafels) that will keep you and your friends returning... Like us!  Grateful counter service....the work team shows authentic warmth and dedication to make each order perfecto!", "author": "Paula H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "This place is not authentic but I don't know if they claim to be. I can't stop thinking about the spicy falafel wrap I had for lunch and dinner (they're huge). Amazing flavors and unlike a lot of other places, they make their falafel from scratch. The sauces are so flavorful!", "author": "Daisy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-19", "description": "A-OK! I was wasted one night needed something quick and semi healthy, this was perfect! I ordered the falafel wrap everything in it was very fresh! I would come back for sure!", "author": "Karen T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-10", "description": "Amateur hour here. No TLC or respect for what they're makibg, at least none based on my lackluster Greek salad. A bunch of ingredients thrown together and drowned in sauce. Ugh. Waste of my $13 (I added chicken).", "author": "Tyler M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-01", "description": "go to the drumm st. location . This place isn't even close. There are no lines at this location for a reason.", "author": "Ted J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-21", "description": "I used to visit this location once a week. But after my recent visit, I won't go there anymore. There was a guy with broken arm behind the counter yelling after his colleagues, not wearing plastic gloves while touching the food, produce, fridge, oven.... He gave me a bit of attitude and a 'fake smile.' So no, I'm not coming back to this location, and if you're unhappy with your work, just leave. Do not give attitude to the guests. And keep your fake smile for your fake friends!!", "author": "Andrea K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-04", "description": "I ordered the chicken shawarma and fries. Overall, the food was good but the chicken shawarma could have used a little less sauce and the fries, a little less salt. The staff were friendly and the wait was reasonable.", "author": "DE M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-26", "description": "Fatoush Salad was gross.  Tasted like a rubber glove and had a refrigerated flavor.  Will not be going back.  I can get much better for $13.00", "author": "Diana R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "Love this place! Good food, friendly service and fast. The beef and lamb gyro is my favourite but I also love the combo platter. You can sit down or to go. Just make sure you indicate spicy or not clearly because they sometimes forget.", "author": "Anthony Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-26", "description": "The Greek salad here is an abomination.  One-quarter of the lettuce was brown, one-quarter of the lettuce was romaine cores and the rest was okay.  I think I had one ounce of feta and the olives are the kind you get in a can that are pre-sliced.  They should call this an American salad.  Tasteless and definitely not worth the money.  Although this is in the block where I work, I won't go back.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "The people working there were friendly and polite. I got the lamb gyro it was delicious, fresh and healthy. I would certainly come back if I'm in the area.", "author": "Jared B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-16", "description": "This place was soo needed on market fresh healthy Mediterranean food. Everyone is real nice and device is great. The food is awesome. I got beef shawarma it was great.\nThe place looks real nice. This is my new favorite place", "author": "Deango R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-26", "description": "really good shawarma,  the reason I am giving it 4 stars that it's kinda pricy for a shawarma ,,,i will definitely be back again.", "author": "Mo Yasin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-24", "description": "Great halal food in a busy part of town, that being said seating is limited so best for on the go or may get lucky to find a spot to grab a bite inside.  The food is delicious and service is timely, For lunch tried the beef / lamb Sharma plate and had a good balance of meat, rice, hummus, salad, and sauce... left full and happy :)", "author": "S H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-19", "description": "New to town and wanted to try this place. Took FOREVER to get my food ready and when I got it the amount of food was ridiculously small and was so disappointed at the quality of the food especially with them being pricy. Never going back!!!!", "author": "Noha H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-10", "description": "they have good and affordable kabobs, falafel wraps. reliable fast middle eastern food.", "author": "Jess T."}
