{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "This place lived up to its reputation. When we first arrived we were pleasantly greeted and given drink and food menus but then waited quite a while for service. We were about to leave when the waitress apologetically came to serve us and offered a round of beer on the house.\nWe tried several taps and settled on\nbarrel Brothers IPA, a mildly hoppy but delicious brew accompanied by the grilled chicken sandwich special and delicious green salad. The food was great, the atmosphere was low key but fun and overall a very positive experience!", "author": "Karen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-15", "description": "Not the bigger beer fan, but ale houses usually have at least a cider on tap. Was already out here in the city so might as well try something new and fun. Ocean Ale House comes from good recommendations on Yelp, so I made the trip out there.\n\nIt's quite actually easy to miss especially since you can't really tell its an alehouse from the outside and it's just on a busy street. There is a residential street that is the cross street and you can park there for free if you're stopping by (which is what I did). Stopped in I assume during happy hour hours because it was around 330pm, so you would naturally only assume everybody has a happy hour. \n\nLarge space, great for coworkers to hang out or a nice bar area for you to do work (they have free wifi, just ask for the password). The rotating beers were written on a board on tap, but also printed out on a menu. Friendly staff willing to answer questions that you might have and encouraging to order some eats with your brews. \n\nThe cider on tap was Mission Trail Cider Lawyers Plums and Monkey (Cider | Other Fruit | Bradley, CA) with a 13.9 ABV. WUUUUUUUUUT? GET OUT OF HERE! 9oz draft was the best 12 dollars that I ever spent It was delicious and they have a great food menu. I was looking at everything people around me ordered and looked delicious and the portions were huge for the price. Luckily, I wasn't so hungry so I just ordered some fries to soak up the alcohol. HUGE wedge fries that had skin and were seasoned and fried so nicely. \n\nDefinitely a great place to come hang out and try a couple of local brews. Chill place, unexpected especially for the surrounding area. A great find for sure!", "author": "Winnie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-10", "description": "A decent neighborhood spot for quality regional craft brews alongside a decent food menu.\n\nDespite the fact that they don't do flights here, as far as I can remember, I lucked out in going all in for a Bottlerock Fusion 44 Ale from Lagunitas and a Hipster Hills cider from Mission Trail when I stopped by. The food offerings are also solid and are a notch above run-of-the-mill pub fare in that they try to source well in terms of their meats. The burgers, as a result, are a nice bet.\n\nWhen I visited, I made it in well before closing time, but they seemed in a bit of a rush to close. I can't blame the employees for wanting to get home on time, but the overall feeling was that the effective closing time was much earlier than advertised. Something to keep in mind if you're also out late.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Great laid back neighborhood Ale House. We came by last Friday night to hear to a friend play guitar in Al Lazard and the World St. Players. Trying to find parking on Ocean Avenue is a nightmare. We ended up parking several blocks away. Anyway, we walked in and sat down at a table. \nThe entire staff is super friendly and highly attentive. Great selection of beer and wine. I had a delicious glass Flora Springs Chardonnay. We had great burgers with lots a delicious toppings- cheddar cheese, caramelized onions and avocados. Other food items are on the menu.\nWell back to the music. The Al Lazard and the World St. Players were great. \nDefinitely, check out the Ocean Ale House if you're San Francisco.", "author": "Diane C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "Updating review, information was fixed :)", "author": "Tasha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-30", "description": "Miles the owner knows how to run an Ocean Ale  house! The burger,crispy chicken sandwich and quality suds on tap are always on hit. It's a  fun place to hangout as the beer flows, burgers are coming out bomb ass fries & Miles making you laugh the whole time.", "author": "Sean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Splitted a burger and got a few beers here - the burger was cooked to perfection and the staff provided the beat customer service experience! There's a stage area too and last time we  were around, there was a live band!", "author": "Erika D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "OK, I admit I am a beer geek.  What's more, if I was not watching my weight, I would probably live on cheeseburgers.  That and I kind of like \"non-pretentious.\"  (Who needs formality when you are going out to eat?)\n\nThis place was made with me in mind.\n\nThere are 8 seats at the bar and a bunch of tables.\n\nThey have 16 different and interesting beers on tap.  OK, more than a few IPA's.  Come on people,get over the triple hopped phase!)\n\nThree T.V.'s (only two were on that day but I assume all three work.)\n\nService was friendly if a bit slow.\n\nPerfect place to unwind and not worry for a while.", "author": "Gary A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Nice vibe, cool owner, great beer selection and solid food. The grilled cheese knocked my socks off!\n\nParking isn't great but I'd come back again in spite of it.", "author": "Tera K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "Fantastic selection of beers and enough offerings for wine folks\nFood options are good to share and done well\nSeating is good for large groups but hard to snag\nDecor is bright with the ocean mural combined with the funny picture of the owner adds a good charm to the spot\n\nOverall Thoughts\n\nA great neighborhood beer spot", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Super great place to have lunch and an adult beverage. The staff is super friendly and the food was delicious.", "author": "Jennifer F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-21", "description": "Great beer selection and extremely knowledgeable and friendly staff. Four visits in, the food has been consistently solid. The fried chicken sandwich is my favorite. If i have to complain, it's the events that they have there. They pretty much take over the entire place, so don't think you can have a conversation during music nights or sorry, the absolutely horrible stand up comedy nights. Again, excellent balanced beer selection and good food, but check the calendar on their website before you go.", "author": "Carlo S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-30", "description": "2 stars for the local beer and cider. \nThe food was terrible. Disappointed by the food. It looked nothing like what is pictured on Yelp. Fries were undercooked and the serving so small compare to other yelp picture, the avocado toast was so sour because of the \"dressing\", the grill cheese sandwich that was supposed to be a blend of 5 different cheeses looked and tastes worse than a plain American grill cheese..., the duck egg sandwich was so underdone that a lot of the white was still raw and cold... , the spicy wings were really plain and saggy... \nIt is definitely not worth the price you're paying for.", "author": "Sty S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "Yep, you gotta have the scotch egg sandwich with bacon on white toast! Went great with my Czen Czen dark porter! Super friendly, knowledgeable craft beer dudes at your service! Had a wonderful evening watching the Oktoberfest audience at the Giants game  wonderful ocean mural in the place that reminded me of Santa Cruz...", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "THIS IS WAY OVERDUE!!!\n\nI have been coming here since they opened. At least a  couple dozen times.  I never thought of myself as a beer connoisseur. I knew I liked Racer 5 and Bud Light and everything in between.  Well my brother introduced me to this place a couple of years ago.  Introduced me to Miles and Daniel which are not only friendly and fun to talk to but they really know there stuff.  \n\nFirst off the Ale House rotates beers from many local breweries.  You could go a couple times a week and find a different selection on the wall. Like I said I wasn't a beer connoisseur but the knowledge Miles and Daniel have regarding the different brews was like talking to a wine Sommelier. Yes they have wine too but I haven't tried any of their selection.  Anyways I feel like I have a much better understanding of the different brew types now thanks to the crew at Ocean Ale House.\n\nNow lets talk about the food.  A duck egg on a burger? Yes please.  Much like the beer menu the food menu rotates as well. Constantly changing.  Miles takes chicken wings, fries, grilled cheese sandwiches etc and finds a way to kick them all up a notch.  Sometimes he will have some new creation that he wants to try out so it may be a one  or two day thing. So be sure to always take a look at what the days options are.  Don't want to miss anything.  \n\nIf you are a local to the city whats your excuse. get over there.  If you are from out of town and want to try some local beers come here.  They usually have multiple local breweries on tap.  Get a taste of what the bay is all about without going to multiple spots.", "author": "eric t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Great atmosphere, food and live jazz music on Thursdays! Spacious bar with a restaurant seating area, a little stage at the entrance where the band played and a huge mural that covers the entire wall of one of the sides of the restaurant of the Ocean. I had the duck egg sandwich and it was to die for!", "author": "wanda u."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "A storefront taproom with a small L-shaped bar and an appropriately maritime mural.  Very beer-geeky ambience, and a terrific selection of bottles and taps.  A few blocks from the Balboa Park BART and Muni Metro station; on the K line.  Street parking is a theoretical possibility, in the same sense that the Duma theoretically might meet next Tuesday and solemnly acclaim Pee Wee Herman Czar of all the Russians.\n\nAnd speaking of Russians, I tried two high-octane items:\n\n- Eight Bridges Russian Hill Imperial Stout.  11% ABV, 90 IBU.  9-ounce pour, $10.  Near-opaque Brown, medium cream head.  Boozy nose. Delicious sweet roast malt and ethanol; dark fruit;  hoppy fade almost lost in the alcohol notes.\n\n- Seismic Deep Tectonic Imperial Stout.  9.0%, IBU not stated.  14-ounce pour, $8.  Opaque dark brown, heavy head.Rather weak malty nose.  Roast sweet malt, pronounced hop presence, alcohol warmth.", "author": "Alan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "Can't believe I live a few blocks away from this spot! This could be dangerous!\nVibe- chill, fun, relaxed\nService- staff AND owners are awesome. Approachable, good recommendations (food and beer or in my case, cider), attentive, and nice. Yohon (sorry if I spelled your name wrong) was the best! \nFood- bomb! My fiancé and I split a burger and chicken tenders. Sounds basic, but they put a lot of love into it. Flavor was sooo good.\nMusic- good background music. Then, they had a live band- a mix of blues and salsa. Performers were awesome! Wasn't too overwhelming, but definitely made you want to get up and dance.\n\nBeers, good food, a good time, AND great service.. pshh a no brained. I'll definitely eat coming back", "author": "Tatiana P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-14", "description": "I'm writing this review out of an abundance of love. I've wrestled with writing a critical review for the last six months, because I really want to support this business. I love what Miles and crew are doing to the neighborhood by creating a really great social space and a sense of community. The entertainment is great, the atmosphere fun and familiar, and overall the place has great energy. The beer selection is excellent, and though a touch on the pricey side, I will gladly pay an extra dollar or two to support bringing a cool bar to the neighborhood. \n\nWhere Ocean Ale House could stand to improve is food execution and pricing. The concept behind the menu is great, but every time I go there the food leaves me feeling disappointed. I've had the burger twice, and both times the patty was overly salted and seasoned. The grilled cheese was too greasy, and the fries are overcooked. Everything on the menu seems to be $2-$3 more than it should be, which wouldn't be a problem if the execution was better. I usually only come only once every couple of months hoping that the food will improve, but so far it hasn't. I'll continue to come there because I really want to support them, but if the food were better I'd be coming there twice a week at least!", "author": "Aaron H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "Great spot that was needed in the neighborhood.  The owners are extremely friendly and very knowledgeable about the beers they carry.  They also serve some very good wine. \n\nThe food is very good with great flavor.  I highly recommend the Ruben or the burger.  However, there hasn't been one item we haven't enjoyed.  Just remember- this isn't the spot if you are on a diet.", "author": "Rachelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Good beer?  Check. \nTasty smash burger and spuds?  Check. \nCheck it out?  Check. \nCheck please!", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "Miles was a great bartender and gave me different samples of their beer selection. He provided friendly service and was quite funny as well. If you like Star Trek, you should stop by and check out the cool memorabilia they have on display. Their smashed burger was tasty and I had fun drinking all the different beers. Thanks Ocean Ale House, I will be back.", "author": "Sam Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "Great place to see live music with dancing, grab food, or watch the game. They have local beer on tap.\n The vibe here is young and old and people of all cultures and ages. \n\nThe size of the place is medium and comfortable.", "author": "Garrett H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "Great atmosphere. Fabulous peach sour beer. Delicious Patty melt. Avocado toast, ok. The bread was amazing, the tehina too much.", "author": "Marsha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-02", "description": "A great little hidden gem on Ocean Ave.  The place doesn't take reservations so I would recommend showing up early if you want to get a seat.  The waitstaff was so fun and friendly to myself and my entire family.  We ended up getting a seat towards the front of the restaurant and they have a ton of board game for people to play. So our kids were entertained while we waited for our food.\n\nThe beer selection is pretty wide too with some great options.  The food here was great.  My wife had the Rubin which she absolutely loved and I had the bacon blue burger which was really tasty.  The kids had grilled cheese and fries and ate all of it.\n\nThis place is right by my kids school so I'm sure we'll be back for more.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "BEST BEER PLACE IN INGLESIDE EVAAAA.\n\nHonestly, staff is amazing - hospitable, generous and so fun!\n\nFood is good for a place that predominantly sells booze and their booze is GOOD booze.\nFrom IPA's to ciders to sparkling wine. Bring all your friends! It's best place to hangout and talk. Also - check their schedule, some days they have live music and other fun things!", "author": "Albia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Great prices great ales and atmosphere. Wish I lived closer I'd be here all the time.", "author": "Maddy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-01", "description": "The food was just ok for me but the beer and cider selection is very solid week after week. The staff is also very friendly. They have live music a few times a week and it's always a good time. Great neighborhood bar to pop in for a pint or two,", "author": "Jordan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "This place really puts into perspective how many bars lack a key differentiator.  Miles and his buddy add such a unique and positive energy to the place - you just wanna hang out with them.  The beer selection is varied and excellent, and the food is way better than it has to be.  \n\nCon: I wish it was closer to where I live", "author": "Erik L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-27", "description": "*14$ entrees\n\n*limited menu\n\n* steak fries\n\n* 3 of the 16 taps at 6:30 on Friday night are done. All high abv% ipas\n\n* remaining ipas are 2 hazys and an 8$ pour of lagunitas ipa \n\n* bad folk music", "author": "Edward F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Great food, atmosphere and service! Love the beer variety on tap. The avocado toast is delish and no ordinary take on it! Thanks for a great experience guys!", "author": "Haley A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "What an awesome find!! Took a little working lunch break and had the yummy Cobb salad...and a little drink. It came with a delicious house made wine vinaigrette! Miles one of the owners was so fun and personable and made the entire experience great!! Definitely come eat/drink here!!", "author": "Marla B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "Came in here after playing corporate charity soccer match. Famished and thirsty. Well Lo and Behold, an overwhelming selection of brews and wings that make you scream for mercy! Must come back", "author": "Artem D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Really Like this neighborhood bar: laidback atmosphere, funky owner/manager, great beer. Food could be a little bit better (especially the burger with the huge fries) but overall a good place to have a good time.", "author": "Christophe H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "I shouldn't be writing a review because this is my spot and I don't want it to get saturated with people. I SHOULD be writing this review because I know the place deserves the business.\n\nI'll choose the lesser of two evils. My selflessness trumps again.\n\nOcean Ale House is my favorite bar in the city. It helps that I live right next to the spot, but it also helps that the food and beer selection is phenomenal. To top it off, they have a rotating calendar (on their website) of musicians and bands who complement the ambiance to a T. The staff is friendly and knowledgeable, and I think they're doing a phenomenal job running the place.\n\nTry the wings!!! Probably my favorite wings in the city. Keep in mind that the wings recipe is constantly rotating, but the ones I had this week (spicy chili garlic butter chicken wings) were my favorite... and that says a LOT.", "author": "Shan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "This place was entertaining and had great vibes and food. I've been here several times with friends. Almost always sit at the bar because the bartender/owner is always in a such a great mood we love chatting with him. The first night we came there was live music, great musicians playing the sax, guitar, and flute like Spanish masters. It really brought an awesome vibe to the place. There's a beautiful wall to wall mural of a seascape, and it's clean and pleasant to dine in. Our favorite things to order are the chicken sandwich (super crispy outside and juicy chicken inside, it's made perfect every time) and the melt. Both great and you can tell the cool cares about getting everything perfectly crispy.", "author": "Mona L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "Love this place and everything about it! The staff, food, and atmosphere are the best!", "author": "Julianne O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "Randomly stumbled upon this place on Yelp while looking for a place for good, delicious, local beer. My friends and I came in on a random Sunday afternoon for beers in October and we fell in love. We ended up consuming a liter of beer, EACH. We definitely had a great time. Miles is a factor because he's great! His charm and sarcasm was on point, which really made the experience that much more fun! He was extremely knowledgeable about the beer they were carrying and even surprised us when we told him what we enjoyed drinking. During this afternoon drinking session, a local band, who've I have seen at Java Beach Cafe, was playing, which made the atmosphere even more fun!\n\nMy friends and I came back in December for dinner and Miles remembered us, which was a great example of customer service. We had the burgers and the fried chicken sandwich with our beers; it was so good! The perfect place for a pint of beer and a good meal.\n\nSide note: We think the owners, Miles & Daniel, are secret lovers. #CaliforniaProp8", "author": "Amanda Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Some of the best Jazz music I've heard in SF was played here during my last visit. I love how they support local musicians and create a nice venue for them to play while serving a nice selection of beers and delicious burgers and fries! It's places like this that's making me love this neighborhood more and more and I'm happy to see more good eats open up along Ocean Ave. \n\nThis places doesn't look like much from the street and it can be easily passed by if you're driving too fast to avoid the Muni and random teens and elderly folks crossing the crosswalks. But once inside you marvel at the HUGE mural on the wall and the catchy tunes from the band du jour. Parking can usually be found within a few blocks along the side streets...or on Ocean if you're lucky. I'm blessed to be able to just walk over here and drink to my heart's content without fear of getting a DUI....because you'll want to sample as many of their delicious (and strong) beers they've got on tap on their constantly changing beer menu.\n\nI like getting their burgers with garlic fries. You just can't go wrong. Their burgers are served deconstructed so some assembly is required...which is good for you picky eaters out there. \n\nOverall, great addition to the Oceanview area! Great music (when bands are playing). Great selection of beers. If you wanna find the owners, just look for the big burly men with the impressive beards....yeah, pretty easy to find.", "author": "Sam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "My favorite establishment in Ingleside.  Everything about this place is top quality--food, drinks, atmosphere, service, etc.  You can really tell that the owners care about their work and will go above and beyond to please their customers.  They clean their taps every night, offer an awesome variety of beers that vary daily, and cook up the best food in the neighborhood night in night out.  They also have awesome live music several nights a week, and offer other activities like trivia night and open mics.  I honestly can't say enough about this place...I'd give them 6 stars if I could!", "author": "Jonathan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "So glad to have this addition in the area. Great rotating taps, awesome food and really awesome owners. I do miss the days that the place was a little more quiet but I'm so glad these guys are doing so well. Keep the fieldworks taps coming. I love them all.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Seriously come here. This pace is amazing. Really all I can say is great food, entertainment and beer. Lid back atmosphere that welcomes family and friends alike. Sometimes it's hard finding a place in sf that feels like I'm truly welcome but you get that here.", "author": "Michelle P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "Chicken sandwich is exceptionally good! Unique crispy/chewy rice batter. Fine, fun beer selection. Nice folks. Think I'll go back for lunch tomorrow!", "author": "Mark A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "Tons of beers and IPA. Fries were a large portion for $5!! Enough for 2 people to share, took us 15 minutes to eat it. Owners are so cool, I think one chills in the front serving the beer and the other dude is in the back cooking the grub. They both look like skinnier, Caucasian versions of the fat guy from Lost. Not sure if they are brothers? Bathroom super clean but don't slam the door like I did, let it down gently. Happy hour $1 off drinks 3-6 pm. \n\nWithin walking distance from my place yay !!\n\nRueben special looked delicious unfortunately I got dinner somewhere else to go to. Next time !", "author": "D T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "I've visited this establishment multiple times and I've always left happy! The bartenders are always extremely knowledgeable and offer great suggestions for every palate.  Beers rotate in and out meaning you can try something new with every visit.  The food is a bit pricey for what you get, but it sure hits the spot when you're drinking beer (or wine) with friends in this awesome beer bar!  Be sure to have terrific bladder control when you visit....there's only one bathroom!", "author": "Alex J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "Yummy burger. Need thicker fries. Reasonable selection of beers. Can use more ciders. Need more staff. \n\nI ordered the Classic burger at medium with a fried duck egg add-on. Beef patty was really cooked to medium. It's really juicy and oh so yummy! I prefer thicker fries than they have. \n\nWe came in on a Wednesday, they definitely can use more staff. It was just the bartender plus the bus boy. The owner was working in the kitchen. Luckily, we sat at the bar and didn't have to wait for the bartender to make his rounds.", "author": "Will T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-17", "description": "I'll start out with the pros. The staff are very friendly & the food is amazing.\n\nCons everything is  over priced my waiter smelled of BO very bad & all the kitchen staff have long beards & no beards covers I hope they don't get the health department called on them.  I wonder how much hair people are eating in there food everyday? I'd advise people not to bring children the owner has pictures of him self half naked all over the restaurant also the menus are crumpled pieces of paper with writing on them.\nI'd hate for Gordon ramsy to come I'm here he'd go off.", "author": "Forrest G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "This is a sweet spot. Everytime I come, I've enjoyed myself. Food is hearty and delicious. Great selection of local beer. Hella big plus for being clean! Extra star for being badass. Bring your friends They for board games.", "author": "Susana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "Great place to have a craft beer, get some high quality pub food and listen to live music.  Friendly staff too.  We listened to some amazing jazz music; the pianist was especially good!\n\nThe brined fries are skinny, crisp/soft, just about right, and the ranch-like dipping sauce is great with them.\n\nThe burger is smashed, griddled till caramelized, and served with a number of the usual accoutrements.  Tasty!\n\nThe special sandwich was a beer battered fried chicken with Korean spices.  The beer batter crust was crispy, airy and voluminous, and yes, there was some chicken in there; it was pleasantly spicy but the Korean-ness was lost on me.\n\nPrices are high.  $17 for a \"Rubin\" sandwich is pretty steep, and for that price, I would expect at least the spelling to be correct!", "author": "Eric Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-13", "description": "Food is good and the beer selection is nice but it's really expensive for what you get... ordered a Ruben that was just a sandwhich that was $17\n... good but pricey in my opinion not worth the value... I'd rather have a steak meal for $30 not a sandwhich and a beer", "author": "JD E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "Super great food, service is awesome... Menu rotates and the beer selection is good. The hospitality is amazing!! Great spot.", "author": "Ben F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "Free live music on a Saturday lured us to Ocean Ale House, unsure what to expect as to quality of food by what's described on the website but trusting that decent beer at least awaited us. Seating is first-come, and much table-sharing is done with late comers standing where they may ready to pounce on vacancies. We scored the undesirable low seats at the register where I wouldn't normally be satisfied sitting, but that worked superbly since getting another beer meant just holding out your glass. We couldn't see the performers very well, but there isn't a bad seat for hearing them. Cuban country music was on the bill, a somewhat amateurish trio I thought but very entertaining and as I said, free.\n\nThe menu is entirely burgers and sandwiches, with an arugula salad at the bottom. We ordered two Classic Smash Burgers and the salad to eat, a Tenderloin Cotton Candy and a Honk if Your Heffy to drink. The burgers appeared rather simple in this day and age of extravagant gourmet creations, but were tasty. I didn't like the fries, which were thin, burnt and cold. The arugula salad was well executed and good-portioned. The drafts were outstanding, as expected. We also each had a glass of cabernet sauvignon, surprising for not being rot gut (beer bars not surprisingly overlook their wine list sometimes, or at least do not give much thought to them). \n\nThe graciousness and hospitality of the staff was uniformly excellent. I'd say that the owners of Ocean Ale House have found their exact, true calling in life. I saw everyone clearing glasses and plates, helping hand chairs around, welcoming and chatting with the patrons, and appearing to enjoy it all. It made me feel like a neighbor to everyone else, though I came across town and rarely go out on Ocean Avenue.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-03", "description": "Neat atmosphere, with pretty good food. The owner is really friendly!", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "Great atmosphere, great food, great drinks!  Came on trivia night and it was super fun.  Definitely a gem in SF.  TVs are available for all the sports fans.  Perfect spot for anyone that wants to get out of the more common places in SF.  \n\nLOVE THIS SPOT!!!", "author": "Sierra N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-01", "description": "Good atmosphere and my husband enjoyed his burger.  Fries looked nothing like picture and weren't good.  Had Monte Cristo sandwich which was NOT good.  Came with breakfast potatoes and when I asked for fries the bartender said work with the menu and didn't change it. He was trying to be funny but it wasn't.  They serve fries. It would have been easy to sub fries for potatoes.  Pilsner beer too hoppy.", "author": "Casey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "Fun atmosphere with friendly company. Miles is awesome and so are the brews! Great hang out spot close to CCSF", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Amazing! Just what this neighborhood needed. Great selection of beverages, growing menu, beautiful layout with giant dark wood tables. There's a stage, often featuring talented musicians playing many styles of music, for free! When the game is on, the TVs are set. Let's not forget their hand painted mural. \n\nThe staff are great, fun, and feel like instant friends!", "author": "Kathleen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Still can't get over the fact that this place is my local Beer / Burger / live music spot! The Best Burgers in SF complimented with a world class Beer selection by the most brotherly brothers in the city!", "author": "Torrey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "A diverse selection of beers and really knowledgeable bartenders who are more than happy to educate you all about em. Miles is a lovely piece of the ambiance who really makes you feel at home in this neighborhood bar. Live local bands, lots of old school games to play while you're catching a buzz, your favorite teams playing on nice tv screens. An ingleside staple!", "author": "Carlo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "This place is absolutely amazing. A local gem to Ocean Avenue, the team and regulars are what make this place shine. Right off the bat bartender Miles welcomes you with the type of charisma that just sucks you in. The team has strong knowledge of the brews and I must say, the food is pretty damn good. They also play live music at 7pm. This is definitely one of the cooler bars I've had the pleasure of visiting.", "author": "Diego A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "I couldn't say more about this place!!!!\nGreat food. Best burger in the area and top craft beers. Above all else, the owner and staff are top notch. Ocean ale house is our go to ocean Ave stop", "author": "Calogero P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Staff is extremely welcoming and friendly and we were lucky enough  to catch a band playing on Saturday evening. \n\nThe selection of beer was great variation and they  put out top notch \"pub\" food. \n\nOverall, a great experience and will be back.", "author": "Ron R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Super cool and chill spot in The City. A nice respite from the hoity toity \"high concept\" spots. Totally kid friendly. And the food is really good. Like, DDD, good. Can't wait to try the Golbi burger. Pure short rib. Sounds amazing. Keep it up!!", "author": "Josh R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-14", "description": "I wouldn't say they have tons of beer choices, but they certainly have a solid tap collection of IPAs, lagers, and stouts. Ocean Ale House does a great job of rotating in local beers and some decent wines. The HUB West Coast lager (only 5.0% ABV) even tastes like a light IPA. Great ambiance, murals, and live music will accompany your drinks, and service will always be prompt and courteous.If you're not into a loud environment, you probably don't want to stick around, but it's a fun time otherwise. Food can be hit-or-miss here. For $5, you'll get a giant portion of kennebec fries, but half of them will be soggy, and the other half perfectly fried. A classic burger will set you back $12 for a smaller portion, and even the grilled cheese clocks in at over $10. Order at your own discretion. Otherwise, enjoy a few brews, and watch the Giants game.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "Walked in off the street, great live music really set the mood. Strong beer selection, and even stronger menu.", "author": "Kevin R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-04", "description": "Came in one random night and it was a Tap Takeover. Everything Anchor which was pretty cool. After seeing the selection of Anchor beers, I asked if I could try the one which had \"mango\" in its name. The guy was really rude about it. It was okay, not the best. I shared a burger with someone which was pretty good. I just found it weird how they charge for extra for cheese and tomatoes. I mean, extra charge for bacon and egg is understandable. While we ate, we were playing connect 4 which was really fun.\n\nI found this bar to have a very local vibe. Would definitely go back even though service was eh.", "author": "Vangielynne P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "Enjoying my first visit here. We came here to watch the World Series game, but we were pleasantly surprised to also get a trivia night in. Our team came in second and we will definitely be back.  Fries, duck burger, aioli sauce and beer were awesome.  Love the poster photos in the bathroom too.", "author": "Olivia L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-13", "description": "Yesterday, we were having dinner enjoying the band until the owner came to us and asked if we could move from our seats so other ppl can sit. We had a 4mth old and 2 year old  with us. There were other ppl there who were there  longer and he asked us to move. \nWe were ordering more food and drinks. \nThe way the owner spoke to us was very rude. \nWe did enjoy this place but they just lost customers and I will let others know not to go this place. \nWe were paying customers.\nThe food is over priced. A club chicken sandwich was 17 dollars with no fries. \nThe chicken tasted like from safeway deli.\nReally disappointed in the owner", "author": "Kris F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "I walked into here with my buddy on opening night, and wow, just wow! That mural is an amazing showcase of local art. \n\nThe beer selection is astounding with reasonable prices.", "author": "John Karl D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Definitely a good place to watch games and grab some great tasting food! Parking isn't too bad at this place despite looking for it on the street. Inside is a pretty sizeable area with tables and bar for groups of various sizes. I definitely liked the decor of this place. The restroom was clean and well-maintained.\n\nThis place has a plenty of various beers and a good food to choose from. The two things I recommend getting here are the burger and the fried chicken sandwich. I decided to make my burger a double and I wasn't disappointed! The portions were huge, and the meat was very tender and juicy. The sauce definitely complimented the patties and the bun did a great job in soaking up the juices. I was very surprised by the size of the chicken in the sandwich. It wasn't just breading, the chicken filet was just that big. I took a bite of it and it made me regret a bit that I didn't get that! I highly recommend going here on a empty stomach.\n\nThe service here is great. The owner came to talk to us and was very kind and courteous. He was very knowledgeable about the various beers here and recommended which beers would go great with food we were eating. I highly recommend anyone in the area to check this place out!", "author": "Jason P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "I came here with family for some drinks after a memorial we attended together and we couldn't have picked a better spot.  This place was super welcoming.  The owner, Miles, is awesome and has an amazing sense of humor.  He took really good care of us, made us laugh a lot and helped us feel really welcome.  I no longer live in the bay area but you can get that I'll be back on my next visit.  I definitely want to check out the live music sometime too.", "author": "Freyja F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "I am so happy this place is in my neck of the woods. \n\nBorn and raised in San Francisco, I'm that annoying person who waxes nostalgic about the way \"the city used to be.\" Overpriced avocado toast derivatives can set me off for hours. I tear up a little every month when I pay $80+ for my Clipper card, as I remember how cheap the FastPass used to be ($7 a month for all the Muni rides you can stomach, cable cars included). I don't understand how high school kids shop for formals now, ever since the Jessica McClintock outlet was supplanted by SOMA condos. \n\nThat being said, a place like Ocean Ale House did not exist (and not sure could've existed) in my sleepy neighborhood \"in the good old days\"...and OAH is a silver lining in all this change.\n\nThe draft selection is eclectic and phenomenal. I now have a new favorite gose (Jolly Pumpkin Cucurbitophobia) and tasted a citrus that had, swear on my grandma, the strong aftertaste of durian. The bartender/owner(?) with the awesome beard clearly loves what he does, and you can feel that the moment you step foot in the place. \n\nThe vibe is low-key and non-pretentious, and fits in with (rather than takes over) our humble little corner of the city. I'm a bit late to this party, but welcome to the neighborhood, OAH! So very glad you're here.", "author": "Melody P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-29", "description": "The beer is great and the owner seems really cool, but what the heck is wrong with the acoustics in this place?  \n\nI've gone twice with different groups of people - both times we fled after 20 minutes because it feels like you're sitting next to the speakers at a concert, even when no music is playing!  Everyone has to shout at the person next to them.\n\nCan you throw up some sound absorbing stuff on the walls?\n\nNot a good place for a drink with your pals which is a shame because they make an amazing sour plum beer.", "author": "Jacob F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "Loved this place. Good beers and a terrific burger and crispy fries. The pickled jalapeños were so so good. One of the owners was tending bar and he was friendly and made me feel right at home. I'll be back!", "author": "Caryl S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "Great place to go to relax after work, a CCSF class, or just because.  The owners are about creating community and that is obvious for how friendly they are, their devoted customers and the many events they offer.  And the food is inspired bar grub, with a vast range of ale and beer.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-05", "description": "Cozy brew pub with a cool jazz combo playing in the corner.  I ordered a porter- which was very tasty and a cheeseburger with greens instead of fries.  Was getting into a good groove and really anticipating the burger cuz i was starving and my friend recommended the food.  30 minutes passed- no food.  I noticed the kitchen was small so I told myself to be patient.  Another 10 minutes passed and I finally asked the bartender how my burger was coming along.  \"What was on that burger?\"  \"Oh I think they lost the order\" replies the squirrelly looking little bartender with he purple ski cap who took my order and obviously didn't place it.  Totally bummed because I was famished, had to leave to make an appointment and couldn't wait another 45 minutes for food, I drank my beer and left.  Too bad because I would have given his place 4 stars with average food and five stars with good food.  Now it's 2 stars and no tip for the bartender who should have taken ownership and offered an apology and maybe a free drink or something.", "author": "Howard D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Fabulous spot to get great food and beer, hear live music, play some board games or watch the Giants lose (jk). And in addition to their fabulous fries, burgers and other pub fare they now have house made pies. The rhubarb strawberry is the bomb!", "author": "Erika M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "My first time visiting and I had a great Hefeweizen! Great staff, cozy space. I'll be going back!", "author": "Fran S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "this place is rad. great food, great beer, and great people working the bar. What more can you ask for??", "author": "dan m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "1st experience: Came here with a couple friends for drinks and dinner. I had gotten there early and ended up waiting for the rest of them. Server came by to check on me, super nice and friendly, got me situated. We had ordered burgers and they were HUGE and delicious. We hung around talking, playing a card game and eating. They didn't rush us at all, even when it got busier.\n\n2nd experience: My friend and I wanted to do a game night and we had picked Ocean Ale House to be our venue. Little did we know our group would turn into a party of 30 over the course of the night. We made sure we respected the place as much as we could. Miles is awesome, great personality that definitely makes the place warm and welcoming. He seemed to be the only one handling the counter and floor that night (Wednesday) and he was AMAZING. He came by every once in a while, checked on our long, long table.", "author": "Kimberly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Great mix of beers and very high quality food - get the avocado toast.  Staff is friendly and very knowledgeable, highly recommend!!", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "Nice place with good beer and music. Love their fried chicken sandwich, sooooo juicy!", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "Great, friendly bar staff, an ever changing beer menu (most beers between $6 and $8), delicious burger and fries, live entertainment on some nights.  This is just what the neighborhood needs in my opinion.\n\nIt's a big open room, so it can get a bit noisy, but there's a great mural across one large wall and a small stage on the other side.\n\nI wish them all the best.  I'll be back!", "author": "Brad B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "Our first day in San Francisco and we had our first meal at Ocean Ale. It was money well spent. The burger and fries were good and the wings with its naughty name was delicious.  We would eat there again.", "author": "Laura N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-08", "description": "Ocean Ale House has a decent beer selection and serves a very good, if not somewhat pricey, burger.  If you want a better deal on burgers and that's all you want, go down the street to Beep's.  What makes this place more special than a driveup is that it has a great atmosphere - family friendly, so the kids can have burgers and you can sip your craft beer.  Staff is awesome.  They usually have the [Giants, 9ers, Warriors] game on so you can watch the game too.  It is certainly a welcome addition to the neighborhood", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-04", "description": "Bomb diggity. such big personalities make you want to spend the entire night. Family and Children friendly environment where parents and friends of friends with kids can have an equally spectacular night. AND FREAKING LIVE MUSIC! So happy that this place has found its place in the heart of such a community and family oriented neighborhood. Well done!", "author": "EmmasTwinSister A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-02", "description": "Nice addition to the neighborhood. It's got a bright and airy vibe inside. Staff was nice and attentive. Food was pretty tasty. Just had a basic burger and fries.", "author": "Dani K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Everything this place is represents the style of the owners Dan and Miles. From the hand ground burger meat and house pickled jalapeños to the huge variety of beer they offer. This place is a must visit. Just a great, relaxed atmosphere where the the food is outstanding, the beer always fresh and cold and the hosts inviting and friendly!!", "author": "Hans S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "What a great addition to the neighborhood! \n\nAll forms of life are welcome (and by that, I mean kids)! They even had a cute area for kids to color while the adults could enjoy themselves. \n\nDined here tonight with my mom and absolutely loved it. The place is super chill. Come here with your family for some good bites and drinks or with your friends to watch a Giants or Warriors game (we'll get them next year)! \n\nThe place is new so the menu is super limited. I'm hoping they'll add more menu items in the future. I had their arugula salad and had their homemade American cheese instead of the goat (not a fan of goat cheese in general). Light, yet filling. My mom had their bunless burger. I cheated on my diet and had a few of her fries that are homemade - yum. The menu is reasonably priced. \n\nThe beer - so good! At least 10 on tab and loved that they had local beers. I had they lychee beer - try a tasting of that and the blueberry one. You won't regret it! \n\nLast but not least, the service! That's where the main 5 stars are going out to. The owner came and greeted us and came by to make sure we were enjoying ourselves. Awesome service!\n\nExcited to go back. Give this local spot a chance instead of dining at an over priced place that isn't nearly as good.", "author": "Anastasia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Excellent new spot - been here twice now. \n\nFood: Ordered the burger (add cheese and bacon) both times - it's excellent. Patty is juicy and delicious. Bacon is pretty thick and high quality. Bun is perfect. Comes with nice crispy fries. Ask for some of their tasty aioli.\n\nBeer: Not the biggest tap selection. I can't remember exactly, but I would guess 9 or 10 beers on draught. Selection is good though - 2 porters, 1 stout, 2-3 ipas, a blonde, an ale, and a couple others. Bottle selection is fairly large (30-40?) and has some real gems. Selection is mostly larger bottle Belgian style brews for obvious reasons. \n\nDigs: Super nice. Spacious for the neighborhood. Everything is clean. Sturdy wooden tables. Height-adjustable bar stools. High ceilings. Cool mural on the wall. Space for live music.\n\nDudes: Super nice and chill. Miles works the front and manages the beer. Very knowledgable and obviously loves his job. Another dude works the kitchen. Haven't talked to him as much, but his burger is dank af.", "author": "Jeffrey D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-18", "description": "All around GREAT find. \nWe were looking for a place to grab some good food & a beer or two. \nI had the burger with bacon & cheese. Excellent (already craving another) my wife had a burger with mushrooms & cheese also thumbs up. Fries come crispy & delicious. \nWe enjoyed the double IPA.\nFriendly helpful service! Owned by two great local guys living the dream creating a favorite spot for all to en\nDefinitely be returning.", "author": "Jonathan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-25", "description": "I was excited to hear that this place was opening within walking distance of our place.  The neighborhood totally needs this.\n\nBeing that the Ale House just opened there are some issues to be expected.  My primary gripe is the cost of the food.  A good tasting, but pretty small (think slightly bigger than In-n-out) is $12.  With Bacon and cheese it's $15.  Without fries.  Fries were another $4.  There's just no way that a place where there is no table service should be charging $19 for a small burger and fries.   There was also only one guy taking orders and serving beer which resulted in a huge line.  I'll give them a pass on that though since they are still working out the service kinks.\n\nThat said they were super friendly, and had a good beer selection.  Here's to hoping they improve value.  If so this place will definitely be added to my rotation.  I hope to be back.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "I am so excited they opened a place on Ocean Ave to grab beers! \n\nThe service is great here - the staff are friendly, the food and drinks come on time, and it's pretty well maintained too. You go to the bar and order your food there! \n\nI would definitely come back here again! I'll probably be a regular here in no time!", "author": "Bik H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "Four stars for opening on Ocean Avenue and taking over the space of a former coffee shop and bakery. The beer was okay although I wish there was more of a selection. There is food but I don't eat burgers and I did not try the grill cheese or fries. I noticed the noise level is loud and was bothering me I only stayed for a short time. I want to come back for the Sunday Brunch..", "author": "Infodiva B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "The beer choices are great and the owners are helpful in selecting what to order.  \n\nIt is a nice place to watch a game and or meet up with friends before you go out for dinner.  It is also a nice place to have an afternoon drink as it has good light and open environment.  i am not the biggest fan o the music as it can be loud and as it is a small setting - you cant avoid it if it is playing.  That being said - it is not a deal breaker and sometimes it a pleasant surprise.  I go there for the beer and it is a nice place to sit.", "author": "Erich B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-23", "description": "Went to this place on Friday night, way confusing to figure out who to order from. Even If you just want a beer, could be confusing. Acoustics in place seem off, I like loud but kinda weird with tv, background music, and regular conversations. Lighting for a pub, was way too bright for a Friday night, not inviting. \nUnfortunately,we left without a beer or meal- just too slow and confusing. More attention to customer service might be helpful. We really want this place to work! Live in the hood", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-27", "description": "Parked in front earlier today just as they opened and peeked it. Greeted by two bearded, burly gents finishing up what my guess was their opening beer (QC (quality check)?). They waved simultaneously with huge smiles and I was hooked! Chatted for a minute, checked out the menus and decided to come back later with my +1 and J. \nYoung blue grass band playing were really fun. Limited menu for the night but both the burger and fried chicken were super tasty. Burger in particular. YUM! Tostones tasty too. \nNice selection of imported & domestic beers, surely something for everyone. \nI live within walking distance of Sunset Reservoir and would drive here simply because of those two, bearded burly gents!", "author": "Us And J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Amazing food, beer and atmosphere. We ate off the specials menu: southern quail with Mac and cheese (so good!), Latkes, and deep friend lamb sausage around duck egg.  It was delicious!\n\nThere's a beautiful seaside mural covering one of the walls and the place was packed! Daniel and Miles are the best!", "author": "Emma Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "Great addition to the neighborhood.  Granted, they are still working out the kinks -- we went on a Friday evening and most of the menu was sold-out.... and as we sat there, I watched several beer taps close (and a couple of new ones open).  The burger and salad were great; hope to try the rest of the menu at some point!\n\nThe seating was very family friendly and there was a play area for my 3 year old to entertain herself and make new friends.", "author": "Cecilia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "Great place for trivia on Tuesday nights. They have an ever changing beer selection. The beer is always on point. The food selection is limited however they use high quality ingredients and once you order the food and you eat it, it is quite delicious. The owner is definitely a people person and he is always great to talk. I recommend this place to friends on weekends because they always have live music. It has become the spot on Ocean. You can watch a game and enjoy yourself. I'll be coming here as often as I can.", "author": "Gary J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "After a hike at Fort Funston with the pups. This place hit the spot. Good brew and burgers!  Thank you.", "author": "Amber G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Great spot for a casual but absolutely delicious and somewhat unexpectedly really fresh meal (all ingredients are of the highest quality)! The beer selection is diverse with a little something for everyone. The staff is super friendly. I definitely recommend this place for meeting up with some friends for a comfortable, awesome time.", "author": "Kathryn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "Public house. Just opened. Hot and new. Local craft beers on tap. Nice neighborhood service! I am SOO excited this place opened up and was even more surprised to have a fantastic time. Go ocean!! \n\nGood beer. Local art for sale. And a crazy mural! \n\nI'll def be back.", "author": "Nathaniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "I came here for a specific purpose. We were holding a motorcycle meet here. I needed space to sit a bunch of folks, a nice place to hang and some adult beverages. I got all of those things here! They let us move some tables so we could all sit together and were really nice to us. I wasn't able to try any booze but I did get a Bundaberg Guava soda, which I really like. \n\nI ordered a grilled cheese on rye with tomato. YUM! Simple, honest food well prepared. I also ordered some fries. My only thing is that they were all short. HAHAHA. They were, however, served crispy and with ketchup and some other sauce that I liked.\n\nOne thing I REALLY liked here is that it's not loud. So many places you have to shout to have a conversation. Not true here. Plus, they have amazing murals in the spot. I will be back here again. It was a real crowd pleaser.\n\nCootz OUT! \n\n({})", "author": "Cooter T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "Burger was delicious. Great beer selection. & Shout out to our server with the big beard for the excellent service! We will definitely be back the next time we're in San Fran!", "author": "Kay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "Best damn burger I've had in California. Great cider selection which I appreciate since I'm not much into beer. I was there on a busy night, a high school has band was playing. I grew up in the city and you get a very old school sf vibe in this place. Not a hipster tech bar, this is your neighborhood go to.", "author": "Laura K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "Been here twice since it opened two weeks ago and like what they are trying to do, as the neighborhood needs a brewpub. The space is bright with an amazing mural, and communal tables of light wood. Beer selection is eclectic but hoppy, wish they had a hefe on tap. Live music with owner's dad was great but difficult to talk, need acoustic tiles or something to muffle sound which bounces off ceiling. I liked my eggs Benedict with homemade sausage, a side of fruit or potatoes would be a nice addition. Hoping with little improvements it will get a good following and succeed.", "author": "Michelle O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "We came in to OAH on Saturday and were very pleasantly surprised to find a new delicious neighborhood spot! The cheeseburgers are juicy and fresh and the pickles are tangy and addictive. They can even put an egg on your burg if you like. Fries and sauces are great too! We have been waiting for a place like this to open on Ocean Ave!", "author": "Stephanie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "My wife and I have eaten at this restaurant on three occasions.  The quality and presentation of the food was excellent.  The burgers and fries were exceptional and I wouldn't change anything about them.", "author": "Edward K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-27", "description": "Been here twice. Wait staff and owners are very nice and its a great place to grab a beer. Good variety of tasty brews. \n\nFirst time food was great - got burger, fries, grilled cheese, and salad. Second time not so much - everything tasted like and texture was like the oil was at too low a temperature - very greasy. Prices are high - $12 for a burger + $4 for bacon. Menu does not change much so wouldn't go there very often for dinner because it would become repetitive. \n\nPlace is very loud. Would be good if they hung some drapery across ceiling and parts of walls to reduce the noise.\n\nCan be cold because they have to leave door open for some regulatory reason...at least thats why the proprietor said it was always open.\n\nOverall am glad to have the addition of the variety and general atmosphere. With some menu quality control and tweaks to the environment it would get 5 stars.", "author": "Karl M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "Delicious food and warm environment. There's love music and a beautiful mural. Good beer also, I tasted a couple.", "author": "Rodney J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "This is my favorite bar in the Ocean Ave area. I come here pretty often and each experience is always better than the last. The staff is really friendly and their service is always great. The only time I've experienced poor service was when it was busy and crowded. Not an excuse, but it's understandable as this place is new and doesn't usually take on that kind of crowd too often. It doesn't have the \"crazy/party\" vibe, which I'm pretty thankful for. It's a great place to enjoy a drink and catch up with some friends. Small-ish tvs for watching sports games and a variety of board and card games if you're up for it. I'm happy Ocean Ave gave this place a home. I look forward to more good times spent here.", "author": "Carmelisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "Yummy beers that periodically change. NIce new place and they have lots of music (especially jazz) there. A real treat for the neighborhood. Also family friendly. Check it out!", "author": "Linda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "Not only was the food delicious, but the staff was great and the live music was perfect!\n\nOne of the best burgers and fries I've had in the city!", "author": "Julie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "Definitely the best social place on Ocean Ave.  They are adding tables on the sidewalk soon.", "author": "Jim M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-13", "description": "New opening in the neighborhood. Didn't order food, so rating is solely based on drinks and ambiance. Dope beer selection. Great environment. Will definitely be back to try the food. Really hope this place does well and sticks around for a while.", "author": "Reyna O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-03", "description": "Ordered my beer, everyone else's beer at my table came and they said that they didn't have enough glasses for mine... they couldn't just wash one for my beer really quick ?", "author": "Vanessa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "Great food, beer and atmosphere. Thanks Miles for your stories. We definitely will be back.", "author": "Cheryl J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "This place is modeled after a classic ale house: a public, cheerful atmosphere; long tables with shared seating; and emphasis on the ale. We came the Saturday after opening and there was live  music, delicious burgers and salad, and excellent beers. The owners are friendly and there's a good vibe. It's just right for the neighborhood: very good drink and food, but not trying too hard to impress.", "author": "Warzie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Best Burger & Great selection of local brews! Love the vibe & ownership here! They never disappoint!", "author": "Ashley T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "I'll start off by saying I'm not a beer person, so I didn't have anything to drink here. But I came with friends and they seemed to enjoy themselves, so I'm happy about that. The bartenders were so nice and friendly. If anything, I'll come back to see the bartenders and get fries and the BOMB ASS lemon aioli sauce (I think that's what it was called). \n\nIt can get pretty crowded in here, especially on the weekends as the space isn't very big, and sometimes you have to share a table with people you don't know, but it's not a big deal.", "author": "Lexi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "This place is very laid back with good beer and great munchie gastropub type food. Probably will try it again soon", "author": "Brenna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Fun place! Great music! Great beer! Love the murals of the ocean on the wall. Super cool touch!", "author": "Liesl M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "There was a fun jazz band the Fri night we were there. Excellent burger... Get the caramelized onions!", "author": "Bill R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-30", "description": "Good selection of beers, excellent burger & skinny fries, great vibes, and a tiny stage for musicians. Street parking is pretty easy. The guys that manage the place are nice too. I would've given it 5 stars if it wasn't for the fact that they let dogs in the place. That's gotta be a health code violation as they serve food & drinks? I'll be back, but hopefully on a pet free night.\nThis wasn't a service dog by the way, just one of those annoying barking ankle biters. Cheers!", "author": "Adrian Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "So happy that Ocean Ale House is open... this neighborhood has been waiting for a spot like this. Just had a great burger and some really excellent beer here and already feel like a regular, can't wait to go back... owned and operated by SF natives, so supporting Ocean Ale House is supporting San Francisco, on the real. Will definitely be back here many times.", "author": "S E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "Great beer.  Great music.  Fries and salad were great.  Good vibe.  Ocean needed a place like this.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "Craft beer? Always rotating like weekly! Great food, the burgers are a staple but don't let deter you vegetarians the avocado toast is on point!! The service is personal and friendly. Live music all the time! Seriously a hidden gem for craft beer community.", "author": "Cody R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Excellent flavors! Avery apricot sour 4.8 - pronounced apricot, mission trail guava cider 5.1 - TrueType amazing guava flavor smooth and crisp, west coast pilsner 4 - flavorful light hop, fieldwork breakfast stout 5.2 - smooth creamy flavorful but not harsh or overwhelming or too singular- complex", "author": "Mam C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-16", "description": "We came to have a beer...yelp says they open at 4pm...we show up and it's after 4pm and the doors are locked and no one is answering the phone. It's hard to run a new business if your not open for your customers.", "author": "Cristal W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "Didn't try the beer but the burger was great and bartender (owner?) was incredibly friendly and welcoming. Seemed like beer selection was pretty strong too.", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-22", "description": "Slow start with a lot of room for improvement...\n\nThe good:\nThey have a decent selection of beers and the owners are very nice.\n\nThe bad:\n- The food is mediocre at best. The burger was really not worth $10. French fries were soggy and oily, not sure it was made in a fryer. Grilled cheese sandwich was nothing special neither.\n- The venue did not have a solid theme. The mix of furniture, lighting, paint colors make the place look dated. There are a couple of TVs but they are placed on one side of the room.\n- logistics need improvement. They need to hire waiters to help make the operations more seamless and professional.", "author": "Kishan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-16", "description": "Overall, a good place.  Local flavor, decent beer menu on tap.  Needs a few more draft beers from different breweries.  Kitchen is adequate but not generous.  Had the pastrami sandwich - one slice of pastrami.  Really?  C'mon, give us at least two.  And give us a few fries for $16.  Will be back because the owner and cook are nice guys and deserve the business, but they need to step it up a notch.", "author": "william c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "As a SF native of Ingleside, I was very excited to see this tap house open. I have been there 4-5 times recently and the beer selection is very good, well varied, (not slanted in the IPA world as many tap houses are), and the service is very good. Live music no cover charge and the couple of bands I've seen are really good. Lots of local SF residents from Ingleside and neighboring districts like Westwood Park, Sunset, Glen Park, etc. Miles, the owner is really knowledgeable about the beer and food as well as all the breweries in SF. Food is very good for the menu they are going for and is presented well. It's prepared by a chef that really cares and seems to love what he does. The whole staff is great and it's a friendly cool hang out including for families with children. Parking is pretty good, prices are reasonable, and it's a welcome business to the ever changing Ocean Ave that we all love. Highly recommend to locals and visitors alike. This part of the City is often missed by many that don't come over to the South West side of the City. You can take the K Ingleside streetcar from Downtown or West Portal and it stops right at the establishment. The neighborhood is generally safe and quiet. BART stop at Balboa Park is also an easy walk.", "author": "Kevin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "The food is mighty tasty and there's a great selection of beer. I love the local vibe as the musicians playing on the mini stage are often just folks from the community!", "author": "Joe F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "I love this place Daniel and Miles are So nice, they have different beers on tap every week. They make amazing food and put all their love into everything. You can tell they're really passionate about making other people happy. Every time I see them they have big smiles on their faces and they remember every customer by name which is better than me for sure!! If you're lookin for amazing beer & food with the occasional live music this is definitely the place. Two thumbs up from me", "author": "Flower F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-03", "description": "Just opened recently.  Very limited selection.  The food was decent but nothing special.  Beer selection is good but not great.  Dark Horse Inn is by far superior in service, food, and beverage.", "author": "Ciocio S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-22", "description": "Ocean Ale House is a new restaurant and bar on Ocean Avenue, near the Whole Foods.  **went down hill. Had some gross fries and was ignored", "author": "Sven S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "This bar is a neighborhood gem! Came here to watch the warriors game and had such a good time especially with Miles and Daniel. They had a great selection of beers and had fantastic bar snacks to compliment them with. We left when the live music was about to start but looking forward to come here again to local musicians jamming out! \n\nHighly recommended!!!", "author": "Tiff C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "Amazing selection of beers on tap. Staff gives excellent high fives. You gotta check this place out if you haven't been there yet.", "author": "Nicholas W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Food was great. Burger was awesome with the grilled onions. The fries are fresh and crispy. My wife had the pulled chicken tostadas which were our favorite. Tasty smoky flavor. \n\nBeers were good and place was very family friendly for our 10 month old little guy. We've been waiting for a place like this in the neighborhood.", "author": "Pete C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "Great beer and friendly atmosphere. Staff is rad. Delicious food. Drinking good beer and playing connect 4 is fun.", "author": "Robbie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Lots of kids here under the age of 5. 3 TV screens going on at the same time in addition to the house music. Fun board games provided.  Pretty amazing wall mural of the raging ocean.  Burgers are yummy. Oh and by the way, they are 12.00.  Oh yeah, and there's a wide selection of beer.", "author": "Beth A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-06", "description": "this place has definitely made a lot of improvements since they opened. it's overall a great addition to the neighborhood. they initially had a lot of sound issues and hadn't really congealed around a theme but that has gotten much better with turning the TV sound off etc.\n\nthere is just one more thing they need to do which kind of kills me because of how simple it would be to fix - just cover up the annoying bright fluorescent light in the kitchen with a blanket or something! there's the hole in the wall there and the light is just way too bright. the overhead track lighting is also very bright and shines directly in your eyes. however, the lighting issues are so simple to fix!\n\nhope to see this fixed and for the place to continue to improve. it's already a good spot and the potential for it to be great is there.", "author": "Simone B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Couldn't be more excited about this new joint. I came knowing the selection of beer would be awesome and was blow away by the fresh, deliciously prepared eats and the refreshing atmosphere!  Staff is great and makes everyone feel at home. I have already visited three times since the opening and will continue to make this spot my new hang out.", "author": "Stephen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "Awesome new spot! It was clear upon entering that a lot of time and thought went into putting this place together. I was really happy with the beer selection and the staff is ultra friendly. I love the location and I think it is only going to get better and better as it was clear to me the owners are very passionate about what they are doing.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "AWESOME locally owned spot! As soon as I walked in I was greeted by beautiful murals and live music. Staff was friendly and inviting. I tried 3 different delicious beers alongside my big juicy BLT. This place has great vibes: its super cozy, good music, lots of seating, games to play, great crowd, large selection of beer and yummy food. It was a perfect way to end the work week. I will for sure be frequenting this spot!", "author": "Nika R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "So excited to have a new place in the neighborhood! We walked in on opening weekend, so they were still finding their groove. That being said, Miles and the rest of the staff were very friendly and the service was great. Nice selection of beer and a limited but delicious menu of food. A much needed addition to Ocean Ave. We'll definitely return... Hopefully regularly.", "author": "Peter O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-12", "description": "Nice place to have beer and bring the whole family along. Menu could use more options and less grease. Staff is friendly but there's no waitresses. Yes another option on this side of the city. It works for me.", "author": "Javier R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "This place is a diamond in the rough. Love the bearded bartender along with the bearded chef in the back that have the most awesome customer service and knowledge of their beer, wine, and food. By the way the drinks are absolutely amazing and food is delicious.", "author": "shalema m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-03", "description": "It's okay, nothing special. If you're looking for good beer and delicious quality food then hit Dark Horse instead. Sadly very forgettable...", "author": "Cho-cho H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "Went to Ocean Ale House a couple days after it opened. It's a cool atmosphere with a decent selection of beer on tap. The food was great too. The menu is limited, but the burgers are excellent! If you like burgers, definitely try one!\n\nOnly concern is the beers are a little pricey. $7-8/beer, but what can you expect, it is San Francisco after all! Glad to see a cool new spot open up in the Ingleside area. I'll definitely be back.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "I had, an absolutely wonderful time at Ocean Ale House tonight! I would highly recommend, this place to anyone, and everyone who enjoys a good time. Excellent service!,\nCongrats on fantastic achievement guys!", "author": "JuleZ Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-11", "description": "OK, I absolutely love this place. The staff are awesome, Miles rocks but tonight was bad. Took over one hour to get our food..... the Ruban was the smallest piece of toast with some corned beef that I have ever seen, for $15.... rip off. So so disappointed. My daughters cheese toastie was nice but I could have knocked that up in a few minutes at home, come on guys, I know you can do better. I really want this place to succeed, beer is awesome but the food needs to improve or half their current price.", "author": "Stephen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "Met our friends here to watch the Giants game a few nights ago.  They live in the area and had been telling us about this place for a couple of months.  So glad we crossed the bridge to check it out!  The beer was mighty tasty and the burger was seriously the best one I've ever had.  Bacon gravy??  Oh, hell yeah!!  Miles was super cool and didn't mind us ribbing him about his choice of art in the bathroom, haha!  Will definitely be back!!", "author": "Sadie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "Great new spot on Ocean avenue.  Friendly staff with a open atmosphere and really inviting owners.  Had their corned beef sandwich, which was delicious with toasted bread!  Decent bottle beer selection. Small but tasty selection of draft beer.", "author": "Reynald O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "The owners are so friendly, atmosphere is clean bright and inviting, beer deliciously refreshing, and food to die for. No joke. Treat yourself. Why wouldn't you?", "author": "Katie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "Found Ocean Ale House while looking for an apartment for a friend around SF State. Great place. The customer service is fantastic and my friends and I felt so welcomed as soon as we walked in - we were greeted with smiles and they were so helpful with our orders. They had a great selection of beer. I got a bottle of the Petrus - really great sour. My boyfriend had the New Holland Dragon's Milk and my friend got the Harmonic Marosa Amber on tap. The stout was delicious and smooth and the amber was crisp. We were all satisfied with our beers. We also ordered a side of fries too and they were delicious - very crispy and well seasoned. The place has a great and relaxing ambiance that makes you feel comfortable to take your time and relax. Really recommend it if you're around the area!", "author": "Lannie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Great selection of beers, friendly service and I loved the butternut squash soup. Will definitely be back to this awesome addition to the neighborhood!", "author": "John K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "Just a few steps from home and a great place to grab a couple beers, get a burger and relax. On the way to becoming a regular here!", "author": "Michael W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "The fries and whatever sauce it comes with is delicious. I love the low key vibe of this place. It's certainly my neighborhood spot, not to hipster, not pretentious like many other places in the city. The staff is friendly and they don't rush you to drink. I've been a several times. I'm not a beer girl and I don't need to pretend to be when I come here.", "author": "T K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "We had fun here last Saturday. Beer was good. Food sizes could be bigger for the price but tasted good too. I like that it had live music as well. Great addition to the neighborhood.", "author": "Andre S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "You can taste the quality!!!  Even the teenagers commented on exactly that.  Best burger ever, amazing salad and the avocado toast - omg. Oh did I mention he duck egg?    Also great and knowledgeable service.  Don't look any further", "author": "Bin E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "They had a great selection of beer and were knowledgeable and happy to give their insight and recommendations. The food was also fantastic, I had the burger and tried some of my friend's mac and cheese and it was delectable. I went for the Warriors game and there was a decent crowd, but the place still felt homey and comfortable with a bunch of people in it. The high ceilings help a lot!\n\nThis place is pretty new and still testing stuff out, but if my experience there is any indication they will only continue to get better. You can tell the staff and owners are committed to try and please and improve. Would definitely recommend to friends as a place to get together.", "author": "Nick T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "I used to eat there when it was Melanio's.  Loved when they had the Cuban band, El Guajiro. Their music was beautiful.  I have been to the new place and I enjoyed it.  Shared a salad, burger and fries.  I enjoyed the dessert too, Delicious cookie with a glass of port.  Yeah I'll go there again.", "author": "Gale M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "I would highly recommend this place!! The service is really great and everyone who works there is really friendly.  I had a glass of wine and some really great French fries.  This is a great place to go and listen to music and relax!!! Go there and you won't be disappointed.", "author": "Marie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "Definitely a dope spot to chill with the homies and grab a few brews. Came here on a Thursday night and caught the Warriors game! If your in the neighborhood I suggest checking this place out.", "author": "Adrian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "This is literally my first post but I had to do so for this great upcoming bar. The people and service is amazing, they are always trying to please! Come check out this place!", "author": "Maritza T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "Great food and beer. A bit pricy. But the workers are so nice and the place has a nice layout and vibe.", "author": "Hannah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "Had a great time watching the Warriors win at the new Ocean Ale House tonight. Good beer, limited (but expanding) menu is quite good, good live music, great neighborhood feel.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "My wife and & had cheeseburgers and Fort Point Villager IPA pints on Saturday, around 6pm. The burgers were cooked perfectly. Great bun. The meat was that nice looser grind, not packed too tightly. My comment to my wife at the time was that these were righteous burgers. Tasted fresh ground and delicious. Fries tasty but, a little limp. They probably need to double fry to get the crisp pommes frites like they do at some other places in town. \n\nFriendly, honest, unpretentious folks trying to bring something needed to the neighborhood. Good beer selection & good burgers. We will be back.", "author": "Jack D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "At the risk of having my new favorite restaurant become swamped, you all need to come here.\n\nThe beer list is diverse and interesting, the burger is AMAZING, and they have brunch.\n\nMet one of the owners' parents, so so excited to have a place started by local awesome people.  Great, friendly, knowledgeable people at the bar.  Such a welcome addition to the neighborhood, exactly what was needed.", "author": "Kathryn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "We loved this place!  We were in between lacrosse games at a tournament up the street and this was the perfect place to have lunch!  The owner was really cool and the food was awesome!  It was pouring rain so we hung out a little longer than planned!  Great atmosphere!  I would highly recommend Ocean Ale House!  We will be back next time we are in SF!", "author": "Kathy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-30", "description": "Great mural, great location, unlimited possibilities but...\nHorrible service, way too understaffed and overpriced.\nFor a neighborhood in dire need of a revitalizing venue, the place barley passes as a dive bar with minimal section of brews on tap.  The one guy taking orders for a relatively full house was overwhelmed and came off extremely rude despite my multiple visits in attempt to support this new local business.  Although he seemed polite to the other customers I couldn't help but notice I had to be the youngest person there.  The spacial organization of the bar created an intensely close atmosphere for such a large barroom and the acoustics made it impossible not to shout to the person next to you.  The food came with great delay and was a meager portion for the price.  Hopefully this place can adapt to the change the neighborhood's environment is about to experience, but for me this place is a pass until a better experience can be achieved.", "author": "Karon H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-21", "description": "I was so excited to finally have a place on Ocean Ave. for brunch.  I saw that they were open at 10 am.  I arrived at 10:30 am.  They were not open (rather they were not ready, per the owner).  I waited with a beer and ordered the worst burger ever.  On the menu it was $14, I'm like ok... I'll give it a shot. When I received it.....the burger patty was falling apart and burnt.   You do not get a tomato because \"it's out of season\".  You do not get fries with it.  And the lettuce was pitifully chopped iceberg and it came with \"homemade \" American cheese.  I expressed my dissatisfaction and was given many lame excuses.  The price on the menu was changed at that point to $10.  My recommendation is to go to beeps right around the corner.  Maybe go for a beer since it's not made there.  They just pour it.  So sad.", "author": "J. H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "Great Beer selection that is always changing!!!!  The wings rock!  LIVE MUSIC!!!", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-21", "description": "I was really excited about this place opening up in the neighborhood and hoped that it could become a regular spot. Unfortunately, this place was a let down.  The space is nice and the beer list decent, however, it has some major logistical problems. First, they\narbitrarily changed the opening time last minute without notice. Once inside, you can only order a beer by standing in an enormous line run by one person. He works the register taking both food and drink orders, then walks across the way to fill your beers and walks back to work the register to complete your transaction. If you ordered food, you'll get a number to wait at your table. The whole process is slow and tedious and it took over 20 minutes to get a round drinks! Needless to say, there was no desire to get a second round. This place either needs to hire more people to work the bar and figure out a way for people to order drinks without standing in that ridiculous line or there'll be plenty more frustrated, one-time customers.", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Came in last night to watch the Warriors game.  The crowd was great.  The food and the beer were good too.  And there was even a decent band playing.  What a great addition to the neighborhood!", "author": "Donna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "Excellent beer selection and food goes perfectly with the beer! I had the house made reuben, amazing flavor, meat quality was epic, shout out to the chef. I also had the fruh kolsch and it was served in the proper kolsch glass, on top of it making the beer taste better, it also gets you drunk quicker ;) mad props to ocean ale house!", "author": "Andy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "I've been here twice for drinks (haven't eaten here yet) and both times I was supper satisfied. Very friendly and attentive staff, it's a relatively new establishment on Ocean ave and they're becoming my favorite spot to hang out. Prices are a bit high for beer (the cheapest is $7)BUT they have excellent selection of quality beers! Very large space and can host big groups, with chill and easy (but not messy!) vibe. Highly recommend if you're looking for a respectable but also non-snobby place to entertain friends. It's a good option to the *ahem more raucous dive bars on Ocean (which I also LOVE!)", "author": "Clint S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "Diverse selection of beers on tap and more in the bottle.  Not another IPA house although they keep a couple of good IPA's on tap, they also have Belgians.  We had a good spinach salad and these great hot dogs.  Killer local band playing.  All in all I'd definitely return.", "author": "Kate C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "I love this place! Been here twice, and I feel like I've known everyone my whole life. Not from here, and have lamented the fact that bars here are hard to socialize in if you go by yourself. Conversations spark at the bar, everyone is fun, the two guys that own the place are great - really nice and very funny. The beer selection is great, and the taps rotate often. Prices aren't bad at all compared to the rest of the bars in this city. I wish I could spend way more time hanging out there, but life and responsibility don't allow for hanging out in bars all night anymore. I recommend everyone to check it out.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Nicest bartenders in San Francisco, haven't seen anybody pull off the 'blue steel' as well. Great wines and lovely atmosphere!", "author": "Peter S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "Fantastic addition to the neighborhood.  Awesome assortment of beers.  Haven't tried the food yet but it looks and smells wonderful passing by the bar.  Friendly staff!", "author": "Michael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Great vibe for this side of the city! Owners are amazing & friendly. Food is amazing. Band is great. Beers are lovely. Go here. Spend money. You will not regret it. And don't be mad if it's busy; that's a good sign...!", "author": "Mychael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Amazing, friendly staff. Food menu is small, but consistently tasty, and the beers are always good. Never had the same one twice. So happy to have a local watering hole in Ingleside.", "author": "James D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "Excellent addition to Ocean Ave!  Great beer selection, tasty burger, and very cool jazz quartet playing last night.  Will definitely come back again!", "author": "Steve M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "Awesome new beer bar on Ocean Avenue. They have speciality beers and food.  The owners are really knowledgeable about their beer. This is Craft beer at its best.  It's about time we got a bar that you really want to go to. Sadly, outer Ocean Avenue doesn't have any really good bars but the Ale House changes that. All kinds of craft beer where you can meet with friends and relax and enjoy your evening.", "author": "Keith M."}
