{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "Where do I even start?\nThe Toro was the yummiest, fattiest piece of tuna I've ever had. It legit felt like it was melting in my mouth.\nMeanwhile, the Salmon Tartare had all sorts of textures going on that brought the dish together so well: the softness of the avocado & crab, the fattiness of the salmon, the crunch of the tortilla chip, heavenn!\nFinally, my beloved wagyu. Torched to medium-rare (closer to rare) perfection, these highly-marbled pieces of beef were deliciously tender and almost-buttery in flavor.\nWhat can I say? Okane, you never fail to impress me.", "author": "Kathy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "I'm definitely coming back here ! The fish was butter and so fresh. \nOrdered nigiri of amaebe, unagi, uni, hamachi, kampachi. All great quality! Definitely made with love. \nTried the uni, ikura, salmon skin roll. Ended up getting another one because it was so good! \nAlso tried the roppongi which hits the spot. The cucumber wrap made it so good and really complemented the fish. \nAnd finally the tai chazuke. Salmon, rice, and nori in hot green tea. Super simple yet very nice and tasty.", "author": "Natasha G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "I ordered the Kaisen Donburi for lunch and this is my favorite work lunch so far. The fish was so fresh and melts. The sushi rice was also nicely done.\n\nIt was pretty amazing!\n\nI definitely want to go to their physical location.", "author": "Serena W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Yummy, modern sushi spot in Potrero Hill!\n\nWait/Ambiance: My boyfriend and I didn't have a reservation on a Friday night but we were able to call and get a last minute reservation for 6:30. The restaurant was about half full already and was crowded by the time we left, so definitely try to make a reservation! Really cute, modern decor with pickled veggies in glass jars on the walls, kabuki masks, etc. A cute date night spot in Potrero Hill.\n\nFood: We started off with the Agedashi tofu appetizer, which had a perfect crunch on the outside, silky on the inside, and bathed in a yummy soy/dashi sauce. My boyfriend ordered the sukiyaki, which was a perfect amount of sweet and savory and a good amount of food as well. I ordered the Akihabara roll (unagi, salmon, avocado) which was delicious and super fresh. Definitely recommend!\n\nA new favorite sushi spot in the city. I'll be back!", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "This place has delicious sushi, the kind where your mouth tastes good after you eat it. I got the California hand roll (very impressive with lots of real crab! Not imitation crab), salmon ikura chazuke (so gooood!! I liked that they used real salmon and the ikura-the orange balls that pop in your mouth- were tasty!), Harajuku roll (the lotus root on top gave it a nice crunch and the salmon was soft and tender), and Ginza roll (the seared hamachi was so tasty and the texture and smell was good).\n\nAll of the dishes are perfected so that the combination of ingredients highlight the fish in a really delicious way.", "author": "Andrea T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "I have to admit that I didn't get the chance to try many fancy sushi restaurants in my life, but this place totally rocks!\n\nAnkimo Nitsuke (3.5/5): Nice and unusual appetizer, if you are a liver fan, go for it.\n\nOysters with Uni, Ikura and Quali Egg (4.5/5): An explosion of goodness! You will not understand what is happening in your mouth, you just know that is good... very good!\n\nAkihabara Roll (2/5): Way too much rice. Nope!\n\nShinjuku Roll (3/5): Slightly better than the Akihabara Roll, but still not worth it. The crab inside is very dry, ruining the taste and juiciness of the beef. If you are getting this for the wagyu beef the nigiri version is a better choice.\n\nOkane Handroll (3/5): A great top with a bad ending, they should really fill better the inside of the roll.\n\nA5 Wagyu Beef Nigiri (4.5/5): What a fantastic way to eat wagyu beef. I never expected to be so enthusiastic about beef over rice!\n\nOtoro Tuna Nigiri (5/5): Best nigiri ever!!! The Otoro is so fatty that the color of this nigiri is almost totally white, and it will melt in your mouth! Amazing!\n\nOverall Rating (4.5/5):\nFocusing only on the very good dishes, this place totally deserves the 5 stars! Outstanding Nigiris! However, I would consider Okane more a $$$ than a $$, because you don't want to order rolls if you go there ;)", "author": "Manuel T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "We had a great time here. It's a sister restaurant to Michelin star restaurant next door. The nigiri here are the best items on the menu given that half of the items get flown from tsujiki market in Tokyo on a daily basis (on the special menu addition)\n\nWe had the scallop and sea bream nigiri - they are excellent. They ran out of the premium scallops from japan - even the other one was pretty damn good. \n\nAlso they ran out of dessert so asked Omakase to see if they had any dessert upon our request. It was a Japanese custard with sorbet. Just fabulous and beautifully presented! Not too sweet. The custard is light and fragrant with the chilled sorbet - the combination was exquisite. So glad that they made the exception for us here. \n\nAll the other dishes are solid but not exceptional:\nSnow crab with cucumber - pretty food. Lots of crab - served a bit too chilled for my taste. \n\nWagyu and tuna roll - not sure if I love the surf and turf combination here. \n\nVegetable and shrimp tempura - large portion. Pretty filling. Not oily. \n\nSake infused Alaskan cod - cod is difficult to do without being too fishy. For this preparation, the cod is a bit too fishy for me.", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "That sake was wild. Or maybe it was simply too much sake and too little food. Either way, sake was good, food was great, service is phenomenal.\n\nPros:\n+ Reservations called in last minute\n+ Friendly service from sushi chef and servers\n+ Quality fish with smoooth sake\n+ Sushi bar with 4 seats\n\nCons:\n- I woke up with a nasty headache, a scrapped knee, and some mild abrasion to the knuckles. Did I fight some girl?? Nah. I fought with that cement though. Cement wins every time.\n\nThe Good Good:\n+ Otoro, $22\n+ Tai (Red Snapper)\n+ Kanpachi (Amberjack)\n+ Kinmedai (Golden Eye Sea Bream)\n+ Shima Aji (Striped Jack)\n\nCalled in last night at 7:15PM, made rezzies for 2 at the sushi bar for 8PM. On a Saturday night. That, my friends, is winning. But I guess Memorial Day weekend makes it a little easier. Chef Ken was awesome, had great conversation, took a shot together, and the rest is a blur. \"Otoro please\" \"Again?!\" Yes, chef, again. =) Also love his honesty regarding sushi spots around town and Japan.\n\nNever leave your tricka**ho of a bestie alone at the sushi bar because she WILL holler at cute staff members. I came back from the bathroom and this damn girl hollered at Gary on my behalf. So sorry guys! I. Can't. Take. Her. Anywhere! Then again, I got smashed at the sushi bar so I guess I can't be taken anywhere either. BUT we had a good time and that's all that matters.\n\nGrand finale was probably turning around to see that one guy that runs Omakase. What's his name again? Jackson Yu! Yea, see what happens when you drink too much. Recognized his face but that name recall part of my brain just shut down.\n\nAbout that bill. I woke up to a Venmo paid amount for $150. So we spent $300 on two bottles of sake and I guess...hella nigiri? But I don't recall eating much. Which is probably why I toppled in 1.5hours.\n\nGood sushi. Dangerous sake. Great staff. I'd come back.", "author": "Fanny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "Was in town for a wedding so I had limited meals to enjoy. This place did not disappoint! We went for dinner early so we were promptly seated even without reservations. The servers were friendly and asked us if we minded being in their promo shots. They respect customer privacy! \nNow for the food! As someone who recently visited japan, I was very happy with Okane. The food was amazing! \n beef suikiyaki - met expectations. \nsalmon ikura chazuke - love it! The salmon was cooked just right, placed delicately on top so the savory broth didn't overcook it when poored. It was the best chazuke I've had. Nothing was left in the bowl by the time we were done.\nHarajuku roll - the lotus root gave it a nice twist!\nOkane handroll - so. Good. The uni and shiso leaf was a delightful combination of flavors.\n\nWorth the splurg!!", "author": "Jacky L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Met up with my daughter mid week to have a sushi dinner at Okane. I had bookmarked Okane a while back. Located in in SoMa its on the ground floor of a new large multi use building. Upon arriving the host told us it would be a 45 minute wait and they took down our cell number. Since we were waiting for one more person in our dinner party, we went around the corner to grab a couple of drinks at Saap Ver Thai. 20 minutes later right after our drinks and apps arrived Okane called and told us, our table was ready. After getting seated we perused the menu and ordered the following:\n\nSashimi \nKinmedai\nHirame \nAji (whole fish )\n\nNigiri \nOcean trout \nJapanese Uni \nScallops \nJapanese Hamachi\nAma Ebi \n\nOysters\nAnkimo \n\nCooked items\nChawan Mushi \nHamachi Kama \n\nAll if the items were very good with the exception of the Ankimo which was way over cooked and very hard. See pic\n\nService was excellent and the pace of the meal was just right. Street parking might be tough,  but I got a space right across the street. $240", "author": "George F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Came here for lunch and just wanted to order the sushi set but once I saw the menu and the special nigiri they offered, I couldn't stop myself from ordering more (a lot more) and I was happy that I did.\n\nThis is the sister restaurant to Omakase next door (one of the top Japanese restaurants in SF) but they source the fish from the same place (really, really fresh fish flown in from Japan).  I ordered the sushi set, the Alaskan cod, the chicken Karaage, a couple of special pieces (Amaebi and A5 Wagyu) and the white sesame ice cream. \n\nAs expected, all of the sushi pieces were perfect and fresh. What was unexpectedly good was the Karaage and the Alaskan cod (lots of places in SF offer a version of this dish but this is one of the better ones).  Service and ambiance were both great. Prices are about average for a casual Japanese restaurant In SF. Highly recommended for lunch or dinner.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "We love this pace a lot. the food is yummy and the service is excellent. We had Charling and Irean this past Saturday and they're both really sweet and attentive. We'll be back very soon!\n\nI was also there the week before to celebrate a friends bday. They all love this place too and had lots of fun!", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "Shijuku roll (with A5 wagyu beef!), seared scallop nigiri and the oysters (with all the extras!) were my favorites. Was pretty packed for a random Thursday night, probably eating with the rest of the locals in the neighborhood.\n\nI'd probably come back, and probably only order the oysters. Yum! Uni, quail egg, ikura (?) with oysters. Can't go wrong with that!", "author": "Cal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-12", "description": "Wrapped up my foodie weekend with this gem. Sister restaurant to the famed Omakase next door, make sure you get plenty of nigiri and sashimi vs the cooked dishes. That'll be your best experience. \n\nI am happy to say that everything tasted amazing. The fish isnt as 'melt in your mouth' as you'd get at Omakase or any other $$$$ sushi spot, but they know what they're doing and this is a great sushi spot without having to break the bank. \n\nWe ordered the uni, toro tuna, scallops, seafood hotpot, hamachi kama, salad and one eel roll. They even rolled out a black sesame ice cream with mollasses sauce for the bday desserts. \n\nThanks and see you again soon!", "author": "Mandi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Gary, thank you so much for another great experience. We had a wonderful time last night and the dessert that came over from Omakase for my boyfriend was delicious and beautiful. I have been raving and raving about this place to everyone I know and this restaurant has cemented itself into our mental list of Japanese restaurants. I was so excited, I forgot to take pictures! Next time I won't miss it! You deserve the promotion. It was great to see you, and thank you to your staff for choosing items we ordered to serve in a perfectly choiced course style way. It really is unbelievable when you can connect to a place of business like this, and I'm glad we found you! See you next time!\n\nThank you,\nGauri", "author": "Gauri V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-02", "description": "This a review of their take out.\n\nThe fish quality was pretty bad to the point where I didn't even care to eat it. The hamachi and salmon nigiri did not taste fresh at all. Ordered the ginza and roppongi as well. Neither were edible enough to finish. Same issue with fish quality. Every dish came off as bottom of the barrel fish.", "author": "J. K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "A bit hard to find, but great food and service.\n\nThe space is a little cramped as many restaurants are in SF. As a result, I got to overhear the guy next to me mentoring his lady friend. \n\nThe shinjuku roll was delectable, with the seared wagyu beef as the highlight. \n\nThe okane handroll (not pictured) was also delicious (and crunchy), but with only one to share, I had to get over my germaphobia. \n\nThe salmon and ikura chazuke (also not pictured) was light and soothing. \n\nThe beef sukiyaki was a relatively large portion size, but slightly too salty. They very graciously served us another more watered down version.", "author": "Aerin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "5 stars for sure!!!! We came here on a Saturday night at 7:30pm and had the time of our LIVES lemme tell ya. We ordered the daikon & cucumber salad, two okane hand rolls, the sake sashimi, and the beef sukiyaki, which was a good amount for two people. I don't even know what was the highlight because all of it was SO GOOD. \n\nThe salad was really big (so it's def a bang for your bucc) and super light & refreshing. I feel like a lot of Japanese restaurants drench their salads with sauce until it's salty af, but not Okane. The sukiyaki came with the most perfectly cooked egg ever, like i've seen maybe 10 perfectly poached eggs in my life and this was one of them. The beef was really juicy and soft and thin. Both are perfect for sharing between two or three people, since their portions are so big. \n\nThe restaurant has a lot seating for such a small space (without being cramped). It was pretty quiet so it's a good place for talking. The environment was fancy but also casual if that makes sense, so like it's a good date night place but also you don't need to dress up. If you wanted to you could probably get a sick insta from it too because the inside is pretty.\n\nThe service was the fastest i've ever seen for a sit down Japanese restaurant. Our reservation was at 7:30 and we paid the check at legit 8:02, and we weren't even in a rush or anything. The food came out super fast and the servers were really good at checking up on us, refilling water, clearing plates etc. \n\nHope to come back again and try some other dishes!!!", "author": "Brittany H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-26", "description": "I came here in October for a late dinner with one of my best friends. She had heard great things about this restaurant so we drove over for dinner. Seating wasn't an issue that evening. We had a nice table by the window. \n\nI don't remember the details of each dish so hopefully the pictures will make up for it. \n \nWe had:\n\nSalmon Aburi:\n\n- really good but expensive at $19. We had two orders because it was that delicious\n\nLotus chips:\n\n- meh. Nicely crunchy but nothing special\n\nScallop uni nigiri:\n\n- delicious, fresh, but oh so pricey at $15\n\nTai chazuke:\n\n- pretty presentation but the tea broth tasted too mild\n\nSalmon tartare:\n\n- don't order this. Order the salmon arburi instead.\n\nChicken wings:\n\n- fried too long, tasted dry\n\nService was pleasant. It's a cute little restaurant. I'd return to try other items if I were back in town.", "author": "Faye L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "My coworker was craving udon. This was the closest place to work that offered udon, so we came here for lunch today around 12:45. I always go a few stores down to the French bakery or Starbucks.  Upon walking in, I thought that the decor was very modern and sleek. \n\nWe got seated right away. There's lots of seating inside to accommodate the lunch rush. My coworker and I both ordered the ontama sukiyaki udon which comes with thin slices of beef, a softly cooked egg, and green onions. The food came pretty quickly and I liked the presentation a lot. The broth was very flavorful! I normally do not drink the broth from ramen or udon. However, this broth was so tasty that I couldn't stop! The beef was cooked nicely and well season. I think they were going for a soft boiled egg which maybe what they mean when they said softly cooked on the menu? The egg was not soft boiled. Think fried egg shape with all the way cooked yolk. \n\nAt $12 dollars a bowl, it's a bit on the pricey side for udon. But service was attentive and friendly. They were also able to split our bill three ways, which was incredibly nice of them. It's a bit of a walk from the office, but my coworker and I have agreed to be back!", "author": "Cynthia T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-29", "description": "Usually, my friend and I satisfy our sushi craving by ordering a giant platter for four, drinking whiskey, and binging Futurama at my place. We decided to keep it classy for once and have lunch at Okane in the middle of our workday.\n\nWe were seated immediately, and there was an expected lunch crowd filling up the remainder of the restaurant. The experience was nice and service was relatively quick, but there's few things that didn't quite resonate with me at Okane.\n\nFirst, we ordered three items to share: Akhihabara Roll, Roppongi Roll, and Kappabashi Roll. We devoured everything in no time and were still hungry. The rolls were pricey for the amount of food. Yes the ingredients were fresh, but there wasn't much of it. So disappointing that we ended up going somewhere else to eat more food. Blasphemous.\n\nAlso, there was no soy sauce on the table, and we had to ask for it. Kind of inconvenient but I get they want to eliminate clutter on the table. They allot a certain amount of soy sauce then walk away with the receptacle. Never seen a place do that before. \n\nAnd lastly like I said, it's pretty pricey restaurant for sushi that doesn't fill you up. It's a classy place for a nice business lunch, but expect to walk away thinking about dinner already. Would I come back here? Nope. Did I like the food? Yes. Just not my kind of sushi restaurant.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-01", "description": "Good sushi + izakaya spot. The food comes out fast - we almost couldn't keep up with it. It's not the most spectacular Japanese I've had, but it's solid, and reasonably priced, and easy to get a reservation with a few day's notice. \n\nWe ordered a lot and by the end of the meal I was having a hard time finishing everything, so that may have impacted my review on some things like the Tai Chazuke. \n\nNote Okane is right next door to Omakase, and from the outside they look like just one continuous restaurant. My friend and I each went to the wrong place by accident at first!\n\nVEGETABLE IPPIN\n* Fried Lotus Root Chips ($5) - 3.5 stars\nQuite crisp, and the wasabi mayo was very heavy.\n\n* Agedashi Tofu ($9.50) - 3.5 stars\nGood, but I wish the tofu was a little more silky.\n\nMEAT IPPIN\n* Jidori Egg Chawanushi ($8) - 4 stars.\nNice! Simple. Steamed egg with tempura and some bok choy.\n\n* Beef Sukiyaki ($16) - 4 stars\nLove the vermicelli noodles and the green veggies. Great for my noodle soup craving!\n\nRICE & NOODLES\n* Tai Chazuke ($12) - 3 stars\nGood simple rice & soup dish. I thought the salmon was a little overcooked, but I was also really full at this point.\n\nCHEF'S CHOICE SASHIMI\n* Hamachi Kama ($15) - 3.5 stars\nThis was fine - just not the sashimi I was personally in the mood for.\n\nSPECIALTY ROLLS\n* Kappabashi ($13) - 4 stars\nGood! Nothing spectacular, but if you like tuna and cucumber, this is good.\n\n* Shinjuku ($25) - 4 stars\nOf course the A5 wagyu was good, but you really pay for this, and I didn't love the crab. I wouldn't get this again, but enjoyed the one-time novelty.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Probably my favorite sushi place in SF!! Their specialty rolls are to die for. I also love the Udon! Omg sooo good. Great friendly service too. Would highly recommend going there!!!", "author": "Asher B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-07", "description": "I was hoping to try a less expensive version of Omakase. However, dishes were a hit or miss. Unfortunately, I wasn't impressed by the dinner, but maybe I'll come back for brunch someday. These are my thoughts on what we ordered:\n\nGrilled cod: the best dish we ordered. The cod was buttery and well seasoned. \nSaba karaage: this tastes like pan fried mackerel that my mom makes, but with pickled vegetables on the side. Make sure to eat the fish with the veggies, which brings out the flavor of the mackerel in a different way. \nToriteba karaage: these were amazing and the crunch was equivalent to that of chips. The sauce was also really good. \nOysters on the half shell with uni ikura quail egg: the oysters were overwhelming and had a bitter aftertaste that couldn't be quelled by the sweetness of the uni, ikura & quail egg. I wish the oysters were smaller and sweeter. \nShinjuku roll: this had a great texture, but the A5 beef didn't have much flavor or fattiness. The creaminess of the avocado and sweetness of the snow crab paired well though. \n\nIn terms of service, the servers were friendly, but were not organized in terms of handling our order (we had a couple people take our order and then they got confused delivering dishes to us). I was disappointed that many of the dishes came out at once, and I was rushing to finish eating some of the food before they went cold.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-17", "description": "Tried this place twice, and none of the food really spoke out to me. \n\nThe lotus chips were good, and I tried a chef's choice sashimi platter today with my preference of scallops and salmon. All of it was okay, but nothing exemplary. I can't say that I would come back for more.\n\nMy friend ordered the tofu dish and veggie tempura. \n\nOverall, the best thing actually was the tofu last night. \n\nService and decor were great, but the food just okay. I found making a choice kind of hard- maybe adding dinner sets or a course meal?", "author": "Corinna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "What a great atmosphere and staff. Sydney took great care of us. My son who is 6 branched out and tried it all! Highly recommend Salmon Aburi, Ginza and Roppongi Rolls. The edamame with smoked soy sauce is super fun. Thank you and we'll be back!", "author": "Jeana F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "Food quality was good. Fish was fresh, nigiri pretty solid. Cooked sides were also good. Above average price for above average food. 2nd or 3rd date spot when you're willing to invest. Good spot with a group of 4 to eat well and drink before a night out.", "author": "Pat K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-23", "description": "Food was good (my table had orders of sushi, sashimi, chicken skewers, shiitake mushrooms) but the service was terrible. We arrived without a reservation on a Friday night around 7:40pm (table of 4) and saw that there was seating space. The hostess asked us if we would be able to leave by 9pm and we said yes. She handed us menus and asked us to order our food by the entrance of the restaurant while they get the table ready for us. It was strange to order by the front door but we obliged. We were prompted several times by the hostess to order quickly and we ordered food to share family-style. She looked at our order and told us that we should get 3-4 more dishes and we should order now and not order after we've gotten food. We got a few more and she asked if we wanted one more. We declined, as it was a lot of food. One friend in our party commented, \"That was intense.\" \n\nWe sat down, the food arrived quickly, it was all yummy, but when the time rolled around to 8:42pm, and we were finished with our food and got the check. The hostess came by our table and very rudely asked us if we are ready to go. We hadn't paid the check yet, clearly, and it was 18 minutes before her deadline of 9pm. We said no we just need to pay the check. She came around a few minutes later to do a perfunctory wipe of our table, reminding us that we needed to leave by 9pm. Okay we get it. We sat for a few more minutes. She stopped by our table again. Yes we are aware that we have to leave soon. The whole experience with the hostess was anxiety-producing and uncomfortable and really colored the experience in a highly negative way. Not worth it.", "author": "Jessica Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "I stopped in for a quick lunch and was pleased with the excellent service and delicious food. Today was my first time here as I recently moved to the Bay Area, and I feel like I've already found one of my favorite spots.", "author": "Deema A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "Their Ginza roll is absolutely PERFECT. Akihabara and Shibuya were also great. Ambiance is on the quieter/more intimate side, good for actually being able to hear your conversations. Only downside was that the portions are a bit small for the price", "author": "Maggie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "This place is gorgous！ We tried the oyster and it's super fresh with a hint of sweet，tastes like heaven！Salmon sashimi was good too，toro was yummy. Will defenitly come again！", "author": "He H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-29", "description": "Came here for lunch on a weekend with a friend. Restaurant wasn't too packed since we went after the lunch hour. I would recommend making a reservation since they take them and the seating is small.\n\n[Lunch]\nThe 3/5 rating is primarily for the dish my server recommended me. I had the Sukiyaki while my friend had the ontama udon. The sukiyaki was really sweet and had way too many glass noodles to meat/vegetable ratio. The sweetness was very overpowering. I did really enjoy my friend's Ontama udon - the ratio was great here and there was plenty of meat. We also ordered the fried young chicken - it was amazing! Highly recommend as the chicken was the juiciest I've had in a while. We also ordered some nigiri - uni, toro, and salmon. I didn't find anything super amazing about the fish; it was something I felt like I could find at your better than average moderately priced sushi joint. \n\n[Service]\nServers were very friendly and attentive. They did forget our fried chicken dish but immediately brought it out once we asked. \n\nOverall, I would definitely come back and get the ontama udon, the highlight of the restaurant. Given its sister restaurant is the famous Omakase, I was a bit let down by the nigiri I had here, hence the 3/5 rating. Hopefully my next meal here will improve my rating!", "author": "Alice Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-24", "description": "Very POOR service. We were so excited to try this place, made a reservation, got there on time, when seated, It took almost 15 minutes until our waitress came to our table to take our order. We quickly ordered a few appetizers and hot sake. She came back after 20 minutes with our appetizers and we ordered our main dishes and some more appetizers. \n\nAfter over 30 mins, she came back with only two of our orders. We waited a bit to get our two other orders, so we can all eat together, but it took so long and after over 45 minutes that nobody came to our table, we gave up. She never even came back to fill up our water. We had to keep asking someone to bring some water to the table. \n\nIt was very disappointing to have to go through that. We were not able to enjoy our time together and have a nice and relaxing dinner.", "author": "Reza N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "I really love their Shinjuku roll and Okane hand roll, and their presentation of food. I'll be back the next time when I crave for authentic Japanese food.", "author": "Yuxi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-19", "description": "A tad overpriced for the portions, taste and service you receive. I ordered:\nYoDu tofu - minimal flavor until you add the soy sauce which comes on the side. \nCucumber and Diakon salad- I tasted little cucumber; not your traditional Asian cucumber salad. \nRice w softly cooked egg - this was actually pretty good. Just very small portion. Once you mix the egg and spices, the flavored blend well together. \nShrimp & veggie tempura - $16 for a few pieces! \nAlso the sake is served cold, which to me is odd. \n\nNote- not vegetarian friendly.", "author": "Rob M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-29", "description": "I booked a reservation here for my monthly coworker dinner. It was a Thursday night and it was pretty empty so we got seated immediately. Overall nothing about this place stood out to me. The sake I ordered from their menu happened to be sold out. The service was average as well: First nobody had chopsticks when the food came out, then my friend ordered a drink that never came so we had to follow up on that, and lastly at the end of the dinner they quickly cleared our table and my friend's drink that was still half full. They didn't even ask her if she was done with it (which she was not) so they had to bring the unfinished drink back from the kitchen. \n\nWe essentially finished all the food we ordered within 45mins because the food came out all at once. It didn't create an environment where we could hang out and chat; it actually felt rushed. We each paid about $50 and were still starving. Instead of ordering more we made a group decision to go to another place to finish off the night with some tater tots :)\n\nTo be fair, the food was good but not stand out from other sushi/japanese restaurants in the city. It's really not worth the price. I'd recommend using your money elsewhere and skipping this place. \n\nRandom fact this place is part of the restaurant chain owned by Omakase Restaurant Group (ORG) that also owns the Omakase restaurant next door and dumpling time that's right around the corner.", "author": "Kathy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-07", "description": "Their was an Asian waitresses  who served us. She was very unpleasant to our group from the moment we first walk in. Though the food came out quick but the food wasn't good and the portion of the noodle soup was definitely smaller .", "author": "Aniko N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-01", "description": "Real talk. The entrance to this spot is hella confusing. My friend and I walked in for our 6:30pm reservation...thinking it was Okane...only to realize it was Omakase. Here we were in our ripped jeans, plus me in my \"vaca vibes\" crop top, thinking holy shit we are SUPER underdressed?! And wait wtf, we booked a Michelin star restaurant for dinner?! Hostess checked us real quick and said Okane is next door. Whoops. So tl;dr two sushi restaurants next door to one another. Omakase to the left; Okane to the right. \n\nOKAY, soo when we got to the correct restaurant I was thinking, well damn, Omakase must hate being next door to this \"shittier\" restaurant w the wrong ppl coming in all the time. And again, I got fact checked by my friend who went to the restroom and saw a newspaper article on the wall, detailing Okane being the sister restaurant to Omakase. Well guys, we were in for a better than expected Saturday night sushi experience! \n\nI got a lot more excited about dinner and HAD to get the Hokkaido uni nigiri at that point. My friend's not much of a sashimi/nigiri eater, so we got two of the rolls (one was basically a 49er roll w a diff name and the other was a shrimp tempura w hamachi on top situation). For apps, we started w the lotus root chips and agedashi tofu. Anddd to finish we got the udon with soft boiled egg. YUM. \n\nHonestly, I was really happy with the sashimi quality (no surprise if they're right next door to omakase)...I meannn, they've got to be getting the fish frm the same vendors (maybe just slightly lower quality and I'm okay w that on a regular sushi night). Also, the udon had great bite to it, and the soft boiled egg was blanched to perfection. I'm not a huge fan of rolls either, but I'd say it was pretty good quality. \n\nDefinitely a come backer. Prices are higher than a nightly sushi dinner spot, but nothing compared to what you'd pay for Omakase next door. About 45pp. Service was also pretty good. Keeping them at 4 stars bc there wasn't anything EXTRAordinary about the dinner, but still good enough for me to patron again.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-18", "description": "This place is one of the most popular restaurant in SOMA. Service is up to standard and has good selection of Japanese sakes. Food is fresh but however they put too much sauce in almost every dish. I ordered beef and chicken skewers, black cod, honestly they don't taste much different due to the overloaded sauce.  I think a usual fan of Japanese food would appreciate the natural taste of freshness of the material more. I would give 3.5 star as the food is not up to 4 but better compare to other 3s in the city.", "author": "Helena H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "My sister and I can agree that the oysters were our favorite dish from our most recent trip to San Francisco. We saw a picture on Yelp, read a couple of reviews, and knew that we needed to try it for ourselves. It was life changing - not to be dramatic. Who knew these oysters could pack so much punch in one slurp?! If I go back to San Francisco, I am definitely coming back for some more.", "author": "Natalie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "Good service, good quality fish, pretty good lotus chips, good sushi in general, but not \"omakase\" level. I recommend the Otoro tuna belly and the sake salmon belly. \n\nI have to say though, while it is good quality fish I still feel the quality or quantity does NOT justify the excessively high prices... the same dish in many other major cities in the US is almost half the price of SFO. Pretentious yes, or maybe taxed to hell to drive up the price, but still good. Just be prepared to pay the inflated prices. 4-stars, would have been 5 if the value was there... but it isn't. Expect a $100-$120ish tab for two.", "author": "Chris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Love love love. Shibuya and Kapabashi rolls are my favorite. Any of the \"dons\" are yummy and so is the Sukiyaki. The best part is that they're available for delivery through Caviar!!!", "author": "Danielle Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "I'd give this place a 4.5 if they allowed that on Yelp. We got a relatively last minute reservation for this past Saturday for dinner. We were a bit surprised it wasn't more busy for a Saturday but it's in an area a little more out of the way for most people.\n\nThe experience was really good all the way around. My fiancée is currently not eating soy or gluten and they were extremely accommodating. They allowed us to order sets of 2 nigiri with one fully dressed and the other without the soy/gluten. The chef made a nice little tray of lemons, yuzu vinegar, truffle oil, and salt to help flavor the various fish and instructions were given to the server for which things to put on each fish as we received them.\n\nAll of the fish we were served was very fresh and delicious, while there were a few that really stood out like the amberjack, grunt and the fresh hokkaido scallop. They also custom made us a cucumber avocado roll which we didn't see on the menu. We only did sushi this time around but we hope to come back to try some of the izakaya type dishes as well.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-19", "description": "Not impressed at all. This place would fail in Tokyo - where we live - within a month. Hard, dry rice in the oyakodon, weird breading on the tempura shrimp in the udon. Very poor presentation for the oshinko. 2stars only because they have good beer. Friendly service, but slow preparation. \n\nDon't waste your money here. Many better places to eat.", "author": "Joe P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "Love love finding new sushi places to eat in sf. This place definitely did not disappoint. \n\nWe had reservations here on new year. The restaurant is a lot bigger than it appears outside. I love the face mask that lined the back wall as decorations. Really nice touch. My friends and I decided to order several things and share. Started off with otama udon, the roppongi , shinjuku, ginza roll, an order of local uni for me, and a bottle of sake. Everything was so good! I definitely enjoyed all the rolls and were able to taste how fresh the fish were. And don't get me started on the uni, I love that they serve it without nori wrapped around the rice here. The uni literally just melted like butter, it was so good I had to order another one haha. The wait for the roppongi roll took a lot longer than anything else and we didn't mind. We honestly just thought because of new year everything was probably backed up but the staff had noticed and bought out lotus chips and another ginza roll for us while we waited. It was really unexpected and we all comment at how amazing their service was. I understand getting one thing but two? The service alone will be the reason I'll keep wanting to come back here :). It was really a nice treat for us and they most definitely didn't have to do that for us. \n\nIll just continue my hunt for awesome uni in Seattle while I day dream of the next time I'll be able to have the delicious food from Okane again.", "author": "Linh N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "Recommended by an acquaintance... Some unusual sushi I've not seen anywhere else.  Really enjoyed it.  Very busy.  Loved that they use actual crab rather than fake crab. Not a huge menu but that probation how they keep everything fresh.", "author": "William L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Glad I went to this place instead of waiting for a long line of Ramen place.  I'll go back next time when I am in town.", "author": "masa t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "Japanese Brunch? Have you ever heard of such a thing in the city? Once my girls told me they had Japanese brunch here, I was committed to making this happen! Easy to make a reservation the three times I have been here: twice for brunch, once for dinner. Open table! \nI just found out they have indefinitely discontinued doing brunch ):\nI recently went back for a casual Japanese comfort meal on a Friday and Okane did not disappoint! My friends asked me what's Japanese comfort meal? No stress, just order whatever you want (it's reasonably priced) and decently made. \n\nFor two people, we had:\nHamachi Kama (Yellow Tail Collar) - another must every time I see it, good, not dry!\nSukiyaki - lots of vegetables, huge portion, on the sweeter side \nLoaded Oysters (with the Uni, Ikura and Quail Egg) - they give you 6 so yummy!\nChawanmushi (this is the definition of Japanese comfort food) - bland but I always order this every time I see it\nHokkaido Uni nigiri ($15 for two pieces) - fresh, what can go wrong?\n\nEverything was up to par except for the Chawanmushi, which unfortunately I would have to say, no place has quite compared to Rintaro. Bill came out to be about $100 and we were so full we barely finished.\nOverall, I would have to say, the food was great, service was great (I've had friendlier service for lunch before though). Probably not a regular but will come back from time to time.", "author": "Miffy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-14", "description": "Definitely a more upscale Japanese place,  but less expensive version of its sister restaurant next door, Omakase.\n\nDo get the lotus chips. These are yummy and addicting.\nHamachi is good too.\nAny fatty tuna is my favorite. And this place gets it right.\nOne of the rolls I normally get is pretty good too, but I forgot the name. Not the one with the beef in it...\nGood sake selection, and wine list.\nElegant dining area for date night, but I tend to sit at the sushi bar.\n\nPricing is a bit up there, but hey, this is SF, so I'm used to it by now. But I'm always down for a good sushi spot, especially in a city that has too many to choose from!", "author": "Nika K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-14", "description": "I really wanted to like this place. Servers were nice and ambience was modern and clean. Food was just not up to par with everything else. \n\nOur server recommended us the rare special - live uni (around 5 pieces for $39). I wouldn't call my friends nor myself uni connoisseurs, but we're definitely uni lovers who have had enough to say that this was the most interesting uni we've had.. It was watery tasting with hints of bitterness. Texture was stringy and slightly crunchy. We were quite confused to say the least, but perhaps it was just a different type of uni than we're used to.\n\nI also ordered the salmon and ikura chazuke, which was rather disappointing as it was very bland and unimpressive. We were also charged $4 for a small cup of hot tea, which seemed a bit much. \n\nThey do have quite an unique selection of items on their menu so I'd still come back and try out something else and hopefully have a better experience!", "author": "Mandy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "Came here for lunch but was too early and they only had the brunch menu. Was pretty bummed at first but turns out I was mistaken. There's not too many options for brunch but their most popular items are the set menu. The restaurant feels very intimate since its not very big, so you might also want to make reservations if you don't want to wait.\n\nMy friend and I ended up getting the set menu from the Okane Brunch Menu which also comes with a bowl of rice, miso soup and a side salad. I'm giving this place a 10/10 in terms of presentation and their creativity. This was my first time having japanese brunch so I was really excited about it. The portions looked really small and I thought I would still be hungry after this meal but man was I wrong. \n\nMegumi: \n- Stewed beef: in layman's term its basically your beef yakiniku. Nothing really special.\n- Miso gindara: Gindara was marinated well and was really soft. Did not taste fishy at all. \n- Onsen tamago with truffle oil: This to me was the highlight of the meal. You have a perfectly poached egg in a bowl with a white creamy sauce, asparagus and a hint of truffle oil. No words can describe how good this dish is. They suggest you to pour it over your bowl of rice but I personally like my rice plain. \n- Sushi sphere: Your typical nigiri (salmon, toro and white tuna)\n- Potato salad: Nothing special\n- Crispy baby anchovies: Don't remember getting this with my meal but we did get a bunch of pickled vegetables \n\nMiyabi: \n- Stewed pork belly: Melts in your mouth! Similar to caramelized pork belly in chinese restaurants. \n- Braised chicken and turnip (soup): Clear broth with chicken and daikon, A little bitter, maybe they didn't wash the daikon properly or cooked it too long\n- Smoked salmon: Tasted like the miso gindara but with an additional smokiness to it. The fish itself is smooth and doesn't smell fishy.\n- Tamago: Pretty good tamago, perfect sweetness level\n- Sesame tofu: Tofu had a weird texture. It was crumbly and not as smooth as your regular tofu.\n- Crispy baby anchovies: Don't remember getting this with my meal but we did get a bunch of pickled vegetables \n\n\nFound out that this was actually a sister restaurant to omakase (right beside it). I would definitely come back here for their brunch experience and also to try out their dinner menu.", "author": "Valerie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "Food is exceptional with classy aura of Japanese interior decor. Okane's sushi chef prepared the Kuromaguro (blue fin tuna) and Mushiebi (tiger prawn), which was simply amazing. Wakadori Karaage and the Hamachi Kama are dishes I recommend as well. Price is fair for authentic Japanese cuisine.\n\nThe service was cordial and attentive, which is always a huge plus when you're dining in (the gentleman, Adrian, was phenomenal, explaining each and every dish with detail and professionalism). \n\nOkane is definitely a must-stop place when I'm back in the bay area.", "author": "Andy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-14", "description": "Solid 4 Star I had to knock off one star for service, granted the place was packed but a hour lunch with only one drink and and order of 2 items seems a bit long...if you have a long lunch break definitely check them out, the sashimi is fresh and the plating is like omakase his other restaurant next door", "author": "jonathan h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Love this spot. Their udon is amazing. We come here pretty frequently because the food is so good. Definitely recommended!", "author": "Yong-Soo C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "TL;DR: delicious and gorgeous Japanese sets that come at a premium price\n\nWhen I heard Okane now offered brunch, my interest was piqued and I gathered a group of friends to come and check it out. \n\nTo be safe, we made reservations a couple days in advance, which was super easy through OpenTable. It was wide open when I made the reservation.\n\nThey call it brunch, but it's more like a Japanese breakfast set in my opinion. I ordered the Miyabi set ($22), which comes with pork belly, braised chicken, smoked salmon, tamago, and tofu. I loved the presentation, as everything comes in colorful small plates served as part of a round wooden tray (see my pictures, that will make more sense). Halfway through eating, I realized I probably wouldn't be full from the set and ordered an okonomiyaki on the side ($14). \n\nFood-wise, everything in the set was delicious except for the braised chicken which came in a broth, as the chicken was kind of dry and hard to chew even though it was cooked in the broth. My favorite item out of the set was probably the pork belly, as it was well flavored and melted in my mouth. Something to keep in mind is that the sets are all on the small side, so if you're hungry you might want to order some of the appetizers to share.\n\nI was disappointed by my okonomiyaki, though. I don't know if it's because they were rushing to get it out to me because I ordered it halfway through my meal, but it came out maybe 80% cooked and there was still some of the uncooked mix that pooled at the bottom of the dish. They must have heard my friends and I talking about it (or maybe they noticed themselves), because they comped it for us. That's what I call good service! \n\nOne thing that threw us off was the prices on the menu were a little bit higher than the prices we saw on their website. The Miyabi set is actually $22 and the Megumi set is $25. We had already scoped out what we wanted before coming, but the increased prices made us rethink our choices.\n\nI'm glad I came to try it out once, but it's honestly a bit too pricy for what it is and the portions that you get, so I don't think I will be back for brunch/lunch.\n\nParking in the area is street parking. The restaurant is on a street with all metered spots, but I parked a block away in an apartment parking lot and that was free. Score!", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Came here for lunch and dinner. 5 stars for the food and service. The menu changes slightly so make sure to try everything if you can! Affordable and fun with great service.", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "Came here cause we didn't want to wait at dumpling house, didn't know they were sister restaurants along with omakase! Really good dining experience here. Great food, and even better service (Gary is awesome!). We got the uni nigiri (hokkaido is more expensive, but so sweet and not overly sea-tasting), the beef sukiyaki (really good on a cold day- lots of fun stuff inside), and the harajuku roll (really like the lotus chips on top- a little spicy- but not too much). Great ambiance. Will be back!", "author": "Vivian D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-19", "description": "I was excited about a new seemingly intimate izakaya opening up in the neighborhood close by. Reading their menu, they have got everything I liked to order when I was in homey izakaya restaurants in New York. Udon, tonkatsu, sukiyaki... it's a rarity in SF indeed. SF is all about turning everything into Californian refined instagram-friendly style, when no one has any glue what a good taste could be.\n\nIt was a very shitty day. I just wanted something warm and cozy. So I came here the first time, hoping to feel better after I left. But I only left feel warm because my udon dish was way too hot, but not cozy or satisfied. The whole meal was a bit tasteless.\n\nI regret not getting beef sukiyaki. So I will give you one more chance for that.", "author": "Yuhuan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "After dining at this place 10+ times in past three months. This place is officially my favorite spot for my Japanese food.  \n\nTheir sushi chef Ken San is very good and he is definitely one of the best sushi chefs in the city \nMe and my friends always order tons of Nigiris. And if they are not busy we will ask for Omakase!\n\nTheir cooked foods are very good too. \n\nMy favorite items from the kitchen are\n- lotus chips.  OMG! That wasabi mayo goes so well with thinly sliced deep fried lotus chips \n- karaage big pieces of juicy deep fried chicken. I cannot stop craving it!\n- beef sukiyaki. I am not a sukiyaki person but this place has really good sukiyaki \n\nDon't forget to order some sake or beer to go along with your meal. We always leave happy after the good food and delicious sake. \n\n\nHands down one of the best places in the city to eat/ drink and hangout with friends.", "author": "missy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "First time here and I loved it. Please come here. I'm sad this place has such little reviews because it's so freaking good and the quality of food and presentation is just A1. My boyfriend and I ordered the sukiyaki udon and harajuku roll. The harajuku roll came out first and the tuna was fresh and tender with a nice touch of a crispy lotus chip on top to balance the roll, 5/5. The sukiyaki udon was light and felt like something my mom would make at home. It hits the spot if you're eating this in cold weather. The only problem I have with the sukiyaki udon is that it didn't really taste like sukiyaki. I'm used to a sweeter and more flavorful sukiyaki, but this was more of a clear broth that wasn't as heavy. Don't get me wrong though, because I still loved it. 4.5/5 just because the name threw me off. 10/10 would recommend coming here and I'm definitely coming back soon.", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-28", "description": "Very classy Japanese food. You can watch the chefs and their super detailed knife work. \nMe and my friends came a bit too early so we were the only ones there for a little while. The servers were really nice. Helped recommend a lot of great dishes. We ordered two rolls, a cod, and a meat noodles dish. All which were really good and fresh, but not enough to satisfy us so we had to order a second round. \nI really love the decor as well. Nice ambiance. \nIt was also my friend's birthday and we never said anything directly (we spoke of it in or conversations though) to the waiters until the end of our meal and they were already preparing something for her! It was an almondy ice cream with some Michu and it was not overly sweet, so it was perfect! Thank you for that :)\nAll in all, the food was good, but I wish it was cheaper considering the portions.", "author": "Vence M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Came here for brunch last weekend and I've already made another reservation for brunch again next Sunday! I think this is my new favorite place for brunch, especially because it's unique AND tasty. For those of you who have traveled to Japan, you know how delicious their breakfast is... and not to mention how their presentation is so pretty! \n\nThey offer 4 different set meals and each one is so fulfilling and also worth every penny. They vary from pork belly, misoyaki fish, steamed egg, asparagus with eggs, and a side of miso soup and salad. I love variety in my food and it's nice you get ~5 different small dishes. We also shared an okonomiyaki -- soo gooood! It has more cabbage:pancake ratio, btw. You have to try this place! Especially for brunch! Can't wait to come back and would love to try their dinner.", "author": "Janet H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Much better than Rintaro.  The food here actually tastes like real Japanese food.  Not cheap.  Definitely special occasion only.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "Came for Japanese breakfast on the weekend or what they called \"brunch\" presumably to set expectation that they don't serve this every day and not until 10am.\n\nThey upsold us to get an a la carte order on top of the set breakfast saying they think it's necessary (though if it's true why even have a set menu that won't fill you?). Turns out it was too much food with 2 sets and a lobster rice a la carte for 2 people.\n\nLobster gohan rice (3.5/5) - it was flavorful but rather mushy. Could have benefited from having some of the rice be crispy. Nice contrasting bitter vegetables included\n\nMiyabi set (4/5) - pretty filling for a morning meal. The tofu is similar to what you'd find in Kyoto for fresh tofu so I was impressed. The smoked salmon is also prepared very traditionally and not your typical western fish preparation. I did wish the fried anchovies were saltier. The plating is beautiful and the starter salad and miso soup were well prepared. The Japanese pickles were legit too\n\nNagomi (4/5) - even though its vegetarian it's filling cause the deep fried yam is a huge portion. Pretty tasty for vegetarian \n\nI'd come back for Japanese breakfast since it was a pretty legit execution and really only game in town as far as I know.", "author": "Victor W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-10", "description": "I was here twice, and because I forgot to review this place, I accidentally came back. I was looking for a place to eat sushi for lunch with my sushi loving friend and Okane was still in my bookmarks so we ate here today. \nTo be honest, I was expecting a less expensive version of Omakase, but I left underwhelmed and did not like it that much. It was just OK for me but I wouldn't take an Uber here next time.", "author": "Anelya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "Made a reservation for two people for lunch.\n\nI got the sushi lunch set (comes with nigiri, roll, tamago and miso soup) as well as tempura vegetables. My friend got the mushroom appetizer and the shimofuri tuna.\n\nEverything was beautifully platted!\nThe tempura vegetables were tasty although the sauce was a little bit too salty.\nFor the nigiri, some fish were really tender and soft but others felt dry. The roll was simply tuna, too plain for me.\nMy friend loved her dishes and it was enough food for us.\n\nService was fast and nice!", "author": "Coralie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-01", "description": "What a cute little restaurant right down the street from my brother's place! The family and I decided to go for a early lunch on a weekday (we were a little sad they only had their brunch option on the weekend) and we were the first ones there. It is a small place with a prominently displayed sushi bar. I loved the brightly colored artwork and the patterned light shades- sometimes the small details make a place just pop.\n\nThe servers were polite and brought water right away. The only thing I would ding them for was not bringing all of our food out at the same time. There was a few minutes of lag time between each entree. But the food was really beautifully plated and tasty! We ordered two of the sushi lunch sets, the salmon teriyaki bento, and a udon bowl. \n\nThe bento box was so pretty! Two pieces of teriyaki glazed salmon nestled next to a mound of salad that was topped by crunchy tiny unidentifiable white balls. A small serving of rice was dusted with some seaweed in it's own compartment. In the last compartment was a small pile of pickles. It also came with miso soup, which arrived earlier than the main bento box. \n\nThe nabeyaki udon is the one with shrimp tempura, chicken, wakame, green onion, and fish cake. It arrives in a very hot, covered pot that the server lifts up with a flourish and a warning about the hot pot. The only downside to the covered pot is that the tempura is soggy before it even arrives. However, the bowl was good and filling, with lots of chicken. \n\nThe sushi lunch set is comprised of 5 nigiri, 1 roll, 1 tamago, and miso soup. The sushi is chef's choice but they can work with you to customize it to your liking as well. The sushi rice seems already seasoned with soy sauce- it is a mixed brown and white color. It made the tuna(?) roll look a little muddled. The nigiri were fresh with generous slices of fish- we had salmon, tuna, and a few others that I couldn't identify on sight.\n\nA great place for a sushi lunch. It seemed other people agreed beacuse they were trickling in around lunchtime and the place was half-full when we left. They also had several carryout orders. I bet the weekend brunch is wonderful as well!", "author": "Sally C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-29", "description": "Food was great, but portions were small and pricy. Would recommend their sushi rolls, cod, grilled mushrooms and of course, uni! We ordered:\n\n-Chef's sashimi: 8 pieces of fresh fish - nothing extra special here.\n-Daikon salad: small bunch of mixed greens with a couple pickled cucumbers and daikon. Tasted okay...not worth the price.\n-4 pieces of UNI NIGIRI: your typical hokkaido uni, which was melt in your mouth good and super creamy! \n-Agedashi tofu: came with 4 pieces of tofu and a couple fried vegetables. Breading on the tofu was not too thick nor too thin\n-COD: buttery and super good, but two small pieces of fish. despite the small portions, I still highly recommend!\n-rolls: well made and really delicious! \n-beef skewers: recommend the chicken ones actually. the beef was a bit hard to chew and not very tender\n-chicken skewers: juicy with a really great sauce!\n-grilled mushrooms: surprisingly really delicious! the yuzu gave the mushrooms just the perfect amount of tanginess. one of my favs of the night!\n\nNot sure if I'd come back again given the portions and the price. I'll keep trying other japanese restaurants in sf and will see how they fare with okane (portion size vs. price)", "author": "Cynthia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-23", "description": "I ordered omakase, which was the chef selected meal and paid around $80 per person. We only got some sushi (of which the wagyu beef sushi was the best.... although I was at a sushi place...), started off with some fish liver, got like 4 pieces of sashimi, and some sesame ice cream at the end.... Compared to the price I paid, I do not think that I got a good quality meal nor got a decent portion of food. We had to order beef sukiyaki at the end of the 2 hour meal to fill up our tummy...  If you want to have an enjoyable meal, I would recommend ordering dishes from the menu instead of choosing omakase. The atmosphere was nice though.", "author": "Jane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "We came here with a group of 8 to celebrate a birthday. I made a reservation online for 5, but they were able to accommodate our large group luckily. It's a pretty small restaurant so I would recommend you to not risk this like I did if you plan on coming with a lot of people. Given we were seated at their largest table, they really could not go beyond 8 without splitting tables. \n\nThe menu was interestingly displayed. It's not the easiest menu to read and we weren't sure how to gauge the portion sizes. I think this restaurant is mostly known for their sushi since they're sister restaurants to omakase. \n\nThe rolls are all decently good. Fish is pretty fresh. I ordered the chicken skewers, and would definitely not recommend you order them. It's $13+ for 2 skewers of chicken + 1 skewer of some chicken ball. I thought the chicken was quite dry and not worth it for the high price tag.", "author": "Annie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "Surprisingly, I prefer Okane over Omakase next door. We sat at the bar in front of the chef, who was super busy, but still managed to talk to us about the dishes he was making.  We ordered the shimofuri hamachi, shinjuku roll, and the chef's choice sashimi. The fish was SO fresh and smooth and buttery. Even though there are only 8 pieces in the chef's choice sashimi, they were 8 fat pieces. The shinjuku roll was a great combination between crab and wagyu-- something I've never tried before. \n\nEven though the food was excellent, the service was kind of lacking. I asked for water three times and never had my glass refilled. Our waitress basically took our order and spent the rest of the meal chatting to other staff and didn't come back till she brought out check. \n\nThis place gets super busy so try to get reservations beforehand and specifically request seats at the bar.", "author": "Chanel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-09", "description": "They greet you at the door and the sushi bar is right near the entrance.  Sizable restaurant with a bit of quaintness. \n\nSukiyaki is to be ordered if the weather outside is cold! They have uni from Hokkaido and local. I got the local for the freshness. Toro belly nigiri was yummy!  Chawan Mushi was a nice, warm intake to the palate.  Roppongi is a healthy option with no rice wrapped around the roll and sashimi in between. Cucumber is the wrap and they display it very prettily. \n\nSake was pleasant and heated the body up from the chilly weather. \n\nSolid selections of tidbits on izakaya dishes, sashimi, sushi rolls, noodle soups and skewers.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "This spot was legit. Everything was really fresh and just tasted like the ocean. Not gonna lie the prices are pretty high here but the quality is there. I had the uni here and I was super blown away tasted just like Japan. I also had some really good cold sake here that is smooth as well, along with their Japanese Lager. I can't wait to come back to the bay and dine here again.", "author": "Danny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-21", "description": "Decided to try this place spontaneously since it's near our office. The sake selection was great. However, seemed like everything here was served in these clay pots. The tofu dish and the beef sukiyaki were too similar. I was really looking forward to the beef sukiyaki but it was way over cooked. The beef was chewy. The Steamed Oysters and Asari clams were very delicious, I drank some of the broth too. I'll probably come back for more special occasion type but this would not replace our weekly go to places.", "author": "Anyta L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "Delicious sushi. 6 oysters with topping (uni, I Kira Quill egg) is so good. We also had 2 signatures both were good.", "author": "Natalee R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-29", "description": "Just left this restaurant because 3 waitress walked past me as I waited to be seated for ten minutes.  I was finally able to get ones attention asked if I could sit at the bar she said wait a minute and about another 5 minutes later I just left.  Not sure if my skin color was a factor or what but have never been ignored to the point that it made me feel uncomfortable and  unwanted.  I have heard great things about this place.  Next time if there is a next time I will make sure to come with my white friends.", "author": "Natalie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-25", "description": "Food was pretty good! The sesame-mayo sauce for the spinach appetizer was creamy and sweet. The karage wings were zesty and peppery. The salmon tartare and the ginza roll were both easy to eat and clean-tasting. \n\nAll of this food shared between me and my friend was around $55 not including tip.\n\nOne downside: the waiter forgot our salmon skin handroll, but I understand since the restaurant was packed and looked understaffed. I'm thankful my friend was able to reserve this place via OpenTable.", "author": "Jenn H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-22", "description": "I am pretty disappointed on the Oyako Don and Beef Sukiyaki. The egg is overcooked while the beef is undercook. The beef is sticked together that I'm pretty sure it is cookedb while frozen.\nJust don't expect too much.", "author": "Jianhao L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-10", "description": "Been here twice for dinner, and gotta say it's a solid Japanese spot. Sushi was fresh and good balance of the fish to rice. They had some nice variety in the specialty roles too Shibuya and Kapabashi (great for group sharing). I did try the popular lotus chips, solid choice as one of the starters. The Otama udon was allright, but usually there are specific restaurants in SF known for a good Udon bowl, notably focusing on the broth.\n\nDrinks, only had the japanese beer on tap, I think they had one that was a specialty japanese craft beer that my friends tried and said was super tasty. Seating has always been ample here, but there are those friday/satruday nights that can get packed. They do take opentable resys too. I'm a fan of this place!", "author": "Howard J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-24", "description": "I'm really really quite disappointed.... I rarely give less than 3 star review unless it's a horrible experience. \n\nMy cousin and her boyfriend from Switzerland were in town to visit me. I wanted to impress them with amazing Japanese cuisine! But Okane really ruined their experience :( \n\n1) We walked in hungry and the server didn't try to even look at me and greet. I felt very unwelcoming.... \n\n2) We ordered food. Sushi rolls and two bento boxes. The rolls were small and expensive, except I love the A5 Wagyu roll.. hmm! \n\n3) The rolls came already. We were still waiting for my cousin's chicken teriyaki bento box... after 20 minutes.. still not ready and we already finished our 3 sushi rolls we ordered.. Wtheck?\n\n4) About 30 minutes total, the server gave him the bento box with CHICKEN KARAAGE. Are you serious?? \n\n5) Another 5-10 minutes, they finally gave him the correct order...... late. \n\n6) They charge for tea at $4 each. Thanks SF \n\nNot sure if I'll come back here again... I spent over $120 and was hoping they would waive one of the bento boxes but they didn't.", "author": "Jan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "Okane is definitely my favorite Japanese place to go for good sake and delicious sushi! I usually take my friends from Japan to this place when they visit me. Servers and sushi chefs are very friendly so you should ask them for recommendations and stuff! \nMy favorites are\n-Wagyu nigiri\n-live uni\n-grilled Alaskan cod\n-Ankimo \n-Hokkaido uni nigiri\n-Ginza roll \nDefinitely worth trying!!", "author": "Chika O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "One of the better sushi places in SF! You walk into a pretty small restaurant so the atmosphere is probably better suited for date night or catching up with an old  friend. The itamaes stand at the bar and create masterpieces, I highly recommend paying attention to them when you go as they put a lot of work into what they do. As for the food, the nigiri and sashimi are so fresh!! The restaurant shares the same fish as their sister restaurant omakase (very high end and right next door) so you're kind of getting the best of both worlds. The seasame ice is also really good, very different though. All in all, you won't find your typical American sushi rolls here but you will find much more authentic and fresh cuisine. 100% recommend!", "author": "Kendra W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-21", "description": "This review is for brunch, and reflects the menu offered on the weekends, rather than the sushi offerings which I have heard are awesome. Okane offers four set brunch meals, one of which is vegetarian.  What I did not understand was why we could not mix and match the small items that comprise of a particular meal, but rather certain items were only served with certain others, and there was no way to try an individual small item without ordering a particular set meal.  I enjoyed the Miyabi meal I tried but there were other dishes in other set meals I might have liked better than some of the dishes I had. This may be my relative cultural ignorance about Japanese breakfast food, but I couldn't help voice this American impulse to simply get exactly what I want. \n\nCan't wait to try the sushi, once I find the right company!", "author": "Archana P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "This place is great! Amazing food, great ambiance, and even better sake. I would def. recommend coming here as we were tired of the same old sushi spots in our area. \n\nThank you for making me a happy Jew!", "author": "David F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-07", "description": "The fish was good quality but I cant help but think it's extremely over priced. \nThe service is also slow.  I sat there waiting a good 10-15 minutes before having to get up myself and hand them the bill.  I understand chatting up customers is nice but please make sure you don't waste other patrons time.", "author": "Jane T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-11", "description": "It's a neighborhood restaurant style, not many fancy things going on, but from the recipe to the quality, it is at the high level.", "author": "Faye L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "This place is the best! The food was ridiculously good. The oysters were bomb!!! and you must add the egg and uni!! The oyster was fresh and the egg and uni added a slight sweet flavor to the freshness.. IT WAS SO GOOOOD! I will definitely come back and recommend this place to my friends. \n\nQuick tip: it is best to make a reservation beforehand. We went without one and sat at the communal table, which was not a problem because the food was soo gooood!!", "author": "Ada S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "Came here on a Friday night.  It's a small place, with not that many tables so it's a good idea to make reservations.  We thankfully were able to get reservations that afternoon.\n\nThe cooked food was good.  My favorites were the \n* Chicken Mixed Skewers (the green onions on the chicken thigh were divine!) and the salad it comes with is super refreshing.  Hubby doesn't usually love greens, but he loved this one -- nice and refreshing with yuzu and slight sweetness (not too sweet).  \n* Shizo Salmon onigiri (riceball) -- the rice is toasted on the outside so it's crunchy and has a great toasty smell!  so delicious!\n\nWe also enjoyed:\n* Chicken Karaage -- juicy and flavorful\n* Egg udon -- the broth is really nice!\n* Sake Cod -- really amazing when had with the pickles & greens served, but portion is small\n\nI found the sushi to be meh.  Pretty middle of the road.  We'll definitely be back for the cooked food!", "author": "Kathryn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "Oh Okane, \n\nThank you very much!!! ^_^\nどうもありがとうございました\n\nMy authentic Izakaya experience was phenomenal.\n\nReservations were a breeze. I was treated as if royalty stepped foot into a grandiose royal palace. Exquisitely Superb! I would like to express my many thanks to the awesome, humble Japanese American Chef...who prefers to remain unnamed. :-P ... Perhaps, one day he'll accept written recognition!! I was very impressed by the skillful craft of each item along with beautifully precise presentation! \n\nStaff was on point too to my every request! Adrian was very helpful & informative through out. And a pretty girl served items keenly. Music was trendy.\n\n~ Cucumber and Daikon Salad. Refreshingly pickled and crunchy.\n\n~ Jidori Egg Chawanmushi. \nI loved this so much! Soooooo flavorful and delicate texture. This includes shrimp and bok choy plus a hard item at the bottom. It is served along with a wooden spoon and my chawanmushi was very warm. That was nice. I would definitely want this again.\n\n~ Shimofuri Hamachi and Jalapeño Pepper. \nNo comment other than nicely plated. It is served with olive oil yuzu shoyu.\n\n~ Shinjuku. \nYes yes yes! This specialty roll is snow crab and avocado topped with torched A5 wagyu beef. Awesome. I like flames on my beef. So cool. This is my other favorite. Also, I loved the dipping soy sauce small dish that accompanied as well. It was so pretty! *hearts*\n\n~ Toriteba Karaage.\nThese chicken wings are irresistibly tasty! The memories were an explosion of epic proportions for my taste buds. So good! Is it from the shiso salt? I savored every bite before remembering the spicy mayo. \n\n~ Smoked tofu & tomato.\nThis was my special surprise adorned with tiny flower petal. I was told that this item is from Michelin One Star Omakase. I felt so special. Thank you!!! First time ever having tiny orange flower petals to dine upon, and the tomato was very soft and light with tofu invisible to the eye. I appreciate the time and skillfulness.\n\n~ Wakadori chicken karage.\nNice crunch and big pieces of chicken. \n\n~ Roppongi.\nNo comment. This is a specialty roll which consists of magruro, hamachi, snow crab, salmon, and avocado that is wrapped with cucumber. Nice presentation.\n\n~ Sake Black Cod & Sake Salmon. Salad in the center.\nNicely grilled and delicious.\n\nI didn't have time for dessert so maybe next time I hope to enjoy Mr. Japanese American Chef's homemade mochi and sesame ice cream!", "author": "Andrea S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Stumbled upon this great find by yelping it.\nLoved the Saba karaage, chicken karaage, egg custard dish.  My team loved their bento boxes.\n\nThis place is excellent quality and Michelin guide!\nPrice was reasonable but taste and quality was up there.\n\nI love great finds like this.  Authentic Japanese run chefs with great value for high quality fare.\n\nI'm returning!", "author": "Mary Ann K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "This is by far my favorite Japanese restaurant in San Francisco.  \n\nThe wait staff are friendly, the environment is cozy, and most imporantly, the food is of the highest quality.  \n\nItems I recommend:\n- thinly sliced lotus root chips + wasabi dip (excellent appetizer for the table)\n1/2 dozen oysters (I recommend the uni + roe + quail egg $10 upgrade to add a unique kick to your otherwise already fresh oysters)\n- Roppongi roll (this roll is mixed sashimi wrapped in cucumber - very refreshing & no carbs!)\n\nThank you Okane, for always an excellent dining experience!  I will be returning again, soon.", "author": "Colette C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-14", "description": "ehh, not super impressed by okane. actually quite disappointed.. i dined at omakase maybe 1.5 years ago and was also not super impressed, so maybe its just this family of restaurants.  came here for girls night and to celebrate a birthday on a monday - the restaurant was pretty dead - half full, but it took a while for our food to arrive though our order was pretty straightforward.\n\nwe got a special - chu toro tataki, and that was probably the best thing. other items included: karaage chicken (wayyy overfried), the miso cod, chawanmushi, and 2 rolls. the rolls were probably the last impressive of the whole bunch - thoroughly lacking in flavor and fell apart easily, although i didnt even try the steamed egg.  we dont drink on girls nights anymore, so dinner for 4 plus tax and tip was $120 - not terrible, but also not great.\n\nanyway - i would maybe give okane another shot in terms of the nigiri items, but other than that, no thanks..", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-11", "description": "This is a nice Japanese restaurant. I had unagi donburi. Was okay. Nothing special- the bento boxes looked like a better deal for $14 than the donburi ($15). But overall I can recommend this place. Nice Cosy joint.", "author": "Anuran C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "Came here on a Saturday night at 8pm with no reservations and was able to get seated immediately. I really enjoyed the ambiance of Okane - everything is very clean and modern and the dim lighting gave it a very cozy romantic vibe. \n\nWe ordered:\n- Okane handrolls\n- Nigiri: Amaebi, tomago, ankimo, toro\n- Agedashi tofu\n\nAll of the sashimi here was really fresh, especially the amaebi and toro. The okane handroll was just okay - I liked the uni it was topped with but the salmon skin was a tad too much. It would have been much better with fresh salmon instead.\n\nService here was really good, the waiters were very attentive and professional. \n\nOverall I thought Okane was a very pleasant dining experience with good food and drinks. Great spot for a casual low-key dinner.", "author": "Angela K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-14", "description": "I feel like this place is the epitome of SF dining. Beautiful, expensive, a bunch of hip articles written about it to generate hype. And not particularly delicious.\n\nWe made reservations for brunch on Saturday at 11. There were already a bunch of people in the quiet, spacious restaurant. We tried the pork set and the veggie set menu, plus the abalone congee. To be honest, I'm pretty sure my favorite thing was the abalone porridge, or the veggie tempura. But it's hard to get rice and fried vegetables wrong. The items in the set menu plates were all just so-so. The pork belly was tough, the egg was straight-out-of-the-fridge cold, the chicken soup had no depth (and the chicken was tough too).\n\nWould not come back, would not recommend. A plethora of tasty alternates in SF.", "author": "Jenn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "Was in San Francisco for two days and craved some last minute Sushi. This place was open for lunch on Sunday so I decided to pop in. The rolls were 5 Star fantastic. I got both of their Salmon rolls, one topped with unagi and the other topped with tuna. The unagi was so perfectly cooked it quite literally melted in your mouth.\n\nI would give this place five stars except for the completely overpriced let down of of the chef's seasonal selection of the shashimi. 30 dollars, 8 pieces, I thought I was about to get the best shashimi of my life at that price point. The salmon sashimi was very good but the other three fish selections were no where near what I would expect to get at that price point and on such a premiere menu item.\n\nSave yourself the money, only get the rolls. You'll have a five star experience", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-20", "description": "Food is 3.5 stars.\n\nService 1.5 stars. \n\nPrices are $23 for a sushi roll and one miso soup.\n\nAmbiance is 3 stars.\n\n55 minutes from sitting to getting food!  \n\nSummary: over priced typical Soma joint!", "author": "Mark K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-28", "description": "A and I went for brunch this weekend and had our expectations met. I made a reservation for 10AM (opening time) assuming we would need it because its SF and you need reservations everywhere but we were the only people in the restaurant through the end of our meal. This was surprising since Okane is buzzy as the more casual little brother of Omakase but I guess its in an odd part of town.\n\nAnyways, we arrived on time and were sat promptly. The hostess explained the menu to us including the 4 set meals as well as the a la carte options which was thoughtful service. I decided on the Megumi set ($25) since it included sushi and A had the Miyabi set ($22). Keep in mind, the prices are $2 higher in the restaurant than online. We did not have anything to drink but water though their Sake list seems legit so if we come back for dinner, maybe we will check that out. While we were waiting for our food, we noticed how beautiful and simple Okane is. It seems very modern with a ton of natural light from the windows. Everything down to the chopsticks (which were the most natural-feeling ones we have ever used) seems well thought-out. Note that Okane shares bathrooms with Omakase next door and that the bathrooms are, befitting of a Michelin Star restaurant, beautiful and smell AMAZING. Weird observation for a bathroom, I know, but I really want to know what air freshener they use because I need it in my apartment like now.\n\nOur food arrived so I stopped pondering the restaurant and took my obligatory Yelp pictures. We were started out with Miso Soup, Salad and Pickles which were as expected and then our sets arrived. Both of the sets were plated BEAUTIFULLY and are instagram-ready. Our waiter explained each dish to us and we got to work! I won't go into details about each dish in each set but everything was good, nothing spectacular. I would say my main disappointing options in the Megumi set were the Temarizushi (Sushi Spheres) and the Onsen Tamago (eggs in hollandaise). The sushi tasted gritty to me and had an odd flavor. The Tamago I couldn't figure out how to eat. From A's Miyabi set, I think the Smoked Salmon wasn't great. Most of the other items both sets were decent. The amount of food was perfect since we were full but not stuffed.\n\nI was a bit disappointed as I have wanted to come to Okane for a while but from what I understand, brunch is a newer offering so they may still have some kinks to work out. I definitely want to come back for dinner before passing final judgement but I think for the price, brunch was underwhelming.", "author": "Carrie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "Came by for lunch the other day while working down in the SOMA area. \n\nStarted off with the Chicken Karaage bento box that the owner suggested and it was okay. Chicken was on the saltier side, a tad over-fried, and not super duper fresh. It was good. The side salad was light and decent. The miso soup was okay, a tad salty. The side of spinach, fish cake, and grilled salmon were excellent! ...reminds me of my time visiting Tokyo! :)\n\nAs the bento box was merely a large snack, decided to complement the lunch with the Shinjuku roll which was excellent. (All the rolls are Subway stops in Tokyo?!?) The Shinjuku roll had real snow crab topped with A5 Wagyu Beef which was excellent and the highlight of the meal! I'm super glad that I ordered this! The roll was merely a light snack!\n\nService was very friendly and cordial by the staff. \n\nIt seems like despite trying their best to be a traditional Japanese restaurant, they have some Americanized influence here.\n\n~$49/head after tax and tip for lunch.", "author": "Derek S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "We have been here a few times, and each time we enjoyed the food and service. \n\nThe sashimi dishes were delicate and fresh. I never get full on just sashimi, so I am glad to see a variety of small eats on the menu. \n\nThe fried chicken is a must. and the tea rice bowls are just enough to satisfy. \n\nLove this addition to the neighborhood!", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-05", "description": "I still haven't been to the fancier Omakase next door, but one recent evening after work, I ventured toward this otherwise desolate area of SoMa to give its casual cousin a try. If you've ever been to this part of Townsend after 6PM, it's a bit of a ghost town except for a few locals carrying home their groceries from Trader Joe's nearby. The dimly lit Okane had maybe two other customers when I asked for a table and immediately perused the surprisingly comprehensive menu full of izakaya-style small plates. There were two sushi chefs ready for business at the counter, but business continued to be pretty slow that evening (photo: http://bit.ly/1OgrWXq).\n\nI decided to try one of their specialty rolls, the $15 Roppongi, which decoratively combined maguro, hamaichi, snow crab, salmon, and avocado into a filling wrapped by thinly sliced cucumber in a coil-like fashion (photo: http://bit.ly/1YcaWqM). I thought it was going to be like a rainbow roll, but it actually turned out to be a healthier variation since there was no rice. It tasted so fresh I didn't miss it, and it was complimented by generous slices of fresh ginger (photo: http://bit.ly/1QTEZOi). I decided to follow this up with the $8 Jidori Egg Chawanmushi, a custardy home-style favorite that they gussied up with fresh shrimp and sauteed bok choy (photo: http://bit.ly/1rxDdxz).\n\nIt was quite tasty since it reminded me of what my mom used to make if I was a very good boy. I finished off my meal with the $12 Assorted Chicken Skewers, which was actually two skewers of chicken thigh pieces alternating with green onion accompanied by a tsukune meatball, all of it marinated with yuzu kosho (photo: http://bit.ly/1rZgo6G). It was tender and meaty, perfect bar bites. Truth be told, I could have ordered another plate of something, but I was going north of $40 when I had the intention of being a bit more budget conscious. I liked it though and will bring Jamie W. with me next time, so we could try even more dishes.\n\nFOOD - 4 stars...creative, fresh takes on familiar Japanese small plates\nAMBIANCE - 3.5 stars...dark with a local Tokyo neighborhood vibe, casual but not too casual\nSERVICE - 3.5 stars...kind enough\nTOTAL - 4 stars...an oddly placed izakaya but close enough to me so I'll take it", "author": "Ed U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-28", "description": "I caught up with a South Bay friend on a Friday evening. He doesn't quite appreciate how difficult it is to get a table in SF and I tried to find the best option available for prime dinner time at the last minute. Okane is what I came up with.\n\nEven though the time we wanted was not available on OpenTable, the hostess was very kind to accommodate us when I asked nicely over the phone. We arrived at 7:30 and were seated at a cute two-top near the entrance. \n\nThe menu is more izakaya style but also has a decent selection of sushi and sashimi. We shared 3 items for dinner: Beef Sukiyaki, Salmon sashimi, and Ginza Roll (shrimp tempura, avocado, cucumber, topped with torched hamachi, jalapeno, blue fin tuna). I was pleasantly surprised that it ended up being enough food for two hungry people.\n\nThe sukiyaki seemed highly recommended by some Yelpers but it was truly a disappointment. I do not think I'm a sukiyaki expert by any means but I do love this dish. The beef and overall flavor of the broth was good; however, I did not like the seaweed and the noodles were terribly soft and broken.\n\nThe Ginza Roll and Salmon sashimi were good; I've had better at the same or lower price point (Elephant Sushi anyone?).\n\nOne of the awesome things about Okane is that there is ample free (after 6) street parking in the neighborhood, which is such a luxury in SF. This is a solid Japanese option in SOMA.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-16", "description": "Okane is the izakaya/sushi sister restaurant to Michelin-starred Omakase. I went to Omakase during its first month of opening and loved it, but I immediately realized it wasn't a place to frequent other than for special occasions.\n\nTherefore, I was more than excited for Okane to open. I dined here back in February and was very impressed with their Agedashi Tofu - it was super gooey, melt-in-your-mouth, with a light ponzu sauce. Other favorites included Hokkaido Uni ($15/per pair) and the Shinjuku Roll ($25) - topped with A5 Wagyu for 7 pieces.\n\nTonight, we dined here again since we were in the neighborhood and were reminiscing their amazing tofu. We ordered it again and while it was good, it wasn't as gooey and mind-blowing as the last time. We made a note to the staff and they were so kind and immediately took it off our tab, asking what made it better last time. I can certainly appreciate when the staff takes the time to take your comments and thoughts into consideration.\n\nWe again had the Shinkuku roll and it was as good as last time, if not better. We also opted for some misc nigiri such as the Domestic Uni ($10/pair), Ikura, Sake, and Kanpachi. The domestic Uni from Maine was no comparison to the Hokkaido. Very medicore and less flavorful and creamy than Hokkaido's. The udon was pretty standard- I would've liked a few slices of meat, even if the entree cost a few dollars more. Just udon with soup and an egg is pretty bland.\n\nService is solid - the staff all share duties and frequently come to check on you and refill your drinks, never really going unattended.\n\nOverall I like Okane for a casual night out or for craving any sort of Japanese dish- they really have a pretty good variety of foods on their menu, from noodles and rice dishes to nigiri/sushi and cooked dishes.\n\nThe ambiance is inviting but spacious and pretty casual. This spot in SOMA is especially parking-friendly (metered/street as well as a lot next door).", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "Cute, uncrowded spot on a Friday night. Great for dates! \n\nOrdered the kara-age, yudofu (the portion is \"yuuuuge\"), udon w/egg, and salmon aburi. Be warned that the salmon aburi is like, 4 tiny pieces of sashimi with a tiny slice of avocado with each. \n\nIt's best to try this place tapas style and order a bunch of small plates to share. The food and service is great, definitely a solid place for non-crazy expensive Japanese food!", "author": "Susan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "Not bad...I like the name! Took me a second to locate this place. Turns out it's right next door to Omakase, which I luv. Sharing the same restrooms. \nOkane Is different, walk in and it's immediately the chef section. Tables are on the left. We ordered lots of nigiri, ankimo, sushi rolls, scallops and sashimi plate. Loads of uni, 4 orders to be exact(it's a small portion). Ran out of oysters so we couldn't do shooters ={ ordered unfiltered sake and 2 bottles of wine. Turns out we know one of the chef next door, so he gave us some yummy sake to try (gold dragon!!!) it's a fun place, young servers who are very attentive.", "author": "Vee V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-23", "description": "I got to go from this place. I ordered the Shinjuku roll, but it looked nothing like the pics people posted. My \"torched\" A5 wagyu beef looked overcooked. My Uni from Hokkaido was just so so. Look at photos for reference.", "author": "Kosmo Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "Absolutely love Okane! The people are great, the food is so fresh, and the atmosphere is intimate. Definitely the best place to eat in the neighborhood.", "author": "Aleksandra G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-03", "description": "Food was good but not exceptional.  Service was the worst. The waitresses kept coming to clear our plates even when we were not ready and rushing us to finish dishes which were not empty. We couldn't even eat slowly to enjoy our meal. With a party of 5, 20% was included.", "author": "K L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "One of my favorite spot in sf. So lucky that this place is right cross street my place. My everyday go to! The beef sukiyaki is a must try, all the indigents are very fresh. Spanish wiz sesame sauce is also my favorite. Rolls are all very delicious, not like the cheap Americanized kind.", "author": "Yuhan Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-06", "description": "I had a string of eating at subpar to average sushi restaurants in SF and was really starting to get discouraged. Thank goodness for Okane! \n\nI hear Okane has the same fish supplier as the supposedly fancier Omekase next door(I have them bookmarked but haven't been yet) and the fish is super fresh and awesome.\n\nLive Uni had a rich, sweet yet briny flavor and soft buttery melt in your mouth texture.\n\nGinza roll and Akihabara roll were both tasty, both had a generous portion of fish and were full of flavor. I hate when sushi rolls all taste nondescript and similar and this was not the case at Okane.\n\nChicken karaage was decent. I wish the chicken pieces were cut up a little smaller because it's hard to eat a giant piece of fried chicken while trying to not burn your mouth and strew fried chicken bits everywhere. I also wish it came with some sort of creamy/spicy dipping sauce to cut some of the dryness.", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "It's a small restaurant near Mission Bay. It has some bar seating but I would definitely recommend making a reservation to ensure you have a spot when you arrive. The service is reliable and for the most part attentive. \n\nCame here for Sunday brunch where they were serving \"breakfast sets\" for meals. My friend and I ordered the Miyabi and Megumi sets. The \"buta kakuni\" (stewed pork belly) could have been a bit softer. All in all, the presentation was nice and the food itself stands apart in quality and taste.\n\nIf you are looking for a similar lunch set place, there is YAYOI in Palo Alto if you happen to be in South Bay.", "author": "Lester U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Fantastic quality. Fantastic service. Go.\n\nThey share the same hot kitchen as Omakase. The Shinjuku roll is so tasty. They have Fresh Uni but it's not on the menu; also, not always available. Fresh fish shipment comes in on Tuesdays and Thursdays. Make sure to call and ask them to reserve some for you. The Saba Karage is also done beautifully. \n\nI'd definitely give this place a shot. Great service, great quality, and fantastic execution.", "author": "Marlene T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-06", "description": "Which of y'all snitches told 'em I was coming? How'd they have Parliament, Tupac x K-Ci x JoJo, Lauryn Hill, Big Pun, AND Humpty Dance(!) cued up the moment I walked in? But they didn't play 8 Ball & MJG; I might've had to go full whitechick* dancing on top of the bar #makinitrain napkins everywhere.\n\nDeece scottie ippin dishes with a few novelty items unfound at other izakayas. Classyish-yet-casualish atmos but NOT for purists / traditionalists bc music. Dope af jams though.\n\n(-_^) Wakadori Chicken Karaage $9\nDat surprisingly nice side salad doe.\n\n(-_^) Spinach W Sesame Mousse $7\n\"Strong to the finich cause I eats me spinach.\"\n\n(-_^) Anago Tempura $18\nUnique but tastes kinda #basic.\n\n(-_-) Shimofuri Shiromi (Parmesan Sashimi) $22\nNot as weird as I'd hoped.\n\nI'd return if I was nearby, but I wouldn't seek this place out... unless I had my #dancingmachine shoes on! #holla\n\n*You never go full whitechick. ;p", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "Came for a early dinner on a Friday with no reservations and was able to get a table right away. Place is smallish but still a lot of table options if you are a group of two. The place is sleekly decorated but not overly done. There is a small bar counter where the chef is preparing the dishes. \nThe menu is a little overwhelming with so many options of veggies, beef, fishes, sushi, noodle rice dishes. Luckily we had a great staff that helped us settle some dishes. We went with the delicious live uni (special of the day),yu dofu a clay pot, beef sukiyaki, roppongi roll, nori chazuki, and aji tataki. \nThe live uni was obviously fresh and so delicious, and impeccable plate display. The tofu in clay pot was pretty plain and healthy served with kelp and seaweed - nothing special just plain with some side sauce. The beef sukiyaki was amazing and so flavorful - a bit on the salty side but in all the right ways. Roppongi roll was great because it has cucumber instead of rice rolled around the fish so it was a nice alternative. The nori chazuki was rice with soup - it was good and hearty for such a cold night. The Aji tataki stole the show. They took an entire little aji fish, gave us the meat as the sashimi, then deep fried the skeleton for us to eat the end.  It was so amazing! Deep fried aji bones for the win. It was so crisp and flavorful, we ate the whole thing including the head which we weren't sure if we were supposed to keep eating but we did it anyway. I love the zero waste involved. \nGreat spot and I'd def recommend it.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-18", "description": "It's Japanese diner style food. But given this is America, you can get all sorts of izakaya in one shot. It is not as good as that underground spot in Time Square theatre district (Sake Bar Hagi), but this being San Francisco, it's good, very good in fact.\n\nA perfect spot to take your little ones. They have a good reservation system. You can get in and out easily. The children were tired so it's nice to be seated ahead of the reservation time by 20 minutes. Strength is their sashimi, and misc. bar food that mix well together. Monkfish liver is very fresh. Nigiri is on the spot tender and soft and fresh. Rolls are well done. Sukiyaki is light and airy, perfect for sharing. Grilled cod is rich and flavorful and is as good as you can get on this side of the coast. Chawamushi was bland and watery, worse than I could have made at home, so I'd skip that and go to Ame (the Michelin star restaurant in SoMa) for that (it's really the best of the best, even better than Yuzuki so no need to get it here). Salad is a bit too salty and soggy.\n\nKarage and chicken skewers are quite a hit among the children. Which is to say, this is not a great place for adults who want a fancy Japanese meal but it's excellent if you want to drink a beer and watch the children go crazy. \n\nI really would have wished for it to be higher end, only because a real exciting izakaya place ought to offer something you just can't get anywhere else. I think it's very good for what it is. It's marked a return place when you need to be gentle to your wallet and you want to go eat quickly and then leave. So this is where the star rating is aligned with the quality of the food and not aligned with its affordability (which is a solid 4) and convenience (which is a 5). \n\nAll things considered, not a date place, a great family (Japanese) diner with popular food items. Inexpensive, with ample parking, and a perfectly good place for friends to gather (won't break the bank).\n\nThe restaurant is very efficient. It is powered by a newly minted Michelin star restaurant next door. It's very well staffed. They treat children well. It's very affordable. It's got a huge variety. But for a great new restaurant to stand out and capture the audience, it needs some oompth (think Volta on Mission), or je ne sais quoi (think An Japanese in Japantown) . Sadly, Okane lacked both.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "Nothing gets me more excited than when a new restaurant opens up, especially a Japanese one. I could eat Japanese food all day, every day for the rest of my life...if I was rich. But, we all know that legit Japanese food doesn't come cheap. And by \"legit\", I mean the type that won't give you the Hershey squirts from all dat orange bukkake sauce. \n\nHow can I satiate my Japanese food craving while being mindful of my food expenditures? Go for lunch...specifically, weekday lunch. Lunch items tend to be less expensive and booze is out of the question when you have to return to work afterwards. Though I've been called a \"church girl\" at work (wtf?!) so maybe a couple of sake bombs will show them who I really am! *Muaahaaahaaa*\n\nMy co-worker and I went to Okane (same owner as Omakase next door) for lunch yesterday. Luckily, we came early and beat the lunch rush. They've only been opened for a couple of days and they were pretty packed by the time we left at 12:30 pm.  \n\nOkane is an izakaya restaurant (Japanese tapas). The menu is quite extensive - they have everything from agedashi tofu, chawanmushi, karaage, yakitori, tataki, sukiyaki, donburi, udon to sushi. Their lunch menu and dinner menu is pretty similar except that they don't offer the bento boxes at dinner. They also offer omakase at the sushi bar ($80?). Beer, sake, and wine only.\n\nWe started out with the Jidori Egg Chawanmushi ($8): http://bit.ly/1Pntwfs. The jidori egg gave the custard a brighter yellow hue than usual. Loved the silky and lush texture but it needed a touch of salt or soy for flavor. Although the shrimp tempura was perfectly crunchy and airy, I prefer the traditional steamed shrimp. The bok choy was an odd garnish and made one of the tempura pieces soggy.\n\nI ordered the Shokudo Bento Box w/ chicken karaage as my protein ($14): http://bit.ly/1OCsJUz. It was accompanied with a beautiful medley of other items: shiozake, marinated kelp, fishcake, tamago, japanese pickles, rice, and miso soup.\n\nThe miso soup was too salty for me so I just picked out the tofu and seaweed to eat but my co-worker enjoyed it. My barometer of a good Japanese restaurant is their rice. The short-grain rice was sticky and had a good chew (not mushy). For functionality purposes, I would have preferred the rice in a bowl. I'm a messy eater to begin with so it was hard to eat rice off a wooden board with chopsticks without flinging some into my hair. Told you, I'm messy af.\n\nThe chicken karaage was nicely crisp and tender but it was a little dry and I didn't taste much garlic and ginger flavor. Slurp Ramen in Chinatown has my favorite karaage to date. The other items refreshingly and subtly rounded out the meal. Save the tamago (sweet Japanese omelet) as a \"dessert\". Portions are appropriately Japanese sized. If you have a big appetite, you'll probably still be hungry after the bento box.\n\nService was cordial and prompt since we were the first customers. It slowed down as they got busier though. \n\nThe dining area is minimalistic and zen with wooden furnishings and a wall of Japanese noh masks. There's only one large high top for 8 people, so it's recommended to come in a party of 2-4 people. \n\nEasy street parking. \n\nSince we went to Okane for lunch and were being mindful of the bill, I didn't get to sample as much of the menu as I wanted to. What we had, however, was pretty solid and was approved by my Japanese co-worker. \n\nAn izakaya meal is not a true \"izakaya\" meal without sake and beer flowing so for round two, let's let our hair down and get a little ratchet - sake bomb time?", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-21", "description": "As the sister restaurant of Omakase, Okane is just as satisfying and a little cheaper.\n\nMy favorite by far was the Salmon Skin hand roll. With a scoop of Uni on top to complete the ikura and salmon skin crunch, this hand roll is the best version I've ever had. I almost wanted to order another.\n\nThe fish of course was just as fresh- my friend even ordered a second set of Uni just for herself . The udon (only $8) had a very savory yet not salty broth, which I appreciated.\n\nFor the end of the meal, I highly recommend getting the black sesame ice cream. So unique, wonderful flavor, and not overwhelmingly sweet. I plan on ordering that every visit!\n\nAll in all, on the pricier end still, but in terms of Japanese cuisine, Okane is worth every penny.", "author": "Kristi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "This place is a bit pricey, but the food is amazing! It had some very interesting options that I definitely recommend.\nYou won't regret getting the Vegetarian Bento Box and the Vegan Donburi in the lunch menu.\nThe fried Lotus Root Chips and Agedashi Tofu are some of the fried delights you could go for, in the dinner menu.\nThis is one of the best Japanese restaurants, I have been to, in San Francisco.", "author": "Karthik Vasishta R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "My friend and I were in the area and we're looking for a good lunch spot. Opened our trusty Yelp app and up popped Okane. We grabbed a couple of seats at the bar and chef Rico acknowledged us and took our order while recommending a few of his freshest fish picks of the day. We had hamachi toro, Kobe beef and the creamiest Hokkaido uni. All were great!\nOur server Cindy recommended a couple glasses of sake that paired well with our meal. We could've drank more but it was only lunch time ;( Service was awesome and the decor was clean and inviting.\n\nWe will be back.", "author": "Liz N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Loved this place! Every roll I tried was delicious and unique. Fish was fresh, ambiance was pleasant, and restaurant was very clean!", "author": "Mrs M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-18", "description": "I should have been suspicious, given the name of the restaurant: \"Money\". We had lunch at this restaurant on Father's Day. If you have ever been to Japan, don't waste your time eating here. The food is terrible and has little to do with Japan. The restaurant also made no mention of serving its more expensive dinner menu at lunch, and when we asked we were defensively told it was because it was Father's Day. To the restaurant, I guess that meant they wanted to use the opportunity to charge more. We would have been okay with it, had the food not been such a joke. Many of the ingredients were Chinese, that we would not normally see in Japan except maybe in Chinese restaurants. The waitresses, who were Japanese, seemed embarrassed to have come across people who seemed to know what they were (supposed to be) eating. Almost $200 for five people, no drinks, at lunch. Don't bother.", "author": "Craig F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Went here with my friend not too long ago and thought the food was pretty good. I'm allergic to seafood yet the service here was great in accommodating my food preferences! Shoutout to the waitress Laila who recommended non-seafood dishes for me to try! Would definitely come back again :)", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-13", "description": "Food and ambiance is a little on the flashy side, and overall food and experience was a little overpriced. Overall a decent place, but nothing that would draw me back.\n\nI read the reviews about this place being the sister restaurant of the one Michelin star Omakase next door, and figured the quality must be top notch, with the difference being in the level of service. OpenTable showed openings, so I came here for an early dinner. However, only bar seating was available, and any open tables were being held for reservations (one lady had the same ideas as I did, checked OpenTable but booked a reservation 10 min before arriving).\n\nChicken skewers showed all the marks of being grilled, but came out lukewarm. Karaage was oversized and a bit hard to eat. Sashimi and rolls were pretty fresh, cuts were a little on the thinner side.", "author": "James S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "It's our first time here and it's amazing, Great service and great food, but better to have a reservation. There's a line to wait.\nAll of the fish served was fresh and delicious, good place for small group people enjoy the delicious food.", "author": "May F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-01", "description": "Went there for dinner totally randomly and was pleasantly surprised at how delicious and fresh everything was and how quickly we were able to be seated.  Will be coming back.", "author": "Diana A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "WOW!!! JUST WOW! That was, by far, the best authentic sushi I have ever had. The freshness, the quality, the utter perfection of every single piece of sushi that was served was like nothing I had ever had before. The head chef here is Lee-San and Kent is the master manager. Their roles might be great but their Omakase style sushi is by far the most amazing Omakase you will ever have. For those who don't know, \"Omakase\" is basically the chefs selection of hand crafted sushi that he makes on the spot. Lee-San is a master at this. No sriracha or spicy mayo or soy sauce necessary. Just trust the man, he's the best in all of SF. The service and the staff is amazing as well, all kudos go to Kent, the manager master. I can't say enough good stuff about this place so I will just end with this...\n\nLee-San is like an artist, and sushi is his canvas. Trust him, try his Omakase style sushi, your taste buds will thank you!", "author": "Mike B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "Excellent food, quick service especially at lunch, the notice chips were incredible, the rolls are exceptional and us a shame he buttery soft and fresh... Prices are a little steep but lunch services quick", "author": "S D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "Good eats, nice servers. It opened relatively recently so they're still working out a few snags but whatevs. Highly recommend the udon.", "author": "Yesenia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Been twice this past month - quality of the fish seems high, service is great, and it's a pleasantly casual atmosphere - perfect for a date", "author": "Noah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "Great food, fresh. A nice place in all respects. Parking was a pain, not their fault though. Like most decent sushi places it can cost a pretty penny. But, if you are in the market for fresh and a variety of plates give them a try. They were having issues with the beer tap. Try the uni and wagyu roll.", "author": "Jaymes C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "From start to finish, our meal was superb. Ginza and Shibuya rolls were my favorites. The karaage was amazing. Tip: ask for spicy mayo on the side to dip the chicken (extra $1 charge). Just amazing.", "author": "Tal A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "4.25/5- Rounding up for amazing service and the awesome dessert\nVery happy there's a wonderful sister restaurant to Omakase right nearby. \n\nCame in for a Friday dinner with a friend. The service we received was on par with a Michelin star restaurant. Pretty sure the two restaurants share a managers or something because the team here is very well trained. Our waiter didn't miss a beat and was extremely professional.\n\nI got the Omakase and my friend and I shared a Shibuya Roll\n-The Shibuya Roll was alright. Pretty good and filling. If you're looking to get a filling meal for cheap, try the roll, otherwise the menu has better alternatives.\n\nFor the omakase I got:\n\n1) Bluefin Tuna Poke: So good. To be fair I love strong acidity and this poke brought it.\n2) Shimaaji and Salmon Belly sashimi: Salmon belly was really nice and fatty.\n3) Nigiri Plate 1 w/ Halbut, Kanpachi, Yellowtail, and some sort of belly (I forgot to take a photo so I can't remember the last one.)\n4) Nigiri Plate 2 w/ Golden Eye Snapper, Kohada, Hotate, Seared Mackerel.\n5) Nigiri Plate 3 w/ Toro and Uni\n6) White Sesame Ice cream\n\nThe fish was all good quality. About as good as you'd expect from a nice fusion place. For less than $100, I was pretty happy. The Toro and hotate, seared mackerel, and salmon belly were all especially good. However my favorite part of the meal was the white sesame ice cream. I haven't had white sesame flavor before and it was so thick and rich without being too sweet. I could eat it forever.\n\nOverall, really enjoyed my meal here. While there are better omakases out there, this is a good compromise if your friend is looking to have some options.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-15", "description": "Don't order online if you want to save time - you might as well walk in and order. You will end up waiting the same amount of time. \n\nI ordered online, waited 20 min, and now have been standing here for 15 min.  No food yet. \n\nI didn't one star it because if I have time I enjoy this place for a sit down lunch. Solid sushi.", "author": "Les I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "I think the Kaisen donburi (sashimi over rice) at Okane is my favorite lunchtime meal in SF and get it atleast weekly when I'm in town.  The cuts of various fish are always fresh and generous so Okane has never disappointed.  My wife prefers rolls and always goes for the Akihabara rolls on each order.\n\nTypically we order take out but have eaten there a few times, the food is always excellent but the service could be a little slow at times.  Still, with how consistent the food is, I've gotta stick with five stars because every meal is always enjoyed whether dine in or carry out.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "Ate here twice. Loved it both times.\n\nReally solid Japanese restaurant.\n\nSome of our favorites:\n- Saba karaage: perfectly fried\n- sliced hamachi with jalapeño\n- shibuya roll: light but tasty because of the shiso leaf\n- harajuku roll: fried lotus chip is perfect\n- udon: savory but not overly salty\n\nEverything we had was pretty good. We ordered the chawanmushi too, it took longer than the estimated time and was kinda plain. Not the worst thing in the world but I'd skip it. Also tried to order a rice bowl but the kitchen got too backed up and I think they forgot the order.\n\nWhen it's busy, it gets a little hectic but otherwise, service is great.\n\nPerfect little spot for date night and close enough where we can drive to. Plenty of parking on the weekends!", "author": "T L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Great spot in mission bay. Came here with the bro for a birthday Dinner and it was excellent. Fish is very fresh and dishes very well done. Will be back again!", "author": "Anant P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Solid high-quality sushi. The chefs know what they're doing, even the rice is perfect. Something about the Decour I can't place it but it feels almost too casual with the way the cashier is placed. It could be very high-end but for some reason it makes itself more casual. Very fresh greens when you get a side salad here, it's not crummy miso dressing, it's fresh and organic. Very innovative food. I'm jealous of the people who work in this area and get to come here for lunch every day. I would try the salmon belly, uni and some of their sake's - beautiful stuff!", "author": "Lera D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "Informal Japanese sushi and sashimi. Great lunch place. Bento box choices , along with some meat dishes too. It's next to the famous Omakase.", "author": "Sridevi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "Way place to miss as it is surrounded by SOMA office buildings. This is a sister restaurant to Omakase, right next door (a Michelin rated restaurant). A more casual and affordable affair that shares the same kitchen and some of the same quality fish from Japan or nearby.\nNice medium size restaurant with friendly staff and a comfortable vibe. Service can be a bit slow so make sure to get there attention. Service was taking longer than expected so courtesy miso soup was served. That's a sign of sensitivity to your customers. Ding!  \nOysters are wonderful. The sauce enhances the flavor of the oyster w/ overpowering. Good size with a chewable texture. Very satisfying.\nThe onigiri is not typical, it is not wrapped in seaweed. The taste is savory but the salmon is cut small and seems hidden within each bite. \nAgedashi tofu was soft with a bit of crunch. 4 sizeable pieces in a delicate sauce with beans and mushroom added for a nice mix. A version of vegetarian tempura.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Have always wanted to come here and finally came on a Tuesday night with a reservation. This place has a Michelin star but it's really affordable! We shared their sukiyaki, rolls, and each got a handroll. Everything is superb!! Highly recommend this place if you're looking for good quality Japanese food", "author": "Joyce L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-30", "description": "Service - 8/10\nFood - 8/10\nAtmosphere - 8/10\nInstaworthy - 6/10\n\nGood for a working lunch but minimal options for vegetarians (as expected from the cuisine choice). However, they're super helpful with substitutions and trying to make the order match your preferences. I'd say it's a little over priced for the quantity but the quality of food is good.", "author": "Meher G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "Decided to try because we heard it's omakase's sister restaurant. Ordered 6 half-shell oysters with extra uni, egg and ikura; a lot of nigiri (Maine uni, toro, amaebi, wagyu beef, hamachi, sake); salmon aburi, salmon & ikura chazuke, notams udon, and more sashimi. And that's more than enough for 3 of us. Wanted to try the live scollops (sold out) and live uni next time! The fish are fresh and the uni and toro are really good.", "author": "Cate L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "Okane is the sister restaurant to the one Michelin star Omakase next door. It's much more affordable with still high quality fish and other ingredients. \n\nWe ordered salmon sashimi, uni, two salmon rolls, and the sukiyaki. The sukiyaki was my favorite! It was very flavorful and had lots of tender meat. The sushi was good as well. \n\nDefinitely a great spot for casual date night as well as with a group of friends. Service was very friendly and attentive.", "author": "Sophia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-03", "description": "Service not good. Beef donburi very plain. A bit more expensive than it deserve. Will probably not go again.", "author": "Lily H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "I really like this restaurant. The food is unique and delicious. My favorite is the pork belly. For 4 people it was about $100.", "author": "Irina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "Oh the Chef is Japanese so what did we eat? Stuff I've never heard of. Awesome adventure!!!\n\nHijiki Seaweed. It's warm! The mushroom is divine and the flavor is like no other, it was a deep flavor, almost like tea, but flavorful. Oh did I mention flavor? \n\nChawan Mushi wow so good I had to google it. It is egg custard similar to the Chinese steamed dish and they make it so light, you could eat it forever so order more :)\n\nSake Lees Cured Fish get the cod get the cod get the cod OmG yes that rhymes.\n\nHokkaido Uni - first in my life ever. It was a smooth flavor bomb, real soft then explodes in your mouth. Yes I would do that again. Yes.\n\nHamachi Belly Sashimi - also a first also a wow.\n\nMy buddy got Chef's Choice Sashimi which had like Golden Eye Snapper. Told you I ain't heard of any of this but she finished all the choices well pleased.\n\nHouse Made Black Sesame Ice Cream with Okinawan Black Sugar drizzle is actually white in color. If you love the conviction of guilt for eating dessert get an extra order after you finish and punish yourself! Do it! Tell the devil I sent you!\n\nTheir cute tea pots and cups top it all for me.\nAsk for Jamie she was a doll!\n\n5 stars", "author": "Leo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "We came for their Japanese brunch.  I don't think I've found another Japanese set meal place in SF? \n\nTo start, the passionfruit mimosa was nice and tart, and it was a pretty big portion for $10!  The water is served in old Hibiki bottles. \n\nThere are a few a la carte options, but the main focus is the set meals ranging from $18-22 - they look kind of like thalis.  3 of the 4 of us did the Megumi ($22). All come with rice and miso soup.  It was a good amount of food.\n\n1. Gyuniku shigureni: stewed beef with sesame seeds and ginger - sweet soy sauce flavor, caramelized onions\n2. Gindara misozuke: miso glazed cod - standard, not over cooked \n3. Onsen tomago: 63 degree egg with hollandaise, truffle oil, asparagus; good poured over the rice \n4. Sushi spheres: salmon, tuna, and ika - cute balls of sushi \n5. Potato salad \n6. Chairmen jako: crispy tiny fish - good on rice\n\nWe each got a set meal, but we also added on some other things (good for sharing among 4 people):\n1. Kani lobster gohan: crab and lobster rice with lots of butter, good seafood flavor, served in a clay pot. It's good for filling you up\n2. Ebitama okonomiyaki: not too much batter, lots of cabbage, with all the usual toppings (bonito, kewpie, nori, okonomiyaki sauce)\n3. Beet cured Scottish salmon: weirdly red outside; light beet flavor. The salmon itself is very buttery, but I didn't love this\n\nThe space isn't that big, but tables are nicely spaced, and it filled up for brunch on a Saturday.  I'm not sure how dinner is, but I would definitely come back for brunch (the megumi set).", "author": "Marilyn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "This place is next door to and owned by the same people who own Omakase and Dumpling Time. Dumpling Time is epic. I haven't been to Omakase yet but while eating at Okane they did bring us an order of toro from Omakase to try. The chefs oysters are epic here. All the fish is very fresh and good. I definitely recommend it.", "author": "Jasper P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-26", "description": "I want to believe they had a bad day.\nI had brunch with bf and ordered Miyabi and Megumi.  Rice they served was so dry and old.  I can cook much tastier rice at home with my rice cooker than rice they served.  I asked one of the servers to replace our rice to fresh ones, and she brought the same old dry rice.  Only reason I could think of is they served the rice which was cooked a day ago.  I could not barely eat the rice.\nMost of dishes on both of the courses we ordered were either missed or just ok.\nSesame tofu was not creamy as it should be and had no sesame flavor.  I would not go on for other dishes, but I could not finish any of them.\nEven worse, they forgot to bring sushi for Megumi and we had to remind them to bring it to us, which was not worth asking for.\n\nAgain, given the good reviews of others, it could be one of those bad days for the restaurant.  One bad experience is good enough for me to decide not to come back here, though.", "author": "Kahori M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "Ok, I know I just gave 5 stars to Kuma, but this was especially amazing! Seaweed salad connoisseur, sashimi chef special - such great buttery textures! Best was salmon avocado seared w/ roe, simple yet amazing bursting flavors w/ will of wisdom sake & green tea -- yum!", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "We made an early reservation on a Saturday night and the place was not full but busy. I can see us coming here often as it is close, convenient, and food is delicious. Right next door is sister restaurant Omakase which we have yet to try. Okane calls themself an izakaya and doesn't just serve sushi so this made it easier for us with the baby.\n\nService is friendly and attentive. \n\nSpecial - lightly seared hamachi belly nigiri - I love this. I am not a huge fan of cold fat in my mouth so the lightly torched belly is perfect for me. so delicious\nSpecial - lightly seared salmon belly nigiri - same as above\nikura nigiri - fresh and delicious\nuni\namaebi - heads came fried of course\nfried lotus root chips - served with wasabi mayo. we put some lemon on it to cut the grease\nsteamed clams (minus oysters) - yummy\nassorted chicken skewers - thigh and meatball both juicy and delicious\nsake and shiso yaki onigiri - baby ate most of this. crispy on outside. only complaint was it didnt hold together\nsalmon aburi - tasted good but textures were just mushy all around. could maybe use a rice cracker or something crunchy underneath.\n\nWe will be back! Glad to have more neighborhood restaurants to try!", "author": "claudia y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "Came here for Sunday prix fixe brunch and the experience was amazing. Had made a reservation on OpenTable, so no wait time for us. Presentation of the food is so beautiful, I almost didn't want to eat it. Favorites were the salmon and the cod.", "author": "Anna Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-19", "description": "In case you didn't already know, Okane is the sister restaurant to Michelin rated Omakase next door. For me that was enough of a hook to get me strolling through their doors....lol. Well that and the fact I have been super craving quality sushi  lately. I came to Okane with the mentality of finding really high quality fish with a reasonable price point, and in that regard I believe they met my expectations. I came with a friend and we shared a bunch of nigiri. Among them were the toro, sake, hamachi belly, hokkaido uni, kinmedai, and shima aji. We also split an order of the shinjuku roll which was basically similar to a fancied up California roll but used snow crab instead and was topped with lightly torched A5 Wagyu beef. \n\nI was really excited to try the toro since this was my first time ordering it coupled by its high price point and rarity. (Don't even get me started on overfishing and sustainability...lol) Anyways, I digress. The toro was ever so slightly torched and visually you could just tell it was a fatty piece of fish by the flesh. I salivated in anticipation. When the toro first hits your tastebuds, you get that immediately recognizable \"tuna\" flavor but after that is when all comparisons end and the flavor you get is just fatty, creamy goodness. It literally melts in your mouth and if you were blindfolded, you could easily be duped into thinking this was a piece of high grade Kobe or A5 Wagyu beef. You heard of Parmesan Reggiano hailed as the undisputed king of cheeses??? Then Toro has to be the G.O.A.T of sushi....lol. \n\nWe were quite pleased in the quality of all our nigiri, especially in the fish to ride ratio. Whereas most sushi bars might try to skimp on the fish ad cut a sliver of fish that's almost transparent and place it on a mountain of rice, Okane did the exact opposite and cut a generous portion of fish that pretty much blanketed the bed of rice it was placed upon. Our only complaint on the fish was the kinmedai, which we found awfully chewy and almost gristly, not good eats. Our server also neglected to give us individual plates even though we were sharing basically everything. Minus 1 star. In short, Okane is a solid sushi bar worthy of it's big brother's Michelin status. Until you get to try out Omakase, I would suggest Okane as an affordable alternative. I will definitely return.", "author": "Derrek O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "Great new Japanese spot in SOMA for fresh sushi!  Prices are reasonable and service is great! I'm a fan. =)", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-08", "description": "Solid food, but servings are too small for the price. We went to get a second dinner at the grove afterwards. The rice dish and udon were too plain for my tastebuds. Taro chips were good! Karage was also good, but I can get something comparable for less at ramen restaurants.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-20", "description": "*** In Short ***\n\nDecent izakaya with okay to tasty dishes, but pricing relative to portions lends to poor value.\n\n*** In Depth ***\n\nI took advantage of that fact that I was In the area for a nearby art exhibition last weekend to come and try Okane while they were still new, and hopefully, not too crowded. Coming in around 8pm without a reservation, my date and I were lucky enough to get seated almost immediately, at the last open table at the time.\n\nNow, I've never been to Omakase, and I'm admittedly not a huge fan of sashimi. However, Okane has branded itself as an izakaya, and I ordered accordingly, for the most part::\n\n* Sake Lees Alaskan Black Cod - I use black cod as a baseline to judge izakayas by, and while theirs wasn't bad, it was lighter in flavor than I would have expected, and not nearly as melt-in-your-mouth tender as I would have liked.\n\n* Toriteba Karaage - A little bland on its own, but very flavorful when paired with the accompanying spicy mayo and shiso salt. But, I mean, these were just chicken wings. Sorry: expensive, chicken wings. For the same price, I could have gone to Hot Sauce and Panko and gotten almost 3x as many wings, that would have been both more flavorful and juicier.\n\n* Chawanmushi - A very, very delicately flavored chawanmushi, compared to the ones I've had in the past. Not to the point of being bland, but given the two things we'd eaten right before, it definitely was on the light side, comparatively.\n\n* Shinjuku Roll - By far the best thing we had that night, and the only thing I'd consider coming back here for. It's basically a California roll (with real crab) with a hefty portion of torched wagyu beef on top. The flavor of the California roll portion was a little more dominant than the beef, but you could definitely taste both. Pricey, at $25 for seven pieces, but more reasonable when considering the components than the other items were.\n\nSo, the problem with Okane isn't that the food is bad, because it's not. The problem is that, for the price (we ended up spending $40 per person after tax and tip) and the small portions, I'm expecting the food to be fantastic, if not stellar, and that, these were not. The value just isn't there. If you want a solid izakaya experience, you're better off going to Kiraku in Berkeley for something casual, or Izakaya Yuzuki in the Mission for something fancier.\n\n***Accessibility Info***\n\nVenue - It's a brand new restaurant, so accessibility isn't a problem, with plenty of space and accessible tables.\n\nBathroom - Single, private bathrooms, and quite accessible.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "********************** 1491 *********************\n\n   Okane just recently opened in January 2016, I got to check out their lunch and dinner, and I love every dish that we ordered.\n\n  Okane is adjacent to the newly Michelin Starred Omakase next door. A 46-seat place with beautiful and comfortable wooden tables and chairs, even the bowls and plates are carefully paired with the food. Okane opened by the Omakase team, a SoMa Design District neighborhood Izakaya and Japanese share dishes. \n\n  Chef Jackson Yu, with 18 years of experience from all over the world, and recently earned his first Michelin Star at Omakase. With new chef Shin Aoki (former Kaigetsu) created a menu with dishes that warm your heart and make your belly happy. \n\n  I truly enjoy coming here, because the GM Justin Goo (former Bar Manager at Alexander's Steakhouse and Gary Danko). Under his management, Omakase and Okane will only get better. Plus I adore one of my favorite servers Quade (former Alexander's Steakhouse SF), he is there at dinner.He's a cutie and a fire cracker, we always enjoy his service. And at lunch, Barry and Molly are both awesome servers. \n\n   Their omakase starts at $80 for 10 pieces of nigiri, a sashimi course and housemade sesame ice cream which is a bargain. They serve you at the 4-seat sushi bar.  Drinks include Japanese beer, sake and a small wine list, but very reasonable priced. I love the sparkling Brut from France, only $25 per bottle, and we enjoyed the small 300ml Sake bottle too.\n\n- Vegetables Ippin: Cucumber and Daikon Salad, that ShioKombu dressing was so refreshing, my BFF ordered 2!  Aghedashi Tofu, Yo-Dofu Tofu, Grilled Shitake Mushroom, Lotus Root Chips, Bok Choy with Sesame Mousse, were all good.\n\n- Fish Ippin: Grilled Salmon, Hamachi & Jalapeno Pepper and Alaskan Cod, were delicious. I love the Hamachi and the Cod. \n\n- Meat Ippin: Wakadori Karaage fried young chicken, Beef Skewer, and assorted chicken skewer were all good. The fried young chicken is a MUST TRY here. \n\n- Rice and Noodles: Salmon and Ikura Chazuke, rice bowl served in savory tea broth was nice. Nori and tea soup, and Udon with soft egg were all on point.\n\n- Rolls: Shinjuku Snow Crab, with A5 Wagyu Beef roll is a MUST ORDER.  I don't like roll but I will eat this roll anytime!\n\n- Sushi and Sashimi: Fresh live Uni, order it when they have it, a MUST! Otoro, Kuroamago, Tai, Kinmedai, Hirame, Aji, and Ankimo Monk Fish Liver, of course. Everything was as fresh and tasty as it gets.\n\n  I've been here a few times now, and I love it here. Lunch menu is smaller but the Bento Box is a good way to try variety of dishes. For dinner, I ran into two OG Yelpers already, Euge L and Wanugee. It's definitely a good place to hang out with friends. Okane simply serves good food and drink, well priced, and great hospitality. \n\n  Okane is open daily from 11 AM - 3 PM for lunch, and 5 p.m. to midnight for dinner on Fri and Sat, a perfect spot for late night bites and Sakewa!", "author": "Manda Bear B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Delicious food and amazingly fresh fish! Immensely enjoys our dinner. I would definitely come back.", "author": "Y K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-12", "description": "Food was good, but I had a really bad experience so that I had to post my first yelp review:\nConfusing menu + wrong dish (which we did not order) + order got canceled without notice + ignorant server + cheap disposable plastic fork & spoon + over-charged bill (which we caught) + declined request for a high chair  = terrible dinner", "author": "QQ L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "If you like quality sushi - definitely check this place out. They are supplied by the same fishmonger as michelin starred Omakase next door, so you know you're getting the good stuff.\n\nRoppongi - super light and refreshing, they've wrapped hamachi, snow crab, salmon, and avo with cucumber. There's no rice in this one and it's a nice change to a traditional sushi roll.\n\nAkihabara - salmon, avo, topped with unagi. Simple, yet super delicious. You can really taste the freshness and quality in the fish.\n\nUni - They were out of the Hokkaido Uni, so we opted for the Monterrey Uni. One of them had a kind of bitter aftertaste while the other had the creamy, slightly sweet taste you want in a quality sea urchin.\n\nMackerel Bento - Mackerel is one of those fish that taste super fishy once they've gone past that fresh state. You can totally tell if a sushi restaurant is skimping on quality by tasting their mackerel. In Okane's case, the mackerel was super fresh and not fishy at all. Even one of the girls at our table who hates fishy things remarked at how fresh it tasted.\n\nChawanmushi - I love a good chawanmushi when made right. This one was silky smooth.. almost custard like. Perfect.\n\nAll in all, I'd totally come back, perhaps for an actual Omakase meal?", "author": "Henry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "Ate here for the first time last night. The hamachi sashimi was fresh, firm, and scrumptious. The small plates were all excellent. Not your usual Japanese restaurant, a little bit of fusion. The lotus root chips came in a large mound, the udon was also a large delicious serving. The Roppongi roll was delicate, visually appealing and good for those avoiding carbs (wrapped in cucumber). Overall really excellent food and service. Just around the corner from the SF Design Center.", "author": "MJ L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "TLDR :\nAmbience : Clean and rustic : 4/5\nService : Polite and fast : 5/5\nFood :\nOntama Udon : Nice texture and flavorful, with it had meat : 4.5/5\nAssorted chicken skewers : Delicious, wish we could mix and match : 4/5\nHirajuku Roll : Fresh fish with delicious rice : 4/5\nScallop and Blue Fin Tuna Nigiri : Fresh fish with delicious rice, perfect ratio : 5/5\n\n\nWe decided to go to Okane, a sister restaurant and neighbour of Omakase, for early dinner. We got seated immediately by the window. The decor was simple but clean, the wooden blinds gave the place a rustic feel. The service was fast and polite. We started with Ontama Udon, it came with an egg in it. It had perfect texture and temperature. Noodles were perfectly cooked and the broth was delicious and just the right amount. The quantity was generous. We had assorted chicken skewers next, it came with two bbq chicken and one meatball skewer, both done perfectly. I had a slight preference for the meatball, but who doesn't. Usually I find people don't do a good job with chicken and over cook it, it was definitely not the case here. Skwers were delicious. It came with a salad which was fresh. I am not sure what the small white balls on it were. The roll we got was Hirajuku, salmon, avocado, shrimp tempura, topped with tuna, spicy kabayaki and lotus root. For nigiri we decided to get Hotate, the hokkaido scallop and Kuromaguro, the blue fin tuna. Fish was fresh and rice was delicious and the fish to rice ratio was perfect. Overall, I enjoyed Okane a lot. I'll come back to try their brunch sets!", "author": "Kritika K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-10", "description": "Came here on a Saturday night with the SO expecting a long wait due to the small space. Was able to place a reservation but it wasn't necessary since the location doesn't really scream as an area to stick around in after 8 PM. That doesn't take away from the fact that we had an awesome meal.\n\nOn this night we ordered the Fried Lotus Roots, Oyster on the half shell with the fixings, Rice with softly cooked egg, chicken karaage, Chef's Choice Sashimi, Shibuya and Akihabara roll. (We were pretty hungry as you can tell). Unfortunately, they forgot our Lotus Roots but everything else was exceptional. The Karaage was fried on point with a sort of egg batter that was extra crispy. The rice and egg, while a simple dish, was a very elegantly displayed with deep flavors. The rolls were good but I'm partial to ones with lemon slices on it.\n\nGreat date night spot without too much wait. Service is friendly and the food is good quality. A place to start your night if you plan to spend an evening out but expect to most likely ride share to and from there as there isn't much happening around that location.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "Okane is Omakase's more fusion-y, affordable cousin. Located right next door to Omakase, Okane shares many of the fish flown in from Tsukiji for Omakase, with a small sushi bar (4 people). \n\nOkane also offers omakase for $80 (compare it to Omakase's 100, 150, and 200) but the chefs are obviously not the same as the team at Omakase. Okane's menu focuses more on izakaya dishes, ranging from donburi, udon, yakitori, rolls, to the more traditional nigiri and sashimi. \n\nMy friend and I opted for sushi, the Shinjuku roll (with A5 wagyu!), chawanmushi, salmon aburi, and sukiyaki. Everything was presented beautifully and tasted great; Okane obviously aims for a high-quality presentation and dining experience. I wouldn't necessarily say that the fish was better than what you would find at other high-end sushi places around the city (think Wako, Koo, Kusakabe, etc) but it's definitely on-par. \n\nThe space is beautifully decorated and the service is friendly, albeit a bit more disorganized (I did go within the first 5 days of opening). The price point is on the higher end- I ended up paying about $80/each including tip, which is just about what would you spend at a higher-end sushi place in SF anyways. I would definitely consider Okane to be a worthy addition to SF's izakaya dining scene.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-02", "description": "Sushi was not that impressive (they source their fish separate than Omakase). Not that fresh and rice was too firm. Pricey and underwhelming.", "author": "Q C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "Decide to grab lunch here with some coworkers, and it was surprisingly good!\n\nThe karaage (fried chicken) lunch set was really good. The chicken was seasoned and fried well - not too much batter. The unagi bowl was also delicious - great sauce, tender fish, not too fatty.\n\nThe agadashi tofu had a great sauce but had more batter than I like on my tofu. \n\nOverall a really tasty option for lunch. I will be going back soon!", "author": "Jaching H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "This place is about quality ingredients.  One of my favorite rolls at any restaurant is Shinjuku roll with the snow crab in the middle and waygu beef on top  Haven't had such a creative roll in a while.  Another must order is the Hokkaido Uni which was creamy.  Udon with egg is also good too.", "author": "Stevezee C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "I absolutely love this place and cannot stop raving about the Omakase team. Chef Jackson from Omakase next door told us about their plans to open Okane a few months ago, so my friend and I were incredibly excited for the chance to finally try it out.\n\nOkane and Omakase source their fish from the same places, so anything you get at Okane is guaranteed to be high quality. Okane's omakase (lower-case) is priced at $80 per person which is pretty reasonable for the great food and service. \n\nChef Rico was wonderfully attentive and took great care of us. My favorite dishes from tonight were the impossibly smooth ankimo and beautifully presented amai ebi, but every course we ate was masterfully put together and very flavorful.\n\nThe staff are wonderful - they even overheard that it was my birthday and served my sesame ice cream with a cute little candle! It was a very thoughtful and kind gesture, which is a testament to the great people who work there.\n\nI will definitely be back to try more of their izakaya offerings, but you really can't go wrong with the expertise and experience of the sushi chefs here. Okane is a fantastic option for omakase and I highly recommend it!", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "Japanese inspired brunch. \n\nWhat a wonderful concept. Take a japanese menu and serve it in a way you might imagine a japanese person might brunch.\n\nBrunch includes 6 different selections pairing well with each other. Think of it as a bento brunch....a \"Brunto\"... or perhaps a \"Brench\" box.\n\nDelicate and deep flavors encourage you to taste all the small dishes.\n\nNow if they could offer matching drinks to take it all down...afterall what is brunch without drinks?", "author": "Spanky M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-02", "description": "I wanted to like this place! The pictures on Yelp were really inviting, but the flavors that I tasted just didn't match up to the price. First off, we got the tartare which was tasty! The Harajuku roll was also yummmy as well! But we got one other roll (which I forgot the name of) - it was wrapped in cucumber instead of seaweed, and although the idea was innovative, the overdose of cucumber drowned out the tastiness of the savory fish inside. But really though. The fish was theeee bomb dot com in that roll!! Lastly, I ordered the Ikura and Salmon rice dish with the hot green tea, and this is where I really felt like I didn't get my money's worth. Yes, I knew it was going to be experimental and probably bland, but I didn't expect it to be thaaaat tasteless. I thought that at least the fish eggs would save the flavor, but meh. I tried to save the flavor with pepper flakes, wasabi and soy sauce, but uguuu, not my cup (or bowl) of tea. Although I enjoyed the first two fish dishes, it was along the pricey end and I was still hungry, so overall, I'm giving this place a three star. The ambiance and decor inside was really nice and Japanese-esque though!! Next time, I think I'll try eating the nigiri sushi rather than the menu items and perhaps my rating with change because the fish here really did taste fresh and savory!", "author": "Kim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "Opened in the 1st month of year now rolling with impeccable service n food !!!!\nHad a chance to visit over for lunch, n all I cud say tat just drooling over the food.\n1st experience with the Izakaya cuisine, but left  flavorful  n delighted .", "author": "Aby S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-04", "description": "It was okay! I went to Japan as part of my honeymoon and missed the traditional breakfast sets I had every morning, and finally found a place that made japanese style breakfast here in sf!\n\ncute place. service was fast, and good. waiters were attentive. 5 stars for service.\n\nknocking down a star because the food was just alright. i wasn't blown away or anything, but it was ok.. i don't think i'll return brekky here though.", "author": "Catherine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "My friend and I came here for lunch because it was close to where I was staying in SoMa. The restaurant is clean, service is good and food is fresh. I ordered the sushi lunch ($19) and it came with a salmon roll and 4 pieces of sushi, miso soup and rice. My friend ordered a tempura bento box and she enjoyed it. There isn't that much selection on the menu but it has a lot of items you would expect a Japanese restaurant to have - sushi rolls, sashimi, bento boxes, noodles etc etc. Pretty standard Japanese restaurant and I would give it 3 stars but +1 star for using good quality fish.", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-05", "description": "Love this spot but don't go on Mondays - gone several times and it's not fresh. Tuesday's and later are good. Yummy menu, great service unless it's slammed. Little pricey but great (when fresh).", "author": "R B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-07", "description": "Place is not very authentic and way over priced. Definitely not coming back and hoping to avoid sushi joints like this one in the future.", "author": "Soh T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-25", "description": "Really great food and service.\n\nNigiri was very delicious and quality. A bit pricey but worth it.\n\nThere was a roll or two on the specialty list that were not as great as the others.\n\nOnly Two beer types to select from but the IPA is not bad.", "author": "Stan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "The food is consistently good.  I've been here for lunch and dinner.  The sushi is always fresh and perfectly balanced. The quality of the cooked food is also very good.  The only reason I'm giving 4 instead of 5 stars is that the wasabi was not fresh and the service was just okay. It's still one of my favorite Japanese restaurant.", "author": "Egen T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-11", "description": "The restaurant took easily one of the top items off the menu--chicken wings. Unreal and disappointing. Hopefully they change that because their sushi rolls are good but not stand out.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-07", "description": "3.5 stars but I'll round up because I'm optimistic. It's early and it'll improve with time. I was sooooo pumped for this place.\n\nThe food was great if a little pricy. I'm fine with that but the atmosphere was a little off. The location is wonky, and since there are huge windows, you can't really block it out. The ceilings and the window-bar-separators are all office-building standard.\n\nThe service was attentive and on point. There was a lot of attention paid to details such as plateware, quality of chopsticks and utensils, etc.\n\nThe ceiling and the huge office window looking out onto other offices definitely threw off the ambiance.", "author": "Victoria C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-03", "description": "More of a 3.5.  Considering the relative lack of good restaurants in SOMA, we were very excited about Okane's opening.  The food was certainly good enough that we'd come back to try some other menu items, but this won't quite become our go-to SOMA restaurant.  We had:\n - Udon (3/5).  Noodles were a little too soft, and the broth was slightly too salty.\n- Some salmon and avocado thing (4/5).  This was really pretty good, probably our favorite dish.\n- Shrimp tempura (4/5).  Interesting texture for tempura but good and flavorful.\n- Chicken skewers (3/5).  Still tastes good but lacks the grilled flavor I expected.\n\nThe restaurant itself is pleasant, and the service was great.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Best place in this area of Soma. Come here all the time for lunch or after work. Recommend the beef sukiyaki with an order of rice.", "author": "Willie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "Came here for dinner before a show- had reservations for 5:30p and walked into a very quiet restaurant with smiles and was swiftly seated. \n\nThe ambiance is a mix of group seating and private tables- high top tables are well situated for a small group, the sushi bar can accommodate 4-6 and some tables for 2 decorate the rest of the space.\n\nService was friendly, efficient and generous with suggestions and favorites. We debated doing the omakase or menu and opted to walk through the menu and try an assortment of dishes. \n\nWe particularly enjoyed the uni and toro nigiri, awesome Bok Choy with sesame mousse. Started with a bottle of sparkles from Loire valley and finished with a delightful sake.\n\n\nThe grilled sake lees cured cod is amazing, definitely need to try this! It melts in your mouth and is full of delicious goodness. \n\nAgendashi tofu was ok but nothing special, pieces were too big losing a lot of flavor to the overwhelming tofu texture.\n\nOverall worth checking out! Solid choice, friendly community and yummy foods.", "author": "Angela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "oishi!\n\ni love this place so much. it's quite affordable and all the dishes are exquisite while the ambiance is far from stuffy. i especially love the fact that they have various chazuke dishes (love the taichazuke)-- it's hard to find restaurants that have it on their menu, let alone do it right! i also love their uni ippin and kaiseki sushi. really awesome quality of fish and the service is a-ok. one small complaint is that the tables are way too small for the different plates we ordered, and i am super OCD when it comes to table clutter.\n\nthe quality of the beef in the sukiyaki was great. it was served in a 1-2 person nabe and was fantastic. the black sesame ice cream was delicious-- dense and creamy yet fluffy and complex. definitely recommended!\n\nitadakimasu!", "author": "Vanessa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "Nice space with tables and inviting wooden booths with a view of the sushi bar. Had a range of dishes but what really stood out was the Okane handroll. This made my meal with uni and an interesting texture of both the smooth uni and crunchy ingredients I can no longer remember. The sashimi was also fresh, the mackerel and salmon were memorable. I don't normally go for mackerel but here it was fresh and smoky. The vegetarian dishes with tofu and mushrooms were delicate but filling. Service was also great, very satisified.", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-05", "description": "Starters: \nYo-Dofu: The tofu seems to be too firm for this dish.  We didn't care for this as much\nCucumber & Daikon Salad:  this was actually very light and refreshing. \nWakadori Karaage: This was pretty good fried chicken nuggets \n\nSushi: \nAll of the below fish tasted really fresh and was so yummy. \nHokkaido Uni: imported \nKanpachi:\nShiro Maguro\nGinza Roll: This special roll was so good!\n\nThis is the 2nd time I've been at this restaurant and both experiences enjoyed the food very much. Will definitely come back again.", "author": "Mei B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-25", "description": "A-ok, nothing that screams \"I'm coming back tomorrow!\" Atmosphere - nice and dark, and fairly quiet and empty on a weeknight. Service - friendly and attentive, gave some good suggestions. \n\nAh the food. Fried lotus chips - 3.5 - decent, nothing screams wow, I felt the dipping aioli (wasabi?) was the best part. Agedashi tofu - 4 - broth was good, tofu was silly and fried just right. There were a few pieces of veggie tempura on top that I could make out what they were. Again, it's nice but not wow. Omata udon - 3 - good broth, ok noodle, nice onsen egg. Definitely didn't wow me. Salmon chasuke - 3 - at this point I don't know if it's the fact that our table is sharing all this and that's why everything taste so off or it's just me. Like, the tea doesn't taste like tea, the rice and salmon had almost no flavor. The ikura was a good touch in changing the texture but I don't think it was enough foe me to rate it any higher. \n\nLet's talk seafood. Hokkaido uni - 5 - yum...heaven. Santa Barbara uni -5- great. Salmon toro -5- mmm yah. Kinmedai - 4.5- not a total fan but I can taste that it's definitely fresh. Halibut  - 3.5- good but forgettable. The roll with wagyu beef and snow crab - 3 - good but...I don't quite know how to describe but I wasn't wowed. The live scallop 2-way (nigiri as well as salad) - 3.5 - the nigiri was so small I can barely taste the scallop. Same goes for the salad, like where's the scallop?! I normally love scallop so I was disappointed not to have tasted it more.", "author": "Lisa Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-09", "description": "Sushi is mediocre at best, rice is hard. We got the fried Ebri head before body(20 mins before) it took 30 mins after we finished to even get the bill. No one ever asked how anything was. We ate here a year ago and it sucked. After eating at their sister dumpling time we thought of giving it a try. HUGE MISTAKE.", "author": "Seb M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-21", "description": "Mediocre food at best and a lackluster experience.\n\nFirst off, the food. We ordered two rolls, a tofu dish, and a sashimi plate. The two rolls were ok. I would say the biggest issue was that all the flavor s would muddle together and you end up not being able to taste the fish. The tofu dish was a huge let down. We ordered the Yu-dofu and we felt the chef just gave up. Image four pieces of tofu that tasted store bought, two shitake mushrooms, and some veggies, boiled in water. Yep, that's it. I mean, at least put it in some dashi sauce as it was so bland. The sashimi plate was the complete opposite. All you could taste was the truffle oil and the texture of something soft (fish) and mushy (avocado) - the presentation was very messy too.\n\nLastly, the experience. The waiter seemed a bit distracted when I asked him questions about the menu. The menu is quite confusing as they try to be fancy with the descriptions and titles. However, every time I asked a question and he answered one, he would begin to turn away and leave. I had to start asking another question for him to stay. This happened three times. When the food arrived, the wait staff would also just drop things off without explaining what they brought. \n\nGranted, we had some baseline expectations since the sister restaurant has a Michelin star and yelp had 4 stars, but this was a huge letdown, especially for the price of the food.", "author": "Andy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "After walking into the wrong restaurant, which apparently happens frequently(!), the hostess next door kindly walked me to Okane's entrance.  Food and service were excellent and I am definitely coming back. We had a small feast with the shinjuku, harajuku, and ginza roll which were all amazing. The Saba karaage was a nice change from the more common chicken version. And the salmon ikura chazuke tasted like comfort food. We also had the hotate and uni nigiri which were both really good. Can't say enough good things about this place.", "author": "Debbie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Came here last night without reservation, Mario sat us down and gave us some really good recommendation. The food was really fresh and came out perfectly, it's def not your basic Japanese restaurant, the staffs here are so friendly so they made sure you have a wonderful experience. would def come here again!", "author": "Edison H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "FOOD:\nAgedashi tofu (4/5): Good, but nothing super special about it.\n\nSalmon aburi with avocado (5/5): salmon sashimi, avocado AND TRUFFLE?!! 3 of my favorite things in 1 dish, how could I not love it? Thankfully I did love it, but not sure if I would spend $20 for 2 pieces again. \n\nHarajuku roll (4/5): Made well, fresh fish, and the crispy lotus root was my favorite part!\n\nSERVICE (3/5): \nsuper super important for a restaurant that is just opening up -- and I thought it was a little less than okay, because the waitress completely forgot to put in our agedashi tofu order. \n\nOverall -- would come back, but it's a little pricier than the average $$.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "Compared to Omakase, I find Okane to be a much better value.   Have visited multiple times and tried both raw and cooked dishes and it did not disappoint.   Attentive service was also a plus!", "author": "Hsiao C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-27", "description": "One of the better sushi restaurants in SF. I would have given five stars for their out of this world, cake like lobster tamago...but they decided to stop making it.\n\nNow it's still got great sushi and a really good rice bowl with sous vide egg but it's a shame they took the most delicious thing on the menu off.\n\nAlso, many will be pleased with the addition of truffle oil to just about everything. (I don't like it but I realize I'm in the minority here.)", "author": "Tristan K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-10", "description": "Went for a lunch and ordered Unagi don which must be used sticky rice but this restaurant doesn't. Very disappointed, not sure the chef is untrained or the restaurant owner tries to fool people, or sued long grain rice that is definitely not Japanese dish. \nOrder an other Sashimi \"chef choice\" of 8 pieces, the Sashimi is not that fresh! Lucky I didn't get food poisoning. That was a $28- dish! \nWon't not recommend to any of my friends and I won't go back. Service is OK. Overall, disappointed.", "author": "Erick - Masao O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "Rico was amazing and super friendly. I absolutely loved all the suggestions. Must try both uni if you like uni. This is probably one of the best to sushi restaurants in the Bay Area", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-12", "description": "Fish was not fresh at all! I was afraid to eat a few pieces and get sick so didn't finish everything. For the price you'd have great sushi in LA. Still trying to find a decent sushi place in the city..", "author": "Isabella P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-15", "description": "Their chirashi (kaisendon $18) is what I normally go for lunch here. The fish is fresh-tasting and has decent quality. I asked a hot tea instead of water which is simple \"ocha\" you typically get without extra charge at most Japanese restaurants but they charge $4. It's not even a fancy good quality tea. Just skip the tea!", "author": "Jongan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "We met some friends here -- asked for a recommendation on sake, took the waiter's recommendation, and didn't realize till the bill came that he must've just picked whatever was the most expensive one.  since we'd ordered 'another round' of the same one, there was a bit of a sticker shock when perusing said bill.  \n\nDishes were well executed, good flavors.  but since this is supposed to be the more casual and less expensive version of Omakase (which is awesome as a special occasion place and where I EXPECT the bill to be stratospherically high!) -- it was a disappointment that we ended up dropping such a big chunk of change.  I'd go back BUT I'm not taking a sake recommendation again without LOOKING at the menu at the same time.", "author": "Jaina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "I love Okane. The fish is incredibly fresh and the rolls are loaded with fish and other fresh ingredients. The rice is also extremely tender, so be sure to handle the rolls with care! This is a good place for people who love sushi because of the fish and are not looking for something deep fried and covered in spicy sauce. The location is pretty random but I think that's a plus, because it's not impossible to get a seat there. They also deliver on Caviar, which is awesome.", "author": "Abby W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-28", "description": "I wish I could give this place 5 stars, but I can't. Everything was on point, except the food. Also it's a bit pricey for dinner.\n\nAtmosphere: 5/5\nMusic: 5/5\nService: 4:5\nFood: 1.5/5\n\nThe shrimp tempura gave us goosebumps. Not only that but it look like goosebump. Sukiyaki was too salty and dry.", "author": "Telsa K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-09", "description": "I have special dietary need and the server was neither knowledgeable about special diets nor cared to pay attention. He brought me food with ingredients I specifically said I can't eat. Good thing I'm not acutely allergic. Also overpriced! Won't come back again", "author": "Chiao-Yu T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-26", "description": "Enjoyed the wings (crunchy cornstarch batter),   tempura (rice cracker breading on the shrimp instead of the usual batter), seared salmon belly. They could use a wider selection of sake by the glass.", "author": "H S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-06", "description": "Awesome new place for a slightly different take on Japanese food! The sushi is excellent, and the concept of sharing plates ('tapas' style, if you will) is a welcome concept of you're not in the mood for the standard rice bowl or bento box. The grilled smelt and the mackerel karaage are amazing, and the salmon skin with sea urchin hand roll is the best. Servers are friendly and knowledgeable, and Jean is a good ambassador for the brand. Make a reservation now!", "author": "Carlo A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-14", "description": "I had a lunch. The food was good feels very healthy and clean. But service was not very impressive. First we asked for check and the female server who was supposed to get check was taking to the other server. Well I'm fine with that she could forgot we asked. So we asked another time. Server brought the check and in the middle of writing tips, i found out that they already put 20% tip on my check. I don't want to think they did it intentionally. I understand that you want to include tip\nFor larger group, but at least mention it.", "author": "Henry K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-31", "description": "Being the sister of Omakase, I expected a bit more. The staff seemed a bit inexperienced. We ordered a sashimi dinner but got nigiri instead somehow. We decided not complain, but they should know the difference! I like that they have a bit of everything on the menu other than raw fish and rolls. The fish was fresh, and the atmosphere was on the upscale side. Perfect for a date :)", "author": "Mily W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Came here on a Friday night. Best service I've had in my life no joke. All the rolls have very fresh fish. The rolls have more light flavors to it versus heavy dressed sushi you may get at other places.\n\nStaff came quickly to refill our tea and each server was very well versed in their knowledge of the sushi. Whenever they would serve our dish they would go into details of what's in the sushi. It was very nice descriptions and not awkward. I've been to other places where people have described food to me in detail and it just sounded awkward and didn't make the food sound any better.\n\nTheir last cal is generally 30 minutes before they close and what's nice about this place is that there is lots of parking!", "author": "Derrick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "Just had lunch here today with my 6 year-old so this review is hot and fresh!\n\nFor the price I paid for lunch, I was a little disappointed in my son's appetizer and entrees.  However, I don't remember the last time I tasted such delicious fish that it's made up for the lackluster of the other dishes.\n\n1) 5/5 The Sushi Lunch Set came with chef's choice of 5 nigiri pieces, tekka maki (tuna roll), tamago, and miso soup.  The fish was absolute melt-in-your-mouth perfection.  At $19, I find that it's totally worth the price and was filling.\n\n2) 2/5 The Mixed Tempura is not on the menu but I was allowed to order it anyway because what Japanese restaurant wouldn't serve tempura during lunch?  The tsuyu (tempura dipping sauce) was rather bland despite adding the grated daikon and garlic provided.  It also had a slight medicinal flavor going on which I can't say I enjoyed.  They also added popped rice into the batter for the shrimp tempura which was not my favorite either.  The vegetable tempura was not bad--green beans, asparagus, avocado, mushrooms, and I believe some kind of thin piece of root but it was so hard, I could not bite through it.  At $18, $1 less than my Sushi Lunch Set, I found this as the most overpriced appetizer I've ever encountered.  Although there were 3 pieces of shrimp and a good amount of veggies, I still don't see the justification at charging the price of an entree.  \n\n3) 2/5 The Ontama Sukiyaki Donburi (beef donburi) was a nice and large portion, however, it was also unfortunately very bland.  Donburi is my go-to Japanese dish when ordering for my children because if they don't feel like eating the meat, they'd gladly just eat the rice with the delicious sauce.  However, my son did not enjoy it at all since it was dry and the sukiyaki beef was too chewy.  He had literally 2 bites and refused to eat anymore.  At $14, I couldn't just leave it so I took it to-go for his dad, the human-vacuum, will probably eat it for dinner later with no problem.\n\n4) 5/5 Service was awesome.  The servers were very nice, prompt, and checked on us consistently.  It was definitely full table service which is a nice surprise since most typical Japanese lunch spots have servers who are focused on rushing out orders rather than focusing on their customers. \n\n5) 5/5 Cleanliness/Decor was totally my style.  Very chic and appropriate decor that was not too busy or distracting.  I couldn't help but notice how nice their wooden chopsticks were as well as the dishware.  Yes, little things like this deserve mention when reviewing a restaurant.  They do make a difference in my dining experience and it's much appreciated when a restaurant takes that much care in choosing such small details.\n\nI am definitely coming back here for lunch when craving some good sashimi.  I would still try out their other entrees in the future but I really do hope that the restaurant will revamp their donburi sauce.", "author": "Ivy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-18", "description": "Sashimi is great. Tuna really melts in your mouth. Ordered 3 different rolls, asakusa, ginza, and raponggi, they are all good. Even plain udon was great. Grilled shitake is so so, wing karaage is tasty. Service is slooow. Ordered gari/ginger and it didn't come. Second round of ordering finally got us a plate.", "author": "Linda D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Personally I really love salmon and Okane is my new go to fix. \n\nSalmon Alburi- delicious pieces of salmon wrapped around fatty avocado topped with ikura.  YUM! While also being very aesthetically pleasing to the eye. \n\nSake belly- very fresh sashimi with a butter like texture. \n\nAkihabara- my favorite roll topped with unagi centered with salmon (of course) and avocado. \n\nApart from the salmon, Okane has very unique ippin options that are very worth trying out. \n\nSpinach with Sesame mouse- mashed sesame that is prepared like a pastry roll with a house made sesame sauce. Never had anything like it , but was definitely unique and tasty ! \n\nAgedashi tofu- a breaded tofu that comes in a fish based sauce served in a clay pot, very light and flavorful ! \n\nSo glad I found Okane and will be back lots !", "author": "Shaylene L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "I came here on a lightly crowded Valentines Day because I had heard that it was the sister restaurant to the fancy Omakase restaurant next door. Apparently, the same people who pick out the fish at Omakase also pick out the fish for Okane... good enough for me! We started the night off with the chef's oysters, which were absolutely divine. 6 oysters came out on ice, each with quail egg, uni, tomiko and ikura (flying fish/salmon egg), and a light drizzling of ponzu sauce. Seriously, perfect. \n\nAlthough it wasn't listed on the menu, we were told that we could still order the omakase (chef's choice)  for a set price of 80 bucks. The price is a little cheaper than the average SF sushi place, I think.\n\nThe first course that we got was the ankimo (monkfish liver) in ponzu sauce.  It came in 3 hearty portions of ankimo; I'm not generally a fan of ankimo, but the ponzu sauce that the ankimo came with was fantastic. The next dish we got was two large pieces of salmon belly and two pieces of maguro (tuna) sashimi. Both my date and I commented on how fresh and soft the fish was in comparison to some other places that give out sinewy, poorly cut pieces that you could tell have been frozen. The next 11 pieces that we got were all nigiri; nothing overly exotic: fatty tuna (almost literally melted in your mouth), Hamachi tuna, halibut, albacore,  Hokkaido scallop, squid, makarel, salmon, uni, unagi, and wagyu (given free courtesy of the chef!). The end of the meal ended with the option of tamago or black sesame ice cream. The black sesame ice cream was absolutely amazing, and a perfect ending to the meal.\n\nI normally like to liberally drown my sushi in soy sauce because 1) I love soy sauce  2) I'm an uncultured swine, but I will begrudgingly admit that the sushi was so perfect that nothing required soy sauce. The wagyu (some places don't season it properly, cook it too much, add too much other crap, but this piece was perfectly fat and cooked) and the chef's oysters honestly were so good that I was left speechless for a few minutes.\n\nSample Conversation:\nHer: \"Hey, these are reall-\"\nMe: \"I need a minute\"\nHer: \"Oh come o-\"\nMe: -audible moan-\n\nDefinitely come here and try it out!", "author": "Kevin Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-22", "description": "Had high expectations for this place, but was a bit disappointed. Had reservations and the hostess sat us at a table with this tiny chairs with no backing. Later on I asked the manager to move to a bigger table with a booth seating. So much more comfortable. Our waitress was very friendly, but she messed up on our order twice....she wrote everything down and repeated our order so not sure how she can still mess up.\n\nThe food started off pretty good, than it got worse and we were over it. Pretty large selection of stuff to choose from. \n\nFried lotus root chips-these were good and I love anything fried\n\nAssorted chicken skewers-the size of these were pretty big, tender, and flavorful\n\nChicken wings with spicy mayo and shiso salt-perfectly fried and the shiso salt made it very yummy\n\nBeef tataki with ponzu gelee-looked amazing, but super bland. \n\nSalmon and ikura chazuke with a tea soup-bland, bland, bland. We had to put some soy sauce to make it taste better\n\nSalmon and avocado-it was part of their special fish. It looks like salmon sashimi wrapped around avocado. Not sure what was so special about this\n\nThe ankimo was really good. We ordered a few nigiris and sashimi pieces came out instead. We told our waitress so the rest of wouldn't be a mistake. The sashimi was only ok. Nothing special. Not bad, but not super fresh. They also ran out of alot of things. \n\nWe ordered 2 rolls, but only received one. Snow crab, avocado, topped with A5 wagu beef, fired garlic, and sancho pepper-first you can't put A5 wagu beef on the menu if that's not what you are serving. It was tough and so bland. Isn't this suppose to melt in your mouth? SMH.\nThe waitress forgot the to put in the other roll. We were too full and didn't want it anymore since we knew it was going to be bland anyways. Need to work out some kinks still and improve on the flavor of their food.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "Okane, sister restaurant to Omakase, serves homey Japanese food in an upscale setting. My boyfriend and I came in for lunch, hoping for some friendlier prices, but be warned that the lunch menu is still relatively expensive. I had the chicken teriyaki bento, which came with salad, an assortment of pickled veggies, and rice. The chicken reminded me of home, not at all like the sticky sweet teriyaki you would think of. The portions were just right to keep me full but not feel overstuffed. My boyfriend had the beef sukiyaki, which came in a claypot with an assortment of veggies and meat in a flavorful broth. We also tried the agedashi tofu and chawanmushi, both of which were cooked perfectly. My only complaint would be that both were slightly lacking in salt. All in all, it felt like a fancy home-cooked meal, and I'd definitely come back again.", "author": "Ashley T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-24", "description": "I was surprised their food was really underwhelming considering it's managed by the same people as Omakase.\n\nOur waiter was really sweet and nice, but the food was so disappointing.", "author": "EriCardo F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-16", "description": "Really bad tamago, which in my experience, is usually a key indicator as to how the rest of the meal is going to go. We had hoped for the best, but it was cold, had the consistency of well-done cheesecake and essentially, flavorless.\n\nThe pickle plate (a tablespoon of daikon) with white rice/nori = 50 cents worth of food for $7.\n\nThe bok choy with sesame sauce was entirely forgettable, unless you count the plating, which looked like a plop of runny hummus dropped on the plate.\n\nThe saba karaage was decent, as was some of the nigiri (one piece of hotate was super stringy).\n\nThey overcharged us on our bill (which we caught), but we just spent $100 without ordering a cocktail. I can't imagine what the people next door are paying.\n\nThis was most certainly a design district meal.", "author": "Justin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "Excellent quality fish! Tried hamachi nigiri, salmon tartar-all highly recommended. Also nice lounge music and pleasant atmosphere, great place for a nice evening date or outing if you want a cozy place to enjoy nice sushi and chat.", "author": "Irina E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "Loved this place! We came here Saturday evening of July 4th weekend around 7 PM and were seated immediately without a reservation. It was not super crowded, but had a good amount of people inside. We got the Chicken Karaage, Hokkaido Uni, Shinjuku Roll, and Beef Sukiyaki. The sukiyaki was good at first, but once you eat more, is a bit too salty. The karaage was really tender on the inside and crispy on the outside, and the Hokkaido uni was really good as well--it tasted super fresh! But the Shinjuku was definitely the highlight. The wagyu beef on top was perfect: slightly smokey, great flavor. Really high quality sushi for a non-ridiculous price. It makes me curious what the sister restaurant next door (Omakase) is like!", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "This place is amazing! The place is  beautiful, the artwork  is tasteful, and the place just wants you to make you want to stay there... As if you are visiting a family member'splace. The food is amazing too! The tuna belly, the a5 wagu beef  roll, and the cod sake grilled I can't get enough of! This place is amazing! I can't wait to go back!!!", "author": "Joel V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-01", "description": "Okane translated is money. So.. Know what you are getting yourself into. I ordered: \n\nToro nigiri\nHamachi nigiri\nSea urchin nigiri\nSalmon sashimi\nOcha\n\nI ate it without soy sauce. That says a lot about this place. It's fresh. It's good.\n\nDon't complain about rolls or condiments. You want to come here for a small taste of Japan-- not for a white wash Japanese food that drizzle mayo or spicy mayo all over the rolls and deep fried everything in pork fat. \n\nIf so, buy yourself a bottle of mayo and shiracha ... mix it, and add some fish from vons-- voila! I just saved you $50. You are welcome!", "author": "Nit A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "I thought Live Sushi was as good as it gets, but it gets better! My friends and I came here for dinner and ordered up a storm. Highly recommend the Ginza and Wagyu Beef Roll in which we ordered double of. The Wagyu Beef Roll's price ($25) jumped out at me, but c'mon its Wagyu! \n\nAgedashi tofu, udon noodles, and shiso rice dishes were delish. I loved that the water and tea kept coming and kept our table very hydrated. Super friendly service and easy parking. We even had our two year old, so totally family friendly. Okane, we will be back.", "author": "Betty H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "Came Here on a Tuesday night around 730 without reservations and got sat quickly! My boyfriend and I ordered a bunch of nigiri,beef sukiyaki, chawamushi and I got to say everything hit the spot. Food was coursed out perfectly and we left happily and full! The fish was very fresh and everyone was very friendly. Loved the atmosphere and music choice. They were playing Upbeat edm music, which made dinner a lot more lively! Without a doubt, I would definitely come back and try everything else on the menu!!! Thank you Okane!", "author": "Angela H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "If you're into quality Japanese food, this is the spot. It's a little pricier than other Japanese places, but it's all worth it. I like to come here for lunch to get the bento boxes and other traditional Japanese cuisines. The food is great and the customer service is great. TRY THIS PLACE!", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "Stopped by in here for lunch and we started with an order of the sushi lunch set. Ours came with a tamago, hamachi, salmon, kuromaguro, and one more that I can't remember. All were good and higher quality than other sushi places I've been to in SF. \n\nWe decided to then order the Yu-dofu which was a little bitter and a good tofu-based broth to sip on while we waited for our nigiri orders.\n\nWe ordered the Unagi and Hokkaido Uni nigiris with Toro sashimi. All of them were delicious. The toro was a higher quality cut that looked marbled and tasted like meat. Price-wise it's extremely good. Sanraku charges about $14 for a 2-piece nigiri of toro that is definitely low quality. $18 here at Okane is worth it if you've never had toro like this before.\n\nExtremely friendly wait-staff. If you want the same quality of cuts as Omakase but on a budget, then this is the place for you. We came out to $55/person (pre-tip) for an awesome sushi lunch.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "Came here for brunch. They have new items , really good! Tried the miyabi and mergumi. Both were great. Also ban ryu sake is very good", "author": "Jones T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-02", "description": "I ordered a chicken teriyaki bento box for lunch and they brought me the most minuscule amount of chicken and rice imaginable. They should have provided me a magnifying glass to locate the chicken on the plate. The chicken also tasted like mystery meat/ expired rat. There was a side of some sort of spinach salad that tasted like dirt or something found in a swamp. I left Okane starving and full of disappointment.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Had dinner tonight with the girlfriend at Okane and loved it! We are big fans of Omakase so wanted to give the sister restaurant a try.\n\nThe izakaya-style food was fairly traditional and comparable to what I had in Tokyo recently. The sukiyaki is a rarity in SF - great balance of flavors without being overly salty. Highly recommend having it with a bowl of Japanese rice! The clam and oyster pot was also cooked to perfection. Both were very tender and fresh, paired with a light, delicious dashi. We also enjoyed the sushi very much - reasonably priced for great quality.\n\nIf I had to nit pick, wished the sushi bar was a bit bigger so I can get a reservation easier!", "author": "Raymond S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "Insanely delicious sushi! And amazing customer service! Cindy is my absolute favorite and she seems to always keep her cool and keep everyone happy even when it's super busy. I've never been annoyed waiting for a table on busy nights.", "author": "Grace B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Okane is a welcomed addition to the Japanese food scene in SF! One thing I miss about NYC is the many casual izakayas for some Japanese cooked dishes. Surprise - I'm not always craving sushi though SF has plenty of solid options these days (Omakase, the sister restaurant is fantastic).\n\nBeen here a few times now. Always consistent food and service. A few favorites - Saba karaage, sukiyaki, steamed oysters & clams. \n\nWill be back!", "author": "Angel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Visited Okane for dinner on a Saturday for a friend's birthday party. The location isn't the most accessible in SF, but the food and atmosphere really makes up for it. \n\n1. The Lotus Chips are crispy, and lightly-seasoned in wasabi. Pairs very well with the mayo-ish condiment.\n2. We shared had a about half a dozen of maki rolls, and the Roppongi stood out. I never had anything like that before, thinly shaved cucumber used as a wrapper for the maki roll. It gave a very light and refreshing touch to the maki. Both Shibuya and Kappabashi are top-notched and well-balanced makis. The salmon (shibuya) and BF tuna (kappabashi) are fresh and melts in the mouth.\n3. The beef tataki was tender and very well paired with the ponzu.", "author": "Lee-Hong L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "We got a coupon of complementary drinks and appetizer, so we decided to check it out. :)\nThe sushi was amazing, mouth watering and very filling!\n\nWe ordered the Mackerel Dish and it was delicious. Would definitely go there again and again!", "author": "Tejal D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "The Brunch is exquisite. Presentation is rustic and refined. The service is attentive but not stuffy. The cocktails are inventive. And my egg was perfect. Go.", "author": "Kate L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-16", "description": "Inconvenient location. Solid food. \n\nI was surprised by the quality of their dishes here. And then I learned that they share the supplier with the Michelin star rated Omakase next door. #winning \n\nMy friend and I made the mistake of walking into Omakase like two bozos before finding out Okane was one door down. Note Omakase is tiny, dimly lit, quiet, and most likely reservations-only.. \n\n\"Uh... Can we get a table for two?\"\n\"Do you have a reservation\" \n\"No.. Is this Okane?\"\n\nA friendly Japanese female server kindly let us know Okane is one door down.\n\nApologies for the disruption, fine diners.\n\nWhen we got to Okane, it couldn't have been more different than Omakase. Bright, no smell of a Michelin star, people eating mostly rolls. Well, the meal was theirs to lose after THAT resetting of expectation! \n\nIm happy to say Okane completely delivered and exceeded far exceeded our drastically lowered  expectation. Our server was extremely knowledgeable about the menu - a huge plus given I brushed him off in my mind at first for being a white dude. My bad.\n\n\nChicken karaage - 3.5 stars. Deliciously crispy, well seasoned, a little too oily for me \n\nMackerel karaage - 4 stars. Quality fish not over cooked. Nicely balanced with the grated daikon and jalapeño mixture\n\nBok choy with sesame sauce - 4 stars. Perfectly cooked bok choy and delicious sesame sauce. We ended up asking for more bok choy because there was way more sauce than bok choy\n\nHamachi sashimi - 4 stars. Fresh. High quality, buttery sashimi. No real wasabi though\n\nShinjuku roll - 5 stars. This was for sure the highlight of the meal. Real crab meat and avocado roll topped with AMAZING pieces of seared wagyu beef. Melted in my mouth. I'd go back just for this roll. Note this is a pricey dish ($25). The server let us know the beef is sourced from the same supplier that Omakase uses. I always judge roll eaters but damn, I'm all in for this one. Yummmmm\n\n\nI'd definitely go back to try other dishes and get the roll again and judge the shit out of myself.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "I like Izakaya in general so I went check this place out with my friend on my day off.\nFrom a native Japanese standpoint, all the dishes were little too big but that's probably just me. Sashimi fish here were incredibly fresh, the server told me they source their fish from Tsukiji..makes sense!\n\nSaba karaage? I've been to many Japanese restaurant and have never heard of anyone deep frying Saba, so I gave it a try and both presentation and taste was great.\n\nShrimp arare tempura? The tempura was huge, which is good because we were hungry. Arare rice cracker gave it some unique and distinct texture to it, avocado tempura threw me off first but taste was actually great.\n\nOcean trout sashimi was one of their special so we gave it a shot. Sashimi was thick and tasted amazing. I believe they put truffle oil on them. We ordered few other sashimi and they were all much better quality than what I've had in many other restaurants. Menu had some fish I've never seen in other places too.\n\nOKANE HANDROLL was out of this world, a must try if you're into uni. It's basically a handroll with sea urchin, salmon roe and shiso leaf and salmon skin? Such a great idea for a handroll!! Little pricey for a handroll but I ordered a second one after eating the first one, just take my money!\n\nWith a bottle of small sake, bill came out to about $150 for 2 people, not too bad for the experience, we ate a lot of food.\n\nOverall I'd like to give this place a 5 star.\nService is good.\nFood is great.\nAtmosphere is good.\nAnd lastly, their black sesame ice cream.. was crazy good.", "author": "Mario K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "Just found my new lunch place near work. This place is amazing! There service was on point and their food was delicious. I highly recommend trying the Wagyu Beef Roll and the Ginza Roll. You won't be disappointed. I'll admit I was a little hesitate at first because you don't know what to expect from a new place. But I'm happy to say, I was very pleased.", "author": "Priscilla C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "The grilled cod and Hamchi Kami were really good! We also got the deep fried lotus chips, Akihabara roll and chicken karaage. All quite good and would definitely recommend ordering them again. We finished of the meal with Uni nigiri and Ikura nigiri. We liked the Uni much better and it was worth the price of $10 for the pair. The Ikura was a bit salty and not as fresh as it could be. They also have delicious drinks like melon soda ramune and Yuri masa muni sake!", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "Nothing gets me more excited than trying a new Japanese restaurant in the city. My friend and I decided to come in on a Friday night for dinner and we were not disappointed :) Being a sister restaurant of Omakase, I would definitely come here if you were looking for a more casual/chill compared to Omakase's upscale vibe. We sat at the bar and I'm so glad we did! \n\nFor nigiri, my friend and I ordered the toro and sake belly which were both delicious. The fatty tuna melted in my mouth as expected. We also ordered the Ginza and Shinjuku roll but the one that stood out more was the Shinjuku roll which had snow crab, avo, and torched A5 wagyu. Who doesn't love wagyu?!  \n\nThe chef at the bar recommended to us try Hakkaku (sailfin poacher) which was a fish I've never heard of before. It's a three course set that prepares the Hakkaku three ways. Since he said it was their special of the day, we decided to give it a try. The first course was a beautifully presented sashimi platter of Hakkaku along with the body of the fish. It came with about 15 pieces which was a pretty good amount for the two of us. The second course was the crispy skin of the fish which I thought tasted like chips! And lastly, we ended the meal with a fish broth soup which was soooo yummy! There were fish bones, tofu and all these different herbs in it. We were super stuffed, but our chef gave us tamago and their homemade white sesame ice cream on the house! I've never had white sesame ice cream before but it was honestly the best sesame ice cream I've ever had. I realized as I was biting into their tamago that it's the same one that Omakase serves as well! Overall, I had a great meal at Okane and I can't wait to be back. \n\nTip: You can order dishes from Omakase at Okane, super plus!", "author": "Elisa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-20", "description": "Finally, a well designed Japanese restaurant with atmosphere.\nPlus the service is impeccable!!!!\nThe menu is small and unique..\nEverything we tried was fresh, delicious, surprising and beautifully presented on gorgeous Japanese ceramics.", "author": "Dagmar W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "Okane (Japanese) on SF Townsend Street is excellent.\n\nMy 2 friends and I ate dinner last Friday. The food was excellent. The waitress was quite helpful and attentive. The price with tax was about $32 per person without alcohol. \n\nOkane is small and with street parking. The restaurant is designed to order multiple foods and share with your friends, but going alone is OK, as well.\n\nWe had the following: bok chow with a seasoning dip sauce that was superb, chicken skewers that were tasty and tender, scallop sashimi, and shrimp tempura rolls. Each of these was excellent. Also, we had green tea and ice cream; both were good.\n\nThe only downside was that the bill overcharged us a lot for the scallop sashimi and that is inexcusable; however they adjusted the price.\n\nYes, I will return to Okane in SF.", "author": "Robert H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "Very convenient at night because usually there is always availabilities.\nNice service and correct food. Not cheap though...", "author": "Stephane R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "I'm still dreaming about the Ginza Roll which has everything you could ever want rolled in a sushi roll, (avocado, shrimp tempera, cucumber, topped with torched hamachi, jalapeno and blue fin tuna). please keep them coming!\n\nOkane... the food was fresh, the place was beautiful, and the staff were all extremely attentive and friendly. i was super dehydrated before i arrived and my water glass was never empty! \n\nsome other highlights for me were the grilled sake lees cured alaskan cod, the agedashi tofu and the shinjuku roll (sushi topped with A5 wagyu)! the taste buds were overjoyed! i cannot wait to go back!", "author": "Jackie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "We went there for our wedding anniversary.  Fresh fish, great service, good ambience.  Only gripe was that they had no desert selection.", "author": "Sandeep B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "Okane is a great addition to our neighborhood and I look forward to many more killer meals here!\nThe food is very good, especially the Ginza roll, the staff is friendly and efficient, and there are many great wines and sake to enjoy accordingly!", "author": "Peter M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Fantastic sushi and unique rolls, appetizers, and dishes. Great service!  Highly recommend the Ginza and Harajuku rolls and the salmon and avocado dish.", "author": "Greg and Ann P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-30", "description": "Sashimi was wonderful but Beef roll was disappointing. Overall go for sashimi, really empty when we went. Not sure why. Suppose to be the sister company of omakase next store. Walked into wrong restaurant, the staff walked me over. Nice people", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-24", "description": "On a visit to SFO we looked on Yelp for restaurants near the place we rented for the weekend.  Okane got 4 stars and was relatively close so we headed out.  The menu is eclectic, meaning it was pretty hard to understand. We saw some recognizable words, but the descriprions tried to be too fancy/traditional. The service was slow and to make matters worse our server disappeared after taking our order. The food runners brought out the food, but when I needed another beer and a few more items she was no where to be seen. Then she appeared with her bag on her shoulder, punched out on the computer and walked right past us and out the door without a word. Last but not least, the food. We ordered 6 items and only one item was good, the Karaage chicken was really good. The tempura bad, the beef skewers had no taste, the agedashi tofu was actually tofu tempura, yuck. The nigiri sushi, weak. And I wont even expand on thier \"craft beer\" from japan. All I wanted was a large Sapporo. Okane, never again. Sayonara!", "author": "Owen I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "Quality sushi. I had a minor issue with delivery and their general manager took care of me with class.", "author": "R G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "We had a great ladies night here, the food is so delicious and service is great! The manager ordered everything for us and we tried all different appetizer, sushi, Fred Chicken and cod fish! Definitely will go back again!", "author": "Lin T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-10", "description": "We went here for lunch today with a colleague. I got chicken karaage bento box. The chicken felt like I was chewing on cartilage. The rice was good. The miso was ok. I don't put one star because they didn't make me pay for the bento box from which I only ate the rice, fair.", "author": "Leo W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "Since the first time I came to this restaurant two months ago, I've been back several times, bringing different friends or relatives. \nThe food is delicate and never overly seasoned. Ingredients are always fresh and of good quality. My must haves at every visit are the chawanmushu and the home made sesame ice cream. Delicious!", "author": "montreal g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-23", "description": "Overall, an A-OK experience with some big hits and misses. The sushi and chawanmushi were excellent. However, the Yu-doufu was cold in the center and completely lacking in flavor and the agedashi tofu was rather bland as well--avoid! The udon was pretty good but not too memorable.", "author": "Jia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "I am so happy that I found this restaurant! The Shinjuku roll and Beef sukiyak are must-try! The mackerel Bento Box is not bad. All dishes were served in relatively small sizes, but they are so delicious and thats enough!", "author": "Vicky L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-01", "description": "*Food isnt that great and over priced*\nNigiris: uni and toro was good \nRolls: too much rice and didnt not taste good - do not recommend rolls\n\nPrice should be $$$ and this place over all wasnt that good", "author": "Peetas M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-19", "description": "Came here, was impressed with the food and small details of the restaurant. Food is tasty and fresh, will be going here again to try more things.", "author": "Sharon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "By far some of the best sushi, fish & Japanese cuisine we have ever eaten. Everything from the fresh nigiri, to the cauliflower risotto, the chicken wings and everything else we tried was just superb. Even my husband who isn't a fish eater tried & loved everything he ate! The service was amazing and the owner (Cash) is one of the nicest people we have ever met.  We can't wait to go back! And to try Cash's other restaurants. Thank you so much for an amazing evening full of great food, great friends & lots of fun.", "author": "Erin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "I'd give ten stars if I could!! Hip spot, great tunes, AMAZING, fresh and delicious food complimented by super attentive staff. Thanks to Ian, Barry and company,  we felt like royalty. Hats  off to the new GM Justin for producing an all around hit. Can't wait to go back and treat myself to some badass izakaya.", "author": "El M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-08", "description": "walked in, was seated then was ignored for 10 minutes. With so many overpriced sushi joints to pick from, why deal with this.", "author": "Rharrison79 .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "Incredible. Amazing nigiris and sashimis. Music was too loud but the food made up for it", "author": "Pau Y Monica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-21", "description": "Decent food, but I would not come back due to price and better options for similar cuisine in the neighborhood.  \n\nMy boyfriend and I shared 4 dishes (noodles, a roll, karaage, and clams).  We were far from full, but decided to finish dinner elsewhere.  \n\nFood was overall well done (a bit oversweet/oversalty for delicate japanese food), but I have one MAJOR complaint, which was that they only served us one dish at a time, and then we had to wait between dishes.  Due to this schedule, they were also extremely rushed to clear our food.  They would try to take our plates away even when we were still eating, with chopsticks still in the bowl!  We felt extremely rushed by the multiple servers trying to clear our plates every time they walked by.  We had ordered some dishes that would have paired well together since one was over salty (i.e. the karaage with the noodles), but couldn't do that.", "author": "T Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-02", "description": "In search of some real Japanese food, as Ive been in europe for almost a year. I wandered around my area during my lunch and hit a jackpot. Ambiance when I walked in was cozy and welcoming. The service was great and the food was just what I needed. I had some amazing and fresh sashimi which hit the spot. My only issue was parking, which wasnt horrible if you don't mind a walk or searching the streets. Other than that, I'll be coming back with my colleagues real soon.", "author": "Jonathan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "i love this place!\nthey have a great playlist, such a chill place too\nthe best ankimo ive had in the USA!\nthey have karaage but not any ordinary karaage...its mackerel and oh so good!\nthe sushi is great quality and the sake list is pretty descent.\ncant wait to go back!", "author": "Marie r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Amazing food, amazing service and not overpriced. Been a few times and absolutely loved it!! The black cod appetizer is to die for and fresh fish variety is very good. Knowledgeable and very friendly staff with good sake selection. I would give them 6 stars if I could :) Highly recommend this place!!!", "author": "Galina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "I went to Okane with several friends from SF and NYC hoping for a fun casual dinner and we were not let down. The fish here is extremely fresh and delicious and the small plates were great. The karaage is a must try. We split one plate and ended up ordering 2 more. The grilled shiitakes were also really good.\n\nOur favorite sushi were the various bellies - toro, salmon belly (special that night), one other I forget. They were out of aji, but had shima-aji which was just as delicious. The ginza and shinjuku rolls are great. The toched A5 on the shinjuku is just as extravagant as it sounds. We also had the harajuku and asakusa which were great, but I'm sure any of them would be great. The fish is fresh and the combinations go well.\n\nThey have a good sake list and we tried a few different bottles which our server recommended. When someone said they wanted nigori, she guided us to a not-too sweet one which really hit the spot.\n\nOther things: easy to get to, ample parking, 90s hip-hop playing non-stop. Its a fun spot with good food, will definitely be back.", "author": "Derek P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-21", "description": "Been here 4 times. Service sucked all 4 times. Slow delivery, slow follow up. Sushi expensive but above average quality. Not so friendly staff. I'll only come again if others are willing to pay the bill.", "author": "Karma Is Coming 4 U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-18", "description": "My dinner there was mediocre at best.  Even though they are a sister restaurant to Omakase next door, the quality of the fish and the sushi/sashimi preparation are nowhere close.  The other items: soup, salads, cooked fish, are likewise entirely uninspired.  Many better choices in SF for Japanese.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-23", "description": "Overall it's good. Nice service. One thing is that the rice is quite pricey. $7 for one rice.", "author": "Nacy V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-28", "description": "Dinner is great but lunch service and food are poor. Waitress got order wrong and was inattentive all meal, and food was way too salty. Also lunch menu is really expensive for portion size.", "author": "Tony D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "What a great lunch addition to the neighborhood.  Fresh, innovative, and delicious.  The Grilled Sake Lees Cured Alaskan Cod and Roppongi and Harakuku Rolls are quite tasty... especially when washed down with one of their many sake's.  I would highly recommend.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-17", "description": "My friend and I decided to try this spin-off of Omikase on a weekday night, and we both ordered the chef's sashimi sampler.  The fish quality was just ok - some pieces tasted fine, while others were not so fresh.  I thought it was maybe just me, but my friend felt the same way.  As a chef's choice sampler, the chef can choose whatever cuts of fish he would like to serve.  Given that he chose to serve fish that wasn't that fresh is disappointing. In addition, a bowl of rice was not included and was an additional five dollars.  Hence, two stars.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "Very good sushi. We mainly have their delivery through Caviar. From the Agedashi Tofu to their sushi rolls - excellent. We ate their once in person and thought the service was mediocre but the chef is fantastic. The service is the only reason I did not give it a 5 star. Maybe it was just that day, but the servers and host were confused and kind of disorganized. The food made up for it.", "author": "Faisal M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-30", "description": "Wish I could review them since my company just opened up across the street AND I've been to Omakase. I called to order something for lunch and they had some overly complex reason as to why I can't place an order and would need to dine in instead despite being stated as having take out as an option on Yelp. Very disappointing, overly complicated - I'll take my business elsewhere.", "author": "Elisabeth H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "My husband and I ate here during the soft opening. We shared a lot of small dishes and some sushi rolls and I ordered the Udon for my main which was delicious. It was just what I wanted. My husband ordered a rice dish that he really liked that had shiso in it (I don't remember the name). The staff was friendly and knowledgeable. We will be back!", "author": "Marie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "Recently came here for Dinner and all I have to say is that it was delicious!!  Wonderful service and outstanding food!! They're known for their small items like the Salmon Aburi and Shimofuri Hamachi! Both were amazing! Our server Dana was very helpful when it came to the menu as well!! I'll definitely be back!!!!", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Tried two of their specialty rolls and they were both great. The food was all fresh, the place is clean, feels upscale, and the servers are nice. I was able to walk in around 6 on a Friday and just sat at the 5 seat sushi bar alone with some tables open. It got a little busy afterwards and most people had reservations.  Will definitely come back.", "author": "daniel h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "I was really pleasantly surprised by this restaurant. I came here for dinner with another person on a Monday night and the restaurant was mostly full, but wasn't too crowded and we were seated right away. The service was attentive and pleasant right off the bat. The server brought water and told us the specials and took our order, then brought sushi garnishes in pretty little plates to the table (the usual stuff: soy sauce, pickled ginger, and wasabi). We ordered three dishes- the hamachi kama (sp?), which turned out to be a collar of hamachi grilled and served with ponzu, the harajuku roll, and the chicken karaage. All were attractive and pretty delicious. The details were done right- the hamachi was seasoned into the crevices and tasted like it was grilled over charcoal, the karaage was very very hot and fresh, and the harajuku roll had a lot of accents that didn't feel gimmicky (the lotus root chips on top were seasoned and spicy and were a really delicious garnish).  Portions felt a little light for the price (50$ for a light dinner for 2 people, no beverages), but not unreasonable.", "author": "Allison W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "I went to dinner here with a coworker of mine and it was amazing. Very fair priced plates (especially for the same expertise from the owner of the Michelin Starred Omakase). The owner/head chef Jackson came out and made sure our meals were to satisfaction and that we were enjoying our time. Really cool atmosphere and super friendly wait staff, I will definitely be coming back.", "author": "Stevie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "I had the pleasure to try some items from the menu during the soft opening. The Alaskan Cod and the Tuna belly were absolutely delicious! Thumbs up to everyone for great ambiance! Gibb and Ian, way to go! :)", "author": "Tom M."}
