{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "Food was so good! The staff here were really nice too\n\nRecommend: \n\nTurnip pastry\nMeat pastry\nShanghai style chow mein!", "author": "michele h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-10", "description": "12/17/17\n\nSo, get this...\n\nWe were here to take out my gf's cousin and his mom for dinner.  He's from China, finished undergrad here, and just landed a job at Facebook (and he bragged that the sign-on bonus alone was enough for him to live on for years.)  His mom came here from China for a vacation, to celebrate with him, and so since she's only here for a short while we figured we'd take them out...\n\nAt one point we were talking about my gf's amazing cooking (she's in chef school) so I whipped out my phone to show them pics of her yummy stuff...\n\nHe looks at me working my phone and asks, \"What's that!?!?\"\n\n\"Facebook.\"\n\n....\n............. Yeah.\n\nSo I stared at him, then looked down at his shirt, black with the Facebook logo.  .......and gulped my food down...\n\n..\n\n....alright, so this was like 4 months ago and I didn't take notes.  I don't remember the food much except it was mostly average, but the owner and other server were VERY nice to us.  They were very gracious and humble, and quite social, making many suggestions to us as we contemplated our choices.  As the night wore on they continued to impress us with their service, being extremely attentive and friendly.  This was VERY remarkable given the vast majority of the best Chinese restaurants have terrible service.  In fact, having good service almost is a bad sign for getting authentic Chinese!--well, I guess good for us the food was good enough.\n\nMy gf luckily has a semi-photographic memory for food, so I'm just going to print her notes here:\n\n1. Drunken Chicken $9.00:  \"I think this tasted standard, do not remember anything special about this one.\"\n\n2. Shreaded Bean Curd with Fried Green Onion $7.00:  \"Did not get the eat this, because it was far from me. It looked fresh though.\"\n\n3. Shanghai Steamed Dumpling with Pork $9.75:  \"The flavor of filling and soup was pretty good, but the skin was not good, soggy and leaking.\"\n\n4. Pressed Duck (Half):  \"Before we ordered my bf confirmed with owner that the duck is fried. It looked like fried, but it was definitely not freshly fried. It was little cold and hard. But I think the duck is dry brined or something like that, so it had the special salty taste. I liked the flavor, but texture was not good.\"\n\n5. Braised Meatball with Vegetable in Clay Pot $10.95:  \"This is a very traditional dish in Shanghai. The meatball is supposed to be huge and super juicy/ tender. It's also called lion king ball in Chinese. This was ok, tasted like a dish my mom could cook at home. The meatball tasted average, do not have that super tender texture it's supposed to have.\"\n\n6. Smoked Ham, Salted Pork with Bamboo Shoots and Soy Bean Sheet Knots:  \"This is another very traditional soup dish from Shanghai. The key to this dish is that the bamboo needs to be super fresh and broth needs to be rich and little salty. I think this one tasted standard, nothing special.\"\n\n7. Stir Fry Special (not on menu, written in Chinese on the wall):  \"This stir fry has the special vegetable JiaoBai (do not know the English name). It's like a root vegetable and I think it's only available in spring. The slice it and cook with thinly sliced pork with soy sauce. This one tasted good, especially if you eat with bowl of white rice. The pork was tender and vegetables tasted fresh with right amount of sauce.\"\n\n8. Boiled Sweet Rice Ball in Wine and Cassia Blossom Soup:  \"I liked this one very much. The soup has right amount of sweetness and I can also taste the rice wine as well as the dry cassia blossom. The wine flavor is subtle , not overpowering. The filling is sweetened black sesame, which was very tasty.\"\n\nSo, really, the food was just a 3/5, but since the prices were pretty good, and the service was so extraordinary for an authentic Chinese restaurant, I'd give them...\n\n4/5\n\n\n#chinese #sanfrancisco #star", "author": "Dean C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-14", "description": "What happened to this place?\nI came here twice a few years ago. We are an old Shanghai family. I always order at least XLB and pork shank, a typical Shanghai dish. Food was good in the past. XLB was dry, practically no soup. The pork had no taste. My girlfriend cooks low salt. She agreed there was no flavor to the pork or the sauce. \nUpon complaining, the waiter brought us extra sauce. We had to add salt to the extra sauce. My girlfriend blurted, \"Even the salt has no flavor!\" It was Saturday night from 7 to 8:15.  Place was nearly empty. Parking is impossible. I'm not coming back.", "author": "Sammy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "My son loves the xiao long bao. This is our go to family spot for dinner. Great staff; they're very friendly and attentive. Great food; very consistent and good.", "author": "Minh L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-10", "description": "This place isn't bad but crazy over priced. I got 8 pork buns and an order of beef and green onions with a rice. It cost $29.00. Which is fine if it tasted great or if there was a large portion. The picture below is my $15 order of beef and green onion. It is barely half full. \n\nThe food taste fine but I will not redo due to the lack of portion.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "Fish was impressive and pretty authentic Shanghainese.  The soy sauce crab was a bit bland, shoulda cracked the shell to get the taste in the meat.  The duck was crispy but not too oily.  The litmus test is always the on fried dumpling which is definitely subpar here.  It was doughy like a bun and no soup in the center, huge disappointment.", "author": "Rena H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-15", "description": "Granting my request for more xiao long bao, the hubby braved the crowded, crazy roads of San Francisco and drove us to Old Shanghai for what we hoped to be an excellent lunch. \n\nParking is a nightmare and there are a few specific slots in front of the restaurant that have a strict 30 minute limit. Argh! Luckily, there is a parking garage right across the road (located on top of a Ross and Walgreens) that charges $1 for every 20 minutes, which is actually reasonable for SF parking. The restaurant itself is on the tiny side with large round tables to accommodate bigger parties and square tables for smaller ones.\n\nWe were greeted with a sincere smile and politely led to our table that was dressed with clean white plates and utensils. Already, I was impressed with the service. It was much more welcoming than most Asian restaurants we have been to. The menu is gigantic, but neatly organized into categories like dim sum, noodles, cold dishes, and proteins. I did spot some spelling mistakes, but nothing too glaring.\n\nHungry and raring to eat, we chose xiao long bao (of course!), green onion pancake (hubby's favorite), wonton soup, and Chinese donuts (only offered for weekend lunch). Food came out fairly quickly and presentation was neat. The Chinese donut was crispy, but shone with an oily sheen that made me feel guilty the minute I took a bite, but it paired well with the wonton soup. The soup was certainly the \"fanciest\" wonton soup we've had with sauteed garlic pieces, strips of eggs, and dark pieces of seaweed. While we enjoyed the light flavor of the broth, the wontons themselves were a tad bit on the bland side.\n\nThe green onion pancake was crispy, but too dense for our preference. We couldn't finish the whole serving. As for the long awaited xiao long bao, I was disappointed. Each dumpling stood tall and looked quite lumpy from the large pork filling on the inside. The lack of delicious soup, however, was upsetting. We barely slurped up anything. \n\nOld Shanghai is a great place in terms of clean decor and attentive service, but if you're coming for a xiao long bao fix like we were, we can't say it'll be worth the trek.", "author": "Quyen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "This is most authentic Shanghai food.\n\nThere is a wine tasting event hosted by my fiend with 25 persons on Sat night - May 20th, at the second floor, very big room, which can take 6 round table; about 60 persons.\n\nThe owner Mr. Yang greeted us with best warmth; waiters were very professional, satisfy all your request.\nthe red braised pork belly was melting in the mouth,  every bite was flavorful, I can never see that dish the same way before.\n\nThe sour and sweet fried fish (Shanghai squirrel fish) was the best I had, very crispy n fresh, the sweet and sour was balance, and the fish meat was very very tender, nice texture, what a enjoyment time.\n\nThe pork shank (upper leg) was so chewy, muscle meat, best in the world, my favorite dish that day.\n\nThe meat mooncake was another of their specialty, so many great dishes there, definitely my favorite Shanghai restaurant in Bay Area; you will love it.\n\nShanghai food is not spicy, goes well with Chardonnay, fume Blanc, Cab.\n\nA great experience there with friends.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Came here for a family style dinner with my family members, and it was some of the best Shanghainese food ever. My aunt said that some of the food was better than what she had in Shanghai. We ordered a variety of dishes from 6 lbs of a snow fish, crab, drunken chicken (that you might actually get drunk off from), veggies, lamb, bamboo (highly recommend), and much more. \n\nThe service was great and the staff was very friendly. Would highly recommend and if I'm visiting from NY again, will definitely be back! As expected, parking in the area can be a little bit tough!", "author": "Stephen E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-13", "description": "I wanted to bring my family (who live in East Bay) to a yummy Chinese restaurant in San Francisco. Old Shanghai seemed like a good choice from the Yelp reviews, but after the meal, my parents were disappointed by the quality and portion of food and the service. \n\nWe ordered:\n- Tofu with shanghai green soup\n- Xiao long bao\n- Whole fish in sweet and sour sauce\n- Rice with salted pork and vegetables in clay pot\n- Shredded bean curd with yellow chives\n- Another vegetable dish (not on menu, but on the specials board) with wood ear, lotus, and mushrooms. \n\nI think out of everything, the only decent dishes were the xiao long bao and the whole fish...The tofu with shanghai green soup was filled with MSG. The rice with salted pork and vegetables was inconsistently flavored - my sister took a bowl, and it was tasteless; I took a bowl too, and it was extremely salty. This dish overall didn't have flavor - it was just salty and bland. The vegetable dishes we ordered also lacked flavor and were not very good. In addition, portions were very small here. We ordered 6 dishes for 4 people and were barely full (and we definitely as a family don't eat a lot.) \n\nThe final strike was when my parents asked if there was dessert. Usually Chinese restaurants serve complimentary dessert (like red bean soup or fruit.) This restaurant didn't. Only after my parents persisted about the dessert, that the waiter brought out some red bean filled pastries.\n\nI'm not sure if my family didn't like this restaurant because we are from Guangdong region and this is Shanghai food. But we've been to northern China and Shanghai frequently over the years and had no complaints about the food there...", "author": "Christine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "Great experience. Food were really good and staffs were very accommodating. The place is great for family or group of friends because it's spacious. I definitely recommend this place.", "author": "Bella A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "We had the soup dumpling, spicy wonton, and they made pickled (slightly spicy) pork soup noodle for us. \n\nThe soup dumpling was ok. I never thought I'd say this, but felt like it had a bit too much meat!  Guess the meat to soup ratio felt a bit off so it didn't feel as juicy as ideal. \n\nSpicy wonton had a sesame and spicy sauce. Was tasty.  I liked the sauce on noodles even more than on the wontons. \n\nReally enjoyed the pickle pork noodle soup. The broth had really great flavor!", "author": "Kathryn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "Legitimately local and authentic Shanghai restaurant. Came in with my family for a late lunch around 1:30 and ordered chicken fried rice with soup dumplings. Great service, clean environment. The only problem is figuring out parking. Highly recommend.", "author": "Brandi H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-22", "description": "I can see why it's empty here on a Friday night. Only groups here are tour bus people. Either over favor or no favor. What's worse, didn't leave that long and my stomach start hurting.", "author": "Jasmin T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-11", "description": "I did not like the soup dumplings.  They had very little soup, thick skin and a funky smell.  The feeling was unseasoned meat, and that's it.  Sweet and sour shrimp was mostly sweet.  The service was very good.", "author": "Pasha G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "Old Shanghai is definitely a staple of SF . If you haven't tried , please do . They have excellent service . If you aren't sure what to order , don't hesitate to ask the staff . They definitely know what to recommend . I came here with my family for dinner and a few family members have some pretty strict dietary restrictions but they were able to recommend some amazing dishes to accommodate . \n\nI completely forgot what the big fish dish was called because they suggested it but this was the highlight of the whole meal. The fish was perfectly crunchy but was served with almost a sweet , tangy sauce that complimented it so well . They also cut the meat apart from the bones for the lazy people that don't want to pick bones out .  Their Shanghai (XLB) dumplings were so juicy and soft and perfect. Their clay pot rice was also really good . They gave us complimentary dessert which was stuffed sesame MOCHI balls with a wine soup . And it was one of the most unique tastes I had in a while . Although the alcohol taste was a little strong , it didn't take away from such a unique flavor .", "author": "Carmen V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "My favorite to-go place in the bay area, me and my boyfriend went there almost every week! Their customer service is amazing! David the owner is so wonderful and always care about how you feel about their food =D \nFood is the best Shanghainese food ever! Their XIAO LONG BAO is such a WOW piece!! When you come to SF you really need to come to this fantastic Shanghai restaurant!", "author": "Leon K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-31", "description": "Came here to eat, got served, then got out. Nothing exceptional about the food, but famished folks gotta eat. Took it with a grain of salt, actually lots of salt. Won't be back.\n\nPros: No wait time, friendly service, bright room, front door wide open\nCons: Food, server didn't ask us how the food was. No worries, I'll take it to Yelp.\n\nDimsum: \nShanghai eggrolls- Crunchy outside, mushy and tasteless inside...almost like a cannoli, only no flavor.\nPork dumplings- Served steaming hot on a plate. They looked boiled, watery.\nVegetable potstickers- Flavorless. It was the first time that I literally had to use the salt shaker and soy sauce together. Maybe I should've gotten pork.\n\nYang zhou rice: Salty, like it was bathed in soy sauce. Never had brown shrimp before. Everything was brown. This should've been served first to compliment the lack of sodium in the dimsum dishes.", "author": "Ana V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-14", "description": "This place was pretty good. I really enjoyed my sweet and sour spareribs 糖醋排骨. My BF thought his braised beef noodle stew 红烧牛肉面 was okay. My spareribs had a lot of small little bones so be careful if you order it but it was definitely Shanghai style so that's a big plus. His noodles were ok, there was more mushroom taste than there was beef stew so that sucked a little bit. \n\nThere were only two servers there so it was very hectic for them. I didn't mind waiting but we asked for rice three times before actually getting it so that docked off half a star and the other half for the mushroom soup instead of beef stew. \n\nI would definitely go back again to try out some other dishes they have. It's was pretty reasonably priced and they have fried buns. I want them fried buns so I'll definitely be going back!!!", "author": "Kimberly W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "Had the whole fish in sweet & sour sauce and Shanghai pork and crab dumplings. Really well executed and super delicious. Will come here to further explore the menu - great staff- timely food and a nice atmosphere. We felt we tended to by everyone here.", "author": "T M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-19", "description": "Two stars because the yelp coupon is NOT valid when they ask you to call for the 10% discount. It's dine in only. Even showed him that it tells you to call. Customers who call are calling to place an order not dine in. Food is ok and was on the way home. Nothing to write home about.", "author": "Melinda L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-15", "description": "Thought I'd give Old Shanghai a try in my neverending search for won ton soup that tastes like it did in my youth. Besides the won ton in supreme broth I ordered pork in ginger and garlic sauce and chicken with plum sauce. I didn't recognize whatever was floating in the broth so didn't even try it. I tried one won ton and tossed the rest. Inside was a mixture of ground pork and maybe spinach with absolutely no flavor at all. These definitely were not the flavorful won ton I long for. \n\nThe first bite of the pork dish had me more excited. The sauce was delicious, so it was a real let down when the meat turned out to be tough and dry. Some meat with a little fat on it would have elevated this to fabulous. Don't be afraid of fatty meat. The fats where the flavor, juiciness and tenderness resides. With different meat I'd order again and again. \n\nThe chicken dish was unfortunately dry as well with over cooked nuggets of thigh meat and too little sauce to bring some life to the dish. It's too bad because the flavor is there it just needs more care and more sauce. \n\nI would probably give this another try and see if they can cook without incinerating the protein.", "author": "Gail N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-15", "description": "Good spot for Shanghai-style comfort food.\n\nSome tips: Closed on Tuesday, can be slightly hard to spot, and parking is not easy (metered might be your best bet).\n\nThey start you off with black tea, and you can get ice water and other drinks if you like.\n\nFood includes dim sum, of which we ordered a wonton soup and meat pastry, as well as traditional Shanghainese fare. The pastries were highly regarded, though they took quite some time to come out.\n\nAs for more substantial food, we had the pork shank, rice with salted pork and vegetables, tofu strings, freshwater shrimp (which wasn't actually freshwater), and bamboo and shredded pork with vegetables. The two pork dishes were probably the best choices, though all were good.\n\nStop by if you're in the area and need lunch.", "author": "David Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Found this place on Yelp last night and ordered pick up. It would be great if they delivered too because everything was delicious! \n\nTwo orders of dumplings with pork and veggies. \nOne veggie fried rice. \nOne hot and sour soup.  \nMixed veggies. \n\nAll amazing and hit the spot. All the vegetables in the dishes tasted fresh. \n\nWhen I picked up the order I noticed they have a nice dining room so we might come back and eat that the restaurant next time!", "author": "Alison C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-13", "description": "This is a very poor restaurant。\n1.The page is very crowded\n2.The quality of food is very poor\n3.The price is very expensive\n4.It is the Shanghai restaurant, it feels like northeast food。\n\nAnyway, I suggest not to eat in this restaurant，Or you will regret the rest of your life.", "author": "Jun L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "I am was born in Shanghai lived in Fremont we drove one hour to come be here for dinner.  Although it was a long drive, every dish we had was breathtaking and delicious.  If you like shanghai style  this should the best place. 噶好吃. True authentic SHANGHAI!", "author": "Kathleen X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-08", "description": "It's an ok spot. Not my favorite, but good enough to come back. Noodles are good and if you like spice, it hits the spot. \n\nSoup dumplings are alright, not the biggest fan of little tins holding the dumplings. I generally struggle with them as they sometimes pop the dumplings. Flavor is good though. \n\nThey have a big variety of foods on the menu.", "author": "Angela N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "Very authentic food. We like the home cooking and fast service. Parking is tough and the wait staff is too busy to take good care of you, however. The food makes up for it. We had salted pork with tofu and bamboo shoot soup, stir fried shrimps ( no shells), smoked fish, Xiao Lung Bao, preserved mustard green with tofu, meat balls with bok Choy, all good but the smoked Duck although flavorful but no meat to the duck.", "author": "SJ L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "The best Chinese food in San Francisco. \nThe food is unique delicious and fresh. \nThe service is amazing and incredibly friendly. This is all around my favorite place. Having lived in Shanghai for three years this place is as good as it gets in terms of authentic Chinese food!!\nFavorites include: fried small fish, soup dumplings, wonton soup, all the specials, all the dim sum, rice cakes", "author": "D H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "Arrived at 9:05pm, glad they let us in since they were about to close (9:30pm).  Ordered our food in 3mins. Got our delicious meal in less than 10mins. Finished eating in less than 20min. Not the best way to enjoy our meal, but it was our fault to get in so late, any they were accommodating. \n\nFood tasted good, not what we are used to Vancouver.  Ordered: 小籠包，獅子頭， 擔擔麵， 上海雲吞。\n\nOverall, a good meal and service.  Will need to return another to try the not so standard dishes (^o^)v", "author": "Sum 1."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-10", "description": "Came here for lunch and I ordered the following:\n\n-Tan Tan Noodle Soup w/meat (just OK / little over cooked)\n-Sauteed Eel w/Chives (disappointed because way too sweet)\n\n*Friendly servers", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "Family was in town! Review for weekend brunch.\n\nReally great service. We had 2 tables and they got the food out quickly. \n\nFood:\nHorseradish puff - a little salty\nPork in puff pastry - really good tastes of the salty and sweet ingredients\nShanghai dumplings - fresh \nTaro root pastry puff - this is for dessert, came out nice a hot! Soooo tasty!\nWine braised cold chicken (appetizer) - a little too much wine for me during brunch time. I would order this for dinner instead.\n\nWill return: yes!", "author": "Mary H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-26", "description": "Truly delicious Shanghainese food! I have never had to wait to get seated. We always order their XiaoLongBao (XLB), bamboo shoots with pork and leeks, and sweet and sour spare ribs. The XLB are some of the best in town. Skin isn't too thick but still holds the juicy soup inside. The bamboo shoots are absolutely delicious and my favorite. It's a little pricey here but definitely a treat!\n\nService is very courteous and attentive and  the place is cleaner than your typical chinese restaurant.", "author": "Henry P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Best Chinese food I have ever had in my life!  I'm reluctant to say this because I don't want a million people to find out about it\n\nBut the food is absolutely phenomenal!!", "author": "Jan E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-14", "description": "HORRIBLE. Made a reservation on Yelp for Mother's Day and they did not even know that took reservations. Made my pregnant wife and four year old wait over an hour. Horrible staff. One guy running around like a chicken with his head cut off trying to manage the place. Two servers that acted as seating hosts and cashiers as well. Very disorganized. People not getting their food. Peoples orders not being taken. A total disregard for the customer. Regular food doesn't make up for a crappy dining experience.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "Very authentic. I've been to so many Shanghainese restaurants in the Bay Area, and this is THE PLACE. Good food, classic songs, and old fashion posters. Really feels like being brought back to Shanghai in the golden old days... Approved by all my Shanghainese friends and their parents. \n\nUpdates:\nJust came here with my boyfriend tonight. Excellent service again of course. Taro pastry took us right to paradise. Highly recommend the rice balls and the special soup with salted pork!! As for the taro pastry, it's always one order for here and another one to go for tomorrow :D", "author": "Maddy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-22", "description": "We decided to come here for a second try last weekend after a long break from our first visit a few years ago. \n\n*Restaurant decor: 5 stars, very clean\n*Staff: 5 stars, couldn't be nicer and attentive\n*Food: 3 stars, we haven't had Chinese food that was so bland...\n\n1. Fried Rice cake: Looked so yummy, but when you actually eat it, it was very bland and underwhelming. We felt bad, when the server wasn't looking, we poured soy sauce over it to try and give it flavor. \n\n2. Kung Pao Chicken: Again, presentation looked super appetizing. But when you eat it, there's a strange (underwhelming) sweet flavor to it. They use a dark sweet-ish sauce that was just ok. Looks good, but little taste. \n\n3. Shanghai Soup dumplings: this was the best dish. There's definitely more meat in the dumplings than other places, and they were pretty good. Best Shanghai dumplings? No, but still good. Just had very little soup when you bite into it. \n\nIt was a really nice looking restaurant, and would have considered it for my mom's bday. But the food was really lacking in flavor. Not sure how authentic it really is. Maybe we just ordered the wrong dishes?\nAfter our  2nd try, we're sad this isn't a staple for us as we live in the neighborhood :(", "author": "Minh D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "Fast food pickup through an yelp 24 online order. The spicy wantons were inexpensive and delicious! The hot & sour soup was solid too. We actually added some of the spicy wantons to our soup and double goodness was the result. The shrimp fried rice was also a winner, however the Mongolian Beef, though the flavor was great, could have been cooked better(overdone). I'll be ordering takeout from here again.", "author": "Dutch S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "The food is fast and fresh. I see the cool making the dumplings and serving them non stop. Everything on the menu is tasty. Always great customer service.", "author": "Maggie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "Restaurant was very accommodating on Saturday for late lunch at 2pm. my group of 18 people arrived when they were closing the kitchen for lunch at 2:30pm. We decided to come here last minute after we went on a hike that went a little longer than planned. I cannot remember what 8 dishes we ordered for my table, but the ones I recalled are:\n\nShredded Turnip Pastry was quite excellent and stood out to all of us. It was crispy, hot, good texture with meat, turnip and was quite tasty. I would order this again.\n\nXiaolongbao or  Shanghai Steamed Dumplings w/ Pork was okay to me. It didn't have enough liquid with the dumpling that I would have liked, but that is my personal preference. I wanted more flavor from it and skin was a little thicker than I am used to as well. Served hot, got to wait till it cooled down first. It is always a first love when I lay my eyes on a lovely Shanghai dumpling. Such a pretty presentation all self contained and wrapped in a ball of goodness...sorry getting off topic.\n\nBraised Pork Shank was impressive looking if you look at the photo a previous Yelper posted. The waiter help get a spoon to break apart the meat off the bone so it would be easier for us to eat. It was good and well cooked with a nice dark brown soy sauce over it. \n\nThe Mongolian beef, I believe this dish was spicy, but meat was tender. So if you want some heat to your food, you will enjoy this dish. I had to grab water!\n\nDried Mushrooms with shanghai green vegetables was what I order and I enjoyed it, cooked to perfection and great combo ingredients. Yummy in my tummy! \n\nI don't recall the exact name, but we also had a boneless chicken with ginger oil. It was a small dish where everyone got a bite. It was ok and dish didn't really stand out with flavor. Just normal.\n\nWe had a spare rib dish, which I was not used to seeing in this presentation called Wu Xi Sparerib with red fermented soy bean sauce. I was not used to seeing the ribs in red sauce. But it is soy bean sauce on it which had good flavor. Interesting dish. \n\nI think I pretty much covered most of the dishes our table had that I could recall. The other half of my group ordered a cool looking deep fried fish dish. Presentation was really cool as you can see from the other Yelper's photos. \n\nThank you for reading if you got this far. Feel free to click it if you feel this was useful, cool or funny for you. I realize now that Taking photos will save me so much time from writing!", "author": "Priscilla L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "We were looking for something new  to eat and we decided on Chinese. \nI love this place.The food was great and we beat the rush at 6pm Sunday night. We had the chow fun special, dumplings, and Mongolian beef. All were great! You even  get tea with your meal. Service was fast and everyone was very attentive to our needs. The only thin I would worry about is that it can get really packed that it is boarder line a fire hazard.. It was a little difficult to get out.", "author": "Truly P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-28", "description": "Food:\n-Xiao long bao, surprisingly good, the soup dumpling skin was perfectly thick/thin, and there was actually a decent amount of soup in the dumplings\n-Salted duck, zero flavor, pass\n-Kao fu (chinese wheat gluten) and woodear, sponges full of grease with like 2 small pieces of woodear, pass\n-Sigua and you mian jing (luffa and chinese gluten puffs), came in a pot and burned my tongue, but other than that it was poorly executed, some luffa pieces were not peeled right, pass\n-Eight treasure glutinous rice cake, poorly done, more like eight junk with the cheap-looking and cheap-tasting ingredients stingily scattered over the top layer of bland glutinous rice dome, and especially for $9, pass pass pass\n\nService:\n-Good for a chinese restaurant, which meant no one seemed mean and no one checked on me during my meal either; old chinese guy who served me did seem nicer than most, and also ran after me when I apparently dropped a credit card\n\nMisc:\n-While I'm all for instant gratification, all the dishes came out surprisingly/suspiciously quickly..\n-Overheard a woman on staff comment on some greasy dish \n-Bathroom was horrifyingly disgusting and really close to the kitchen with its door open. I wanted to take a shower (and cry) after I came out of the bathroom.\n\n\nOverall, quality of the food didn't justify the slightly premium price point compared to similar restaurants around the area. However, would go back for the xiao long bao.\n\nStill surprised at how they managed to excel on the xiao long bao out of all things, like an asian kid who fails at basic algebra but beasts differential equations.", "author": "Tian Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "Simply fantastic. Authentic with choices for a more cautious palate.  We especially enjoyed chicken in plum sauce and also the tofu chicken with vegetable. Oh and the melon soup with Bamboo shoot was brothy and delicious .", "author": "Peter P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-08", "description": "Ordered soup dumplings, which tasted store-bought, and didn't have soup in them. Also ordered the princess chicken, which was 80% peppers, 20% chicken. Rice cakes also didn't have much meat, and portion size was pretty small.", "author": "Betty H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "I've been here twice now and it's my new favorite spot for dumplings. We ordered the pork and chive dumplings, shanghai pork dumplings and the pork buns. All SO good, but the pork buns are to die for. Service was great, timely, and the owner is so sweet. There was a misunderstanding with our order and he comped it when he totally didn't need to. Will be back many more times!!", "author": "Erin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-29", "description": "Having come here for dinner a few weeks back with Jean Y, my thoughts on Old Shanghai pretty much mirror hers exactly. Being a Shanghainese restaurant, we went with some more traditional dishes, including their:\n\n* Shredded Turnip Cake - Not bad at all, although I'm accustomed to eating turnip cake that's a bit more finely shredded. And, strangely enough, their turnip cake actually has meat inside (not a bad thing, just, unexpected).\n\n* Noodles with Fried Green Onion Oil - Probably the best part of the meal, these were simple, greasy, and quite tasty.\n\n* Xiao Long Bao - I'm starting to see a trend with most of the XLB I've had in SF: they're all a little too sweet, and Old Shanghai's was no exception. Their dumpling skin is also a bit on the too-thick side, but, hey, at least they're nice and soupy.\n\n* Sauteed Pea Sprouts - Not bad, but much more expensive and tougher than pea sprouts should be.\n\n***Accessibility Info***\n\nVenue - A spacious enough restaurant that accessibility shouldn't be an issue.\n\nBathroom - Didn't check them out.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-07", "description": "Vegetable chow mein - a great dish. Coocked perfectly. A delight. \n\nSweet and sour shrimp - delicious. The sauce was perfect. \n\nCashew shrimp - completely different from walnut shrimp. It was just small shrimp in say sauce with some green peppers. Nothing special. \n\nService - slow. Tea was luke warm.", "author": "Juliana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-26", "description": "authentic Shanghai food ！ yes, so delicious and  authentic! This is one of the classic shanghainese food in SF.. Have to say their dumplings are excellent and other small dishes are so yummy,  clean and spacing tables makes a big difference from other small family own dumpling Shanghai cuisine places.  Will be back soon to try more dishes.", "author": "Betty L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "Came here Saturday night for a quick takeout dinner. The inside was surprisingly quiet, with just a few diners - looked very much like a local crowd, probably older Shanghainese transplants nostalgic for the food they grew up with. I got XLB, Shanghai Rice Cakes (vegetarian version), and Mongolian Beef.\n\nThe standout was definitely the Mongolian Beef - very tender, thin slices with a nice heat to it. The XLB filling was a bit on the sweet side, which I found weird. And the Rice Cakes were standard but hit the spot (I got this without the pork). I'd like to come back and try their other dishes and see if the flavors are as I remember them as a kid.", "author": "Susan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-22", "description": "Pretty good food. The lemon chicken was excellent. We had a few other dishes as well which were good, except the beef dish. The beef sauce was too sweet and the reconstituted mushrooms were awful...and I LOVE mushrooms. I'm pretty sure we also got the wrong beef dish. The waiters were very nice, but we also sat for a long long time waiting for our bill. Aside from those things, I'd come back here for sure.", "author": "Zoeboe D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "This and Taste of Jiangnan are the two best Shanghai restaurants in the city. As a Shanghainese who lives here, I've been searching two years for authentic food away from home. The owner is also from shanghai, speaking our dialect to the customers. Man, I miss home.", "author": "CX X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-04", "description": "5 stars b/c MEAT BUNS. Shanghai style flaky, buttery pastry with pork meat inside. HONESTLY HEAVEN. I've been looking for this for years in SF and today it happened!! Ahh! Also their XLB (especially w/ crab meat) was perfect and soupy, the vinegar sauce was perfectly tangy with lots of julienned ginger.", "author": "Allison L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "Excellently authentic Chinese cuisine. The XLB feature tons of meat, very balanced flavour - could have been a bit juicier, but the large portion of meat makes up for it. Definitely coming back!", "author": "Jordan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "Food is good. I love their mini wonton soup, their \"xiao long bao\" pork dumpling aka little dragon dumplings, and also a fan of their \"nin gao\" stir fried Shanghai rice cakes. A bit of authentic Shanghai spot. The shop owners could work on the ambience and upkeep of the place better.", "author": "Audrey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "WOW. This is legit OLD SHANGHAI food. It's what you would go look for in actual Shanghai if you wanted 本帮菜(benbangcai, aka shanghainese food before the Western culture erroded the authentic cuisine with their dirty Imperialism) My friend from Shanghai nearly cried because she said it tasted like her grandma's cooking. So if you want AUTHENTIC SHANGHAI FOOD, this is a must!!!\nWe ordered the 荠菜冬笋（wild greens with winter bamboo sprouts), the  笋干红烧肉（soy sauce braised pork cubes with dried bamboo sprouts, OMG SO GOOD), and the 腌笃鲜 (winter bamboo sprout, tofu skin and ham stew, THE BEST DISH OF THE NIGHT, SUPER UMAMI!!!). When we paid, they gave us free 酒酿汤圆（sweet rice wine and sesame mochi) and they were so generous with the sweet rice wine!!!!!\nAnyway, great dining experience, the owner came and asked us about how the food was himself :) If you like Chinese food and really great Shanghai food, this place is the best choice!!!", "author": "Phoebe W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-29", "description": "I've been to a number of Chinese restaurants and could not even imagine that Chinese food can be as bad as in this restaurant. Sweet and sour  Spare ribs were neither sweet nor sour and there were only bones, we could not find any meat. Maybe it was cut off the ribs before cooking. Minced beef with noodles was a disaster too, noodles overcooked and there was no way to separate them, they were all stuck together. As for the beef we hardly found any in a dark brown sauce. Beef fried rice was not good either, rice was overcooked and had no flavor but was very greasy. Out of all food dumplings were okay, but just okay. Maybe we came on the wrong day, but I will never go there again and do not recommend this restaurant.", "author": "Elena M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-06", "description": "Xlb is bland.\nThe mystert meat inside tasted and looked like scraps... think gizzard heart etc..  \nIt foamed pink out of the top of the dumpling. \nIcky... \nNot quality.. not tasty\nBetter Xlb in sunset district", "author": "Dubl A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-08", "description": "The worst Shanghai food I ever had. Their Shanghai steamed dumpling(xiao long Bao) the skin is too thick, the meat is dry, no juice at all. The Drunken Chicken is the worst of the worst ,no chicken favor, the wine is bitter, and the chicken meat is dry and frozen inside. last, The Braised pork Shank. How is that possible the Braised pork Shank brought to my table before the cold dish(drunken chicken)? I can't use any word to describe how awful that Shank taste. Is frozen inside again. A Shanghai restaurant name them self Old Shanghai can't even make that 3 signature Shanghai food right there is a problem. Maybe I went there in a wrong time.", "author": "Yan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "This place is extremely authentic. The food is fantastic and it was very quick and inexpensive. Know upfront that you'll have to order off of a picture menu because the staff doesn't speak English but that's OK, they were very accommodating and pleasant. Doesn't get much better than this for a quick lunch.", "author": "Joshua S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-29", "description": "Food was a little bland.  There are definitely better shanghainese restaurants with xlb.  Recommend skipping.", "author": "kyle c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-13", "description": "Generally average food. Most of the items we ordered were underwhelming as other reviewers mentioned. Restaurant is pretty nice inside though.\n\nWhat we got:\n\nKao Fu - This was the standout dish. It was really good, the wheat gluten was soft and perfectly marinated in the classic sweet-ish sauce. It was complemented perfectly by an assortment of mushrooms, peanuts and lily flowers. I haven't enjoyed such a good version in a while.\n\nYang Zhou Boiled Bean Curd - Really underwhelming. There was too much liquid and the flavor of the seafood/meat didn't seep at all into the bean curd. Also seemed under salted. All in all, came out kind of bland tasting.\n\nWinter Bamboo Shoots & pork & vegetable - it was supposedly a special/seasonal dish, but I was not that impressed. Also kind of bland tasting, and the winter bamboo taste didn't shine through.\n\nSmoked Ham, Salted Pork with Bamboo Shoots and Soy Bean Sheet Knots - Ugh, this was very disappointing. The soup was not super savory and actually had this very weird sour-ish aftertaste. The bean sheet knots were kind of tough as well. \n\nSo all in all, nothing impressed us except the Kao Fu. Which was really really good.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "Enjoyed dinner here tonight. Fast and friendly service. \n\nXlb: Delicious. Skin could've been a bit thinner but still good. Good flavor and just enough juiciness. \n\nSpicy wonton: Good wonton but this wasn't spicy. Not enough chili oil and served with peanut sauce, which isn't what I am used to with this dish. \n\nWinter melon soup: tasty\n\nBraised pork shank: super tender and delicious. Yum. \n\nWe will be back!", "author": "Melinda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "I came here on Mom's day. As a Shanghainese，my mom thinks the taste here is better than many Shanghai restaurant in Shanghai。I also love this place。The price is lower than last year！Try it！", "author": "菁菁"}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "This is the best Shanghainese food I've ever had here in the States. It is authentic. The flavors are spot on and true. The textures are divine. If you're looking for spicy - go get Sichuan. If you're looking for dim sum and hot mustard go get Cantonese. Old Shanghai, please don't change how you spice or serve your dishes. You're perfect. Well done.", "author": "Julia Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "This place has legit traditional shanghainese food. Their price is fair, and the service is excellent. Looking forward to bringing friends back.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "This is a truly authentic and high quality restaurant for Shanghai cuisine. All the pastries, XLB, dumpling, and desserts are home made. They are not only fresh but of excellent quality! What is worth noting is the kindness and good service of the restaurant staff. The recommended dishes are so good! We are too much but enjoyed every morsel!", "author": "Hanna T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-20", "description": "Some of the worst dim sum I have had in SF. Do yourself a favor and order elsewhere. Super bland and unauthentic dishes. Wonton soup tasted like cabbage and water, sesame buns were normal bread on the outside, apparently thats the \"old\" way? Some places in this city are such a scam for people who don't know any better unfortunately.", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "Another trip to this place in search of the taro pastry and steamed dumplings. Doesn't matter how many times we come here, everything is always so good. The owner is one of the nicest guy you will ever meet. Good food, good people.", "author": "Ji R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-04", "description": "I don't know why YELP kept saying this place is closed and have to start a new review section for the same restaurant. Anyway I have been coming here since early 2000s and I still think this is the best Shanghaiese restaurant inside SF. After the remodel the place looks a lot better than before. The wait staff are still the same, they are very nice and friendly. \n\nFood are always tasty and we always order the steam dumplings they are the best! Pretty much everything on the menu are good. Their shanghaiese dishes are pretty authentic. Try not to come too early on week or weekend nights, they signed some sort of deal with tour companies as the result they send tour groups here forearly dinner every night and it can be loud and crowed.", "author": "William C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "xiao long bun was good\nsmoked fish and noodle was ok", "author": "Diane W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "So to be honest, we only came here because Shanghai Dumpling King was closed (Tuesdays!) and a friend probably just wrote Shanghai in Yelp, found this place, and we moseyed over from the richmond.\n\nI arrived before my friends, saw a sign on the door that said Tuesday - Closed and an empty restaurant, and my stomach started closing in on itself, but I poked my head in and discovered they were open! (still empty... but open was good enough).\n\nAnyway, it ended up being awesome. The food was great, but the highlight was the service, which was awesome in the general attentive way but also included:\n\n1) The staff being REALLY nice about us having our own beer (Dumpling King is BYOB, this place isn't, but for us, they were)\n\n2) A simple question of 'How do you make the soup dumplings?', turned into a 15 minute tour into the kitchen for our entire party of 5.. so we got to see the dumpling making and wok-age up close and personal. Very sweet and cool.\n\nSoup dumplings and thick noodles were my favorites. Highly recommended.", "author": "Jake D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-19", "description": "Best shanghai dumbling in sf.\nPpl are nice. Food very consistent and always good.\nWill come again for more.", "author": "Kirk L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-07", "description": "Old Shanghai is my favorite place for xiao long bao (or soup dumplings) in the Bay Area. Yes, the entire BAY AREA. I have yet to have a better xiao long bao anywhere and I've tried a lot of places. My other favorites are the savory soy milk, glutinous rice shao mai, Shanghai greens soup, rice cake with Shanghai greens and bamboo shoots, pan fried bao, turnip pastries, and ham hock and bamboo shoot soup. I've only been here for brunch/lunch, not dinner. The servers are super nice and sweet. The downstairs area is a little small, so be prepared for a wait on the weekends.", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-21", "description": "I really really wanted XLB and other types of dumplings and was headed to Taiwan on Clement, but found that Taiwan was closed for whatever reason.  So, I hopped on Yelp and found Old Shanghai just a few blocks away on Geary. \n\nThe interior decor was very clean and modern.  We didn't expect the upscale decor considering the outside made it look like an old school sticky table Chinese restaurant!\n\nAll of the patrons on this Friday night (630pm) were Asian and the waiters spoke mainly Chinese so we knew this place would be legit!\n\nOrdered the XLB and 3 other dumplings.  All good.  The lion's head meatballs were delicious!!  We also had the napa w shredded pork and it was too peppery.  The shrimp in the shrimp tofu was overcooked.  Needless to say the napa and the tofu were brought home and not devoured on the spot.\n\nNext time I'm craving authentic Shanghainese food, I'm going to Old Shanghai!", "author": "Sandy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-27", "description": "Finally found a place that makes good shanghai dumplings in San Francisco.\n\nI really enjoy going to shanghai dumpling shop in millbrae and this place is just as good. Price here is a little more expensive and their thick noodle beef chow main is a small portion for what you pay.\n\nI'll come here when I don't feel like driving.", "author": "Stanley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-20", "description": "Its the place where shanghai tourist come to test the taste of home. Been coming here for the past 2 years. I'm fan of all their noodle soups in clear broth. My frequent one is the minced pork & chopped sea crest. Most restaurants I don't drink their broth b/c it dries up your throat afterwards due to their high amounts of MSG. The broth does not do that for me. The XLB has the right amount of resistance when you bite into it & the tasty broth that spews out after slurping it w/ the naturally brewed dark vinegar as opposed to the red vinegar from the spoon. They have a good stir fry noodle & the green onion pancakes. Comfortable table setting w/ classic table cloth. Superb service from the waiter to the host. Tea refill is consistent & any request is met w/ precision. A bit of history. This was the location of Mike's Cuisine, the 1st Chinese Restaurant in the Richmond District.", "author": "M L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "Came for some dim sum. Not too crowded at 12 PM on Sunday, Jan. 29, considering the Chinese New Year celebration. Service was excellent and the taro pastry was soooo delicious. Will definitely be back to try other dishes.", "author": "Jo Ann L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-02", "description": "For those who were raised on Shanghai-nese food, this is as authentic as it gets.  Sadly, the ownership had switched, but still, worth trying again.  You have to know what to order--specifically, the shanghainese dishes.  Otherwise, it's a bit like getting mac & cheese at a BBQ joint.  May not be bad, but certainly not the point.\n\nOrder the ti-pang/pork belly, the lion's head, and drunken chicken.  A local, authentic, non hipster restaurant is worth supporting.", "author": "Jay C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-24", "description": "There is no one to text while I am on the bus at 7 30 am in the morning so I thought I would write an mediocre review for a mediocre place. \n\nGrading scale:   .    Period means meh\n                          !     Exclamation mean omg delish. \n                          ?    Is this food ?\n\nWas here for a family dinner and ordered about 7 items. \n\nDumplings : .\nBraised pork : !\nPork shank :   .  $$$\nFried fish :  ?????$$$$$ \nBamboo soup :  . $$$$\nPumpkin cake :  .\nHalf duck:   ...$$$$$. ( they actually gave a quarter )\n\nOverall place was expensive and serving was small. Nothing too special.", "author": "Lily T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-27", "description": "Radish turnip cake.  This is the third time trying it.  My wife wanted to give it one more try especially since the last two times was real bad.  What happened was that the radish turnip cake was raw inside.  They did not cook it thoroughly.  So this time around it was cooked well enough but now real salty.  There other dishes are ok so caveat emptor.  Will not be coming back anymore.  So sad.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-25", "description": "March 22, 2015 around 1:30 pm, my family went to Old Shanghai for lunch, but it wasn't until couple days later that we wanted to throw up. \n\nThe food and service were average, we order four courses (duck, fish, veggie, xiao long bao), which totaled in $85.25. My whole family has been working in different Chinese restaurants, so we know that it is higher than average, but we didn't argue with them. We paid $90 on our credit card (including $4.75 tips) and additional $5 cash for tips. Yes, so what we were not a big tipper. \n\nNext day, we checked our bank statement and found out that Old Shanghai charged us $100! We were all disgusted about it. Even though we were cheap in tipping, this is still unacceptable. \n\nI don't care if this is a mistake, ($90 and $100 are such two similar numbers), it is the restaurant's responsibility to make correct billing. Secondly, I strongly do not suggest people to dine here because you can get better Chinese food for a cheaper price else where. If you have to eat here, KEEP YOUR RECEIPT!", "author": "Jake Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-20", "description": "I know there are many guides that put this hole-in-the-wall place as one of the top 10 must eats of the east bay. Well, I have news for you, it's not. In fact, beneath the plebeian appearance of the restaurant lies very below average shanghainese food including noodles, wrapped rice (Zhongzi), and Shanghai-style dumplings (XLB). Check out SF or South Bay for more legist shanghainese food, its clear that the owners here have given up. Additionally, and this goes without saying, the guides don't know what their talking about.", "author": "John Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-23", "description": "One star for the nice environment inside compare to other chinese restaurant.  I tried this place years ago, it was ok, nothing wow though.  I went to this place again yesterday,  it was awful.   I am a Shanghainese, so I know what's an authentic Shanghai dish should taste like.   I had wonton soup, it was very dry and old.  I think it's been in the freezer for a long time.  I can't even chew the meat.  God knows what they put inside. The savory soy milk was so salty.  I am so disappointed at this place.  No wonder this place is empty during lunch hour on a Sunday.", "author": "Lucy J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-10", "description": "I've eaten at Old Shanghai years ago when it was a good Shanghainese restaurant and decided on a return visit only to be highly disappointed. Here's the main rundown:\n\n1. Food was bland. All the food ordered was the same color. \n2. There was a taste of old cooking oil in the food. \n3. Shanghainese dumplings are a barometer of Shanghai food quality, and the Xiao Lung Baos here were simply not good.\n\nSorry to say but it'll be a long time and a change of ownership before I return for another try of Old Shanghai.", "author": "Denny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Still a fan after all these years. This location was the old Mike's Cusine. 1st Chinese restaurant in the Richmond District. The handsome young manager w/ the glasses all these years I thought his name was James & actually its David as I read some of the other reviews. Sorry!  The food is still good authentic Shanghai at its best. XLB, dumplings, pot stickers. I personally like a strong brewed dark vinegar w/ my bite size dishes. Most restaurants dilute their vinegar w/ water to stretch out. Shanghai dumpling King on Balboa does that. Shanghai tourist come here to get their fix. One thing that stands out is the staff is very polite and well mannered. I've been to some 5 star Chinese restaurant & bad manners or impoliteness is a real mood killer. They take the time to listen as opposed to talking. Not a big restaurant, medium size. So noise level don't echo like some of these big restaurants. Of course like any restaurant once the big tables get filled & people are laughing, enjoying their meals then the noise is inevitable. Happy sounds as opposed to clanging dishes or staff disputes ......... Thank You David & your wonderful staff.  Still good so don't move or do any big changes.  I'm not ready to let you go yet ........ I also love all of the pictures of my Shanghai girlfriends on the wall .... gives me something to look at when I'm bored or other than my wife. LOL! Is my wife behind me? Holding a knife  or scissors?", "author": "Stevie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "came w/party of 3 @6.50pm on a tuesday night; pretty empty and spacious until 7:30pm hit!\nwe ordered 2 orders of the soup dumplings\none tray of 10 dumplings\n1 veggie dish\neverything was meaty and delicious, they could have a little bit better service.\nfriend came with a bike and yang, the manager even let him store it inside the restaurant!", "author": "Karl L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-16", "description": "Pretty good standard Chinese food. I had the Yang Zhou fried rice, which was pretty good. The xiao long baos, I wish were more soupy. I've had better in SoCal. The dumplings were plump and delicious. I really didn't like the green onion pancake. It was a little thicker, so it was more breadlike. I prefer ones that are more crispy. The green onion pancake was about a 3, and the rest of  food was about a 4, so 3.5 stars.", "author": "Arnold W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-26", "description": "We were in the mood for Chinese other than takeout obviously and came across this place since Chinatown restaurants were closed at 8pm (weird!). The wait staff were really nice. The food was absolutely delicious!! We had Mongolian beef and beef fried rice, which was a phenomenal option. I also had a small serving of wonton soup, which was good but not the type of wonton I'm used to ( I think they include seaweed in them) but still tasty. I would def go back to this place the next time I visit San Fran and in the mood for good sit down Chinese Food.", "author": "Katherine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "Our favorite place for Shanghainese \"dian xin\" on Saturdays and Sundays. The xiao lung bao are delicious, but they also have excellent sweet sticky rice dumplings, boiled jiaozi, and the best vegetarian dumplings in the city. I love their salty dou jiang (soybean soup) with you tiao...have to have it.  If you don't know what to order, the owner will help you with good recommendations.  Check out the daiky regional specials!!They serve an amazing dessert of sweet black sesame dumplings in rice wine soup for dessert that is a revelation.", "author": "Ronna J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-01", "description": "I would give this restaurant a 3 1/2 star. I came here with my mom and grandparents for lunch. We got the Yang Zhou fried rice, xiao long baos, chow mein, and noodle soup. The prices for the dishes range from $10-12 each plate. The dumplings were $7.50 for 8 of them. The fried rice was a little bland but not bad. The Xiao Long Baos were nice and hot. The chow mein was a little bit dry, but maybe that's just how it is. The food came out pretty quickly and there were only two people running the whole restaurant. I would say the reason it is only 3 1/2 is that the food is pricey. There are some alternative restaurants with the same food but much cheaper nearby. It was also pretty chilly in there.", "author": "Jordan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-29", "description": "I came here with my family to eat some XLB because shanghai dumpling king was closed. This place is alot cleaner than the other shanghai restaurants that I have gone to. However, the prices did not justify the taste of the food. I thought the XLB wrapper was too thick and my mom complained it wasn't as good as Shanghai Dumpling King. The place gets packed with tour buses from Hong Kong or Shanghai , which help fill up the restaurant. Service was quick even though the restaurant was completely filled which gives them a plus star. But ill probably stick to shanghai dumpling king for my XLB.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "authentic Shanghai's dishes , fresh , verge dumplings are excellent...we will bk again", "author": "Jeanette W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "My husband and I have been to Old Shanghai many times. we are both born in Shanghai. It is the one of  most authentic shanghai cuisine we have been tried so far in San Francisco. The food is tasty and always keep consistency, the price is fair, the service is good too. We most love their Crispy fried yellow fish with vinegar dipping, drunk chicken, pork belly cooked with dried bamboo, meat ball stew in a clay pot, spicy fish head ( you must make reservation for one day in advance, not for their regular menu). Their dessert soup: rice wine with black sesame dumping is our favorite. Don't just look at their regular menu, ask their waiters for recommendation before you order.", "author": "Tina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-27", "description": "Sweet and savory soy milk. XLB. Lionhead meatball soup. Wonton in Chili Oil with sesame paste for good measure. If you're craving a Chinese brunch, Old Shanghai will get it done. Tons of authentic dishes. Great setting for families.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-29", "description": "We ordered 3 dishes and they go two out of three wrong.  The special Chow Mein was supposed to have Beef, BBQ Pork and Shrimp.  It came with Chicken instead of BBQ pork.  The seafood crispy noodles had no seafood. It took 10 mins to flag down a waitress to point it out.  She got the owner who ended up comping our meal which was the right thing to do.  What we had tasted wasn't very good.  Not a good experience.", "author": "Jerry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-14", "description": "I've to re-post my message as my review on Oct 8 was posted on the old yelp which shows the restaurant was closed!!! Needless to say... this a definately a restaurant that must try!!!!\n\nI had such a wonderful diner with friends tonite.  Old Shanghai was recently renovated since early August 2012 and now the two stories restaurant have a room on the 2nd floor for private party.  It's not a typical chinese restaurant in the city but it's a local's jewel.  The place is clean and tidy, people there are nice and sincerely, and the owner is friendly to povide good recommendation to suit your dining preference.  They've authentic Shanghainese food, yet without the heavy seasoning and greasy feel.  Food is delicious and delightful.  They have wide varities of shanghainese appetizers & dishes: my favorite is the \"Smoked Fish\" and \"Pig Ears\" (if you know what I'm talking abt), authentic \"Xiao Long Bao\" are delicious and juicy, \"Crystal Shrimp\" and \"Sour Fish\" are favorable, \"Vegetable Clay Pot Rice\" is refreshing, and a perfect ending will be to have the \"Rice Ball Sweet Soup\" for dessert.  The food we had tonight were so good that we can't wait another minute to finish picture taking, but immediatly pickup our chopsticks to eat!!!  I'm a big fans of Shanghainese food, however, the bayarea does't have much of such type restaurants really consider \"Good\"!!! This is the very \"Best\" one in the bayarea and I'd recommend everyone to go try!!! The owner/chef are very flexible and they're willing to take special request on the menu, given that you let them know what your preference ahead of time (Give them a call).  I'll definately bring friends, families and colleagues to dine there again!!!! Thank you for the YUMMY FOOD!!!!", "author": "Vickie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "What a gem we found! Very authentic Shanghainese dishes which were approved by two native Shanghainese. I will definitely come back for its drunken duck, vegetable clay pot rice, roasted pork (hong shao rou) in the future.", "author": "Nina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "Still the best Shanghai restaurant in the City.  We are regulars and are offered delicious desserts.", "author": "Laurence H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "Very good restaurant. It is very traditional Chinese food. I really love it. The owner of the restaurant is super nice. It's an awesome place to go!", "author": "Poppy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-19", "description": "As a person who originally come from Shanghai. I think this restaurant is authentic.  Shanghainese food are not that oily and strong. They are more blended but they shows the real taste of the material. I miss my hometown.", "author": "Kang N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-24", "description": "I decided to check this place out because I was craving soup dumplings and didn't want to go all the way to Shanghai Dumpling King. The soup dumplings were ok, but everything else lacked flavor and smelled a little sour. I was worried I would get sick so I didn't eat two of the entrees I ordered. For the high price this wasn't worth it. Very disappointing.", "author": "Jess S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "Holy shit, I don't even know what it's called, but I had the best flaky meatball pastry in San Francisco here.", "author": "Jimmy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "first, i loved our waiter because he was super friendly, nice, and....wearing pajama bottoms. awesome.  \n\nnext, if you're trying to find a good chinese restaurant, Old Shanghai is one of my \"go to\" places in San Francisco. it's authentic, flavorful and delicious -- but the portions are small. that's the only setback! i love the spicy eggplant, pressed duck, xiao long baos, and tofu with Edamame. the winter melon soup was mediocre, so i'd skip that next time. \n\nfinally, i still think LA has better chinese food than SF, but this place isn't bad. i think it's one of the better places in SF that you'll find for chinese food. it's semi-expensive for the portion sizes, so just keep that in mind!", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-22", "description": "Food is just OK. I would give the food three stars based on food itself.  However,   you need to be careful about the waiting staff. We split our bill with two credit cards and tipped him 18% based on the whole bill on one card and leave the other card with no tip. The waiter took a freedom to add extra 16% of that amount and charge to the other card. \nNext time check your credit card bill and keep the receipt with you if you do have to dine in this place.", "author": "Jerry Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-07", "description": "This place has amazing and authentic Shanghainese food... everything we got was amazing! I especially loved the wine cooked fish fillets... mmm. Verified authentically Shanghainese by my (Shanghainese) parents. Decent price, too - definitely coming back!", "author": "Catherine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-25", "description": "authentic and tasty\nthe drawbacks:\n1. not all the waiters know English\n\n2. Not enough waiter\nhave to wait seriously for attention from a waiter\n\n3. the kitchen is not as clean as I expected\nI had a peak before getting into the bathroom, I would say the kitchen is a little bit dirty and disgusting.", "author": "Ross Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-25", "description": "An old family favorite.  As we had moved, it has been several years.  Went there on a Friday night with friends.  We had kaofu (very good), fresh bamboo (great), whole fish in sweet sour sauce (great), rice cakes (ok), pork shank (good) and sesame balls - ok as the soup was missing wine).\n\ngood shanghainese food", "author": "Bill L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-05", "description": "Food is better than their service.\n\nNoteworthy dishes - \n*shanghai stir friend rice cake\n*vegetable steamed dumplings\n*sweet rice shao mai\n*preserved vegetables w/bean curd sheets\n\nLess than stellar items - \n*red bean puff\n*fried threaded bun\n\nWait staff is usually friendly, but the service does dip when a few tables get filled up.  For the price, the amount of food is smaller than other Chinese restaurants in Richmond, but some dishes are worth it.", "author": "daphne w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-11", "description": "The food are very delicious! They have many tasty food for the vegetarian too.  the waiters are nice too.", "author": "Yu L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-18", "description": "Everything we order was so fresh and delicious.i came here with my friends,and i order the xiao long baos,and fire fish. I was really like the xiao long baos because  is so delicious and soupy. It's a great place for people to come", "author": "Ting C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Welp... Another 5 star experience. Amazed to say the least. From the staff to the dumplings, this is top notch restaurant that everyone needs to go to in SF. Will be coming back soon", "author": "Kristy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-16", "description": "A party of 7 of us went to Old Shanghai for lunch yesterday and we were extremely disappointed in the food and service.  If I could give it zero stars I would and grudgingly giving in 1 star.\nService:\nFirst, we had made a reservation and when we arrived, they had to clear a table for us.  So much for making a reservation!  After we finally got seated, it took easily 15 - 20 minutes for someone to take our order.  \nFood:\nMultiple issues here.  First, everything was extremely bland.  I guess they don't believe in seasoning their food and they certainly don't taste it before it comes out of the kitchen.  Secondly, they are really stingy in ingredients.  We ordered pickled greens with pork noodle soup and we couldn't find the pork.  We ordered Shanghai Wonton soup and the wontons had only a fleck of meat in them.  We ordered Fried Rice in a clay pot and it was a ridiculously small portion for $10 and this one also didn't have much in ingredients.  We ordered the Xiao Lung Bao (soup dumplings) and they were small, no soup inside the dumplings and expensive.  An order of 6 for $12.  Most other restaurants are 6 for $5.   Basically, the whole meal was carb overload because all we ate was noodle and rice.  No protein.  Totally disappointing meal and we vowed never to go back.", "author": "Harlan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-19", "description": "This place is authentic. \nI love their lion head (meat ball) in clay pot. Smoked Ham With Bamboo Shoot soup is light yet delicious. And the sour-sweet rid is good too. Sometimes the service can be a little slow because they don't have enough staff, the owner sometimes even come to take your order, he is really nice and always gives good recommendations. \nAnd I like it the fact that they just remodeled not long ago so everything looks nicer, and still keeps a \"Old Shanghai\" feeling, not super fancy, so I can still eat here feeling relaxed, unlike some fancy places that you feel like you are paying for the deco not the food....", "author": "Kaya C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-17", "description": "Came here several times, all because out of town visitors wanted Shanghai style food. There is no really good Shanghai style restaurants in SF. This is the closest I can think of. So far, all my visitors are satisfied. 香煎小黄鱼，上海菜饭，萝卜丝饼are good bets!", "author": "Emmy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-02", "description": "Everytime we are in the SF area we try to make it here for brunch or dinner. They have the best Shanghai Dumpling and vegetable clay pot rice. You can't go wrong with this place.", "author": "Richard T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-26", "description": "We came here due to the good reviews but was very disappointed.  The eel was very salty and shrimp too bland. Nothing stood out.  Maybe we ordered the wrong things but will not be coming back.", "author": "Jenny X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-10", "description": "Everything we ordered was so fresh, wholesome, delicious, and so reasonable. The place is so neat with white tablecloths.The fred fish, dumplings, tofu noodles, and sesame balls were so delicious. It's a great place for any occasion.", "author": "L L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-10", "description": "My wife and I have been to this restaurant many times. It was closed for renovation and then reopened again a few months ago. The food is authentic and very tasty. In particular we like Shanghai Won Ton Soup, Braised Meat Balls, Shredded Pork w/ Napa Cabbage, and Stir-fried Shrimp. For desert, we like Boiled Sweet Rice Ball. The service is also good.", "author": "Dan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-01", "description": "Ew ): So terrible! I had really high expectation, not only because of the high rating but the name 'Shanghai' should imply that they can make Xiao Long Bao better than other Chinese restaurant? After all it's Shanghai's specialty. The pork XLB was no better than other places in the neighbourhood, the crab one was exactly like pork. I couldn't taste crab flavour at all. I had good crab xiao long bao before back in China, and it was out of this world. This place though, failed terribly at their own specialty food. The sauce was bleh. Pan fried savory pancakes were rather oily. Worst of all, my favorite drunken chicken was simply boiled chicken with PURE cooking wine pure over it! If you're going to make it like that I could have make it at home! Good drunken chicken should rid of the bitterness of the wine and bring out the flavour of chicken, but the bitterness of their wine overpower everything ): Sadly I didn't like anything about this place except the nice, clean place and quick, friendly service. I'm giving an extra star because of it", "author": "Bobo V."}
