{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "What a wonderful surprise !!!!\nI have been traveling to India for 30 years and the taste of the food served today at Om Indian cuisine was as good as any food I ever ate in India. Waiters were very friendly and service was very fast too.\nWe ate a chicken bharta ( boneless breast chicken with eggplant ) and a chicken vindaloo(chicken with ginger onion and tomato sauce). Price was also ok for 2, the bill was $59 including 2 bears Stella on the tap, 1 San pellegrino, 2 naans and the tip.\nSo I highly recommend this place.", "author": "Jacques H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "I've ordered delivery from this place a few times, I have been really impressed. \n\nMy order's always include at least one chicken tikka masala, as that's one of my favorite things that they make. It's bursting with flavor, and the sauce is a little bit different than some other places - maybe heavier on the vegetable content actually - I'm really fond of it. They're also nice and include plenty of sauce for your rice or even to save and cook some yourself. \n\n I also love their chicken chili, and their coconut chicken. Both are also a little different than other places but still delicious. \n\nMy biggest complaint is the price/size. Compared to some other Indian places, the price is a little larger and the size is a little smaller. Still, I'll definitely be back! Well, figuratively - I guess they'll be back at my place! Delivery is just way convenient, and I have no complaints about the flavor etc.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "This has become our go to Indian food  in SF!! \n\nOrdered a ton of food tonight and everyone loved it\nI can't say enough about the freshness and amazing taste of this food !\n\n\nLove it every time !!!\nAzikiwee", "author": "Azikiwee A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-12", "description": "I got takeout from here after great reviews on here. I ordered Bhindi Masala and chicken tikka masala with garlic naan. Everything was awful. Bhindi masala so over cooked it was inedible. Tasted burnt and bitter and just was terrible. Usually Bhindi masala is herbaceous and flavorful, this was definitely not that. The chicken tikka masala was so salty. At other Indian restaurants the chicken falls apart because it is so tender in the sauces. This was hard chicken with zero flavor, I've had been chicken tikka masala from Trader Joe's. The naan was also burnt and flavorless. Did I get a bad night for the chef? I don't know but I won't be trying this place again, super disappointing.", "author": "Meghan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "Great neighborhood place. We usually get some Chai, Lamb, Naan and some Tandoori or rice for the kids. Very glad they're around.", "author": "Seth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "Sparknotes: \n- Tikka masala: creamy perfection, try any meat  \n- Naan: generous portion, try the garlic one\n\nAfter eating at many Indian restaurants, I have to say that the tikka masala is the best I have tasted so far. The curry sauce is cooked to a silky, creamy, and flavorful delight. It was rich but not overly dense, which satiates you, but not to the point that you feel stuffed. Om is also quite generous in the amount of naan they provide - the two naan pieces are so long that they overflow the basket. They are soft, warm, and bursting with flavor (try the garlic naan!) As a bonus, the restaurant provides a complimentary appetizer: papadum (thin, baked dough) with three types of sauces. This should be a go-to Indian restaurant!", "author": "Louis Suo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Call me basic, but I can't resist ordering chicken tikka masala.\n\nThe nice twist this time is we ordered salmon instead of chicken and it was delicious!  The salmon was grilled perfectly before going into the sauce, and was nice and tender.  The garlic naan is great by itself, and sublime with the tikka masala.  We also ordered the veggie momos, aloo gobi, and rice.  Everything was done well, and the food came out at a reasonable pace.\n\nService was nice and attentive, they change your plates in between apps and mains and water glasses are never empty.  At the end of the meal, I had expected the bill to be around $60, but it was only $45.  A steal considering SF prices!\n\nTips and Tricks\n-They serve papadums as a free appetizer, so yummy!\n-One app, a curry, a veggie dish, naan, and a side of rice was just the right amount of food for 2 hungry girls", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "If you live in the area, this should for sure be your staple hole in the wall Indian spot. They give you some crispy breads with a variety of sauces complimentary (Indian cuisine snobs pardon my lack of proper terminology.) I ordered the tandoori chicken after seeing it previously suggested and it was absolutely delicious -perfectly spiced and crunchy, and provided with me enough leftovers to bring to work the next day. My boyfriend also got the coconut curry, which was delicious as well. Add in a side of rice, and our total was just under thirty bucks. Peeerrrffectttt on a cloudy SF day.", "author": "Maria M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Great food, but I wish there was some sort of consistency with their serving sizes for delivery.  I ordered two sides of basmati rice because I never have enough when I order one entree, but today I received about 4 times the amount of rice and my chicken tikka masala was all sauce and barely any chicken.  \n\nThe dine-in experience is alright.  The servers are attentive but not very friendly.  There always seems to be friends of the owners.. or maybe it is the owners... that just hang out at the counter near the entrance.  But they always seat me in the hallway-like area that leads into the larger dining room.  So I feel like I'm always being watched by the people at the front counter.  Not once have I ever been seated in the large dining area.", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "This restuarant is one of my favorite indian resturant  in san Francisco California.  I always order butter chicken masala , tandoori chiken wings as appetizer nd garlic nan its always comes as same taste nd sam spicy level ..i love it..", "author": "Dpes R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "Ordered delivery for a few items, and they arrived pretty quickly. I ordered the Chicken Tikka Masala and Lamb Saag. Both were very good with lots of chicken and lamb. The butter naan was big and long! I thought naans were usually a round circle, but this was like a very long ellipse. Nevertheless, it was soft and good bread. The food portion was pretty big. My girlfriend and I were not able to finish the 2 orders with 2 naans. I would order from this restaurant again!", "author": "Wesley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "My go to spot for Indian take out. They pay attention to details and are very heavy handed on spices, which if you are going for Indian food, that's what you should expect.\n\nWe love \n1. Chicken tandoori: the sauce (sweet, sour, spicy, and savory) is so bright and mouthwatering. You simply have to try.\n2. Lamb shank: meat is falling off the bones\n3. Chicken tikka masala: average, I prefer my tikka masala sauce to be chunkier, not as watery, but the flavor is still very good\n4. Saag paneer: they brown the cheese cubes, which brings out the flavor \n5. Aloo gobi and baigan bharta: great vegetarian dishes.\n6. Garlic naan: fluffy, chewy, and moist. Right on guys.\nWe do not like the pudina paratha, which is a wheat bread. It is hard and taste like cardboard\n\nTip:\nTheir spice level is not consistent. When in doubt, round down. I order their spiciest level a couple times. Once, it was so spicy that even after adding 200% more bland vegetable and rice in it, it was still too spicy, and I usually eat at the spiciest level at asian cuisines.", "author": "Tata X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "I have been to these place multiple times every visit I enjoy the ambience and comes out very satisfied. Chicken momo, Garlic Naan, Tikka masala are blowing. I will visit this place again v.soon.....", "author": "Maniteja C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-20", "description": "I do not understand how this place has received such a high rating. I witnessed many people come into the place with a look of disgust as they sat down and then after a minute heading out. The place smells like pee and gross man soap. Not to mention the place is outdated and creeeepppy. The curry looked like vomit, the samosas were clearly frozen, and I felt so gross after eating there. I had to head to a grocery store to get an apple after my dinner  because I needed the goopy chicken tikka masala taste out of my mouth. Just don't go. There are much better places to go to in the Haight and in San Francisco.", "author": "Naomi F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "First time writing review on yelp. I  m not a yelper but this restaurant compelled to write some about its best dishes i haver had and customer service. We are just the party of 3. As soon as we entered we were greeted promptly and seated. Welcomes with their complementary papadum with green , hot and tamarind. Tried their momos which was juicy and flavorful. Chicken Tikka masala is flavorful and garlic naan is long and big. I had assumed garlic naan supposed to be round. They few choices on 3 dollars draft beer. Overall we had great experience in om and we will come back whenever we are in neighborhood.", "author": "Surya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "Very very good Indian food in the city. I'd give it 4.5 stars if I could.   Very flavorful, good portions, reasonable prices and lots of variety.  I will definitely be returning often to Om Indian many times I'm sure.", "author": "S F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-14", "description": "I went here this past Sunday to have dinner with a friend. We ordered the Shrimp Tikka Masala, Aloo Gobi and Serrano pepper naan. All delicious. I have to also shout out their surprisingly good chai. Normally when I order chai from Indian restaurants it's okay, nothing to brag about, just a brown compulsion of mine to always have chai at the table.\n\nI tried the Serrano pepper naan. It definitely adds a little kick to the naan. \n\nI want to come back and try their Indian pizza, if it's as good as the spots I have been to in Berkeley I am sold on this being my new Indian spot in the city. \n\nThe prices are super reasonable too. \n\nHighly recommend.", "author": "Cynthia G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-16", "description": "The butter chicken is good. The pakora is great when you reheat it in your toaster oven because it comes to your door very soggy. The korma was okay. Rice is average. One day I ordered it and there was a huge box of it. Another day it was tiny. Very inconsistent. \n\nService is below average in my opinion and for $45 for a 2 person delivery order you would assume you'd have more to enjoy overall. I couldn't even get a container of extra sauce for my pakora lol. \n\nI won't be ordering from them again but it's sad because I did like their spicy sauce for the butter chicken. I just didn't like the price tag of the full order and their service/delivery drivers attitude. \n\nSometimes service can really be everything. In this case it wasn't but it didn't add to my positive marks on the place.", "author": "Bella B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "Wow! This restaurant is phenomenal! Authentic! Great staff! and will be coming back again! Just walk in and enjoy! \n\nMy gf and I decided to just walk in to a random restaurant with the idea of trying something new. Normally I am the one that looks up restaurants and make the reservations. But she killed it with this decision! \n\nThey put love in their cooking and food!!!", "author": "A N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "My new favorite indian takeout/ delivery spot.  Lamb curry is so good. Delivery is fast and correct.  Highly recommend to folks libing in Lone Mountian, NOPA, or Outer Richmond.", "author": "Rayannah S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-22", "description": "I've had such hit or miss experiences with this place. I am finally giving up on them after this momo take-out order. What a joke.", "author": "Steve H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "I've had the pleasure of eating here many times, both delivery and sit-down. And I can say without a doubt that this is one of San Francisco's best Indian restaurants.\nYou're getting top-dollar food for a very reasonable price.\n\nIf you like spicy food, I highly recommend the Chili Chicken. It's Indo-Chinese food from the Himalayan region and this place does it better than any other place in the Bay Area.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-27", "description": "We ordered delivery and were disappointed.\n\nThe naan, though very large and impressive to look at, was still pretty raw in the thick parts.\n\nThe chicken korma was tasty and nutty, but I wouldn't order it again. It wasn't bad, but not that flavorful or memorable.\n\nThe baigan bhartha was sweet and this was the nail in the coffin for me. I requested spicy and they got that right--it was quite spicy but still enjoyable (if you like heat, not very bearable for the faint of heart). But the sweetness: whyyy? I usually love this dish, but was not very happy with their version.\n\nThe chicken tikka masala is a-ok, but I wouldn't order again--not very flavorful.\n\nThis place has such good reviews, I had high hopes, but it just shows you that it's a matter of taste, and this place is just not for me.", "author": "Aristocles P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "I was craving Indian food, but the roommate wanted something else. We decided to order delivery from two different places for lunch. (Yes, we are fat a$$es!) I placed an order through UberEATS on Monday, January 16th at 1:01pm. It arrived at 1:53pm. I live in Outer Richmond.\n\n*Samosa: Homemade crispy Indian pastry stuffed with spiced peas and potatoes, Served with homemade mint chutney, hot and sour, and tamarind chutney ($4.95)\n*Chicken Momo: Nepali delicacy cooked with ground chicken and Himalayan spices filled in cover with thin flour dough and steamed ($8.95)\n*Chicken Tikka Masala: Roasted chicken breast cooked in creamy tomato and onion sauce ($12.95)\n*Chicken Vindaloo: Boneless cubes of chicken cooked with potatoes, onion, ginger, garlic, and ground spices in a hot and tangy sauce ($11.95)\n*Serrano Chili Naan: Naan brushed with blended green chili ($2.95)\n*Assorted Bread: Combination of garlic, onion, and butter naan ($7.95)\n\nI love my Indian food spicy, so I was happy they served serrano naan. It added a great kick to the curries. I adore thick curries, but the tikka masala was actually a little too thick for me. I did love the spice level and flavors though. We ended up adding the vindaloo sauce to the tikka masala to thin it out a bit. The samosas were great! Soft on the inside and crispy on the outside. I didn't really like the mint chutney though. It wasn't creamy and minty enough. I love dumplings so I decided to get the momos. I think they come with a dipping sauce as I got something I thought was the hot and sour sauce for the samosas. It tasted more like a chutney I've had in the past with momos. The roommate enjoyed the dishes he ordered, the vindaloo and the assorted naans.\n\nIndian is one of my comfort foods, so I'm glad I discovered another great option for delivery.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "Om is my go-to when I'm craving a flavorful meal! It is great that they have open for home delivery as well. \n\nI highly recommend the Tandoori Chicken and the Coconut Vegetables Curry!", "author": "Alisa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "Very good and huge portions. We couldn't finish everything!  Wait staff was professional, and the atmosphere was conducive to conversation.", "author": "Jennifer G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "This is our go-to date night spot in SF. Delicious butter chicken and tikka masala and very friendly staff. Prices are also good for San Francisco. We always have a great time when we come here.", "author": "Lea S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "The food is consistently good here. Service is polite and not chatty. If you're in Haight-Ashbury, this is the place for Indian food.", "author": "D D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-04", "description": "I ordered takeout on Eat 24 from this restaurant last week. Ordered 3 things: chicken naan, vegetable pakora, and chicken saag. \n\nThe chicken naan was quite moist. It had been wrapped in foil, to keep it warm I'm sure, but what ended up happening was it was just soggy by the time it arrived. Also could not pick up any trace of chicken in there. It was rather bland naan, which says a lot considering naan is bland to begin with. \n\nThe vegetable pakora was also disappointing. There was absolutely no crunch to it. The flavor was also bland on these. There were 2 dipping sauces, neither of which did the trick as far as adding good flavor goes. \n\nThe one redeeming dish was the chicken saag. It was fantastic. Good enough to turn a 1 star review into a 3 star. The chicken was tender and juicy and the saag was perfectly flavored. Just the right amount of spice. While not the most visually appealing dish, I would certainly order this again. \n\nThe delivery itself showed up about 35 minutes late. Luckily I wasn't too hungry when I ordered but it was very disappointing that it took so long.", "author": "Nick D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "One of the best indian resturant in sf..I order chicken Tikka masala nd Serrano chilii naan it assum nd fresh. Mo:mo r great grt service ...", "author": "Dolly P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Excellent.  The chicken tikka masala was spectacular.  I loved the feel of the restaurant and the service was exceptional.  You have to go out of your way to find this gem amongst the \"stoner\" stores on Haight but it's totally worth your time to do so.  A hidden gem.  Oh and don't forget to try the sweet naan.", "author": "Debbie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-10", "description": "We ate paneer curry and a mix vegetable curry along with Garlic Naan and Tandoori Roti. \n\n1)The curry portions were less and the 2 naan and 2 roti were pretty big.\n\n2) I don't know how it was cooked but I think we have a bad stomach because of it.", "author": "Sanjay R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-01", "description": "I ordered chicken tikka masala to go, and it had 0 chicken, they replaced it with Tofu. My husband had the lamb tikka masala and he said it tasted like lightly spiced boiled water. Their nan was so stiff. Everything about our order was an absolute disaster and isn't worth a penny of your money. Save your bucks and go to another Indian restaurant, this isn't authentic indian food.", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "We came upon Om after a short hike around Land's End made us hungry for something sizzling and spicy. Om seemed well rated so we followed the advice of my trusty fellow reviewers. Yaaaas. Om delivered on its inherent promise but also on our expectations. This is how I come to the conclusion that in many ways Indian food is better than love.\n\nPlease do order the rice with the cumin seeds. They are so crunchy, look.", "author": "D Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-14", "description": "I'm writing this primarily to soothe my psyche, battered by the day.\n\nThe delivery man couldn't find our address. It is not hard to find. We get delivery all the time. I eventually had to go downstairs and out onto the street to locate him. When I did, I asked to look at the map he was using to find my house. He was using Google maps. The map indicated my house's exact location, his exact location, and the direction he was facing. Why he couldn't find my house I don't know.", "author": "Timothy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Best Indian restaurant in San Francisco.\nIf you are looking for the Indian spicy level - make sure you mention 'SPICY' when placing the order.\nMango Lassi - 5/5\nSerrano Chilli Naan - 5/5\nKeema Naan - 4/5\nChicken Chilly - 4.5/5\nChicken Tikka - 5/5 (I love it)", "author": "Manjari R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "I was a little nervous when I walked into this place. Sometimes my first time trying something can either make or break my experience but to my surprise, this place is actually really good.\nWalking in, they greeted us and we were seated immediately. Food was fresh and delicious. The vegan items were clearly labeled which is a plus point.\nWill definitely be back to try some more food!", "author": "Nishu P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-03", "description": "I have been having diarrhea for 3days right after having food from OM Indian Cuisine. and it's still on going that I will have to see a doctor. I highly suspect the health quality from OM and still feeling very gross with the thoughts about the food at this moment. By the way I don't have any food allergy before and in good health condition. The only reason I can think of is the quality/healthiness/freshness of the food. Please be cautious of the food from this place!", "author": "Ping L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-03", "description": "This place is hit or miss in terms of wait time.  I think that the prices are too high for the amount of food that you get, and once I had to threaten to walk out because it took forty five minutes to get served and Everyone else who came in before us got their dishes.", "author": "D D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-15", "description": "OK, I gave this place another shot because it's got a great Health Score rating of 96, and has new owners again. \n\nIt was a to go order that was very pricy, $13 for a small portion of chicken tikka masala with no rice? Really?!  Not all of us are RICH in the neighborhood. \n\nIt was yummy but not even a close to filling up the \"to go\" container. Lots of room for a few more pieces of chicken and sauce. \n\nHence the loss of one star. Way too pricy for small portion and no rice. But sooooo tasty. \n\nWhen I got home and unwrapped everything one of the appetizers was wrong. I called, explained, and asked kindly if they would send a guy out since I'm so close by. Plus, I waited a solid 10 minutes for the order that they got wrong. \n\nThey sent over the correct appetizer and a free kheer dessert. Now that's customer service! \n\nEverything was very good, but tamarind sauce is way watered down. \n\nKeep up the great health score and please consider serving rice for those prices. Plus, the carpet in the front smells like urine, pee. Gross, steam clean and bleach that To Go area, please.", "author": "B K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Just ordered chicken tikka masala, garlic naan and the samosas. Not only was the flavor on point but the service was great. So happy I found a new Indian place!", "author": "Hailee K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Nice experience and I like the Taj Mahal Lager Beer.  Found OM Indian Cuisine by the name and walking around in the neighborhood.", "author": "Linda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Probably the best Indian food in the city, if you want quality for a good price come here. There are many vegan options if needed. The naan is huge but delicious.", "author": "Julian Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-21", "description": "Very disappointed. We expected more from a 4.5 star. Ordered a Butter Chicken and Tikka Masala for delivery. Both curries were watered down and had no kick to them at all. There are much better Indian restaurants in SF, perhaps dining in would've been better but delivery was a let down.", "author": "Charles W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "One of My favourite Indian restaunt in this San Francisco. \nI had chicken momo and tandori with garlic naan. \nAwesome !!\n\nWait staff were really friendly and prmpt. \n\nI was impressed with the quality of food and service .", "author": "Akash S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Delicious. Love the butter chicken and saag paneer. Great for dine-in or delivery.", "author": "Dwayne J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "I've ordered from here almost exclusively through Ubereats (use code: eats-kathy15) and done pick-up once from the restaurant. It's a really small seating area and a tiny bar so the restaurant itself gets lost amongst the surrounding businesses on Haight Street.\n\nThe food here is really amazing in flavor - all the sauces are creamy and full of spices (without being too spicy for my sensitive palette), and the garlic naan is not only 2ft long, but also incredibly seasoned, not skimping on the garlic and herbs.  \n\nEach meal for me here 1 sauce with meat + 2 naan is well more than enough to fill me up and keep the leftovers for another meal.  \n\nTLDR: Love ordering to-go or delivery from here. The food is always piping hot, and really worthwhile and authentic. Pretty small restaurant and haven't had the in-restaurant dining experience, but would highly recommend!", "author": "Kathy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "My favorite delivery Indian food in SF. Everything I've had has been delicious. Spicy and fantastic. Don't forget to get the papadum- the chutneys are great.", "author": "Kaitlin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-04", "description": "Ordered delivery tonight for first time- samosas, salmon tikka masala, plain basmati, butter naan and 3 chais. The STM was delicious! It was the star of the delivery. The moist salmon just came out fresh from their tandoori oven and the sauce had a great balance of cream and tomato sauce. The samosas had good flavor but the consistency of the filling was too mushy for me when I'm used to having them with a more chunky one. Naan was okay, more doughy than I wanted (I like it crusty). The chais were very good and sealed carefully. Friendly delivery came before promised time. I would order from them again. I'm definitely looking forward to dining in when I'm in the neighborhood!", "author": "Mona C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "Fast delivery, food is consistently good and super fresh. Their chicken tikka masala is now my favorite in the city - it's one of the few that is sweet and spicy without tasting smoky at all.", "author": "Melissa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "Delicious EVERY time we visit! The vegetable biryani, aloo gobi, bhindi masala, and vegetable Tikka masala were on point! Don't miss out on this divine experience.", "author": "Maria B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "Best garlic naan I've had in the city.  Lambchops can be avoided since they were dry and not too juicy.\n\neverything else is pretty good but PLEASE ORDER THE GARLIC NAAN FOR THE SAKE OF ALL HUMANS WHO LIKE NAAN.", "author": "Vince L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-14", "description": "Live around the corner from this spot, there's been several Indian restaurants that have run through this location - I was definitely hesitant to try it. \n\nWOW! Equally as good, if not better than Tara. Yes the Jeera and Roti are good, and standard. The Malai Kofta (veg ballz) are outstanding, savory with a hint of sweet, creamy texture yet not too heavy ---highly recommend. Saag Paneer is also tops, better than any other thus far. \n\nWhy only 4 stars? Well, this is all take-out /delivery. The ambiance is just ok.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "I only order Indian delivery food because they offer dishes that I cannot cook myself! I got the \"Om Thali Special,\" and every dish was fantastic! For $45 it offers a lot of food, and the leftovers will last throughout the weekend. Out of all the Indian places I've tried, this is now my new favorite- thank you!", "author": "Merina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Amazing food and amazing staff.  Always delicious and extremely kind. The places that were in this space before were not nearly as good.  I definitely recommend it.  Ask for Suren he is the best.", "author": "Holly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "Delicious, affordable Indian delivery. I'm a big fan of the chicken tikka masala, raita, and kheer.", "author": "Jackie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "Chicken korma is their best dish (even if you're an avid CTM eater). The staff is friendly and tries really hard to make their customers happy but they almost always mess up to-go orders. Their food is so good- it doesn't even matter if it take 1 hour sometimes for delivery. My only recommendation is for them to create consistency with their food as sometimes it can be watery. Otherwise, they need to make a cookbook!", "author": "NewtoIthaca N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "When I was in San Francisco I ended up trying Om. It was so amazing I ended up going back again before my trip was over. I had the vegetable korma--I will be back again if I am ever back on height street!", "author": "Becky J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "I have ordered from here many times. It's always delicious! I highly recommend the tandoori chicken, as well as the garlic naan. I love the vegan eggplant dish too. Actually I love this food so much that I always get the same thing. Hoping to branch out soon. Love Om!", "author": "Lolly B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-23", "description": "it was very cold inside. everyone's leg was up from the ground.....they should put heater to keep customers warm. No one likes to have dinner in a cold place...I think the management knows that too but they're just pretending to not be bothered.", "author": "Prabin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-13", "description": "Awsome food, very taste. Chicken tikka masala was too good. No complaints about biryani, chicken biryani is simply superb.", "author": "Nikhil V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-16", "description": "We tried delivery from this place recently.  \n\nVegetable Pakora = full of flavor and crisp. Even for delivery. $4.95 \n\nTandoori Chicken Wings = awesome. Moist and flavorful chicken wings. And I loved the onions and peppers that come with them! $9.95 \n\nBaigan Bharta = smoky eggplant. Delicious. $10.95 \n\nSaag Paneer  = good. On the mild side. $10.95\n\nChicken Tikka Masala = excellent. Slightly sweet, smoky and hit the spot. He loved it. $12.95 \n\nRaita  = typical. $2.95 \n\nMixed Pickle  = Tart and spicy. Exactly what he wanted. $1.95 \n\nBasmati Rice = good. $2.95 \n\nGarlic Naan = good. (Better after sticking it in the oven though.) $2.95 \n\nKheer  = a most peculiar version. It was tart/sour. I ended up composting because I couldn't eat more than 3 spoonfuls. $3.95 \n\nPrices = moderate. $64.50 before taxes and discount code. We had leftovers for two more meals.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-06", "description": "Had a great dinner from Om and good service. We waited for our takeout and while it seemed dead in the restaurant at 6:30 on a Thursday, takeout seems to be hot there! Lots of pickups and deliveries were in front of us. Had some really good garlic naan while we waited. Recommend the coconut chicken and lamb curries. Lots of flavor, not too spicy.", "author": "Krista J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "Came here once a week for the past two weeks.\n\nPrior to finding this place, I was a huge fan of another location on Irving. I don't want to put them down as I have gone there for the past 3 years. What I'm saying is I would be there once a week every week. Yes! I am obsess over Indian food. I can never have enough. I even tried cooking it myself but it never comes out the same and plus, it makes my house smell for days =(\n\nAnyways, I came here with a few of my friends and I was amaze. I fell in love instantly. Their sauce to their food is on point. \n\nButter chicken masala and aloo golbi are my always to go. Wherever I go that has Indian food, these are my must eats. Don't forget Garlic naan! \n\nOverall, I would highly recommend this place. Parking isn't too bad. Just keep your eyes on the road and even on the side. There will be some folks that love to spring themselves out onto the road when it is not a crosswalk. You'll see what I mean when you go. \n\nWill be back again since I can never have enough. \n\n*Warning - it gets pretty chilly in this restaurant so be prepared. Nice thing is they do have personal heaters so feel free to ask and they will turn it on for you =)", "author": "Julie B C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Mild vegetable biryani, medium chicken tiki Marsala, & paneer naan. INCREDIBLE. Best Indian we have ever had.", "author": "Chelsey T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "Get delivery from this place all the time. Love their paneer tikka masala. Delivery usually takes 45 minutes to an hour, but they're always friendly and the order is always correct and still hot!", "author": "Charlotte H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "Walked here with friend for dinner on weekend. Interior decoration of dining hall was so attractive and cozy. Beer and wine bar next to entrance. Welcoming staffs. Felt good. We had:-\n       Chicken tikka masala, garlic naan, lamb curry , jeera rice, and an Indian brand beer. Spend some time.\nHelpful and friendly service, average pricing, worth it.\n      Overall I recommend this place for new eaters to give a try. Thanks Om.", "author": "Feroz C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "I rarely give 5 stars, but all things considered, I had a very good experience at Om. The food was delicious, the service was kind and prompt, and better than anything, there is plenty of seating, quiet atmosphere, and not overly priced (based on SF standards)\n\nThe chicken tikka masala is creamy and flavorful, as is the chicken coconut curry. The garlic naan is delicious and warm and comes in a basket draping over the sides. \n\nMy favorite was the chicken momo, which we got as an appetizer. I've never had dumplings/pot stickers with these kind of flavors and they were SO good. \n\nThere was one miscommunication, which was that we requested a bottle of wine and they brought 2 glasses of wine instead. But, in all fairness, we probably didn't need a bottle of wine for two people. I mean, we would've finished it, but whether we needed that much wine is debatable :P", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "Best Indian food I've had in San Francisco! It was so flavorful and tasted high quality. I had super yummy chicken tikki masala and lamb curry, also the jeera rice which I loved. Beware asking for the dishes spicy, it'll test your tolerance (in a good way). The naan was also excellent... I love me some naan. \n\nThe only thing that I believe has room for improvement is the restaurant decor and ambiance. It is a little dim and lacks personality/charm. That being said, the food is way important and I'll be back many times.", "author": "Cynthia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "They were so accommodating to my nondairy diet restriction.  They made the most delicious dish!  Also their Vegan Cauliflower is incredible.  New favorite Indian delivery! \n\nThank you!", "author": "Dolly P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-31", "description": "Two and a half stars. Ordered all dishes mild, not bland. Some lacked flavor and enough salt.\n\nOkra - Had some impossible to chew pieces and a few stems. Too oily. Less salt.\n\nChicken tikka masala - Too creamy and a bit sweet. Hardly had any flavor. I have had the mild version at chaat cafe in Fremont, with hardly any cream. Ok salt.\n\nSaag paneer - Was not very green and had some white creamy stuff. Had a LOT of SAND at the bottom. Looks like they did not wash the veggies properly. Less salt.\n\nDaal Makahni - This was nice. Had almost no salt though which is easy to fix.\n\nChicken curry (home style?) - This was perfect. Had a nice flavor, but not spicy. Had a little extra oil, but not too much.\n\nRoti - Soft and nice.\n\nThe quantity is good for the price and home delivery is quick after lunch time on a weekday.", "author": "Raghu B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "Om Restaurant is where the trajectory of my favorite Indian chef has landed.  Arun Kumar Dangi was at Clay Oven when my wife and I first met him.  He is an amazing, energetic, and very positive human being, which you see reflected in the esprit de corps of the restaurants he has run.  More recently he was at Tara Indian on Market Street, and vastly improved that location.\n\nSo now I go to see him at Om.  To me it's a combination of really friendly people, super delicious Nepali-influenced Indian cuisine, and a comfortable, charming eating environment.\n\nI have probably tried most of the items on the menu, but I'll just comment on a few.  Recently I had the chicken tikka masala, behgan bharta, and saag paneer.  The first of these was creamy, with a delicate flavor.  The behgan bharta had a smoky flavor, with onions delicately cooked, and was actually somewhat spicy.  (I prefer my food quite spicy, but didn't make any special requests this time.) The saag paneer was lemony, and I really liked the chunks of cheese.\n\nEven more recently, I went with my family; Arun made a special soup for my mother-in-law who likes mild food, and one of the standout dishes was the tandoori salmon.\n\nAnd I have to comment on the pakoras.  I don't think I've had them as good at any Indian restaurant I've ever been too.  Some kind of combination of spices that I can't possibly guess at.\n\nThe place is cute and rustic inside, with a beautiful hand-embroidered piece in the back room showing deities of the Bhagavad Gita.  \n\nI really like Om.  It's a place with a lot of heart and great food, I highly recommend it.", "author": "Kai M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-26", "description": "One hot friday afternoon myself with a friend,we made our way into this restaurant,hot n new Yelp said. Needless to say it was a disappointment!\nCasual ambience,good seating capacity the restaurant is located on a busy street.\nMid afternoon when there wasn't any large crowd in the restaurant barring a few the service time was certainly longer!\n\nOur order was pretty simple. For starters we had..\n\n#Vegetable pakora - if the pakoras only have onions in them then the name should be otherwise and not vegetables!! Had them slightly over fried to the color and taste! Though it tasted well it lacked in the usual crispness of a pakora. 6-8 pieces.\nServed with a mint chutney.\n\nMain course order was for..\n#Mushroom Matter- We had asked for spicy and it was true to its word! The portion size was good for 2 eats. Well seasoned and served hot. Was moist enough hence tasted well with the bread ordered.\nDefinitely flavorful.\n\n#Pudina wheat Paratha-\n  Again the roast on the paratha was extra n hence felt the burnt taste to the palate. Presence of pudina was minimum though were decently soft.Sized well, served 2 pieces in the basket. \n\nDessert-\n#Gulab Jamun- \nPartially raw n cold!! Was a sheer disappointment! 2 Gulab jamuns in a plate with no syrup they felt dry. \n\n# Drinks\nMango Lassi- Good flavored,rightly sweet and not too thick to drink as well.\n\nOverall the restaurant needs to pay minute to the right way of treating n cooking the food. Decently priced. \nA one time visit was good for me.", "author": "Preeti J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "This place is really osm , I always come to eat hear the food is really delicious, the staff is very helpful and polite specially the girl work there she always take my order and and do her job very carefully and with responsibility.", "author": "Manu D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-29", "description": "I ordered Delivery from here in the middle of the day.  The delivery beat the estimated time by about 20 minutes and the food was still incredibly temperature hot when it arrived.\n\nAloo Saag: Creamy spinach but not too fake tasting. Great flavored potatoes.  Overall nice dish.\n\nChicken Tikka Masala: sauce is super flavorful; it's on the lighter side of flavor and color.  Chicken was super tough and dry. That was a bummer because the flavor is good.  Maybe it was a fluke and this batch just had chicken that was overcooked, I hope.\n\nOkra: It's pretty mainstream.  Good but nothing out of this world. I could have done without it.  It wasn't bad, but it just wasn't special.  Lots of onions and tomatoes go along with the okra.\n\nDal Makhani: This was my favorite dish.  Creamy but yet still tasted like lentils. Super flavorful.  Who knew this veggie dish could be so amazing.  I would order this again in a heartbeat.\n\nVeggie Biryani: Interesting.  Didn't taste like the normal aromatic biryanis I've had before and it was even a little bit like sticky rice instead of the drier long grain rice dish.  It was more like fried rice I think.  Not bad but nothing special.\n\nRice: the rice servings are a little small so I ran out of rice so maybe order a little extra rice or naan if you need it to soak up the curries!\n\nThey threw in some raita and the brown and green sauce too!\n\nOverall great flavors and it survived delivery so well! \n\nSuper friendly and fast delivery.  I'm looking forward to trying out the restaurant sometime soon!", "author": "Traci H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "This is one of my favorite Indian restaurant in  sf. The mo:mo are very good and service of this restaurant is assuming nd knowledgeable server ...", "author": "Khem G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "Sometimes going to the same restaurent for second times do not make us well satisfied but this is the one that able to maintain same level of service with excellent food.the art is superb... onwards I am gonna be regular", "author": "Rolando J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-29", "description": "I ordered chicken tikka masala today via Postmates and I have to say that it's probably the worst deal I've had in regards to Indian food...like ever. I paid over $15 (not counting delivery charges) for a single order of chicken tikka masala--which came spilled and in one of the smallest food containers. Mind you, there were no napkins or utensils--or even rice to come with my order! Perhaps they expected me to drink the liquid? Well perhaps that would actually be apt because it was the most watered-down version of chicken tikka masala I've ever had; in the whole order, there was maybe 4 chicken pieces total. All in all, save your money--go for Trader Joe's chicken tikka masala if you must...much better deal and time saved.", "author": "Nancy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-15", "description": "The lamb shank was tasty but a bit tough and their version of kabuli naan ONLY had pink coconut in it, which was falsely advertised as having raisins, cherries, cashews, and coconut.", "author": "Anna D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Haight Street is pretty slim pickin's as far as good food is concerned.\n\nIt's gradually improved over the past year or so, with the addition of new restaurants, but some of the new additions have been downright disappointing. Over-pricing, lackluster service, and meager portions all being tell-tale signs. \n\nIn particular, a place to get good Indian food in the neighborhood has been sorely lacking. \"Great Indian Food\" (creative name, no?), located across the street from this place, was ooooookay but nothing to write home about, and ended up going out of business. Tikka Masala, the predecessor for Om, was downright terrible (how do you manage to get chai tea to taste like rotting vegetables?!). So out goes the Tikka, in comes the Om. And I'm so very glad it did!\n\nFirst of all, our server Reason, was one in a million. He had such a relaxed and honest ease about him, telling us he eats Om's food regularly and that it is very good. He was extremely personable and went above and beyond to make sure we enjoyed our meal and time in the vicinity. Sure, this can be typical of new restaurants, more often it will be the owners who come over and try to schmooze and talk up their menu. Beyond all Reason-able doubt, this guy was just very friendly and personable at the core. And he did not lie! The food was delicious.\n\nWe had the Lamb Rogan Joe (interesting name, no?), the Vegan Dahl, Garlic Naan, and a side of Basmati Rice. Along with our free serving of Papadum from checking in on Yelp (which we did at Reason's suggestion), this was definitely enough for us to walk away feeling full and satisfied. \n\nPapadum-Crispy and light, I loved the sauces it was served with. One was tamarind-based and sweet, another had more of a spicy kick, and the third had a fresh lime and cilantro flavor.\n\nGarlic Naan-Fluffy and so satisfying to pull apart, as naan should be. The garlic and herbs it was baked with made it extra delicious.\n\nVegan Dahl-Very savory non-meat addition, and though I'd order it with medium spice next time, it's good to know that ordering a dish as \"mild\" here means you get what you ask for.\n\nLamb Seth-I mean-Joe Rogan. Rogan Joe. Yeah...-SO RICH and flavorful, as much as you want from a lamb dish. The Dahl didn't really need a rice addition but having the side of basmati definitely complimented this lamb-based dish by making it more share-able and adding texture.\n\nBasmati rice was fluffy and dry in that nice flavor-soaking way basmati has about it. There were some peas incorporated in it, too, which was nice.\n\nWe will definitely be back to dinner here, it is so nice to have another palatable spot on Haight. Welcome to the neighborhood, Om!", "author": "Megan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "The food is ABSOLUTELY AMAZING! I order delivery and the comes fresh, hot, and delicious every TIME! \nI get the Aloo Palak, butter naan, and add a new appetizer. It's so great to find a place you can trust to provide great service and delicious food! \nThank y'all!!!", "author": "Melorra G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "I chose to order online. Food delivery took little longer than usual since week-end but taste was not disappointing. I ordered Chana masala which tasted so delish + naans were good in taste. Quantity was really great, you definitely get full with it. Overall, recommended.", "author": "Maulik S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Bomb! Finally a good Indian restaurant near me in my hood. The food is excellent and so is the service. Yum!", "author": "Lonni's P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "The food is great and tasting very good well done.\nService is great, friendly.\nChiken tika masala, jeera aloo and  lamb curry a has amazing flavors  and well cooked.\nThe cheese Naan is well done warm and nice flavor.\nCome again. I recommend 100%", "author": "Victor O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Time when u r hungry n u r in the city .. best place to go .. place to go with friends n family... the foods are really delicious n authentic indian taste.. pocket friendly too...", "author": "Amit D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-19", "description": "Vastly overrated, for delivery at least.\n\nChicken biryani was awful. Naans were doughy and undercooked.", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "Don't be fooled by all the poor Indian restaurants that have occupied this location...Om is in completely different class!\n\nTheir curries are not only super tasty, but they are extremely generous with the amount of meat in them. They are also the rare Indian restaurant that serves Momo!\n\nOne word of caution: when they say spicy, they mean it! Highly recommend sticking to mild or medium unless you are ready for some serious heat.", "author": "Tamiz A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "The owner reached out to me to make this right and it's been right twice since the first time I ordered. I knew the place had potential so it was disappointing to receive a lackluster meal the first time. I would definitely recommend Om bc they care about their customers and the food is great!", "author": "Jazmyn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-28", "description": "This is the best Indian food I've ever had. I highly recommend the jeera aloo and spinach naan. I'm vegan, and they had plenty of options for me. The reason why I docked them a star is because I waited about 20-25 minutes for my food. However, it was well worth the wait!", "author": "Julia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Authentic Indian food with great ambiance and service on Haights Street. We were not too hungry so just had Daal Makhani and Vegetable Pakora alongside Roti and Raita. The quality of the food couldn't be better, chef really took his time!\n\nAlso liked their Chai. I'll be returning here quite often hoping they stay as good.", "author": "Waqas A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Really here the food is delicious and coming to the delivery on time they do and i like here naan chicken curry what not every i tasted all are good thanks for your unbelievable on time delivery when i am starving  i really prefer if you want indian food", "author": "Charan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "Wow. This was a jem to find in the haight area.. very impressed by the food which was suprisingly tasty and filling considering the area. I had the tandoori chicken and vege biryani and both were good. \nI just wished if there was a window in the dining. Decor is good but less cluster would make it better..", "author": "joe w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "Ordered delivery from here via the Yelp Eat24 app on a Tuesday night. Super fast delivery, arrived early and piping hot.\n\nWe got an order of samosas (comes with two samosas), chicken korma, lamb rogan josh, basmati rice, and butter naan. More than enough food for two people.\n\nSamosas were delicious. The chicken korma and the lamb rogan josh were also really tasty. Rice was good, the only thing that wasn't great was the butter naan. About half of each large piece was somewhat soft and fluffy but the other half was too dry and chewy for my taste. Next time maybe I'll try the paratha or roti or a different naan.\n\nOverall a delicious, fast, and convenient delivery diner!", "author": "Ely L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "Food is very good and flavorful..service is awesome..highly recommend this place chicken momo so yummy best I've had in years..............................................", "author": "RaZan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Great food, it is earning the 5 stars, the tandoori wings were amazing! Nice enough staff, sorta slow service and the ambiance is ok....the food was worth the wait though!", "author": "zoe s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Exceptional food. I will be back! Best Garlic naan I have ever had!\nThe Korma is delicious!\nEverything our table ordered was perfect", "author": "Heather F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "This place is my favorite Indian restaurant in the city. It's truly authentic and delicious. They have a dinner combo deal where you can get appetizer, three main course and dessert for below $50 bucks. This place is lovely. If you want to impress your date who likes Indian food, take him/her to here.", "author": "Lynnsha H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-06", "description": "Maybe my review is biased because I'm Indian. The level of spice is good and true to selection.\n\nI ordered Chilli Chicken, it was basically chicken drenched in cornflour and put it into a tomato purée instead of legit curry.\n\nService was fast and the Navratna Korma was pretty good.", "author": "Aditi G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-07", "description": "We used to order from here until they continued to mess up our order and we found pieces of cooking utensils in our food. Very disgusting, I'd urge anyone to stay away!", "author": "Gael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "As a Fremont native I know a thing or two about good Indian food. Om might be my new go-to Indian food in SF. First off their \"hot\" is actually spicy. The food was really flavorful and not overly greasy and there was a lot of meat in eat portion. I loved the lamb saag and chicken tandoori. The naan was so-so but maybe cuz I had it delivered...I'll have to dine in and give it another try.", "author": "Christine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "This Indian restaurant is a gem. I've lived in the neighborhood over 30 years and finally we have a fantastic Indian restaurant.Their menu features Vegan dishes as well as the best Tandoori ever! Ever since they opened we eat there at least three times a week,often as take out, but always enjoy taking my friends there for lunch.", "author": "Manny G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "I was pleasantly surprised with how delicious the food was! I was searching for an Indian restaurant with Vegan options and stumbled upon Om Indian Cuisine from Yelp. The food was absolutely phenomenal. I ordered the Bhaigan Bharta and it was the best I had. Service was very good as well. I'll be back very soon!!", "author": "Kavi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Oh my goodness, I will never forget the lamb tikka masala with the side of jeera rice (flavor of cumin and turmeric)and Serano chili naan. I am also surprise by the service they give to me.i will be back there to have the dine in there ..", "author": "San T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "I visited this place for Christmas and I waited for some time to get a warm welcome from them, because they are very busy with the customers. \n\nHuh... finally I got my seat and I got my food after sometime which is very yummy....‍\n\nI can strongly suggest this food to the people who are really looking for yummy yummy food...", "author": "Somasekhar .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "My favorite Indian takeout place in the neighborhood. I really love the vegetable korma dish!", "author": "Mandy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Very good North Indian and Nepali food. Not fancy like Dosa, but it is authentic. And nice to have an Indian restaurant in the Haight!", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "I don't usually like Indian food but this place is absolutely AMAZING! The flavors are spot on, especially being vegan. Lots of options for a great price. Highly recommended! I tried the coconut vegetable curry with their style of bread. One of the best dishes I've ever had!", "author": "Caroline M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Amazing place, good service, tasty food. I loved the lamb chops and lamb dishes. Totally recommend it", "author": "Binod K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "Yesterday night we had a good dinner which was super delicious food from this Indian cuisine. We ordered food delivery which was super fast and free delivery. I strongly recommend this restaurant, who are looking for food door delivery.", "author": "Varun K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-10", "description": "Food was very good! Their Naan was the best! Super thin and crispy and didn't feel like I was eating uncooked dough like most places. Flavors were also very good and so was their chai!", "author": "Nupur J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "Ordered through Uber eats. The saag daal was perfection. I love al dente yellow lentils. Seriously good. The chicken wings had good flavor, but were slimy, greasy and needed microwave. After significant nuking, they were good. Definitely want to check it out in person.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-15", "description": "Don't order pickup from this place. From the time I placed a phone order to when the food was ready was probably 2 hours. Already ate the frozen chicken nuggets and burritos I had in the very back of the freezer which will probably give me food poisoning. I will never order or eat from here ever again!!!", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "Flavorful and they mean it when they say Spicy!  I ordered for delivery Aloo Gobi, Malai Kofta, Chicken Bharta and Roti. One of the few places I know that does Malai Kofta so deliciously.  They filled up every container. Really enjoyed the meal. Will definitely order again.", "author": "minnie l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "Bhindi masala is delicious. I ordered Om a few times simply for their okra.\n\nMeat dishes are a little small. Medium vindaloo is good n spicy. Medium Tikka masala is a creamy pale orange color and not spicy. I prefer a little deeper orange color and more spice.", "author": "Kyle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "We catered food from Om Indian Cuisine. It is top quality food, with generous quantity. On time delivery. Highly recommended.", "author": "Rajat A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-10", "description": "ok so i've been to so many indian restaurants and tried so many curries and this one doesn't stand out to me. the curry was good (how can you get chicken tikka masala wrong?) the rice was good but i've had better. i might have given this place 4 stars if the price wasn't ridiculous i don't think that paying $18 for rice and curry is worth it especially when the place is cold as hell on a cold as day and the incense was a little much. don't eat here just get it to go !! if you're looking for attentive service this doesn't seem like the place to find that.", "author": "Reese A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "My husband and I come here all the time.  It's our favorite Indian place near the Haight.  The staff is friendly and the food is fantastic :)", "author": "Melanie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Great service and I enjoyed the food! My friend made a reservation to this restaurant via the AllSet app and it was a smooth process for us. The restaurant staff handled our orders well, and we were able to dine quickly without feeling rushed.", "author": "xmarksthespot y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-23", "description": "I had such high hopes for Om! Unfortunately, it was only mediocre at best. Naan was pretty soggy and the meat wasn't as tender as my other favorite Indian restaurants in the city.", "author": "Staci T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "Super fast service when I called for pick up, was really stoked that their paneer tikka masala was so good (if you like Masala Dosa's korma, then you'll like this, too).\n\nIt's nice to finally have a food Indian place back in the Upper Haight.\n\nLooking forward to trying their other entrees.", "author": "Charles V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "If you're stuck as a chaperone with time on your hands because your group of kids is going around Haight-Ashbury, duck in here for some peace quiet and amazing food. They have no less than 10 kinds of naan bread lovely appetizers. We had the chickpea battered eggplant.  Amazing and easily shared with three. They have some Himalayan Specialties as well as your expected curries and Tandoories.  Their medium spice is a good standard medium and they're hot is satisfying as well if that's how you like it. Super nice people. Great atmosphere. Tons of room in the back. We loved the tables up front. Don't forget to go to Amoeba Records though. No matter how many times you come to Haight-Ashbury, going to Amoeba Music never never gets old", "author": "Lee W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Strongly recommended!! Food is delicious and server are awesome with warm welcoming environment. Value of money price is fair.", "author": "Sha C R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Excellent delivery option in the Haight & Cole Valley! The food is always fresh and delivery from Eat24 is fast. Seems like they really care about their food. I've enjoyed the vegetarian saag paneer, chana masala, aloo gobi & paneer korma. Naan is also nice & thin and has the right amount of char on it. Best Indian delivery I've had in SF!", "author": "Marybeth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "My new go-to Indian delivery! I'm looking forward to working my way through their menu. It arrived within an hour and the delivery man was very polite. My first delivery-- sag paneer, chicken korma, lamb vindaloo-- was exceptional. I ordered each dish with varying degrees of spice and they were prepared as requested. I was especially impressed with the quality and flavor of the paneer and the tenderness of the lamb. The korma was rich and flavorful without being greasy. I'm thankful that they have extended hours from 10-10 and deliver! After my first meal, I started thinking about what I would try next.", "author": "Pamela B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "Again, chef Arun rocked in this facility big time. Amazing food, amicable ambiance and fantastic service. We had Aloo Gobi, coconut braised shank and bullet naan. It ran too fast. \nWe will go back again n again.", "author": "Laxman A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "Great Indian restaurant. Authentic spices, fabulous food and wonderful staff. You cannot go wrong.", "author": "Andy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "I love this place!! Awesome food, great prices, chill vibes, dope art, excellent service, humble service, snd on top of all thst, the film buffs behind the counter are more thsn glad to show their favorite martial arts bollywood fluck on the big ;flat screen TV)!!! U gotta come here at least once! But be warned... I went once - for the very first time - and i've been coming back ever since... You like Indian/Nepalese food? You better check these guys out, because they are the real deal + they are the nicest people workin' here (all Nepalese!), so you can't go wrong - ever...", "author": "Torfin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "I've only ever ordered delivery from here but I do love the paneer tikka masala, raita, and the butter naan. I order probably once a month and each order is always consistent and delicious, with quick delivery.", "author": "Itir S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-27", "description": "Om my, tandoori.\nGet the thali, raita way.\nNaan compares to it.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-07", "description": "We ordered dinner to-go from Om last week.  Saag aloo, chicken tikka masala, and a couple of different naans.  The staff was attentive, helpful, and the food was ready fast.  Everything was delicious!!  We've added it to our take-out go-to list.  Can't wait to eat there again.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Best food ever. I had Chicken momo, Samosa, some Indian sweets and lassi, reminded me of home. Now my fav place to order food. Try this place", "author": "Ramesh A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "Really enjoyed eating here! I ordered the Vegan Bartha (eggplant) and naan without the butter and everything was delicious. I could've gone without the peas at the top, kinda ruined the dish but that's okay because they were easy to avoid. I asked for extra spicy and that is exactly what I got, my nose was even running! Service was very friendly and accommodating. Will definitely be returning :)", "author": "Raman D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-02", "description": "I wish that I could leave awesome reviews about the delicious food like my fellow helpers, but alas, that is not the way this tale ends.\n\nWe walked in on a Saturday night around 745. There were already a few people standing in the entry way, the phone was constantly ringing (unanswered), and all the tables in sight had people at tables without any food.\n\n\"They're overwhelmed,\" a woman at the counter said to me right away noticing my concerned look.\n\nWe should have known to leave right then but we waited... and waited and waited. About 30 min later, some frazzled looking waiter ran out to seat not us, but the couple that had walked in three minutes ago. When I let him know we had been waiting, he ended up seating us both.\n\nWe sat at the table for another 15 minutes and no one came to take our order so we finally left.\n\nThe food sounded good, but I'll never know. Good luck getting a service there.", "author": "Lauren T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "I would give this place 6 stars if I could! I highly recommend it. \n\nThis location has been an Indian food restaurant since my childhood, and over the years has been well-loved and well-frequented by my family. We showed up for dinner a few months back to find that the place had experienced a fabulous face-lift. After asking, we found out that there was a new owner (Ajay I believe). Having realized our family gathering location has changed, we were understandable bummed out - but our opinion changed within minutes!\n\nThe owner sat us in the back room (our favorite spot - which NOW has an insane hand painted mural and new TVs for snazzy music videos). We had a really awesome convo with him before finding out he was the owner. He is super personable and passionate about his business; we really enjoyed talking with him through the evening! \n\nNow to the menu.... My dad is a total meat eater, I eat mostly vegan, and my mom is somewhere in between. This menu had something for everyone, and my favorite part was the labeling of the vegan items (WooHoo!). The food taste like I bit into a freekin' cloud from heaven and the chai was FRESHLY made and magical. In fact, I went back to the restaurant for the food and chai three times the two weeks following. \n\nMoral of the story.. Check it out!", "author": "Alijah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "My fiancée and I absolutely love this place! AJ is a great host and makes you feel at home. Our favorite dishes are the bhindi masala (okra), tandori chicken, lamb vindaloo and garlic naan. We order everything extra spicy, but be warned, they take you very seriously on that. Incredible flavor! \nHighly recommend sitting in the back room which has great murals of Indian scenery and there's always both modern and classic Bollywood videos playing. Can't wait for our next night out at Om:-)", "author": "Mariel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "Om Indian Cuisine has excellent food, and great service. Bookmark this place for the next time you're craving Indian food. \n\nLocation/Atmosphere: 3/5. The restaurant certainly isn't upscale, but divey isn't quite right, either. There isn't much ambiance to speak of. I think they may be undergoing some sort of renovation, or redecoration. I have no idea, actually. It was confusing. \n\nService: 5/5. We had great servers here, and our waiter made sure to get our order correct by reading it back to us before putting it in. Food did not come out too slowly or quickly.\n\nFood: 4/5. I hadn't had Indian food in a while, so I was pretty basic and didn't order anything too exciting here. Most everything we ordered was delicious. The samosas were on point--very hot, crispy on the outside, and the filling was delicious. The chutneys that came with were also really good--some of the best chutneys I've had! The naan breads we tried were both delicious. I recommend the garlic naan especially. We tried the chicken tikka masala and the lamb korma for entrees, with rice. The korma was very good, and the tikka masala was just okay. \n\nOverall: I'd definitely come here again!", "author": "Kate T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "Great food, kind people!! Love everything on the dish. The dine in experience is the best :-) love OM", "author": "Annie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "Really good Indian food! I had the coconut vegetable curry with garlic nam! I would come back again!", "author": "Nando R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "We happened to be passing by around lunch time when we noticed this restaurant and decided to give it a try. Pleasant ambiance, flavorful food and very good quality serrano naan at moderate prices. Please keep your restroom clean!", "author": "Ramesh K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-05", "description": "I am so heartbroken to leave a bad review. I really wanted our dinner to be as sumptuous as I'd heard this place was but our meal was really disappointing.\n\nMy spouse and I arrived for dinner on a Wednesday evening at 730,  when there were just a few other folks in the restaurant. We ordered our meal: Chicken Momo as an appetizer, Salmon with spinach, rice, coconut naan and a single Kingfisher beer. Ten minutes later, the restaurant started to fill up, and we saw the folks at the table next to us get seated. The folks at that table next to us ordered after us, but got the Chicken Momo fried dumping appetizer very shortly after they ordered it. I was confused so I said to the waiter, \"I think that may be our order of Chicken Momo,\" but the waiter assured me it was not. 45 minutes after we ordered, our main dish arrived - and to their credit, the salmon was fresh, the spinach was tasty and it was wonderful - along with the basmati rice and delicious coconut naan. Yet still, no Chicken Momo. \n\nAs our dinner plates were being cleared, the waiter asked how everything was. Once again, we said we never received the Chicken Momo appetizer. He assured us that it was coming. Almost an hour after we ordered, the Chicken Momo came out - and with my first bite, I immediately realized the insides were ice cold. My spouse noticed the same thing. I told the waiter, who looked astounded when I said it was completely inedible. The waiter finally relented when I asked, \"Who wants to eat raw chicken?\"\n\nNo, the restaurant didn't charge us for inedible food that we couldn't eat. And yes, I appreciate the 10% discount off our bill. But when the waiter said he was bringing us out a comped dessert of rice pudding -- which neither of us can eat because we cannot eat dairy -- we protested and asked him not to do so. Nonetheless, the rice pudding was placed on our table and sat untouched. So that was a terrible waste of food, which really unnerved me. It would have been better customer service to at least comp us our Kingfisher beer, which we did drink.\n\nSo I'm sad to say, no thanks.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "Easily the best Indian in the city. Actually spicy as well. Highlights are the butter chicken and chili naan. Super fast delivery, too.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-15", "description": "Three delivery orders and we've tried at least twelve dishes. Everything has been good. We plan to order again when the craving strikes. Especially recommended are the Momos: lamb Vindaloo: biryani.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-14", "description": "Worst Indian food I had in SF. Everything was sweet even after telling to make it spicy. Service was horrible, our waiter just vanished after taking our order and was in a rush.", "author": "Nishant A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "It is surprisingly hard to find great Indian food. The butter chicken masala was terrific. So was the saag paneer. I ordered from Eat24 and the food arrived fresh and with a smile.", "author": "Morris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "Longtime Haight resident... And for 35 years I've wanted a good Indian food restaurant nearby. So many failed attempts later, we've finally got good (great!) Indian food.\n\nWe had a few of the old standbys - lamb curry, saag paneer, papadam. All of it fresh and tasty! Spicy but not too salty. Service was friendly and attentive.\n\nThe back seating area (in previous failed restaurants) had been dark, dank, and uninviting. The owners have done a nice job of making this area much more pleasant with custom murals and nice decor.", "author": "Japji K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-15", "description": "I ordered delivery here on a Friday night. The delivery took just as long as was estimated by the app I was using.\n\nI ended up keeping it simple and ordering butter chicken (spicy), samosas, and 2 servings of tandoori roti. \n\nThe butter chicken was definitely pretty spicy for me. Wish there was a little more chicken in the serving, but perhaps that was because it was delivery? It looked almost as though there were red pepper flakes in it. BUT it lasted me about 3 days! So that was great.\n\n1 serving of samosas comes with 2, so luckily I had leftovers and got to warm one up the next day. They were really good, the sauces it came with were also delicious.\n\nThe tandoori roti was 1 roti, but cut into 2 pieces. It had butter on it, and I almost wish it didn't. That's definitely just a personal preference, and it was delicious regardless.\n\nOverall, really really enjoyed the food, especially considering I got it for delivery! Definitely would go back to try other items on the menu.", "author": "Meha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Finally, good Indian in the Haight! We had incarnation after incarnation of lousy Indian food in the same location. I had given up. Recently, I had heard some good things about the newest place, so I mustered my courage, and went for it. I went simple at first, and ordered the vegetable biryani. That was a success! I then went for veggie tikka masala, and that was a score, as well! The spice ranges from mild to extra spicy, and they actually do it extra spicy! I've also gone mild, and they made that deliciously, too. Super yummy! I have a new addiction!", "author": "Tei G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "Crazy delicious.\n\nOrdered delivery tonight, arrived quickly, hot and fresh.", "author": "Christian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "I went a bit overboard and ordered more than I needed for one via Eat24.  It was ready in only 15 mins and I was soon back at home enjoying all of this delicious Indian food. It was hot and fresh.\n\nThe overall appearance was great and I loved that the meat dishes weren't swimming in oil. I had chicken tikka masala (medium) and it was delicious and not noticeably spicy. The lamb vindaloo (mild, and truly mild) was great and the meat was excellent! I can be squeamish when it comes to subpar meat and nothing about either dish was anything but great. No toughness or pieces you have to chew on for 5 minutes. I've taken back dishes, not ordered again, or not gone back to other Indian places due to their lamb.  Everything else was good as well. (samosas, rice, naan)\n\nIt's not cheap but the food quality doesn't disappoint.\n\nThe only non-positive observation is that when you walk into the restaurant, you immediately notice 2 large \"watch your step\" construction looking signs slapped onto the back of the front 2 bar stools. Maybe they are temporary but I didn't get that impression because the floor there is raised.  I'd suggest putting more discreet yellow caution tape along the ridge of the raised step or perhaps another solution. Otherwise it just looks a bit too tacky.\n\nThanks for opening this in the neighborhood and good luck to you guys!", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "Excellent Indian Food! The new place is GREAT! It recently changed ownership, names, revamped the menu and remodeled interior. If you have been to the property before, try it again. You will be so happy you did.\n\nThe food was excellent, so flavorful, fresh ingredients, with large portions, well priced, perfectly seasoned, the restaurant was very clean, and great friendly service. Everything we ordered was exceptional, the Vegetable pakora was the best I have had in a very long time. Cooked perfectly! Be sure to check out the new handpainted murals in the back room, they are beautiful. We live a few blocks away and are so happy we tried it today and will be sure to come back again and again. \n\n\nThey have great affordable lunch specials and happy hour specials!", "author": "Sunny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "We came here on a random quest when looking for a lunch spot before going into Outside Lands. This was my first time trying Indian food and I have to say I am in love! I can't wait to eat Indian food again, thanks to this amazing first time experience! This place is a gem and every single dish we ordered (we ordered about 6 different dishes) was so delicious!", "author": "Catherine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "Best Indian delivery in town.  Tikka masala and naan always consistent.  Fast delivery and good hot.   Like that you can select your spice temp and they actually do it", "author": "Monica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-30", "description": "Simple and delicious food. I had a vegetarian Biryani with Raita. My friend had a dal and naan. We both found the food good and to standards for what you might get at a good restaurant in New Delhi or Mumbai. The server was a tadlacklustre and possible forgot my partners rice. The ventilation isn't the greatest on the inner end of the restaurant and you might feel the smoke from some one else's steaming food! Reasonable prices!", "author": "Doc R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "The food was really tasty and the portions were pretty large. \n\nI had the chicken tikka masala (decision prompted from another Yelp review), the dal and some garlic naan. The tikka masala could use a little more spice, but I didn't specify that I wanted it spicy so that's on me.\n\nIt's a little pricier than my usual go-to Indian food spot, but not completely unreasonable.", "author": "Alison Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Try chicken tikka masala & chicken momo expected one hour but got delivered in twenty minutes . The menu was also very innovative and the prices were also not so high I would recommend this restaurant to any one who is new to the Bay Area or is a tourist.", "author": "Asif R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "I'm not from San Francisco (la native here), but I have tried a good deal of Indian. That said, this is one of the best places I've tried. I stayed nearby the area and the food is usually hit or miss on the Haight, so this place took me by surprise. When went in, it was ominously empty, but it was probably only because it's so new. however, my boyfriend and i were attended to immediately. The atmosphere was pleasant and what you'd expect of a typical Indian restaurant, white tablecloth and all. The food, though, is what really won us over. The samosas are fantastic, for lack of a better word. But don't take my word for it-- try it for yourself to see what I'm talking about.", "author": "Diana W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "So happy there's finally a good restaurant in this location! Food is quite good. Thali can easily feed 3 people. \n\nOne of my usuals, chicken tikka masala, was creamy but very bland. You'll have to ask for spicy if you want it.", "author": "Crabcakes C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-05", "description": "Fantastic food! Quick delivery. I'd recommend only getting takeout because their servers are quite strange. They hover around your table as you eat, which is not at all a pleasant thing. I actually asked them to stop doing that and they didn't seem to get that it was making my friend and I pretty uncomfortable. We left pretty quickly after that. Would never go back in person, but might order takeout again, as the food is actually pretty good. Very disappointed.", "author": "Savannah K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-07", "description": "Experience could not have been any worse.  I placed an order for delivery, they promised to deliver within 45 minutes, 2 hours later it still never arrived after several promises that they were \"5 minutes away.\"  There are plenty of Indian restaurants in San Francisco.  This was is absolutely the worst.  Horrible.  Horrendous.  Go somewhere else.", "author": "Simon T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-08", "description": "Worst paneer ever. Vegetable coconut curry was a runny soup with peas and undercooked potatoes and no other vegetables. The mixed tandoori grill was good.", "author": "Leigh A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "This new neighborhood gem is fabulous.\nWe were party of five for dinner and we were greeted as soon as we entered by the owner himself. It has a very impressive ambiance with beautiful hand painting at the dinning hall walls and i must say the whole place is clean.The service was fast and very friendly. \nThe owner answered any question we had about the food. We order chicken tikka masala, lamb curry, thali (for 2), tandoori chicken and matar paneer with garlic naans and rice. Everything was delicious and good size in terms of portion, tandoori chicken was juicy and well marinated. I ordered my Chicken tikka mild and it came out mild without sacrificing the taste. Naan was big and very freshly made.\nTo make our experience even better we were offered complimentary desserts.\nI would definitely go there again and this has become my new favorite place to go.", "author": "Sub N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-19", "description": "Awesome food and service. The portions are large for such a fair price. We got refills for the Masala Chai. Definitely will visit again the next time we are around.", "author": "Sabrina J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-27", "description": "We used to love Om, until our most recent delivery order. It took 2 hours to get our food and both my husband and I got food poisoning. I will say the chicken tikka masala and saag paneer are really good, but not worth the sleepless night spent praying to the porcelain god.", "author": "Veronica F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Amazing place to dine, deliver or take out food. Their food is outstanding and I will definitely come back. The chicken tikka masala is the best I've had in SF. Om is my go to.", "author": "Leah N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-25", "description": "Food: Flavorful, though they missed the mark on spicy.\nStaff: Friendly.\nService: Speedy.\nCleanliness:  Very.  \n\nConsidering this space and the previous Indian restaurants seemed to have been cursed - these guys might break that curse.  I am cheering them on.   So far, very good.", "author": "Tia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "This is by far my favorite restaurant in the neighborhood and one of the best Indian places I've found in the city. The food's always great, the chai refreshing and the staff friendly and helpful. One of my regular spots that I can strongly recommend.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-13", "description": "I got food delivered from this place. Standard dishes 1x chicken tikka and 1x butter chicken. Both insanely creamy ended up having almost no flavor at all besides cream and heaviness. The tikka had tough chicken filet/breast pieces. The butter chicken had literally garbage meat in it. Never saw that much cartilage bone and fat in a single dish!!! Won't be ordering again. City has much better to offer for the same money. At least good meat should be a given.", "author": "Ilias S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "Seriously delicious. Yummy naan. Great service. I wish this restaurant was in Seattle so I could eat here regularly!", "author": "M W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "So happy with their food and delivery service. When I request spicy its actually spicy! The flavors are perfect and delivery is always on time! They actually read the notes you put in when you order online as well! :) Really happy to have a solid Indian place near by.", "author": "Tuesday C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-02", "description": "Stellar place to eat real Indian food. Tried the Tandoori combo and was blown away by the exact flavors that were so hard to find some other places. I was a bit amazed to try the salmon wasn't sure what that would be like but it was absolutely delicious everything was cooked perfect juicy and tender definitely will return.", "author": "CJ C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-16", "description": "It was very delicious. The eggplant pakora was very fresh and delicately fried and not greasy or heavy. The spice levels were as ordered. However, and I don't know a better way to put this, 8 hours later I found that this food did not \"agree\" with me, and I found myself dealing with that and having to remain near facilities for a couple of hours. All's well that ends well but I can't help but wonder why that happened. And spice never does that to me so I have some concerns about whether proper kitchen hygiene standards are being maintained.\nBut like I said, it was delicious.", "author": "Steven P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-27", "description": "While the food was tasty, it did not sit well with me. I had ordered both the baigan bharta and saag paneer as \"spicy\", which is normally perfect for me. They make their dishes a little spicer than average, and the food upset my stomach. The next morning I spent quite a long time in the bathroom.", "author": "Patricia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "This is the best restaurant in the Bay Area and also the momos were perfectly cooked the tandoori chicken also very nice...", "author": "Kunal G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-07", "description": "Just ordered uber eats. Ordered your most basic chicken tikka Masala. It was watery, the chicken was overcooked and no flavor. Any Indian restaurant that can't serve a decent Masala dish doesn't deserve to be open. Awful... Never ordering here again.", "author": "Milind S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "This place is so great! I had been in search of a great indian food place since moving to the bay area and I am so glad that I found this place. The Tikka Masala was the perfect level of spiceness and the salmon masala was also very good.", "author": "Jordanne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "This is probably the best Indian Cuisine in the San Francisco area. Everything I had in this restaurant was awesome. I couldn't specify the particular item to be the best . Can try anything. My top list of the favorites was Kashmiri Chicken and Lamb Shank.", "author": "Prudhvi Chowdary N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "Best Indian food I've had in years! I feel nourished. Def made with love. Great vegan options. Will be coming back.", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "I like this place,  very good food and easily accessible.\nCaution: In the evening they get busy, lately they have been getting busy with take-out orders so when you go might see few people fuming for their delayed pick-up orders, so plan accordingly. But owner AJ is a very personable and tries his best. It's been a while since Haight street had a good Indian/Nepal restaurant, I am really thankful for this place and looking forward to enjoy this place for a long long time into the future.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "I cannot count how many times I have relied on this place to feed me and keep me satisfied when I cannot find the time to cook.", "author": "Akash M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "We ordered chicken tikka, spinach paneer, butter naan, rice, and raita. So delish. Our new go to spot for pickup!", "author": "Jillian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Easy 5 stars for my favorite  OM  Indian restaurant in san francisco .  I have driven way out of my way just to dine here and carry-out.  Brought my picky and hard-to-impress a friend  here last night with his wifey, and they loved it.\n\nBig props to the owner & management who run this place like a well-oiled machine with stellar service each time.  Our water cups were never even half empty!  The complimentary rice pudding after each dinner is always a nice touch as well!\n\n\n\nAs for the food recommendations;\n\nLamb samosas mixed with the sweet plum chutney and slightly-spicy green chutney with a touch of the pickled vegetables is a must! (Note: If you aren't using the trifecta of \"sauces\" then you aren't doing it right!)\n\nNavratan Korma is my favorite veggie dish! Sweet, creamy and compliments anything spicy on the table.\n\nBengan Bhartha also has a sweet after-taste, but the best part about this eggplant based curry is that you can hardly taste the eggplant, which is great for someone like me who isn't a big fan of eggplant!\n\nThe Tikka Masala (chicken or paneer), the Alu Vindaloo, the Aloo Matar, and the variety of Naan (especially the garlic basil) are TEXTBOOK classic here!\n\nTired the Lamb Biryani last night for the first time, and it truly was \"highly aromatic\" with a nice spicy kick.  Also the lamb pieces were generous!\n\nEverything is reasonably priced and you can customize the spicy level of each dish from mild-to-medium-to-spicy.\n\nAll I can say is thank you Om indian cuisine  !!!\n\nwill be back soon", "author": "Ford T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Delicious Indian food, could eat there every day. Friendly staff, prompt service, great area.", "author": "Denise L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-25", "description": "The food is delicious, but it gave me food poisoning. I got the chicken vindaloo on Sunday evening, and on Wednesday, I'm still nauseated and having serious stomach issues. Don't trust the meat dishes here.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "This has become my favorite Indian Restaurant! After a resent neighborhood move, I was thrilled to discover this gem of a place in the Haight. The food is fresh, served hot ( no buffet ) by a charming and thorough wait staff. I personally like spicy hot, but the heat of the dishes is negotiable and the servers are especially helpful in recommending heat as well as menu items. Papadum, a wafer thin cracker is brought to the table right after you order with 3 sauces, a spicy, a sweet and a mint chutney. Their Daal soup is some of the best I have had. Thick and temperature hot with bits of lentils and goodness. I love the Chicken and Lamb Vindaloo and my vegetable favorite is the Aloo Gobi. Potatoes and cauliflower cooked perfectly. Tender but with a tooth... not mushy. A lovely cup of Masala Chai is a great finish especially on a cool foggy San Francisco afternoon. A great restaurant that I find myself in weekly. Give it a try...,", "author": "Michael T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-17", "description": "Ordered delivery from this restaurant for the first time, and it took two hours! By the time the food got here, it was cold. Food itself was ... fine. Not bad by any means, but not better than many of the other Indian restaurants that deliver to SF--in less than two hours. I will not be ordering from here again.", "author": "J. D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-18", "description": "\"Om\" must be short for \"OMG This Food Sucks.\" Late, cold, skimpy portions...there are a ton of South Asian options in this town - I recommend you find another.", "author": "Hugh G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-17", "description": "I'm fairly convinced that the positive reviews on this place are from family and friends. We ordered takeout from here and both got food poisoning. The chicken curry had no flavor and the cream broke so it looked curdy and gross. The eggplant curry was ok? We didn't eat that much of anything we ordered  (because this was the worst Indian food we've come across in a long time) and it still messed with us. Never getting food from this restaurant again.", "author": "Ella M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "Stopped in here on a Saturday while out and about, and was pleasantly surprised to find a great Indian restaurant on Haight Street! We were greeted immediately by the owner and promptly seated. The dining room was cozy and tastefully decorated, despite the fact they had only been open for a couple days. There's also a larger dining/banquet room in the back. \n\nFirst we had some Papadum wafer appetizers, served with 3 dipping sauces.\n\nUpon the owner's suggestion, I ordered Chicken Tikka Masala, which he insisted was different/better than what is served elsewhere. It didn't disappoint. Sauce was a creamy coconut curry, and perfectly seasoned. Chicken was moist and tender(so simple, but so important!). We also tried the Lamb Rogan Josh. Not sure about the story behind the name of this dish, but it certainly satisfied my craving for lamb, along with a little heat(medium spicy). Loved the spice combination and garlic in the sauce and the lamb was, yet again, very tender.\n\nWe ordered basmati rice and fresh naan with the meal which, in my opinion, is a must.\n\nAfter speaking with the owner, I learned he was actually from Nepal and legit, explaining the presence of some of the Himalayan dishes on the menu.\n\nHonestly, my only regret is that I didn't try more stuff here. I'll need to go back and delve deeper in to the menu, which I'm looking forward to!", "author": "Jeff K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-09", "description": "The service was absolutely horrible and one of the delivery men sat at the bar and picked his nose for like 20 minutes. Usually I wouldn't say anything about that, but It was disgusting and went on for so long, and he was handling the food! It was so gross, the food took forever, and the price was more than it was worth. The food was good but I definitely will not be eating there again. I will give them this, the curry and the naan was good, but we got this lamb dish that was completely overcooked and dry and we could barely chew it. I would. It recommend this place.", "author": "Nikki D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "OM Indian is one of my best restaurant in San Francisco ! Ordered Chicken MoMo, Tandoori Mixed Grilled,Garlic Naan the night before,food was on door in 45 minutes, I couldn't stop licking my plate ! Their food is awesome ! Highly recommended to you people ! Thank you Om Indian !", "author": "Bhuwan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "So great. Fast delivery on a Sunday evening (a bit less than 1 hr at 5:30 pm). Chicken tikka masala between mild/med heat. Absolutely the most perfect flavor, nicely tender. Creamy and lightly, productively spiced but not too much heat. Ordered basmati rice - good. Then garlic naan & veg samosas (bc of delivery minimum). Best samosas I have had yet. Can't pinpoint how except the filling might be the most accurate texture/flavor combo. Garlic naan was missing upon delivery - but I promptly called and they refunded my money. The quality, the flavor, the variety all equal an A+ meal. I loved WP Clay Oven before but somehow this surpasses that as delivery! Happily surprised.", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "I haven't been into this location, but I've ordered take-out a million times. My favorite Indian in the city!", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "Nothing negative to say about this wonderful place!! I order take out from here very often, and over half the time it's after nine o'clock. I've worked in restaurants and I would hate when people would order food right before we closed. I get off late though, and everything I've tried is delicious! Regardless of what time I order or what dish I choose, everything comes hot and just as good as the first time!", "author": "Chrissy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "I ordered delivery through Yelp app. Food arrived on time and quickly. Best Indian food we have had in a while. Tasted fresh and not over salted. Highly recommend.", "author": "Iggy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "Great, fresh Indian food that doesn't feel greasy or cooked to oblivion. Hard to find good Indian in SF, and this new place is promising! Better than others in Inner Sunset/Haight area that I've tried. Super nice staff, too. Vegetable Biryani was especially delicious.", "author": "Elise R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "Yummy! Have ordered takeout from here several times and always been pleased. The flavors are good and unique - you can actually taste the differences between the different curries. Delivery is generally timely and no glitches. However I do want to say that we ordered \"spicy\" for butter chicken and it looked like a lot of chili sauce had just been added to it... and it hurt going down. So, in the future we will stick with medium.", "author": "J L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-06", "description": "The delivered food was okay, but the service was terrible.  \n\nDelivery took forever.  We made clear that delivery was to us in bar.  They delivered the food with no utensils.  No forks.  We called and asked about forks, and they told us that the delivery person had no forks in the car with him and that it was our fault for not having asked for forks.\n\nHow ridiculous is that?", "author": "T R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "I've tried the Chicken Tikka Masala and it is unique but delicious. The Paneer kadai was amazing as well. So glad to have a great Indian place around the corner", "author": "Noms U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-26", "description": "Quality food with reasonable price and very nice customer service. The chicken momos are awesome and delicious.", "author": "Venu Gopal V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "I ordered delivery from these guys and it was estimated at a 50-60 min delivery time. So i was really surprised when they showed up at my doorstep 30 minutes after i placed my order. The samosas were piping hot and crunchy on the outside. The garlic naan was buttery and LARGE! And butter chicken (my all time favorite) was tasty! Maybe i should actually pay them a visit next time. Thank you for the good delivery experience!", "author": "Jenn Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-12", "description": "I was so disappointed with this order (we did pickup) after seeing all the positive reviews. I was really looking forward to a new Indian restaurant for our rotation.\n\nMy chief complaints: it's about 20% more expensive than the other places we order from. That would be ok if it was the only problem, but combined with the food not being very good, we probably won't order from Om again.\n\nWe ordered:\n- Papadum, $1.50 - fine. Was a little darker than I'm used to but perfectly fine.\n- Tandoori Chicken Wings, $9.95 these were good.\n- Tandoori Assorted, $10.95 - fine. No grizzly meats, so that's good. But they were missing a nice little tangy kick.\n- Spicy Mixed Vegetables Soup, $5.95 - first disappointment: for the price, it was a tiny portion. And the flavor was lame, and the clear soup had some kind of thickening agent that made it more like Chinese gelatinous soup. Very low on flavor. Certainly no kick from anything lemony. Highly overpriced.\n- Chicken Mulligatawny Soup, $5.95 - also a tiny portion. Very low on flavor. Highly overpriced.\n- Baigan Bharta (Vegan), $10.95 - fine. Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. Also missing that nice tikka tangy kick.\n- Butter Chicken Masala, $12.95 - fine.\n- Tandoori Roti, $2.00 - low on flavor.\n- Laccha Paratha, $3.95 - low on flavor.\n- Jeera Rice, $4.50 - nothing special. normal rice. highly overpriced.\nTotal bill was $125, which was a bit higher than our usual dinner for 2 adults, 3 kids and leftovers for the next day. And the food was really mediocre.", "author": "Lucia W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-19", "description": "Definitely a significant improvement over what was there previously (under several different names), but that wouldn't have been hard.  There's finally acceptable Indian food at this location.  Solid, but not wonderful.  I have ordered several times, and like another reviewer has mentioned, the chicken (in several different dishes) has always been overcooked and tough.  The sauces are good.  The highlight of the meal is always the samosas--the pastry is not too thick or brittle, and the insides are flavorful.", "author": "King R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "I loooove my Indian food, and this place is not only delicious, but they also deliver...um, hello, best of all worlds! The paneer tikka masala was exactly what I needed on this cold night. Also, I must add, the delivery guy was super nice and right on time. I will definitely be coming back to this place!", "author": "A.E. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "I love Indian food so much. I think there was a stint where I would order delivery from Om, once a week. Oops. Somosas are delicious and huge. Saag Paneer is okay. It had an interesting aftertaste and I have only ordered it once. Chicken Tikka Masala I usually always order. It is so creamy and I love getting it spicy. It's very spicy, but I'm into that. Definitely, terrible for you with how creamy it is. Lamb Curry is delicious. I love the curry itself. The lamb is tender, but a little gamy tasting. Garlic Naan is a must. They have the best naan. I also like the Serrano chili naan, but just prefer garlic. Rice is cooked perfectly.", "author": "Gabrielle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "I had yet to be impressed by Indian food on the pacific coast....until we came to Om! There were five of us and they were careful to make sure our order was correct. The owner was personable and even gave us a free appetizer after some cheerful chatter. The food was delicious!!! There was a wait to get our food yet it was well worth it. We did have a show to get to so they were happy to make sure the bill was brought out timely and worked with our various payment methods. They are still setting up the back dining room yet the smell of new carpet did not take away from the delicious food.", "author": "Amanda F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "I was pleasantly surprised about just how good this food was. I had almost given up on good Indian food delivery. We ordered the special combo for 2, which came with tons of food, enough for leftovers the next day, at least for one person. (Having enough for leftovers is one of my main criteria for judging a delivery place.) All of the food was very flavorful without being too spicy. The naan was also perfect, as were the samosas. Yes, it was a little on the pricey side for Indian, but it seems like there is nothing affordable left in this city.", "author": "Amy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "I came here with some friends just randomly and we loved our experience!! Our waiter was so funny and the food is very fast and delish! Highly recommend to anyone who wants to try some authentic Indian food!", "author": "Cecily D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "I was trolling around height street, when I saw this new place I first hesitate to give a try because I had a bad experience with previous name. I tried their tandoori chicken, it was perfect. Chicken was well cooked and right amount of onions. I tried their Gallic naan which was the best naan ever had. Server and waiters are  very friendly. I only regret is I didn't try their other food. Restaurant was super clean and nice aroma as soon as I entered. I recommend this new restaurant to my friends and family", "author": "Sugam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-23", "description": "Really good flavors, but they're definitely not subtle. The momo are kind of overwhelmingly seasoned (good, but in small quantities). I would have liked the samosa a bit more crisp on the outside, but otherwise really good. I ordered the chana masala spicy, and it was well balanced -- definitely some heat, but not overboard. A good 4 out of 5 on the spicy scale. Prices are good, delivery took over an hour on a Monday night.", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "This place is kind of close to where I live so the delivery was way faster than I expected. The food was also really good.", "author": "Lori L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "After my last review of Om I was contacted by the owner and was told they were having trouble with their ovens the night I placed my order. I can definitely understand not having a good night. Considering the owner reached out to me to apologize personally I decided I would give Om a redo. I decided cto go in person this time. I realized that the location has gone through several changes. Originally it use to be Tikki Masala, then I think it became Tikki Masala Indian Pizza. My previous experience at those past incantations was average at best. I'm happy to report that Om has renovated everything and it actually a very nice semi formal restaurant. All the previous diner furniture has been replaced and all the employees wear a formal uniform. We ordered two entrees, an appetizer, and some naan. Everything came out in a timely manner and was cooked to perfection. The service was top notch and I couldn't have had a smoother dining experience. All in all I'm glad I came back to Om. I have no doubt my previous experience was a one off. I look forward to coming back to Om in the future. It is definitely the best Indian restaurant in the Haight.", "author": "Thomas Crown O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Just one experience, but terrific delivered food. Oh I hope they stay this good! Excellent garlic naan, saag paneer, butter chicken masala, lamb chops. Came hot and we specified one dish medium hot and one mild and that's exactly how they came!", "author": "Jane M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "We found parking on Haight Street and started trolling for a restaurant. We walked past a newer looking Indian restaurant and after reviewing the few Yelp comments we decided to try it. Good move! This place is only 8 days old and has excellent service, fresh food and beautiful interiors with painted murals depicting Indian life and landscapes.\n\nWe ordered aloo gobi, coconut curry, nann, lamb saag that was a lamb shank. Great place for vegetarians.", "author": "Robert T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-27", "description": "Strictly reviewing their delivery, not the ambience. Fast, friendly, delicious, consistent.", "author": "Dylan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "Ordered pakora, vegetarian momo and dahl makheni. All were great. Delivery was fast. Delivery guy was very friendly. A bit regretting I didn't tip him more.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-17", "description": "Good food. Service has a way to go but they're still finding their feet. Very excited.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "Very good Indian food, delicious layering of spices in all the dishes. Went there for a late lunch....we were the only table in the restaurant. Seating was in a back room, kind of made for an odd experience. Our server was part of the family that owned the restaurant, he was very kind and helpful.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "This has been the best addition to the neighborhood in a long time!  We haven't had a great Indian spot in Upper Haight and now with Om Indian Cuisine we really do.  I used to have to go to Lower Haight for my Indian fix but I now prefer this to the further options I used to visit.  This is now a once a week place for me and I hope they have success in this location.  The staff is also really nice.\n\nI've tried a few of the things here, such as the Biryani, Tikka Masala, and the Chicken Korma.  For me, the Korma really stands out - this is my new go to.\n\nI haven't eaten inside yet but the place looks really good - they clearly did a lot of work after taking over from the previous establishment.  One area that I think could be improved are the expected pick up times - there's a huge variance when you order online and it's hard to tell when I should come in to get my pickup.  However, this is a new restaurant and I'm sure this will improve with time.  \n\nGreat addition to the area, I'll certainly be back in often!", "author": "Max B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-19", "description": "I ordered during lunch time of day, it was very nice, especially I liked kind of spices they use, and the meal was hot when arrived.", "author": "Henry G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "We do delivery from this place a few times a month. The food is amazing, and so is the delivery speed. I'd recommend trying Malai Kofta here. Its the best!", "author": "Sam G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "Loved the food we ordered, the tandoori mixed grill and the chicken Tikka masala was our favorite!! The art work in the back room was amazing too:)", "author": "Maryam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "I ordered Om Indian Cuisine through Eat 24 over the rainy weekend and was very pleasantly surprised with both the quality of the food and the time of delivery. It was stormy and a complete mess outside but the delivery arrived early, I think in under 30 minutes - a first for me for any delivery in SF! The food was flavorful and fresh when it arrived. This will be my new go-to Indian spot for those lazy nights in! You won't be disappointed.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Today I visited this restaurant and I got a great response from the restaurant people.... The interior was nicely decorated. I was welcomed with free papadum. The sauce came with papadum had amazing flavor. I ordered  tikka masala, garlic naan and chicken tikka kebab it was so fast and very yummy...  Naan was like a foot long, tikka kebab was well cooked and chicken tikka masala is the best so far. I would definitely recommend and visit again to this fancy restaurant in upper haight", "author": "Anil P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "Had dinner in om Indian restaurant the menu was exquisite and the service was excellent the most tasty chicken tikka masala I had in the Bay Area and lastly I ordered mango lassi the taste was out of this world.the best part is that everything is served a la carte from the menu. I also asked them about home deliveries and they have told me that they do free home delivery service to their customers.one of the best Indian restaurants in the Bay Area", "author": "Bhargav Tej Kumar Reddy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-14", "description": "This is probably the best food I ever had. Momo is excelent. I really appreciate the cook and waiter who serve such a good food in the time even the customers are full. I will definetly visit next time. best of luck.", "author": "Kshitij S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-06", "description": "Oh my goodness, I eill never forget the Basmati rice meal I had the last time I was there with friends. Loved the curries and pilau. All were well served!", "author": "Kirk C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "I came by yesterday while strolling around height and ashbury. I was so impressed by the quality of their food, considering that I went there on the second day of opening. I ordered the chicken tikka masala and it definitely surpassed my expectations. The chicken was so juicy and tender and the sauce was creamy and coconutty. I'm proud to say that, that was the best chicken tikka masala I have ever had! Even though this place is still under some construction, it has a pretty chill vibe the service was adequate. I will for sure come back and try their other selections of food.", "author": "Ashley O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-26", "description": "Great food. Great service. I came here the other day with my friends. We looked on Yelp for Indian food nearby and the reviews here are right. The food is fantastic.", "author": "James F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "I heard from the manager after my previous review and gave the place another chance. They've really turned things around with customer service and I am now a regular (I primarily use them for delivery and take out )", "author": "June O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "Fabulous food and friendly environment.specifically chicken tikka malasa was very tasty", "author": "Madadi R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "I've never been to India so I don't know how authentic the food is but I really liked it. It's a big step up from its two predecessors. The owner Ajay (sp?) is young, ambitious, and wants to provide good food and service.I had both.  The chai spices are subtle and not overwhelming.  The creamy tikka masala has a hint of spiciness which I like.  Had a choice of little to heavy heat.  The mango chutney and raita are a nice accompaniment .  The chicken was tender and fresh.  I took 1/2 my order home to save for dinner. It was even better reheated.  I can't give it 4 stars cause it's so new and will have growing pains.", "author": "Alston L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Om delivers to my house. Good fresh vegan food; reasonably priced, mild as I ask for and doesn't upset my stomach like some other places. Always on time.", "author": "Rima S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "We finally found a good Indian restaurant! We've been searching since we moved to the city for our go-to Indian place. Who'd have thought this would be the place!? The Chana masala was just like homemade, garlic naan was delicious, baingan was perfect. This is an Indian restaurant that we'd bring our Indian family to.", "author": "Josef N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "We stopped by yesterday with our family of six and were initially a little wary as the decor was still being finished. However we were VERY impressed with the food. The butter chicken and daal makhani were the best we have had for a long time. The lamb was amazingly tender in the kebabs. It's a pity we are visiting from NJ otherwise we would be here again next week !", "author": "Kiera H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "Amazing food. The tandoori wings and all things tandoori on the menu are a must. One of the best Indian spots in the city!", "author": "G W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Ordered the chicken tikka masala, garlic naan, and rice pudding. Everything was delicious and the fresh basil they provided was such a nice topping. Free delivery was nice. I couldn't finish all of the food but I will definitely have some of my leftovers later. So good!", "author": "Sean S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-16", "description": "Came in with a friend at 6-it was completely dead and they sat us down. The waitress was so abrupt and rude. She was walking away when finishing my order and wasn't pleasant. The Chana masala and naan was pretty good but the in house service and vibes are not good. Would recommend the the food though", "author": "Campbell R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-03", "description": "i'm really conflicted bc the food is super good but i found a giant cockroach in the rice last time i got it so.. maybe ill come back after they exterminate", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "Om is really good.  It is fresh, tasty and a pleasure to eat.  We like the Masala very much, but also enjoy other dishes (the curries are great too).  I recommend this restaurant without any hesitation.  Enjoy", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-28", "description": "Haight lacked good Indian food for a while. Being an Indian, this is good comfort food. Friendly staff and quick service is awesome.", "author": "Chi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "If your looking for an authentic indian restaurant look no more, this place is really good.We came in with a group of friends on a busy day,We ordered chicken tikka masala, garlic naan, and tandoori chicken.We liked all these dishes and chicken tikka masala yummy and the best i have tried in the bay area.Overall this place is really nice,delicious food.", "author": "Soma A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "Om Indian cusian has best flavor of Indian food.  They have good collections of local draft beers too. I ordered chicken 65 , saag paneer,chicken tikka masala and chicken achari. Everything so delicious. I never had that flavor of tikka masala anywhere in Bay Area and samosa was cooked perfectly and crispy.l'll come back again.", "author": "Krishna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "Don't know exactly from where I could start... I wasn't aware of this place until i step in... I was greeted as soon as I entered later I came to realise that he's the owner of that place Mr.aj Not too clumsy good scape between the tables which gives some privacy which has been lacked now a days beyond that we were given enough time and complimentary papad mean while we had a good glance at the menu.... Here's the real part which proves the class of the restaurant in which this place has excelled.... Can't say one particular dish is delicious I tried some pakoras tandoori chkn wings and the chicken tikka masala with garlic naan and some basmati rice which are really mouth watering, it's better to try this kind of place which is run by an individual who treats each and every customer in a well mannered way which makes people feel comfortable who came to dine out with some hunger,celebrate their memorable spl movements obviously expect some hospitality which these guys had plenty some ova here with some delicious mouth watering tasty food started  loving this place hope to see you guys soon... You guys gonna rock for sure,I wish you guys a very good luck.", "author": "Phani C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "Great addition to the neighborhood. Went in expecting the same take out place that had been there before and was pleasantly surprised to see a white tablecloth restaurant. The owner was very friendly and food very good. Watch out for the spicy food as my 16 year old learned the hard way!", "author": "Megan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Great food and service.  We had the tandoori chicken, mono, okra, and shrimp curry and it was delicious", "author": "Amit P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-06", "description": "Excellent breads, good curries. Friendly staff and pleasant atmosphere.", "author": "Nick N."}
