{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Here for a quick lunch with my colleague! It is not as busy and we were being served right away :) \n\nThey offer special lunch menu, but it is still above average lunch price for a Thai place. All the basic dishes are about ~$14.  I came for their Snow White ($20) because it looks very tempting from photos. It is not disappointing me!!  There is white wine and lots of seafood in there. A very rich and flavorful dish.  My colleague and I will definitely come back for it.  \n\nPro: It is a decent place for dinning with friends! Parking is very easy since it's close to residential areas.  Their dishes look very aesthetic and fulfilling :)", "author": "Shuyi L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-19", "description": "It was my first time here. I came here when it was Osha and loved it, saddened it closed. I came here with the expectations that this was Osha, reopening with different management. I was utterly tricked by my grandparents (or it was a communication issue) and imagine my shocked expression when I saw that the sign in fact did NOT say \"Osha\" but instead \"One Waan\". I was confused but my grandparents continued to stroll in like they have been here countless times (they have not and their confidence was utterly shocking). \n\nWe went to eat lunch and got the lunch special. I had gotten the House Salad, samosa, and the yellow curry (which only comes with chicken, costing about $13). \nHouse Salad: I have had a peanut dressing salad before at a Thai restaurant but I do not recall one as... spicy? as this. It left a burning sensation in the back of your throat. Now, I am not of legal age to drink alcohol but I would imagine that the dressing has a similar burning taste in the back of your throat as downing vodka. \nSamosa: I was really looking forward to this. I love samosas with a burning passion. But man, was I super disappointed when it came out. There was only one, and it seemed like they tried to make it deep fried but left it in the fryer for a few minutes too long. The outside seemed a few seconds shy of being burnt. It had a hard exterior and wasn't like any of the samosas I've ever eaten before. (not in a good way). The insides were average, nothing superior but not bad either. \nYellow Curry: Just like on the menu, there was chicken, potatoes, and carrots with some onions. I found it super funny but there was this HUGE piece of potato in it. Like they took a Parel potato and cut it in half. There wasn't a huge bunch of chicken. It was about the perfect amount. Although, just like the potatoes, there were large pieces of chicken. It seemed as if they only could allow certain cuts per dish. \n\n(a longer description for those who want it):\nWhen you first step in, there is not a traditional waiting area where a hostess will appear (attached is a picture of what I am talking about). If a waitress doesn't approach you, then towards the back of the restaurant, there will be a long table (kind of the bar area but without any stools). where the waitress/hostess might be. If it's not busy (like it was when I went), she will give you some table options and you might be able to choose. As you settle in, she would come and hand you the menus. She would check on you to see if you were ready to order. The salad came in about 5 minutes. All of the dishes came out fairly fast. Although, she did not come and refill my cup when it was empty. Which is absolutely ok and fine for a normal person but I am an awkward person, so i couldn't muster the courage to ask. But again, fearless grandparents asked for me. She came and brought one of those huge glasses that hip places have now a days so you can refill it yourself. For socially awkward people, this may be a place where you might not feel 100% comfortable. \n\nOverall, I like Osha better. But, this is an ok place. I highly recommend this place for lunch.", "author": "Naomi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "My FAVORITE Thai restaurant ever! Probably the best thai food I have ever had in California! Wonderful experience! Food presentation and taste is so on point! \n\nWhy I was here // Came in for Friday dinner and we called in to be put on the waitlist. Street parking was easy enough and we arrived and were quickly seated. \n\nService // attentive and very friendly! \n\nFood// \n\n-Drink // coconut juice to start and it was refreshing! Even came with a pretty purple Orchid\n-App // mango prawns // WOW! A crispy jumbo prawn delight with a tangy sauce and fresh mango, onions, and peppers. \n-Soup // Tom Yum // Probably the BEST Tom yum soup I have ever tasted. The broth had the perfect flavors combined with the freshest ingredients. \n-Entree // Curry noodle // yummmm! Delicious rice noodle in a mild green curry sauce..(if you like spicy you can change the spicy level as well!) \n-Entree // Lava beef // really beautiful presentation! From the stacked onion rings - which kind of tasted like funnel cake to the flavorful pieces of beef in sauce! \nSide // coconut rice // just try it out, it's amazing and pairs so well with everything! \nDessert // Mango pudding // my least favorite but still tasty nonetheless, I really want to try their mango sticky rice next time. \n\nOverall// cant wait to come back to eat more of their dishes!", "author": "Emily T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-09", "description": "I'm fed up with delivery from this place because they don't include utensils or napkins. Who doesn't include these basics with takeout!?!?! Ordered from here multiples times. Asked them nicely a couple times recently to include at least a damn plastic fork. At just about $20/dish after tax, you're not up to the investment? I'm supposed to eat with my hands? Get a clue. Taking my business elsewhere now.", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "I was actually impressed by the quality of the food here. We ordered 5 different dishes, all were absolutely delicious and looked beautiful. \n\n1. Corn pancake appetizer - super crispy and the sauce that came with it complemented it really well. Would order again.\n\n2. Tom kha soup - perfect balance of sourness and creaminess. You can definitely taste the spices in the soup. Very flavorful.\n \n3. One waan snow white - my favorite dish. The udon was cooked perfectly with just the right amount of chewiness. I was so surprised by how chewy the noodles were. The sauce was super creamy and not too heavy. It came with seafood. Definitely must try\n\n4. Khao soi - second favorite dish. The curry was so creamy and delicious. It came with a big piece of chicken which was tender and moist. The best part about this dish was the udon, super chewy.\n\nI wanted to try their mango sticky rice dessert, but the waiter told us they didn't have any mangoes since they were out of season so they let us try the sticky rice with mango ice cream instead, which made it kind of too sweet but still tasted good. My brother and I couldn't finish it cuz it was getting too sweet and it came with a lot of sticky rice, which had an interesting bluish purple color. \n\nThis place would probably be more busy if it was in a different location, but since it's more in the outskirts of SF, there's not usually a wait unless maybe if you come on a weekend for dinner. If you take Bart, the restaurant is located right when you get off Glen Park station. Inside is nicely decorated and the staff are friendly. Can't wait to come back to try their other dishes!", "author": "Valerie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Found on yelp decided due to several factors that we would try it.\n1. Does it have food choices thay noth meat eaters and vegans would enjoy..chec\nk\n2. Do the use fresh ongredients...check check\n3. Is parking relatively easy..check\n4. Place is very clean. Check\n\n5. Food is off the hook. Super check\n\n6. Service is really nice and accomedating. Check\nWe so look forward to going back and totally recomend one waan to anyone...it is a littl gem of glen park. Btw it is right accross from bart too.\nWe had three apps, 4 entrees and drinks. Lovely presentation and service too.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-27", "description": "Definitely not 5 star so they are getting docked a star for this horrible dish make. Bacon wrapped scallops. More like bacon wrapped uncooked bacon SMH...looks nice from the outside but once you take a bite, you ask yourself; where's the scallop? Take it apart and look, a cute, baby scallop wrapped in like 3 slices of bacon, the inner most being uncooked. They gotta do better...\n\nOther than that. Pretty decent...", "author": "Titus H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "One Waan... five stars for saving my life. \n\nOn a regular occasion I think they might get a four-star from me but earlier this week a sickness had me literally descending through the layers of hell and one night I didn't have dinner available at home and I was like omg what am I gonna do am I gonna just go to sleep without dinner??? maybe. but how is my immune system gonna fight the bad guys without fuel?????? so ten minutes before i got to the glen park BART station i decided to order the Pad See Ew with chicken ($13.75) to go. I arrived at the Glen Park BART station and headed over, not necessarily expecting it to be ready since I had literally just ordered it but it was ready within 5 minutes of me arriving and I walked home to enjoy it.\n\nLiterally no joke. The first bite of it was euphoric like the pad see ew made my sickly self feel SO GOOD. Like the combination of sauce, rice noodles, chicken -- ugh YES. That evening was also extremely miserable for me but the pad see ew was the highlight so much that the next day I did the exact same thing and ordered tom kha soup and pad see ew again. Thankfully I had decided on this early enough so I put in my order thirty minutes in advance this time so it was perfect to pick up right when I got there. This day I was getting better so I was a bit underwhelmed and I would actually not recommend getting the tom kha soup lol but the pad see ew is good stuff.\n\nAnyway, tldr: great Thai food located RIGHT across from Glen Park BART. If you want to order takeout recommend putting in your order about 20 minutes in advance - (I did it through Yelp, and Yelp says it takes 65-75 minutes but that's a lie). Highly recommend the pad see ew. Thank you for saving my life figuratively when I was close to death this past week.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "Ate to go food at home. Ordered chicken & lettuce wraps. Since it was to go, the sauce arrived in a small container and I ate it sans sauce. It was still tasty and had crunch to the lettuce. The shrimp spring rolls were extremely large including the shrimp.  The cilantro was a bit strong!  The crackling chicken salad was good and full of covering on the chicken. I'd order food here again!\n\nAnother night we decided to eat at the restaurant. The places surrounding the restaurant have bars on their doors and windows. Walking into the restaurant, it's tastefully decorated. The service was on par and the food was amazingly great. The chicken satay was perfectly moist & the best I've had. I ordered the BBQ Duck over spinach with broccoli & brown rice. The duck was the tastiest and moist I've ever eaten. The spinach had a great flavor to it. The broccoli was al dente and steamed with no flavorings. The brown rice was also the best I've eaten. Great Thai restaurant, I'd go back for sure.", "author": "Terese C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-16", "description": "Really a shame that OSHA Thai sold this location. I never had a problem with osha. However I ordered take out from One Waan tonight.  First thing I noticed was they forgot to include the jasmine rice that was supposed to come with the order. While on the phone with them I then discover that the potatoes were grossly undercooked, basically raw and inedible. \n\nThey refused to deliver me a corrected order and called me a liar on the phone. He said I was making up the story about the potato because they refused to deliver the rice (that they had left out of the order).   See below the raw, rotten potatoes they served. \n\nI highly suggest, unless you want to eat rotten produce, that you stay away from this place. Maybe if they close down OSHA will open back up?  One can dream.\n\nEdit: Wow - so the owner of One Waan just lies as easily as Trump.  \"You didn't order the rice, so how was I supposed to know you wanted rice?\"  - problem... it's required to answer what kind of rice you want in the app.  You literally CANNOT put it in your shopping cart without choosing.  And \"No Rice\" is not an option (see the pictures).\n\nAnd yes, after 1) not getting everything i ordered 2) being called a liar on the phone, 3) discovering that you use rotten uncooked produce, I lost my appetite and didn't want to eat anything I had ordered and asked for a full refund.  And I'm not about to spend MORE time taking it all back to you.  If you want it, come to my house and fish it out of the garbage, which is where your food belongs (sorry, i mean in the green bin... I assume the food, while rotten, is at least compostable.)\n\nLets move on to some of your other \"gems\"  \n\n\"We never have any problems with our orders\" - just look at the 1-3 star reviews, a reoccuring theme is leaving things OUT of take out orders.  But keep gaslighting and call all of us liars...\n\n\"Then you hung up the phone\" - after you called me a liar.  When you are so rude and disrespectful to a customer, there is no reason to continue a conversation.  I did not yell, scream, or insult you.  I was not rude.  I'm not going to continue a conversation with an arrogant, obnoxious owner.\n\n\"Maybe cooking the potatoes for so long changed the color\"?  To black?  No - that's rotten dude.  Also, if you simmered white meat chicken and potatoes for two hours 1) The chicken would be incredibly tough and the potatoes would be incredibly mushy. So either you used a cheaper cut of all dark meat chicken - and still are charging a premium price for it, or you just normally serve bad food.  Or perhaps you meant that the curry simmers for 2 hours and not the chicken and potatoes, although you certain tried to imply that you cooked the potatoes for the full two hours as a way of \"proving\" that it couldn't possibly be under-cooked (even though I provided a video showing that it was).\n\n\nInstead of trying to defend your wrong actions and bad food, fix it. There are NUMEROUS negative reviews for your lack of attention to detail (leaving things out of orders) and poor attitude by the staff.   Gee wiz is it all of us?  Or is it you?", "author": "P K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-30", "description": "My friend treated me to a birthday dinner here.  \n\nFood = good. \n\nCrunchy Calamari (battered calamari, green apple, sriracha cream) = okay. $10.50.\n\nTom Kha (coconut milk soup with lemongrass, galangal, kaffir lime leaf, and mushrooms topped with cilantro and green onion) = good. $12.95 (large)\n\nPumpkin Curry (kabocha squash, bell peppers, jalapeno and basil leave in red curry) = good. $15.95\n\nDrunken Noodles (Fried flat rice noodles with garlic, fresh chili, tomatoes, onions, jalapeno, basil and bell peppers) = excellent. Definitely my favorite dish. $13.50.\n\nMango sticky rice (sweet pandanus coconut sticky rice with sweet delicious fresh mango) = good. Good portion. $8.95 x2\n\nService = friendly and attentive. \n\nPrices = moderate. Dinner for two came out to $76.82.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-30", "description": "Came at 8.30pm ish Friday night. Seated fast. \n\n9pm I asked our server if they have a dessert menu after she took our orders. She said she will bring the dessert menu to us.\n\n9.50pm I was flagged down the male server as my server was n/a. I asked for the dessert menu. He took out his phone. For a second I was like...are you trying to answer a phone call right now?! But then after checking the time on his phone, he told us \"kitchen is closed\" and walked away. No sorry no nothing.\n\nI called my server again and asked her for the dessert menu that she forgot to give us the first time. She gave me an annoyed face and hastily gave the dessert menu to us and asked right away \"so what do you want to order?\" Hello...do all the servers here have manners?! First of all you can't just hand us a menu with an attitude and immediately asks us what we want. It's our first time looking at it! And it was also your fault your forgot to offer us dessert before the kitchen close! If anything, I should be the one giving you attitude!\n\nI decided not to order and she SMILED (how dare she) and gave us the bill.\n\nYou guys need to train your servers man..\nIf kitchen is closing then you need to tell your guests if there are any other last orders!\n\nFood rating: I've had better with cheaper price. Come here if you want a nicer ambience for thai food.\nParking: may be hard to find\n\nThis place deserves 4 stars but the service I got on my first visit is just horrible for a nice place like this. I came here for good food and good service, not for service like in chinatown!", "author": "Inez J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-26", "description": "Update: \n\nDear owner:\n1) yes, we called in to make a reservation (you know, the old fashioned way. 2+1 stroller); do modern methods of making reservations take priority?\n\n2) Please read carefully what I wrote; the table offered to us was a bench seated table, how in the world do you suggest a stroller fit in? \n\n3) Your employee didn't mention anything about the larger party's reservation; your problem lies there, not in my lack of telepathic abilities. He rushed off without an explanation as if 5 seconds worth of words would be a waste of time and breath.\n\n4) The last part about your food tasting like shit is not meant to be taken literally, but figuratively, sorta. My appetite was still ruined. However, my wife still needs to eat; and yes, we took the food home because I don't believe in wasting food. \n\n5) Lastly, instead taking an objective stance on the situation, you sprung to defend a poorly mismanaged incident. Maybe reflect on how your employees fucked up and not why I was annoyed? \n\nYou may be wondering why the upgrade from 1 star, remember that food I didn't want to go to waste? My two dogs told me they wanted seconds.", "author": "Ben P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-07", "description": "Used to be Osha Thai. Relatively empty here when we came on a weekend night. Friendly staff, fast service, food was delicious. Food is pricier than some other Thai restaurants though. Parking is hit and miss in this area.", "author": "Long C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Husband and I stopped by for a quiet Saturday night meal around 8:30 PM after a long tiring day - and the food was just what we wanted. We got the tom kha soup with tofu (too much tofu, i'd probably just have it plain next time) , pad thai and drunken noodles. I had asked for the drunken noodles to be spicy and OMG was it spicy - loved the kick out of the chillies . Had to get a mango ice cream to finish after all that nice burn in my system ;) Definitely see myself going back esp since its so close to home.\nAmbiance was pretty nice too! Also i saw many kids, so kid friendly ++", "author": "Anju J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "Best thai food in the city! I live in San Francisco for long time! Friend insurance this thai restaurant. Come with family four people. We ordered crunchy calamari, bacon wrapped scallops, angel wings was super delicious! And we also ordered green curry with prawn! Snow white, grill salmon moroheiya ! All super delicious! And super fresh! Dessert we had mango sticky rice! Everything was wonderful! Also the decoration was very pretty! All my family love it! We will come back for sure! And we will tell friends come! Lucky to have this thai restaurant in the city!", "author": "K O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "Nice Thai restaurant located in the Glen Park district of SF. Came here for a late weekday lunch (close to closing) and ordered a pad thai. It was pretty good -- the noodles, tofu, cilantro, bean sprouts, and pork was doused in a tangy and rich sauce. Portion was a bit small for the price but  reasonable for the quality.", "author": "Alvin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "Amazing. I got the Japanese udon curry and it was pretty amazing. I wasn't expecting it to be so good. I would definitely come back.", "author": "Jameela F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-19", "description": "$18 for 6 pieces of duck is not acceptable. Just because I ordered online does not mean you get away with skimping. $18 is the price of a whole roasted duck.", "author": "Raymond G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "I like to come here for lunch because their lunch combo comes with soup or salad, one small appetizer, and a main dish. Portion was good and I enjoyed it so far. Foods tasted good so far for the various things I had ordered. The wings could be dry so I always asked for extra sauce. I ordered their pina de lycee drink and it was so good! I don't need to wait for a table so far and parking usually is not difficult. Recommend for a good Thai lunch.", "author": "Lena H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-19", "description": "Not sure why people raved about this. Personally, this is not very much Thai but the scale is skewed towards Fusion. Had Pad See Yew, Tom Kah and Drunken Noodles. \n\nAs someone who loves Thai food and coming from Southeast Asia, I always cringe at the boiled western vegetables in my Tom Yum, Tom Kah...Pad See Ew in the US. I have looked past that but well, the flavour is really flat for both soup and noodles. I love the basil taste but it did not save the Drunken Noodles from disappointment. Well if you are in for 98% Fusion + 2% Thai food, this place is for you!", "author": "Wensu L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "Decent Thai food with excellent ambience, service and location. They have good drinks available as well. I tried the best lychee tini it was different and flavorful\n\nMango avocado roll is one of the highlights of the place. They have some good curries and stir fry. \n\nBeen here a few times and it's never disappointed.", "author": "Milana R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "A friend recommended that we check out One Waan and I'm so glad we did. First, I knew it was going to be good because we got the only parking spot on whole block in front of the restaurant on a Friday night. lol\n\nNice clean, modern decor and a great staff that are there to make sure we had great dining experience. What really surprised me was One Waan has an extensive cocktail menu that tasted excellent with our delicious appetizers, entree dishes and even our desserts.\n\nOur favorite dish was the Crunchy Calamari, Angel Wings, Corn Cakes, Mango Panna Cotta, and of course the cocktails.\n\nEven though we've already ordered quite a few dishes, we're eager to return to try the other foods One Waan offers on their menu, but also to say hi to the most welcoming and friendly staff, a rarity nowadays IMO...\n\nGo check out One Waan!", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "Very modern and chic interior! Everything seemed very clean and decorative. Made a reservation through Yelp - simple process. \n\nFood:\n- Yellow Curry Chicken ($16.50) - the portions make look small but it was really filling for my friend! The chicken was kind of bland but she enjoyed her meal overall\n- Pad Thai w/Chicken ($13.95) - my friend also liked her meal. :) \n- Crispy Chicken Fried Rice ($13.95) - It's basically chicken katsu fried rice but they really skimped out on the eggs.. I barely saw any eggs in the fried rice. I do wish it was a little more refreshing with more vegetables because the fried chicken was dry.\n\nThe drinks were all refreshing! I would definitely come back here during happy hour. Everything was really presentable, which shows how much effort they put into it. I can't wait for my next visit here!", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "This was an overall perfect dining experience. I came here on a Sunday evening so it was not too crowded. The decor was nice and the place is clean. The employees were very nice and helpful, especially the owner of the place. I cannot remember his name but the man who runs the place is great. He is very helpful if you need recommendations and you can tell he is very passionate about the food and the restaurant. Everything we ordered tasted wonderful and the presentations were beautiful! I hope this place does well, they deserve it! I will definitely be back. New go to Thai place in sf.", "author": "Dana W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "We Stopped by for Dinner last night after seeing the Pictures of the food, and reading their menu. Our Friend had Lamb Chops, rice, and  Salid. My Daughter had Calamari Appetizer, and beef soup, my wife had Tofu peanut sauce Broccoli, cucumber Salid, brown rice, and I had Combucha curry with Chicken, and white rice. Everything was excellent, and great service. \n\nHOPE to go there again soon.", "author": "John L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "Glad to have come across this place for delivery. They packaged it very nice and wrapped really well since I ordered soups. I love that they were able to accommodate special request of no sugar which I greatly appreciate. The items that I ordered were Tom Yum with beef and Tom Kha with Chicken. Portions were good for the price in SF compared to others in the city. Both soups were delicious and filling. I just had that very satisfied feeling as I laid down with my eyes closed smiling after the meal. I definitely want to come back and dine-in because the decor looks really nice and the food presentation. Thank you for existing!", "author": "Mark C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "I'm delighted to have this gem in my neighborhood. It used to be an OSHA Thai, so I have to admit that I assumed that this was merely a change in ownership that would result in a similar style of food/service. But the food quality and service is several notches above the former OSHA. The service was somewhat inattentive for how not-crowded the restaurant was when we came in (hence the 4 versus 5 stars), but the food was delicious and the presentation is over-the-top gorgeous. The atmosphere is lovely, and as a bonus, they (1) take reservations and (2) I was able to get one Wednesday for that Friday night at 7 (lack of ability to reserve a table has become a problem at more and more SF places lately). The classic Thai dishes offer a lot of vegetarian options and each item our party of 4 ordered was terrific. I'll be back for sure!", "author": "Gaelen X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "Late night dinner and I am glad they close at 9:30pm. Not one of the best Thai restaurants I've been to but it's a good place. The ambiance looks really great, the host / servers are pretty nice and prices are fair.\n\nPros: \n-Portion is really huge, could probably feed three people. \n-Service is fast \n-The food is tasty.\n\nCons:\n-Parking was pretty limited since the restaurant is in front of Glenn Park station\n-Fried banana was disappointing, the breading was a little bit under cooked. It was doughy and not crunchy at all.\n\nI will check this place out again with some friends and see what their cocktail menu is about.", "author": "Andrei L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "The food is amazing. I'm not a fan of Thai food, but loved the Kao Soy here. Food portion is big and Nice ambiance", "author": "Erini L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Fantastic, fresh, & flavorful food with lovely ambience, jazz piano & brushes music, sleek modern decor, and excellent service. This spot is absolutely lovely, I can't recommend it enough! Thai food is definitely one of my favorite cuisines and the culture is often very sweet and welcoming. One Waan certainly matches that experience and expands upon it with their delightful ambience. I'm still exploring the menu, but I already appreciate the nouveau spin they put on classic dishes. The first time I came here was a year ago and I ordered the beef noodle\nsoup - lots of meat, not much veg, but good for warming the insides. This time I ordered the Tamarind soup with a side of rice and steamed vegetables and the flavors were really popping on my palate! Next time I'll definitely try a curry, I'm sure it will be tasty. Can't wait!", "author": "Ayden G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-25", "description": "UPDATE\nManager messaged me and said that rude worker was temporary and manager took responsibility. Really respected that and made me feel better knowing that the integrity and quality of the restaurant isn't as bad as I thought.", "author": "Elaine N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-08", "description": "Nice decor and ambiance. Very calming atmosphere. Staff watches you like a hawk. At first I thought it was excellent customer service but it made me very uncomfortable. \n\nI ordered duck noodle soup. The soup was decent. Nice size dick meat, a few chewy undigestable pieces, but hey it's duck. The broth had little depth, eat too many noodles and not enough vegetables although the spinach was delicious.  For dessert, I ordered a hazelnut dish.  Something I would normally not order but I wanted something different besides my usual sticky coconut milk rice.  The dessert came out looking so elegant and fancy but when I went to dig in I discovered it was frozen. The hazelnut mouse broke off the chocolate cookie base and the cookie itself had frost chips on the bottom. It tasted like freezer. $27 total and I left with freezer burn on my palate.\n\nAlthough I admired other dishes served on the menu I highly doubt I will be back", "author": "V G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Beatiful presentation and incredible flavors!! Great service, nice place for Sunday lunch.", "author": "Todd F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-22", "description": "When I saw that One Waan made Crab Fried Rice, I was so very excited. \nThe fact that is was minutes away from my home was an added plus!\n\nUnfortunately I was disappointed with my Crab Fried Rice. It was dry, I mean everything was dry. \nThe rice and the crabmeat in the rice was dry. \nI am not happy!", "author": "Jo-Etta CityGurl H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "New thai place that replaced the previous Osha thai and it is so much better! Everything tasted great and had nice presentation. The tom yum soup was Soo good and their mango sticky rice was one of the bests ones that I've tried so far. \n\nIt was a bit pricey for thai food and they only had one spice / sauce tray for the entire restaurant which was a bit weird. Not sure if they added more since.\n\nWill be coming back for more.", "author": "Denise J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-02", "description": "Unfortunately, I have to update my review. I brought my friends from Hawaii here sometime last month because I was taking them around the city. I told them how much I enjoyed this spot but I could not say the same the second time around.  \n\nPAD THAI: First of all, the color and presentation of it just wasn't apetizing and the flavor was just as disappointing. It was way too sweet and dry. \nBACON WRAPPED SCALLOPS: Definitely not as good as the first time I tried it. The bacon was hella undercooked inside I honestly couldn't eat it. \nPANANG CURRY: My bestie specifically asked for it mild because she has been sensitive to spice during her pregnancy and I felt so bad she couldn't enjoy her food. \n\nOverall, if you are not a fan of extra sweet anything I don't recommend coming here. I hope and want to say there must have been a different chef the last time I came. I personally liked the sweetness of the tom yum the first time I came with my man but my friends hated it. Because I love Thai food and I will probably be in the area again, ill probably give them another chance.", "author": "Roxanne A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-01", "description": "The avocado mango spring roll is delish. Definitely a must-have. The pad Thai could've been a little better, but the presentation was nice.\nCute ambience and friendly employees.", "author": "bianca m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-13", "description": "I thought Osha Thai was just going through some renovations when it shut its doors last month, but it turns out One Waan, a new Thai restaurant with a new owner, has opened up in its place as of this week. My partner and I checked it out for dinner last night.\n\nNot a lot has changed about the experience, really. The anchoring modern design is basically the same, though I think all the furniture is new and there's been a subtle face lift to the bar and some accent pieces. The menu feels really similar to the old place too, with its wide array of tropical cocktails, fusion-y appetizers, and dishes you find at most Thai restaurants. I enjoyed the ahi tuna tartare to start (not very Thai, but at least they served it with shrimp chips... that's vaguely Southeast Asian, right?), and the papaya salad was solid, but the green chicken curry was a little bland and had some undercooked veggies. Maybe they're still working out the kinks.\n\nThey did offer us free wine, to help celebrate their opening. That was pretty cool. And service, as always, was kind.\n\nI'm glad there's still Thai food in the neighborhood with One Waan. 3 stars for now, more to come soon I hope.", "author": "Kate V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "I popped into One Waan around lunch time today as I had to ask if they could do any meals without soy or dairy. I attracted the attention of the owner who interrupted his own meal to chat with me. He assured me that he had a chef in the kitchen and that meant the meals could be modified or he would advise the ones which couldn't. \nI took the menu home and we did our homework for our dairy and soy intolerant diner.\nTonight I walked in to order, and before I got to the main desk the fellow I chatted with earlier intercepted and he personally checked what I was ordering. That was pretty good service. We had chosen a couple of meals that weren't appropriate so he made a couple of suggestions and I went with them. \nThe One Waan Avocado Mango Spring Roll and Chicken Mango Curry were the suggestions. They were excellent!\nAll the food was good and we will definitely be back and hopefully eat in.", "author": "Sue L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "This place changed ownership a while back.  We love the upgrade.\nVery clean eating and fast delivery!", "author": "Kecia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "So gooooooood!\n\nWe finally have a good authentic Thai food in the city!\nWhat a gem!!!\n\nI love how delicates they are for every dishes\n\nStaffs are so nice friendly and helpful \n\nWill be back for sure", "author": "Yokyok N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "Amazing Thai food and beautiful presentation! Loved the mango sticky rice and the papaya salad! Conveniently located infront of the Glen Park Bart!", "author": "So P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "One of the best pad thai's I've ever had! Also the portion size is huge so I'll probably be eating this again sometime this week.", "author": "Kayla L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "Amazing dishes, nice service and stuffs. \nThe thai curries are good.\nAnd the chicken satay is delicious.", "author": "Patcharee P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "The food was delicious and my party of 3 and I did not have a problem with our dine-in experience. Definitely a more low-key place that is for a quiet dinner, nothing too loud or fancy here. The plating for the food was awesome and portions were pretty large I would say. Again, nothing too fancy but it was a nice treat for us to find a Thai restaurant so close in a residential area since we were tourists.", "author": "Megan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Excilent thai restaurant! I'm thai and i live in san francisco long time. This is the first thai restaurant test like real thai food back home! Highly recommend!! It' unique! Fresh! Less sugar! Less MSG! I came with two friends today. We order papaya salad: fresh! Testy! No MSG! It's so good! \nLarge Tom kha with shrimp: 8 fresh tiger prawn!!! And they use high-end coconut milk! Not over milky and sticky! Is very good. Its really thai style tom kha.\nVolcanic beef: good quality steak. Soft and juicy.\nGirl salmon curry is also good! \nWe also live the cocktail! \nYeah! Don't forget to order their mango sticky rice! They make with pandan leave! Very good!", "author": "Dada C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "Clean, inviting space with fresh, flavorful food and wonderfully accommodating staff.", "author": "Rachel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "Like others, I ended up stopping at One Waan based on my original plans of having lunch at Osha, the former Thai restaurant tenant at this space. Although at first disappointed, One Waan ended up being a more than worthwhile replacement for the former restaurant, albeit a bit pricey (but what isn't in San Francisco?) There is not a lunch special offer. Note to owners-please consider adding one-please and thank you...\nOther than that our meal was excellent. The veggie crispy rolls were flavorful and not too oily-although at $8.95, I would probably skip them next time unless visiting with a larger party. The entrée portions are very generous so appetizers aren't necessary, unless you've got a big group and sharing with others. \nThe presentation of the entrees was aesthetically pleasing & the flavors were quite distinct. The veggies were fresh and full of color and the meals seemed a notch up from the former occupant's dishes. I ordered the Veggie Praram with tofu and it came with tons of broccoli and spinach-definitely enough for leftovers.\nWell executed, flavorful and a modern clean space-very nicely done new addition to the Glen Park neighborhood. I'd come back again when in the area.", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Excellent Thai place - great for delivery and super easy to pick up. Just make sure that the order is correct - we had an order of brown rice left out the last time we ordered. The Tom Kha soup is especially good.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "Possibly the best Thai place in the city! What sets it apart? Fresh veggies! Yes - the veggies have a crunch to them that other places with their soggy veggies have!\n\nWe've had the green curry, pad kee maw, and crab fried several times, and they've been consistently great. I've also occasionally had the mango sticky rice and had already been a great treat.", "author": "Arjuna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "This is one of the best Thai restaurant I have ever eaten in!!! The Mango Curry was to die for!!!! I am not a veggie eater...but I will eat Moroheya Noodles anytime!!!!! The owner even took his time to say hello and give us a background on why he started his food bussiness!!!!! The place is also cozy and the staff are friendly!!!! We have been coming here almost every Monday. That is how good the food is.", "author": "Joel Jayce C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "Had the pleasure of dining here last night! It used to be Osha Thai which was a bit on the basic side. The owners of One Waan are super friendly and passionate about the Thai food they serve which is admirable for any restaurant owner (I found out they have an IG acct: @onewaanthai). They truly enjoy shopping for the freshest produce and meats, which might set them apart from other commercialized Thai restaurants. We could taste the difference here. \n\nWe started with our favorite, Tom Yum Soup. We've had it at a lot of other Thai restaurants and this one definitely topped the list. It had layers of flavor and the shrimp was not overcooked, tasted like more than just tamarind juice/paste with water and was served in a nice shallow pot with a small fire under to keep it warm. My BF ordered the Spicy Basil dish which consisted of green beans, bell peppers, onion in a garlic sauce with beef. He also requested the spicy additives on the side so he could control the level of heat in the dish (even that was presented nicely!). He fully enjoyed the beef as it was tender and tasty. I ordered the Pad Thai (always a good gauge on how the rest of the menu will taste). It was presented so nicely that I had to take a video of it, not a photo, a video. Portion size was very good; being the healthy eater that I am, I couldn't even finish it. The chicken was cooked perfectly and the noodles had good sweet/peanut flavor. Although, I probably could've used another squeeze of lime juice, but that's just me as I like that refreshing flavor of lime juice splashed on hot noodles. We also tried the crab rangoon and Thai Samosa which were also delightful dipped in the sweet and sour sauce.  \n\nWe will definitely be back to try more foods on the menu; I'm probably more excited to try that mango sticky rice!", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "This is a small and trendy Thai spot located super conveniently across from the Glen Park BART station. Compared to most other places in the city, the flavoring is not overly salty or rich, which I really appreciate, and of course sauces are available if you want to add them. Ingredients are top notch. Definitely check this place out if you are in the area.", "author": "Henry Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "So far in my quest to find new places to eat, One Waan has stood head and shoulders above the rest. It has a nice location by the Glen Park Bart, and floor to ceiling glass makes it a cozy retreat from the cold or rain. The waitresses are super nice, and service is very fast here.\n\nOn to the food. This might be the best pad thai I've ever had; it's definitely the most unique. Unlike the Mission's Chili Cha Cha 2 or everywhere's Osha Thai, the pad thai isn't over-the-top flavorful with sauces and spices. The noodles are thicker, and the sauce a little creamier. I certainly wouldn't call it a pasta, but folks that like their pad thai on the bland side would like this place. Not meant as an insult, sometimes I like it that way!", "author": "Nikhil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-05", "description": "Oddly inconsistent.  Have ordered from here several times and each time something was wrong, although the food in general is good.  Chicken satay was great one time, then rubbery and chewy the next.  One time I ordered spicy and it was fine, then the next time it was so chock full of diced red chili peppers it was inedibly hot. Then this last time I ordered a Thai fried rice and my four year old daughter yelled that it was hot and her mouth was burning!  I was surprised to hear that given that fried rice is never spicy, then upon closer inspection I noticed the same diced red chili peppers in the fried rice as well!  Just really don't get what the chef(s) are doing at this place, except it leaves us confused and wishing they would be more predictable.", "author": "Jesus H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "Nice place and good food. Small and modern design.  Big servings of food!! I was surprised but pleased. I went at five and it was dead but people started arriving as I paid my bill.", "author": "Adri L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-06", "description": "This review is for take out only: \nI've come to this place quite a few times. The food is pretty good, but the same can be said for the many Thai restaurants around the area.\n\nI'm giving a 1 star because they're guaranteed to mess up your order. Every single one of my takeouts were missing something I explicitly requested. Things like utensils, chili, rice, or they'll make you wait for no reason while your food sits behind the desk getting cold. \n\nThere're other much better options.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "best place to go for thai food. Seafood mix see ew and food is cooked in a real wok. kee mao is perfect, soup is on point, and everything is well portioned. you'll leave remembering the food was good.", "author": "Dale L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "Super nice servers and great food! Didnt wait to be seated and barely waited at all for our order.", "author": "Taylor N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-01", "description": "Came into this place on a Friday afternoon. We were greeted very nicely the moment we walked in( maybe because it was empty at the time). Server constantly checked up on us while we took our sweet one chatting it up. Loved how modernized this place looked!\n\nWe ordered the drunken noodles with an added $5 appetizer spring roll( think it was the lunch special). Proportion was surprisingly small with having one 5 inch spring roll cut in half for $5?? But it was kinda fresh though, definitely not worth it! Drunken noodles were on the same price tier as Blackwoods's Thai noodles but smaller and not nearly as good in my opinion. \n\nAlso had another order of yellow curry chicken! I normally don't eat much curry(definitely trying to change in 2017!) but this was DELICIOUS! I believe the coconut milk was the game changer but this was the game changer for One Waan for me!\n\nI'd definitely come back to try more of their dishes but the life of a broke college kid is putting this on hold at the moment! A little pricy in my opinion but I guess this is what happens in SF..", "author": "Benson W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "Excellent Thai restaurant. Food is fresh. It is very affordable. The Tom kha soup is awesome ! I also tried the praws as well, it was delicious. The deserts are good as well. Very strong recommendation!", "author": "Sara-Fleur S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "Okay, I was a big fan of Osha Thai but the food is even better here -- with more variety and all sorts of dishes I can't wait to try on future trips. Still the artistic, clean and peaceful decor and the bathroom is even more spiffed up. But most important, very nice servers!! Wonderful place, we are lucky in Glen Park to have this fine restaurant. Only thing is, the place is still cold (like previous versions), must be from the pretty glass wall in front, so bring your sweater!", "author": "B K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-17", "description": "This location used to be an Osha Thai, but the new owners have elevated the food to provide an explosion of flavors and texture that draws cravings for more.  The angel wings are fried perfectly and seasoned with a devilish sweet sauce. The pad thai is just the right amount of sweet with salt. Everything on the menu that has been tried is good. Prices are ridiculously fair, especially for San Francisco. The only downside is that they may have difficulty understanding your name when you try to place an order by phone, and you may want to use a dummy generic name like John.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Really pretty decor inside, super friendly staff. Great selection of food and drinks. Really cute spot for a date, they also have happy hour! The best green curry and really amazing fried rice. They're super good, the dishes are beautiful. One of my favorite thai places", "author": "Tasha B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "Best Thai I've had in the city in a very long time!! It replaced OSHA Thai, which was too sweet for my taste and the pad Thai was not very good. To my delight, One Waan's pad Thai is PERFECT (as well as everything else we tried)! It reminds me of Thai House (Noe/Henry), if anyone remembers that restaurant. I'm so glad I finally tried One Waban. I'm just bummed I didn't try it sooner! Will be a regular from now on.", "author": "D T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-07", "description": "Cleanliness and ambiance are super on point. I'll come back for those 2 factors alone. The plates are all very tasty with bold and not overstated flavors. As far as Thai food goes, it's top tier. The only downside is that it seems to be pretty expensive. They remodeled so I can understand why but it still stops me from going more often. I guess that's why it's a treat!! :)", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Delicious dinner! Loved the Tom ka soup, the pumpkin curry, and the pineapple fried rice! Great service with a smile:)", "author": "Emily B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-26", "description": "Ordered food to go...ridiculously overpriced, super small portions.  I ordered a seared tuna salad that was basically diced avocado, barely had any tuna, and it was the size of a tablespoon.  Not ordering again from this place.", "author": "R X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "Our first time here under the new chef and owner.  The food was excellent, fresh, light, and beautiful.  Great service and a nice neighborhood atmosphere.  We had the chef's special sping roll (avacado & mango), don't  miss they are so fresh and delish.  The I Love Lycee cocktail was so refreshing and lovely.  BBQ duck was so taste and served with perfectly cooked broccoli and sauted spinach.   Really lovely Drunkin Noodles, we did the combination seafood.  Finished with the Fried Ice Cream, vanilla wrapped in a pastry and fried.\nWe will be back!!", "author": "Tina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-11", "description": "Loved the food! Super fast for a nice sit-down. The servers were a bit anxious to get our order in which was kind of obnoxious (we were asked about four times in as many minutes what we wanted after saying we needed a minute). Otherwise great experience!", "author": "Liza S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-20", "description": "It's great to have a very good Thai restaurant right across the street from the Glen Park BART stop.  Delicious flavors in two dishes we ordered: Green Papaya Salad and chicken, vegetables in a light curry sautéed with wide noodles.  Scrumptious really.  Close your eyes and you could think you were in Thailand.  We ordered 'spicy' and that's what we got.  Usually, folks tone down the heat for the general American palate, but, though super spicy lovers who usually add hot peppers to even the 'extra spicy' dishes at other places, we felt delighted to discover that One Waan practiced \"truth in menu-ing.\"  If you're super brave/have an asbestos palate, there is an 'extra spicy' option.\n\nAs is so often the case, the Jasmine rice here is better than at all but the very highest end (read 'expensive') restaurants in Thailand itself.  Poor Thais: their top quality rice is almost entirely exported.  This leaves them with second and third best quality.  One Waan definitely got the good stuff -- and it tasted great with our Som Thom and curry.  \n\nCondiments were top notch too!\n\nService: knowledgeable, warm, and subtle, just like the overall ambiance.  What a joy to dine in a calm space with lots of light from the glass wall front and tasteful decor.  \n\nOnly down notes?  The spring rolls we ordered lacked any flavor whatsoever.  We will go back and try more dishes.  The prices are a bit higher than Lers Ros for similar dishes.  It's not fair to compare One Waan to any other restaurant b/c One Waan beats all others in SF except for Lers Ros.  I suppose that One Waan needs to charge more b/c it has lower volume, for now, than other spots.  It's hard to meet the high rents of SF without enormous volume.", "author": "Scott C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "I went to onewaan last week ! New thai restaurant near by bart station. It hard to know! There are thai!  I look at logo in front nice job look classy! First impressions service was good and friendly. Menu is different than other thai. We love mango avocado roll  alot of mango and avocado! Reasonable price . One waan tartar really good for appetizer come with garlic chip. Good for starter. It not salad. \nPad thai is wow !! Testy better thai . I went to thai before. This one is out standing !!!  Pad see ew is unique feel like dry but it is thai style really! Hard to find in sf !! Pad se ew usually very oily  here not !!  Over all very good. I will recommend  this place !!", "author": "Gig M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "Incredible food, atmosphere, and service. The weekday lunch special provides a nice spread for a good price. Dinner is costlier but has great portions. You can't go wrong here.", "author": "Brandon N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "This is the best Thai place for miles. Delicious food, beautiful decor, mellow, airy music playing on the PA. The service is also very, very good. I had drunken noodles with tofu and vegetables, and really liked it. I was in a mood for something really Thai-tasting, and this filled the bill.  For dessert we had the mango and sticky rice. Incredible presentation on that, though the price was a steep $9. Great place though--we will return again. This was our second visit.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-07", "description": "This place delivers via postmates! The food was really good and the portions were big.", "author": "Bora C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "You can honestly tell they use real fresh good quality foods !!!  The Tom yum soup was amazing flavors compare to many other Thai places I have had . I also ordered the basil beef which was amazing !  They used thin sliced tender beef with wonderful seasoning . I asked for spicy and was asked to confirm the level of spicy and actually did how I asked , which many restaurants don't listen . The beer was super cold also I ordered Changs Thai beer. My girlfriend had Pad Thai and she said it was also great and flavorful . Come eat here you will love it......", "author": "Damien F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "Atmosphere very relaxed, customer service is basic. Nothing memorable as far is location. The food is Amazing and I wondering what happen to the name change. (Is this still the same). Thanks", "author": "Tippy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Love this place!!!\n\nOne waan is my favorite Thai restaurant in San Francisco.\nService is always good.My favorites here include the Crab Fried Rice,Angry prawn and Crying Tiger.\nTonight I ordered Tom Yum soup as well as Green curry and both were delicious.I'm looking forward to my next order!!!!", "author": "May O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "The food, service and atmosphere are all outstanding. Our favorite Thai place in the area for sure. Love it", "author": "Adam G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-26", "description": "I was eating dinner there tonight since I remember before it used to my a good thai restaurant under a different name.\n\nI liked the food a lot but the portions were a little small, then the waitress started to clean all tables from the candles because no one else was there and she came towards our table and removed candle as if we were not there. Even we said something with disappointment and she wouldn't bring it back. Also they opened restaurant main door probably suggesting we have to leave even thought it was not yet 10pm, maybe 935-40, we were still finishing after dinner drinks and it was a very cold that night. They made us feel unwelcome and non important. \n\nOverall it's a good place to go when the other places you love are closed or fully booked but I wouldn't go there with my date or someone special.", "author": "Margarita P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "I walked into this place for lunch with my friends and was happily surprised by the great food and great atmosphere. I'm so lucky to have this place I. The neighborhood. It's now my go to Thai restaurant.", "author": "Andrew E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "This place was so fun! It's decor is warming and the food is so flavorful. I got the mango curry and the mangos were so fresh. I have never had anything like it. The staff was also very nice and service was fast. Would definitely come back.", "author": "Holly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "The best thai food in the area. We love the tom kha soup and the green curry. This is a place to get delivery from. We went into the restaurant once and we were the only ones there.", "author": "A M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "THIS PLACE IS LEGIT!!!!\n\nI was craving for a Tom Yum Fried rice for a while, and One Waan satisfies my crave perfectly. \n\nIt is one of those delicacies that's available only in Thailand.\n\nThe flavor + portion is on point. They are not skimping on the shrimp at all. It tastes really authentic, not americanize at all. \n\nHighly recommended!", "author": "Nelson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "I try this place couple times!  I  had pad thai shrimp , pineapple fried rice , Bbq duck and cocktail. Food look a bit expensive but, entrees come with rice . It mean not bad at all (reasonable). If you compare with another thai or asian restaurant. Look at decor and good service. The Food very testy.   I love their food. Very fresh!  Presentation very creative! Wow!!!  I recommend for who like quality food !!! And find dining experience.", "author": "Chu O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-08", "description": "Pleasantly surprised by the food here. I wasn't expecting the food here to be that tasty nor filling as well. The prices here are a bit higher than some other Thai places but the ambiance, service, and decor were quite good. One dish we ordered missed the mark (too sour) but many other dishes hit the spot.", "author": "W A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "I had eaten just 2 days ago via eat24hours.com delivery from April Nine Thai Kitchen and I thought there were probably not many thai restaurants BETTER than April Nine, especially near the outer mission, BUT I WAS WRONG!!  I'm embarrassed because One Waan is right in my own \"backyard.\"  I ALWAYS show up at Glen Park BART at least once a week and never noticed it.  I thought it was the Old Osha Thai which I liked too and which also served pricey quality food, but I always thought Osha was too formal & Americanized for my pedestrian tastes AND I don't think they delivered to my area.  Well after having ordered from One Waan, count me shocked!!    I ALREADY ATE beforehand and so I was more in an exploratory mode of eating. I read the positive yelp reviews for One Waan, trying to decide whether or not to order from it on Ubereats.com.  Based on the reviews, I thought I might be ending up with small portion dishes.  However, even if I had NOT eaten beforehand, I would have already been full or nearly full.  I fill up fast and I'm not the type of person who can eat more than 2 times in an all-you-can-eat buffet (although I LOVE and can never resist a buffet meal because of its high value/high variety of dishes, the 2nd time at the buffet table, I'll probably only focus on 1 or 2 dishes I like and finish with a salad & dessert), so base your decision of portion size on that.  I ordered the Praram\n(Peanut curry sauce, broccoli, and steamed spinach with pork) with a side of jasmine rice AND Crab Fried Rice.  Both the Praram & CFRice were as fresh as you could get.  The broccoli in the Praram was not too soft and when I mixed the thin peanut sauce with the jasmine rice, it flavored the rice nicely. I LOVE crab fried rice and their presentation for just a takeout/delivery was outstanding!! You could see large clumps of crabmeat on top of the rice as well as mixed into the rice and all of it was fresh along with green onions, mixed eggs, tomatoes,etc and on the side, a slice of lime and 2 slices of cucumber and the fried rice filled up the entire takeout container.  Both dishes were delivered at the estimated arrival time. Now if YOU WANT your thai food HOT AND SPICY, FORGET IT!! Most of the dishes are mild unless I guess you specifically ask for it. I should have asked for spoons/forks/knives/napkins since they weren't included.  Would I order from One Waan again? DEFINITELY!!!", "author": "Frugal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "Love it so far--stumbled upon the soft opening when planning to go to Osha.\n\nThe samosas were great--hand made and delicious. We were able to try both the vegetarian ones and the chicken ones. The veg samosas had a bit of a smoky flavor. Not sure if that was intentional, or a happy accident. \n\nDuck was good, and the drunken noodle was one of the better versions of the dish that I have tried. Spicy and flavorful.\n\nI always thought Osha was good, but a little pricey and a little too focused on fancy presentation. Prices are similar, but I'd say One Waan wins on flavor.\n\nWe briefly got to talk to the owner Alex. Nice guy and I hope he's able to keep up the quality. We'll be back fo' sure.", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Thai is my new favorite thai food spot in town. Loved the food and the service. I definitely recommend this thai food place.", "author": "Mai M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Love eating at this, the customer service was awesome, great presentation and the quality was on point", "author": "Daisy U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "Delicious food.  Yummy cocktails.  Friendly, professional staff.  Always accommodating when I bring in my 1 year old.  I've come with my family at least five times now and have always left full, happy, and usually with leftovers.  Only downside is lack of parking, but that's not their fault.", "author": "Amanda T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Great Thai food. Came here to celebrate Father's Day and I was impressed with everything.  The owner came out to greet us and even took our order. This restaurant had a great family feel to it and the service is great, very polite and attentive. I definitely will be coming back here more often. Anyone that lives in the neighborhood should stop by for a meal. Highly recommending One Waan to all my friends and family", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Wow! Amazing! I had the pineapple fried rice.  So delicious.   Very nice atmosphere.    Thank you owner/chef Alex for providing a quality delicious dinner.", "author": "Jim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "Decided to try this restaurant in our area and ordered the large coconut soup which is one of my favorite things to order whenever I want some Thai soup. This soup is very flavorful and I order some brown rice and add it to the soup for more texture. It's filling and enough for a dinner meal. Would definitely recommend this restaurant!!", "author": "Rina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-24", "description": "My boyfriend and I went to one waan Thai last night around 6:30pm, we heard from friends, they are highly recommend this new Thai restaurant. So we come up and want to try out. We ordered one Waan avocado spring roll and Thai samosa( homemade ), and entree we ordered spicy catfish and crying tiger and one more crab fried rice! They are so testy and great! Crying tiger steak was so juicy and fresh! Also the crab fried rice are great! They use very good crab (big meat)! And I also like the Volcanic beef ！ Love Thai Restaurant!", "author": "Chuck R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-12", "description": "Recently had lunch at One Waan and all 5 of us were very impressed. The food was all fresh and delicious. Service was excellent and the prices reasonable.  It is not a bargain restaurant but we were all please with the quality food we received for the price.\n\nWe enjoyed appetizers of crunchy calamari and corn fritters as appetizers.\n\nEntrees we had were:\nTom Tamarind soup: an outstanding bowl of fantastic broth with tofu, etc.\nSpicy Basil: with chicken, peppers, chili green beans in a wonderful sauce\nPumpkin Lover: wok stir-fried pumpkin, peppers, jalapeno, basil: delicious\nPad Thai: some of the best we've had\nRed Curry: with pork, coconut milk, peppers, etc. \n\nThe food was really outstanding and presentation and timing were spot on. We also thought the portions were more than adequate. We were all too full to have dessert. We are already looking forward another meal from One Waan tomorrow night!\n\nAnother point that I'd make is that the owner is very friendly and responsive as are the staff. I'd emailed with a question I had about their website information and the owner got back to me right away. I also asked if a reservation would be necessary given when we would be there. He said he'd be glad to reserve a table once we had the time nailed down. We weren't completely sure what time we'd get there since we were meeting friends who were driving up from the south coast but he said he'd make note of our party anyway.", "author": "Dennis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "We popped in last night to check out the new Thai and we loved it!  Everything was fresh, delicious, & sumptuous!\n\nWe had for starters: \nOne Waan Fresh Spring Rolls - super fresh & delicate\nMixed green, cilantro, lettuce, stuffed with tofu, vermicelli noodles, bean sprouts, carrots, mint leaves, basil leave, served with fragrant sweet soy dipping sauce and sprinkle peanuts on top\n\nThai Samosa - very good, and though deep fried, not oily or heavy\nA Thai twist on an Indian style - deep-fried pastries stuffed with potato, carrots, ground chicken, curry powder and onions.\n\nSpicy Basil - This was the one we all loved most!  \nBell peppers, chili, fresh basil, green bean and garlic sauce with tofu\n\nYellow Curry Chicken-Yummy\nMild curry with coconut milk and slow -cooked chicken, onion, carrots and potatoes with chicken\n\nPad See Ew-Great flavors!\nRice noodles, egg, garlic, American broccoli, and black bean sauce\n\nAlex, the owner & chef, came out to chat about his approach to preparing fresh, high quality dishes with us.  He was charming and enthusiastic. \n\nwe can't wait to go back and try the Pad Thai that Alex told us about!", "author": "Joanie c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Best Thai food in a long time!!! Been to this place twice, and it has not disappointed!  Excellent dishes and Thai iced tea.  The flavors were perfectly choreographed into delicious, artistically presented plates. Yummmmmmm!  Will be back when in the area;-)", "author": "Karen S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-13", "description": "Very cheap quality food for ridiculously high prices! I rather eat at the sandwich place next door.", "author": "Stan Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-11", "description": "I ordered delivery through Eat24 around 9 p.m.... the coconut soup was nothing but coconut milk and mushrooms with one prawn absolutely no flavor and it even tasted like they used cow's milk.... the Thai style samosas were okay nothing special... the pad thai was extremely generic and had no flavor... either all the reviewers here have never had decent Thai food or I caught them on a really bad night... I won't eat here again unless somebody else is paying for it... you guys should try Regent Thai over on Valencia that place is very very good", "author": "Karen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "My friend and I came from SF to visit other friend live in glen park at weekend. We plan to eat osha Thai for lunch but after we walked there, the restaurant already changed to be One Waan Thai restaurant, it looks clean and nice from outside. So we plan go try out. We ordered BBQ duck, papaya salad, pad Thai with seafood. They are so yummy! Before I was thinking osha is very good test, but after I tried One Waan, I think one waan test much better than osha.The pad Thai with seafood is really testy and fresh! Mango sticky rice is so good! I highly recommend this place. Lol!", "author": "Yanna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "The new owners of this place are the sweetest couple you could meet! One Waan has quality service, excellent food, and a great atmosphere. Their lunch specials are awesome if you're in the area: quick and affordable. This place is also great for takeout if you're coming home after a long day at work, usually only takes about 10-15 minutes!", "author": "Emma C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-05", "description": "Delicious and great service!  We ordered:\n\n1.) Bacon wrapped scallops\n2.) Angel Wings\n3.) Pork Fried Rice\n4.) Duck/Pineapple Curry\n\nMost everything we ordered was delicious.  The only feedback I would give would be based on preference, not quality.  The quality was terrific in fact!  I just prefer a thicker curry, but other than that, it was very flavorful with lots of tender duck.  Also, maybe a bit less bacon around the scallops would help (never thought I'd say less bacon..LOL).  So much bacon, made them hard to chew. But the scallops inside were cooked to perfection.  \n\nWe'll definitely be back!", "author": "Maryn R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "One of my favorite places in glen park --a true Thai gem. Utterly delicious with flavorful and beautifully plated dishes. My mother and I ventured here and ordered the \"Sizzling Seafood\" plate, found in the Chef's Specials of their menu. This plate came with prawns, mussels, scallops, and calamari sautéed with veggies and a delicious sauce. Paired alongside a bowl of Jasmine rice, it's definitely a hearty plate. I ordered the Tom Tamarind soup (comes with our exes of white meat chicken); one of the most flavorful soups I've tried; I could definitely taste the basil and fresh herbs which elevated the sweet and savory qualities of the soup. We also shared the avocado and mango rolls appetizer. It had a peanut sauce which was so yummy! We were beyond pleased with everything we ordered that we came almost a into later and ordered the same meal and left just as satisfied as the first time. \nThe staff is friendly and attentive too!", "author": "Vanessa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "Very delicious, it rained take-away very quickly, very clean food, very careful, I continue to support this restaurant, so I try to very delicious dinner.", "author": "Jingyun Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-02", "description": "I hate that sense that a restaurateur is trying to squeeze every penny from you, charging quality food prices but serving poor ingredients. That was, unfortunately, our experience eating at One Waan. $17 for fishy smelling catfish??? $15 for pad see ew with five dry, not very fresh shrimp?? $11 for an avocado/mango spring roll with brown avocado?? The high prices were the insult added to the injury of cheap ingredients.\n\nIf you're going to charge nice Asian restaurant prices, then serve nice Asian food. \n\nWe will not return.", "author": "M Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-20", "description": "To my formerly-favorite neighborhood Thai joint:\n\nWhen you were Osha, you served consistently-tasty gringo Thai food. 4 stars. Little greasy but that was OK. Tasty takeout at the end of a long day and ingredient quality was really good. Price was right too.\n\nNow you sell to new owners, change your name, jack up the prices, and ruin the recipes. What that what???\n\nTom Yum soup: what happened here? Sweet and lacked depth, 80% of the tasty veggies were gone.\nChicken Satay: Tiny portion (and no skewer??), marinade was bland, chicken was waaay overcooked.\nGreen Curry w/ Tofu: Curry sauce was flat and washed out. Tofu used to be plain, now it's fried. Lacked any heat. \nCrispy chicken over fried rice: Formerly an Osha favorite with the kids. Definitely different and the kids noticed instantly. Chicken breading was super bland, fried rice was OK but had an odd almost chemical aftertaste.\nPad See Ew: Closest to the old Osha version. A solid B/B+ (chicken was dry though)\n\nNow maybe we ordered the wrong stuff, and perhaps there are new super authentic dishes we didn't try. But basic noodles, curries, and soups are the backbone of American Thai cuisine. So get those right or stop trying.\n\nThe world is full of nondescript mediocre Thai places. You won't survive long if you don't get with it.  Please sell this place back to Osha. Please.", "author": "Al M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-12", "description": "The food is as good as the predecessor \"Osha Thai\", but the portions are really small.  We are NOT \"big-portion people\".  Not well priced at all. Angry Prawns; $18 for 4 Prawns.", "author": "TopCat W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Good food and good service. My waitress is kind and friendly person. Angry prawn is my favorite plate in here because the taste is so perfect between pranw and spicy sauce.", "author": "Aunchisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "Ordered delivery: shrimp pad keep Mao and chicken basil eggplant both were delicious and I'll definitely order again! Got them both spicy and it was perfect if you like spicy food.", "author": "Hira S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-05", "description": "I am super dissatisfied and extremely disappointed. I ordered delivery from this place for me and three of my friends. We got the Tom KHA, green curry and pad Thai. The portions were insanely and rudely small. This picture show $50 damn dollars worth of food from this crap hole. I am super super mad because this is a HUGE RIP OFF!! I just feel take. Advantage off. the large Tom KHA was $14 and like half the size I was expecting. And the green curry dish is probably the smallest portion I have even seen! The plain jasmine rice isn't even good. Just way over cooked.", "author": "Eli B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-21", "description": "Horrible restaurant:  totally unethical.  Had confirmed reservations for 7 pm on a Saturday and arrived 5 min early, yet they gave away our table to other diners.  Absurd.", "author": "Keith R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "Take out was great except they forgot one item and parking is really difficult so I didn't bother to go back or call cuz I paid cash. I will definitely be back to try dine in.", "author": "Speak F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-23", "description": "Same restaurant, different name, used to be Osha. Experience and quality is the same, bad!", "author": "Zeke T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "This is a good Thai restaurant. Service is so good!!! Serves are so kind and smiles. The taste is amazing!!!!", "author": "Poommy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-07", "description": "Amazing yellow curry.   Amazing Pad See Ew.   The vegetables are always on point.  The only bad experience I've had was the Massaman Curry Beef - which was full of gristle that there really was no quality beef in the dish - but I only very rarely order beef anyway.  I order from them at least once a week.", "author": "Kali C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "This is a great Thai food restaurant，we went to San Francisco for spring break, and found this amazing place, the food is delicious, the service is nice, the decor is comfortable and stylish. I just hope can always find some place like this when I'm traveling.", "author": "Yunliang Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "Oh man I loved their thai boat noodle soup!! We had three different lunch specials too - an awesome deal w appetizer and soup included. Love this place. Will def be back!!", "author": "Carrie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "I live in on Joost Ave. right near Glen Park Bart.  My husband and I passed by Osha and there was a sign saying that they were going to close their doors.  I really didn't understand why because Osha was always full. \n\n A week later, my husband and I had just come from Gialina Pizzeria across the street and we saw Alex, his wife and another worker putting up a sign for One Waan. Alex (the new owner) said that it would be a little different from Osha.  The menu would change a little and the chef is different.  We had dinner there a week ago and I must say that the service is great and the food is excellent.  I had Shrimp Pad-Thai which was really good and my husband had the Praram - which Osha never had.  The food is great and I wish the new owners all the luck in the world.", "author": "Lalo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "We live a few blocks away from One Waan and come here often. We are so, so glad that the new owners took over. The food is SO much better than it was when Osha inhabited this space. With each passing month, the food has only gotten better: fresher, more flavorful, and less \"Americanized Thai\" tasting. The service is better and the interior much nicer, too. Highly recommended!", "author": "Zoe F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "Very, very surprised by the amazing quality of this restaurant. High quality as well as beautiful plates. I highly recommend, don't hesitate!", "author": "Alexis I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "The food was okay.  We ordered the papaya salad, ahi tartare, and green curry.  The presentation was good.  The place is small and cozy, but modern.  They gave me a free glass of wine for the grand opening.  Overall, not a bad experience.", "author": "Michael N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-27", "description": "Check these guys out, you won't be disappointed! \n\nJust came back from this recently opened restaurant for my pops' birthday. Solid food and an ambiance and aesthetic commanding a bit higher pricepoint than your average Thai hole-in-the-wall. Consistent, courteous service, clean bathroom: bases covered. After hearing about the birthday boy, the kitchen surprised us with a complimentary dessert, in elegant display! We were very grateful. First review, thanks for making it a good experience, One Waan!\n\nOrdered:\nThai Iced Tea, Jasmine Tea, One Waan Lychee Iced Tea\nOne Waan Tartare, \nSizzling Seafood, Grilled Australian Lamb, Pineapple Roast Duck Curry\n\nThe lamb was cooked to medium-rare perfection, the cuttlefish light and perfectly done. There may be many Thai joints in SF, but there's only One Waan :)", "author": "Chris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-23", "description": "Never was a big fan of Osha so was excited to see a new Thai restaurant open up right away.  The service is good and friendly staff.   The owner's heart is in the right place....customer comes first.  I found the food to be good but nothing exceptional.  We had the veggie crispy roll, spicy basil with chicken, pumpkin curry with pork, and the drunken noodles with chicken.  Again, the food was good and the portions average.  Bottom line, the food, portions, and service all good, but did not justify the steep prices.  I can find equally good Thai for less.", "author": "Doug B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "We came with our family & friends for dinner and really enjoyed all the cuisines that we ordered: \n\nOne Waan Fresh Spring Roll\nChicken Satay\nDrunken Noodle\nPad Thai\nCrab Fried Rice\nVolcanic Beef\nStir Fry Mixed Veggies\nMango sticky rice for deserts... Ahhh, by far the best mango sticky rice I've tasted.\n\nThe meat and the vegetable are very FRESH and good quality!\nThe service is very nice and the owner is super friendly. \nThe restaurant has a nice ambient, which I think a good place for a date, too. \nWe came around 6.30pm and easily found a free 2-hr street parking nearby.\n\nI definitely come back and recommend this Thai Restaurant.", "author": "martin c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "The best thai food in San Francisco！！！ u guys have to try it！！ love this place！ I will come everyday if is possible！！   Dont skip dessert yes！ try it love papaya salad！ 100% homemade", "author": "Pan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "today we had 4 people to had lunch together, each person rated the foods for flavour and said how much they liked them. \nall the food is delicious.", "author": "Wang H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Excellent service ! and the food is awesome.... i and my friend have dinner here tonight. Everything is nice! Romantic environment and fresh tasty food. We order avocado spring roll and chicken satay as appetizer, is very fresh and chicken satay is very juicy. angry prawn and crying tiger is also tasty. Angry prawn is 5 big prawn with green beans is very good! Highly recommended! Also crying tiger is juicy! We will come back!!", "author": "Amber U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-24", "description": "Not good customer service.  Have eaten here many times since they reopened and food was good.    That was not the case on my most recent visit and there was no offer to remake my meal.  Since I always order the same dish, I have something to compare it to.  Won't be going back.", "author": "Mo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "Find this grand opening Thai food restaurant during my trip to San Francisco. This is the most delicious Thai food I have ever tasted. The volcano steak is fantastic and Mongo stick rice tastes wonderful. I will miss this place.", "author": "Ying L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "I love this place. Ambiance is great, and the food and cocktails are even better. I usually get the tom yum noodle soup - that broth is to die for! I also can't get enough of the lychee tini- it's Soku-based and delicious!", "author": "Elizabeth K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Fantastic lunch combos at a great price (for San Francisco)! We were so pleased with the freshness and flavors of the food, and will definitely be back again...or try delivery, which we just learned they offer. The veggie options were particularly delicious (pescatarian here) and very healthy.", "author": "J N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "EXCELLENT SERVICE, EXCELLENT FOOD!  We used to go to Osha Thai here and it was good but this is far better.  Quality of food, portions and service will bring us back again and again (well, we'll probably have delivery but we'll still drop in).", "author": "Kim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "One Waan is a great new Thai restaurant. We had pretty much given up on Thai food in the Bay Area as it has become more and more sugary over the past 35 years, even when we request \"no sugar.\" When I saw the new restaurant was open, I walked in and asked about this issue. That night, I ordered take out to be delivered, adding a note to make it with \"\"no sugar.\" I received a phone call because one of the dishes we ordered, Pad Thai, isn't really possible to make with zero sweetness. Shortly afterward, the doorbell rang and Alex, the very friendly OWNER, had our food for us, explaining that it had been he who called, and that his wife, Shirley, had spoken to him about my earlier visit. The food was great, and we went to the restaurant a few days later. This meal was fabulous, made the way we like it and tasting very fresh and flavorful. The service was super friendly and efficient, and the beer was cold. We can eat Thai food again!", "author": "Greg C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "Where do I begin! This place is a GEM! From the ambiance to the service to the food. Pad-see-ew was out of this world! I will be a frequent flyer here at One Waan.", "author": "Janna B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-20", "description": "We were surprised that Osha Thai had shut down at this location and were pleased to see that it was replaced by another Thai restaurant.  We wanted to love this place as much as we loved Osha Thai, but sadly the experience fell short for us.  We recognized at least 2 workers were carried over from the prior Osha Thai and confirmed that the cook was different.  Because the menu looked similar (prices may be a $1-$3 more), we what was different.  Waitress told us that the pad thai was different as well as the curry.  We ordered some basic dishes: chicken satay, papaya salad, pad thai, green beans with pork, pumpkin curry, mixed vegetables.  Of all the dishes, I liked the green beans dish the best.  The other dishes were bland did not have the same tasty flavors as Osha Thai and did not thrill us.  Medium spicy was not very spicy, but they brought four different hot peppers / sauces to supplement.  We were told that they had only opened for a week and perhaps they are working out the kinks.  There weren't too many tables when we were there at 6:30 pm on Sat night.  They should have a grand opening promotion of some sort to encourage people to try it out.  The menu is pricier and the portions are smaller compared to Osha Thai which is disappointing.  The good service (given the prior wait staff) remained consistent. We will likely return one more time to give it another shot.", "author": "Will L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "Stopped here for dinner on the way home after landing at SFO. We didn't know what to expect since it was new but we had our heart set on Thai food. The restaurant was actually pretty busy for a Sunday night but we got seated right away. The wait staff was incredibly nice and helpful when it came to ordering suggestions. For example I tried to order a dish that came with chicken and asked for it vegetarian. The waitress politely advised against it and made other suggestions as well that would be better. We ordered the basil chicken which was delicious, not too heavy in sauce and had lots of veggies. We got the lettuce wraps which had a strong lemongrass flavor and again not overwhelmed in sauce. We had the pumpkin curry with vegetables which was very fresh. And we had a noodle dish with chicken calamari and shrimp which I proclaimed was probably the best Asian noodle dish I had ever had. Then the chef came out to ask about our meals and explained that he knows it's not the cheapest Thai food but it's because he buys everything fresh daily and doesn't pre make anything, not even the soup! I will definitely be going back to support the local restaurant!", "author": "Sara B."}
