{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "Yummy, great find on a crazy business trip. The selection was very enticing and hard to choose from. Every dish we tried was good.  The decor is a bit tired, and the water tasted off, kinda like an pan smells when oil is baked on, weird. But, the food tasted wonderful! The staff were very friendly and helpful.  I will consider going another time too.", "author": "Klee L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-03", "description": "OK, being Chinese, when you walk into a Dim Sum restaurant for lunch and not many tables are occupied and the ones that are, are all Americans... I get a little nervous. My dining partner and I had a flight to catch and wanted to get our last Dim Sum fix in before heading to the airport. The restaurant is on a second level, we were greeted and seated by the hostess (?owner).\n\nUp front I will say the service was very very good, We ordered: Beers, Spicy Salt Shell Prawns, Shrimp Dumplings, Shrimp and Chive Dumplings and BBQ Steamed Buns. The food came out hot and fresh and tasted good. I'm glad I tried this new place for us. Would I go back, maybe... but with so many other choices???\n\nAtmosphere: nicer than most typical Chinatown restaurants. Service: very good, Food: good.", "author": "Melody K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-29", "description": "Friendly service, they can easily handle large groups.\nYou must get the bird's nest, it is wonderfully crispy Birdsnest held succulent seafood in a delightful sauce.", "author": "Deborah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Looks super janky when you first walk in but then you turn the corner and it opens up to a very nice clean place. The service and food were really fast...and great!!! The chow mein noodles were thin and not too greasy, the honey walnut shrimp was to die for and the Mongolia beef had a nice sweetness to it. Really great place that was recommended by some random guy on the street. I'm so happy we took a chance", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-07", "description": "The service was great! The food was good. \nWalking in, the outside looks like a hole in the wall, but you walk up a flight of stairs and all of a sudden it opens up into a nice good sized restaurant! I came for lunch with a friend on a Friday. We ordered the dim sum lunch for 2. It had all the items that you would want, and you don't have to hail a cart over! The pork buns were good, but nothing totally stood out to me.", "author": "Lindsey P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-14", "description": "Food was ok.  The SERVICE was terrible! They spilled tea and food on our table and on my iPhone. Never come to the table to ask us how the food was or if we needed anything else.. NEVER recommend this place again!!", "author": "Vaishali V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-10", "description": "I love spicy Chinese and they have not here. The dim sum assortment were heavy and though yummy not of high quality.  Also had salt fish and a hot chicken dish recommended by server. The heat and salt were intense but not matched by again, the weight of the batter on the fish and some of the gristle in the dark meat chicken.", "author": "Diane F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "My family and I went to the Oriental Pearl on a whim while exploring China Town during their visit.  The staff was really friendly!  The food was really tasty... I'm  used to fast food take out Chinese.  This was definitely fresh and better quality.  It was a real treat for my out of town guests!  The iced tea is really tasty too!", "author": "Javier P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-30", "description": "We went here for the Peking Duck, one of my all time favorite meals. \n\nRight in the heart of Chinatown, it's a bit classier than most, a safe place to take anyone as the decor is upscale, service is professional and the ambience is that of a higher end establishment. There was a ton of tourists and we were the only Asian people dining, even as it got full to capacity around 8pm on a Saturday night.\n\nThe Peking Duck was good, they make the pancakes for you, complete with sauce, cucumbers, scallions and carrots. I didn't like it that they did not present the duck and slice it in front of the table, and I like to roll my own pancakes. At almost sixty bucks, it was on the expensive side but I guess it is a tourist place.\n\nThere was this \"decorative\" vase made entirely of veggies that came with the duck, very pretty with the vase made of taro and the flowers made of celery, carrots, ginger and cucumber. You can't eat It though, and neither can you take it home. Strange.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-13", "description": "Date: 7/11/2017  Time: 1:05 PM  68°  Sunny\n\nAfter the tour of the Asian Art Museum, our group from the Mastick Senior Center headed to the Oriental Pearl Restaurant for a dim sum lunch. Location of this restaurant is on Clay Street, about 1/2 block from Portsmouth Square. The restaurant is on the second level. One can either take the elevator or walk up the stairs. The name of the restaurant sounds a bit cheesy to me. Is this restaurant more of an attraction for tourists having a first time experience with a dim sum lunch?\n\nAmbiance: nice for a restaurant of its size. Some artwork mounted on one of the walls. Lovely floral arrangements on the credenza. \n\nThe host and employees are attentive and pleasant. I even spoke a few words in Cantonese to them. They filled our water glasses and brought pots of tea without us asking. Service was prompt. A fixed menu was on the lazy susan at each table. \n\nSome of the dim sum (egg roll, shrimp dumpling aka har gow and potsticker) were pretty good. The remaining ones were small in size (chicken cilantro, beef dumpling, Shanghai style pork dumpling). The vegetable fried rice was slightly bland. The chicken chow mein was edible...not greasy, which was a good thing. For dessert we had sweet sesame ball, fortune cookie and mint candy. I don't know what happened with the bean paste filling inside the sweet sesame ball. It was lacking in a flavor of sweetness.\n\nInasmuch as I would like to give them a four star rating for their ambiance, service and some of the dim sum, I walked away not totally impressed with the tiny dumplings. The sweet sesame ball was a disappointment. I can only say it must be the Chinese in me to say I had better dim sum elsewhere in both San Francisco and Oakland Chinatown (restaurants and bakeries). \n\nBecause lunch was part of a tour for us senior citizens at a cost of $62 per person, I don't know what percentage of the cost was for transportation, admission to the Asian Art Museum and lunch. It has left me somewhat pondering whether the lunch was worth the value.", "author": "Carol C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Here's another fine spot in China Town. Yes an another referral to this fine restaurant. The service is impeccable and the food is fresh and delicious. \nI definitely have Oriental Pearl bookmarked!", "author": "Bruce B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-28", "description": "So I'm in San Francisco. What to eat what to eat? I ask the girl behind the counter at the hotel where to eat Chinese.  Can't skip the chance to visit Chinatown.  She said go here and here I go. I order the Clay pot salted fish, tofu and minced pork. Not bad. Not great. I'm at a 2.5 but no such thing so a 3 it is by default", "author": "Mike G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-14", "description": "I ordered the prawns with peanuts and was a tad disappointed on the size of the shrimp. They were shrimp and not prawns in my humble opinion. The brown sause with peanuts was tasty.  We ordered hot and sour soup for the table and there was enough for one serving each of the four of us.  My wife ordered the braised spicy ribs and was a little disappointed in the lack of meat on the ribs but I thought it was fine. Others got the sweet and sour chicken and it was delicious. The birds nest was exceptional. The seafood in that dish was fresh and plentiful. Overall a nice dinner.", "author": "Thomas M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "We have eaten here twice, several years apart. Both times were excellent. We were surprised that they were not busier, we were a party of 4 and got right in. Service was very attentive. Food was excellent. I can't see why you'd wait an hour at a place with a health code WARNING on their yelp page when you could eat here. Great value, great experience. Highly recommend it. We will be back next time we are in the area.", "author": "Shannon F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "Authentic and delicious dim sum and Chinese food. After being in town for business I needed to have lunch and decided to look around Chinatown for son Har Gaw (shrimp Dim sum) found it!\n\nAlso saw that they had a nice lunch menu served until 2 pm with entree rice and soup for around $9 give or take. \n\nThe food is very good and fresh. The service is friendly and prompt. They were quick to greet me at the door. The ambiance is nicer than most places in Chinatown and the health score is over 92!! This is a huge plus in the area. As I did notice some of the restaurants had very bad health scores which made me not want to go anywhere else. When I'm the area and wanting a great Chinese meal, try oriental pearl!", "author": "Roxanne R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Absolutely amazing.  So much food that we swore we wouldn't eat all of yet we destroyed it all.  Not overly seasoned and outstanding.  I will go back and try more dishes.", "author": "Bryan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-06", "description": "Our first night in San Francisco, and my friend and I were given a recommendation to this Chinatown restaurant by our concierge. From the exterior, you may think twice about going in, but upstairs the restaurant unfolds to a lovely space. We did not have reservations, but were seated promptly. The food was delicious. Full bar service. And although the staff was attentive, we felt very rushed to give up our table towards the end of our meal.", "author": "Missy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "I went here on the recommendation of a friend, and I must say I'm surprised. I'm sure SF has no shortage of great dim sum (and Cantonese food in general), but I ordered my three usuals and was rather pleased with them all.\n\neats:\nshu mai\nhar gow\nrice paper rolls with shrimp\n\nRice paper rolls are basically the same everywhere, but I was pleasantly surprised with the har gow and shu mai, especially the shu mai. The flavors were incredible. I would definitely return.\n\nThey were out of egg custards which I was sad about, but I went at a weird time and my rating in no way reflects this.", "author": "Mai-Anh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Wonderful meal!  Concierge recommended this place and he was right about it!  Great service and excellent fresh food. Chicken meatballs (their specialty) were very good!", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-28", "description": "3.5 stars. Dim sum is 4 stars, but the service is slowwwwwww. This place is a hole in the wall. It is upstairs. The dim sum is really fresh and good. I was surprised. Portions are decent also, but too bad the service isn't very nice and it takes awhile for the dim sum to come out.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "Love this place! I found it years ago through a recommendation of a concierge and I come back every time I'm in the Bay Area. \n\nIn the past, I have ordered the pre set meals but this time our group was large ordered off the menu. Our waitress gave amazing recommendations including the honey walnut prawns, hot and sour soup, Peking duck and pot stickers. Everything was amazing.  \n\nI recommend coming with many people so you can try a variety of dishes. They are served family style.", "author": "Carleigh R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-22", "description": "It was pretty empty here on a Tuesday at 5:30pm, but sure started to fill up about an hour later. Food was pretty good. The hot & sour soup was my favorite. \n\nThe service was nice and quick.", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-23", "description": "Absolutely fantastic food. The food is a little pricey, but the quality is great. I got the sweet and sour pork, the cashew chicken, the shrimp fried rice, hot and sour soup, and a dim sum combination platter. They were all very delicious, and by far the best I've had. However, the hot and sour soup, while not bad, wasn't the best I've had.\nThe actual establishment is classy and a great place to take a date, as did I. \nOverall, a great establishment.", "author": "Colton F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "It was really good food. Very family oriented. I went in a Saturday night and it took forever for them to assist us. Also they only took reservations on Saturday night but they let us slide into a small table for 5.", "author": "Zakary D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-29", "description": "If I could give 0 star... This place is terrible. Bad food... Over priced.... Bad cooking! \nBeing Asian, like the other review here, you would wonder why there's no Asian people eating at this place.....\nIf you know Chinese food, pls do not come here. Most of the people eating are all tourists, ordering simple fired rice and orange chicken.... Their Dimsum menu is way too small... Small serving... Pricey.... And there are no carts.\nThe waitresses don't speak English... They would not even bother answering you if you have a question. \nPlease save yourselves from a bad experience..... \nDO NOT EAT HERE!", "author": "Zean C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "This place has the best Chinese food I've ever eaten! Side note, I'm 35. It was tasty yet light. I've eaten plenty of Chinese food in my time but it's typically very heavy. Not this place. I got the beef with Chinese broccoli and oyster sauce. My date got the seafood rice. Delish!! Five stars!!", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-03", "description": "I like this place. Quiet for a change where you can hear yourself think. Decent and tasty food. Except for when the big tour groups trudge in. Nice to lunch in a pinch.", "author": "Nancy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "Very clean and very tasty food! The waitress was very nice and gave great recommendations. A bit pricey in proportion to the food quantity, but overall great experience with really good food.", "author": "Juan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Good and tasty food. Waitress very helpful to help me with my selection with dishes for our meal for what we desired.\n\nVery glad for the recommendation by my son.", "author": "Tammy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "The Shanghai style pork dumplings tempted my vegetarian partner to the dark side for a moment. We both loved them. The mushroom and vermicelli were quite good too. The bbq pork bun was fine but nothing special. Those little pork morsels are so good that this review stays 4 stars despite a disgusting bathroom.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Exceptional food, exceptional service. Our kids also loved the live crab and lobster tanks. We loved eating here and will be back!", "author": "Beau W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-16", "description": "Bottom Line:  Good food and a nice dining experience.  Probably the best bet for Chinese food in Chinatown. \n\nOverall, I liked the Oriental Pearl Restaurant and it would be my go-to choice for Dim Sum in Chinatown.  Having said that, I know the best Dim Sum in San Francisco is not actually in Chinatown.  But if you are in Chinatown and wanting to enjoy some Chinese cuisine this is a good spot to do so.  The restaurant had crisp table clothes, service was attentive and all of the dishes I tried were enjoyable.  The wonton soup, made with fresh, home made wontons was tasty and I really enjoyed the chow fun noodles as well.\n\nWhen walking through Chinatown you will find that you are solicited by restaurateurs to come and try their these Chinese cuisine. This experience can definitely be overwhelming and annoying. Hopefully Yelp, including this review, will help you narrow down the choices.", "author": "Courtney K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-04", "description": "Mid afternoon & were browsing then my wife saw it  we walked over went upstairs to check it out! Awards cover the walls the place was packed with lots of locals, always a good sign. \n\nSo we made reservations for 6 that evening. Well 6 came & we walk in, not nearly as busy as lunch, dim sum, does that ya know! So we sit & order, salted pork chops, house chow mein, walnut prawns & for starters a dim sum Appetizer! Summed up everything was fresh, tasty & prepared just right! \n\nPrice wise, very responsible, restaurant is very clean, service was spot on and now I know why it's done so well and has won so many awards!\n\nA 43/4 out of 5 stars", "author": "Alan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-03", "description": "The food was horrible at this restaurant!  Sooo disappointed. Sweet and sour pork was cold. What is tha\nt??? Vegetable chow mein with pan fried noodles ( also NOT hot or even warm!) had only bok Choy no bean sprouts and very little else. Charged for tea!  Every item was additional. $40 for our order of 2 dishes and a pot of tea!  Awful awful food!  Stay away!!!", "author": "Suzanne O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-02", "description": "No bueno!  You're better off going to Panda Express or some other Chinese restaurant. It's too over price and food wasn't that good.  My girlfriend had the worse veggie dim sum!", "author": "Nelson B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Out of towner here! This place was very good to our surprise, three appetizers n two main dishes, 3 beers n a soda, for under 90bucks. Food n service great!!", "author": "Ana A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-03", "description": "The Pearl has lost its luster; been dining here since 1999 and always enjoyed the meal.\n\nToday the entry to the stairwell was dirty and infested with insects buzzing around. Not very enticing.\n\nThe dining room is dated, but very clean and comfortable.\n\nThe staff was appropropiately attentive.\n\nThe Sweet and Sour soup was VERY peppery, but otherwise delicious.\n\nWe shared King Pao Chicken and a Salt and Pepper Dungeness Crab. The chicken dish was small and the sauce was excessively reduced. The crab was merely OK --- and it should be great for $46. I felt overeached.\n\nLots of fond memories of this place; I hope it gets \"tuned-up\".", "author": "J S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-21", "description": "Bad service.  Bad service. We were there on a not busy Sunday but seems they try to kick us out as fast as they can. \nDidn't ask for check out. Already took our bill and calculated. Still have food in the plate but come to took all away. This place only for tourist.", "author": "MK L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "So far my favorite Chinese restaurants in SF. Everything I've tried has been delicious and fresh, including the drinks. I love all of the beef dishes and the sweet and sour pork. \nThe service is on point too, and fairly priced, although rice is charged separately but well worth it. Also in a great location in the middle of ChinaTown a short walk up from the financial district.", "author": "Keagan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-01", "description": "Ok so let's go straight to the food! Here's what we ordered:\n\nWonton soup: 3/5, the soup was really bland, but the wontons fillings and texture was quite good.\n\nSteamed dimsum combo: 2/5, the beed shumai was a bit too salty, thought this was overpriced for the portions at $10.\n\nDeep fried sweet and sour cod filet: 4/5, I'm not a deep fried food kind of person so this dish wasn't my cup of tea, but everyone else loved it. I have to say the fish to batter proportion was really good, it wasn't too doughy or too sweet!\n\nBeef with chinese broccoli: 5/5 for the super tender beef and great portion was chinese broccoli. It's stir fried in the typical brown sauce but with a great wok (I'm guessing), the smoky flavor was a great addition, will definitely order again.\n\nPei pa tofu: 5/5, this was my absolute favorite dish! The tofu was stuffed with minced pork and dried mushrooms in a thick sauce. The tofu texture was perfect, the filling was flavorful and just right. Drooling just thinking about this already!\n\nSo besides the two side appetizers the main dishes will have me coming back if I'm in SF again, also the service was very good as well compared to the other restaurants around there!", "author": "Quynh N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-12", "description": "My friends and I had lunch there today.  Overall, it was a very nice lunch stop.  The pro's were that it was clean and the quality of food was very good.  The only con would be that a few of the dishes (a few of the dim sum items and the won tons in the soup) were over salted.  \n\nI would go there again and maybe stick to the unsalted entrees.", "author": "Renee M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-26", "description": "Everything started out well....\n\nWe had a reservation for 12 and we were promptly seated before anyone waiting in line, which was pretty cool, I have to admit.  But then the fun began.  We sat unattended while the entire restaurant was seated before Rebecca came over to take our drink orders (we had pre-ordered our food because of the size of our party).  So that was 15-20 minutes.  Rebecca was very friendly, outgoing, and came promptly with our drinks.  Then our food started coming out.  Halfway into our first helpings, we were looking for refills but Rebecca was no where to be seen.  Finally, another woman came and started bringing drinks two at a time.  We were celebrating Christmas and were in no hurry, so our meal took more than an hour, however the food came out hot and quick.  Nice.  The food dishes were really very good - the honey walnut shrimp especially - but the Oriental Pearl fried rice tasted like it was 50% green onion and looked it, too.  Not so nice.  We had to ask for steamed rice (I guess because we ordered fried rice, the presumption was that all 12 of us were going to eat it).  We waited a bit for the new waitress to come around for refills again.  Then everything fell apart.  We finished and they started to come and clear our dishes but never brought us a check.  After 15 minutes, I tried signalling to the new waitress who was one table over, but she never looked up.  Another 10 minutes before I finally got her attention and asked for the check.  ANOTHER 15 minutes went by and by this time I felt like jumping on the table to get her attention again.  She came over and I again asked for the check.  She made a face like \"Oh, darn, I forgot\" and ran off to get it.  When she brought it, we split the check three ways.  We did the math for them, telling the waitress (we wrote it down) which amount went on which credit card.  I swear this is true, another 15 minutes went by.  By this time I got up and went to the cashier/hostess.  I asked if there was a problem with our bill.  The woman said, \"Too many credit cards\" like their machine was overloaded or something like that made any sense.  So I had to leave to not start yelling.  I waited outside while my party finally got the checks to sign.  I realize in the food industry that splitting the check can be aggravating, but WE DID THE MATH FOR THEM.  All they had to do was run the amounts.\n\nI felt like we went from really important customers to completely unimportant.  This was supposed to be a special event for my family for Christmas and all the joy was sucked out waiting around for someone to see me with my hand raised waving frantically.  Regardless of the quality of the food, I'm never going back.", "author": "Dave L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "Excellent! Great food, good service, nice ambiance. They're helpful -- feel free to ask for recommendations. Definitely recommended!", "author": "Eric S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "We were recommended this place from one of the shopkeepers around the corner.\n\nLike a lot of places in Chinatown it doesn't look like much from the doorway, but up the stairs it it a real restaurant.\n\nWe ordered one of the set dim sum lunches. Served in waves, the items appeared and tasted fresh and well made. I'd only had dim sum from places with a cart. This was quite different. And nice.\n\nStaff was courteous and friendly.\n\nI enjoyed my experience and would return.", "author": "R H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Came here for dim sum...our usual place is Yank Sing and this place matched in quality and beats them in price...you'll pay 60% and I noticed no difference in variety or quality.  Will come back!", "author": "Alec G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Awesome restaurant. Fantastic food! Perfect Chinese food for any day! Will definitely be coming back", "author": "Anna V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-11", "description": "So as my adventure started in SF I needed to grab a snack. What better way then to hit up a dim sum place. I'm an early bird so most places aren't open yet. So I got lucky and ran into this place . I walked upstairs to the restaurant and was greeted by this lovely little lady. It was cool being the first to arrive because service was great. I sat next to a window with a cool view of the street so it was perfect for people watching. The lady took my order right away and brought me a drink.  I ended up choosing a few items from the dim sum menu. I told her to let me keep the menu so i can order more if needed. The dim sum was fresh and the prices were reasonable. Good thing I arrived when I did this place filled up fast. I will definitely be back on my next adventure.", "author": "Tony B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "The best dim-sum ever. Apparently, not all dim-sum places are created equal. Freshly made, taste delicious. We ordered shrimp dumpling and siomay and other standard dimsum meals. We also had thr fried calamari which tasted like none we ate before: soft, fresh, delicious. Also try the mango pudding and freshly made sesame ball. Outside appearance look rundown, but inside is clean and great.\nMust try if you are in SF Chinatown!", "author": "Pete K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-21", "description": "Friday night dinner for two at 6:30. Not crowded. Friendly staff and good service. Vodka martini good. I saw someone warned against hot and sour soup but we split one anyway. Good, not great, and plenty to share. We also got Mongolian beef extra spicy and walnut prawns at server's suggestion. The walnut prawns is something we would normally never order. The prawns were good and sweet candied walnuts gave it an interesting flavor. Mongolian beef good but not great.\n\nEverything was mostly good but not great. With that and the good service I might give 4 stars but considering the cost and the food no better than good carry out, I give it 3.", "author": "Chuck H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "Great service. Recommendations based on everyone's preferences (poultry, vegetarian, spicy, sweet, etc). We ordered four different meals and shared within the group. So yummy! Everything tasted delicious.", "author": "Isabell F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-28", "description": "The inside was beautiful, nice decor, very clean, great service, friendly...but the won ton soup we ordered to share was a very small bowl and $14.50. Price was very high and no flavor. This place seems like more of a touristy place. They did bring us out a complementary egg custard tart to try and that was very yummy.", "author": "Natalie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "This place is awesome! The price is right for awesome dim sum, delicious food, and nice atmosphere for dinner. Would 10/10 recommend to friends for a nice dinner in Chinatown!", "author": "Mackenzie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Authentic Hong Kong style dishes and westernized Chinese food sum up the menu. I like both styles and appreciate the chance to east sea cucumbers, abalone, hot pots and other Hong Kong classics. The restaurant is cheesy, the service is dry, but the food is very good. Prices are very fair. A worthwhile stop for anybody who likes Chinese food.", "author": "Jim M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-25", "description": "More a tourist place with lots of awards on the wall. Can't figure where these came from. Food was lower average. We had menu A. Pricey. Good service though. Clean. Not very crowded. 3 other parties. All were non Asian.", "author": "Drgxd K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-04", "description": "It was.... ok. The service was ok. The food was ok. It was just ok. This place is ULTRA touristy, you won't find a single Asian diner anywhere, and that's usually a sign. There are much better places in town for much less. I rarely use this term but it's pretty much a tourist trap.", "author": "Shane W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-07", "description": "Not sure why this restaurant has less than five stars.  Every dish we had was amazing and the ice tea was some of the best I've ever had. We actually went and bought some of the loose leaf tea from a store a few doors down. \n\nFor food, we had shrimp fried rice, steamed pork buns, fresh stir fried vegetables, shrimp and chive dumplings and sweet and sour chicken.  \n\nWe came on a Sunday and the service was very good. \n\nThe restaurant is also very clean and much nicer than many of the other options in China town.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-12", "description": "This year was my turn to plan the lunch stop in Chinatown when myself and 5 friends wanted dinner - with so many places to try, how do you choose?  Yelp reviews were the answer and the correct answer!\n\nOn Clay Street, it was pretty easy to find, doesn't look like much from the outside, but once up the stairs, it's a wonderful looking restaurant, very clean, very understated and very quiet as it's one floor off the street.  Yes, we were a little put off that we were the only persons in the restaurant when we started, but by the end of our lunch, we were the only non-Asians in the place!  That means a lot.\n\nWe ordered the Dim Sum lunch for 4 persons, additional non-shrimp portions for our seafood allergic friend, and a vegetarian lunch for the vegan among us.  Very beautiful presentations of the food, the hostess (she could have been the owner, I didn't ask) took the time (along with our server) to explain what the different items were, what sauces to eat them with, etc.\n\nGreat place to rest for a few minutes and regroup before hitting the tourist spots in the afternoon.\n\nProbably a 4.5 out of 5 stars in my book.", "author": "Liz T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Very nice decor and ambiance. The staff were very welcoming and made great recommendations. The food was amazing! If you want a delicious, authentic dinner in Chinatown, this is the place to go!", "author": "Michelle R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-18", "description": "Food was oily, overpriced, and small portioned. Service was attentive and bathroom was clean. I wouldn't be back.", "author": "Alex I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "We had chicken chow main,vegetables fried rice,Mongolian beef and general t-sao chicken and everything was excellent!!", "author": "Rocio A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-18", "description": "Our meal came with 2 spoons that were dirty. Ordered 2 dishes, 1 appetizer and 4 white rice... we paid $60. I think this is a bit pricey. I will not be a returning customer.", "author": "Joy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "I had not had Chinese food this good in a very long time. I ordered the chicken in black bean sauce lunch special which came with a bowl of some delicious corn soup. I also ordered some dim sum, the lobster/chive dumpling and the vegetable dumpling; both good but I liked the lobster/chives one better. The service was excellent, everyone was polite. It is on the pricey side but it's well worth it because the food here is delicious af. I agree with previous reviewers who mentioned that the cook of this place is insanely gifted. Would definitely come and eat here again. \n\nTL; DR ?: it's delicious ! Pricey but worth it.", "author": "Stars S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "This is the cleanest Chinese restaurant in Chinatown. Oriental Pearl specializes in Dim Sum and serves dishes to order. No Dim Sum carts here. All of their dim sum is fresh. It may be a bit overpriced for a typical, noisy dirty dim sum restaurant but that's a trade off if you want to eat in a serene, clean and calm environment. It's across the street to the underground parking so it's nice and convenient.", "author": "Calvin N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-12", "description": "This place has mystery meat and chicken at tourist prices.  It's not a high quality food restaurant and the prices are double any regular Asian restaurant.  I would pass on this place if you are considering.  The only this good was pre made fortune cookies and the service.", "author": "Eric D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "The service is absolutely great! We came here with a party of 8.  The waitress gave us great suggestions and not one of them disappointed! We had jasmine tea, Chinese broccoli with oyster sauce, Mongolian beef, pecking duck, and much much more! One of our go-to restaurants when we come to San Francisco", "author": "Bryant E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "Great Chinese food, good prices and quick service. It's Linen table clothes and napkins, nice place to for sit down dinner or lunch.", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Delicious!! Such amazing food! I am not normally a fan of fried rice, but their fried rice is amazing! I also tried their sweet and sour pork, pork buns, chicken chow mein, egg rolls and dim sum. It was so delicious, we came back to chinatown the second day as well! It is a little bit pricy, but completely worth it!", "author": "Noelle P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-12", "description": "This was recommended but was awful & ridiculously priced. Wonton soup for 2 $16. Awful", "author": "Liz R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "I came here on recommendations from locals after wanting a dim sum place in Chinatown that wasn't too big or difficult to get into. Oriental Pearl definitely fits that bill - it's a small restaurant that has two entrances, one of which is nonfunctioning, and you have to go up a less indirect door to the left of the restaurant in order to get in. Once inside, you might notice pretty quickly that the décor isn't all that special - but what really sold me on the place, as it will probably you, is the food. It's great for the price. Typical dim sum fare, made to order, was served quickly and was piping hot - not least it was delicious. The wait staff is extremely genial and feels like you're sitting down to eat with a family - the owner stopped me during my order and told me \"You're ordering too much food for one person!\" She meant it kindly, and it only served to make you feel like they really wanted you to have the most comfortable experience possible there. I loved this place and would absolutely recommend it to anyone who asks for weekday dim sum.", "author": "Jay C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-19", "description": "SF Native who rarely ventures into Chinatown for dinner. Having read other reviews we gave it a go. We had a reservation, so were seated right away. It took ten minutes for any staff to come to our table to offer even water or menus. Service continued to be slow to non-existent.  Won Ton and Hot and Sour soups were served lukewarm, sweet and sour chicken was likewise room temperature.  Staff vacuuming the restaurant during dinner made it hard to have a conversation. With so many awesome Asian food options in SF I cannot see any reason to return.", "author": "Erin N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-12", "description": "My husband and I ate at the Oriental Pearl last Friday night while visiting San Francisco.  When we arrived,  there were two other tables with people seated. A couple at one and three adults at the other.  We were seated promptly and our order was taken by the lady who seated us.  Other people continued to arrive and be seated. After 20 or more minutes we noticed that those who came in after us had their food. We had ordered an appetizer and two entrees.  Other waiters and waitresses were attending to other tables but our waitress never came back to us even though she was seating everyone and taking their orders.  After 50 minutes we stopped another waitress and asked if she could find out where our food was.  We then stopped the original lady who took our order and seated us and she made some excuse about ours taking longer because of the appetizer--Even though everybody around us had already gotten their appetizers and entrees and finished eating. Finally, one hour after we arrived the waitress brought our entree and said they were working on our appetizer.  They offered a free dessert for the inconvenience.   We cancelled the appetizer and the dessert was not worth eating.  The waitress/hostess was clearly managing the rest of the staff and just forgot us.  Poor management. She should at least have acknowledged her mistake instead of making up an excuse and blaming it on our appetizer order.   This is the first time I have ever left a restaurant review. Very disappointed in the Oriental Pearl.", "author": "Shelia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Was a bit nervous walking upstairs to this restaurant but was very happy we did. We had pot stickers, Mongolian Beek, and General Tsaos Chicken. All were fantastic. The staff was very professional, bathrooms are clean, and atmosphere was nice.", "author": "Matt E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "Joe is the nicest hardest working man in Chinatown . This restaurant is fantastic!! I'm truly addicted to the Mai Tai's here! The salted lobster melts in your mouth. The Kung pao perfection and an all time fave honey walnut shrimp. I also love the hot and sour soup. Clean table cloths excellent service and a smoothly run operation . Stephen was also wonderful !!\nThank you thank you!!", "author": "Cecilia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "Very good food, and very affordable. Had the shell prawns with spicy salt, soup dumplings, eggplant stuffed with shrimp, and ftied taro dumpling with pork and mushrooms. All was good as it was dim sum from a menu and came out piping. Hot the shrimp could have been a touch crispier, but the scallions and pepper topping was spot on. Best fried taro dumpling I have ever had.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-03", "description": "Eggplant in clay pot is delicious. Staples shrimp fried rice and chicken chow mein were disgusting and bland. Reviews looked good but should have turned around when it seemed there were no locals, just harried tourists like ourselves. Go elsewhere.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-25", "description": "Dim sum options in San Francisco's Chinatown are in vast abundance. As you walk through the little neighborhood, restaurant workers stand outside the doors and aggressively beckon you to come inside. Don't give into their pressure and conniving pleas; rather, thoughtfully consult your Yelp app for recommendations. That's exactly what we did to find Oriental Pearl. \n\nWe sauntered in on a lazy, late Sunday morning and were seated without a problem. The dim sum menu was quite extensive. Between four of us, we ordered a lot. Some of the items that stood out to me:\n\nBBQ PORK BUN:  Nicely executed. This is one of those addicting options that one can just keep noshing on over and over again. \n\nSHRIMP & CHIVES DUMPLING:  I ordered this twice. I just couldn't get enough of it.\n\nVEGETABLE EGG ROLLS:  Piping hot. Very satisfying.\n\nBBQ SPARE RIBS:  A nice snack that I shared with another person at the table. They weren't overly sauced, something that I appreciated. Light and tangy.\n\nServers were very sweet and kind. A team of them attentively took care of us throughout our stay. They made sure the food kept coming and coming. I applaud them for keeping up since we ordered an abundance of items. \n\nEach item ranged from $3.50 - $4.75. Certainly commensurate with other dim sum options in the area. \n\nI wouldn't mind returning to Oriental Pearl again. I very much enjoyed my visit.", "author": "Gary R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-16", "description": "Rip off, go elsewhere. Ordered the dim sum sampler for $10. Received 6 crummy shu mai. Spicy braised chicken was good, but $18 was outrageous considering all the other options in Chinatown with quality cuisine.\n\nAnnoyed me enough to write my first review on Yelp.", "author": "Charles F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-14", "description": "Ordered the wonton soup and it was horrible. Rancid taste made it non-edible. The honey walnut shrimp was a little better, but had a sour aftertaste. Good service, just terrible food.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "This place is an absolutely  wonderful restaurant. The food here is very fresh and the Spices and flavor very spot on. The Service here is extremely friendly & very fast. They have always made our experience amazing consistently going above and beyond to make every occasion special.", "author": "Bobby B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-28", "description": "Food wasn't good. Service was spotty. A little pricey. The water glasses were TINY. We travel all over, and we had high hopes... save your money!", "author": "Alex D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-22", "description": "Shrimp with honey walnut is great. Fried rice was also good and very fresh. Food wasn't covered up with a bunch of overpowering sauce.", "author": "Michele N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-01", "description": "We didn't have good experience in here. More than 15% gratuity was automatically applied to our receipt. Without any notice, the bottom line asks us to pay tips again. Very dishonest. In other words, they were asking us to pay double tips, and the gratuity amount is not even optional. Please try to avoid dining in this restaurant.  NOT Recommended!", "author": "Wendy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "When in San Francisco, a must have! Their food was outstanding, their service was on the spot, and their prices very reasonable! Start with the Salt & Pepper Calamari and Dim Sum Combination (BEST I'VE EVER HAD!) Nothing like it! Hell, order two of them! Their Fried Rice, Mongolian Beef, and Kung Pao Shrimp were phenomenal!", "author": "Rene B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-26", "description": "I went here with my boss and my colleague while we were in town for a conference. While the steep hills of SanFran did have me winded, Oriental Pearl is worth the trek.\nI was kind of surprised to find it almost empty... it had been noted in my boss' guidebook that it was a really popular spot! But I guess it worked out, as we received attentive service, as they consistently checked up on us and explained menu items.\n\nThe chow fun was a little different from what I had expected, as it used long noodles instead of the flat square ones I am accustomed to. Nonetheless, delicious! Great soy sauce flavor with greens. Typical fare.\nFor our main entree, we got the live crab. Flavored with salt and pepper, it was DELICIOUS. We happily donned our aprons and gloves and clawed through every bite, I definitely recommend. Simple and delicious!", "author": "Rumi F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "Love this place! We stop by every time we're in the City and sometimes twice if we're there for a few days.\nIt's a bit pricey but very yummy and service is good. Seems like it's popular with tourists as well.", "author": "Monica H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-12", "description": "Good service , good food \nIt's little bit over over priced for this quality\nThe fried meet rice was very good \nDuck wrap was delicious", "author": "Raymond H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-14", "description": "If I could give this place a zero stars- I would!! Waited a very long time after watching many others get seated ahead of us- then we were ushered to a table where we were ignored by EVERYONE \nNo eye contact - nothing!! We tried to wave over a waitress several times- after almost 25 minutes of not even receiving a glass of water or a menu!\nWe finally got up to leave and told the hostess who seemed unfazed and unapologetic.  Never again", "author": "Dagmar S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "Great fancy place to eat Dim Sum. We ordered the A. \n\nBottom line is the food was great. All of it had a home cooked taste. \n\nI would recommend eating here if in the Chinatown area.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-23", "description": "Got there close to closing for lunch. They were very courteous and did not rush us. Food was good and fresh. Dim sum was good", "author": "Carol K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-10", "description": "Overall good dining experience. Food was fresh and delicious (although, not the best I've ever had). Wait staff was very attentive, and checked up on us many times.\n\nWe ordered a few dishes off the main menu, but mostly stuck to dim sum. We arrived at around 1:40 pm and the restaurant was not packed. Only two other large tables. One of the cleaner restaurants in the Chinatown area.\n\nAll in all, a very solid restautant. Not the best, but far from the worst. I would definitely recommend it as a good dining experience if you happen to be in the area, but probably would not travel out of my way to get here.", "author": "Andy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "I'm here for a conference for work.  During the planning stages, two people had mentioned this place separately.  From my understanding, San Fransisco has some of the best and most authentic cuisine in China Town that you can get in the States.  This place, while fantastic and worth the 5 stars, wouldn't be authentic I think.  But it was damn good and glad I went. We had to be difficult and ask for separate itemized checks for reimbursement purposes.  They didn't care, so that was nice.  We got Hot and Sour soup to start.  It had a good spice to it, and it was portioned enough for a meal for 1 or shared for 3.  My colleague got the General Tso's chicken.  It was good, but not spicy.  I have thing for a little spice on my life.  My other colleague went with the Mongolian Beef and special rice.  It was delicious.  The veggies were cooked just right and the beef was good in quality and quantity.  I went with the Peking Duck w/pancakes.  The portion was enough for the three of to share.  Cooked just right.  Delicious.  And we had hot tea with the meal.  Great wait staff, great food.  I recommend it :). See the pictures to sate your visual appetite...", "author": "Jason D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-23", "description": "I usually skeptical with anything in Chinatown, mostly tourist trap restaurants....  I do however have to say that the food is good here, had beef with scallion, beef chow fun, and pippa tofu.  There is things in the menu definitely for tourist, like \"general too chicken\", Etc. but I have to say the cook really knows how to cook, Chinese food.  The thing is, the price is kind of high for regular Chinese food.  The service also pretty good, they are very attentive to customer....  the rating deserve a little higher than the 3.5 star average....  May not be the \"up to date\" Cantonese seafood you'll get at some of the banquet seafood restaurant, but it was very well made food....", "author": "Steve D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "Excellent! Excellent service, excellent food and excellent ambience. Perfect for conversation. As you see, I really enjoyed this dining experience. The food was delivered quick and hot. This restaurant is on my San Fran best list.", "author": "Kim T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-25", "description": "The Oriental Pearl held so much promise for us but sigh, I don't think one person in our party enjoyed their meal and we all left a little unsatisfied. Not a lot of flavor, lots of oil. Maybe it would be better for a dim sum lunch rather than dinner.", "author": "Karen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "I have lived in the area for a while and typically frequent the same favored places for dim sum. Friends thought it was time to try someplace new (to us).\n\nUpscale (tablecloth) place for dim sum. More limited menu that some other places but most of the dishes we ordered were very very good:\n\nMy fave was the sticky rice in lotus leaves. A friend's was the fried turnip cake. Pork buns only available steamed, not baked. Shanghai dumplings not that impressive. Chef was busy for CNY so didn't have time to make egg custards. \n\nOverall great meal and will definitely be back. Place was empty when they opened and am almost a little reluctant to give a good review because I don't want this place to start getting crowded for future visits. \n\nThey validate parking for meals at least $50. Don't think they validate more than one car for $50 meal if you come in a group, depending on which waiter you get. \n\nEntrance is up the block from actual address, restaurant on 2nd floor...take the stairs up one flight.", "author": "D L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-02", "description": "As I made the right onto Clay off of Grant things started to feel familiar I entered Oriental Pearl, climbed up the stairs made another right into the entrance and realized I had been here back in 1998, was my 1st time.\n\nCaroline the current owner [daughter of the original owners] seated me in front of the fish tanks, said to her I had been here b/4 back in 1998 sat on the other side. Mentioned the place looked a little different Caroline stated she had painted actually it was the same color grey but w/a hue of purple vs. the mauve her Mother used to have. Was nice to see things where still the same but freshened up.\n\nStarted off with a beer, Caroline stopped by to check on me mentioned I was baffled on what to order she suggested the Combo of Steamed Dim Sum \n[Pork, Beef, Pork and Shrimp] the Beef was my FAV then the Chicken and I ordered the Peking Duck Served with Pancakes...1st time I've ever had.\n\nSince I wasn't having a Thanksgiving Dinner thought why not try the duck...it was incredible. The waitress rolled each one for me each w/a little Plum Sauce not too much.\n\nI was so full there was no room for dessert Caroline was kind enough to bring over a glass filled with chilled Lychee's for me...was a nice little Birthday treat.\n\nThe best & cute part was the Rooster carved out of Carrot that was served w/the Peking Duck actually placed him across from me so I had a dinner companion.\n\nThank you Caroline and your family for keeping all the recipes true and amazing my next trip back I will be there again!", "author": "Flyinlow .."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-26", "description": "Unremarkable food (even the peking duck, which was tasty, but cold and not crispy). Much better Chinese options in city.", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "Good service and great food in the heart of San Francisco's Chinatown. You won't be dissatisfied, ordered the almond chicken, chicken chow-mien and sweet and sour pork all done nicely with enough food for every one on the table. Will come back for sure.", "author": "Karyn D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "Just had secret steam egg dish for the second time!!!\nIt is not on the menu, but tastes excellent.  \nMy wife who is very picky about food, was really happy!", "author": "Yuichi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "My husband and I eat at Oriental Pearl monthly, either at the restaurant or we order and pick up enough for 2 nights.  It's not good, it's GREAT!!  We're always warmly welcomed by Rebecca with hugs. Last night we had Won Ton soup, hot and sour soup, spicy shell prawns, beef & scallions and a noodle dish, as well as half an order of Peking duck.  Tonight we finished it off. The entire staff is excellent!!", "author": "anne l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "Visiting from out of town and had some friends that came out to San Fran a couple months ago that told us to try this place. So glad we did. Atmosphere is very clean and neat. The lunch menu can keep you under $10 a plate, but the food can get very expensive (chef choice start at  $25 and go up to $55). The service is spot on, but more professional than laid back. The entire staff stays very dedicated to making sure tables are cleaned as soon as they get up, waters are full, and customers are satisfied!  The food is fantastic, I wish I could go into detail, but there isn't much to tell. It is just spot on Chinese.  This place is a must stop in Chinatown.\n\nThere is a local parking deck on the corner of Clay St and Kearny St underneath the park, and it's one of the reasonably priced ones in town ($27 for a full day). But that's about it for parking, street is usually full.", "author": "Tony B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-05", "description": "As a foodie, I'm quite surprised this gets strong reviews from Zabars, Michelin, et all.  The food was OK at best.   It was definitely overpriced, portions were small, and service was slow.  They even delivered the 3 main dishes for 3 of us at totally different times.", "author": "Sarah E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-25", "description": "Over priced chinese restaurant..  we had the peking duck.. the crepe was so thick.. they've included the meat when it should only be the skin.. the skin wasn't crispy.. had their steamed fish.. it was ok.. and the oriental fried rice was bland.. overall we paid almost $100.. wrong move.. we could've gone to the restaurant next door and had way better meal for cheap.. our server that day was nice though...", "author": "Laura M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "Oriental Pearl was recommended by a merchant in Chinatown. She was right! \n\nThe dim sum was delicious and not as expensive as other highly rated venues. The items are made to order. Ingredients were fresh and served hot. Fried items were not greasy. My favorite is the fried taro puff. It was really good. We also enjoyed the house special chicken meatball wrapped in egg white. There is only one to an order. The standards are 3 to an order. No mai gai (steamed sticky rice wrapped in lotus leaf) serving is 2 pieces.\n\nThe restaurant is very clean.  The room could be refreshed a tad. The staff actually cleans the glass lazy susans with windex AND a clean cloth. Service by all was so polite and efficient. They accepted a reservation for 2!\n\nDefinitely high on my short list of places to go for dim sum in San Francisco. This is one place where you would be wrong to assume the dim sum was bad because there weren't many Chinese dining there.  Let's just say the tourists got a good meal!", "author": "Debbie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-03", "description": "Food was average. We had general t'sos, hot and sour soup and King Pao chicken.\nService not flexible on allowing to adjust any additions or subtraction to the desired dish.\nGlad we tried it but would not go back.", "author": "John P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-05", "description": "Ate here on a Friday night for a casual business dinner. Nothing fancy, average at best. The décor is dated. Nothing was horrible but nothing stood out. Had comparable food at the mall for half the price. The servers were polite and the fast.", "author": "Erin K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-25", "description": "Must have been an off day when I visited this restaurant on a Monday evening. Dropped by restaurant while on a conference in San Francisco. First, the restaurant decor is nothing to write home about, though you would not expect much from a Chinatown restaurant.\n\nOrdered Peking duck, Mongolian beef and ginger scallion dungeness crab. While the ornament accompanying the duck was fancy, the duck was not hot and the skin was soggy, as opposed to the crisp expected from Peking duck. The crab meat such to the inside of the shell and was a little dry, although the seasoning was OK. The only redeeming dish was the beef, which was tender and nicely seasoned. Yet, for the price tag, I was underwhelmed. Better places to check out in Chinatown.", "author": "Li Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-15", "description": "Being in San Fran and having Chinatown nearby, we were looking for Peking Duck and our hotel recommended Oriental Pearl. \nWhile the duck was fine .. the pancakes were terrible .. doughy and tasted nothing like you are use to ... and for reasons they couldn't explain they served the duck with carrots instead of scallions and cucumbers. When I asked for scallions and cukes... they said no. \n\nDim Sums were just ok ...The soup was good as was the house fried rice.  \n\nThe restaurant is upstairs and very clean, not what you expected when you walked in. \n\nOverall ... A real disappointment", "author": "Michael C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-30", "description": "We went here with a group of 28.  Tour leader ordered ahead so there was no wait time. Service was quick   Only problem only 1 ladies room. Food was certainly acceptable-- but I'm not really qualified to critique this cuisine. Enjoyed all but the dumpling, but remember I'm so expect. We had the dim sum served family style.", "author": "Lynda C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-08", "description": "Oriental Pearl has great service, nice decor, but very overpriced food. We tried their peking duck and stir-fried pea sprouts. The duck was over $50 for maybe half a pound of meat, and it wasn't even that good. The meat was tasty, but the skin was soggy and chewy :( The pea sprouts a bit stringy and nothing special--definitely not worth the $20 they cost. On top of all that, they charge $3 per pot of tea.", "author": "Maddie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-07", "description": "I have to say, I was pleasantly surprised by this place.  It totally caters to tourists who are drawn here by its reputation.  The food isn't cheap, but the staff clearly cares about making a good dining experience which I can't say for many of the restaurants in Chinatown.  Although their focus is Cantonese style, they did an admirable job with the Peking duck.", "author": "Seth E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "We had heard about the R&G Lounge, but were turned off by the bad cleanliness report and decided to come here instead. Great choice, great service. It was very clean and everyone was friendly! The food was great and it was very kid friendly.", "author": "Abbey N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-12", "description": "12/29/16 11:15am\nGot off the Big Bus Hop On/Off Bus at the Chinatown gates.  We were hungry looking for a place to eat that had high Yelp reviews.  Each restaurant we saw I checked the Yelp rating and cleanliness factor.  This restaurant had good reviews and had high cleanliness.\n\nWe weren't disappointed!  We got there right before the lunch rush.  The decor was pleasant.  The entrance was a little confusing.  The bathroom was clean and stocked.  We ordered  from the lunch special menu.  Kung Pao Chicken and Mongolian Beef.  It was tasty and hit the spot.  The egg flower soup was excellent and perhaps the best I've ever had.  We even enjoyed the tea very much.  The bill was very reasonably priced for the good food, good service and clean dining area and rest room.\n\nThis was the best Chinese restaurant we dined at out of the three we sampled.  We would come here again.  I recommend this place!", "author": "Geo P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-25", "description": "Dim sums were delicious and the wait staff was nice in accommodating us close to their afternoon closing time. It's because of that, I am giving a star extra. The other main dish was strictly ordinary.\nChicken with black bean sauce didn't do much for the palate. \nGo for dim sums, appetizer platter and nice ambience. Not so much for the main course!", "author": "Monu M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-10", "description": "Food was great, but we wanted more Pork Buns and they kept saying \"Oh, no more Pork Buns for you!\" We felt like it was an episode of Seinfeld, \"No Soup for You.\" My son is 6'2 and went home hungry. They kept taking our plates and sauces away from us when we still wanted to order more food, which the last time I checked is why restaurants are there. It wasn't even close to closing time of 9:30, it was only 7:30-8:00 and the restaurant was still half full. Don't you want our money???", "author": "Craig R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "This review is for fish maw soup. The best. Also ask for chicken meat balls. This time they were out.", "author": "Mete C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-06", "description": "What is authentic Chinese food?\nLike any cuisine, the answer is defined by its audience.  While someone from the Midwest or Southern states might mention places like Panda Express and P.F. Chang, SoCal (Monterey Park and Rowland Heights mainly) residents, like in Monty Python's Holy Grail, might answer with another questions, \"What kind?\"... leading to a plethora of Northern style, Southern style, Hong Kong or Taiwan vs. Mainland styles, or lead into another question... \"What region?\"\nThis leads me to this quiet, hidden restaurant in the heart of the touristy part of Chinatown off of Grant Avenue.  \nMy mother was born in Shantou, center of Chiu Chow (also spelled Teo Cheow)people where, not only is the food different, the language and, in many ways, mentality is different.  When the Japanese occupied China during WWII, many locals from this region fled to Viet Nam and Singapore.  This is why many Vietnamese immigrants in the Bay Area likely speak Chiu Chow dialect.\nBack in the 1980's, there were two Chiu Chow restaurants, the upstairs restaurant now named Clay Pot City and a small place on 9th Avenue near Judah, now .\nBeing my mom's birthday, I wanted to do something special to celebrate and remembered that the owners are from there and offer some staple dishes.  \n\nAppetizers\n1) Shrimp Balls (http://www.yelp.com/user_local_photos?select=KLW-gN80RdqdAKqIKSowhg&userid=saJuyv784apZzH--psHZ3Q) - I know... so many jokes can be made on this one.  Pretty good as the filling had the authentic flavor though the skin seemed a bit thick.  A bit pricey at $9.25 for four balls.\n\n2) Marinade Duck Chiu Chow style  (http://www.yelp.com/user_local_photos?select=hSAu823ye17ZSyp4v2eWYw&userid=saJuyv784apZzH--psHZ3Q) - This homestyle prepared dish is made in the traditional manner and served with a white vinegar garlic dipping sauce.  Being heavily flavored, goes well with rice. \n\nSoup\n3) Minced Beef Soup with Egg White  (http://www.yelp.com/user_local_photos?select=_zlS9KApRoRBbroGUvJe9w&userid=saJuyv784apZzH--psHZ3Q) - Never seen a restaurant apportion takeout soup in five individual small containers like this.  Would have be tastier with cilantro.\n\nMains\n4) Spicy Braised Chicken  - Even the owner warned me that this was not cooked in authentic Chiu Chow style with basil leaves.  This is a Chiu Chow cuisine signature dish that didn't quite hit the mark.\n\n5) Braised Rock Cod Fish Filet with Minced Pork, Shrimp, and Tofu Clay Pot (http://www.yelp.com/user_local_photos?select=pWQA4SfaquyoD5L69THPLQ&userid=saJuyv784apZzH--psHZ3Q) -Recommended by the owner, this was just 'meh'.  No distinct flavor though cooked with peeled garlic cloves.  Pass.\n\n6) Olive Leaf Green Bean stir fry (http://www.yelp.com/user_local_photos?select=9m9A02tRBCaDRbSfSNP3lg&userid=saJuyv784apZzH--psHZ3Q) - Another Chiu Chow dish, it was on the saltier side (too much olive leaves?) and would have benefited if cooked with ground pork for more flavoring.\n\nDessert\n7)  Taro pudding (http://www.yelp.com/user_local_photos?select=K-mHhn5LWl7gI2_5zLYCqQ&userid=saJuyv784apZzH--psHZ3Q) - Probably the best dish of the evening.  Usually served family style, like the soup, apportioned in five small takeout containers.  Imagine your mom or grandmother mashing taro to a poi-like consistency, but with sweet flavors.  The gingko nuts confirmed the dish's authenticity.  A single serving is $5.75.\n\nSadly, my mom cannot fault me for the effort, but, if she knew what I paid for dinner, my ears would probably be chewed off.  All main dishes were $10.00 + with the fish being the tops at $16.75.\nI don't profess to be an expert in Chiu Chow cooking like my mom, but she's educated my palate to certain expectations.  From my first trip to Hong Kong when she told me about a small place upstairs in the herb district in Sheung Wan to the local places that opened in the late 1980's in Chinatown and in the Sunset District, she would order their staple dishes that bring back memories of her childhood.  In the late '80's to late '90's, my work travels took me to Hong Kong annually where my cousins would take me to a Chiu Chow restaurant near the Macau ferry.  Now, if only there was enough of an audience to warrant bringing those chefs here.  Sadly, a magazine cover with Rachel Ray about under $40.00 per day adorns their entrance window (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q), evidence of the audience that they target.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "We stopped in for a late lunch, having seen the sign on the street. After walking up the staircase, we were pleasantly surprised at the decor. Several aquariums displayed beautiful fish, and the tables were graced with live orchids. It was not crowded, and we got a table right next to the window. We thoroughly enjoyed the corn chowder and sea food fried rice we shared.", "author": "Susan M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-31", "description": "Very mediocre. High prices, overly salty food. They charge $2 for a small bowl of rive, $19.25 for my favorite vegetable dish with no meat (pea pods with garlic sauce). Very disappointing. It was edible, but there are so many better places to go in Chinatown for significantly less money.\n\nThe white table cloth and linen napkins certainly appeal to a particular nonAsian crowd, and we should have realized we needed  leave when the only Asians we saw were working there.", "author": "Mrs. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "This is a hidden gem! Amazing food - very tasty, authentic, friendly staff. I usually have the dim sum for 2 and it's always plenty. The pork buns are divine! Chow mein very good also. \n\nWill be going back time and time again - very highly recommended and very reasonably priced.", "author": "Laura T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-11", "description": "I wasn't sure about the place by the entrance, but after walking upstairs (there is an elevator) was pleasantly surprised. They have a commitment to quality and it shows! \n\nThe house special dim sun was fantastic, with an incredibly light  wrapper on the shrimp and such fantastic flavor! The Barbecue spare ribs were meaty and moist, and very flavorful. The house dried rice was delectable, and the signature dish of fresh lo an prawns with sweet walnuts me yes in my mouth!  \n\nGo... Enjoy! \n\nPricing was also very good, but not cheap.", "author": "Foodie I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "Food was excellent. We were looking for a clean, yummy restaurant in Chinatown and this was recommended. Service was a little slow but the quality of the food made up for it.", "author": "Katy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-03", "description": "Horrible service... Horrible food..Horrible decor..Oh, and Rachael Ray likes this place? \n\nI tested this place out when I was visiting SF and I am honestly not impressed. First of all, this place was completely empty during lunch time on a weekend, and it is obvious it is going downhill. My little sister and I ordered the Chef's Suggestion Meal for Two (Order B)  with Tofu Soup, house special dim sum, prawns with honey glazed walnut, Kung Pao chicken, and oriental pearl rice. Those are generic items that I assumed would be hard to mess up. Before I explain how nasty the food is, it took me about SIX TIMES where I had to ask for water before getting some to my table. The service sucked and we were never checked up on. \n\nThe dim sum tasted like it was something frozen that had been heated up. The tofu soup was basically really bad egg drop soup with bits of tofu in it. The prawns disappointed us the most. I usually love honey walnut shrimp and this tasted like there was pineapple juice squeezed onto it along with mayo lathered over fried prawns. the Kung Pao chicken was very bare. I couldn't tell between the water chestnuts and the diced up chicken because turned out there was twice as much chestnuts compared to chicken... \n\nOverall, I did not enjoy my experience here at all despite all the accolades and awards it has received. I would not recommend this place.", "author": "Thao P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "Had a good mix of different dishes . Very good some of the best chicken chow mien noodles I have had . Each dish was delicious. I enjoyed the Mongolian beef when normally I don't even like it.\n4 stars good food!!", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-31", "description": "This place was a hard mediocre. The menu looked pretty bland, but they had a cheap lunch special, so we went in. Food turned out to be as bland as the menu, but seemed to be fresh, and was not bad. There was an entire tour group of about 30 (!) people there, to give you an idea of the clientele. \n\nService was fine. The bathroom smelled like somebody had poured concentrated cleaning solutions all over the floor and left it to evaporate. Really, really gross at a restaurant. (But at least you know it's clean?) Actually, the restaurant really deserves three stars, but the chemical bathroom smell was so offensive, I am taking it down to two stars. \n\nFrom the reviews, it sounds like dim sum is the way to go. Too bad my experience here was so different from everyone else's. :-\\", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-28", "description": "Came in here on a Saturday for lunch with a small group. My daughter wanted fried rice with egg and sesame balls. I ordered off the dim sum menu. Told them that I wanted Chinese broccoli and otherwise gave them my eating restrictions and told her to pick for me. I'm glad it did. She brought me shrimp balls and vegetable dumplings. Delicious. \n\nMy daughter's sesame balls looked wonderful but she loved them so much I couldn't even get a taste. \n\nAt one point during the meal, my daughter spilled her water all over me. The staff was quick to respond and very accomodating showing their excellent customer service. \n\nWith a health rating in the 90s where others seemed to be in the 70s, I would say Oriental Pearl is a winner.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-26", "description": "Made a return visit. Had dim sum and Mongolian Beef. High expectations from the last time. This time was disappointing. Food  flavors were good, but service was not. Everything came out at the same time. By the time I finished the dim sum the entree was cold. Didn't see a server again until he brought the check.", "author": "Jim R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "Super yum! Shrimp and veggies. Mushrooms and shrimp were very fresh and hands down the best looking eggdrop soup. Very good dim sum, we plan to return very soon!", "author": "Justin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-09", "description": "The sign on the outside is not representative of how nice it looks on the inside. Came on a weekday and wasn't disappointed\n\nSome people mentioned other places being dirty. If that's a problem try here!", "author": "Eric L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-04", "description": "Dimsum comes in smaller portions than most  places. A little pricey too, but other than that the service was great and the food wasn't bad either. Definitely a tourist type of spot.", "author": "Joanne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "Delicious! So glad we stopped here! Only had about a 15 minute wait on a Saturday night. Everyone was so nice and they bring out the food and assemble it in front of you. Helpings are plenty! We ordered Dim Sum, half a Peking Duck, and Chicken Fries Rice for 2 of us to share. We were sooo full and couldn't finish the rice. The duck was AMAZING!!", "author": "Tabitha H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "We shared 3 dishes: fried rice, beef and noodle. All were very well prepared and the beef was one of the most tender I have had in a Chinese restaurant. I certainly would go back", "author": "Louis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-29", "description": "No complaints!! I'm very picky so that's a big deal for me. The egg rolls were so yummy and the sweet shrimp (I'm not sure what exactly it was but it was shrimp in a sweet sauce) was soooo good. Came here for a work lunch. Def a good pick. More family style  than dim sum style.", "author": "Elizabeth H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "Amazing food and taste. The dumplings are beyond explanation. Orgasm of flavor in your mouth. Pork dumpling shanghai style is worth the mention. Pork buns just melted in your mouth. \n\nEvery dish that we ordered was better than the last one. The tea was complementing the food too. \n\nCan't think of anything bad.", "author": "Abhinandan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "This was recommended by a local shop owner.  We were quite pleased.  Reasonably priced Dim Sum. Service was great.  Upscale environment.", "author": "Greg M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-26", "description": "Went with a large group.  Food was absolutely mediocre.  Not one of the dozen or so dishes we ordered stood out as anything more than over-oiled, under-cooked takeout fare.  On top of it, service was awfully slow--took over an hour to get steamed rice and we never actually got full serving utensils and water glasses for the whole party. No idea what everyone else experienced here.", "author": "Randy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-25", "description": "Here is the worst restaurant I have ever been.\nWe were looking for some restaurants to have a lunch but there were no restaurants opening on Christmas so we went to a Chinese restaurant; One of my worst memory was coming from this point. A waitress came to us and asked whether we want a glass of water or hot tea. We answered water and hot tea and naturally we thought both of them would be free. And guess what. Although we didn't know it would be charged, we had to pay for \"that tea bag hot water.\" It is not all. I gotta say about the Food(noodles and beef satay). Those are ridiculously pricey and quality and service is like whatever. It was like junk food taste. And you know, Chinatown in S.F is usually crowded with visitors, so it was like they do never care about customers.\nUntil now, I've never commented before in Yelp. But this restaurant gave me one of the worst memory, I feel like must prevent other sacrifices who would decide to go there from a nightmare.\nI sure will never ever recommend this worst restaurant.", "author": "Hyojeong A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "What the hell, this is the best dim sum that I ever had!! Tasted like every spice, salt, and food were perfectly made in right portions just for me. Coming again and recommending it to all family and friends. Fun fact: they make their own rice noodle rolls. so fresh~", "author": "Hina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-21", "description": "Excellent Dim Sim restaurant in Chinatown, San Francisco. The 3 of us had a selection of Dim Sim (7 in all) for less than $40/-. The dishes were delicate and tasted excellent. Very authentic and in my opinion very well priced. The restaurant is on the first floor and is neat and tidy, not like some of the other restaurants.", "author": "Meng L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-02", "description": "Very clean dimsum place.  The menu describes clearly the vegetarian and the non-vegetarian items. Very attentive staff. We had jasmine tea with our dimsum. Dimsum can be ordered till after 2:30 PM which is great as we were running errands in the neighborhood.  We had the veggie dumpling and veggie rice rolls as well as veggie egg rolls. Generous portion! Clean table, bathrooms, and floors. Attentive staff. Recommened.", "author": "Kitty D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-27", "description": "I know a lot of people come here because of Rachael Ray, but honestly - we first went there in SPITE of her. We didn't even know she'd been there until we were on our way up to the dining room, and by then, we were so hungry we didn't care. (Not Rachael Ray fans, if you couldn't tell...)\n\nThis restaurant serves dim sum off a menu, not carts, and they offer combo-like set meals, which we share. It's a good mixture of different dim sum items, from egg rolls to dumplings to sticky rice and dessert. \n\nThe food is good, what you expect from dim sum. We've never gotten anything other than dim sum when eating here, so I can't speak to their entrees, but other people seemed to enjoy the food. \n\nThey've never been busy, in all the times we've been in. The service is quick, and you can get in, get fed, and get on your way fast, which I appreciate when I'm on vacation.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "Randomly stumbled upon this dim sum place in Chinatown. I was skeptical at first since it's got Rachel Ray on the window. But it ended up being really good dim sum!\n\nThe restaurant is on the 2nd flour, and is very clean, roomy, and quiet. On a Sunday, it wasn't packed like other places. There aren't any carts - you have to order a la carte off the menu. Every dish comes fresh.\n\nI have to say the overall quality was really good! I was really surprised by the flavors and attention to detail.\n\nShrimp dumpling - must get! The rice flour wrapping was really good and they add some crab inside, which makes the flavors richer.\n\nRice noodle wrapped youtiao - this was really good! The youtiao wasn't overfried and was crispy. Usually this dish can be too oily and overwhelming, but it wasn't like that at all.\n\nRice noodle wrapped beef - they put some water chestnut and cilantro in the meat filling. It's really refreshing and has a crunchy texture.\n\nSoy paper wrapped meat - also has cilantro, which I think adds to the flavor.\n\nI'd definitely come back here with a bigger group to try more of their other dishes!", "author": "Sherry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "So gooood! We went for the Dim Sum. Everything was outstanding and made to order. We sat by the window and had a lovely view. Great decor, great service, great company. Will be coming back for more when in SF.", "author": "Donna M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-15", "description": "I grew up eating a lot of Chinese food and so I think I know the difference between high-quality and blah, not so great. Unfortunately, this food just didn't impress me, The prices were certainly impressively high. $12-14 each dish - eeks! \n\nThe service was excellent, but I think it is needed to draw in tourists. You know to question a restaurant right away when there are no Asian people eating there! \n\nA friend took me here because he thought it was the best in Chinatown. LOL. Unfortunately, he has not eaten a lot of Chinese food and the recommendation came from the restaurant owner's family next-door! (He didn't understand that it's customary in Asian and other countries to recommend your cousin's restaurant first). \n\nThe Mongolian beef wasn't bad though a bit spicy and when she asked me how spicy, she told me they had already made it. So, what did they do, microwave it? That would explain why the dishes come so fast. The shrimp was starting to go bad too.\n\nThere was something wrong with the sweet-and-sour pork. We had two bites and then never touched it again. Tasted as of the pork was bad to me although he thought it was the sauce. It was obvious we didn't like it, and I think the waiter should've asked us if there was anything wrong with it. Sadly, my friend paid for it, though I don't think he should have because we ordered another dish. My friend also got very sick to his stomach afterword, so there definitely was something suspect.\n\nThere are plenty of good Chinese restaurants in Chinatown. Unfortunately, I would not agree this is not one of them.", "author": "Miss K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-18", "description": "Good food. We wondered and yelped many places in the area and most where 1-2 stars. Yikes! We finally saw this place and had decent reviews. The food was good, the place was clean, and the staff was attentive. I wouldn't drive here just to eat, but if you're in the area it is a good choice.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-14", "description": "There are many Chinese restaurants to choose from in San Francisco, and because I work nearby, I've tried many of them. So far, Oriental Pearl, in my opinion, is by far one of the best ones in the city.\n\nI've never eaten in the restaurant since I do take-out all the time, but I eat from their menu about two or three times a week. I usually order Mongolian Beef or Kung-Pao Chicken from their lunch special menu. Both dishes are amazingly delicious, but I enjoy the tenderness and rich flavor of the Mongolian Beef. I've tried this dish in many other restaurants before and none of them come close to Oriental Pearl's. \n\nThey make it perfect. The beef is very tender and not tough, perfect ratio of beef to onions and all the other major ingredients. It's just simply delicious. The best part is that at the time of writing this review, if you order this dish, or any other for that matter from their Lunch Special menu on weekdays between 12PM - 3PM, it costs only $9.00! This includes steamed rice and a small bowl of soup.\n\nI've never dined inside of the restaurant, therefore I cannot comment on their service. But when I call in the order, the staff is always nice and friendly and the food is usually ready in ten minutes. And when I pick up the food, the dining room is very clean and inviting and the staff is warm and friendly. The only reason for 4-stars instead of 5, is because the Mongolian Beef is slightly more greasy or oily than it should be. But that's just THAT particular dish and not all of them.\n\nRegardless, if you're ever in the area and find yourself craving some Chinese food, Oriental Pearl at 760 Clay Street is a definite must on your itinerary!", "author": "Joseph R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-15", "description": "Nice place to bring people, great service (better than most places in Chinatown), good menu, and the food is decent.  We went at an early hour and had very attentive service.  For quality of food, I wouldn't go out of my to eat here, but if I was entertaining business clients or family, it would be on my list.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-01", "description": "Like the former Asian customers said, no self-respected Chinese customer should eat here, for this portion is really overpriced, and the food isn't delicious at all and that's when we are quite hungry, water is not free, I don't think this place is dedicate enough to do this, when you come in, you can see there's almost no Asian customer here, quite disappointed, PLZ don't come here...", "author": "Bruce W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "This place is deep in the middle of Chinatown. \n\nThe Good\nService was fantastic, food wasn't too bad. I ordered the lemon chicken and it was good. Being able to get a table on a Saturday night in SF isn't always easy. \n\nThe Bad\nThe price wasn't too my liking for the portion I paid for. The food was good not great. But when I saw the bill I felt the price wasn't fair. Usually Chinese food is known for giving you more food than you can handle, not this place.\n\nThe Ugly\nNothing, place was great. Didn't have to wait long and service was good. Food tasted fune\n\nI would recommend giving it a try in SF. You can try other Chinese restaurants but this one is always available to try. Remember to bring your wallet.", "author": "James J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-24", "description": "A low-profile yet Michelin-recognized restaurant on a relatively uncrowded Chinatown side street. This is the kind of place we're all looking for, right? Uh, no. We made a reservation and were glad we did. The dining room was full and folks were seated on steps outside the restaurant, right smack in the way, waiting for tables to open-up. As has been noted in other reviews, fellow customers were all tourists, none of of them Asian - uh-oh. The food was high-priced meh. I don't know if I have ever rated a Chinese joint for its steamed rice, but it was horrible, like last week's Uncle Ben's. Don't waste your time and money.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-26", "description": "This is a disgrace to all Chinese restaurants everywhere. If you like terrible slow service, greasy meat, small portions, unfriendly waiters, and grim decoration, then you should try Oriental Pearl.  We had some Unrecognizable noodles in dark gelatinous sauce. It must have been a mistake.  Then we got a giant steaming dumpling basket.......with four little dumplings. These were actually tasty but not reasonable appetizer portion size. \n\nSomehow we had appetizers stretched out over 20 minutes almost one bite at a time\n\nThere must be better Chinese food in Chinatown. I promise you can't find anything worse", "author": "Ben H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-12", "description": "We went for lunch at 1pm and were given a dinner menu twice the price and to be honest my Mongolian Beef is superior to theirs I would never go to this Restraunt again!!!", "author": "Jan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "Oriental Pearl helped me arrange a group dinner for 20. The dinner was a hit! The group loved the set menu, quality of the food and were very happy with the service. Making the reservation and confirming all the details were very easy. Thank you to Rebecca for her help in making this night a success.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "We just arrived in The City and went on Dim Sum reconnaissance.  We were happy to find the Oriental Pearl.  The dim sum offerings were amazing as were the cocktails.  The restaurant was classy with white tablecloth and beautiful floral centerpieces.  Very nice oasis of quiet and class in the midst of Chinatown.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-02", "description": "RUN SCREAMING! This place sucks, and I can't find a nice way of putting it. To be clear, I love SF's Chinatown and almost always find awesome places to eat, no matter how \"hole in the wall.\" Not this place, and so not for this price.\n\nWe were in the mood for a little snack, nothing much, so we ordered the appetizer platter for 2, which came with egg rolls, potstickers, dumplings, and shrimp balls. For $16.50. Please keep that price point in mind. What we got - one egg roll, cut into 4 pieces. 2 potstickers. 2 shrimp balls. 4 dumplings. By my mind, that's almost $1.83 per piece - they better be good. Uh, no. The shrimp balls were pretty good, everything else was substandard. The best part were the beef dumplings, which were raw in the middle. Plus, they charged us $3.75 for a pot of really awful tea.\n\nThis place is a huge ripoff and you can probably get better Chines food in Tulsa or something.", "author": "Deb G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "If you're looking for a nice, authentic, and clean Chinese restaurant then this is your place!!! So glad our hotel concierge recommended this place, seriously a hidden gem. We got there 30 minutes before closing and the two people working were nothing but nice!! Everything we ordered was delicious, especially the BBQ Pork appetizer. \nIf you're in SF you should definitely try this place!!!", "author": "Enza R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-04", "description": "Asked the hotel for a Chinese recommendation and off I went. Horrible is all I can say. The reason for 2 stars was at least the service was good. Avoid this place if you want tasty food.", "author": "b r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-11", "description": "Upscale for Chinatown, this restaurant has traditional Americanized Chinese food. The best dish was the honey walnut prawns. The Peking duck was very disappointing. It was dry and not served well.  The service was fine.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-28", "description": "Saw this on $40 a day with Rachel Ray a while ago, so I was eager to try this place when I saw it... \nWord to the wise, expect a wait!! It is upstairs along a pretty shady street in Chinatown. The place looks a little questionable, but is packed every Saturday from what one of the other patrons told us. \nThe service was great, they were very warm once we were seated. We have a family of four and ordered the egg flower soup (two thumbs up), Kung pow prawns, sweet and sour chicken, and chicken chow mein. The egg flower soup was so good!! The Kung pow prawns were awesome. The sweet and sour chicken was just as we expected, but the chicken chow mein was out of this world!!! We should have ordered more, only for leftovers...\nI highly recommend this place!!", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "Best food I had in San Francisco this trip. Second floor restaurant in Chinatown, has an elevator but it was kind of hidden. Surprised at how elegant it was inside after the dingy exterior. Service was great, with servers making helpful suggestions for the meal we had in mind and bringing everything nice and hot. There was a good selection of vegetable dishes, food was fresh, very tasty and sauces not overdone. Surprised to read a few reviews criticizing the quality, portions, and prices of the food. Our friend who was a professional chef loved it, and portion sizes were reasonable: we came hungry and got one entree each, with leftovers for each of us. Most seafood entrees were between $17.50 and $24.50, which is not unusual even in cities with lower cost of living. Only thing is you order rice separately and the portion is rather small, about one cup. Would definitely go there again, but I don't recommend it if you expect a place with American-size portions.", "author": "Laura H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "Tasty, clean, good service and nice atmosphere. Parking available around the corner.", "author": "Andres F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-28", "description": "Tried this place last night. Seated quickly by friendly staff. Ordered hot tea, appetizer sampler platter, spicy green beans w tofu, and beef chow fun w satay sauce. Did not know there would be a charge for tea, appetizers were good and came w that little carved carrot bird, green bean dish was excellent, chow fun was good but might have been better w another kind of sauce.\n\nMay come back....or may keep searching in SF.", "author": "Shawn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "This restaurant was fabulous!!!!!  The food was fresh, tasty, and served hot.  The service was wonderful as this is obviously a family owned restaurant.  If you find yourself in Chinatown, you must try this place.  I'm a picky eater, and this was perfect.", "author": "Lucky G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "Beautiful atmosphere, attentive service, and delicious food. We were all happy and full by the end of our meal. We highly recommend the peking duck. Thankful to Yelp for the suggestion!", "author": "Anon Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-04", "description": "Throughly enjoyed our lunch. My suggestion would be to try the egg custard tarts. Flakey, light crust like that is very, very difficult to achieve. Kudos!", "author": "Kari C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-03", "description": "We were pointed this way by my Uncle-in-law, who said it was \"THE BEST CHINESE FOOD HE'd EVER HAD!\" and indeed when we arrived in San Fran on Tuesday evening, this is where we headed, but found out it was Reservation Only that evening.  Not to be deterred, we decided we'd come back another day.  That day was Friday evening, our last night in the city.\n\nWe got there a little before 6pm, just shy of our reservation time, it should have been hopping on Friday night, but the place was only 1/2 full, there was no wait time and we were immediately shown to a table.  It was stuffy, there was no air on, no windows open. Given that we'd walked over a mile to get there, this was.. slightly uncomfortable, but after sitting for a bit, we acclimated. \n\nWe ordered Iced tea (BIG MISTAKE) and our food, along with hot tea and ice water.  The Hot tea was delicious, but the Iced Tea was Rose and it was like drinking your grandmother's hand lotion. It was REVOLTING.  My husband ordered Hot and Sour soup that was .. oily and burnt flavoured, and our friend tried some too, immediately pushing it away, there wsa something other than tofu in it and given he's a vegetarian, it was off his menu.  \n\nMongolian beef, General Tso's and Almond chicken were our mains and they were all flavourful, I found it odd that we had to pay for steamed rice, that it didn't come as part of the meal. I suppose I shouldn't be surprised, they are milking the Rachel Ray & Zagat recommendations. If given the choice, I might not come back. The food was ok, the service, well they were certainly attentive, right down to putting the food on your plate and in your bowl for you. That's a little over done for me.", "author": "Dianna B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-11", "description": "Bad, bad food. Food was drenched in goopy sauce. It reminded of the green slime from Nickelodeon. Expensive too. One cup of wonton soup was $14 and it was average at best. And service was exceptionally slow. I'm sorry to be so negative but I was so disappointed.", "author": "Kent K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "I've been to this restaurant last weekend and loved it! The restaurant is very Chinese with a spaced out and big dining area. The bathrooms are super clean! The service is great! The food is cooked fresh, warm, and delicious! There is a good variety of food to choose from! The place is clean and fancy with Chinese paintings and dark features! I'd come here again!", "author": "Connor B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "This place is a hidden gem with some of the best dim sum I have ever had, especially the Calamari with Spicy Salt. Just do yourself a favor and place 2 orders. This place is never too busy so you can always score a table, and they have a full bar (just saying.)", "author": "Jane F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "Unforgetable meal with a great crowd.  Attended this restaurant while in San Franciso for a conference.  The Peking duck is to die for! Super tasty and comes wrapped in a flour tortilla. \n\nWe also had the beef chow fun which was cooked perfectly as I liked it. The House fried rice was a great compliment to all our dishes and the appetizer sampler disappeared within minutes reaching our table. Great and tasty food!\n\nThe warm Japanese sake recommended by our waiter was also a great choice. \n\nWell worth the scenery and walk to China town.", "author": "Mary S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-26", "description": "This place is the worst! They had no customer service, dirty and served us with cold food! This is very unacceptable and disappointing! While eating there, I saw rats running and droppings in the corner. Very disgusting! WARNING! Please think twice before eating at this place!", "author": "Fred W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-23", "description": "Being borned and raised in Hong Kong, I know authentic dim sum when I taste it.  Our hotel staff recommended this restaurant so we decided to give it a try. This place is located in Chinatown and caters to tourists. The locals do not eat here. Food is full of fillers and no real ingredients. I wish I didn't eat here.", "author": "Stella V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-04", "description": "Reasons why I choose this dimsum place over all the others:\n\n1. There's NEVER a wait. I've been here 4 times now and each time I was seated right away. In fact, this last time, there wasn't another single person in the restaurant.\n2. Despite the lack of people, the dimsum is pretty good. Frankly, they're all the same in my eyes but this one is still really good without the long wait that you'd get somewhere else.\n3. The service here is really friendly and nice. No carts though if you're into that sort of thing but you can still order the same goodies, just without the carts being pushed around.\n\nNote: There's a restaurant sign outside the restaurant but when you go through the doors, walk up the stairs and it'll be on your right.", "author": "Diana Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-31", "description": "We headed here for dinner based on decent Yelp reviews and a recommendation from our hotel's concierge. Unfortunately, our dinner was not great. While this restaurant wasn't awful, there just has to be better Chinese food in the area. This is Chinatown in San Francisco!!\n\nOn the plus side, we had a nice hot meal here. There was no wait to eat even though the restaurant was packed and the waiters and waitresses were all very friendly.\n\nHowever, the food here was not good. The fried rice was the worst. It had what seemed to be bacon bits in it along with mini shrimp. The cashew chicken was also questionable - it was hard to tell the mushrooms from the bits of chicken in it. The sweat and sour pork was good which made up a bit for the other dishes.", "author": "Audrey P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-09", "description": "BEWARE!  We were tricked into ordering an appetizer we didn't want.  The hostess came by our table with a dish and said, \"Our cook just made this.  Would you like to try?\"  Assuming it was free (never assume!) we said sure!  Well, they charged us $7.00 for a 2\"X4\" puff pastry thing filled with about a teaspoon of meat.\n\nThey also gave me the wrong order.  When I said this wasn't what I ordered, they refused to correct their mistake.  Luckily, my boyfriend was hungry so he ate it.   I had to order an extra plate.\n\nFood was average, and I will NEVER go here again!!!", "author": "Anna J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-08", "description": "We had a party of 7. Out of the way GEM! The food was superb, the staff professional and the dining room elegant. If this place were near my house, I would eat there everyday!", "author": "Sherry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-17", "description": "Came here for dinner with my sister. Great, clean space and very friendly service. We ordered a sampling of the dim sum (6 pieces for about $8 -- quite expensive) which was just okay. We ordered 1/2 peking duck -- they prepared the wraps for us which was a nice gesture (but I prefer to prepare it for myself). Was yummy, but instead of green onions, they provided a mixture of green onions and carrots (prefer only the green onions). We also ordered the mongolian beef with brown rice, which was delicious. \n\nOverall, everything was great. Would definitely come back!", "author": "Siv L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-17", "description": "We came here thanks to Yelp! We had plans to dine at R&G as always for their salt and pepper crab but due to the huge wait there and the fact that no one was attending to people arriving I yelped \"salt and pepper crab\" and found the oriental pearl. And what a pearl this place is. I'm glad we found it.\n\nAs other reviews point out the entrance can be deceiving but just walk in, head upstairs and a great dining experience awaits.\n\nIn fact we preferred Oriental Pearl over R&G. The crab was sublime and infinitely better. So much more flavor some. Staff were amazing. Welcoming and polite and always checking how things were. Contrast to the rush and aloofness at R&G..... Oriental Pearl is a much more intimate and relaxed dining. \n\nThe Mongolian beef is also excellent as is the hot and sour soup. \n\nI thoroughly recommend Oriental Pearl. I can't wait to go back.", "author": "Phill R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-21", "description": "Food was a mixed bag.  For the most part it tasted like typical takeout fair.  Mixed vegetables arrived with meat and had to be sent back.  Reworked dish was delivered quickly but under cooked to the point that bokchoy and green beans were practically inedible.  Kung pao shrimp had decent flavor but shrimp were very small.  Chicken in a shredded potato basket was the most interesting plate and had good flavor.  Overall, pretty average..  Recommended by our concierge, but we would not go back.", "author": "S. H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-08", "description": "Wanted to try this place since it popped up on Yelp as a place for dim sum! Stopped by on the 4th of July and they were closed. Hopefully I'll get a chance the next time I visit", "author": "Day M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-14", "description": "It was okay. The menu was extensive, and the servers and owners pressured me to eat more than half of it by repeatedly bringing me plates of food that I didn't order. I just wanted some simple beef with water chestnuts. The owner, who took my order, pressured me to order an expensive seafood dish. After a few minutes, she returned with a steamed bun, which I said I did not order, and she replied, \"well, do you want it?\" No. No, I do not. But it didn't stop there: three more unordered, not-free appetizers were brought out to my table by three other staff members. After I ate my actual meal, it continued with staff refusing to bring me my check, bringing me more and more unordered food!\n\nI think it's comical now, but at the time, I was really annoyed, and felt like I was getting a never-ending, high-pressure sales pitch during what should have been a simple early lunch. Even more curious, nobody else in the restaurant seemed to be receiving this treatment. \n\nI'm not cheap, I tip well, I was a party of one and ordered a drink and one lunch special - not a napkin and some water - and I arrived before the lunch rush. There were probably three other tables seated in the entire dining room at that time, and nobody was beating down the door waiting for a table. I will never go back to this place.", "author": "Austin J. A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Probably classify this place as a diamond in the rough. \nIt was recommended by the concierge at the Westin St Francis, as being a non touristy place in Chinatown to eat. By the sketched out look on the wife's face as we walked up we figured either we found a sweet place or we should start speed walking the other way.\nWe walked upstairs to this little place.. White table cloths and red napkins. The service was great people were extremely friendly and the food was delicious! (Not very often I eat left overs on vacation). We had the combo A and added chicken chow mien, everything from the dim sum to the main course was delicious! Highly recommend this place!!", "author": "Nate E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "This place has been recommended by friends. My party and I came here and it was AMAZING!!! Get the General Tsao chicken and shrimp fried rice!!!", "author": "Martha V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "I'm from Texas, so maybe I'm easily impressed by Asian cuisine, but this was the best dang Chinese food I've ever had.\n\nOur phones had all died so we had no idea where to eat in Chinatown. One of our group noticed a restaurant where a large group had just entered, just off the main Chinatown drag. Probably the best random restaurant decision we've made. And there were no girls handing us menus and coaxing us to come on in (their food is good enough that they don't need it, I guess).\n\nWe had the Prawns with Honey Glazed Walnuts (freakin delicious), the General Tso's (pretty dang good - this was my choice because I'm an American sucka), and the Eggplant / Pork Clay Pot, which was the clear winner of the night.\n\nI mean, the Eggplant and Pork Clay Pot was so good. Sooo goood. One of the best meals I've had in a long time. I can't even describe it because I've had nothing like it in my life.\n\nWas a great way to end a day in San Francisco.", "author": "Dan E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-17", "description": "I was looking for a restaurant in Chinatown for lunch and was pointed to the Oriental Pearl.  \n\nSometimes I even surprise myself, I ordered shell on steamed prawns with garlic sauce.  Generally when I encounter a cooked shrimp with it's tail still on in a restaurant it evokes an almost violent response from me.  So why would I order a dish that is entirely shell on shrimp?  I don't know, but it was yummy.  I also had the egg flower soup with vegetables and that was very good, possibly the best I've ever had.  \n\nWith Chinatown overflowing with restaurants I think you've gotta be realllllly good at what you do here.  The Oriental Pearl wasn't bad, but I think I'd try a couple more places before returning.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "This is our second time here.  The first time and second time was amazing and the service was superior. We were in and out in about 1 hour.  I had the Shrimp with walnuts they were amazing, the waitress said everyone asks for the recipe.", "author": "Jackie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "A 5 star dim sum spot in Chinatown!  White tablecloths too!\n\nYou wouldn't know it from the street, but this restaurant serves up delicious dim sum every day of the week.  You have to walk under a faded awning & up some ratty stairs to the dining room, but once you enter it is very nice inside.  It seems that mostly tourists dine here, but the food is delicious so don't let the lack of local Chinese folks deter you.\n\nI came with a group of 8 on a Friday.  We had a reservation for noon but it was not needed as the restaurant did not fill up.  The staff were all very friendly (a rarity in Chinatown) & gave us some suggestions as we tried to decide what to order.  They don't push around those little dim sum carts (darn), but the menu is pretty extensive, having both a dim sum & a regular menu from which to order.  It was all overwhelming since there were so many of us & we all wanted different things so I just sat back & let everyone else decide.\n\nThe best bites were:\n\nShrimp & chive dumplings\nSpicy string beans with ground pork\nChinese broccoli\nTaro cake\nCalamari with salt & pepper\n\nI know we ordered a few other dishes, but these were my faves.  The prices were very reasonable.  We all ate enough to fill our bellies & it only cost $13 per person!\n\nMy new fave non-dingy Chinatown restaurant.", "author": "Erin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "The service alone is 5 star. So friendly and just wonderful and patient. Also the food selection is great. Mongolian beef, potstickers, salt and pepper shell on prawns, all great", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "They have a must Try pecking duck and the marinade duck chiu chow style are great also the service is great not that much of a long line but it's a bit pricey", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-13", "description": "We went for dinner.  Don't let the lack of decor (think ugly ceiling panels and cheap chairs covered with plastic - very seedy from the outside) fool you.  The food was really good!  We had mini spring rolls, General Gao's chicken, Mongolian beef and vegetable chow mein.  \n\nThe only fault I can give it is that my husband grabbed his chair seat as he sat down, he didn't realize the seat came up, he sat on it and badly smashed his fingers.  So just be cautious of the cheap chairs.\n\nSlightly overpriced, but in line for SF.", "author": "Liz B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-15", "description": "Really, really good dim sum and other greasy goodness - with exceptional service. \n\nMy folks and I were looking for a place to grab some Chinese, and Oriental Pearl was one of the first restaurants to pop up on search.  Google search, ya didn't let me down!\n\nWe ordered what appeared to be cha siu wrapped in pastry crust, fried taro, pork siu mai, gai lan, the fried turnip cake, a spicy eggplant with pork lunch special, and a beef short rib dish (yes, we love to eat).  \n\nThe lunch specials were pretty good, but the dim sum was really something to rave about.  The kitchen staff seemed to have a special eye for detail.  Things like perfectly brushing the gai lan with a nice layer of oil, serving the fried turnip cakes with a nice, crisp pan-fried crust, and bringing out the food hot (and it seemed to order) made a really big difference.  Even the humble, siu mai had an exceptional texture (more coarse ground) and a richer, porkier taste.  \n\nThe service was also superb - probably the best I've had at a dim sum restaurant.  Most dim sum places just want you in and out; however, exceptional attention was paid to taking plates away, refilling tea, etc.\n\nI'd definitely recommend this place to anyone who visits SF Chinatown.", "author": "Julian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "Very solid Chinese.  Hot and Sour was very good, as well as a tofu dish with mushrooms.  Place was clean and the service was very good.  Kind of in an odd second floor setup, but it works.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "Absolutely wonderful! Will definitely be back!  Had potstickers, shrimp and walnuts and chicken chow mein", "author": "Kelsey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "Took the kids to Chinatown so we could pick up cheap fireworks, and trusting the Yelp reviews, we tried the Oriental Pearl.  Very nice.\n\nPlace has been renovated, so it's very clean.  Wait staff is quite, but super efficient.\n\nFood was excellent.\n\nPeking Duck - Crispy on the outside, juicy on the inside.  Served with plumb sauce.  Very good.\n\nWe had a spicy beef dish, pork with snow peas (peas were perfectly done, crisp), walnut shrimp (I didn't taste the walnuts because my middle kid picked them all out), and a very nice fried rice.  Best of all, though was a Dungeness crab dish.  That crab was probably swimming under the Golden Gate hours early.  Excellent.\n\nFruit juice concoction for the boys, Mai Tai's for Mom & Dad.  \n\nAll in all, a very nice find.", "author": "Bob G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "Great restaurant and service. We went on a Saturday and it started to fill up around 7pm. Food was good not greasy. We had the peking duck, house fried rice and spicey chicken. Everything was fresh. A little bit of a hike from Union Square area but worth it.", "author": "Bonita R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "Food was quite delicious and service was on point. Highly recommend this place to dine.", "author": "Anthony M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-05", "description": "Waitress sat down at a table beside mine to eat her dinner with the other wait staff. \nOrdered bacon and sausage with mushrooms and greens - horrible. \nThis place came highly recommended and It was a waste of time and money for me", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-11", "description": "I've been here a few times for lunch during the week, and it's always been exceptional! \n\nMade-to-order Dim Sum is always a favorite in my book. I always get a side of greens to cut all the fat (either Chinese Broccoli, or bok choy as a side). I also really like there lo mein noodles, and salt and pepper calamari. All there dim sum has been pretty solid in my book. \n\nAlso, don't forget to order the sesame balls! Hot and fresh to order, and oh so tasty!", "author": "Angela F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "This is a really good place to have a fine, reasonably priced, tasty meal.  As the Empress of China has closed which is a tragic loss to China Town in San Fran, this place is really good.  Everything we ordered we loved.  The view is nothing like the Empress had but it was a very pleasant, clean place, great service and well prepared food.  It is a bit hard to find but it is really good and worth a visit.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "All the food and the service were good. If we lived in SF we would go again but would try somewhere else if we lived here.", "author": "Paula R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Great dishes!! Large portions. Nice staff. Clean restaurant. We got beef and general zou chicken (not sure how to spell it). Didn't need any kind of appetizers.", "author": "Idan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-27", "description": "Food was great but small portions, kind of pricey for the amount of food you get, service was horrible as only had two servers with a busy restaurant. Bathrooms were clean. 2 stars bc of the service.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-28", "description": "Dim sum was the best I've ever had! Wow-the highlights: the fried calamari was perfectly seasoned, lightly breaded with a slight kick. The shrimp & scallion dumplings were humongous and oh so good! Service was friendly and top notch! The place was easy to find. Will be back...probably tomorrow! :)", "author": "Lola Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-28", "description": "we went here as a friend knew about rachael ray's positive reviews.\n\nit was pretty good!\nthey don't do the carts, you order from a menu\n\nsome pictures would have been helpful\neverything was good.\n\nthe service was good.\n\nnothing to complain about except they should have pictures.", "author": "Brian K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "While visiting San Francisco I had the pleasure of dining here. I was walking through Chinatown and asked a local of an authentic Chinese restaurant and he recommended Oriental Pearl. Although it is a little pricey, it's worth it. My boyfriend and I spent $60 on hot & sour soup, a combination of dim sum, cashew almond chicken, sweet & sour pork and oriental pearl rice (combination with pork, chicken and shrimp). From the delicious food and great ambience, I highly recommend giving this place a try if you're in Chinatown!", "author": "Christina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "What a great dining experience! From the outside you would not know what a lovely dining room was to be found.. Great food and service .   Our waiter made excellent suggestions that added to our dining experience. Good was excellent !!", "author": "Linda P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-04", "description": "Great friendly service, warmly greeted as soon as we walked in.  Clean, quiet and well kept restaurant. When ordering dim sum stick to the dumplings.  All were delicious.  Don't get the Siu Mai (had better in many places which is odd because it's such a staple).", "author": "Lori T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-18", "description": "We have been coming here for years. I'm from Calgary originally and every time we would visit the Bay Area we would always make a stop here for Dim Sum. In fact the Dim Sum was so good here we just stopped getting it in Calgary. We'd always regret the Calgary Dim Sum place and wish we were in San Fran.\n\nThe prices are really reasonable, and the service excellent. The only thing that docks a star for me is the atmosphere. It feels like you are eating in an office building not a restaurant. Florescent lights and paper covers the tables. They could use some decor. I suppose if they did renovate the prices would rise. \n\nCheck this place out! We love it!", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "We had lunch there twice during a business trip at San Francisco. We tried roasted duck, cod fish with bokchoy, vegetable fried rice and duck chow fun. All of them tasted REALLY delicious!!    \n\nFirst, the roasted duck is definitely a must-have dish, even though somebody in the previous review mentioned that the duck might not be crispy. Personally, this is the best roasted duck place I've ever had so far in US.\n\nSecond, the ingredients are very fresh. And the dishes are not salty and greasy at all. They kept a PERFECT balance between the amount of food and the seasoning they put into the dishes, which is great, given that in many Chinese restaurants, the food are usually greasy and with too much sauce on the top.\n\nThird,  aside from the delicious food, their service was GREAT!! All the waitors and waitresses are nice, friendly and patient. Consider that it was the first time we visited there and I had many questions to ask before ordering, they were so nice and patient to answer all of my questions, which made our dining experience really joyful.", "author": "Lilien C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-08", "description": "A huge group came for dinner and they were very accomodating. They set a menu for us about $25 per person which wasn't too bad price-wise.\n\nAll of the food items they brought to us were really nothing special. Chinatown in SF, I had really high expectation, but I wasn't blown away at all.\n\nNot sure what other Chinese places to check out, but I'd look elsewhere. You're in Chinatown, so I bet you could throw a rock and either hit an old Chinese lady or a better restaurant.", "author": "Taylor A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "Dinner here was wonderful.  I wanted Dim Sum, but the place we went to nearby was closed for renovations.  This had good reviews so I decided to try it out.  I am glad that I did.  It was a nice sit down place with very attentive and polite staff.  The Dim Sum Sampler appetizer was ok.  Not the best that I've had.  The Almond chicken with Cashew Nut hit the spot as did the Oriental Fried Rice.  It had the amazing Chinese sausage that tasted like cured pork with a pineapple sweetness.  The star of the meal was the Prawns with Honey Glazed Walnuts.  You need to order this.  It is not a dish I've had anywhere else.  Our server said that it was a house specialty.", "author": "Jessica E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "Delicious.  Our server recommended a dish, prawns and walnuts in honey sauce and it was delicious.   We also ordered the cashew chicken but it was a little bland.  I will definitely go back, but will let the server recommend more dishes.   Price was very fair for the amount of food.   Service was great and with no reservations we only waited  10 minutes for a table.", "author": "Carol C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-14", "description": "The food was 3 star.\n\nThe location is 5 star, in Chinatown.\n\nThe ambience is typical Chinese, 4 stars.\n\nOur waitstaff was adequate, so 3 stars.\n\nYou are safe eating here!!", "author": "Best P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "My husband and I were quite disappointed because our all time favorite restaurant in China town, Empress of China,  was closed for good. But thanks to a nice guy we met at one of the stores told us that Oriental Pearl was even better, we had to come and try it. This restaurant is so delicious. We had the prawns and scallops with vegetables and the taste was amazing. You have to try the spicy green beans with tofu; you will not be disappointed. The service was impeccable! We will be back again and again!", "author": "Christina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "This is a very nice restaurant in the heart of Chinatown. Only $15corkage fee.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "Took my mom here for her birthday dinner and it was right before the Thursday dinner rush at 5pm. Great noodles and impeccable service.", "author": "Junica B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-04", "description": "The food was pretty good, only giving 3 star because of the portions. The A and B family dinners are almost $30 a person and our 2 grown-ish boys left hungry. The portions would've been ok for 2 people but not near enough for 4! Should not still be hungry after spending $130 before tip!", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "This restaurant is a little pricey but if you are looking to splurge on some outstanding Chinese this is the place. The Peking duck is exceptional. Try to resist putting too much of the delicious sauce on as the flavored as they serve it are really well balanced. We had the tofu and seafood soup and it was delicately layered with flavor. Assorted appetizers were good and the fried rice was superb. Again resist putting soy on the fried rice as it looks light but the favors layer and it tastes light and fresh as is. Definitely a sophisticated Chinese experience.", "author": "Dean T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-05", "description": "I can't get over how much I love this place! This is my favourite place to go for Dim Sum. Hy husband and I always come to this place whenever we visit the Bay Area. You'll find it located just off the beaten track of SF China Town on the second level. The staff are very friendly and the food service is very quick, as Dim Sum should be!\n\nWe'll often get the Chinese dumpling, sweet pork, Chinese broccoli and sesame bun. We may only come here once a year but every time we come it's just as good as we remember it.", "author": "Roz M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-30", "description": "This place was fantastic. It was friendly service, great food- and just a great vibe! We were stuffed full of good food and will return whenever we're back in San Fran:)", "author": "Sophie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-14", "description": "Concierge at the Marriott Marquis recommended this place and I ate there twice during my stay. Very clean dining area, friendly stand attentive service, and good selection of food.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-31", "description": "We come here every time we're in San Francisco. I haven't found another place that serves prawns with candied walnuts as good as they make it here. We usually eat an early dinner so the restaurant is quiet and the servers attentive. I also like the hot and sour soup, along with pot stickers, for starters.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-10", "description": "One night is San Francisco following a great week in Napa, and our hotel recommended oriental pearl.  \nFive of us, all ordering different dishes and not one would I recommend. \nBland  and boring would be the best description.  \nWe all love Chinese food, so this was a bitter disappointment and a bad way to end our vacation.", "author": "Herman F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-25", "description": "The food lacks flavor.The tables are too close to each other I can hear the other customers chewing their food.A large aquarium is situated at the dining area.The giant tilapia's are better off donated to Ripley's believe it or not. They are gliding on the mossy glossy aquarium glass.I guess,the janitor fish is too lazy to clean it up.\nBack to the food,it really lacks flavor.Im too young to be on a renal diet.Hellooo,what happened to ajinomoto msg??", "author": "Maria Gerona L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-12", "description": "Ok after checking out the reviews on yelp,   plus and minus,  I decided to give this place a chance.  Not disappointed at all. First it was very clean and well kept. The drinks were great. The food was very fresh and tasty.  Now here is the kicker.  I travel alone for my work a lot.  Many authentic Chinese restaurants serve family style for 2 or more. My server suggested an off menu dish that they made for me custom. It was superb.  I also had the vegetable steamed appetizer. All of my food was fresh and wonderful.  If you want a table and good service try this establishment.  If you feel they are not delivering talk to the manager.  They will make it right.", "author": "Sean D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-15", "description": "For my birthday, the hunny and I decided to head to SF china town as we were wanting to try some authentic chinese food. Not one of those places that has a panda in its logo. We ended \" at this place just by chance and luck. I knew we had made the right decision after seeing rachel ray's plaque amongst others on the wall. The decor appears upper scale with fancy folded napkins and table cloths. But the atmosphere is not stuffy, and perfect for the traveler who wants a break from the speediness of the city.\n     We ordered the dim sum appetizer which was delicious and just perfect to start your appetite for the food that is ahead. I ordered mongolian beef and boyfriend ordered chow mien. The chow mien is made with thin noodles, and not thicker spaghetti like noodles which I was accustomed too, but nevertheless it was tasty. Be careful of the monogolian beef as is packs a punch. It is often advertised on menus as being spicy, and the dish turns out to be much more sweet and saucy than spicy. This dish was the opposite. The spicy crushed red peppers left me yearning for my beverage glass. The service was awesome and catering. The lady who helped us was a sweetheart. I highly recommend if you want delicious food in chinatown.", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-21", "description": "If you are looking for PF Changs, get out of China Town. If not, this place   was worth the go for us. The people are very nice. They serve you from the family-style plates. They were attentive. I think we stayed past hours. They didn't say a word. A few of the staff just began to have their meal for the evening...which I found pretty neat to see a smart, old fashioned practice alive and well.\n\nThe place is what you'd expect. Not sparkley. We had a couple seafood dishes and a couple veggie dishes that were fresh and well prepared.", "author": "Becky R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "Top Notch! We were looking for a little more upscale restaurant to eat at during our visit to San Fran. Clean white table clothes, excellent service. We had our five year old son with us and just ordered a dim sum platter and it was perfect for the three of us! The servers were even great with our son. We will Deff be back!!", "author": "Amylynn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "best Peking duck in the city!! The salt and pepper crab is a little messy but oh so good. They also make a great Mai Tai. There Dim Sum is house made and fresh. Great staff and they deserve 5 stars", "author": "Concierge J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "This place was awesome! Great food, great service, great atmosphere! Will definitely go back when I'm in San Fran again!", "author": "Peyton P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Went here for our first night in San Francisco. Great service and lovely food, the crab was delicious!", "author": "Sam C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "This place was recommended by our hotel concierge. Definitely a place that tourists visit vs locals, but still a good choice. The atmosphere feels traditional.  We had the appetizer platter, a variety of options which was tasty.  Then for our entrees we had beef fried rice and almond chicken with cashews. Both were very tasty. I'm not sure how Rachel Ray ate here so cheaply on her former show $40 a day! While prices are reasonable they're not that low! Overall, a good meal and we would return. We also would recommend to others.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-19", "description": "It was disgusting... Walnut shrimp tasted like I was eating shrimp with mayonnaise, was not sweet and it was cold. Combination fried rice was not good at all. Beef and broccoli was yuk. Beef was still red and it was way too tough! Will not recommend this  place to anyone and will not come back!!!", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-12", "description": "Not much to say about this place aside from the fact that the underwhelming food was very overpriced.  Peking duck was below average, skin was not crisp.  It was served in tortillas, with carrots and a scant amount of scallions. Bbq quail appetizer was ok.  Much better spots in Chinatown.", "author": "Tony V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-05", "description": "Selected this place based on yelp reviews. No Asian people eating there, so bad sign. Cool carrot carving decorations. Polite service. Overpriced food. They recommended very americanized dishes to us. Shrimp with candied walnuts were covered with mayonnaise? We went there in search of dim sum, although it was evening. They had a few dim sum items. Peking Duck was cold, and dry tasting, maybe not enough sauce placed in the pancakes. Kind of sad that our family dinner didn't turn out as well as I had hoped. Smelled like smoke even though I couldn't see anyone there smoking. I would not go back.", "author": "E. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "For authentic Chinese cuisine at a reasonable price, served by an outstanding wait staff, I recommend the Oriental Pearl.", "author": "Todd H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-24", "description": "Typical price-gouging tourist trap. My luke warm duck came 15 minutes before Mary's stir fry. Waiter refused to make eye contact. Cold sake was served with a glass of ice. Rice is extra? Really? Feh.", "author": "Gary F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-02", "description": "Not as good as a couple of years ago when we thought the food was excellent.  We will be looking for a different place for next visit.", "author": "Roxanne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-30", "description": "My granddaughter and I made a spontaneous trip to Chinatown on a Monday.  We were early, I guess, because there weren't any restaurants open except grab-n-go places.  We kept walking until we spotted Oriental Pearl.  I found it very open and spacious, but there was only a few of us there, so....\n\nThe server helped my granddaughter (8 years old) pick out a noodle dish with her taste preferences.  I started ordering dim sum like I knew what I was doing but the server warned me it was too much food.  I appreciated that!  Especially since the whole lunch ended up costing $30.  I was a little surprised.  I guess the individual dishes add up.\n\nMy favorite was the calamari with spicy salt - delicious!  I also had pan-fried shrimp & chives dumpling which was pretty good.  The Shanghai style steamed pork buns weren't all that great but they came with a ginger vinegar dip that was a nice twist on soy sauce.\n\nI'd go again.  Nice service, fresh and fast food.", "author": "Pamela P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "Love this place! A little deep into Chinatown if u are a little skittish as a tourist but worth it! Not a looker from the street by go up the stairs and presto! There are the white tablecloths and friendly staff. The Peking duck is the best in town.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-12", "description": "Ok I guess. It wasn't horrible, but then again literally everyone in the place was Caucasian. Not a good sign in Chinatown.\n\nThe mai tai's had a good amount of booze. Not too much, not too little. We had the dim sum platter. Weird to have beef shiumai. Not a fan, but that's just me. The pork were fine.\n\nIt's a sizeable place. Lots of kids. Tank with lobster, all the standards. They were VERY attentive in their service. Kinda made me wonder if they had enough plates in the restaurant. They hovered just itching to pick them up.\n\nI guess I'd go back in a bind.", "author": "Stacie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "Super awesome dim sum.  The best choice we made was to ask for the recommendations from our servers and their selections were by far the best.  The spicy salt calamari was probably the most surprisingly delicious item we ate am the while meal.  Also the chicken meatball， stuffed eggplant.  Their dumplings were all very good too.  My sons each got a quail and they liked that as well.  Good service especially for Chinatown.  Not sure why this place doesn't have a higher yelp score... Looking at the reviews it seems most of the people with lower scores for entrees so maybe those should be avoided.  I didn't try any of them but I think we had 8 different orders of dim sum and they were all good except the jelly fish.  That wasn't terrible， just not so great.", "author": "Cranky M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "Great food and if you are seated by a window you'll get an excellent view of Chinatown!", "author": "Lindsay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-24", "description": "Great Chinese food. No dim sum for dinner - for lunch only. Slow service so don't come here to eat in a hurry!", "author": "James J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-24", "description": "Don't let Rachael Ray's photo fool you. This is not authentic Chinese food or anything close to it. It's not good, the only good thing about it is the price.. You get what you pay for. Cheap price, cheap food. The food was bland. Lean Cuisine Chinese food is way better than anything from Oriental Pearl Restaurant. If you want truly amazing Chinese food go to R&G Lounge!", "author": "Shawn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-26", "description": "Decor=1-1/2 --bland decoration, white walls and nothing interesting.\nValue=2-1/2-see below\nFood=3\nservice=3\nBeef Broccoli was ok on par with other chinese restaurants; Walnut Glazed Prawns were real good; Seafood combo was Ok--there was more tofu than seafood.  If it wasn't for the prawns I would of given 3 stars.  Price was $15.95 for prawns and 18.95 for seafood combo.  They charge you for the rice as well.  On the pricey side in my opinion.  If I was a local I wouldn't go again, I would try somewhere else.", "author": "Mark H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-01", "description": "My wife and I have eaten at Oriental Pearl many times over the past 3 years.  it is probably our favorite chinese restaurant in San Francisco, certainly if measured by the number of times we have eaten there compared with any other Chinese restaurant (we have probably tried a dozen).\n\nThe restaurant itself is not fancy and due to the Rachel Ray recommendation it is always busy with tourists.  But we really like the food here and have always had great service.  We order pretty typical items (hot and sour soup, potstickers, various chicken, beef and scallop dishes) and always come away satisfied.  Had the salt and pepper crab once when that was in season and would definitely order that again.\n\nOne other plus is that we have always been able to get a reservation on a few hours notice and when we get there we are seated within a few minutes.", "author": "Richard M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-10", "description": "I totally agree Henry W. review dated on 7/30/2011. If I could give them less than one star that would be a better category. I was there just this past weekend with my boyfriend 8/6/2011 for dinner. First it took us 30 mins to get a number and there were only 2 people in front of us. Long wait to get seated, another 30 mins. I told my boyfriend do not order any sea food after I saw their aquariums. The fish tanks are SO disgusting. Fish and lobsters are stuffed into an undecorated tanks and swim around in brown water. Gross. I wanted to leave, but my boyfriend said \"There are a lot of people waiting, perhaps, the food was well worth the wait for its reasonable...\"\n\nwe ordered:\n\nDeep Fried Shrimp Ball in Chiu Chow Style (4) ....................... 8.75\nSauteed Pea Sprouts with Garlic ........................ 14.75\nsome rib dish w/ Spicy Salt ( I think it's around $ 8.75)\n\nWe waited for another 30 mins for 4 tiny shrimp balls, then we waited for another 25 mins for the other 2 dishes. The very easy to prepare ribs with spicy salt was deep fried and covered in heavy batter (WTF?). The pea sprouts was an overpriced rip-off.\n\nI honestly had no idea why Rachel Ray and AAA gave it a good reviews. I am Chinese, and I am not a picky eater but these food were the worst. I was so embarrassed by the way the restaurant presented their cheap street food.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-30", "description": "It's amazing how one persons crap is another ones treasure. There were many good reviews here especially for Peking duck\nWe even noticed that Rachel Ray was here for one of her shows $40 a day. Well at least we know how she does it now!. She eats crappy food! \n\nSo we decide to go because they make the duck with flat pancakes and not fluffy buns. Flat pancakes is the way to go. We we made a reservation which turned out to be a good idea. There was a line out the door. They seated us as soon as we got there. We ordered two drinks, which arrived in the smallest high ball glass and tumbler we have ever seen. Like made for little people or something. \n\nAlso very strange, when we sat down, we noticed not one table in the restaurant was eating. Then all of a sudden food started coming out. Like we were on a cruise ship or a wedding or something.\n\nHere's what we ordered:\n\nDim Sum sampler\n1/2 duck\nBeef with scallions\nWhite rice (They charge extra for rice)\n\nDim Sum? We ate it but it was not so good. \nBeef and scallions was very good but you could get that anywhere.\nThen came the duck. Yuck! Dry, greasy, tasteless, awful. The sauce wasn't even hoisin. \n\nIf you think this is good duck, you don't know good duck.\n\nThe only place in the US that does it right is Peking Duck House in NYC on 53rd street between 2nd and 3rd. \n\nWhoever rated this place good, and especially raved about the duck?......well my friends,..... stop by my house one day for a nice bowl of Spagehtti O'si or some cardboard on toast! Geez !!!!!  STAY AWAY", "author": "Henry W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-26", "description": "We were sent here by the concierge at our downtown hotel, he highly recommended this place.  Like most Chinatowns in urban America, the area is seedy and decrepit.  Despite our misgivings we went in, based on the rec.  The Pearl is no exception.  \n\nShould have trusted our instincts, developed over years of travel dining, and moved on.\n\nWe tried a sampling of a few items.  Their menu posted outside doesn't match the one in the dining room.  No dim sum at night.  OK, fine, we can adapt.  After confusing explanations from the waiter of their a la carte menu (no rice served with dishes??) we finally ordered.  In a nutshell, the food is uninspired and ordinary at best.  A weird flavor dominated one dish we had, the sauted prawns, making the dish unusual and unappetizing.  Prawns the size of 25-30 count shrimp?  Plus it was really oily.  And $15 for an order of fried rice with seafood, with very little seafood and too many scallions.  \n\nI am surprised how highly rated this place is, in a town with so many Asians I would expect more.  I've had much better Chinese in other cities with less predominant an Asian influence.  Just not impressed at all and wouldn't return. \n\nIf this place is supposed to be one of the best, I would hate to sample the average.\n\nOh yeah, our waiter was just OK, he vacillated between helpful and annoyed at our inability to decipher his largely indiscernible explanation of their offerings.  He would only stay a moment at our table before darting off, promising to return once we figured out what we wanted.  He was impatient with us, yet he stood gabbing with the folks at a table nearby for a long time.  Maybe pandering for a tip.  Service is sub par.", "author": "Jay W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-27", "description": "I loved this restaurant.  Chinatown is so fun in SF and this restaurant sits in the heart of it.  The entrance looks sketchy but once on the 2nd floor, the restaurant is really lovely with nice table clothes and napkins.  I had a simple but delicious lunch which was the sweet and sour pork.  That coupled with the soup made for a delicious lunch.", "author": "Jim C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "We took our family of 4, 2 kids under 12, with another family with 2 kids under 8. Food, and service excellent.  We mainly had Dim Sum dishes, with a few other items as well. Great experience overall.", "author": "a A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-15", "description": "Good selection on the menu, but it's overpriced for the quality level.  They go for an upscale vibe to justify the higher prices but the atmosphere is so dated and desaturated that it doesn't work.  Food was OK, but not worth the price, especially for chinatown.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-10", "description": "Food tastes good, but a bit too greasy.  The wait time is very long between each course, and they are not even that busy!!  We waited for our last course for over 20 min.", "author": "Jess M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "This place is right in the heart of China Town. Slightly upscale with great dim sum. Very clean with excellent service. One of the better places to eat in China Town.", "author": "Reisha B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-17", "description": "Best Chinese food ever. So recommended. My husband is a very picky eater but he absolutely loved their food. We tried the beef fried rice and it was amazing. The Mongolian beef was supper delicious. If you wanna eat in Chinatown you should not miss eating here.", "author": "Mahsa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "Dim Sum aficionados - look no further. This is the best dim sum my Cantonese wife and I have had in SF Chinatown. The service was polite and relatively fast, and the price was quite reasonable ($30 for two people to fill up on a variety of dim sum).", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-04", "description": "My wife and I go to Oriental Pearl whenever we are in the City because the food is phenomenal, the ambiance is great and the service is excellent.\n\nOur favorite dish is the Peking Duck which gets prepared at the table and rolled up in something similar to tortillas which they call pancakes.  The sauce is addictive.  All other dishes we've ever had have been delicious as well.  We've been here lots of times and never left disappointed.\n\nThe ambiance is simple which we love.  Less is more and yet it seems very authentic.  White table cloths and comfy chairs.  It makes the experience so much better.\n\nIt seems like the same people have worked here for as long as the place has been open.  They even remember us though we only drop in once every 4 - 6 months.  Part of why this restaurant is so consinstently good is because the owner is there every night.  Their presence undoubtedly creates an expectation of excellence.\n\nWe can highly recommend Oriental Pearl and will be back many more times.", "author": "Hartmut O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-17", "description": "The Dim Sum was great!  I also enjoyed the scallops and mushrooms but David's duck casserole was not worth eating.", "author": "Charity G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "Had lunch here yesterday.  The Peking Duck was wonderful.  Other lunch items were pretty typical Chinese food, but well prepared.  The decor is nice.  Not lavish, but not tacky either.  One big advantage for out-of-towners is the very close (and reasonably priced) parking at Portsmouth Square.", "author": "Janis P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-15", "description": "recommended by a woman at the front desk of our hotel. The place was busy and a mix of americans and chinese eating there... we went for dinner. The noodles were a bit too oily for my taste.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-25", "description": "It was enjoyable, but not remarkable. The service was strangely busy, but simultaneously unenthusiastic. I didn't hate it, but I wouldn't do it again. On balance: meh.", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-27", "description": "Excellent service and wonderful food if you like Dim Sum arena. Out of the way location and unassuming from the outside, but quite causlly pleasant on the inside. Recommended.", "author": "Jim L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-05", "description": "Service was fast and courteous, since I came in on a slow Monday afternoon. I have been meaning to expand my culinary horizons within the Chinatown area. They have a pretty comprehensive menu with set menus for everything from dim sum prix-fixe to fixed meals and lunch specials (that come with tasty hot and sour soup and your choice of rice), but I must say that they are extremely strict on the no substitution rule, and you can only do the set menus IF two or more persons are doing the same set menu. \n\nI came in craving dim sum and wish they had more of an extensive selection, but they had the usual suspects, har gow, shiu mai, steamed pork buns, potstickers, etc. and a decent selection of the traditional offerings of a Chinese restaurant. I do love the carts that go around at authentic spots that one tends to find at a Cantonese restaurant. They had the white tablecloth, simple decor, and it was clean. The service was good and fast, was not too stifling, the pricing was reasonable (for SF restaurants) and the food was pretty authentic. My cab driver even vouched for them on the way in.\n\nIt is pretty centrally located in Chinatown, and they have tons of competition, but it is not bad, and extremely well-priced. My good friend and I enjoyed our lunch there, but either the meal was salty, we were extremely dehydrated, or the glasses were small, because after 2 refills on our diet cokes, we still needed more, and I usually can't finish one can in a setting! I am pretty sure it was priced per re-fill too. Not a hefty charge but when you have tons of re-fills, it adds up!\n\nI will come back, after I check out their competition!", "author": "Tammy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-16", "description": "Hole in the wall treat, hidden gem goodness. Go for the walnut and prawn (aka shrimp) dish.", "author": "Pinky L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-20", "description": "It's upstairs and hard to see from the outside, but it's definitely worth it.  Service is exceptional even for non Chinatown standards.  The food was one of the best I've had in the area. Very classy and fancy inside. I definitely would come back anytime I want a place away from all the crowds and busy folks.", "author": "Adam H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-27", "description": "Amazing food and amazing service! After ordering two vegetarian appetizers, the owner came by and suggested the BEST vegetarian entrees. \n\nLoved it and would come back in a second!", "author": "Tasha B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-30", "description": "On our last day in San Francisco, my friends and I passed by this place and saw that it was on an episode of Rachel Ray's $40 a Day show so we thought it might be good. The food was not good. It wasn't bad but we were expecting so much more and we realized that Rachel Ray would know NOTHING about what Chinese food is supposed to be like. \n\nThe WORST part?? \n\nThere was a hair on our dumplings. This alone was gross enough right? No! We sent the plate back, telling them there was a hair on it. We were actually very nice about it. We just wanted another plate. After about 5 minutes, the waiter brings out another plate of dumplings. Or so we thought. It was the SAME plate! I knew because I took a before and after picture on my camera and it was VERY obvious. They didn't even bother to rearrange the dumplings. I don't even want to know what they did back there that took them that long to bring out the SAME plate. \n\nWhen I pointed this out at the end of the meal, the waitress said \"No, it's a different plate.\" I said, \"No, it's the SAME plate. Do you want to see the pictures on my camera?\" That's when the waiter that brought the plate to us walked by, picked up the plate, and rudely said that he would take the dish off our bill. \n\nI would NOT come back to this place simply because I believe what they tried to pull off was so distasteful and disrespectful.", "author": "lisa p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-11", "description": "I've tried coming to this place twice and I always picked the time that they were closed. Finally I made it! Glad I did too. I went with a large group, my family. The waiter (owner?) made plenty of great recommendations and also asked if anyone had questions which were quickly and descriptively answered. \n\nOn the table we had sweet and sour chicken and shrimp, veg lo mein and chicken lo mein, mongolian beef, chinese fried rice, and peking duck (my favorite). \n\nIf I return I will definitely be getting the duck again!\n\nThey gave us a pot of hot tea and for those who weren't used to that -- they got iced tea. However, they didn't like it since it was lychee flavored... oops.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "We live in NYC and eat in our Chinatown regularly, and I travel to China for business.  Oriental Pearl has great food! It's a block off the main strip and up the stairs, so not as crowded as other places with better locations. Too bad for those who miss out:  the dumplings are freshly made (i.e., you'll wait a bit for them, rather than pick them from roving carts), as is everything else.  Pork buns, Shanghai-style pork dumplings, veggie spring rolls, rice noodle rolls are our favorites.", "author": "Rich K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-21", "description": "My only stop in chinatown for Xmas. Highly recommended, especially the duck! Great food and service (a unique combo) for c-town.", "author": "Sharon M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-07", "description": "Went here for dim sum.  Food was okay.  It was decent flavor, a bit greasy, and decent prices for dim sum.  The rest of the menu was pretty much Americanized chinese food.  \n\nPretty clean.  Bright lights.  Some natural lighting as well.  \n\nService is friendly, efficient, and they're wearing cute bowties.\n\nTucked away, near the park.  Not sure about parking in this area.\n\nSo, if you want a quiet sit-down place for the lunch rush, go here.  But if you're in for the Wow-effect, skip this place.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-11", "description": "Much nicer than you'd expect from the street. White table cloths and very attentive service. I had the mini spring rolls and vegetables with mushrooms. I enjoyed everything. Prices are higher than you need to pay in China town for a meal, but if you want a nicer, sit down restaurant this works well.", "author": "Jim U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "We decided on the Dim Sum lunch for two!  Great decision. Everything was delicious!!  And the service was wonderful too. We'll definitely come here again!!", "author": "Shari L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "We had dinner twice here. Everything we ordered was good, especially seafood. Their hot and sour is spicy true to it's name.", "author": "Omur T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "Great experience and food.  I never would have ventured in if I hadn't seen it on Food Network.  Excellent service, excellent food.  Quiet atmosphere.  Loved the hot and sour soup and the Mongolian beef.  Location was great.", "author": "Theresa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-08", "description": "I visit the Oriental Pearl every time I am in San Francisco for one thing in particular:  The Peking Duck.  Waiters wrap it in moshu pancakes for you.  Even folks who have never had duck or claim not to like it seem to enjoy it here.  The other food is pretty good too but it's really the duck that brings me back.\n\nI love the attention that the waiters give you here too.  Much more so than at most Chinese restaurants.  They are very professional and spend time at your table.  They help you with serving the food, and as I stated, they do all the hard work for you on dishes like the Duck Mushu.\n\nThis place is great for large groups.  They have very generous \"family style\" meals where you get to try a lot of different dishes as well and the large tables have a rotating centerpiece which makes it easy to get to the dish you want.", "author": "Adisak P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-21", "description": "This place is great. It was zagat rated so I figured it had to be decent (so far I have not been disappointed from any of the restaurant listed in that book, def a book to get if you want to try some great food).\n\nIn the heart of China Town, this place is of a descent size, upper scale with white linen and all, on the wall to your left when first walking in is adorned with pictures of Rachel Ray and local rewards. \n\nEverything from the appetizers to both mine and my friend dish were Incredible definitely measured up to the high expectations that I had built up. The flavor was light fresh and extremely satifying.Little pricey!! But you can taste the quality and effort put in to it. Nice service as well. I have only been there once and have yet to try some more of there dishes. Looking forward to going back.", "author": "Shannon H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-05", "description": "FOOD: My God, this place is a disgrace. The Dim Sum is a disgrace. The meat is greasy and disgusting, shrimps are tasteless and FAR from being fresh, and the vegetables have all been over-cooked and soaked in MSG. A plate of vegetable Chow Mein (stir-fried noodles) costs a whopping $10 and it's not even enough to feed one person. Not to mention that it's extremely greasy too. The *only* Dim Sum that's not too bad is the \"Beancurd Rolls in Oyster Sauce.\" Everything else is a total disgrace. Do not come here for Dim Sum. Dim Sum is NOT supposed to be this bad! Argh! Yikes.\n\nDECOR: The interior decoration is characterless, which is worse than being ugly. At least ugly places might have some indivudiality or originality to speak of. The walls in this restaurant are pale white and the whole place feels like a hospital, no less.\n\nSERVICE: Except for ONE waiter from China (he speaks a China-accent Mandarin) who is friendly and attentive, everyone else is indifferent. There's even a thinly-veiled frustration and hostility present in the air. We were there for lunch and there weren't many people there. But still, we received NO service whatsoever (except from that friendly Chinese guy, occasionally). I seriously wonder why....", "author": "Rachel W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-23", "description": "Following the recommendation from our hotel concierge, we were very disappointed with the food. If this is the best Chinatown San Francisco has to offer, we are sadly unimpressed. Bland, bland, bland food. Brown rice was soggy, clumpy, bleh. We tried two different dishes, both were bland and really quite gross.", "author": "Janelle J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-18", "description": "In town for the weekend game and we wanted some Chinesse food.  People suggested R & G; I called and they said everything had been booked and that they couldn't guarentee a table for my group but said we could wait... We found ended up at the Oreintal Pearl...  It's a hard place to find because its off the main strip but I will tell you it was a damn good place. \n\nSince we never had been to China Town we decided to go big, dim Sum and vegi egg rolls, sweet and sour chicken, mongolian beef and pork lo mein.  Probably the best Chinesse food weve ever had.  The waiter's were amazing and helpful, not once did any of us have to ask them for anything, They just knew.......\n\nThe location is kinda run down and old, but then again in this place what isn't old and run down.", "author": "R L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-17", "description": "So disappointing. Recommended by the concierge at our hotel, a big disappointment for the single Chinese meal we had time for while in the Bay Area. Food seemed laden with MSG, unimaginative, slimy, touristy shlock. Not a single Asian in the entire dining room, stuffed with obvious tourists . Do yourself a favor and skip.", "author": "Mary W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-20", "description": "Ordered the veg. eggrolls and DimSum trio to start...they were so,so. Then came they Sweet & Sour Chicken, Mongolian Beef and the Pork LoMein. The chicken and the noodles were the table favorites. Service was outstanding.  Atmosphere was bland/cold.  Not intimate or romantic but a good place to stop before a night out with friends.", "author": "Incog N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-20", "description": "Simply terrible. I had pork egg rolls and beef chow fun with satay sauce. Bland and unappetizing.", "author": "Leslie U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "Amazing! Tried several times to ass a more detailed review however YELP kept telling me I was too wordy tonight.....that's new. Hopefully this will get posted and this wonderful gem gets another well deserved 5 stars. Thank you to the very gracious staff who were so accommodating regarding my shellfish allergy. Best Valentine's Day dinner.", "author": "Laura H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-20", "description": "After walking around Chinatown, my friend and I chose this place for our group, for reasons that I'm not entirely clear on. Maybe it was because I recognized the name from Rachael Ray's $40 A Day...or maybe it was because it was closest to where everyone else was going to meet us.\n\nWe arrived at 11AM, just as they opened on Sunday. No cute little carts peddling mysterious little steamers. We were given menus and ordered a fixed number of dim sum courses for about $11.\n\nThe food wasn't bad. It wasn't the best dim sum, but it really wasn't all that bad.  Their crispy taro thinger (I have no idea what the official name of it is) was really good...but as I told everyone at the table, I can eat dozens of those gut bombs and be happy wherever I am.\n\nNext time, though, I will head a block over and try one of the other places.", "author": "Tracy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-25", "description": "3.5 stars for the value and ability to handle large groups.\n\nThe hotel said that this was the spot for us...20 lads on a stag aka bachelor dinner before going out on the town. It was a good choice - lots of reasonable food for an accommodating $20 a head.\n\nIt's unusual to get such a selection of food on a tight budget, but the first course was peking duck in pancakes. I remember the shrimp and walnuts, the Mongolian beef, chili chicken, fried rice, sugar snap peas and chicken. The chef's even brought out some vege options for our single friend who didn't eat meat.\n\nThe only downer was the waiters were pushy on the booze. Not surprising because we all know that's where the money's made. Anyway, all in all the meal was $40 per person as some of us had cocktails and several og 'em ;)\n\nI wouldn't bring my parents here because they're from Hong Kong and used to run a restaurant...aka this is Westerner Chinese food. But I'd bring a date and some mates...", "author": "Stephen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "Wish there were 10 stars to give! While exploring Chinatown, we considered the many restaurants, but something drew us to The Oriental Pearl and when we saw Rachael Ray had visited, we knew we wouldn't be disappointed! The restaurant was clean and welcoming. The staff was friendly and accommodating.  The food was incredible! I strongly suggest the vegetable egg rolls and General's chicken...far beyond any Chinese I have ever had!", "author": "Mary S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-31", "description": "This place was pretty darn good.  I was surprised at the prices though.  I wouldn't necessarily go back.  There are tons of choices in Chinatown, I was surprised the food wasn't better.  I have no complaints about the food itself.  I just don't feel it was worth the price.", "author": "Theresa K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-08", "description": "The food was good (especially the Peking Duck which I loved) but way too slow.  The dishes came out randomly over a long period of time and by the time the last one came out, so much time had elapsed that we had nearly forgotten it.  I would still return since the duck was so tasty, but speed and service will have to improve for this to become a favorite.", "author": "Travis H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-29", "description": "As I do every holiday season, I'm out in the Bay Area for a week visiting my family. As is typical with my family, we've hunted for and sampled half a dozen new Chinese restaurants in the area this week. Oriental Pearl was one of the most disappointing. \n\nThe non-dim sum dishes weren't all bad: I'd recommend the Mongolian beef and the jie-lan vegetables stir-fried with garlic and anchovies. The dim sum left a LOT to be desired. I feel like it's pretty hard to mess up shu-mai, and these guys managed to do it. I was also not impressed by the turnip cake or chang-fen.\n\nThe one dish that Rachel Ray raved about - chicken meat balls wrapped in egg whites - was fine, but nothing to write home about if you ask me. \n\nAll in all, the food was ok - but why make this stop when there are dozens of amazing authentic Chinese restaurants just down the street?", "author": "Yuting L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-02", "description": "Yum!  Chinese food can be so predictable but this was a wonderful surprise. Everything was so tasty. The staff was relaxed and attentive.  We had the Como B but I would love to try a broader selection of the dim sums. The decor is bright and pleasant;,not especially fancy. Just a little pricey or would have been 5 stars.  Will probably be back when in the area.", "author": "Duane H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-29", "description": "Came here for dinner on a Saturday night, the place was packed but the staff was prompt, polite and offered great service. The food was great, some of the best I've had. The fried lobster was amazing!!! It was clear from the portions and quality of meat, that they were not cutting corners. \n\nThey have been highly reviewed by Rachel Ray, Zagat and others--- I can see why! Will definitely come back and I recommend you do too!", "author": "S S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-13", "description": "After dining many times here and only reviewing their dim sum I felt like I really needed to review dinner.\n\nMy personal favorites are the. Salt and Pepper Crab, bok choy, snow pea leaves, honey walnut prawns and the Peking duck. You can't go wrong with these items. \n\nDon't be turned off by all the white people in the restaurant, it's because Rachel Ray reviewed the restaurant and has turned it into a tourist destination. \n\nThe wait for a table can get rather long so book a reservation in advance. Carolyn, the reservationist, is a sweetie and very accommodating.", "author": "Roger H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-05", "description": "This restaurant was recommended to us by our hotel with the explanation that it was Rachael Ray's favorite. Ok, we'll give it a shot. The service was very good. Our waiter answered all of our questions on the menu, which is the most Chinese I've seen. I've never been to a place with sea cucumber and shark fin soup so I had a lot of questions.\n\nWe started with the jellyfish which was AWESOME definitely worth going out on a limb to try. They didn't have it as a a-la-carte option and instead came with a lot of other seafood, no good since my bf isn't a fan of fish. But the waiter gave it to us alone and at a deep discount, which was very nice of him. He also helped me handcraft a special dish of scallops and mixed vegetables (I love veggies and I hate having to chose only one with most Chinese food). The scallops were incredibly tender and flavorful, and the veggies were great too. This was one of the best Chinese dishes I've ever had. My boyfriend got the fried rice, it was pretty standard, but it was fried rice after all.\n\nIt was a little disappointing that at a place this nice and expensive that they didn't offer free soda refills, that's my only complaint. Great service, great food.", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-02", "description": "Amazing place! I had the best general tso's chicken ever. Highly recommend.", "author": "Parker T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-20", "description": "Multiple AAA placards. A gleaming \"this-must-be-windex'ed-everyday\" framed photo of Rachel Ray's dining recommendation. A dining room full of... well... white people. *insert cricket noise*\n\nOff the bat, I knew my \"let's stroll down into Chinatown to find a place to eat\" would blow up in my face. As a general rule of thumb - one that holds true for most places - if there aren't Chinese people in the Chinese restaurant, it's probably going to be a bust. And sadly, that's what I thought about my meal. \n\nThoughts?\nThe minced beef with egg soup was flavorless.\nThe salt and spicy pork spareribs were mushy and needed to be fried a bit longer. \nThe steamed fresh fish with ginger, scallions and sweet soy sauce was admittedly delicious.\n\nOk, so it wasn't a complete bust. The fish was very good and we inhaled it in minutes.\n\nWhile I leave it at 2-stars, the place is clean, decently sized, reasonably priced and has an ambiance suitable for an evening out if stuck (by choice or accident) in Chinatown. Not the best authentic Chinese food in the City but definitely not the worst.", "author": "Jonny Bobby G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-17", "description": "Came on lunch break for dim sum. Portion was very small and probably the longest wait for dim sum ever. After 20 min still no food.", "author": "Jen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "If you are looking for a Chinese restaurant with good food, good service and a nicer ambience than the usual Chinese restaurant, I would recommend checking out Oriental Pearl.   Dinner is served on a real white table cloth, so you know right away you aren't at your usual chinese restaurant.  Interior wasn't necessarily chic, but it was nice and way better than the typical chinese restaurant where you better be there for the food only.  The food was excellent (tried seafood combination in potato bird's nest, along with shrimp and walnut dish).   Service was excellent (they were there when you needed them but didn't feel like they were constantly hovering around).", "author": "Matthew J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-24", "description": "On a recent trip to SF (my first), I opted to stop at the Oyster Pearl on Rachel Ray's recommendation while walking through Chinatown down Grant Street. Very pleasant atmosphere, and exceptionally gracous service. The first three dishes I had were much yumminess--the taro dumplings and house special meatball, in particlar. I should probably have left well enough alone at this point as these certainly took the edge off my hunger pangs. However, I had one last snack (like the guy in Python's Meaning of Life) that I regret. It was a fried shrimp cake and eggplant appetizer. The shrimp cake was good, but the eggplant was greasy-oily and nasty. I'm embarassed to admit I ate it anyway. I was deathly sick that night, all night long. Can't say it was that damned eggplant, but I feel strongly that it was. I wouldn't avoid eating there again, and I would recommend the Oriental Pearl to you, dear reader, with the single caveat that you might want to avoid the fried dishes, or the fried eggplant at a minimum.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-30", "description": "We went here on Christmas night and they were \"Reservations Only- booked all night\".  Well we didn't have reservations, but they sat us anyways (how nice! thanks for not turning us away!!)  \nWe had the hot tea (so good!)\nStarted:\nHouse Special Chicken Meatball-yum! (featured on the Food Network)\n\nMain:\nMongolian Beef\nKung Bow Chicken\nEgg Fried Rice.\nMy husband LOVED it all!  I think I would have been happier with the Chicken Chow Mein (one of my all-time favorites)\n\nThey were EXTREMELY busy (Christmas) and so the service was a bit slow, but I would definitely return again!", "author": "Lindsey B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-25", "description": "Fast and courteous service. Pot stickers are plentiful; Mongolian beef was tender, slightly warm but good;hubby described the kung pao a little hot, with good flavor.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-24", "description": "So, far my favorite  Chinese restaurant. The service is always great and the food is always on par. The dim sum is good and so is the Mongolian beef and everything everyone had seem to enjoy it. \n\nIt's kinda hidden being that you have to walk upstairs but it's worth looking for.", "author": "Eric R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-08", "description": "Went here for dinner last night based on reviews we saw online.  The food was very good.  We got the corn soup, peking duck (which was excellent!), whole fish ( super fresh), fried rice (very light) and chinese broccoli.  The meal was very tasty and authentic.  My kids devoured everything.  I would definitely recommend!", "author": "Ellen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-26", "description": "I'm surprised this place doesn't have more reviews based on all the accolades that post both on the outside of the restaurant and on the restaurant walls.  The food is great, probably some of the best dim sum/Chinese I've had in the city. We had the famous meatballs which were so flavorful and delicate. The casing for them was egg whites...you don't normally see that, but it turned out really well. I ordered the shrimp and chive dumplings and the chicken and cilantro dumplings. They were so good and better than dim sum at the popular Yank Sing. We also had the fried rice and Mongolian beef.  The fried rice seemed surprisingly healthy with hardly any oil. The atmosphere here isn't particularly welcoming, but its about as good as it gets in China town. The servers were all really friendly, but service was really slow. It took us about 2 hours to order and finish our lunch. So if your looking for good dim sum but want to stray from the usual touristy places, this is a great option in the heart of China Town.", "author": "Hayley H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-12", "description": "Decent chinese; about what you'd expect to find in touristy Chinatown. The mongolian beef was great; sweet & sour chicken was so-so; vegetable chow mein was really good; general tso's was decent. Good prices for what it is. \n\nYou order dim sum from a menu, which is disappointing, but the quality of the food is good.\n\nIt's a safe bet. Nothing special or brag worthy, but you won't be disappointed. Feels clean and safe, which is a plus.", "author": "Aubrey C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-10", "description": "This restaurant doesn't look like a 3 star restaurant on the outside.  (you walk up a flight of stairs) All the staff were in collared shirts and their was a small fish tank for the kids! The food was good.  The kids liked the sweet and sour chicken. They are located in the heart of china town, right by all the shops, so it's a good place for an evening on the town. The food was a little pricey and not very memorable. Also I didn't see any locals!!! Everybody in the restaurant was a tourist. Overall I am very confident there are better places in Chinatown.", "author": "Pat M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-20", "description": "We arrived in San Fran and had an itch to get over to China Town and have lunch.  We enjoyed the dim sum and a good cold beer.  The service was quick even though they missed one dim sum order (out of 3).  They were quick to correct the problem and we all enjoyed the meal.\n\nWe do not travel to San Fran often but next time, we will probably try another restaurant because we like to try variety.  If this is your first time and have no idea, I DO recommend giving it a try.", "author": "Chris J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-18", "description": "We went off the Zagat rating for this place. The restaurant has no ambiance, it was hot and stagnant, the waiters hurry you in and out, and the food was just okay. What a disappointment!", "author": "Linda C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-21", "description": "Slim selection of vegetarian options had me weary. The food arriving didn't help things any: soft tofu in some o.k. sauce and chow mein with veggies that taste straight out of the can... I'd have been disapointed if I paid $5 for each of those lousy dishes but they were more like $10 a peice. \n\nI wound up here because the guy at the bonsai shop suggested it ... dont listen to him!", "author": "jizzie b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-05", "description": "It's very average.  We went with a group of 6 and tried a little bit of everything.  It was all just very average, and pricey.  The wait staff was decent, and the atmosphere was okay.  Just wasn't that impressive. I'm also not a big fan of Chinatown, so maybe I'm a little biased.  See my review of Shan Dong in Oakland for a good Chinese food recommendation.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-26", "description": "The food was great.\n\nWe had a party of 6--including 2 children. We received help with ordering from the hostess. While she may seem a bit curt, her advise was helpful and made the dinner more enjoyable. Would definitely listen to her advice again. \n\nSince they have no children's menu, the hostess' advice was to order a full serving and have the children share (lemon chicken dish with sauce on the side which they loved).  Food is served family style so we ordered several dishes. This also let my son, who can be a picky eater, try everyone else's dishes as well. \n\nThe tofu and green beans were phenominal. I have never had tofu cooked so well. \n\nNow, to find a place for tofu and green beans on the East Coast . . .", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-04", "description": "My family and I visited the Oriental Pearl on Tue 7/31/12 for the sole purpose of having Peking Duck in pancakes (so many of the other restaurants offer the buns which isn't traditional Peking Duck in my opinion).  It was crispy and not greasy as some of the other reviews stated.  Very tasty and exceeded our expectations.  We also had the appetizer platter.  Afterwards, we each ordered additional dishes of chicken, seafood and vegetables which were happily shared and enjoyed.  Would definitely come here again on our next visit to San Francisco.", "author": "Mark L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-25", "description": "I saw it at Food TV and wanted to try  chicken meat balls wrapped in Egg whites ! Dream food for low carb/yet yummy food lover. They are listed as appetizers and excellent. Very skillfully prepared and hold together.\n\nBut I made a even better discovery. FISH MAW SOUP. Try FISH MAW SOUP. Order the large size good for 4 people.", "author": "Matt Mao Tun B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-03", "description": "Overheard a concierge at a nice hotel telling a couple to check this place out, so thought it was worth a go. Really clean-white tablecloths-with good food, get the chow mein. Totally reminded me of the Chinese place I use to go to when I was a kid-pink napkins, tea in those metal pots. Good option in Chinatown.", "author": "J E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-27", "description": "I went to this restaurant a few months ago (my review is rather delayed) when I was visiting San Francicso. The wait took forever to get a seat, but the food was delicious. I didn't realize that the place had media exposure in the past. The service, not so great but I think the food compensated for it. This is what I call authentic Chinese food. :)", "author": "Angie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-16", "description": "We got dim sum, and it was great. The meal came with dim sum, egg rolls, rice, and a dessert. All of the food was excellent, and the waitress was very attentive and helpful.", "author": "Sammy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-05", "description": "Tasty place, fast service, but not the best in Chinatown I've had so far. With so many options, I'm not sure I'll be back.", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-28", "description": "Went to San Francisco for vacation and wanted to eat in China Town. The food was horrible,  extremely overprice and the service wasn't any better. Will never come back and of course would not recommend it  to anybody. Go spend your money somewhere else.", "author": "Araceli S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-06", "description": "We do enjoy this restaurant.  It's clean.  That's sometimes hard to find in Chinatown.  The food was tasty and good.  We had the mini eggrollls, wonton soup and shared the house fried rice and the chicken chow mein.", "author": "D C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-01", "description": "Rachel Ray was paid off!   First, the \"recommendation\" is almost 3 years-old, so at the time the food might have been tasty.  But I thought the service was slow and the dim sum wasn't much to write home about - not to mention worthy of being part of a Food Network show.   \n\nTONS of tourists - which is to be expected, bu if I had to hear one more person say \"Rachel Ray says this is the best place for dim sum\" I would have drowned myself in the fish tank.\n\nIt's not HORRIBLE, but it's not GREAT either - way better dim sum to be had around the city.", "author": "Steven J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-08-08", "description": "Don't go.  I just remember going here and being disastified with my lunch, which was cheap but still not worth the money.  The waiter had BO and the eating area was not very nice.  And my Chinese colleague just went for dinner recently and reports that it was expensive and not good at all.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-03", "description": "So this is the famed Rachael Ray $40 a Day restaurant? What's so good about it? It's so Americanized that when I went in, there were only White folks eating (no offense!). I think Rachael Ray only spent around $10 here for her meal. $10 (after tip/tax/whatever) can only get you maybe two or three dishes. The food itself was below mediocre - a lot of the dumplings were ripped despite having thick skin. At least the restaurant is clean - in a hospital-ish way.\n\nI recommend you go elsewhere for dim sum in Chinatown where $10 can really fill you up.", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-27", "description": "My husband and I were there when we were up in the city.  We really enjoyed their food and great service.  My husband and I were there half an hour before it got really busy.\n\nLoved their Honey Glazed Walnut Prawns with steamed rice and the pan fried noodle Chow Mein.\n\nI would recommend this place if you happen to be up in the city.", "author": "Cynthia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-31", "description": "Great food. The four of us split the shrimp fried rice (lots of shrimp), half peking duck, honey glazed prawn (really good), and ginger beef and a bottle of wine and the bill was around 100. Great sit down affordable Chinese place in Chinatown.", "author": "G S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "Great service and we found the food fresh and tasty. Lot of options on the menu at reasonable prices. Clean with cute interrior. Definitely recommend. Enjoy.", "author": "Greg H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-13", "description": "Impressive Chinatown Team Dinner!\n\nMy sales team was in town, and I wanted to host a dinner that would provide for an authentic San Francisco experience for locals as well as those traveling from outside of the City.  Having dined at the Pearl on several prior occasions, I thought that this may be the perfect choice.  \n\nTurned out that indeed it was.  I contacted Rebecca, banquets manager, and she pulled together a family style menu that was awesome . . . and budget friendly.  The menu included:  Pot Stickers, Peking Duck w/ Pan Cakes, Hot & Sour Soup, Prawns with Honey Glazed Walnut, Chicken with Sugar Peas in Black Bean Sauce, Spicy Mongolian Beef, Pork with Chinese Broccoli, Oriental Pearl Fried Rice, Dessert -Sesame Ball.  We also ordered bottles of Sauvignon Blanc and Cabernet Sauvignon for each of the 10-top tables.  There were approximately 40 of us, and we were seated in the Pearl's banquet room downstairs.  This was an excellent space for a team of our size.\n\nThe food was amazing; the service was genuine and attentive.  I will certainly consider the Pearl for future team dinners.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-23", "description": "When people come to visit SF, they often want to eat in Chinatown.  I usually scoff at this, but go anyway.  Frankly, the restaurants usually aren't BAD in Chinatown, but they're not GREAT like a lot of the Thai, Mexican, and sushi joints that I know about around town.\n\nSo the concierge at the Hilton sent my uncle and I to the Oriental Pearl.\n\nYou are welcomed with an ugly sign, a torn carpet, and a two flights of stairs up to the second floor.  I actually found this to be a good sign; maybe it was a hidden gem.\n\nThe restaurant was pretty ugly inside but the waiters were nice.  The food was greasy [as expected], but actually it was very good.  We had Singapore noodles and Mongolian beef.\n\nI wouldn't make a special trip here, but it's a great place if you're nearby.  3+ stars.", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-26", "description": "Oriental Pearl was recommended by the Fairmont concierge. We walked down the hill (remember - what goes down must go up) but it is very close to the hotels and a short walk, albeit steep walk, back to the hotel. I can not say it is authentic Chinese cuisine (of course this depends on everyone's palette) but we ordered a number of dishes and they were wonderful. The Kung Pao Chicken was my fav. I always order Kung Pao Chicken at Chinese restaurants. Some do it well and some do not. It is my test. Oriental Pearl hit the target! We did not order off the dim sum menu and after reading the previous comments, I wish we had. We were greeted immediately and seated at a table even without reservations. White linen tablecloths. Amazing service! Our waitperson was delightful. Our food came out quickly - nice and hot. The restaurant is super-clean. I think this is a popular place because by 8 pm the dining room was full of a mixture of families, large groups and couples. We will return because there are many things on the menu that will need to be tried on a future visit.", "author": "Jillian R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-30", "description": "I had been wanting to try this place since seeing it in Rachel Rays\n40 dollars a day book. Well she was there 3 years ago and all she had \nwas a special chicken meatball.\nThey have a poster with her fat  I mean cherub face on the entrance.\nSo misleading  to all the tourist and everyone else that  decides to eat here.\nThe food is just not good and very expensive for the low qualtiy .\nEven the Rachel Ray meatball is like 8;00 dollars for one piece.\nThere were four of us so we tried many dishes .\nEverything tasted like the kind of food you would get in a food court at the\n mall ( Panda Express ).\nWe tried 2 calamari dishes that were horrible.\nIt was like eating cut up rubber balls  covered with sauce.\nThe restaurant was mostly empty at dinner.\n I wish we had eaten at the ( House ) on Grant St in North Beach.\nNow that's a place Rachel Ray should try........", "author": "Bill H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-09", "description": "I've eaten here a few times for dim sum, and it seems like the portions get smaller every time I eat here.  The same could be said for the quality.  I remember it being a lot better the first time I came here for dim sum.  The service is pretty good though.", "author": "Karen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "Came here with my parents for lunch. We had clay pot with tofu and seafood, green beans with tofu, and my parents ordered a chicken dish.  All the food was delightful that I tasted (I tried everything but the chicken dish, but my parents seemed pleased). Total was $54 plus tip. Server was attentive and checked back on the table many times. Ambiance is underwhelming , but true to Chinese restaurants I've been to in Hong Kong.  It gives of that feel of a cheap, cheesy hotel- with the added bonus of live fish in a tank near the back of the restaurant.", "author": "Sam F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-04", "description": "Nothing special here. Was disappointed with the basic ha gau and siu mai. Service was attentive for an Asian restaurant though. Better tasting dim sum at the take away stores up the road (for a whole lot less!)", "author": "Michael T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-21", "description": "I thought this place was awesome. After being sorely disappointed with many chinese restaurants near our neighborhood, we were happily surprised with how good the food was here. The service was great too. \n\nWe ordered eggplant, the chicken potato nest (awesome!), spicy salted pork chops (my boyfriend was sooo pleased with these). We were happy with it all!", "author": "Mia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-19", "description": "Best Chinese food!!!! Highly recommend the sweet & sour chicken, Mongolian beef, pot stickers, honey walnut shrimp!! Can't forget about the sesame balls perfection!", "author": "Tatiana T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "Best Chinese food we ever had!  Loved the Sweet and spicy shrimp and seafood fried rice.  It was so good!  I wish they had a location close to us.", "author": "Scott A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-05", "description": "While living in SF, I never made my way to Chinatown.  So when my parents came up for graduation, I didn't know where to take them.  My mom, being asian and all, had her heart set on excellent chinese food.  Yelp wasn't being totally helpful, because anything that got more than two stars was not a \"sit-down\" type of resto.  \n\nSo I decided to trek around Chinatown with family in tow, and I don't know, \"stumble upon\" a resto that had a ton of people inside, because those are usually pretty good.\n\nSo that's exactly what I did.  People were filed down the stairs and almost out the door, but I was determined to get me and my parents fed.  We were lucky and got seated WITHOUT a reservation, but I think that's just because our party was so small.  \n\nThe food was just good.  I didn't get that gross, heavy feeling I often get after eating chinese food.  The seafood was fresh, not chewy like at some places.  and while nothing really, really stood out, i guess the place gets four stars because of the cleanliness and good service.\n\nthe bathroom was pristine, and smelled good.  sure, it wasn't fancy, but it was super, super, clean.", "author": "Angela H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-18", "description": "If you're into overpriced fancy Chinese food, this place might be worth a try.  Otherwise, there are plenty of authentic places around the corner.  Try their house special chicken meatball that looks like a dumpling.  Their beef tendon noodle soup is clear and tasty, but it lacks the depth of the 5 spice powder pack.  Moreover, the peking duck's skin isn't crispy.  Therefore, I'd pick another place no matter how long it took the chef to carve a duck out of a piece of carrot for them to display as decoration for the plate.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-22", "description": "Food is over priced. The Peking Duck was cooked well, but something about it tasted off, overall not too impressed by this place.", "author": "Ronny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-24", "description": "The only time that, I went to Oriental Pearl Restaurant was just for lunch in the weekday the only item that, I tried was the beef fried rice. Another good chinese restaurant for tourist to go to.", "author": "William B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-23", "description": "We ended up eating here for dinner and were pleasantly surprised. Everyone was really nice. The only thing is that they rushed us to order because the kitchen was closing. We ordered salt fish, char siu bao, chow mein, beef broccoli, and sweet and sour chicken. The kids loved it all. I had done an internet search for places with good dim sum and this place didn't pop up, but the char siu bao was delicious. We tried to order more, but the kitchen was already closed. I would definitely recommend.", "author": "May P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-04", "description": "YUM YUM YUM..this place has become a family tradition for us to go to (and please notice that my family is in Ecuador and in Chicago)..Their vegetable fried rice is AWESOME, their dumplings are amazing, their shrimp balls melt in your mouth, and their entrees are so well prepared that my mouth is watering right now.. \nWe need a good place like this one closer to where I live, I would go there every Sunday. \nTheir service is friendly and very graceful. \n\nOh! Until we meet again, Oriental Pearl.", "author": "Mimosa O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-27", "description": "We discovered this unpretentiously spectacular place several years ago -- B.Y. -- and I've been meaning to write a review, but I'm ADD and I keep forgetting. Eleven of us were there last night. The SALT AND PEPPER CRAB is the best I've ever had, including R & G's. Each person's taste is different, though, so I want to explain why: I don't know how they do it but the crab has almost no batter, so it's a true crab experience, just you and the crab -- exquisite.  I asked the waiter what was in season and he recommended the SNOW PEA LEAVES, another delicious choice. They are famous for their CHICKEN MEATBALL, wrapped in an egg-white pancake (how do that?!), and the fame is well deserved. The staff is unfailingly courteous and your teapot will always be full. Enjoy!", "author": "Susan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-29", "description": "Oriental Pearl Restaurant\n760-778 Clay Street\nSan Francisco, CA \n94108\n \nph# 415.433.1817\n----------------------------------------------------------------------------------------------------------------------------------------------------------------\n \nThe other day my bf and I went to China Town in search for the best Peking Duck in SF. We had heard good things about Oriental Pearl's Dim Sum  and so decided to give it a whirl....And it what a wonderful whirl it was!  I definitely think this is the best spot for Peking Duck and one whole order is plenty for two people.  The prices are very affordable and Rachel Ray's Show \"Cheap Eats\" even recommends it as one of the best spots for dim sum in SF for $40 a day.  (I am not a huge fan, but still........)\nThis is a excellent reccomendation as an alternative to R&G or House of Naan King.\nAlso, they have cuisine \"to go\" AND do Banquets and Parties.\nI loved it....Give it a try.", "author": "Michele K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-27", "description": "It's a little expensive, and yes, I feel like a tourist going here since everyone else eating there clearly is, but the food is always dependably decent. \n\nMaybe I have no sense of adventure, but I've had too many gross food experiences with low quality meat and greasy/syrupy/gooey sauces at other restaurants in Chinatown to risk going to too many other places in the neighborhood.  You won't have those problems at the Pearl.", "author": "Alyssa S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-22", "description": "Do NOT go for dinner.  I hear they have some great deals for lunch.  But, seriously.  This place is just not a dinner joint and I may even go far as to say it's a tourist trap.  Granted, I was with tourists at the time.\n\nThe place is somewhat fancy, but not so much you  need to dress up.  The wait service was pretty good.  Attentive.  However, I felt as though the servers were only suggesting the most expensive things on the menu, not what you actually wanted.  The bill ended up being about $25 per person without booze, but with dessert.  The food wasn't THAT great.\n\nReally.  You won't find be back here again if I can help it.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-12", "description": "I'm really surprised to see the bad reviews of Oriental Pearl.  I've been here 3 times now - once for dinner, twice for dim sum and thought it was pretty good both times.  When I went for dinner, I was with a big group so we went with pretty standard Chinese food items (e.g. fried rice, kung pao chicken, etc) that were decent.  \n\nI think the dim sum is really great though!  They have you order off a menu instead of the carts that go around, but as a result, everything is very hot when it arrives at your table.  I think they do an especially good job at the steamed plates like dumplings, pork buns, etc.  I also think the service here is really better than 95% of the Chinese restaurants I've been to, so maybe the reviewer before had an atypical experience.  Anyway, I'd highly recommend checking out Oriental Pearl for some dim sum!", "author": "l c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-20", "description": "i LOVE this restaurant. it doesn't have that necessary grime most china town restaurants have. VERY clean. staff is VERY friendly (none of that legendary chinese restaurant rudeness). \n\nthe food is EXCELLENT. the peking duck is my favorite so far. the walnut prawns are great too. i haven't had the opportunity to go for dim sum (i'm lazy when the sun's out), but i heard that's great too.\n\nnothing but good things about this place.\nwhy 4 stars? it took me a while to find the place. it's upstairs.", "author": "Meryl Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-05", "description": "Great restaurant for a nice family dinner in Chinatown. Atmosphere is nothing to write about but food and service were excellent! We took our server's recommendation and tried the Mongolian shrimp and general chicken- delicious. I'm not a fan of won ton soup, but it's my kids' favorite- it was really good here- delicate handmade wontons. I even enjoyed it. We will definitely come back next time in SF!", "author": "Heather B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-15", "description": "When looking for a place that has Dim Sum there are plenty to try in China Town but they are intimidating to tourists.  This place feels right to stop in if you haven't been to Dim Sum before.  The menu is pretty standard, the place is clean and the servers all speak English (at least the ones I interacted with).  These are key features of a Dim Sum place for any tourist.  It is up on a second floor from an inside stairwell.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-08", "description": "We had n't been here in a while ( couple of years), and went for lunch today.  I don't know what happened but the quality declined.  The shripm dumpling was mushy, terrible, and the salted calamari was oily and soggy.  We had several other things and in general ,just poor quality.  Will not return.", "author": "R N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-01", "description": "It was lunch time, when I dined at Oriental Pearl.  The location is a few blocks away from the office buildings of downtown, so the lunch crowd didn't seem to be as plentiful as some of the dim sum places in the alleyways of downtown.  This element, I did enjoy, because the dim sum carts made their way around to us frequently, and the dining room wasn't as noisy.  The food was ok, nothing spectacular.  I believe it may even be tamed down a bit to cater to the tourists, since it's location is closer to the tourist part of Chinatown.  The pricing is resonable.  There were seven of us at lunch, and I recall the tab being realatively good, considering how many of us there were.  I probably won't go out of my way to go back there, but it certainly wasn't anything bad either, it was ok.", "author": "Damon Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-09", "description": "Randomly discovered this place searching for new lunch places at work. I must say there will be a repeat visit.\n\nThe food tastes good and prices are even better (if you order the lunch specials - $6.50 per plate). The entrance is kinda hard to find though - it's off to the side from the main sign, a few places down and up some stairs.\n\nI'd suggest egg plant minced pork, kung bow chicken or the mongolian beef. Order a bunch of lunch specials and then share them (family style) with some friends, that way you get to taste everything.", "author": "Juiceman G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-13", "description": "This is a descent Chinese restaurant that affords you a bit of elbow room and a clean restroom. I enjoy their honey glazed prawns and walnuts, mu shu, and duck. It's not bad, it's not amazing...and it is upstairs. \n\nThough the did give my friend Ryan the best fortune EVER!\n\"He loves you as much as he can, but he can not love you very much\"...needles to say I almost wet myself.", "author": "Natalie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-02", "description": "Great dinners - fair on the \"dimsome\"\nPrice is right, but hey if it's good enough for Rachel Ray....", "author": "The Man M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-10", "description": "My husband and I ate dinner here on the recommendation from both a co-worker and our hotel concierge.  Boy, we are glad we took them up on their recommendation because we were not disappointed!\n\nThe attentiveness of the wait staff was superb!  We never had an empty tea pot!  We had the veggie egg rolls for an appetizer...delish!  I had the Kung Pao Chicken and my husband had the General Tso's Chicken for the meal.  Both were absolutely terrific!  \n\nIf we ever get back to San Francisco, I don't think I'd eat at any other restaurant in Chinatown.", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-05", "description": "The 1st time I went here for dim sum, my friend and I were shocked that we had to share a table. We were shocked more when the 6 other people at the table were also sharing the table. The dim sum here is alright and the service is very bad. When all of the parties had left our table, the host wanted to seat a 6 party family and they declined right in front of us. It was kind of embarrassing so we kind of rushed to get out of the restaurant. The 2nd time I went here, their food was actually very good. The fried taro dumplings and mongolian beef over rice were both good. But too much onions in my beef dish and very few meat. But luckily, I did not have to share a table.", "author": "Danster L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-21", "description": "Oriental Pearl is another recommendation from my mom.  We met my parents for an early dinner; the biggest surprise was looking up about halfway through the meal and seeing the entire restaurant filled with non-Asians!  We heard several foreign languages being spoken, and assumed the restaurant must be on a list for tourists.  Anyhow, the service was excellent and the food was very good.  The novelty of the appetizer that comes in a faux paper wrap is only worth a first-time order, though, so keep this in mind as a treat for out-of-town visitors.", "author": "Sherri C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-15", "description": "This is a gem of a dim sum restaurant.  It's hidden away in an upstairs location.  The menu is very limited and everything is pretty much made to order.  It's just on the edge of Chinatown.  During the weekdays, it caters to office workers from the Financial District and some lucky tourists who stumble upon it.  You might have seen this on the older, San Francisco episode of Rachel Ray's \"$40 A Day\".  \n\nThe service is good and friendly.  It's a small dining room and there are no pushcarts.  It's quiet, so you can enjoy a nice lunch and conversation.  I've only been here for lunch.  The food is pretty consistent.  I like the salt & pepper calamari.  Because almost everything is freshly made, the traditional dishes, such as har gow and the shrimp filled rice rolls, are almost translucent and come out piping hot.  Portions are about right, but dishes are pricer than if you went further into Chinatown.  The quality here is much better.", "author": "CE Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-28", "description": "This restaurant was recommended to us by the Ritz Carlton and unfortunately my expectations were very high and the food was pretty good but nothing amazing.  Truthfully I would've given 3.5 stars for the food, however the service deserved one star.   This is a very authentic Chinese Restaurant and they have a huge menu.  We had reservations at 830 pm and were seated on time, however, the waiter didn't give us menus until 854pm--we were starving by this time.  We ordered a bunch of dishes to share among the 12 of us and the waiter said that he may make some orders half orders so that we can try a variety of entrees in case we were ordering too much food but that we could continue to add more to our order later on.  The portions are pretty small compared to most Chinese restaurants and everything came out at different times which was annoying but appreciated because I would rather things come out hot and fresh as opposed to sitting under a heat lamp.  My husband is a vegetarian and ordered a vegetarian noodle dish for his meal and I'm pretty sure the waiter forgot about it because all of the other food was coming out and I finally asked the waiter at 945 where the vegetarian dish was and it came out about 5 minutes later (he was watching everybody else eat for a half an hour).   We wanted to order a couple more dishes because we finished everything that was brought to our table and we were still under the impression that we had one more dish coming (we ordered 2 Mongolian beefs) and when we asked the waiter he said that we only ordered one and that the kitchen was closed. THE KITCHEN IS CLOSED?!  The waiter never mentioned that the kitchen was closing and we had no idea because we tried to order more food when they put an order of fried rice on our table that clearly, someone had just cooked.  We were told that we could not order any more food and they were sorry and would give us some dessert on the house.  They didn't offer us a choice of desserts, and instead brought out 3 martini glasses filled with lychee fruit, however, this group wasn't as fond of lychees.  They finally offered to take 20% off of our bill which was nice of them, but still didn't make up for the fact that half of our party was still hungry.  All in all it was ok, but  it wast the best experience during our short visit to San Fran.  Maybe it was an off night or something?", "author": "S K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-20", "description": "I went here last night with a party of 8 people.  4 of them had been there before, the other 4 had not.\n\nIn short, the experience was excellent.  We had a reservation, so we were seated immediately.  We ordered 5 of their meatballs, two orders of pot stickers, and wonton soup for the table as appetizers.  These were all quite excellent, and the waiter even served us.\n\nFor our entrees, we ordered Kung Pow Chicken, Prawns with Honey Glazed Walnuts, Chicken in House Sauce with Potato Nest, Scallops with Mushrooms, Mongolian Beef, and Singaporean Noodles.  They came out just about the same time, and I must say, they were all excellent.\n\nHowever, special notice must be given to the Prawns and Chicken w/ Potato Nest.  These dishes were both incredible (there was a slight fight in who would get to eat them last).  The honey-glazed walnuts were fantastic, and I don't usually love walnuts.\n\nFinally, the service was excellent.  Our water glasses were never empty, tea was refilled very shortly after putting the top up, and as I said, the waiter served us our appetizers and poured our soup.\n\nThis place is definitely not an authentic Chinese restaurant, but that doesn't mean that the food wasn't excellent.  And for my family, which is not the most adventurous, that can be a good thing.", "author": "Alex B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-11", "description": "It's okay. Not wonderful, not bad, just okay.\n\nMy biggest problem was actually the service.  They were SUPER slow and didn't have a full restaurant.  When our entree's finally showed up, they forget about the rice.  We finally asked and it showed up, but not before sitting there for awhile trying to get someone's attention.\n\nIf you need lunch and don't care about getting the absolute best, go for it.  It's affordable, clean and okay. If you're wanting an really unique experience, look for somewhere else.", "author": "Leah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-20", "description": "This place is not one I would have found without a recommendation.  I've never been a fan of duck but their mushu duck wrap is super.  Their chicken dumpling speciality is just as good.\n\nI'm not an expert in Chinese cuisine but I've come back here repeatedly because of the terrific experience I've had with both the customer service and cuisine.\n\nThey have been so accommodating to modify their dishes for my vegetarian guests.", "author": "Mic D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-27", "description": "The waiter recommended prawns with honeyed walnuts. He was spot on with that dish. It was a taste sensation.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-24", "description": "Delicious food, excellent service, a real \"pearl\" in Chinatown. We ate here with a party of seven. Outstanding entrees were the honey walnut shrimp, Mongolian beef,  the lemon chicken, and the chicken with sugar snap peas. The Peking duck - which just was not crisp enough - left something to be desired (thus the four star  rating). The server was prompt, our food was hot and delivered course by course at just the right time, and our drinks were also tasty. Great choice! Note: be careful walking here at night - a woman was punched in the face and robbed a block ahead of us as we walked back to our hotel. Her assailant was gone by the time we got to her, but it was scary and her nose was broken.", "author": "D G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-23", "description": "The concierge at the fancy hotel down the street recommended this as a good choice in Chinatown.  The only way I could recommend this place is if you prefer dining on a David Lynch set.  Really, people...WTF?  Waited forever for tasteless food made out of poor quality ingredients.  I am a firm believer that you can't find good Chinese food (non-dim sum) without going to the burbs.  Why would someone be so mean as to recommend this horrible horrible place?", "author": "Anthony Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-08", "description": "I really liked this place.  It was a good place in Chinatown to take our out of town guests for some good, reliable Chinese food.  The prices and service were really good as well.", "author": "Crystal Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-02", "description": "Went here when my mom came into town because the reviews were decent.  Definitely worthwhile - had to go up a flight of stairs to get there, but once in, the service was prompt and friendly, the food was delicious and quick, and the atmosphere was nice.  I wish there were windows in this place, but that is such a tiny, itty bitty thing, that I can't dock them at all for it.  Awesome.  Will be back.", "author": "Adam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "4.893 stars! Ate here for a friend's rehearsal dinner a few weeks ago.  We were down in the separate private banquet area... fit almost 60 people in there I think.  Initially it was a hassle to get everyone seated, so the food wasn't brought out for a long time, but when it did come out... it came out fast and furious and pretty freakin tasty.  We sat at big round tables and it was tight quarters, but it was cool b/c it was a set menu and  everything they brought out, they served us (like spooned it onto our plates), they tried to get us to finish everything before they took the plates away, etc.  It was really easy... all we had to do was sit there and new food would appear on our plates in front of us.  We ate a lot there.. lots of courses.. some kind of pork dumpling, some kind of peking duck, some crab, some soup (some kind of rice porridge?), some tofu/mushrooms, some type of beef (it was like short rib type), some nice fried rice, some prawn and walnuts, there was another  appetizer I'm forgetting and maybe another entree.  It was a lot of food and it kept coming out.  We also had some kind of lychee dessert, but by that time, everyone was full.  The food wasn't amazing.. but it was very good and the service of everything was just well done.  They did a very good job.", "author": "Easter E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-18", "description": "I suggest the set menu, good dim sum, excellent Hot & Sour soup, Chicken & almond is very good. Good service, family friendly,The food is presented nicely, well prepared, good tasty Cantonese & Americanized Chinese food.If you expect authentic Chinese other than a few  Cantonese dishes you need to look elsewhere", "author": "Rodney H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-17", "description": "The food is very fresh here! In addition, the service was great! I can't wait to try more things on the menu!", "author": "Kamilah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "This little place rocks the dim sum.  What they lack in atmosphere, they make up for in price and yummy food!  The dim sum is really good.  The \"house special chicken meatball\" is something I had never had-before, really tasty. They do a great Chinatown Lunch for 10.75 a person that gives you a good smaple of dimsum and chinese food.  This is a grest place to bring out of towners when you give them a little walking tour of Chinatown (-:\n\nThe service is quick and they need you to get in and out, so don't come with you lap top and plan on camping out.\n\nAnd go in even though Rachel Ray pushed it...it really is good!", "author": "Laura S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-13", "description": "Good food and large portions. Clean and quiet creates a good atmosphers for quiet dining. Kind of hard to find it because there is a sign past the entrance and you have to double back.  It's on the second floor.", "author": "Aura C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-14", "description": "We went for dinner and just ordered dim sum and appetizers. The host (who I think was also the owner) was very helpful & friendly. The food was outstanding. Everything was tasted fresh& took a little while (but not too long).  I've had Chinese food in China & this place is authentic. The entire waitstaff would come around refilling drinks. A very good experience, highly recommend it.", "author": "Laura P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-26", "description": "I work 1 block from Pearl Orient, and did not know it was a restaurant.  My friend who work as a concierge at a hotel took us to Pearl Orient last night and I  must say I was surprise!  The place is clean, the staff very attentive!!  The dishes we ordered were scrumptious!  My favorite is the  crab  it was mouth - watering!   Chicken sauteed with snap peas was delicious, the Peking Duck wrap was also wonderful!! Our plates were never empty!  furthermore, Charlie the manager entertained us!!  I highly recommend this place.", "author": "Evelyn M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-11", "description": "i truly don't know what the big deal is about this restaurant. well, i do i think. rachel ray gave it a good review and tour guides like AAA do as well. the staff explains the dishes to you as they bring ithem to your table which is good i guess, but clearly, this is a place for non-asians. \n\nthe place was filled only with tourists when we went on a saturday for lunch. they had their tour books out. not a single asian sitting at any of the 12 or so tables that had customers at them. we had the dim sum speacial. i could have gotten waaaaay better dim sum from any of the restaurants on clement st. for a of a lot less money. we paid about $35 for dim sum. oh well. we tried it. no need to go again.", "author": "BaniAndJai W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-26", "description": "Absolutely love this spot and have been back twice since moving to SF last month. Very fresh food. I was impressed at the details the waitress shared with us including which dishes have the freshest seasonal veggies (snow peas and sprouts most recently). The fried rice is excellent. The service is quite authentic, too. They bring out your dish and serve it up for you! I have heard this place was better before Rachel Ray made it a tourist destination (my boyfriend and his family dined here in the late 80s), but I enjoyed everything and will definitly return!", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-15", "description": "My husband and i spent 4 nights in San Francisco and this is the only restaurant we asked for a recommendation from our very nice hotel.  We wanted to eat at a restaurant in Chinatown.  We were very disappointed.  The Dim Sum (3 styles of dumplings) was luke warm and not flavorful at all. In fact it was quite tough.  We also ordered 2 entrees, neither anything to write home about.  Maybe we ordered the wrong things, but i would definitely not go back to this restaurant.  -", "author": "Yvonne D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-11", "description": "Since I have some Chiu Chow in my blood, I like to enjoy some of my daddy's peoples food. I come here when I want some real Chiu Chow food. I always start with the house special chicken meatball, a delicate bundle wrapped in a gossamer pancake. I also like the pei pa tofu, peppery tofu soup with shrimp, Chiu Chow braised duck, and spicy braised prawn.", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-12-29", "description": "I always see well-dressed white people going in here, and against my better judgement I decided to check it out.  It's definitely \"nicer\" and more sterile-looking than any restaurant I've been to in Chinatown, but the food was kinda bland.  It wasn't a bad experience or anything, just nothing special.", "author": "Rego S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-27", "description": "Rachel Ray lies!  My friends and I chanced on Oriental Pearl for dim sum one afternoon because of Rachel Ray's \"$40 a day\" show.  However, the dim sum was fairly disappointing and the chow fun was sloppy, gooey and salty.  One could just step into a smaller, less expensive dive elsewhere in SF Chinatown and find much better food.  I was particularly not fond of the beef rice rolls (\"chong fun\"), which were undercooked and under-seasoned.", "author": "Elaine Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-11", "description": "I went with my family on a weekend for lunch:\n\nAn absolute shame that this is in Chinatown. It has none of the familiarities of a dim sum restaurant. I don't mean to be a Chinese food snob, but if you go to a Chinese restaurant in SF's Chinatown, there are some base expectations you should meet. \n\nService is poor, prices are high. The recipes for dim sum dishes had clearly been abandoned. Particularly any noodle-based dish - it comes out too gelatinous and congeals together. \n\nIf you've been to a real dim sum restaurant, don't expect a similar experience if you go to Oriental Pearl.", "author": "K J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-20", "description": "By accident my wife and I found this restaurant.  It seemed cleaned.  But were we wrong.  We both suffered stomach aches and more.   I think it was the dim sum combination, which tasted funny.  This place is really nothing special and I question their cleanliness.  Avoid it at all cost.", "author": "homey j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-03", "description": "If you're in Chinatown this is a great, safe place for some good Chinese food. The friends I was with weren't fans of spicy food, so we kept it pretty basic with Beef with Broccoli, Chicken Chow Mein, and Honey Glazed Prawns. All were really good and there was plenty of leftovers for the next day.", "author": "Neil C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-29", "description": "Cold Sing Tao beer, crispy peeking duck wrapped in delicate pancakes bring me back to this place again and again. Prawns with honey glazed walnuts is a must try. Ginger beef and scallions are mighty tasty. They have the best pot stickers in the city. The dim sum off the menu is pretty decent. I would probably celebrate Thanksgiving dinner here if the dogs got to my turkey. I do think this place is better for dinner than lunch.", "author": "Fernand P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-02", "description": "I love this place. I have been their twice and both times got great food with exceptional service. Their lobster special I had the last time was amazing. There is an attention to detail here you will not find at a lot of Chinese places. The decor is not bad. It is trying to be more upscale than its many neighbors, but misses the mark a tad. A little more originality would be nice. But when I am in S.F. and want Chinese food, this is my go-to place.", "author": "D D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-30", "description": "Was recommended by our hotel concierge for dim sum. It was fantastic and have passed on the name several times!!", "author": "Nichole K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-18", "description": "The reviewer ranting about \"shark fin soup\" is gay... what does that have to do with the quality of the food here? Nothing. -- Anyhow, the food was good, the wait staff was helpful and explained the menu and made suggestions very well. The price was a bit high, but still the food was authentic. Be ready to drop about $30/person on dinner and drinks. -- Again, anyone b!tching about  \"shark fin soup\" should be permanently banned from ever again posting on yelp b/c that does not help others in reviewing the quality of the restaurant.", "author": "E S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-16", "description": "Great lunch special. Love the mongolian beef. For $6 you get tea, soup of the day, spring roll, salad, rice and an entre. If you're nice they'll even give you more soup.  The service is fantastic and you even get a real cloth napkin.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-14", "description": "I give them a 3.5 for having decent Chinese food amongst a sea of decent Chinese food. I'm sure there are better places in Chinatown, just gotta keep moving along to find them. I really enjoy their walnut prawns and their duck mushu. It's a little on the pricier side for dinner at least, but you know you'll never be let down in terms of quality or accommodations. They are very kind, with a simple, but pleasant atmosphere, and an attentive staff.", "author": "Shannon F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-03", "description": "The Dim Sum is excellent. There is defiantly better Chinese entres out there. The pearl did prepare them well. Everything was tender and succulent just not  award winning. I also want to applaud the service very nice and welcoming. I gave them 3 stars but still eat there for lunch every other week. Anyone every tried sharks fin soup? Tell me about it.", "author": "Sean J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-02", "description": "duck was good, glasses of wine were puny, mongolian beef had no flavor, was greasy and wholly unremarkable, scallop dish had anorexic almost unrecognizable scallops, not the big fluffy white ones you're accustomed to, with those items and three beers our check was 75 dollars. so not worth it!!! staff was very nice though.", "author": "lindaven p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-18", "description": "Although the staff here is very efficent, and their food is good, i just think that the prices are a little bit on the higher side but thats just me. I had the beef chow fun and my friend had the salted fish and chicken fried rice, and the food was pretty good. I'd have to say this is one of the better chinese restaurants in the SF chinatown area. The only reason I gave this place one star off was because of the prices, but thats only my opinion so yeah....", "author": "Kalvin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-20", "description": "I am really suprised at all of the bad reviews for Oriental Pearl. I've been quite a few times and I've never had a bad experience. I have always gone for dim sum and the food has always been good. Everything has always come out piping hot and it's always been tasty. The quality is good, the place is very clean and the service has always been better than at your typical Chinese restaurant. It may be a bit more expensive, but I definitely don't think it's pricey in the grand scheme of things. I'll continue to go to this place.", "author": "Anita B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-04", "description": "This is a solid establishment. Order the Honey Walnut Prawns (or something), and go for the Dim Sum.", "author": "Scott F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "In town for a conference and took the advice of a friend who recommended this restaurant. Terrific Peking duck! Excellent service by all staff. My friend and I walked around Chinatown for an hour or more, could not get a cab, returned to the restaurant and they called a cab for us! Very friendly and attentive!", "author": "Jann W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-14", "description": "great spot for reasonable priced chinese...made to order dim sum is good.  They also have some of the best kun pao chicken i've found anywhere in the city...just tell them to leave out the bell pepper and add extra dried chillis and green onion.", "author": "Raj D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-23", "description": "Sometimes, you can't miss the stress growing inside the waiters. I suspect the owners to be rather tough with the staff. If I'm right, I must unfortunately admit that it pays, the service was excellent.\n\nI had the menu A and based on what I had, there is one thing I don't understand. Why does Michelin recommend particularly this restaurant? I'm not saying that the food is bad but it's way below the Michelin standards I used to know. I haven't been impressed at all by what I got. I couldn't tell if the Dim Sum were homemade or Cosco-made (see the problem?). What is sure is that there are better places for Dim Sum around the bay (e.g. Hong Kong East Ocean Seafood Restaurant on a Sunday). Wan Tan soups are often blend. Here, it had the right seasoning. But, again, the wan tans tasted the industrially made. Anyway, the soup was still nice. The main course was adapted for Western people. It was a traditional lookalike Chinese food, sweet and fake. It wasn't bad. And I can't blame them for adapting their meals for locals. It's just that I know that better Chinese restaurants can be found in SF and this stupid Michelin thing made my expectations too high.\n\nOh, and a last thing, can Yelp ask bars and restaurants to stop using this sugary yellowish lemon flavor syrup for cocktails? It's disgustingly wrong! Instead, they can use Teisseire (dilution 7-fold).", "author": "LawAai V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-08", "description": "a friend wanted to go here cause Rachael ray suggested it.  i hardly call this place a Chinese restaurant.  it was way too clean to be a dim sum joint.  and where was the carts?  no dim sum carts here.  the food was okay.", "author": "Jo T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-15", "description": "The Concierge from our hotel made us a dinner reservation at The Oriental Pearl Restaurant and assured us it was where they send all their guests.  I explained to the Concierge that our child has allergies and he said that this restaurant was extremely accommodating.  We arrived five minutes early, were seated and immediately explained to the waiter (who understood English) about our daughter's eating allergies.  (We also presented a card in Chinese if there was a language problem)  He assured us that it was not a problem and told us what could be eaten.  We ordered appetizers, the waiter then came back and told us that he made a mistake and our daughter could not have the soup or chicken dish.  We reordered and he then came back and said our daughter could only eat the rice and vegetables as they marinate ALL of their fish, chicken, meat......in advance in a sauce that she cannot eat.  After 30 minutes we left the restaurant with our child in tears.  We have never been treated like this in any other restaurant before.  If in fact the restaurant could not accommodate us they should have told us that when we first entered the facility and we would have left and been grateful that they told us they could not accommodate us.  However for this \"game\" to go on for 30 minutes was absurd.  I find it difficult to believe that every single piece of protein in the entire restaurant was pre-marinated.  Any restaurant the \"pre-marinates\" all of their protein in the same marinade is certainly not tops notch and not a caliber that should be referred to others.  \nI do need to mention however that prior to this debacle, we ate at two different Chinese restaurants that we walked into off the street in China Town and they were very gracious.  They not only were able to but they prepared anything our daughter wanted with ingredients that she was able to eat and enjoy", "author": "Maria B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-17", "description": "We went in because it was one of the first ones we ran into... and the fact that they had Rachel Ray's photo and the Michelin Guide's review on it sealed the deal.  The food was pretty good and fairly priced.  It really caters to visitors as we were able to communicate effectively to the entire staff.  I usually like dim-sum restaurants where they come around in carts and you can point at what you want, but since it was pretty easy to order from the menu, the food came out straight from the steamer/oven piping hot and delicious, and may have changed the way I like to order my dim-sum.  Pretty good, although next time, I'd probably venture a little deeper into Chinatown to the spots where they don't speak English and yell at you in Chinese... those are supposed to be the best and most authentic ones. :)", "author": "Del N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-28", "description": "This is the restaurant I send most people to and always get the best feedback.  I love their prawns.  This Restaurant and R & G Lounge I think are the best in China Town.", "author": "Antony E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-12", "description": "If you don't know Chinatown well, are looking for a place to eat Chinese food and may be scared because you don't have a good recommendation from anyone, this place is a safe bet.   Food is decent, place is clean and the staff speaks english.   I was pleasantly surprised and given I had low expectations, it exceeded my expectations.", "author": "Val V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-27", "description": "I went back to Oriental Pearl for Chinese Newyear and a couple weeks after that.  The service was as friendly and attentitive as always and the food top notch.  The deep fried prawns with spicy sauce were greasless and crispy with a tongue tingling, lip biting sauce that was like a spicy sweet and sour sauce to be exact.  The Oriental Pearl fried rice is dry and firm with fresh shrimp, flavorful Chinese sausage, and meaty mushrooms which make for a wonderful plethora of flavors.  The rice noodles with duck and preserved vegetables are aldentae with slightly chewy but gflavorful duck meat and fresh vegetables.  The barbecued quail has a smooth, liqured exterior and moist interior.  AS far as more dim sum is concerned, the deep fried taro dumplings are a little greasy, but not by much with a meaty, thick, and starchy and salty taro and ground pork filling.  The deep-fried squid with spicy salt is crispy with ever the slightlest greasness and a one-two punch of a salt and pepper coating over the entire squid.  The pan-fried shrimp and chive dumplings are crispy on the bottom and gossamer omn the top with suculent whole shrimps and savery chives.  The day that I was there two weeks after the Newyear parade, one of the waitresses gave us a free order of tjheir flaky, buttery, smooth, rich egg custard tarts.  Oriental Pearl is definitely one of the few good remianing restaurants in Chinatown which will stand the test of time.  Once again, keep up the good work guys.!", "author": "Brian S."}
