{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "The day after I got engaged, my fiancé took me here for lunch.\nEverything was so good especially the cacao drink which became my favorite.\nI'm definitely coming back for more", "author": "Nichole F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "Of the 3 Nicaraguan restaurants in the Mission, this is the longest hike from the BART.  It also seems a tad pricier than the rest.  Food is pretty tasty, though I believe Las Tinajas Restaurant is my favorite in the neighborhood.\n\nEspecial María Elena: So much delicious food!  The charbroiled steak had nice sear marks and a little redness inside, so was just right.  The pork had a very pink marinade going on and was also charbroiled just right.  Neither strip of meat seemed overly spiced, but the pickled onion salsa on the side did a wonderful job of livening them up.  The rice & beans, sweet plantains and plantain chips were pretty standard and quite plentiful.  Not a huge fan of all the shredded cabbage, but that's more of a personal preference.  Loved the two chunks of fried cheese, definitely something I look forward to in Nicaraguan cuisine.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "Great food good service. It was my first time here and we had a large group which was easily accommodated. The cabbage hot stuff is awesome! We shared the beef and pork plate #27 and it was enough for us both and we are big eaters. \n\nAnother pair shared the beef plate #26 looked awesome and they ate most of it. Another person had pork plate couldn't finish and she was very happy.  Another had the chicken and she could not finish and left happy. \n\n\nReasonable prices great food, my only knock is it is kinda dirty looking and there were flys in restaurant. Will go again but probably take out. \n\nOh yeah try the tamarind juice it is awesome!!!!", "author": "Paul D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-14", "description": "Horrible service!!! They  got both orders incorrect and the food tasted far from the original Nicaraguan food.\n\nThe waiter looked like a gang member out of jail with no customer service skills. The food was more expensive then regular Mexican food with lower quality.!\n\nDon't make the same mistake I made. Don't go there.", "author": "San R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-27", "description": "Not a bad spot. They are pretty busy for a really small for a restaurant. They have a lot of customers so about 80% of the time your missing something or they didn't hear your complete order. A bit  frustrating especially when you wait 45 min to and 1 hr to get a table, then another 30 min for food. I would base the food off the pictures post here and not the menu, it comes out really different. Beside that enjoy the serves smile and the music played during dinner on weekends.", "author": "Miguel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Genuinely amazing place!!! My only complain is that their queso frito was not like the one in Nicaragua (this one's a little smaller). Other than that. Truly spectacular food! Best place for any Nicaraguan missing home! El filete estaba DIVINO!", "author": "A S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-13", "description": "Came in, seated, spent a gooood while b4 the menu was made available, then took another healthy break b4 the food showed up, being from Nicaragua I believe I know my food...", "author": "Rigoberto C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-28", "description": "I rarely write reviews but when I do, it must have been something that really bugged me or impressed me. In this case, I'm just surprised. First off, I'm giving them 2 stars because my dish was good. Their customer SERVICE sucks! Waitresses are rude and clearly do not enjoy their job just the paycheck. They would rather \"clean\" then serve their customers. Who ever the owner is, you should retrain them or hire friendlier people.\n\nMy mother ordered a soup and her fish tasted sour to her. Waitress took it back and said \"nothing is wrong with it\" and offered another dish. Ok, so she reordered. Maybe 15 mins after waiting for the second dish I stood up to ask about dessert and a box for my leftovers. Well she rudely assumed I was questioning about where was the food. It was just poor service!", "author": "Gloria E N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Very clean food, price are great, a lot of choices, this Nicaraguan restaurant is a good place where to have a good food time in family or by yourself.", "author": "Eduardo S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-14", "description": "My husband is Nicaraguan and likes this place for their Cacao (drink). I'm not a huge fan of Central American food but this place is so so. What is most important to know is that it takes at least an hour to get your food after you order it. We're going to look for better Nicaraguan food restaurants as this one is not worth the long wait. Only reason to come is to get a jug of cacao to go.", "author": "Liz R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-03", "description": "This isn't my cuisine. Dry meats and overall bleh. I did like the live music, but the venue is much too small for dancing. Additionally, if you're not Latino, you'll be really out of place.", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-14", "description": "Given that there are only three Nicaraguan restaurants in SF. This by far is the best one! It has a great atmosphere and the food is fantastic! They have some amazing variety. The portions are huge (except for the Baho, i few like they could totally improve there!) The traditional fruit drinks from Nicaragua are also great. The place is cash only, which is all right, but they could change that. I'd go back every time though.", "author": "Ed H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "Gallo Pinto was amazing, tostones amazing, everything super delicious. :) So glad I found this place!", "author": "M R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-21", "description": "Sad to say this place has gone downhill fast. \nMy husband ordered the cacao drink which was more water and powder more than anything. The calala was delicious and very authentic. I ordered the arroz avalenciana which was ok but lacked flavor and overly greasy. The salad thatvwas served with my plate looked like the lunch salad they would serve back whenni was in high school.  Disgusting. My husband ordered the 7 mares and it was more grease in it that soup, it was literally dark brown. The quality of food has completely downhill.", "author": "Yamilette C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-25", "description": "I was happy to find a nicaragüense food restaurant on a Sunday afternoon still open:)\nThe food was really good I'd give it a 5 star the services was ok I'm sure our waitress was tired seemed like she was doing everything on her own \nBut the 6 o'clock man who came in to sing made the experience unpleasant!\nI wanted to enjoy my meal with the juke box music they had previously but I ate my food very fast to just get out once he started singing!", "author": "Maria S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-02", "description": "Rude! My friends and I wanted to get tamales for people we were visiting to go. Every employee eye on us was cold and unwelcoming. By the looks on their face, the waitresses felt they were too good to serve us. When we got to the counter, the waitress told us, \" I don't THINK we have tamales.\" When we saw her just serve another customer that..\n\nAnd here's the worst part. I'm guessing this is the owner because he was an older man and had a suit on. He put his hands on my waist and shoulders to talk to me. I don't care how \"friendly\" you are trying to be, never touch a stranger, especially when we have shit service like that.\n\nSave your money and go somewhere else. No matter how young or old the person looks, never treat your customers with such disrespect.", "author": "Sami N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "I have been here several times with my family. The food is good and pretty traditional. The service needs some work, looks like there needs to be perhaps one more server during peak times. The wait can be someone long at times, but ultimately worth the wait. Gallo pinto is great and the pork is nice and tender. I love their vinegar spice onion mix they leave on the tables. It's nice to have a traditional Nicaraguan restaurant to visit.", "author": "MJ L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-30", "description": "Oh my God I'm so disappointed with this place I went for lunch with my daughter and to take food to my grandmother at the Jewish care living center in San Francisco and I bought sebada and one chicha and I had to return mine the chicha it was rancid then I took my grandmother the sebada mind you she's in an old folks home and weak . I got a call later that night they found her on the floor in the bathroom covered pink throw up . The took her to the emergency and now she swallowed some of that rancid throw up and had and infection . This place will seriously be hearing from our lawyer this is wrong they could have killed my grandmother the whole family from all parts of California having to drive to see what they think is their mothers on her death bed . She's still very sick ( reason I haven't contacted them or the lawyer yet is she still in the hospital . .They will be screwed when I get the paperwork that shows she ate nothing except for that sebada", "author": "Tanya H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-11", "description": "I must admit one thing before I begin my review... I am accustomed to the \" finer \" things in life.  Good food, good drink, fast cars, fast women... :)  all those things come naturally to me.  Being the first-born son of a scion of a well-known \" Somocista \" family will do that to you.  I have visited my lovely Nicaragua 9 times in my life and I have seen and experienced pretty much all there is to do in my lovely country, but the pleasures of the flesh ( specifically, the food, drink and female kind ;) are what keeps me coming back there for more every time before I have to hop on a plane and come back to the dreaded \" USA \".  \n     So what does a hoighty-toighty Nicaraguan expat do when he wants to eat a fine Nicaraguan meal when he is NOT at home, in Nicaragua?  He seeks out the finest place in his area to eat a fine Nicaraguan meal, and for the longest time I could safely say and surmise that the place to go in the San Francisco Bay Area for Nicaraguan food was Oye! Managua in the Bernal Heights district of San Francisco.  They had their stuff down COLD, I mean, the BEST Nicaraguan food you could possibly have within hundreds of miles of California's vast and varied terrain, I mean, you would have to go to, I guess, Los Angeles to get a meal better than the meal you would get at Oye! Managua.  Sadly to say, the past two times I have been there I have been SORELY disappointed with the quality of the food.  It has diminished considerably.\n     My Mother ( who was my Valentine's \" date \" this year ) and usually get the Maria Elena plate, which is the most colassal plate on the menu, consisting of the best Nicaraguan \" street food \", the kind you would get in the \" parillas \" and \" fritangas \" of Nicaragua, and on this plate you find:  gallo pinto ( Nicaragua's own concoction of mixed rice and red beans, VERY tasty ), fried Nicaraguan cheese, plantain chips ( plantain is a fruit like a banana ), ensalada ( salad ), carne asada ( grilled skirt steak ), chancho asado ( grilled pork ), and maduros ( ripe fried plantains ).  All of this is an ENORMOUS meal fit enough for 2 or 3 people and is a pleasure to behold and eat, and I took the liberty of taking pictures of the meal to show what it looks like.  Sadly, it didn't taste NEARLY as good as it looked.\n     It was HEAVILY doused in cooking oil all around!  I mean, greasy, oily, and nasty cooking oil taste all over, from the steak to the chips to the rice and beans, I mean, EVERYWHERE!  The steak was overcooked, fatty, and overseasoned.  The fried cheese was very good, as was the fried pork ( the highlight of the meal, you could taste the marinated lime, lemon, and other goodies used to marinate the pork in ) but the rest of the meal was SEVERELY lacking.  I would tack this to a bad experience but this happened the last time around too, so I believe they must have a new cook or something who does not know how to properly cook Nicaraguan street food!\n     I think I will have to book the first red-eye to Managua the next time I want to eat my beloved \" fritangas \" :(...", "author": "Gonzalo O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-01", "description": "Ordered the Maria Elena plate to share and both me and my friend woke up at 4am with food poisoning. Never again.", "author": "Santa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Filete a la plan ha con camarones-- grilled and seasoned to perfection. \nVery authentic Nicaragua restaurant at the end of Mission.", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-17", "description": "Avoid this place like the plague. Ever since they changed ownership this place has gone to hell in a basket. The food is ok but the service OMG, rude for days. The staff is so unprofessional and they close the Restaurant at any given time for any bogus reason. Never again!!", "author": "Tony S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "My girlfriend returned from Nicaragua a week ago and she was craving some of the cuisine so we checked this place out and it did not disappoint! Very simple ingredients but extremely tasty! Also, the portions are HUGE so they're definitely splitable between two people. I came in starving and left stuffed.\n\nWe had the Maria Elena plate. Highly recommended!\n\nAlso, I don't know why people say the service is bad...All of the wait staff were very attentive throughout.", "author": "Zachary M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-07", "description": "The food was great. Authentic food from Nicaragua  and the Toña  was the best.  The only thing when it was time to pay the girl said cash only, and said there was a sign outside the door saying cash only. I looked outside and no sign is at the door. I disliked that if it's a restaurant cards should be accepted. I saw other people with cards. Rip off. Only 3 star rating.", "author": "Mercy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-02", "description": "Food is OK, but the service makes this place worse. The ladies there always have a stank face, it never fails. Super rude. You're better off at Las Tinajas! No longer spending my money here, apparently it's not good enough. DO NOT COME HERE.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "A great sampling of Nicaraguan food. Not as good as my grandmother's but pretty close.", "author": "Cesar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "This is the spot for authentic Nicaraguan food everything is cooked fresh the atmosphere is beautiful authentic naca-tamales!! The VERY BEST", "author": "Lyn W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-07", "description": "Okay all you Latin lovers, brace yourselves. Now I'm always down with some Nicaraguan food, but this place is not the place to go if you're looking for good service. I attempted eye contact with the waiter. No luck. I waved my hand for the waitress. Still, no luck. I got up and did a little dance, and that definitely got some attention, but not by any of the waiters or waitresses. Aye yi yi!\n\nI ordered the pescado empanizado and it tasted as if it was frozen and then flash fried. So not the business. I left more than half of the fish on my plate. Whomp, whomp. BUT I got to give it to Oye Managua for pulling in the customers. This place looks like its got its regulars, so something is working well in that respect.", "author": "Flor K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-18", "description": "Oh by the way, my friend saw a rat running in the kitchen. I told her she needs to report this to the health dept. So nope....won't be going there ever again!", "author": "Iris M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "The food is good overall and they have really big dishes. The bandeja nicaraguense es gigante!", "author": "Jonatan A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-01", "description": "The food was good, but the service it's always horrible and if you ask for the receive the got mad at you, and wait another half and hour to someone  just give you same order they have from the kitchen... Not good place to spend your money when they treat you very bad... I used to like this place before, but lately it's not worth the drive from east bay ;-(", "author": "Vanessa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "Very good meal. Satisfying. What more can I say? It's pretty authentic. I'm happy with it the moment I walked in.", "author": "King L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-27", "description": "I still enjoyed my pork meal but I don't think I would  back. It doesn't feel like a restaurant because I think the owners or workers need notions of service, presentation and restraint service in general. Also, it felt awkward that the post says just cash and then the cashier accepts card, when I was about to pay, the other guy said no credit cards. Anyways, they accepted it. Something good: the food", "author": "Victorya Esmeralda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-12", "description": "I'm afraid I'm going to mangle the name of the dish I had. It's on their printed menu at their restaurant but not on their online menu. And it's totally delicious. Filete de pescado entomate (?) entomade (?) arrgh I give up! Fish steak in stewed tomatoes basically. So flavorful and the fish was so tender. Comes with rice and whole beans (choice of separate or mixed together), a small slab of fried cheese, and plantain chips (choice of that and something else that I couldn't hear - not a language barrier but it was Sunday and they had a live singer doing Latin pop, just a heads up - but the chips were good as well. The rice and beans (which I got mixed) were a bit on the salty side, but soaked up the broth from the fish dish nicely. Anyway, I was quite full and happy.\n\nI think a lot of their customers are regulars as the place was quite full and parties would come in and hug the staff or otherwise greet them more than a simple hi. With dishes like this, no wonder they have a lot of regulars. I need to become one.\n\nNo language barrier for English speakers (as long as the music isn't too loud, which would present a similar problem for me in any restaurant). If you need it quiet, probably go during the week.", "author": "Charles B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Your restaurant has great food but your staff especially ladies no manners not a hello goodbye come again thank you nothing. Not professional at all no manners  you need to hire people that will welcome you smile and have manners.This is why waitress didn't get a tip from us. Usually we're great tippers.", "author": "Patricia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "Los nacatamales más sabrosos de la bahía, also the best fritanga in town, my recommendation will be Maria Elena good for two if you have a humongous appetite. Again NACATAMALES !!!! Are yo die for", "author": "Z. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "Very good experience. We were headed towards \"El Buen Comer\" but when we saw the \"too polished\" appearance of the restaurant decided to go back and have dinner here.\n\nOrdered the Maria Elena's special and was full of meat and rice, I especially liked the fried cheese.\n\nService was pretty neutral, no fake smiles but no rudeness either. Prices reasonable.\n\nThe ambience was interesting, a guy \"on stage\" sang a lot of different Central and South American songs - cumbia, salsa, etc etc.", "author": "Xavier R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "There is not enough words for this place.  It's one of my favorite Nicaraguan spots in the Bay Area.  They give HUGE PORTIONS, the food is always fresh and the service is great.  It's a small restaurant, but they always do their best to accommodate you.  It's worth any wait!! Every plate I have had there is delicious!", "author": "Kristin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Best Nicaraguan restaurant in SF.\nGreat portions. Great ambiance.\nMusic, laughter, family friendly, and warm.\n\nEasy to get to via car or public transportation.\n\nAcross from Safeway on 30th and Mission.\n\nA few blocks from Mitchell's Ice Cream.\n\nNext to a laundromat.\n\nStreet parking.", "author": "Angela B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "I'd never eaten Nicaraguan food before, so coming in I didn't quite know what to expect, but this place was really good. We came for a late breakfast on a Tuesday and it wasn't very crowded.  We each ordered a plate with gallo pinto (so amazingly good), two eggs over easy (it comes with scrambled eggs), fried plantains and fried cheese. I really, really enjoyed everything on the plate. The gallo pinto was so flavorful and the egg yolks and salsa mixed in was to die for! Scrambled eggs wouldn't have had the same effect. The fried plantains were almost exactly how I like them: crispy on the outside and soft on the inside. My only complaint is I wish they were sliced thinner. Service was fine and they let us order breakfast even though we were 15 minutes after 12 (thanks Kaiser :-p).  I would come again in a heartbeat.", "author": "Steph L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Absolutely love this place! A must dine in place for me everytime I'm in the San Francisco area!  Definitely authentic as it gets!", "author": "Chris F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-21", "description": "Food is good!!! But waitress had a horrible mad FACE. You asked for something she gave you this look; like I mean It was my first time there I asked and she just said if I wasn't ready to let her know when I was ready to order. We asked for an extra side of chicken nuggets and she said she couldn't sell it to me unless it was a meal. So I said fine charge me as a meal but give me another order of chicken nuggets, she said if you don't want the fries even though you pay for the whole meal I can't give it to you! Like what???!! She need customer service skills", "author": "Daly R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "So, a friend convinced me to join her for lunch on a Saturday afternoon to eat here, of course, I had no expectation of anything good coming out of this place but quite frankly, I was taken by surprised. The service was good, and the food great. My friend got the beef soup, I had a nacatamal, a side of sweet fried plantains and a cacao.  When she brought out the plantains I only got three, I said, where's the rest of my order?  She went back to the kitchen an brought out 4 more.  I think it's a hit or miss type of place.  But the food was good. It seemed like the kitchen has changed for the better. Thank goodness!", "author": "Petra M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-12", "description": "01/12/2017 @ 5:57pm.   So I'm writing this minutes after I saw a mouse ran across the the restaurant. This is so disgusting. I couldn't even finish my food. The lady gave me a free beer for the inconvenience and said that she saw it too and that the next building over is fixing the pipes on their bulding which is why there was a mouse in here. THIS IS CRAZY! Never coming back. I loved this restaurant too. Smh.", "author": "Vanessa G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-05", "description": "I am Nicaraguan and used to love going to this restaurant and loved the food and service.I been going to this restaurant since it first opened and  own by the original owner ,which also is owned El Red balloon restaurant on 24th and Mission Street. Back then food was real Nicaraguan quality, the new owners food is not the same. The son of the new owners is a waiter and makes mistakes  on taking the orders, when your food arrives you get a totally different thing then what you order. When letting him know that the order was incorrect he started to argue with me saying that he took the order correctly and I was wrong. I guess he expected for me to keep the food that he brought out because it took him a while to take the plate. When grabbing the plate and about to walk away in a low tone voice he said\"YEAH WHATEVER\" !. Didn't even show any \"respect\" for the customer to say \"I'm sorry\" sir I will fix this for you and bring you the correct order. I will never in my life dine at this restaurant ever again. I have never received this type of \"BAD\" service anywhere as I did in this place.VERY RUDE!!!!.", "author": "Robert C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-23", "description": "Food so good that it made me fantasize about a trip to Nicaragua.\n\nWe opted for the Especial Maria Elena ($28) since the trio of ladies next to us seemed to know what they were doing. Come hungry since the platter is enormous and includes gallo pinto, rice, cerdo asado, carne asado, tajadas maduras (plantain varietal), fried cheese, and some kind of aspirational salad.\n\nThe cacao drink was cinnamon and vanilla and honestly was like the best choco milk. \n\nThe Tona beer was nothing special, but I think the point is how refreshing it is. Great summer brew!", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "probably the best Nicaraguan food in San Francisco. sadly there isn't much competition in this category, but that's not why Oye gets five stars. it gets five stars for the Maria Elena, a monstrous platter of all the classic Nica food whose flavors will instantly whisk your mind and soul away to a true Managuan fritanga. and yes, it's cash only. who cares? middlemen are thieves.", "author": "Ronny K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-22", "description": "Ok, so I ordered the chicken and chicken Meat balls soup and I only got as far as Meat in my soup .....one small chicken wing and one small chicken Meat Ball! And it the was almost $15 for that soup. What a rip off!!! Beware!!!!", "author": "Bernadette F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "The food is just as good as my mom's cooking. I just got back from Nicaragua a week ago and can say the food here is really authentic. I ordered the carne asada plate and I got a healthy portion of Fresh Gallo pinto, crispy tajadas verdes, a little salad, and perfectly seasoned carne  asada. I was happy.", "author": "Karla g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "We had the Baho (under the especialidades section of the menu) and it was just delicious!  The brisket was super tender and very flavorful, the platanos were great, and I have never had yucca with such good texture and flavor.  Every bite was a win.  Huge portion for $14, it was enough for two of us.  Great value, good music / atmosphere, friendly and not pushy service.  Highly recommend!", "author": "Oren F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "The food was so.. delicious and that's coming from a guy that lives in Los Angeles and pretty much had  visited all the nicaraguan restaurant in L.A county. \nEvery time I come up to the bay area oye managua  will be one of my stop. \nDon't take my word for it,  go try it for your self", "author": "Marvin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-01", "description": "Ok... I really had to think about how many stars this place deserves..\n\nMy husband's friend who was born and raised in Nicaragua brought us here yesterday for lunch, and up until yesterday, I had never tried Nicaraguan food, so I was super excited. I love trying new food! And what better what to do it than with a friend who knows what it's about!! \nSo we parked, and headed into the restaurant around 1:00pm, and the first thing I noticed was that it was CASH ONLY. I hate cash only, but I guess no biggy, our friend went to the ATM next door. The place was busy, but we were able to sit down immediately, and were given our menus. 45 MINUTES LATER the waitress took our order!! That is no joke! I'm not exaggerating. From the time we sat down, our order was taken 45 minutes after. She never even came over to acknowledge us. Our friend had to call her over twice. The first time he did, she very rudely told him to wait. If it weren't for our friend taking us here and loving this place because it feels like home, I would've said something after 15 minutes, but I let it go. After ordering, it took another 30-45 minutes to get our food. What irritated the hell out of me was that two tables that sat down about 10 minutes after we did got their food about 20 minutes before we did. I hate it when restaurants do that! My 1 year old is fantastic when we go out to eat, but even this was too long for her, she was getting pretty fussy. \nOur friend ordered two plates of the Maria Elena Special, a side of the fried cheese, and 3 cacao drinks and man was the food awesome! I loved it!! He originally wanted to order just one of the Maria Elena Specials and then another, but the waitress told us that they were out of the other one. I didn't hear what he ordered, but I thought it was strange that they were out on a Sunday for lunch (probably their busiest time of the week). You should have popular items prepared.. just saying.. but anywho, the fried cheese was so good!! My husband really liked the asados and plantains, and my daughter loved the gallo pinto. Either that, or she was starving from the wait -___-. The salad also paired really nicely with everything else. I loved everything! The disappointing part... the waitress never brought the side of the fried cheese. Unfortunately, my friend never double-checked it, but I really hope he wasn't charged for it because I felt like he was. The crazy part was when she brought the two plates of the Maria Elena, she said the fried cheese was coming, so I don't know how it got lost there..\n\nWe left a 3:20pm. We were there for lunch over 2 hours!! 2 HOURS!!!!! I'm just glad that we were with good company. Chatting helped distract us from the RIDICULOUS SLOW SERVICE. And to me, the waitress wasn't all that friendly or apologetic about the long wait. I actually thought she was rude. I am so happy our friend took us here, but it sucks how bad the service was. I really wanted to give it a 5 star review because the food here is awesome. So awesome that even after the experience, I think I would come back, but I definitely don't think it deserved it. I actually think I'm being generous with the 3 stars..I think if this place were to do better in serving their customers it would be a HIT! Because so many people already love this place and talk it up. I just hope next time, service isn't as bad. I guess I'll have to see.", "author": "Kristina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "Mexican style ice cream and fruit not sure what else they had. Person are counter spoke little English so I had difficulty ordering but good stuff if your looking for a spicy sweet cool treat", "author": "Gineeta L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-01", "description": "I'm 100% NICOYA and I know this is good atmosphere and good food just like everyone says, I love going there with my wife eat have a Tona, but bad service lately. I always used to order Maria Elena and had them give me chancho frito rather than chancho asado and all of the sudden they don't do that anymore? wow!! if you go to a restaurant and your order onion rings rather than fries, I think is the same, RIGHT?\nas you walk in the sing say \"CASH ONLY\" well that's FALSE I have seen them taking credit cards I guess people that they know or they like. TIPICO NICARAGUENSE,SIEMPRE DE LADRONES Y HACERNOS VER MAL A TODOS LOS OTROS NICAS. This place is going down hill and I DON'T think will be going back. DISAPPOINTMENT. any suggestion where to eat COMIDA NICA??", "author": "Hermes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-21", "description": "Best place for nicaraguense food! \n\nThe plates are pretty decent and food taste like authentic nicaraguense. \n\nKeep in mind if your looking for a fancy place, over the top prices and you will be judging customer service.Then this is not the place for you!!\n\nPros: awesome food\nCons: Only cash, seating is tight", "author": "Carol M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-02", "description": "If there were a no start, I will put it. \nI am very disappointed and sad. This was first and last time I go to a Nicaraguan restaurant in the most famous city in the world San Francisco. It is a shame to see that every restaurant I have visit convine me every time that my money is more worthy that throw it by going to this restaurant. \nI just left this place and it was not pack but the service and food horrible. I went with my family carving howtown food and I left there  wishing never have gotten there. I ordered a green plantain plate  which was ok. My son ordered the fried prawn Nicaraguan style supposetly but believe me it was nothing like I have eaten in Nicaragua. It looks like they took it for Costco big bags and just reheated them and no special sauce. I was shock when I saw it. And my husband order a 7 ocean soup which never came and we ended it canceled right when it was about to come to the table but we were sooo frustrated that it never came and the others plates were cold of waiting for that soup to come. I must said it had nothing to be with  waitress. She was nice but the kitchen was the problem. They obvious don't know how to get a whole table ticket out. Well, the worst place to go. Don't recommend at all.", "author": "Milly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Nicaraguen food is delicious here. The portions are filling. Even tho it gets crowded at times it's worth the wait. The meals are hearty and a must try. On Sunday's they have live band playing. Pretty cultural and live. I really enjoyed it here.", "author": "Ivania B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-10", "description": "Worst experience ever. Sat night a lame singer that was too loud. I'm with 11 people grandmother mother father kids. The family ask multiple times to turn it down. When I approached him to turn it Dow the staff told me if I don't like it leave, and I left, NEVER to return. Horrible.", "author": "Tweeb K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Went here to celebrate new year's with my boyfriend's family and it was the top google results for Nicaraguan food! My boyfriend and I shared the Especial Maria Elena and their food is so delicious! Although it was crowded and we had wait for a table, we didn't mind because the food was worth it. Got introduced to Milca (red soda) by my boyfriend's family and I love it so much! Overall great experience and service was good too :)", "author": "Adrienne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Es un Exelente restaurants. We love it!!! It's OYE FABULOUS.... ... We always have the best time with family and friends... Toñas are the best to the best OYE FABULOUS....", "author": "Anniuska G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "Why oh why have I waited 20 years to eat at Oye Managua? I live in the neighborhood and was remiss in not eating here before. \n\nI LOVE LOVE LOVE this restaurant and have been just twice now and can't wait to go again. It's always a good sign when you crave the food from a restaurant! \n\nSo far I've had: Especial Maria Elena (Gallo Pinto, Cerdo Asado, Carne Asado, Tajadas Maduros Y Verdes, Fried Cheese, Salad) and Tajadas Maduras O Verdes Y Queso (Plantains with Cheese). Both dishes were great! \n\nGet on down to Bernal Heights for a great Nicaraguan meal!", "author": "Yvette K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "I'm Nicaraguense, but don't speak Spanish and I don't know if no one works here that doesn't speak English or if I just have the worst luck. The food is delicious and I try to come atleast twice a month (I live in San Jose,ca) and will take a drive out to SF when the craving is to intense. Point blank, food is great, atmosphere is great, just wish they had some English speaking waiters/waitresses to make things easier. 4 stars for language barrier", "author": "Fallon O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "Great food. Good costumer service except for they honestly do NOT know how to use a calculator, (or they were just trying to rob us). We split the check three different ways and every single check was added terribly. One check they added $20 extra. The second they added $45 and the last and worst one they added over $110!!!! It all seemed so unreal after we recounted all checks four times. But they changed the price with no problem. Besides that, good service and great food. I just recommend that you add up the check yourself so you won't be paying extra money. They deserve the four stars because we were a big party and they got (almost) all of our orders right. But whenever we brought up a problem with a dish, they fixed the problem right away.", "author": "Julio V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-28", "description": "WORST EXPERIENCE IN A RESTAURANT. And why I post a review until now.  I don't write reviews on people behaving uncivilized but this one keeps bothering  me cause I was present with friends when it took place. A physical fight like one of those that you expect in a low class bar. This one was between (2) mature \"ladies\".  One was drinking by the \"so call bar\" and the other one a \"walking customer\". Based on the accounts of incident, all these ppl new each others and these \"ladies\" had some ongoing issues which one of them decided to take care of that late afternoon. The owner/supervisor didn't do anything to stop the fight, it seemed like they were relatives, police were not called , no apologize given to customers, we did not even started our meals but I got billed for it. \nThe worst experience a customer could have.", "author": "Maddy J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-30", "description": "Food was on point but unfortunately the service was just so bad.... Now reading other reviews guess that is to be expected... It was hard to get attention, ask where my food was, and why would you serve a crab soup with full crab legs if you aren't going.also have a cracker so I can actually eat it. Just a spontatenous solo lunch on my birthday before the eve and it the service made me legit sad.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "This restaurant is my favorite restaurant...especially when I'm craving Nicaraguan food. Their food is always delicious. I always order the tilapia jalapeño Nicaraguan style. I love it!!! But, you should always ask if they have it in stock before you order because sometimes they do not have it. Other than that, I always order their cacao... omg this drink is the best. The customer service is fast and great. They always check up on you to make sure you are doing okay, if you don't know what to get on the menu they help suggest some things to get and it all turns out so yummy. I can here alone once when I first found out about this place. Then I came with friends. And then my boyfriend m, and lastly with my siblings. And all the impressions I got from all of them was Wow! This is good!!  So I would highly suggest coming here if you are definitely in the area.", "author": "Rhoddavie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-25", "description": "If your looking for good Nica food this Is the place! We ordered the Maria Elena plate is was more than enough for two. Beef pork Gallo pinto platanos queso  everything was DELICIOUS. MY 1ST timr trying milca  a Nicaraguan soda  Mmmmm so tasty I will definitely  be going back!", "author": "Nicole G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-07", "description": "My family and I visited here and it was an interesting experience.  Besides it being ridiculously hot that day we needed to bring our patience here.\n\nWe walked in and realized they are cash only so had to go to the Safeway across the street to get money. Once we got back we sat but waited forever to be served menus.. I mean a long time, my husband had to go ask for them and an employee just pointed to where they are .\nThen after that we were finally helped and the food was decent.  My husband had the Vigoron with cacao and I had the Nicatamal with a Toño. Very yummy!\n\nI'd come back but make sure you have cash and patience", "author": "Alecia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-07", "description": "Food was ok. The service was terrible!!!! My daughter asked for water, the waitress brought her tap water with no ice. Waitress never checked on us. When it was time to pay the bill she was over charging us by $10 dollars. If you go here make sure to check your bill... Not a good experience!!!!!!", "author": "Sarela Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-17", "description": "Excellent authentic Nicaraguan food. \"Especial Maria Elena\" was amazing and perfect for two people to share (we even had left overs). Chia drink was delicious and refreshing. Live music was great and added to the experience. Highly recommend and I will definitely be back.", "author": "Carlos R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Went to this hole in the wall on Mission and I was in Nicaraguan foodie heaven; better than what Abuelita makes. It's a small restaurant and crowded but the service was fast and servers were friendly. My family shared a nacatamal, Nicaraguan tamale. It had a ton of pork, not too spicy and the masa was yummy. I had the #31 which is Gallo Pinto, moist yet crispy fried pork, plantains, a traditional cabbage salad, and a piece of fried cheese, paired with super sweet Milca Red Soda. My only complaint, not enough fried cheese and not having enough room to try more.  Recommend to all Nicoyas and anyone wanting to try Nicaraguan cuisine. Will be coming back!", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-11", "description": "I am neither Latino nor Nicaraguan. I think I understand the attitude remarks. It did feel a little like, \"what are you doing here? Your in a restaurant of an ethnicity different than your own... Be flexible or stay home.\nWe had the Maria Elena, sopa de raiz, green fried and dried fried plantains, rice and beans. The plantains were sweet and ripe, the meats tender and well seasoned. My chia drink was sweet and cold. I liked the casual family friendly vibe.", "author": "Susangela M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-28", "description": "It was very hot the night we were in and there is no AC. While we only had a couple of beers while waiting for the Japanese place next door to open, the food looked incredible and we did recommend it to a couple who has traveled to Nicaragua and they seemed very pleased with their meal. The place was packed with regulars. I can't wait to go back on a cooler night and take it all in. I fear that throwbacks like this in the neighborhood are soon to be a thing of the past.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-17", "description": "Good food. They take a little time but it was worth it,  authentic Nicaraguan cosina,\nRecommend the. Bajo", "author": "Nelson C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "I love coming here cause the carne asada with gallo pinto and queso frito and  fried plantains are so fricken bomb!!!! But the price is so expensive where I can just ask my moms boyfriend to make it but she's in LA. For the amount they give you is pretty good. I got the cacao as well and it's so fricken good. I love nica food!", "author": "Micah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-30", "description": "I am Nicaragüense, my family's from Managua and this is my Death-Row last meal! I've been coming here for over 10 years. Aside from my family's recipies, this is the closest thing to authentic Nicoyan food. Carne Asada, gallo pinto, platanos (fried sweet bananas) ensalada with subtle lemon juice, platains (banana chips) and gueso frito. For those who are unfamiliar with Central American cuisine, 2 words \"gueso frito.\" Fried cheese. Need I say more!? Mouth-Savoring bliss.", "author": "Tybalt X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "Who cares about decor and service when the food is ON POINT!  Just show up, order and shut-up.  It's the best in the bay! When I crave Nicaraguan food and my grandma is not around to make me some, I head on over to Oye Managua! Parking is actually easy. Just bring change or bank card for meter.  Enjoy!", "author": "Mrs. M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-30", "description": "Very bad customer service, when you ask the waitress for something they ignore you or take a long time to do it. Mu muy mal servicio al cliente. Las meseras se hacen las locas para no atender bien. Como que uno les piden la comida gratis si uno esta pagando por los servicios!!", "author": "Glenda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "I'm Nicaraguan and I love this place!!! It's a little on the pricier side. But, it's pretty authentic and the vibe is totally like it would be in a Latin restaurant! Their nacatamles are bomb and bistek encebellado is super yummy too!", "author": "Cupcake 1."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-18", "description": "3.5 STARS\n\nI think weekends are a good excuse to be, act, and look like a bum. \n\nCome Sunday afternoon, I made an executive decision: I ain't cooking so we're going out to brunch.\n\nI walked out to the living room in a ponytail, no makeup, no eyebrows (thanks to a botched Chinatown eyebrow tattoo job when I was 16), a faded t-shirt, stretchy yoga pants, a fleece, and tennis shoes. \n\nMe: \"Ok, let's go.\"\n\nMr. NSS *chuckles*: \"I thought we're going to brunch...are we going running instead?\"\n\nMe: \"Uhhh, when's the last time you've seen me run?\" \n\n*Awkward silence*\n\nMr. NSS: \"You're normally so put together...today, you look kinda...ummm...\"\n\nMe: \"The honeymoon is OVER sweetheart so you better get use this look.\"\n\nMr. NSS: \"You still look great!\"\n\nMe *rolls eyes*: \"You're a whoreable liar...let's go.\"\n\nWe both never had Nicaraguan food before (shame on me) so decided to check out Oye! Managua since it was nearby. Everyone stared at us when we walked in and we were the only non-natives there which is always a good sign at any ethnic joint. The ambiance is very vibrant and cheezy (http://bit.ly/TvzSsQ). Not a good date place, fellas; well, not if you want to get lucky that is. If you're a carniwhore, you will be in meat heaven at Oye! Managua as the majority of the menu is very meat-centric.\n\nIn true Yelp fashion, we over-ordered and ordered for a family of four. The portions at Oye! Managua are no joke so beware. \n\nCraving something soupy, we ordered the Mondongo ($10), a beef tripe soup that's served with white rice and corn tortillas (http://bit.ly/TvzwTb). I'm huge fan of Mexican menudo but not the Mondongo. The tripe was very chewy and needed to be cooked down more while the soup base was too sour for me. The Lengua En Salsa ($13) totally redeemed the Mondongo. Huge chunks of lengua were stewed in a flavorful tomato and onion sauce until it was uber tender (http://bit.ly/Yh98RI).This was served alongside white rice, beans, plantains, fried cheese, salad and corn tortillas. I would come back for this dish alone. And then the Nicaraguan behemoth arrived...the Caballo Bayo ($26). HOLY F*CK, this thing was HUGE (http://bit.ly/UzIz4J)! Enough for a family of four, the Caballo Bayo (wrong description listed on menu) consisted of fried pork, shredded beef in the same tomato and onion sauce as the lengua, chicharrón, Nicaraguan sausage, gallo pinto (rice & beans), fried cheese, fried plantains, and corn tortillas. This dish was more quantity than quality as the fried pork was dry, the chicharron so hard it can chip a tooth, and the plantains were over-caramelized causing a slight burnt taste. The tender shredded beef and sausage were good texture wise but that's it. The best part of the behemoth carniwhore platter? The gallo pinto and the fried cheese! Yup, you read right. The rice and beans were so robust in seasoning (cooked in meat broth?) that it was absolutely addicting. The fried cheese was crisp with a soft, oooey gooey center--simply irresistible.  \n\nBarely making a dent in our meal, we walked out with 3 full boxes of food to bring home. I also walked out with an 8 month old food baby. SEE, I knew wearing stretchy pants to brunch would come in handy. \n\nFellas, never second guess a women's decision. The End.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-26", "description": "Boom!!!! on point the caballo bayo they way they make it is off the hook..... other places make it diffrent but i dont mind thier way at all...la sopa de mondongo is tripe soup im a fan of menudo so i can dig this alot.... they serve good fresh nicoya food it takes alittle bit to get your food but its all good for me ill wait alttle bitno worries.... i also get the especial de la casa its a combo alittle bit of everything thats what i get after a nice hang over lol.. with a tona beer yea im cravin one right now. service is alittle slow they really dont check up on u... you have to wave them down alot of the time thats a little wack but i dont mind it..... the parking sucks too hahaha but eventually youll find one", "author": "Rigoberto C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-04", "description": "the gallo pinto was delicious (3.5-4 stars). this place was packed one sunday afternoon as we were lunching, but got a table right away. My fish was unimpressive (2.5 stars), okay that was kinda a gamble. But my platanos maduros? they weren't ripe enough they were all hard and weird, fail (1 star). No reason to return anytime soon. Fun atmosphere tho, nice servers.", "author": "Coco J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-02", "description": "The 1 star is because I had to give them one. Otherwise it would have been NONE. ZERO STARS. NASTY PLACE.\nWORST PLACE TO EAT. the food was cold, the service BAD. I been told this is a great place. It was packed when we went. We found a table right away and sat. Our waiter didn't acknowledge us until some other customers sat behind us, and were given menus and attention first. Right away I knew this was not going to be a good experience and I was right. We order a churasco, and antojitos nicas. Thank God I kept a menu. The food was not brought at the same time. A different table was served first before my food arrive even though my friend had her food already. When asked where my food was, the waiter looked at me like I was crazy. 2 different tables were served before my food came. My food was COLD, and it was missing 2 items. I had the antojitos nica, no sour cream or chicken. Instead of chicken I got chicharon  (not the same thing) when I told the waiter they were 2 item missing all he said was \"ok\"  he brought the sour cream but kept on waiting for the chicken. I ate my meal, but I was discussed by it. The pork was hard and cold, Platanos cold and oily, the sausage burned out and cold, the queso frito cold. The Gallo pinto was the only decent thing, as well as the tacos. When I asked the waiter again where the chicken was, he responded  \"they ran out of chicken, that's why you got chicharon\" I told him \"if you knew they ran out of chicken, why didn't you tell me I could have order something else\" he didn't respond. We asked for our bill, of course it tooked for ever to get the bill, when he finally brought the bill, he brought me 4 pieces of chicken wings, and guess what? Yep they were COLD too. I took a bite out of one and hot outside and cold inside. I spitted out right away. SAVE YOUR MONEY, DON'T GO THERE. Loud music, bad service, and cash only. I DIDN'T TIP THEM, was not going to waste any more money there. \nSad this place is Nicaraguan food. I'm a proud nica, but this food was NASTY. NEVER GOING BACK. LIKE I SAY, BAD FOOD AND SERVICE.  EAT SOMEWHERE ELSE PLEASE.", "author": "Sophia E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-17", "description": "I've given this place so many opportunities to prove me wrong. I've come here a few times and the food is decent (nothing special) but today the food was awful again! \nAlso the service sucks! I explained to the owner that I didn't think the employees had good customer skills she apologized. However today, she was the waitress and the service was terrible! It was 10am they just opened but she just seemed completely upset about being there, she did not seem happy to be there. Food was disgusting! Gave me a huge tummy ache! Just to think that the owners are giving horrible treatment that means it's the worst. I'm never going here again. With service like this, nobody will show up anymore ....", "author": "Vera M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-09", "description": "I love this place. When I lived in Oakland, I would travel to the Mission about once a month for lunch at Oye Managua. Nicaraguan food is hard to find on the west coast outside of SF or LA, but the mission has three (or four; one is half Salvadorean). I ate at all of them before I traveled to Nicaragua and easily Oye Managua is the best. I only wish that they would serve Guapote. The food compares to the Nicaraguan traditional breakfast food served in Nica itself. The service is courteous and friendly-even to gringos with only an intermediate level of Spanish (or less). I felt like Oye Managua helped satisfy my craving for Nica cuisine after coming home.\n\nGet the Gallo Pinto, the price can't be beat. The Maduro is excellent. I didnt like the queso, but having tried it elsewhere and in Granada, NI it is just too strong for me so it is not fair for me to judge. Nactamals are pretty good as well. Gallo Pinto is the best though.", "author": "Bryce H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "Oye Managua has the distinction of not just having some of the best Nicaraguan dishes in one of the best locations in the Mission district, it is also the only place where the ambience feels as if you were in Nicaragua itself.  The best dish by far is their Carne Asada, but it's one of the few places that will serve the traditional Red Snapper with the Nicaraguan tomato sauce that many coastal regions are known for.  There are some caveats, like the difficulty in finding parking and the fact that the place is popular, therefore will be busy during dining hours and weekends.  Nevertheless, it is Nicaragua outside Nicaragua.", "author": "Luigi D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-03", "description": "This place isn't anything special. Food was okay but not a big wow. Service was horrible though. We got seated, got our drinks, and then they moved us to another table. Not only that but it took forever to order, to get your food, to pay and then to get your change back. There were only two waitresses for the entire place. Seemed like we were there forever just waiting and the waitresses weren't friendly either.", "author": "Amelia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-11", "description": "This is our family spot.  We have being going with our family since 2006.  The Mariaelena plate for 25$ is so worth it.  Makes me hubby feel like he is back home!  My first experience with Nicoya food and I am sure glad.  From the old owners to the New we feel like family.  Thank you Oye Managua. Cant forget the amazing and talent on Saturdays...godbless you guys.\n\nJose and Johnnett Moreno & family", "author": "Johnnett T. Moreno M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "This is by far one of my top three favorite restaurants. The meal I always get is Carne Asada and Cacao. Best food ever. One thing that I didn't like was that the last time I came here with my boyfriend and his parents, (they are white and dont speak spanish) our server didnt really understand english that well, so it was difficult to get our orders and we were kind of scared to get the wrong orders. But either way they thought the food was great and I thought the food was great and that's all that matters. Definitely recommend to anyone and everyone!", "author": "Jullissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "Best Nicaraguan food by far! You may not like it if you are a \"health aficionado\"\nThe decor is not \"acceptable\" by North American standards. But I go for the food and the friendly atmosphere. If you are worried about calories... Maybe not your place. I love it!", "author": "Edgar T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Really delicious food and great service plus music  make a really great Sunday dinner !", "author": "Rosa P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "Love this place!! Definitely authentic food, just like in Nicaragua. However, if you're American and have a standard for good service, you might not like it here. Hospitality is not their best virtue. This venue is tiny and hard to get a table on a busy night. The servers are not friendly... Their only concern is getting the food to your table. Just keep that in mind, and enjoy the food!! I recommend the seafood soup (siete mares), or the sampler \"Maria Elena\" will give you a taste of everything Nica (carne, gallo pinto, tejadas fritas, queso frito). But my all time favorite dish is the Indio Viejo, which is a meat stew. The nacatamal here is also really good, and less fatty than what you get in Nicaragua.", "author": "Amy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-21", "description": "Worst place to order food. I ordered 13 Nacatamales a wk in advance and when I called to pick them up they said they had no order. Wth? I was saddened because they were for Xmas and pissed because the woman I spoke to did not offer any resolution and was rude. I will NEVER go here and I will tell all my friends and family the same.", "author": "Lizette V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-06", "description": "My friend has his birthday dinner here, and with about 20 of us there in a small restaurant it was still nice. \nThe food was very good. On point. I got the #21 chicken with rice, beans, fried cheese and salad. the portions are very generous. \nThey also have a guy playing the piano and singing Latin music. Parking is tricky since Mission is so busy. but I'd def come back here.", "author": "Irma R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "The food there is great best Nicaraguan restaurant I been to  the people there is friendly music is on point  the owner is always smiling very good customer service it's a very friendly place to go to  they also have.  the best cacao ever to", "author": "Ligia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-07", "description": "I recently had a meeting in the area and decided to meet some friends at Oye Managua, Nicaraguan food we always crave, I have not been there in a while, but I always like the food and the cold Toña beer. \n\nAfter a couple beers, we decided to have some \"boquitas\" something to munch on, we did not know what to eat, we asked the friendly waiter Hector and he suggested some steamed yucca with fried cheese ad a cole slow type salad, it was very good. \n\nOne of my friend order a 7 mares soup, (seven seas) a mix of sea food soup. Well, it was delicious, the taste was so good that you can think you were at the beach. We enjoyed the rest of the food. \n\nThe service was great, Hector keep coming by and asking us if we needed anything else. The owner Gaby came to say hello and she reminded us to come by on friday for live music. The place has changed the paintings, no more old dolphins are not there anymore, it fits better with the area and the food still great. \n\nI definitely recommend it to my friend, it's worth the visit anytime.", "author": "Carlos S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-31", "description": "Picked up some food today. Different from what I usually order. Nacatamales and bunuelos are great. Ordered the churassco today, it was over cooked and hard like rubber. Not worth 17.00. Not too happy today.", "author": "MariaFer D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-04", "description": "Went here with a few friends for dinner as it was rated fairly highly on Yelp, and when is Yelp wrong? Now. This place should not even be above a 2-star. \n\nThe decorations confused me and made me feel like I was in a demented horror house - you will know if you go here what I'm talking about. \n\nThere was a man playing an organ and singing with a massive amplifier for place with maybe a dozen tables. This allowed me to not be able to speak to the people next to me. He did have a great voice however. \n\nA table in the back were celebrating a birthday, to which the cook from the back came out banging on soapy pots and screaming like a banshee. Very odd. At least they clean their dishes. \n\nThe food? Well, if what you want to order is salt, then this place is for you. We ordered and split their largest platter to share, which was fried, yet uncooked cheese, a 4lb heaping pile of the saltiest and least flavorful beans and rice I have ever had (how do you screw this up?) and a few slices of overly charred (and did I mention, salty) meat of some unknown origin. Thinking this wouldn't be enough, we ordered a tamale. Unlike a more traditional approach of wrapping in a corn husk, this was wrapped in saran wrap and wax paper. Interesting touch. Odd consistency. \n\nOverall, I would not recommend this restaurant unless you are in a large group of Nicaraguan buddies looking for a dance party and salty treats on your birthday.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-07", "description": "I was honestly impressed! This food made me feel like I was back in Nicaragua. Everything tasted amazing and made to perfection! I will definitely be coming back! Only downside was I wish the restaurant was a bit bigger and wasn't on a cash only basis. Nonetheless the food is always delicious and fresh, portions are pretty big and they have a large selection.", "author": "Katherine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "Really good food! Authentic and delicious. The servers were super friendly.. Even desert was amazing. I will be back!!", "author": "April B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-06", "description": "Really good food but knocked off 2 stars for service and decor . We walked in and waited 5 minutes to sit even though we made eye contact with the waitress several times . She was pretty rude and looked extremely unhappy to be there. Reading other reviews I felt like everyone was talking about our same waitress . The food was delicious however , so that made up for it . Decor was horrible , demented Latina horror house best describes it", "author": "Lauren A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-28", "description": "Love this food.\nAside from Las Tinajas this place is really good. I am Nicaraguan, so I know my food...this place is really good when your not in the mood to cook it yourself.\nThey have good portions, decent prices and on weekends, they have a guy who plays music.\nTypical Latin spot, where people are laughing and talking super loud. So if that's not your style, then maybe pick a diff spot.\n\nI haven't tried the indio viejo, but it didn't look appealing to me. I usually go for the good ol' steak with gallopinto. the bajo is also really good.", "author": "francis c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-19", "description": "Great comfort food for a cool SF day. The fried pork was crispy and full of flavor, but the real star, (and this is a first for me to say) was the rice and beans, which seemed to have little pieces if pork in them.  I couldn't get enough! The plantains were also very good. The service was pleasant. The place can get a bit crowded, so if you've got a stroller, like us, be polite and maneuver carefully. Also, they have a sign that says \"cash only\", but I could sworn I saw people pay with cards. Either way, there's an ATM across the street at the Walgreen's.", "author": "Kris Marie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-16", "description": "I am Nicaraguan and the ambiance is VERY Nicaraguan. That being said, the food is hit or miss; the vigoron was good and so were the tajadas but the nacatamal was subpar. It was good to satisfy my craving but didn't blow me away.", "author": "Christine A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-27", "description": "My husband and I went there for some appetizer. We sat and order.The waiter afte he took the order came to tell us if we can sit and another table   because the one we were sat was reserved.  We felt very un respectfully.  From the restaurant in charge nt to le us know since the begining. We never going back there", "author": "Yamilette C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-05", "description": "Food is excellent and better priced than La Tinajas. The wait times for a table can be long. Service is okay - could be better.", "author": "Gabriela G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-18", "description": "When ever I'm in the City I have to go into the Mission District and get some Nicaraguan food.  My parents were from there and past away over 20 years ago.  \nOn this trip after two wonderful meals based on my yelp friends reviews I had to do my pilgrimage into the MD and have some old fashion Central American Food. \n\nI went for the Caballo Bayo, a huge amount of food but it is like a sample platter. \n\nFried Pork crispy outside tender inside light marinade \nShredded Beef in a light tomato sauce with onions and green peppers\nSausage Nica style \nChicaron pork rind\nGallo Pinto rice & beans \nFried cheese\nFried plantains, corn tortillas\nMaduro ripe sweet plantain \nWonderful cabbage, tomato in a vinegar mix\n And a Tona a Nicaraguan Lager Beer to was it all down.  \n\n\n If  you are a first timer you can go for the Baho\nA brisket slow cooked in bananas leaves served with rice, yucca , plantains both non ripe and ripe, along with cabbage salad y tortillas.  A delicious tender pece of meat nothing very exotic.  But all the dishes are very good, fish, chicken pork or beef.  \n\nGood eats", "author": "JORGE R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-23", "description": "I will give it two stars because our fish fillet in Jalapeno sauce was good. However the service was terrible. My two year old was really hungry and every, I mean every restaurant understand that you have to bring out the kids food 1st. We had order chicken nuggets with french fries. The chicken nuggets were from a package and so were the fries. So my question is why take forever if you get them from a bag already prep and you just have to reheat. My was was upset because when we got everything, all the food was cold and she mention something strange, she said why does not smell like food? whenever you go to a restaurant you can smell from the dining room they are cooking something in the kitchen but you don't smell nothing at all in this place. mmmmmm strange.", "author": "Milton M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-13", "description": "I've always heard people talking about this restaurant and how good it is.  I finally came and tried it out and what can I say, the food is appetizing and fulfilling.  The SERVICE in the other hand, is HORRIBLE!  Since we got there we received an ugly look from the waitress and from there on it just continued.  I had to ask them three times for a refill!! I ended up having to go to the counter and asking for it again, and on top of that they charge $4.50 for a tiny kids apple juice (same prices as a beer).  Doubt I'll be coming back here.", "author": "Katy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-08", "description": "With some of my fiance's Nicaraguan family in town, it was time for a feast at Oye Managua.\n\nThe Especial Maria Elena is not messing around.  That Maria Elena knows what's up - a giant platter filled with carne asado, cerdo asado (grilled pork), gallo pinto (Nicaraguan fried rice and beans), fried plantains, plantain chips, queso frito (straight up FRIED CHEESE), and a hint of vegetable in the form of two dollops of salad.  My fiance and I ended up splitting it because he convinced me it could feed three and when we finished we looked at each other and were like ehhhhh I could eat more. \n\nUnfortunately what the Maria Elena delivered in quantity it did not live up to in quality.  All the sides were good (I could probably eat gallo pinto forever), but the pork was so dry and tasteless we thought it was chicken breast.  Definitely not a compliment.  The carne asado was slightly overcooked as well.", "author": "Cathy Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-13", "description": "We were the only one in the restaurant and it took 45minutes to get our food and the girl who served us was very rude when we requested a refill of water", "author": "DUN UP B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "Cash Only. Other than that if you crave authentic Nicaraguan food,this is your place.", "author": "Jeanine M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-14", "description": "Foods great, service sucks! Super unprofessional. Called for an order for pick up an hour ago and get here they don't even know who took the order. Then they take more than 30 minutes to bring out the food. Are you serious? Never coming here again.", "author": "Nubia L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-20", "description": "Nacatamales are a classic Nica meal.  I have tried them at Óye Managua twice before and have not been satisfied.  Thinking maybe the cook had an off day and jonesing for some hometime flavors, I tried it again today.  Again I was dissapointed.  The masa was three to one on the meat and flavorless.  While I realize they are the only Nica restaurant in this part of town (due to the sad closing of Nicaragua Restaurant and La Carne Asada), I also realize they are short-changing us on flavor and quality.  Oye Managua, stop peeing on my leg and telling me it's raining.  I am from Nicaragua and know what a good nacatamal is supposed to be like--flavorful masa with a good meat to masa ratio.  Nevermind that there was only 1 thin slice of potato and the 1 thin slice of tomato were negligible.  ¿Qué les pasa?  ¿Á quien creen qué engañan, a los cheles?  No vuelvo a comprar nacatamales alli.", "author": "Maria M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-21", "description": "Great food, horrible service- little over 2 hours at the restaurant, the waitress never came to check on us....  still had to get up and get my bill.. if I ask for boxes to go is not to stare at them for 15 extra minutes.  I expect to get the bill when I ask for it...", "author": "Maira B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-16", "description": "\"Survivor Nicaragua\", I thank you for leading me here, even if the entire meal was on my cordoba - er - dime.\n\nAt the onset of each new season of \"Survivor\", NJ and I divvy up the contestants.  Loser (always me) owes the winner a meal, hopefully at a place with some relevance to the underlying season.  I tell you, finding a relevant location for Survivor Vanuatu  was tough, even in San Francisco!  No such problem with Nicaragua.  \n\nNJ and I headed out to the far reaches of Mission Street, bound for \"Oye! Managua\" (gotta love a place with an exclamation point in the title).  There's a  million places that look similar out there, but we were happy to see that Oye! was about 90% full with families and couples.  \n\nAt the recomemndation of yelper Gonzalo, NJ and I shared a Maria Elena platter ($25 and enough food for 2) and a nacatamal ($5).  I also sucked down a satisfyingly sweet, cold, cacao ($3) which was something like a mix between horchata and cinammon-flavored choclate milk.  \n\nThe Maria Elena, easily the most expensive thing on the menu was more than ample food for the two of us.  At $5, the nacatamal (big, Nicaraguan tamale, presented beautifully) would actually have satisfyingly served one of us.  The Maria Elena + the nacatamal meant both a) doggie bag needed and b) no room for dessert.\n\nThe Maria Elena platter includes:\n\n- Nicely sized slabs of grilled Carne Asada and grilled Pork\n- Yucca and deliciously sweet Plantains \n- Cabbage salad, a perfect complement to the meats \n- Fried cheese\n- all served atop a heaping volume of a black beans, rice, and onions.  \n\nEverything was VERY good and VERY filling.  I especially liked it all mixed up with the spicy-onion tabletop condiment.  \n\nWhat I wasn't expecting, but really loved was the live music, the old man boogieing in the back, and all of the table-approaching vendors (most of whom I think worked there) hawking CDs, candies, pastries, roses, and bedazzled t-shirts which would self identify me as a \"SEXY NICA\".  Sexy Nica or not, Oye! is definitely worth checking out.", "author": "Tracey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "The worst part of being Latino... Not speaking Spanish.  Haha, nevertheless, the authentic food and service ease your stomach into a full food coma.  Let's be honest, Latin food will never look visually appealing but don't let this intimate you from its savoriness taste.  Many people may recognize the Latin drink called horchata; however, Nicaraguans have their own take on it called cacao.  It's blended better than a typical horchata drink but similar in taste.  Give it a try.  I visited this location during lunch hours which was perfect because there were plenty of seats to choose from inside tables to window seats.  Plenty of meat options, so don't forget to add cheese on EVERYTHING!!!  Give your taste buds a change from the typical American cuisine and stop on in.", "author": "David W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-29", "description": "This place used to be good back in the days but now a days, the food an service went down hill completely!  The last time I went, I sat down for about 35 mins before they gave me a menu, then another 30mins to come by and take my order and to bring my food other another 40mins. Just terrible... The waitress even had the nerve to say,\"Oh I didn't know you came here to order food\" Ummm lady, what do you go to a restaurant for? Anywho... Since that terrible experience, I decided I would never go back. I heard they changed owners, so that may explain why the food doesn't taste the same anymore and the service sucks! The only good thing there is the music.", "author": "Patty S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-14", "description": "This place used to be good went a few days ago and service was horrible. Took forever to bring our drinks, as well as to take our order, as well as bringing out our food. On top of that they gave one of us a wrong plate that did not belong. And tried charging us for exrra things that we did not order . . The waitress was not.nice at all seemed like she she did not care at all for her tables. Felt like we were there for too long waiting on everything. Wth oye managua !  Que es lo que te sucede !?!?!?!", "author": "Josephine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-18", "description": "Walking into this place was like walking into my grandmother's house.\n\nThe decor was tacky but the food was BOMB. \n\nOk, so my grandma is Salvadorian, but I lived in Managua for 3 months so I have a sense of what Nicaraguan food is like outside the United States. \n\nThe older man who greeted us was super sweet and reminded me of a grandfather type figure. He was one of the friendliest people I've encountered in a restaurant in a while. \n\nI was in a rush and starving so all I had was the gallo pinto. I remember having gallo pinto every freakin' day when I was in Managua, so this was a nostalgia pick. \n\nThe gallo pinto was just like the type I had in nicaragua. Tasty. \n\nI want to go back and see how the nacatamales are or the pitaya juice. \n\nIt seemed a bit on the pricy side for Nicaraguan food, but I'll see how it is relative to the quality of the food next time I visit. \n\nWith latin-american food I almost always disregard decor and service....it's all about the food.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-14", "description": "I heard this place changed ownership.  I used to go here with family for birthdays and get together.  It was good authentic Nicaraguan food.  I had a craving for some Gallo Pinto today and ordered to go. The lady I ordered from seemed bothered and quite unfriendly.  I work in customer service and I am attentive and always happy to help others.  I didn't feel that today.", "author": "Roger O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-08", "description": "I am quite jealous seeing everyone's great reviews because yesterday I had my FIRST and LAST experience here.\n\nWas craving Nicoya food so decided to yelp a place and saw that Oye Managua had great reviews, so decided to check it out. \n\nCame here with my BF and we both ordered the same thing, steak with onions (don't know what the name is). Waited and waited and the waitress finally came out..\n\n(FIRST MESS UP)\nShe brought BOTH of us the wrong plate. I sent mine back but my bf didn't want to be an ass so he was stuck with this disgusting shredded meat plate.. yuck. \n\n(SECOND MESS UP) \nWhen the waitress came back with the right plate, I took a bite into the steak and it was soooooooo TOUGH and OVERCOOKED! (I don't know if that's the way that it's supposed to be cooked but the waitress didn't bother to ask how I wanted my steak...)  My bf told me to give it to the dogs because that's how they like it (yes it was THAT tough!)\n\n(THIRD MESS UP)\nAs I was signing the check, the waitress came to me and said that I was signing the wrong one.. mind you I had already written $0 tip on it and signed it. I was like ok, whatever.. so then I go to sign the other one and look up and the waitress is STILL STANDING there, looking at me and waiting for me to sign the check! WHO DOES THAT?! In the end, I ended up giving her a $2 tip because of the fact that she was standing over me... I really didn't want to give her anything.\n\nOverall, the best thing on my plate was the fried bananas.. loved those. The beans and fried cheese were good too but the other things like the steak, onions, rice and salad could have been made at home.. and made even better than they make it here. But they have this spicy onion sauce on the tables which is pretty good.. I could've eaten that by itself! Anywhoo, both of these plates were $13 each which is really steep for a place like this in the Mission.. it's not even comparable to Cha Cha Cha's or Esperpento! This place was VERY disappointing and if I ever do try Nicoya food again, I will be going to Las Tinajas!", "author": "Sarah E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-18", "description": "I've had Nicaraguense food before and I'm seriously in love with it! Our go to spot closes early and my family and I were craving it, so we decided to go here. The food has a really good taste the only reason this place is getting two stars. The service.... Oh my. TERRIBLE. But I always say \"there goes your tip\" I don't expect to get my butt kissed but decent service and not arguing with the customer would be nice. To start off, she kept rushing us to order all at the same time, some of us showed up first and the other half like 15 min later but she said \"if you all don't order now you won't eat together at the same time\" like jeez lady let us breathe. First off, they couldn't get orders right because they kept bringing us things that we didn't order!!! I don't understand how you mix orders up with other customers, very unorganized if you ask me. My aunt ordered something and we thought they had brought her the wrong order... So we let the lady know, she came with the menu trying to argue saying \"no you ordered this\" in the end she was right, it was the rice she got mixed up. But the attitude she came out with was insane, we told her we didn't want that plate in the end but she rudely said \"sorry we can't change it because it's cooked\" excuse me? We didn't touch or eat it, anywhere we've gone they have changed our order when we told her that she literally walked away with out saying a word. It's also pretty pricey but whatever... All I'm saying is that a smile and better attitude would've bumped this place to 4 stars.", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-31", "description": "If I could do no stars I would! The worst service ever! I always come here and will never come here ever again! We sat down, not seated down. 3 people came in after us, and they were seated and they took their order and us nothing! I had to get up and ask them. They got our order and then all the other people were being served and we hadn't even had water. The other people left and we still hadn't got our food. I'm just in disbelief!", "author": "Karen A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-22", "description": "Food was pretty good, but that was about it. Service was bad, got the wrong beer and when I asked for the one I ordered I got an eye roll. Someone at our table ordered coffee when we sat down because she was cold and wanted to warm up. After 20 minutes I went to tell our server we didn't want it and she said it's coming, like it was no big deal that so much time had passed since we ordered it. Everyone else got their drinks pretty quickly. We were a party of seven. Three people got their meals, then about 10 minutes later two more got their meals, then about 5-7 minutes later the last two got our food. It was horrible timing. Oh and when the bill came we were informed they only take cash. No ATM in the place either, and no signs stating that they do not take cards. Just not a good experience over all. Wouldn't go back.", "author": "Sandy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "Service is mediocre.  But food is not that bad .   Live entertainment . Parking is kinda hard to find but u can risk parking at safeway ( not my fault if u get towed).  Nicaragua is not known for customer service .  Nicaragua is the most vulgar spanish speaking country  in all of latin america .  So sorry for your bad service\" hijo de la gran puta!\"", "author": "Joe B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "3.5 STARS\n\nMy first time having Nicoya food. \n\nThumbs up to:  Ramon the owner who is absolutely wonderful and accomodating!  Portion size (esp. Maria Helena platter)!  Gallo pinto for the starch!  Virago which are basically BOMB Chicaronis!  TONIA BEER & CACOA for drinks! Plantain Chips!\n\nThis place is small however can accommodate a few bigger groups (8-10 people).  Its 2 blocks away from Mitchell's Ice Creamery where you can venture off to for dessert.", "author": "Deanna A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-21", "description": "I wish I could give this place a review but considering that the only two times I have actually walked in & taken a table I have never really be attended. Today was my last day visiting that place. When you walk in the vibe is so happy & the music makes you feel at home. But when you see that none of the waitresses are smiling or acknowledging that someone has just walk in & bother to take a menu to the table just kicks you right out!!!", "author": "Allison M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-17", "description": "The food is good, but they need to work with the servers, they rush you and have really bad attitude to us, the customers. There aren't enough menus for the maximum  capacity of people", "author": "Aaron B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "Usually I wait a few times to write a review BUT here I am.  We went on a Friday evening (we being my wife and 22 m.o. son). It was packed but the servers were nice and found us a table.  The food was delicious (fried plantains and beans/rice were excellent, as was the lengua) and there was even a DJ.  It did run a tad on the loud side though.  We will certainly be back.", "author": "Jan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-06", "description": "soooo good! highly recommended true nicaraguan restaurant...i always get the chancho (pork) asado with gallo pinto and plantains with the cacao drink. you can thank me later :)", "author": "jason xavier c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "This was our first visit to this restaurant and we loved it!!  The food was excellent, the service was great, the food was delivered quickly, the portions are big and the prices are very reasonable, plus we really enjoyed the ambience and the music.  We met Gabriela, the Owner, she's really nice and friendly, we 're definitely coming back!\nExcelente servicio, la comida  es deliciosa, las porciones son grandes y los precios muy razonables, conocimos a Gabriela, la duena, fue muy atenta y amigable.  Definitivamente regresaremos!!", "author": "Patty R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-27", "description": "Fantastic food! We had the Maria Elena special and everything was great. It definitely was enough for 2 people. The carne asada was perfect, plantains, fried cheese, pork, everything. \nOne totally underrated aspect of the restaurant was the music. The singer was great - I swear it was the radio. Service was also great.\nOverall, easily 5 stars. We can't wait to go back and eat there again!", "author": "Kyle M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-27", "description": "If I could put zero stars that would be the case! Me and my family came here. We had to seat ourselves! We was not \nsaid hello to. We was not asked what we wanted to drink. We waited and got ignored for 20 mins tell we go up and left. The food looked and smelled good but I will never know. For I am never going back to that place ever again! Worst service ever", "author": "Brandee D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-20", "description": "Absolute disappointment! I am shocked, and appalled by the service I received today. I am not a big time Yelp user, but I had to log in and express what I witnessed today. I have been a customer at Oye Managua many times, and being Nicaraguan myself, I have developed a small relationship with the establishment. However, I will not be returning. We arrived to the restaurant sometime around noon and ordered. The food came out fairly quickly, and after we were finished we asked for our check. After four different attempts of asking the waitress, they still would not bring it to our table. After about twenty minutes of waiting, I had lost all my patience  and I approached the counter. I peaked inside the kitchen and I saw a pigeon walking around! The bird was just strolling around the room and the cooks just worked around it! After seeing that , I returned to my seat ( without the check ) and sat there in disbelief. They finally brought our check, and we left in a hurry.", "author": "Scarlet S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-23", "description": "Been disappointed here both times I went. And each time was with my good friend from Nicaragua who had the same opinion--or worse. Everything just tasted wrong. The sauce for my lengua was overly sweet and bland and the lengua not even tender. Gallo Pinto lacked flavor. Tostones were a bit soggy. We have yet to find a Nicaraguan place in SF to compare to the exceptional \"LA 27\" in Los Angeles.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-10", "description": "Even though the place is small the have the best nicaraguense god here!! I love it! Its our Sunday ritual! The cacao its DELICIOUS!! I even get one to go for $7 and its a lot of cacao! My baby girl loves this drink!", "author": "Karina s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-01", "description": "Oye my GOODNESS!!!\n\nOrdered the skirt steak and prawns combo with an additional side of fried cheese.\nSkirt steak and prawn combo: 5 stars, the rice and beans were tasty and flavorful, it is not the best cut of steak but the flavor and tenderness of the meat is on point.  The prawns were very fresh and served piping hot...the topper is the fried cheese, fried cheese is all I have to say.\n\nI will not only go back but am looking to make plans right now as to when the next time I can visit.  LEGIT!!!", "author": "Michael L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-23", "description": "I do not know why this place even has more than 2 stars on yelp. Went here twice. The first time was bad, but I thought maybe they are just having a bad day, so I gave them a second chance. Second time was ever worse...\nFirst of all, the parking is so bad. You have to go around a bunch of times just to get a decent parking. I am not going to lie, the food is good. That's another reason why I gave them another but service sucks. If you don't mind waiting a long time for your food, then it's okay. If you need water, utensils of any help, you have to wait a veeeery long time. And the last thing that I hated about this place is that you cannot go with a big group. The first time the charged us an extra plate. So the second time we made sure to take note of what we ordered, but they did the same thing. They insisted to charge us an extra plate. But I guess that's how they make some extra money. Sorry, but I do not recommend this place at all..", "author": "Yzabel C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-21", "description": "I am a proud Nicaraguan. I am sorry that I could only give you two stars. My husband, my nephew and I had such a disappointing experience the food was not good and that's putting it nicely, very disappointed. They were out of 3 dishes that I wanted my husband to try and the steak was so fat that my nephew wouldn't let me box it up for my husband.", "author": "Lucia B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-02", "description": "The food was good, which is the only reason why they get a star. The service was terrible and that's being nice. My family had reserved the restaurant for a get together after a funeral service and they were expecting a large group. Nonetheless they under staffed and took forever to take the orders and serve the drinks. We were there two hours before the food came. During the wait, the clumsy waitress spills a drink all over my dad with a plate of food that wasn't even for us. So the table is soaked and still no food! I had two kids that ordered chicken nuggets from the kids menu. I am sure they were frozen from Costco but that's what the kids wanted. Yet, they brought the kids food out last. It was ridiculous. By the time their food was out, I had feed my kids from my plate and they were full already. Ugh the worse service ever.", "author": "Alicia C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-16", "description": "The service at this place is horrible. My family and I waited 5 minutes to get the menu, then we waited for another 10 minutes for the waiter to acknowledge us again with a little attitude.  The room was really hot, no AC and no fans. The food is over priced and average at best.", "author": "Norman C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-15", "description": "Called ahead of time to get a table set for my family of 8 - Oye Managua's manager agreed it would be ready. When we arrived a few tables were open. We expected he would combine the tables and seat us.  Instead we watched a total of 5 parties sit down.  When we asked why we were not being accomodated, a female server said, \"Seat yourselves wherever.\"  At this point it was impossible to find ourselves a table together so some of us scattered and waited at the bar and one open table.  My daughter was sitting at the bar and the \"manager\" spilled BEER all over her.  We asked for a towel and he gave us ONE napkin and no apologies. She was drenched! We left and ate somewhere else. If you like tiny dirty restaurants and rude unprofessional people to serve you, go to this sorry joint.", "author": "Nancy F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-06", "description": "Oye Managua used to be a good place to eat the delicious food of Nicaragua. However, when the new owners came into the picture, everything changed. The food became plain and way overpriced. I do NOT eat there anymore.\n\nIf you want good Nica food, I suggest you go to Las Tinajas. It's the best nicaragüense restaurant in the city. The prices are definitely worth it and everything tastes fresh, unlike at Oye Managua.", "author": "Dee U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-27", "description": "One of my favorite restaurants in the CITY! I love their carne asada plate....SOOOOO GOOD! It is a HUGE plate too! My wife and I love this place so whenever we crave carne asada and we have a huge appetite we will go to Oye Managua. \n\nPrices to me are higher than expected but worth the price!", "author": "Justin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-27", "description": "1st time to this Nicaraguan Restaurant. Pleasantly surprised at how good the food was. The portions are very large so easily shared or can be lunch for the next day. \nWaitress so nice and attentive.\n\nI ordered my gold standard when eating Nicaraguan food. Salpicon(chopped boiled and then pan fried beef with green peppers and onions), gallo pinto (black beans and rice), tajadas verdes (green plantains thinly sliced and fried) and fried cheese (queso Frito).\nIn addition the Cacao (a drink where the cocoa bean is roasted then blended into milk), I must say, blew the competition's out of the water!\nI think I found my new favorite Nica place to eat.\nOh, oh and I must say it is cheaper that the competition in terms of portion to dollar ratio.\nCheers!", "author": "Maurice A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-10", "description": "I love my Oye Mangaua rest! food is always hot and fresh and service is great! They are doing a great job!", "author": "Melvin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-13", "description": "Delicious food... Miss my home food. I had the salpicon with all the sides. I left my plate as clean as it was before they served the food.", "author": "Al C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "Oye Managua is out go-to restaurant for Nicaraguan food. I've had many parties at home with food from Oye. We order several of the Maria Elena platter which feeds 3 people. Done. The service can be a bit slow but always courteous and friendly. The Nicaraguan beer is fantastic. Nice Nica ambiance. Love this place!", "author": "Maria P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-05", "description": "If I still lived near Bernal, I'd be here all the time.  It's like a dive bar, but a restaurant.  Everyone is very welcoming and you feel right at home.  Our server was the sweetest older gentleman -- I just wanted to hug him!\n\nThere are only a few obvious veggie dishes, but I bet you could ask them to pull together a big plate of sides and it would be awesome (I plan to do that next time).  I really enjoyed the plantain & cheese empanada, but was under the impression it would come with the rice/beans/maduros/queso that the other dinners did.  Still, it was enough for a meal.\n\nWe also really liked the live music.  Dude has a great voice, and his selection of 80's ballads in Spanish and English was oddly soothing.  I'd totally come here just to listen to him and have a few too many beers.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-18", "description": "My husband and i are huge fans of carribean food, so when he suggested this place i was excited! When we first walked in, a whole bunch of people (including the waitresses) just stared at us. It was an awkward situation. We weren't greeted and didn't know if we were supposed to wait to be seated or seat ourselves. After a couple minutes of just standing there, we decided to just seat ourselves. A few more minutes passed before one of the waitresses came by and gave us a couple menus. The lady who ended up being our server (who also happened to be one of the ones that was staring at us earlier) ended up being nice to us the rest of our time there. I'm guessing it's because she wanted to make sure she got a good tip. The food was pretty good and you get a pretty good portion for the price you pay. We'll probably try a few more restaurants before deciding if we want to come back though..", "author": "Mertani G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-09", "description": "Came here for lunch - service was fine, foods was good (i have to admit I have had a little better in the area) but I would definitely come back and would recommend to friends as well.  Atmosphere was casual - there was a game on that day so lots of Niner fans watching the TV's and grubbing on some yummy Nicarguan food.", "author": "Rachael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "Delicious food, huge portion! Loved the breaded chicken dish I had and everything that came with it. We will be back! My husband is Nicaraguan and loves to get his fix once in awhile! I am now a fan too!", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-18", "description": "Since I have been to Nicaragua I can say this place makes pretty good food. It is small and can get really crowded, but it is always a fun place to eat and chill.", "author": "C W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "the place is nice, i love their chancho con yuca. is as good as it can be. \n\nbought a nicaragua jersey there from www.pinolero.net i saw they had them on their website too.  good ass nicoya place", "author": "Jorge O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-18", "description": "Can't go wrong with gallo pinto. They were good cooks when it was the red balloon. Been there twice now & was disappointed. Last week i ordered sopa de queso...not good not good at all. Threw it away. The rice was good. I'm trying to find a good Nicaraguense restaurant since La Carne Asada left. Eddy you could have run the place!!", "author": "Dee G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-05", "description": "The food was delicious reason why I'm giving 4 stars, the cacao omagh delicious,  but the service was 2 out 5.I felt like if I was at someone's house trying to be liked. Also, it's helpful if you have a sign that says, \"wait to be seated,\" that way people don't look stupid standing and being looked at by other sitting down. Happy Easter!", "author": "Roxx P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-12", "description": "Found this by accident...what luck!  The food was really tasty.  The portions were large enough to share, even with my three children (ages 3, 6, and 9).  Although there was a slight language barrier, the wait staff was friendly and very attentive.  I will be taking my husband back with us the next time we go!", "author": "Joelle P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-27", "description": "I can see why reviews are so wishy washy. I went to this place years ago and it was alright. I recently went and I'm happy to say that it was really good! I had the Salpicon and it was fresh. They serve a good amount of beans and rice. Another occasion, I had the Vigoron. No complaints again. I'm coming back to you with open arms, my fellow Nicoyas, because I've been satisfied with your food for the past three times I been there in a month.", "author": "Miss P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-11", "description": "Muy bueno, muy rico, y muy sabroso!\n\nI had a really good time here when I went. There was excellent live music and I loved it. So did my bday date that happends to be half Mex/Nicoya. We danced in the very small dancing area to Live Latino music. \n\nThe food is out of this world. Most people confuse Nicaraugense food for the ideal Mexican food and expect spicy salsa and burritos but its way different. I enjoyed the Queso Frito(fried cheese), gallo pinto(mixture of black beans and rice), and of course the chancho. Everything is cooked with more sweet than spicy and that makes the difference between Nicaragua food and Mexican food. I did love the special drinks that they make here as well. \n\nThink out of the box and try this place. It may take a little bit of getting used to it at first but than its something that hits all of your taste buds for sure.", "author": "California R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-18", "description": "I love Oye Managua.......\n\nThe owner of this fine establishment was the owner of the Red Balloon so when he got a new restaurant I had to follow. Not only does Oye Managua have one of the best cooks the food speaks for itself. I live in NYC but this is the one of the 1st places I come to when I touch down in San Francisco and it is what I bring on the plane with me. \n\nEverything on the menu is delicious my favorite is the gallo pinto con crema.... \n\nThis is a family run business who know what they are doing....\n\nIf you are ever in the Bay Area make sure you stop by and give them a try... Keep in mind they are closed on Mondays & I believe Tuesday I could be wrong so call ahead.........", "author": "Ibedatnica I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-13", "description": "I 've been here a couple times after desperately looking for a Nicaraguan restaurant, I finally decided to go there with my peruvian boyfriend that thinks only peruvian food is good stuff.\nWe order the Maria Elena plate and it was full of my favorites, queso frito and platano verde, OMG i miss that so much, so I go there every time I can.\nThe service is very friendly and the staff reminds me the Nicaraguan accent as they speak.\nFood is very good but small portions heehee...\nThe cacao is the deal!!!!", "author": "Kris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-04", "description": "Food is incredible! Went there for a wedding rehearsal dinner and it was the best Nicaraguan food I have ever had. The owners are very accommodating as well and made us all feel like family. Thank you again for making my best friends special day memorable!", "author": "Robert A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-13", "description": "This place is the so bad on hospitality horrible .. If I could rate it 0 stars I would I went out to dinner with my one year old daughter . First of all while you wait they don't give you chips n salsa . But after all the when I am getting ready to order the waitress looked miserable , no smile  , just bad but let's over pass the . She takes my order then when she brings me the food she brings me only one napkin , so I asked her for more napkins then I was waiting for my tortillas n she never brought them so I had to ask her . Don't the food come with tortillas she was like yeah . So I want them . Then she brings them . Now let's get to the worst part I am done eating and I tell her can you put this to go please she says yeah . She comes back with the f.... Plate for me to do it on my own . Wtf .. I was so pissed I asked for the owner then I tell the owner  what kind if restaurant is this . She going to tell my I am sorry it's a health law when we can't do it our selves . All this other bullahit n then she said yeah you do have the option to have her do it for you . So sorry . I am sorry  *. I told her just let me pay. So I can get out if here . \nI don't recommended think about twice .", "author": "Mayra L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-02", "description": "One of the best restaurant in the city! They have big plate called The Especial Maria Elena OMG its the bomb... If ever in the city and looking to eat Nicaraguense food i recommend this place... Decent prices very lovely place.. Great customer service...", "author": "Bianca O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-08", "description": "I took my kids here to experience a little of the great food that their dad grew up eating. I am so amazed that the place is packed with people at 3:00 in the afternoon. We started with the Vigaron and it is deli-sh. It was a mountain of delicious cabbage, tomato and tons of porky goodness which my kids loved and at the very bottom is a creamy yuka. Yum! \n\nThe nacatamales was sooo good that my husbands eyes literally rolled over his head. My kids had the fried chancho and they loved it especially the sweet maduro. \n\nI recommend this place and I cannot wait to try everything on their menu. BTW on weekends they have the most amazing mondango soup.", "author": "Rhodora E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-04", "description": "Ate here for the first time. After waiting 10 minutes for the hostess to acknowledge us we saw that she was also the only waitress here. We were seated too close to the bar area and nothing worse than a bunch of buzzed loud mouth Latinos hovering in the dining area. After waiting another 20 minutes for our food it got louder and as good as the food could have been; the ambience ruined this experience. Very small place, too warm, no air flow until someone opens the front door. If you try this place the food wasn't that bad, but get a seat near the exit.", "author": "Robert L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-21", "description": "This past Sunday the family and I ate at Oye Managua at 30th and Mission in the city. Mmm mmmm mmmmm! It's not like I don't eat Nicaraguan food on a regular basis but sometimes it's nice to give mom a break from the kitchen.\n\nUpon arrival, I found the decor to be rather random and amusing (read: sea life on the walls). But it did feel like being in Nicaragua with the fact that everyone in there was Nicaraguense and the way the tables were set - plastic over the table cloths, serrated knives, place mats, etc. It was like home!\n\nWhen I opened the menu, I squealed! They had some of my fave dishes like mondongo and nacatamales. What is mondongo you ask? It's a bowl of awesomeness. It's a very flavorful soup with tripe, tendon, yucca, veggies and of course, the slice of corn cob. I hadn't had mondongo in a looooong time because no one wants to make it. You bet I ordered it!\n\nMy aunt ordered the nacatamal (think giant tamale, but WAY better) which was excellent.\n\n[Tangent on why nacatamales are better than tamales....nacatamales are 1) larger than a regular, Mexican or even Salvadorean style tamale 2) there's more going on inside: achiote marinated pork, rice, olive, raisin, a little potato, slice of tomato and a giant chunk of pork fat to keep it all moist. 3) Since they are steamed in plantain leaf, the masa is everso moist...and yes, the pork fat helps too. A completely satisfying meal in one package!]\n\nMy mom ordered the special which was Bajo (or vaho) which is meat cooked with yucca and green plantains in plantain leaves...SO good! It can be eaten with rice and the typical cabbage slaw of Nicaraguan cuisine. My dad ordered the grilled pork plate which came with rice, slaw and queso frito.\n\nWe also started with an order of tajadas, fried green plantains, and of course the queso frito. Don't be scared of the fried cheese, there are much \"scarier\" items in American food. It's a hard cheese that is fried...salty and delicious.\n\nThe staff was fun and it felt very comfortable being there although I'm sure some of the folks were like, \"Where did you people come from?!\"\n\nNicaragua is a very diverse place!", "author": "Karla F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-21", "description": "I have been here so many times and the food is just amazing. I normally go on Sundays and listen to the Dario, the music performer who is there in Sundays. It's such a great atmosphere. The food kicks butt. I always get the Maria Elena special it's so huge! One if their best items on the menu. I suggest to order that. One of the best Nicaraguan restaurants in the mission.", "author": "Food C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-10", "description": "This place is excellent.  I went on a Saturday afternoon and it was was very popular.  I had the Pollo Asado (roasted quarter chicken).  It was amazingly moist and came with maduro, which is fried ripe plantain, rice, beans, and a salad.\n\nThe place has a very casual atmosphere, the staff were very friendly, and there was even live music.  The walls are painted with gigantic seascapes that makes you feel like you're in an aquarium.  Very quirky but I liked it.\n\nI totally recommend this place.  Good food and a fun place. BTW: I noticed that the staff were happy to accommodate a large group (10-12 people) who came in while I was there.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-06", "description": "Ehhh, Its a grease pit. Everything was glistening in oil. They try to charge on gallo pinto (rice and beans), a nicaraguan staple. They are open late.  Flavor-wise its whatever I wouldve been equally satisfied if not more going to an In n Out and my wallet wouldve been happy too.", "author": "R C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-28", "description": "I love Oye! Managua!!! Being from Nicaragua, I have to say it's my favorite restaurant in SF for Nicaraguan food. The best is for breakfast having gallopinto, nacatamales, huevos revueltos con pan, and cacao. It's the ultimate cure for hangovers. For lunch, definitely the vigoron, carne desmenusada, or the caballo bayo with tonas.  It feels like your in Managua and eating at home, I think the owner is Elena who makes you feel at home, everyone is loud, listening to fun music, and having a good time. It's nice to see little Nicaraguan restaurants in a huge sea of Mexican ones.", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-02", "description": "the food was ok.. I ordered pollo asado and it wasn't a big deal, I mean it was fine but it wasn't worth it for the wait. My family reserved the place and they were't ready for us. we waited for someone to took our order about 45 minutes, and more than 2 hours to get the food. the worst part about the wait was when they finally gave us the drinks one of the stupid waitres spill the drink on my grandfather and she didn't even say sorry. and also during the wait my family and I decided to take some pictures and this same waitres was so mean with us because we were on her way. it also happened that my cousins where playing with their smart phones while they were waiting and a random kid startes trying to play with them and he wouldn't live them alone; the kid was the son of someone who work at the restaurant. just saying, if you want food from nicaragua the TINAJAS is way better. I defenitly don't recomend this place to anyone... and for the record I gave the 1 star because I couldn't write the review without giving them any.", "author": "Jenny A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-10", "description": "Came here today waitress was cool accommodated us with free drinks and a free bracelet that says Nicaragua. Had the chicken today and it was DELICIOUS, the meat literally came off the bone. Ill be back!", "author": "Marvin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-19", "description": "Oye Managua has great Nicaraguense Food but I hate the fact that they have not fixed that dam Visa/ATM debit machine. So if you want to eat there you have to make sure that you bring cash with you. I know this seem dumb, but my goodness this should not take 1 year to fixed. I've been going there to eat for the last year and Half and this dam machine still not working. I think they do it so that they don't have to pay to much taxes and not reporting the true amount of what they actually make. we are in United States of America, Not Nicaragua....so there should not be a reason why they have not fixed this machine.", "author": "W P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-08", "description": "Oye! Managua...all I really want to say is \"CACAO\"! Only cause it sounds sooo cool to say...It was also a delicious drink. Went there the day before Cinco De Mayo so they had a singer.  The service was really friendly and I thought it was cool the waitress automatically assumed I was latina and started speaking in spanish. I had just finished studying restaurant etiquette in my Espanol class so I was able to use it. WOOHOO, thank you CCSF! Anyways my friend had the Camarones Rancheros and I ordered the Especial Maria Elena. My friend dish came with a Nica sauce that was delicious, but this dish may get a little messy as the skins are still on the camarones. The Especial Maria Elena was more than I bargained for, granted I was 8 months pregnant. I took half of my dish home. The food was very filling and tasty. I've tried other Nicaraguan Restaurants and these dishes were not only better, but fresher looking.  The only thing is the price, it was a bit more then most restaurants.  Bonus, they also have a jukebox.", "author": "Zara-Maria S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-12", "description": "Deliciso! Authentic Nicaraguan food, most weekends they have live music too, fun.", "author": "Mrs. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-20", "description": "My father came to America from Nicaragua when he was 14. Growing up we didn't know much about \"the Old Country,\" as he would call it, other than some of his childhood stories that usually ended up with him setting fire to something or getting severely punished by a nun (thanks for sending ME to Catholic school too, Dad.) As the self appointed cook of our family, my Dad would take a freestyle approach to cooking often not knowing what the final product would be. He fancied himself the Charlie Parker of the kitchen and believed that recipes were for people who didn't know what they were doing. More often than not, the end result had some sort of meat with a flour thickened sauce from the cast iron pan he would cook EVERYTHING in. Needless to say, my exposure to Nicaraguan cuisine was diluted by his \"creativity.\" He did make some kick ass fried plantains though.\r\n\r\nI pass Oye! Managua, a Nicaraguan restaurant, everyday on my way to work and decided that I should probably have some idea of what actual Nicaraguan food is. As I expected, we were the only non-Latinos in the place. That's cool. I'd be disturbed if the place was full of Chinese people.\r\n\r\nWell the waitress came over and started speaking Spanish to us. This was an excellent opportunity to impress my wife with my command of the Spanish language. Actually, my Spanish is best suited for making stupid jokes and insulting peoples' mothers but I muddled through. At one point she asked if I wanted a mix of mature and green plantains. Either that, or she asked if I wanted to be spanked with a piece of raw liver. In either case, the answer was an emphatic, \"Si!\"\r\n\r\nThe food arrived (sans spanking) and it was actually very similar to Salvadorean food. Most plates came with black beans, rice, and a cabbage slaw and EVERY plate had fried plantains on it. It was all very good and everything had a home-cooked feel to it. A strange familiarity came over me and I felt a slight connection to the food and my heritage. It was very cool.\r\n\r\nYou don't have to be Latino or even Nicaraguan to eat at Oye! Managua and I'm sure anyone can appreciate its homespun style of cooking. Next time I'm having the liver.", "author": "Josua P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-06", "description": "This place is kitschy!  Blue dolphins painted all over the walls and the ceilings, a guy playing the keyboards and singing Nicaraguan songs, and random pumpkin lights all over the walls.\n\nThe food - Nicaraguan - I tried the Seven Seas Soup, which was a real pain in the ass because I had to crack the crab and lobster with my bare hands.  Also checked out the Baho con Arroz - basically brisket - the meat was pretty good, though the yucca and plantains were terrible!\n\nBe sure to try the cacao drink.  Awesome.", "author": "Gabriel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-05", "description": "Great Nica food!!!! Staff is nice!! If you have not tried yet your really missing out", "author": "Felix E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-27", "description": "NICOYA WOOT WOOT!!!\n\nI love this place, I seriously feel like I'm in a restaurant in Nicaragua, The food is good but not a generous/better than las Las tinajas!!! Toñas and Victorias are nice and cold!!! =), the owner is very nice, they have really good service... Once in a while they have a live band that is really awesome! and the Juke box is pretty cool.... This place really makes me feel at home! haha. Ohhh their Cacao is really good too!!!!. \n\nI would definitely recommend this place!", "author": "Diana M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-06", "description": "The food is really good, but the place needs a facelift. I have to be in the mood for a dive setting to go there. Maybe if you've already had a couple beers first. It's worth it, though, cuz the food is so damn good.", "author": "Shirley M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-15", "description": "The food here was good, but the service needs improvement. The music was way too loud even after I requested for it to be lowered. I had to ask multiple times for utensils, and my order was mixed-up.\n\nThe one saving grace, the food was good.", "author": "Fabian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-07", "description": "This is another one of my favorite Nicaraguan restaurants, the draw back(reason of the 4 star) is that there is no parking, if you park at Safeway you risk your car being towed. .\nIf im in the City after working hours or on the weekend this is the place to go, they have a one guy band(he plays the organ, has a drum machine and sings pretty good).\nI had carne asada con gallo pinto y queso frito...yummy, Cacao is my favorite drink and it is delicious, the last time I was there I ordered Nacatamales which are humongous and they tast great.\nI like to take my family there as is safe and the people there are usually friendly.\nAlso the price is good but no Flor de Cana...too bad", "author": "Rich M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-13", "description": "NICOYAS IN THE HOUSE!!\nOk, so me and wifey just ate here. I was craving \"mi comida de mi terra\".\nToday is friday.\n So we met there right after she got off  work, around 6pm. Parking here is a pain but if you ghetto like me you just park in the Safeway across the street. You can circle around I'm sure you will find a meter spot. \nOk so we get in, plenty of tables just 3 other customers eating. When were leaving two more couples were coming in.\nSo I order the carne asada plate it comes with gallo pinto, maduros, queso frito and nica salad. My wife got the pollo asado with the rice and beans. She is very picky so if the food was bad I would have heard it.\nI heard nothing, She like it. \nMy plate was also good, I would have like it if my food was warmer. It wasn't cold but not hot. \nI went with the cacao drink. You have to try it. Alot of yelpers would agree. \nPrices are decent. They also cater which I might try. We nicas party. \nThe only setback is the decor. Your traditional Latin/Mexican joint with paintings of everything and dey mama. This place went with underwater theme, of course Xmas lights everywhere. My eyes hurt, but my stomach is full.  \nThey get 4 stars 1 minus because of the decor. Im out............", "author": "Y r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-22", "description": "I just ate here last week and it was the 3rd time that I have been to this restaurant. I absolutely love the food here and the friendliness of the staff is excellent!\n\nI usually come here with my girlfriend who is Nicaraguense, and we get a mix of everything....Things like Gallo Pinto, Queso Frito, and of course the always yummy Maduros (Plantains).  The food is so flavorful and you could literally close your eyes and point to the menu and you will get something very tasty.\n\nTo drink, I would recommend getting the Cacao. If you haven't had this before, you should try it. It's like a Cinnamon, vanilla bean, drink served on ice.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-05", "description": "This is the second time I've had Nicaraguan food in a restaurant in the city.  Las Tinajas was the first.  The charm of this place is really vastly underrated with the sailing motif...wait, \"coastal motif\" that is very apparent inside.  The murals are on the walls and ceilings, but who doesn't want to feel like they're in a submarine once in a while?  Besides that, Paola and I had separate plates of food, but in a very traditional style, we both got rice, plantains, squeaky fried cheese, and beans.  I got the bistek empanizado (breaded steak), while Paola got the indio viejo (sp??)---this was a bit on the salty side, but still full of flavor, with big pieces of mint infused.  We both got cacau to drink---thick with cinnamon :)\nIt's worth the trip out to 30th and Mission, but I understand why it can be overlooked.  \nPlenty of seats for big groups and the food came very quickly.", "author": "felix c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-02", "description": "Loved the \"Gran Provencial\" for $25, which has lots of steak, chicken, plantains, yucca, beans and rice, and Nicuraguan cole slaw. It's plenty, and you should split it with a friend. Everything is very authentic (according to my Nicuraguan friends).\n\nThe drinks here are really authentic and delicious. One is called \"Cacao\" and is $3 and is really delicious. I forget the names of the other drinks, but they are all sweet -- one is corn-based and one barley-based.", "author": "Adam Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-26", "description": "As I was eating here this evening I mentally tallied stars:\n\"One for the clean, latin atmosphere and live entertainment.\"\n\"One for the fast and friendly service.\n\"One for the BEST carne asada I've ever had.\"\n\"One for plantains, fried cheese, rice, beans and salad on the side.\"\n\"One for ice cold cheap Nicaraguan beer.\"\nI spoke my revelation aloud: \"Guys, this place gets 5 stars.\"", "author": "Eric S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-19", "description": "Esta Mierda Esta de Acachimba!\nBUT yeah. Love it. Know the owner\nshe is cool. She previously owned Red Balloons over between 24th and 23rd and Mission but sold it to only make a better and improve version of it and its called Oye Managua! is good food but. downside (for me at least) is the portion is small...I'm a big fella so I can be wrong but over all pretty damn close to food in Managua, Nicaragua. Da Motherland for me.", "author": "Nelson F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-12", "description": "Last Saturday we had a college graduation party for my daughter.  What to serve, what to serve?  Cousin raved about Oye!  So rather than doing a Taco Bar (like everyone is doing these days) I decided to pay Oye! a visit and talked to one of the owners, Maria Elena.\n\nWhat a sweet woman! Being 100% Nicaraguense and having grown up on Nica food all my life I knew exactly what I wanted for the party.  So Maria Elena worked with me on the menu.  I ordered Carne Desmenusada (shredded beef), Pollo Asado (grill chicken) with a jalapeño sauce, not terribly spicy but oh so delicious, Maduros Frito (fried sweet plantains), Platano Frito (plantain chips), Queso Frito (fried cheese), Ensalada de Repollo (cabbage salad), Gallo Pinto (rice & beans), and tortillas.\n\nMy guests consisted of Nicaraguenses & Gringos.  The Nicas were in heaven with everything we served.  The Gringos were in ecstasy, some serving themselves twice.  The Carne Desmenusda & the Pollo Asado were such a HIT!!  Everything was absolutely Delicious!!!!\n\nI ordered for 50 people, although I had 65 guests and had leftovers for my family (thank goodness).  All this food for under $500, definitely a lot cheaper than the Taco Bar.  Not to mention that she had a few of the guys help load all of this into my car.  \n\nI am a real foodie and since Nica food is my comfort food and my mother doesn't cook Nicaraguense food anymore I often visit another Nica restaurant whenever in the city.  This will now definitely be my new stop!!", "author": "El L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-06", "description": "the Grilled chicken in Jalapeno sauce is off the hook. It's better than the one I had in Masaya, Nicaragua. The sauce has more kick and the grilled chicken is tender. \n\nThe grilled steak on the other was mediocre but it goes well with their picante sauce. \n\nThe Cacao drink  and Cayolitas drink were pretty good.", "author": "Hebert J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-23", "description": "I love going to Oye Managua.  Especially when we come visit Pops.  I love their gallo pinto.  It has the right consistency.  Kinda crunchy but fluffy.  I hate when the rice in the gallo pinto is sticky or mushy.  Not a problem here.  The cacao is great!  It reminds me of how my grandma use to make it with the molinio (sp).  Also, we always ask for our tajadas sliced extra thin and they always come through.\n\nService could be better.  But that seems to be the theme with my \"peoples\".  It seems that service is slow in any Central American restaurant.", "author": "Karla B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-08", "description": "This place is home cooking all the way!\n\nIn preparation for an upcoming trip to Central America, The Hubs and I went here for late lunch. Aside from us, the only other people in the resto was a group of older men arguing and debating with each other -- which just added to the genuine feeling of this place. It reminded me of being in the Phlippines and having all the 'manongs' sitting around talking shit. :)\n\nI had the oxtail soup (which isn't as adventurous as it seems -- Filipinos use that cut of meat a lot so I've had it at my grandma's) which came with plaintains, rice and cabbage slaw. I loved everything about my dish. Flavorfull, as homecooked as you can get. The Hubs got the fried pork with the fried plantains and the fried cheese. (When it comes to food, he doesn't care about calories -- lucky him!) I had a bite. SO good. \n\nI can't wait to go back and try other dishes on the menu!", "author": "joann p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-16", "description": "This is the closest thing I can find to my family's cooking in San Francisco. LOVE. LOVE. LOVE.", "author": "nicole l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-07", "description": "Probably the most authentic Nicaraguan you can get on the west coast of the US. The decor is kitschy, and you might think twice about going in, but I recommend it: The food is very, very authentic. I had the chancho asado with gallo pinto, queso frito, ensalada, y tajadas maduras (charbroiled & seasoned pork cutlet, rice and bean blend, fried cheese, salad, and fried ripe plantains) with cacao (like horchata, but better) to drink . All the servers were friendly, including the host. We got there early (~ 6:00pm) tonight (Friday), and it was nearly empty, but within 1/2 hour, the place was nearly full. I was pleased to see a variety of folks there, from the \"abuelas y doñas\" to \"gringos\". The portions are rather large, so bring an appetite and forget your diet at home. Fine food at a Fair Price.. my friend and I ate for about $15 each including drink.", "author": "clark i."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-11", "description": "the best NACATAMAL. capers,onions,potato,rice,yerba buena(mint),raisons,etc.etc. NOBODY on this planet can make A tamale like the NICARAGUENSE do. That is why it's not called a tamale. It is called A NACATAMALE. The nicaraguans also can run circles around the menudo soup.  Nicaraguans call it MONDONGO. The Nicaraguans also enrich the sopup  with everything in the book..  Aparently nicaraguans do it better. If you can't handle it eat corn.", "author": "OSEPH E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-17", "description": "My friends are regs to this place and wanted me to try good Nicaraguan food. We all had the carne asada plates. It comes with plantains, gallo pinto, fried cheese. I thought the fried cheese was going to be hella good , but it was a little chewy. I imagined a fried piece of cheese to be crispy on the outside and soft and melty in the middle. \nThe steak was okay and the plantains had no flavor.  I was expecting it to be a little sweeter. The best part of the meal was the gallo pinto.  I love this stuff.  Its just rice and beans, but it tastes so good.  Maybe its the way they cook it.  Gallo pinto is Nicaraguan fried rice I suppose.\nI was going to give this 3.5 stars, but I had to bring it down to 3 stars because of the service.  The guy that was serving us, we call him Grandpa cause he just looks it, he forgot a lot of stuff.  My friend Jorge was like watch this he's going to forget my sprite.  What do you know he did.  Then we asked for the bill.  Jorge said watch this, he's going to forget our bill the next time he comes out.  And guess what happened, he forgot the next three times he came out.  We had a good laugh about it, I can't stay mad at Grandpa.", "author": "Henrick R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-08", "description": "I really enjoyed my experience at this place. I trusted my friend Huevos with this recommendation since he's nicaraguan and I have never had nicaraguan food. The Nacatamale is AMAZING to say the least. It was $5 and very filling and even came with a toasted Iron King Bread. The Brisket was also pretty good and the Plantain was AWESOME. I also love the Yucca too. In terms of the drink I loved the Cacao so much that I had to order two. I didn't even mind paying extra for another one since there was no free refill. \nThe only reason why this place was not a perfect 5 stars was because the service was pretty slow. It took quite a while to get food though the owner and the workers were really nice. I definitely want to come back to this place again.", "author": "Nir B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-27", "description": "Love this place. This is real Nicaraguan food. It's just like eating at home. I've tried other Nicaraguan restaurants and I will never go back to them. This place does give good service, and portions are good. My favorite is the maduro and ceso frito. 8)~ YUUUMMM!!!! ....Nacatamales ARE WAY BETTER than MEXICAN TAMALES.", "author": "S C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-28", "description": "The food is as good as the corner Fritangas' back in the homeland. El vigoron, el indio viejo and like everyone else commented the Nacatamales. Enjoy every thing with a Toña in your hand and you'll be transported to the land of lakes and volcanoes, and really amazing food.", "author": "Lester L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-22", "description": "Outstanding meal at oye managua today!!! The especial maria elena was delicious...carne asada, chancho asado, queso frito, gallo pinto, ensalada y una cervecita nicoya...toña!!! ay que rico!!", "author": "Bane V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-10", "description": "This place is really really good.  Its like soul food-Nicoya style.  Its the kinda food where you feel like your in a coma after because there was so much and it was so good-kinda like Thanksgiving dinner.  I had the nacatamale thinking it would be just like a regular tamale-no no no.  This was like a tamale on hormones-the thing basically had all the contents of a full meal stuffed in it, I could barely eat half of it.  My boyfriend had some kinda steak dish that was really good and his mom had the chicken soup which was delicious.  And the sides are soooo good, fried plantains and fried cheese.  Definitely not diet food, so if your watching what you eat, go somewhere else.", "author": "Renee S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-08", "description": "I liked this restaurant.  We ordered corn drink (you must try it) as well as breaded beef and charbroiled chicken.  They were both very good. Service was very good.", "author": "vadim m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-30", "description": "Great place, super-friendly service, and they even gave me a sample of the coyolito drink, just because I asked what it was. We had the chancho with plantains & fried cheese, and the same with yucca and cabbage, and it was delicious. We mistakenly ordered a nacatamal as an appetizer, and ended up having 3 mains. Desserts sounded most interesting, but we'd eaten too much already. Definitely going back.", "author": "Chris K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-31", "description": "Worst food I've ever had in my life and worse service. I can't even believe that some people would actually rate this as good food. I've had better food than this before. Waste of my Money and way to over priced for crap.", "author": "Ana H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-01", "description": "This place exceeded my expectations, I have never tried Nicaraguan food before so I do not know if this is 100% authentic, but Oye! Managua was delicious. The decor is a bit cheesy but you will complelety forget yoy surroundings once you dig in, I ordered the chicken with fried cheese, beans, plantains and a salad. It is a LOT of food so go when you are really hungry and can stuff your face.", "author": "Sadie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-15", "description": "Brother in law brought us here. He's all kinds of nicoya mixed with russian jews, and who knows what else. But he had been coming here since he was a child... or at least had know the owner since then. Three stars for a few reasons. \n\n1. The giant painted killer whales on the ceiling. No idea, but I like them. \n2. The fact that some one decided to write Nemo on the paintings of clown fish on the bathroom \n3. The scary ass lady at the bar, who was either giving the evil eye, the a very drunk come hither eye. Either way, it kind of ruined my meal. \n4. The meal itself wasn't all that bad. Large portions, but my carne asada was well done, and they didn't give me an option... eating meat well done... well there really isn't any reason to eat meat if it's well done. You might as well become a vegetarian. \n5. White people walked in. For being such a mom and pop kinda place I wouldn't really expect to see them here. but then again I have been known to show up to michelin star restaurants.\n6. Live, kinda cheesy, keyboard playing musicians. I actually liked it. I liked it a lot more than having mariachi bands singing to you in taquerias and restaurants.\n7. I like it, but I wouldn't come here again on my own. It would have to be suggested by the brother in-;aw or his family fam.", "author": "danny e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-11", "description": "Love this place...NOT the decor but the food makes up for the tacky deco. There cacao drink is the best. (Cacao is like horchata but better because it has a stong choocolate flavor). I usually get the combination plate which has grilled jumbo shrimp, white rice, black beans, cabbage salad, and the fried cheese...love that fried cheese. I also like their salpicon dish. All the dishes I have tried have been very tasty.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-11", "description": "I really enjoyed the  food and the atmosphere at this place.  The atmosphere was like a Nicaraguan social club.  Everyone seemed to know everyone, but newcomers are welcome.  This was my first try at Nicaraguan food and I loved it. I'm not a big fan of plantains and I even like those.", "author": "Robert O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-25", "description": "Went there for a girlfriend's b-day on a Saturday evening with a large group.  The food was phenomenal!  I think we ordered the majority of plates on the menu and they were each fantastic!  There was live music which really added to the ambiance ....alegre!", "author": "Monica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-26", "description": "As part of a homework project to try Nicaraguan food, we came here with 13 year olds and we weren't sure what to expect.  We ended up having a fantastic evening. We arrived at 5 on a Sunday night, and the place was packed!  We had to wait a bit for our table, but the waiter could not have been nicer.  We had drinks while we waited and looked over the menu.  Once we were seated, we ordered family style, and shared the platters (portions are WAY generous), including the special, a delicious Valencia rice (like a Nicaraguan paella).  During our several hours there, we were entertained by a mariachi band, a keyboardist/singer, and a duet.  The crowd is there for music, so if you are there to talk or chat, you're in the wrong place.  Several men at the table next to ours got up to dance, and my 13 year old son joined them.  They could not have been more welcoming, or gracious.  Oye Managua is a very local, authentic, family friendly restaurant, and I'd recommend it to anyone curious about Nicaraguan cuisine or culture.", "author": "Christine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-30", "description": "I Love this place! My first time here and having Nicaraguense food! The food is so good and the people here are so sweet! I enjoyed the Live music too :) Very fun times!", "author": "Johana R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-27", "description": "We ate there after work one day last week and the food was so awesome we asked them to cater our housewarming party this weekend.  It was a major hit.  We got the Indio Viejo, Pollo Asada, and Nacatomales, Pinto de Gallo, plaintains and fried cheese.  We plan to go back, again and again and again.", "author": "Aurora H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-30", "description": "Went here for the first time last night and we loved it!  The food was really good and the service was amazing.  Christopher was our server and we thought he was incredibly helpful and fun.  My the time we were done with our meal, we felt as if we had become friends and family with everyone there.  It was a really great experience.  I recommend you try it.", "author": "sonya g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-09", "description": "I went here on a fluke. I am a BIG fan of Red Balon so for Nicoya food I normally go there or Las Tinajas(if they are open). I ordered a Nac and my nephew ordered the carne encebollada. Our food was brought to us right away! This was definitely a first for this type of restaurant. I was prepared to have to wait a while, but this was not the case. The taste of the food was excellent. The beans were so good! My Nac was delicious! The prices were not bad either, the place is clean and good music was playing too. I am definitely going back.", "author": "Carmen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "This place is about 20 feet from my door! Been here twice now and its so cute. I love the ocean theme and the crowd. At nighttime they have a dude who plays keyboards and sings his heart out. The first time I got the Camarones Rancheros and they were delicious--HUGE shrimps that you have to dismember to put inside your mouth along with rice and beans and a side salad. Today I went for lunch and I got huevos with gallo pinto with a side of ripe plantains, and boyfriend got the chicken and albondigas soup. The huevos and gallo pinto were only $6 which is a steal and very filling. They put onions and peppers in the eggs but served no hot sauce. The plantains came with fried cheese, their specialty. It sat nicely in my tummy and didn't weigh me down and the price was RIGHT. The broth of the soup, especially with rice in it, was comforting and very savory. I have no plans to cut this place outta my life.", "author": "Laura M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-28", "description": "The food here always reminds me of my grandma. She could cook way better ofcourse, but they try. The cacao is excellent, and nothing beats there steak with onions plate. They serve up big portions so come here hungry, cuz you'll leave full!", "author": "Sleep E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-11", "description": "I've never had Nicaraguan food before. I can barely even say 'Nicaraguan' w/out repeating it again.  Anyway onto my review.   It looks like the owner commissioned my 9 yr old nephew to paint the walls (and ceiling) with scenes from Disney's Little Mermaid on it.  And the \"professional\" paintings lit w/ special lamps were beyond tacky.  The service was SLOOOOOOOOOOOOOOOOOOOOW.  From taking the orders to getting something down on our table was painfully slow.  BUT, when the food finally arrived and I took my first bite, I forgot all about the long wait.  The naca tamale was nothing like mexican tamales, which I don't really care for.  The naca tamale was really tender, flavorful from the spices, sausage, veggies, etc.   DA BOMB.   Not to mention it was $5 and huge...i would approximate it to weight 3lbs.  The fried plantains were really good too.  Despite the bad service, I'd come here again!", "author": "LT B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-29", "description": "Was in town visiting and thought I'd hit up a local Nicaraguan restaurant that got great reveiws here on Yelp. I am extremely disappointed in the service and the food. When we got there, we waited for about 15 minutes before the waiter even came to take our drink order. We ordered water and got a pitcher of water for our table to pour ourselves. Sitting right on top of the water was a yellow piece of....something, I don't know what, but it was gross. How did the waiter not see it?? Sorry, but we weren't going to drink that. Then we ordered our food. The serving sizes were large, but the food was about the worst I've ever tasted. The steak was extremely bland. The gallo pinto was hard...probably refried...and then refried again and again and again. Pretty much everything that our whole party ordered was tasteless and bland. After we were done eating, we had to wait another 15 minutes or so (keep in mind, the restaurant was empty) for the waiter to come back to our table for us to even ask for the check. With 5 entrees ordered, our total came to a little over $100. Definitely will never go back to this place when I'm in town. I'll stick to my favorite Nicaraguan restaurant in Los Angeles instead.", "author": "Kam S."}
