{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "Best sushi in the Outer Richmond! I've lived in the outer Richmond for around 10 years and I always driven across Park Presidio to get good sushi. You have no idea how excited I am that I found Oyogu, only a 10 minute walk to this amazing spot located on Balboa!!!!", "author": "Elizabeth M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-04", "description": "Mediocre sushi.  Bento box was meh, can't complain but it wasn't amazing.  The Cucumber sashimi sushi was overly salty.  The cucumber was thick and there were very few pieces of sashimi.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "The ginger is perfect - spicy and just the right texture. I had the Alaskan Roll, And Volcano Roll - both were delicious. Service is great- definitely a gem in the area.", "author": "Cara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Sometimes it's quite weird that we don't try places that are so close to us..... This sushi restaurant has been around since last year and just last night I decided to order from there because I was craving some good sushi and wanted something quick. \n\nIt was truly hard to choose what items I wanted to try since every picture on Yelp looked amazing. I decided to go with things that I'd get at any sushi place and also a popular menu item that everyone recommended. \n\nI can't even begin to describe how fresh the fish was and how HUGE of a portion each sushi roll was. I wasn't expecting it whatsoever. \n\nMy order contained the following items: \n\n- Salmon Skin Roll (CRUNCHIEST salmon skin!!! I've never tried anything better. The addition of freshly cut veggies is the perfect paiaddition to this roll) \n- Philadelphia Roll (Soft smoked salmon with cream cheese and freshly cut avocado. Melt in your mouth kind of sushi roll) \n- #4036 Roll (One word... Amazingness!! So many things inside of one sushi roll and the flavor is out of this world) \n- Agadashi Tofu (Lightly battered outside with a soft and well prepared tofu inside)- Sweet tempura sauce on the side.\n\nBonus! ---- Free Delivery & On the house California roll when ordering over a certain amount! \n\nI'm so happy that I finally tried this place out because I've been missing out. I'll be coming here in- person very very soon.", "author": "Julia K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-25", "description": "Preface: We've ordered takeout from here two now three times and the first two were great! Yummy bento boxes and pretty decent sushi.\n\nWe ordered takeout tonight and my boyfriend found a gnarly legged bug dead in his salad. \n\nA creepy crawly nasty bug! \n\nIt was disgusting and we both lost our appetites. When we called the restaurant to tell them our find, no one understood there was a bug/roach/insect in our salad. I got passed to three people and asked for a refund, no idea if they understood just how gross this is. \n\nWe will not be ordering again ever.", "author": "Larissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "After reading the bad reviews about the food I was a little bit doubtful about this place but due to lack of other options we decided to try it out. The food was actually really good. We ordered unagi Don and beef ramen. Both were delicious and very well presented. The waitress was also very nice and helpful. Overall our experience was great. I would definitely come back", "author": "Norbert N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Delicious! Excellent pricing and really good veggie rolls! Solid menu. I live in Redwood City and the place by me charged a ton more for veggie rolls so this is amazing being in the city.  Loved the veggie dragon. :)\n\nMy boyfriend enjoyed his regular sushi and nigiri as well.", "author": "Monica J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-25", "description": "Nice neighborhood spot for some decent sushi. The hamachi sashimi is quite good and some of the rolls too. The special rolls are quite big so be careful to not overorder! I quite liked the rainbow roll but less so the veggie dragon roll (too sweet) and salmon skin roll (too crunchy).\n\nThe agedashi tofu was also quite good. The tofu was very smooth and creamy. \n\nOur waitress was a gem. On top of things and friendy!", "author": "Ada C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-02", "description": "DO NOT GO HERE. \nBasically 2 star food with 1 star service. After reading more reviews, post dinner, they have multiple posts with bugs/cockroaches/insects/hair in their food. \n\nWe came here yesterday on a cold, rainy Thursday night because the other sushi spot a few blocks away was packed and had a waiting list. That should have been our first sign since this one was relatively empty. \n\nOur order: \n1 glass of sauvignon blanc\n1 grilled whole squid\n1 bento box dinner\n1 Nabeyaki udon\n\nThe wine came first and it was served warm - how that can happen on the coldest day in SF, I do not know. When I asked our server, she replied that they didn't remember to put it in the refrigerator. Most places would have told you BEFORE they served you and offered to take the wine off the bill. Instead we had to tell her that it was undrinkable and to take it back. \n\nMy dining companion's bento box came second. It had a tiny piece of grilled mackerel that was almost burnt to ashes. The salad, which is basically lettuce and two cherry tomatoes, comes drenched in disgusting mayo dressing (also mentioned in other reviews). The miso soup was lukewarm and extremely salty. The salmon cut roll and the mixed tempura were the only decent items. \n\nWe shared the bento box since none of the other food came and finished the entire bento before anything else showed up at the table. We asked about the udon and the squid, and the server said said yes, it's coming shortly. At this point, she should informed us ahead of time or made some sort of other accommodation. When two people dine out, they expect to eat at the same time, not share one person's meal and then wait for the next person's meal. \n\nThe udon finally comes, and still no sign of the grilled whole squid. The Nabeyaki udon is basically a \"throw whatever we have into the pot.\" In any Japanese restaurant, Nabeyaki udon typically has spinach, mushrooms, fish cake, egg, and chicken. This one had: two big chunks of carrot, two big chunks of zucchini, two florets of broccoli, teriyaki chicken, tempura shrimp, and a rubbery boiled egg (they were trying to do a soft boiled egg, but you need to do this in the shell and then peel it and add it to the soup, not crack the egg into the soup and overcook the white part of the egg). It was obvious, they used the same ingredients as what they have in the tempura. \n\nWe eat the udon, and when we're almost finished with our udon, our appetizer finally comes. I would have canceled the squid when we had asked about it earlier but they said it was coming soon. This was a lie. We ate a couple of pieces of the squid, and guess what? It was like rubber! Overcooked. We left almost the entire thing on the table and refused a take home box. \n\nThank you for wasting $50. You have lost a potential returning customer.", "author": "Patricia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "My neighborhood sushi spot. Service is solid and the sushi is good. It is a value spot.\n\nApparently Yelp doesn't like my short review and wants me to write more BS. As though you care about my opinion.", "author": "Eron L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-14", "description": "DON'T:\n- Tell me that my takeout order will be ready in 20 minutes, then when I show up in 20 minutes to pick up my order, make me wait another 15 minutes for my goddamn takeout order.\n\nDO:\n- Tell me to pick up my order in 35 minutes instead of making me waste my goddamn time.", "author": "Don V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "My stomach wasn't feeling well so I took the gamble and ordered the Ramen. It did not disappoint, the broth was good, noodles were bouncy and I usually don't care for the pork but it was tasted as if rhe chef spent hours marinating it! \n\nThe waitress does not know the definition of personal space. I don't want to mention any names but she was a little too much.. she was trying way too hard. Girl.. I don't know you. Stop being so personal with us. Like can you leave us alone and let us eat?!?!", "author": "Annie Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-02", "description": "We used to like this place for delivery through Eat24. Key words \"used to\" as in past tense and no more. Historically, they used to be reliable on timely deliveries and solid but nothing special in terms of the food quality. Now the delivery estimates mean nothing other than you will be starving and need to follow up multiple times with Eat24/grubhub before your food will be there \"shortly\". It was over an hour late and Eat24/grubhub said they're is nothing they can do for me and that they aren't responsible for delivery times. Wait, what? \n\nYes, a delivery service said they're not responsible for deliveries... then why should we use your services and line your pockets with cash? \n\nEat24 has gone to hell operated by grubhub. By the way, if you order through yelp, it's operated by grubhub but grubhub pays a fee to yelp. I encourage you to order through yelp until August 2022 if you're ordering from a grubhub affiliate. Better yet, find a non-gruubhub affiliated service that cares about their customers!", "author": "S C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-05", "description": "Came here on a week day and they were nearly empty at lunch time. Friend and I shared a bento and the nigiri combo which came with five pieces of nigiri and a roll. For the 3 item bento, I got chicken katsu, chicken teriyaki, and shrimp tempura. The chicken was acceptable, but the salad was not. The salad was drenched in mayo dressing and looked terrible. The roll tasted weird as well. There were carrots in it. The nigiri was not too bad. \n\nService was friendly, but food presentation, especially for the bento is lacking. \n\nPretty sure some of the early reviews were fake, which is why they have been marked by yelp as not recommended.", "author": "Christina G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-25", "description": "Sushi place run by Chinese. The quality isn't great but the price is cheap. (You only pay for what you get, I guess?) It's somewhere between a conveyor belt sushi shop and a legit sushi restaurant basically.\n\nI had the Chirashi and think it's acceptable.", "author": "Joseph L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "Not too crowded and their food is very neatly crafted! Very friendly staff as well. Priced very fair. Will come again!", "author": "Jay M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "Still excellent. Forgot to mention that service is superb! The servers always greet you with a smile and are attentive.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "Oyogu has great sushi and very good service! It's a wonderful neighborhood spot. My husband and I come here regularly since we live a few blocks away. The quality of fish is good. Is it a Michelin Star chef restaurant?\nNo, but it's very good, and usually not too crowded so you don't have to wait in line like some of the more hipster places.  The specials are always good. Portions are not skimpy and we have never had bad service.\nDefinitely recommend Oyogu, especially if you live in the outer Richmond.", "author": "Marie Joie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-25", "description": "ROACH\n\nI ordered a 3 piece Bento box, with Salmon Teriyaki, Gyoza, and Sushi.\nI was eating the salad that came with it and was almost finished when I found a hair. I pulled on it and it was attached to a dark thing resembling a raisin. I looked closer and it was a cockroach on its back, drowned in salad dressing.\n\nCalling the restaurant, no one understood the words bug, cockroach, or insect in English, and as a result the problem didn't sink in the other side. \"What do you expect me to do about it?\" was the response. As of right now, it's up in the air if a refund is actually coming.\n\nThis place needs an updated Health Inspection score.\nDon't eat the salad.", "author": "Tim T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "Wow!!!!! This place was a pleasant surprise . Much much  better than the old establishment . \n\nNigiri Bonus \nSalmon skin hand roll \nThe \"Roll.\" \n\nAll the above was super fresh and delicious. \n\nWill definitely visit again", "author": "Joe L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "Food = great. \n\nAgedashi tofu = the best.  3 giant blocks of silken tofu in one of the best broth/sauce I've ever had.  He didn't want any...his loss, and totally my gain.  $5.50 (minus 15% off during HH)\n\nPork gyoza = okay. $6.95 (minus 15% off during HH)\n\nHamachi kama (yellowtail cheek/collar)= awesome. Another item that I was excited and satisfied with. $11.95 (minus 15% off during HH)\n\nDeep fried oysters = excellent. Crunchy breading but not too heavy. 4 pieces. $5.00 (specialty item)\n\nFire dragon roll (cucumber and shrimp tempura topped with spicy tuna, avocado and tobiko) = His top favorite.  It was pretty good. $12.95\n\nSpicy scallop hand roll = the best. Sweet scallop, spicy sauce, and delicious seaweed. I could've eaten 3 more of these. $7.95\n\nVolcano roll (crunchy salmon skin and mixed vegetables) = My least favorite roll. Partially due to my expectations of what the volcano roll would be, and it was sort of dry. $5.95\n\nTempura roll (shrimp tempura, cucumber and tobiko) = He liked it. $6.95\n\nDragon roll (shrimp tempura and cucumber topped with eel, avocado, scallions, tobiko and eel sauce) =  I wanted it for the eel but should've paid attention to his order of the fire dragon roll. Oops. $12.95\n\nSho chiku bai nigori (375 ml) = $12.00 (minus 15% off during HH)\n\nService = friendly and attentive.\n\nPrices = reasonable to moderate. 15% off beer and sake and appetizers during Happy Hour which is great. Dinner for two with leftovers came out to $89.72. Should've stopped with two appetizers and skipped one specialty roll. \n\nHappy Hour = Sunday to Thursday from 5 to 6:30 p.m.; 15% off appetizers and beer and wine (on their printed menu).  \n\nFYI: They have dinner hours every day, and lunch hours on the weekends only. \n\nWe're definitely coming back here.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "I love this place. This place is run by two young man that have been working in the Japanese cuisine for more than a decade. Price is very reasonable and place is always clean. \n kitchen food is good, their rolls are delicious and well presented.   Sashimi is always fresh. Don't forget to order their seasonal sashimi if you are a sashimi lover.", "author": "missy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-16", "description": "New restaurant but they use to be a Japanese restaurant. The menu seems old school. Pretty expensive for mediocre sushi. Service is below par. They brought tea but wouldn't see that we'd finish the wasabi or ginger. Meh, wouldn't come back but that's just me.", "author": "Wanster L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "Quality of sushi, teriyaki chicken, Katsu don, tempura, and especially the salmon was better than many deliveries. Only miss was the karaage batter, but it was takeout/delivery.   Came on time.", "author": "Gale H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "Oyogu is my go to bento/sushi spot in Outer Richmond.  Even after moving out of the city my wife and I find ourselves craving this location.  We love getting the spicy scallop roll, negi hama and assorted nigiri.  The fish is fresh and good rice/fish ratios on their rolls/nigiri.", "author": "Eddy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "We found this place on Yelp, which has pretty good reviews.  We were really craving sushi and it was relatively close in proximity. \n\nWe ordered the following:\nSmoked sake - This was really good, but I think a bit novel considering the price.  The smoked flavor wasn't very strong, but the key to utilizing the Himalayan salt block is to leave the salmon on there for some time.  I still preferred dipping my sake in soy sauce, but to each their own.\nUnagi hand roll - The price is a bit much for this and it was a bit lackluster.  I would probably not order this again.\nSpicy scallop hand roll - This roll was packed with so much scallop and it was delicious! The scallop was sweet and creamy.  I would definitely order this again.\nR&J roll (hamachi, salmon, shrimp tempura w/ unagi sauce) - I don't typically like hamachi, but the man friend does, so we got it.  The hamachi was a little fishy, but I couldn't tell (apparently man friend is a hamachi connoisseur)? The roll itself was good with good flavor profile and textures with the sweet unagi sauce, buttery salmon and crunchy shrimp tempura!\nBento box w/ spicy tuna roll, mixed tempura and chicken katsu - I was most impressed with the presentation of the bento box.  It was probably the best looking bento I've ever seen! Everything in it was delicious to boot! 5 stars here.\n\nI would definitely be coming back, but will order our favorites.\n\nBon appetit!", "author": "Colleen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-05", "description": "Good food, but extremely slow service for take out.  Also, when someone asks a customer to go on hold, the phone should probably actually go \"on hold\" instead of having a customer listen to interactions with other customers for long periods of time.  Also, saying \"can you call back\" also might be more polite and efficient.", "author": "Lori C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-12", "description": "My neighborhood spot within walking in distance.  They offer a pretty standard menu considering SF with some house specialties but been to so countless Japanese sushi bar, Izakayas, Ramen house... the offering seems erringly similar.  At first glance, the price is in the middle of the pack, but I typically avoid those discount prices because in most cases you get what you paid for.  I've been here several time mainly because I find the fishes to be decently fresh and the quality, portion size and presentation is good, in the middle to slightly upper in the Richmond District. \n\nI've ordered Sashimi (good size slices), tempura (fluffy-crispy with good varietal veggie), nigiri (good bite size, rice ratio), rolls (fair amount of fillings good rice), ramen (slighly over-flavored), beef teriyaki (decent quality of meat).  All in all the presentation are good, the place is clean, the decor is standard and roomy.  Again, for this price point, it's pretty good, close to 4* for food. \n\nThe service can be better because they seem to be a bit dis-organized each time I've been there.  Either the wait-staff is in-capable to see the needs of customer (slow to get wasabi, napkin, no soup...) or overwhelmed and understaffed (unable to attend) or Sushi Chef don't take order at sushi bar (customer leaving without order) or sushi chef pissed of and fighting with kitchen staff  etc...  It just seem the owners are young and don't possess leadership quality understanding what it means to offer HOSPITALITY, which in my opinion is an art.  With that being said, the negatives don't happen all at once, and I go back because they do try and make effort.  The reality is about a 3* for service.\n\nI really hope they can do better, they have potential to be one of the better place if they can fine-tune their operation.  They resonate with me well with the fore-mentioned positives balancing food, decor as a Japanese staple.  Service needs to improve.  Parking is poor. Perhaps it explains why they are not too busy each time I've been there.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "We order from this place at least once a week since we live a few blocks away. Great quality sushi and nice service. So glad there is a top notch establishment in the neighborhood that is low on frills but high on value and quality. Our favorites are the rainbow roll, dragon roll, R&J as well as the #4036. The maguro and unagi nigiri are also in the usual rotation. Yum! I'm waiting for my delivery as I type! \n\nHope more people get hooked so that they stay in business. Our family would be crushed if it closed and we had to find a replacement sushi joint that delivers. I used to hit up Daigo sushi when I lived closer to the inner Richmond but alas - the outer Richmond has fewer sushi options.", "author": "Stacy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "This is my second time ordering and I'm a fan. Enough of a fan to Yelp and order again! \n\nI ordered from here because my usual mainstay was closed for Thanksgiving week (Tazaki). It was close and open and though I'd give it a try.  My first order was dinner, I had one of their special rolls called R and J roll. Then I ordered tamago, Inari, and Hamachi Nigiri sushi - the orders come with 2 pieces of fish. Perfect portion sizes and I had enough for breakfast! (Fish still tasted delicious). \n\nI didn't think the sauce overpowered the flavor of the fish as one commenter on here said. However this was a take out order so maybe they added less. \nVery friendly too when I went to pick up, definite plus. \n\n____________________\n\nI just had my second take out order from them, the Lunch bento with 3 options. This is what I would call my ideal order. First impression was, \"wow a lot of food!\". \nThen I opened the top and the smell was amazing. One of the best smells in the world is fresh sushi. Yum! Service on pickup was again very friendly. I'll let the photo I've added do the talking.", "author": "Koa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "I'm always trying new sushi places.  I spend a few months in Japan every year so I'm a little picky.  And I mostly eat sashimi, so I can't speak to the quality of the rice.\n\nI got maguro, sake, and shiro maguro.  The maguro was a little crunchy but deep red and delicious.  The sake and shiro maguro were amazing.\n\nThe prices were a bit higher than Wild Sushi, but the free salad was wakame which I love.  Definitely a quality sushi experience.", "author": "Joey Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "We've eaten here three times over the past weeks. The first time we thought it was pretty good, the second time better, and last night, our dinner was truly outstanding. Fresh nigiri included a melt-in-your mouth butterfish, hamachi belly, and a smoky baby lobster tail my husband was getting rhapsodic over. We also had a vegetable gyoza appetizer that was lighter and filled with a more interesting combination of vegetables than you get at most Japanese restaurants. A vegetarian caterpillar roll balanced out the meal very nicely and made sure we felt full but not stuffed. I asked the waitress for a recommendation for a cold sake, and after asking about our tastes, she recommended the Kikusui Junmai Ginjo, which turned out to be perfect, not to sweet but not extremely dry either.\n\nService was very friendly, efficient and attentive, and the atmosphere is pleasant. We live in the neighborhood, so we are very happy to finally have an excellent Japanese place back in walking distance and will most certainly return many times.\n\nThey are still in their \"new\" phase, and while word-of-mouth and guests are starting to trickle in, they are not yet overwhelmed with business -- but I have no doubt they will fill up soon. For now, however, the place is quite serene, even on a Friday night, which is why I find my credulence strained by reviews claiming someone waited for over an hour for their dinner and saw hungry patrons storming out ... Best judge for yourself.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-09", "description": "This place is pretty good if you're in the area. I ordered the ramen and was very full and satisfied. Great variety of foods offered on the menu. I had a friend who just ordered rolls, one wanted a bento box, and the rest of us enjoyed the ramen.", "author": "Juliana P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "We came here for dinner because we had a Groupon coupon. The restaurant was almost at capacity but we were able to snag a table. Ordered lion king roll which was excellent. \n\nWe had the three item bento. The Katsu was fried perfectly. So was the tempura. Loved the gyoza. \n\nService was very attentive. They refilled our tea without asking. They even told us the status of our order because the kitchen was backed up due to a big party in the rear of the restaurant. \n\nThey made mini sushi for our kids - on the house. \n\nWill definitely come back. A great Japanese restaurant in the hood!", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "Family friendly... They made a tiny roll (on the house) for our baby!\nWill definitely be back.", "author": "m k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "Really nice selection of fish on the 'fresh board' and excellent quality of cut and freshness.  \nBeen sitting and eating sushi at sushi bars since I was 2 years old, and am now 37, and I was thoroughly impressed. \nI would recommend this place to anyone who wants beautifully prepared, too quality fish.", "author": "J A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "Fresh!  Not skimpy on portions, not too expensive, really friendly staff.  Some of the better sushi I've had since leaving Asia.  So happy to be within walking distance :)", "author": "Nate S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-16", "description": "Oyogu Sushi is where the fab Yu Zen was years ago. seatings same. colour tone is brownish all around. only decor is framed pic of a Chinese Calligraphy script. \n\nmusic: pop, jazz, etc. flatscreen behind sushi bar.\n\n.eats: \"sashimi lunch\" (18.95) 10 pieces, chef's choice\n-2 large thick pieces each of albacore, tuna, hamachi, salmon, tako\nmostly slightly tasted cold, not so fresh tasting\n-wasabi with screwy grooves looked like tube kind.\n-miso soup watery, bland, tasteless\n-iceberg lettuce with dressing best part of meal.\n*could have ordered chirashi don (16.95,) 8 pieces over sushi rice\n2,5 stars for low quality fish, overpriced poor value\n\ntemaki:\n-waitress was teenager? in bluejeans\n-only 1 reviewer has more than 10, only 1 has more than 10 friends.\nmajority 5 stars\n-\"soft opening\", nothing special, no specials. no 10% discount like others mention..\n-pricey menu, nothing beyond the usual nigiri, rolls, apps, bento boxes...\n-first time seen a teacup(upside down)used a prop to hold sashimi.\n-mandarin spoken in the kitchen...", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "I love Sushi, especially the Lion King roll and Hawaiian Kampachi. I ordered them and I was not disappointed. They taste great. The Lion King is fantastic. It is not dry and easy to chew. Also, the appearance looks beautiful which wakes up my taste buds by just looking at them. There is one more thing I want to highlight: the service. They are fast and very friendly.\n\nThe entire restaurant is warm and quiet. It is a perfect fit for a family reunion/friend reunion. Besides sushi, they also provide wine and beer. A drink with sushi is a fine match. The chef told me they are now doing GROUPON and EAT 24. The discount is up to 40%. I and my friend bought one. I will definitely come again. I hope and believe this new restaurant will do amazing!", "author": "Liana Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "This is my favorite sushi in SF. No frills but the fish is amazingly fresh and the rolls are delicious. The staff is also very friendly. We love getting delivery from here but it's a treat to do sushi and a movie too!", "author": "BJ S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-19", "description": "Fresh and tasty sushi - I've only had delivery and they are on time (or early) and always deliver some amazing nigiri and rolls.  My new fav sushi delivery in the Richmond Dist.", "author": "Kim W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-10", "description": "I tried this place three times. Three. Every time we came in was after 6 but the restaurant was never more than half full. \n\nThe sushi chefs are doing their best and are efficient and friendly. But the mediocre sushi and amateur waiting staff have left me with a terrible taste. The last time I was here the kitchen chef even yelled at the servers after slamming on the bell in the kitchen several times. I think that the to go orders and delivery overwhelm the staff, and distract them from providing courteous service to customers in the restaurant. Even on a slow night we waited for over 40 minutes for a teriyaki entree and two orders of miso soup (we had to ask for it and we're given attitude). \n\nPlease take the time to train staff on being courteous, attentive, how to prioritize service tasks and follow through. \n\nMiki isn't far away if you're looking for an alternative, but they are closed on Sundays and Monday's.", "author": "Licette M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "This is our favorite go-to neighborhood sushi restaurant - we are here at least once a week! The sushi is very fresh, huge portions, with delicious special rolls like the R&J roll and #4036 roll, but also great traditional sushi. The bento box comes with generous options and the ramen, chirashi sushi, donburi, hamachi kama, and tempura are amazing as well.\n\nKid-friendly, quick service, and fresh fish - you can't go wrong by coming here.", "author": "Tina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "I was looking for a sushi place to go in the neighborhood of my in-law and found this newly opened one. Decided to give it a try since it has some positive reviews.  I am glad we did coz it becomes our All-Time-Favorite sushi place now. \n\nEasy find free parking, decent environment/atmosphere. The impressive parts are the food and service they provided. \n\nWe ordered the Oyogu roll, Albacore Tataki, salmon sashimi, dragon and caterpillar roll.  From the present of the dishes, you can tell the chef had really put quite some effort on them coz they look good. The sashimi tasted fresh and the special sauce was delicious.  The chef also made some cute mini sushi for my 2-yr old son and he love it.  \n\nBeside the good food and the affordable price, what I love the most here is the service and the friendly smile of everyone.  The chef even treated us two shot of their best Japanese rice wine at the end to congrat us for our unborn baby girl.", "author": "Hong Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "Woooow such a amazing place in Balboa St。\nThe sushi here was fantastic,you have many choice of the roll, highly recommend the chef sashimi ,they use amberjack scallop salmon etc. The staff was very friendly.", "author": "Sincere H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "Oyogu sushi unfortunately did not serve swimmingly living fish, but fresh none the less\n\nThe staff is nice even if the service is a bit slow. There are lots of pickups from yelp so maybe that's the real money maker for this sushi shop.\n\nI also ordered the takoyaki and it's pretty tasty.", "author": "Ryuta O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Great atmosphere. Wonderful Christmas Eve service. Rolls prepared fresh while you wait.", "author": "Stacy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "Can't believe it! Super fresh delivery sushi - finally! Every other sushi place I've eaten at that has decent sushi in the restaurant has terrible delivery sushi but this was actually delicious. I ordered a bunch of nigiri and a tuna roll. \n\nAlso so great to find a spot that takes the health rating seriously. Eat here, people! A bunch of the other sushi restaurants in town have vermin infestations - check the health rating and reward places like this that take handling food and the health of their customers seriously.", "author": "Emma M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "Great spot to have in the neighborhood! Went by there at 8:30pm and had the spoon taster, sake (a little pricey but good), 3 rolls and seaweed salad - it all tasted fresh.", "author": "Chrstn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "We order from this place at least once a week. Very solid and reliable with reasonable prices. Great veggie rolls! Usually great deliver times.", "author": "Lauren T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-13", "description": "I've been a lurker on Yelp for years, but the performance of this place forces me to leave a review to tell the world how AWFUL this place is. I have NEVER walked out of a restaurant after eating one small order before. We miss Yu Zen dearly after this experience. ):\n\nDate & seating time: 9/11/16 @ 6:50pm\nPartner in crime: The boyfriend\nFood ordered: Ankimo, R&G Roll, and Assorted Sashimi\nFood received: R&G Roll\n\nWait what?\n\nService (or the lack of): The waitress serving us was utterly useless. I asked her what the difference was between the assorted sashimi & the seasonal sashimi since the menu had no description differentiating the two besides the price. She just pointed at the billboard near the sushi counter, listing out their freshest catch. That doesn't tell me what the difference is.\n\nShe tried to list out the types of cuts I will get for the seasonal sashimi, but fail to answer the question once again. It was a basic question, but she couldn't seem to understand what I was asking, so I gave up and told her I'll just go with the latter.\n\nOnly the R&G Roll was served, because 10 minutes later, the chef pops up to inform us that they ran out of Ankimo. Is there a miscommunication between the chefs and waitresses here? He asked if there was anything else we wanted, but we were not interested.\n\nAnother period of time went by, but there was no sashimi in sight. The waitress came over and asked if we wanted anything else. That question confused me, because we still didn't receive our assorted sashimi yet. Then she responded back, \"What? You ordered it?\" -facepalm- \n\nFinal Verdict:\nI'm done with this place. We grabbed the check and left to go eat at a restaurant that can take orders and had everything listed on the menu as advertised. Final food for thought, DO NOT EAT HERE.", "author": "Wency W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-03", "description": "Awful. The lunch special bento box was ineatable. The fish was mushy and the roll was skimpy on the fish and mostly mayonnaise. Rice was bland and cold. We left.", "author": "Leah H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-04", "description": "I'm giving this place 1 star because it just has a generally crappy vibe around it. Desperate, clingy, greedy, desirous of your money, but doesn't really care about you.\n\nWhereas Yu Zen, which occupied the space before, was a 10-star gold-mine of exquisiteness, friendliness, and most importantly, they had a Deluxe Chirashi bowl for $26.50 that was OUT OF THIS WORLD AMAZING EVERY TIME!\n\nSo how can this place get away with charging like $45 for a Deluxe Sashimi that's NOT AS GOOD!?\n\nForget that, man. Almost twice the price for 2/3rds as good Sashimi.", "author": "Grizzle J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "This is a truly great place to get a Bento Box and at such a good price!  Teh have excellent customer service.  They were particularly busy tonight and when my delivery order was really late, they gave me a credit and discounted my meal.  Just Great!", "author": "Dick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "We had the lion king and caterpillar roll to go and it was good...rice had a little more liquid than standard", "author": "Richard L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-13", "description": "Most inefficient service. I've watched people get warm wine, kids starting to cry out of hunger, and most importantly my own dinner being over an hour behind. \n\nMost of the other hungry patrons that have stormed the wait with me started to ask for checks and forgo their dinner. Don't come here until they get their shit together- if they ever do.", "author": "Chrissy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "Amazing, delicious bento boxes for lunch yesterday at Oyogu. I would love to see them do well in this 'hood where we visit often. Great lunch menu and prices. Extremely reasonable dinner prices as well.  Lots to choose from. I would say the food is similar to when YuZen was run by its original owners.  And the acoustics are much better than with the last owners; not so loud. New carpeting helps. Young, friendly owner. Soft opening right now. Let's support this local business in the Outer Richmond! You won't be disappointed!  Excellent!", "author": "Julie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "We've eaten here 3 days in a row for lunch now (being in the area as the school year gears up). Each time, food and service have been consistent. And, yes, I posted one of those early reviews during their soft opening period, in the time frame where Yelpers like to claim reviews are fake or posted by \"friends of the restaurant owners.\"  \n\nWell, friends, this location is open for lunch. I can't compare it to Yu Zen. The former location was never open during that time and I was beyond excited to discover that Oyogu was!   And I don't know any of the owners/chefs, well at least not until today, when I learned that our server was the sushi sous chef.  Does that count?\n\nAs for today's experience, this place remains a hidden gem. The sashimi is consistently fresh and served at the appropriate temperature - not partially defrosted as I've had at other sushi houses in the City.  Working my way down their sushi lunch menu, all the combos are reasonably priced.  The seared albacore with a drizzle of sauce is perfect and my favorite.  For bento boxes, the salad is lightly dressed, be sure to mix well. Gyoza could use a lighter touch (possibly because I'm used to a thinner gyoza skin), but the tonkatsu is light, not oily. Bento boxes also come with a salad, miso soup, and rice.\n\nThis is also a family-friendly restaurant. Ask for mini-sushi for the kids.\n\nService is consistent. Looking forward to many more meals here as the local school year kicks into high gear!", "author": "M G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "Delicious sushi. We love to try new sushi spots in the city and had a great experience. The special rolls were awesome and so was the nigiri. \n\nProbably my favorite was the Salmon belly which wasn't even on the menu. Definitely give this spot a try if you are in the area.", "author": "Elan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Stopped by after looking for a bar to grab a beer.. no luck... Hey why not... Grab a beer and some sashimi instead.. So I treated my cousin and I to a large Asahi and Hamachi sashimi and octopus sashimi... Surprised.... The Hamachi was so fresh!! Delicious!! Definitely will have to come back and give this place the full experience... These guys are doing a good job.", "author": "Steven N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "Second time back there was wunderbar! Guy made adorable mini avocado rolls for my munchkin. He ate them so fast that Guy made another. So nice of him.\nAgedashi tofu was delish, edamame yummy, ramen hit the spot. It was a pleasurable tummy warming dinner to end the week. Thanks, Guy + team, can't wait to return.", "author": "s t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "I can't wait to go back there again!!  See my summary below\n\nParking\n  - Took me less than a minute to find a parking spot\n\nWait time\n  -  Zero.......i guess not many ppl know this place yet\n\nFood\n  -sashimi  and sushi rolls are fresh and tasty\n  -chef made mini sushi for my kids \n\nService\n  -Quick and attentive! They have sushi bar seating, but also plenty of tables as well", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "My boyfriend and I live in the area and were fans of Yu Zen, the sushi restaurant that occupied the space before Oyogu opened. We hadn't been back in a while and missed our favorite spot. We saw it had reopened this week and came in to try it with my parents, who were visiting. We're super impressed with the place! The service was super attentive but not overbearing and the food was excellent. I had the sake and spicy scallop hand rolls, my parents had a bento box with the teriyaki salmon, chicken katsu and spicy tuna roll and my boyfriend had the udon noodles with beef. Everything was super tasty and fresh. The salmon was really well-prepared and the sauce was great! The hand rolls were quite filling, had tons of fish and avocado and came in a spicy mayo sauce. The udon noodles, broth and beef were fantastic as well. \n\nWe liked it so much, we came back two days later again. This will definitely take up the space left by Yu Zen as our favorite neighborhood spot.", "author": "Lila A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "Good delivery..got everything on time. The sushi was very fresh .and i thought the salad was good too i liked they put the sause on the side. I really enjoy the miso soup it taste really good. Ill most likey order from here again.", "author": "Seaera T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "Ordered dinner at 6:18 pm, app said estimated delivery 7:19pm... they were at my door at 6:45 pm. Granted I live only 8 blocks away but the speed of the delivery was a nice surprise. What else was a real nice surprise was all the food. Fresh, delicious, well made sushi. I can't believe I have driven past this place hundreds of times but never noticed them. If they keep up the quality of their food.... no reason why I wouldn't keep going back.", "author": "David G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-12", "description": "The food is pretty good and worth the visit, but the wait for the food can break the whole experience. We are a family of four so we ordered all together. After 40 minutes one order came out. Another 15 minutes another order came out and so on. Our previous visit was similar. For these reasons we can't eat there as much as we would like to.", "author": "Marley Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "We orders three rolls but the oyogu sushi was so extraordinary. It was fascinating to watch the chef create it and then, it was so delicious, and beautiful to look at, like these beautiful temples, my son and I got into an argument over who would get the last piece. Very satisfying dining experience; a jewel off the beaten path.", "author": "Wayne S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "I ordered simple sushi over 2 hours ago and it STILL HAS NOT ARRIVED!! If they were having delivery issues then they should not have accepted my order for delivery. WT#!!!", "author": "thea v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Quick delivery, generous portions, the roll with blue crab was the best. Would recommend offering the Philadelphia roll with regular salmon and not smoked.", "author": "Ellie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "Food on time and hot.  Great Qaulity should be able to give 4 1/2 Stars.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-22", "description": "We ordered two sushi rolls which were both bland.  The rice wasn't seasoned correctly, the rolls fell apart as you picked them up and the fish was covered in some sort of glaze (not in a good way).  I was really hoping it would be better since we live so close by.", "author": "Edwin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "Really good sushi, generous portions, reasonable prices and friendly/attentive staff!", "author": "Lianne V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "The food was fantastic and presentation was beautiful! And the service was amazing. One of the owners, Mae, is so sweet and personally introduced herself to us. Definitely recommend!", "author": "Allie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "This place is incredible! My fiancé and I had dinner here the other night, and were amazed with the service and quality of the food. Their sashimi sampler is very high quality and has lots of variety and the grilled squid is a must. We stayed late into the evening chatting and drinking their warm green tea on a rainy, cold night. It's the perfect intimate setting for reasonably priced sushi that tastes delicious!", "author": "Christine N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "A friend suggested this place and we came here at the last minute. Loved it! Our new go-to sushi place in the neighborhood (and beyond)! Nice and quiet (what a relief!), very fresh and unusual sushi and rolls (especially try the chefs specials), wonderful sushi chefs (sat at the bar), great service (for some reason gave us a free bottle of sake) and a very good price for the quality. I consider this spot a real friend and will definitely return.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "This place is a hidden gem, newly opened under new management.  Why hidden may you ask.  It's located in a residential area, deep in Richmond district.  The area is safe and quiet, no rowdy crowd here. You often see family with kids  and couples dining at this establishment. I  went here with one of my close friends and we both loved loved the smoke'n sake special. The sea salt makes salmon 10 times better. We also ordered nigiris from the daily special board and everything was deliciously prepared. We also shared the Tonkotsu Ramen to end our meal.The broth was so flavorful and they give you a lot of toppings. The chefs  and servers are really nice too. Greeted us said many thanks when we left. On the plus side, restaurant is clean and very roomy. I definitely recommend this place and I will be back.", "author": "Linh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "Definitely a good place to hang out and have sushi at the same time with friends. The atmosphere here is very friendly and the space is very clean. Recommend to all my friends who love sushi!!!!!", "author": "Jianan Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-05", "description": "We stopped in here for dinner after Hardly Strictly festival as we were staying just a block away. There was a short wait for us to sit at the bar.  Service was prompt and the boys behind the sushi bar were friendly. We had a nice selection of nigiri but the hamachi belly was amazing. Just good eats!", "author": "Lali B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "I eat a lot of sushi. In my opinion there are two kinds... Good sushi and great sushi. Oyogu is a solid notch above the average sushi restaurant. There's a freshness and well balanced taste to their dishes. Recommend for sho. And the staff is super respectful and attentive.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "Oyogu is 4/5 stars. I have only ordered delivery because I am a FK.  Specialty rolls are bomb and the cucumber roll is amazeballs.", "author": "Kyle N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "Overall this place is relatively good.  The T&J roll and Rainbow roll was sort of typical. Fish seemed fresh, but the sauce is too sweet. I feel it takes away from the overall roll since it over powers some of the other flavors. The spicy scallop roll is normally a hand roll, but our server told me I can pay an extra $2 to turn it into a roll.  That worked out well for me since this meal was family style with the people I was with during this meal.  This was my favorite roll.  The avocado was fresh, scallops were fresh...no overpowering sauce. The scallop and avocado combined had this light flavor where you can taste the two mixing.  It has creamy texture that melted in the mouth.  The sake kama was cooked well.  I've been to places where they overcook the fish and it's dry and unpleasant to eat, but this was very moist.  Sloth (bf) corner review: The salmon skin roll is too crunchy.  It's deep fried and flavorless.  Plus hard to eat. Try something else on the menu.", "author": "Kathy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "I'm so glad I tried this place.  Monday night I ordered it through eat 24, and I loved their sushi.  I'm a regular at daigo and Sakesan but this place is going to be my new go to.  Fish was FRESH.  Tataki is always the first test of a place and it was great to start.  We had a mixed fish roll wrapped in cucumber , a couple pieces nigiri, spicy salmon hand roll, and a shrimp tempura roll topped with spicy tuna tobiko etc.  I am definitely a sushi snob with my favorite place being domo, and I loved this sushi.", "author": "Danielle B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-07", "description": "2 stars because the food wasn't very good but great service. \n\nRight off the bat it looked like a Chinese restaurant that happens to serve sushi. Obviously nothing wrong with that but the decor just threw me off.\nFor the nigiri i ordered, the rice lacked something. Maybe not enough vinegar? And also the consistency of the rice didn't go well with the fish. It was too hard.\nI ordered a couple other things such as the soba and dragon balls. Nothing special either. \nOverall nice staff but not a place I would recommend.", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "We have not had an easy time finding a sushi place in this area but I think we finally did. This place has very high quality fish. I can't wait to try more things. Nice ambiance. The waiter was very nice and helped with all our questions.", "author": "matthew m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "I love the dragon roll! The mochi ice cream is good too. I would definitely come back and try other sushi.", "author": "Minyu C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "What a wonderful addition to the neighborhood! Friendly staff and tasty sushi. So pleased this restaurant opened after Yu Zen closed!", "author": "June L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "This place was absolutely great! Two rolls and a large Sapporo and I was gooooood. The chefs are very good and very nice. The waitress was attentive to our table of two. It really was a great eating experience and well worth the wait for them to re-open at 5. I will definitely be coming here with visiting friends when I'm in the city! Love it!", "author": "Jeffrey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "Perfect place for a relaxed Saturday evening! My Caterpillar roll was great! Service was a little slow, but still friendly.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "This is my \"go to\" sushi place in the 'hood. The food quality is good. The service is very good. The sushi chefs are friendly and fun.\n\nIf you're in the outer Richmond and want some sushi, this is the place to go.", "author": "David P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-30", "description": "The sushi here is okay and the portions are pretty small . I've definitely had better and for a better price. I had the assorted sashimi plate and soft shell crab. Service was good though.", "author": "Gorlan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "I was in the city to visit my family, and saw this Sushi restaurant open for business. My wife and I are huge fans of sushi, so we give it a try. And it turn out to be one of the best sushi experience. \n\nWe order the following: \n1) Per the chef's recommendation, we order Special Sashimi combination. All sashimi are really fresh, and we really like the house special sauce. It is worth to upgrade from the assorted 16 pcs. \n2) Crunchy blossom roll: a spicy-crunchy version of the \"cherry blossom\" from other sushi restaurant, a good combination of both, we like it a lot. ( Not to mention that I finally find another roll that my little princess can eat).   \n3) Caterpillar roll: my wife and I only has a little bite on this. The rest are all finished my little princess, and she refuse to share with us, it must be good (and kids don't lie) \n\nThis is the place for people who crave for great sushi and sashimi. We will definitely come back.", "author": "Yuyi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Delivery came early and the rolls were all fresh and great.", "author": "Patrick R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "Service was good. Food was better. Their seasonal sashimi was awesome and worth the price.  Offered to fried shrimp head after meal was done.", "author": "Tin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "We had a great experience dining here with our baby. The waiter was attentive and the food was delicious! Highly recommended after a morning by the beach/ Land's End.", "author": "Dandan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "Amazing fish amazing prices amazing sake and beer. This place is new so I haven't tried everything on the menu but everything I have tried so far is incredible. I have been here a total of 4 times but every time I go I have amazing service.", "author": "Noah K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-17", "description": "Really bad. All the food we had was bland. I never had Ikura that was only salty and had no salmon taste. The hamachi was tasteless as well. If you're going to use wasabi from the tube, at least mix it up so it doesn't look like a big starry worm. Saba, Beef Teri, and Tonkatsu was not worth what they charge. My guess is that all the 4 to 5 star reviews are from friends or family. Basic Japanese not recognized or even close to being enunciated right.Who refers to Daikon Oroshi as pounded? And it was pounded to a paste! Don't waste your time or money at this Chinese restaurant, I mean Japanese.", "author": "Local S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "I have ordered take out from here 4 times now and it's been delicious every time! I love the veggie dragon roll , it's different than the usual veggie tempura wrapped with avocado on top. The prices are decent and I've had no issues ordering online and picking up. I can't wait to keep trying more rolls", "author": "Heather B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-06", "description": "I got a bento box with salmon teriyaki and spicy tuna roll. My wife ordered a poke bowl and the cucumber sashimi roll. The results were mixed. Island Poke was very good, salmon teriyaki was a bit dry, spicy tuna was a bit off. The fish in the sashimi roll was ok - not great. Overall an average experience.", "author": "Josh W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-14", "description": "Ordered sushi delivered tonight and the food was excellent. The fish was so fresh and flavorful. The rainbow roll was my favorite. The salmon belly was lovely. Very high quality.  So happy to have found a new sushi spot in the neighborhood.", "author": "Melanie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "I would give it a six star if I could!!! This restaurant is just a wonderful place for me to hangout with my friends. The staff here are extremely friendly and the food is delicious. Although it's a bit pricy for me (a college student with no job), but I am pretty sure the quality of the food is worth it. Although I have been to this restaurant just a few times, I will for sure come more often in the future. Their food is placed nicely on the plate, and I always get tons of likes after I post their food on my FB!!! Highly recommended!!!", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "Great choices, food is very good, really enjoyed theGarlic Edamame and the Bento box is a great deal!", "author": "Dennis L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "Great new sushi spot in the Richmond!! Fresh and really tasty rolls, great nigiri, and super friendly service. Will definitely go back!", "author": "Yashomati K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-26", "description": "We had another very nice dinner.  Started with the grilled squid which was fabulous.  Both had the bento. The tempura here is excellent. Light and not doughy.  They really know how to deep fry.  Recommended without reservation.", "author": "L T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "We had carry-out from Oyogu Sushi on one of our last nights in San Francisco. We were staying at a nearby Airbnb. The rolls were reasonably priced and fresh. We even received a free California roll based on the size of our order. Although we did not dine in the restaurant, it was clean and friendly. We definitely recommend Oyogu Sushi if you are looking for fresh, reasonably priced sushi.", "author": "Marc H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "Really good food at a reasonable price! The combos are enough for a good meal and they offer a great range of options! Really recommend it.", "author": "Henrique M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "This place is awesome. I have ordered from them half a dozen times or more. One order was for 8 people. They do an amazing job.  The hand rolls are five stars and the grilled squid is yummy! Highly recommend.", "author": "Amir A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "Since it opened (new management), I've been eating here at least 2x per week for lunch.  It's my go to lunch place.  I usually order the 2-item Bento Box.  The variety of offerings is just delicious and oh so tasty!  Serving sizes are large.  I absolutely love this place!!", "author": "Natalie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-13", "description": "I was here last night with my sister and her boyfriend for dinner. I personally really like nigiri and was wondering if they have a combo. Unfortunately, they only have it for lunch time and at night time they only have the sashimi combo. We asked if we can turn the sashimi combo into a nigiri combo. The waitress was nice enough to help us ask and the sushi chefs were able to accommodate with us and it was only $5 dollars extra for the nigiri. We picked the 16 pieces sashimi combo and what we noticed was that they actually gave us 2 extra pieces so we had a total of 18 pieces and they gave us 3 pieces of each fish so we were all able to try all the different fishes. That was really nice of them since we know that 16 is not divisible by 3. We also ordered two rolls and an appetizer of chicken karaage. We were super full and satisfied with our dinner. The price was reasonable too and the bill came out to be less than $100 for the 3 of us. This is definitely not my first time coming here and it won't be my last. The waitress was also super friendly.", "author": "Katie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "Excellent sushi roll & sashimi at reasonable price!  Delish & fresh. Courteous chef can provide both variety and surprises!  Finally find a place  I will come back to in the avenue.", "author": "David x."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "I have never write a review before but after coming to this restaurant I felt I had to. Great service and tasty food. Definitely recommended!", "author": "Yuehua Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "Great service! Food presented beautifully to parallel how well it was all made. Will definitely come again.", "author": "Kim R."}
