{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "This rating is for their breakfast only as I have never eaten here for lunch.\nMy experience here every time is great. Any of their scrambles are good, in my opinion and not expensive for the location and quality of the food.\n\nThe staff is all really nice too, which is always a plus.", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "I absolutely love this place. I work right around the corner from here and the food is mad good. The prices are farily priced as well. I'm almost always here for breakfast and I'm super basic so I always get the morning special. It's a croissant with sausage, cheese and egg. The overall saltiness isn't offensive. They cook it on the spot so don't expect soggy croissant and a mush of egg, cheese, and sausage. I'm not here so much during lunch but I've gotten their stone bibimbop and I always want more! The crunchy, burnt pieces of rice at the bottom make the dish! You can't have bibimbop without it. \n\nService here is always great. I have yet to have an unpleasant experience. They've been nothing but warm and friendly, even when it's busy. \n\nAll in all, this isn't a restaurant so please don't come here expecting kiss-ass service and Michelin star food. To me, this place is comforting. It's a place that can be considered a part of your daily routine, or a \"usual\" place. The staff are all friendly and the food is fairly priced and delicious. If you come here expecting high end service from a place that serves home-y, comforting food, then I'm gonna bet you think the water is spicy too *hinthint looool. It's the perfect spot to stop for a quick meal to refuel.\n\nSuper a locally owned family business :)", "author": "Alex D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-30", "description": "This place is just okay. Rounding up from 2.5 stars because I respect family-run businesses, especially in a city with rent prices as high as SF.\n\nThe staff means well, but even during a less-than-busy hour, they all came off as impatient and unwilling to answer any questions. I felt rushed, and was surprised when the amount of the meal was much higher than what I'd expected based on the menu prices. I was also scoffed at by one of the chefs, which isn't exactly a great way to welcome a new customer. Half of the meal was inedible, as the salad and macaroni sides of the bento box were both drenched in mayonnaise-based sauces, which would have been nice to know via the menu, or when ordering.\n\nThe beef and rice were pretty well-cooked but warm instead of hot. Not a ton of flavor before calling in my old trusty friend, Mr. Sriracha.\n\nIf you just want quick service and a cafeteria style meal without any atmosphere, it's a decent spot. But I doubt I'd ever return based on this less-than-pleasant experience.", "author": "Andy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "Try their salads. It's so great. I get the chef salad with ranch dressing with a scoop of tuna and a scoop of egg salad. It's so good. I hope they name that salad after me. \nStaff is so nice and friendly. Give them a try.", "author": "Jeff T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "Delicious, cheap and quick Korean cafe with a Korean and American food made to order. I got the udon noodle soup which was served piping hot and full of meat and veggies. \n\nStaff were incredibly friendly and really helpful. I came in the café hoping to grab a quick bite before apartment hunting in the city and spent a good chunk of my time talking to the owner about places to live in the city!", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "Pacific Plaza is inexpensive but delicious. It's across the street from a Walgreens, making it convenient if you are running errands! \n\nThe folks at the counter could not have been friendlier and answered all of my boyfriend's questions (\"What do you recommend? What about this dish? Can I substitute this?\"), and the food came out quickly. My boyfriend loved his chicken caesar salad and I enjoyed my beef udon. \n\nWill definitely be back!", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-27", "description": "Not the best Bento Box I have ever had but the service and price were great. The whole box lacked any sort of traditional Korean flavors, if that's what you are looking for then I wouldn't reccomend it. If you are looking for some fast food at a good price then it is definitely worth checking out.", "author": "Zachary W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "Hard to beat the CP ratio!\n\n* * * EXPERIENCE * * *\n- Not considered as a busy neighborhood but it was pretty packed during noon time on a Monday\n- Broad menu from sandwiches and salads, to bento boxes with different meats options, and a few other Korean specialties like Bibimbap\n- Friendly staff\n\n* * * FOOD * * *\nBeef Bento Box: A-.\nThe beef was well marinated - not too salty, and tender as well. The portion was very generous too considered it's only $8.95! Other things are pretty standard like rice, salads and bean sprouts, but surprisingly they also have macaroni! Who can say no to macaroni!?\n\nThere are lots of constructions around that area so I assume they will continue getting busy traffic. But I will need to go back and try those different sandwiches!", "author": "Simon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Delicious food and excellent service. I love getting the spicy pork bowl and tuna melt. The best food and price you'll get around that neighborhood. Portions are huge.", "author": "Lea B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "This gem is tucked away on the corner and easy to miss, but is so worth the visit.\n\nService: one of the staff will kindly and quickly take your order and send it over. Food doesn't take long - great spot if you need something quick on your lunch break. They take cards.\n\nFood: I've had the udon and bibimbap in stone bowl. The udon was pretty good. I also really enjoyed the bibimbap. It lacks some of the traditional stuff like kimchi, but is still delicious. Love the combo of rice, veggies, and bulgogi beef. You can also add a fried egg - yum! \n\nThe bento boxes look good too, going to try that next! Also have a great selection of sandwiches and breakfast items.\n\nOverall convenient, quick, and delicious.", "author": "Neda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "Quality Everything ! FRESH INGREDIENTS and Fast Service on the food. One of my favorite lunch places around town.", "author": "Patrick Loon K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-29", "description": "I've been coming here since I was a kid and it's still one of my go-to lunch places when I have no food at home. I always get the combination bento box, with kalbi (short rib) and either chicken or bulgogi (beef), which comes with rice, salad, and macaroni salad. The kalbi is my favorite: the meat is tender while the tendon around the bone is chewier, and it's so flavorful. Normally I'd always choose beef over chicken, but honestly they grill the chicken so well that I could eat it all the time. I also really like the macaroni salad which is a little sweet and very refreshing - balances out the stronger flavors of the meat. I usually only finish 2/3 of the box, so $10 for 1.5 meals is a pretty good deal to me. \n\nThis family owned business has a very efficient turnover rate, even during busy lunch hours (and especially now that there is a construction site across the street), but they're so friendly and welcoming to their customers that you'd never know they were under pressure to put out all those orders. Whenever I come by myself, they always ask how my parents are doing, and I've heard them strike up conversations with other regulars as well. Seriously some of the nicest people ever serving delicious food for a good price; what more could you want?", "author": "KC W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "Nom nom nom!! I come here often! I love their variety of food items. My favorites are the tuna melt and their salmon salad with house dressing. It's a family operated business so the owner can usually guess my order lol anyways everyone there is welcoming and the food is great. The price for the ítems are good too. Usually everything is crazy expensive in SF. What I love is that I can call in my order and pick it up with no issues. My order is always correct. The people preparing the cook are clean and maintain their station tidy. Good job and thank you!", "author": "Desiree L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-06", "description": "Pacific Plaza Cafe is a VERY solid choice for a morning or afternoon meal. It's a korean-brunch kind of fusion place where you can find both omelettes and bimbimbup on the menu. Sometimes toast and eggs just don't cut it. Sometimes you have to inject that extra oomph to give your breakfast that unique taste to start your day. This is the place to get that oomph. \n\nThe food is fast and you get plenty for what you pay. I often see construction workers eating there too so you know that this food will power you through the entire day. Unfortunately for me, they are only open weekday mornings and afternoons so I can only stop by when I'm working from home.", "author": "Philip W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-05", "description": "Since moving offices, I have been exploring a lot of the food establishments around here and Pacific Plaza Cafe is one of those gems that I have discovered.\n\nI have only tried a couple things here, because I am a creature of habit and love to order the same thing if it's good. I start craving that one dish and that's what I come back for. \n\nThe Shrimp Udon is very comforting, a large portion with great broth. The bento boxes are a win if you want a balanced meal, I've had the chicken and beef. The kimchee which they will give you a side of is delicious. \n\nMy favorite so far is the Bibimbap with a fried (yet perfectly runny) egg on top, I love the combination of the meal topped with a healthy dose of Sriracha on top - because I'm spicy like that.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "I've been working from home for 3 years just around the corner from here and only discovered this place about 6 months ago! Such a shame, as the food here is absolutely brilliant.\n\nDon't be put off by how it looks from outside (I'd walked past it so many times and just ignored it), they have all the regular lunchtime sandwich stuff, plus loads of great Korean / Asian food too. And all of it is delicious and affordable.\n\nHighly recommended to anyone looking for a lunchtime bite in the area. Breakfast menu looks great too.\n\nAlso appears to be family run, and everyone there is super friendly, which is lovely.", "author": "Jack C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "Nothing fancy, but good quality food and service. Tasty Sandwiches. Korean BBQ at a very affordable price. Excellent, friendly service. Family owned establishment. You will like it !", "author": "D H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-13", "description": "Love this cute mom and pop cafe! My now husband and I frequented this place for a quick and inexpensive breakfast while we were staying at Payne Mansion. Man I wish I could have tried their lunch menu! \n\nThey have everything from entrees to bagels, to a good selection of beverages. Get the Hawaiian breakfast if you're Asian like me and like to eat rice in the morning.", "author": "Sheryl K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "Pacific Plaza Cafe is a tiny place where you can grab sandwiches, salads, breakfast, and even rice bowls. Oftentimes, the people who go here are people working in the area, out to grab a quick lunch before heading back to work.\n\nThat said, I love the food here. One of my favorite items is the chicken salad with their house dressing. The salad is loaded with fresh vegetables and perfectly cooked grilled chicken. It's also a very generous serving size.\n\nTheir spicy pork bowl is also pretty good. The pork is tender and flavorful and is served with rice and broccoli. If you're in the area, this is the perfect place to stop for lunch.", "author": "Andrea G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "This place is clean, fast, tasty, and serves well- balanced meals. There is always a full lunch crowd, but you get your food within 10 minutes. \nThe sandwiches are large and full of veggies. They have a selection of fruits, cookies, chips, and lots of drinks. \nIt's run by Koreans, so the \"Asian\" foods are as great as the hamburgers. There are not too many lunch options in Lower Pac Heights, so I'm glad this one is good!", "author": "Chris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "Amazing price, taste and portions--especially for SF! Somehow, the staff here manage to make everything I love in the world, across cuisines--from omelettes to BLTs to bulgogi--all in one place AND at a totally reasonable price point to boot!\n\nCase in point: I ordered the bulgogi bento box for lunch today, and not only was the bulgogi well seasoned, there was a huge portion of it such that I was worried I wouldn't be able to finish. (Lest you worry, my friend helped me finish.) And my meal came in under $10.\n\nSo, sure, the ambiance isn't exactly to die for, but that's not why you come to Pacific Plaza Cafe. If only it were open on weekends, too...!", "author": "Ada W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "This place is dam good! Small local restaurant that always servers up fresh food. This place has been my go to spot for quick take out sandwich. Quick food prep and quality meal. I just wished they stayed open later.", "author": "Riaz L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Great place to checkout! The food is great, atmosphere is great, and it'll fill you up. Found two hour parking on gough. You first come in and on your right is the menu. Once you figured out what you want, just walk up to the counter and make your order. Very short wait times, food is excellent, reminds me of when I was living in Japan and my short stay in Korea. I had the Beef Rice Bowl and ordered the Spicy Pork Bentobox togo. Definitely coming back when I'm in the area.", "author": "Vernon X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-08", "description": "Oh what a cute little place! I live half a block away from here and the storefront evaded me for months before I got the courage to step into here.\n\nThe cafe offers standard sandwich fare as well as Asian bento box options. I had the turkey panini and it was delicious.\n\nThe servers are very friendly and prices are amazing. Very limited hours, but worth stopping by for a no-frills lunch.\n\n---\n\nDistinguishing factor: Cute local cafe with good food and good prices", "author": "Nick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Family ran restaurant. Always welcomed with a happy smile. Just the perfect place to get breakfast, lunch whenever you find yourself in the area.", "author": "Jennifer M F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "This is a great find for an affordable breakfast or lunch if you are in the area. Family owned and very friendly. They get very busy at lunch so it is helpful to call in your order. Highly recommend!", "author": "Scott S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "This place is right near where I work. The food always hits the spot, the people who work here are incredibly wonderful, and the prices are reasonable. I am addicted to the bibimbap and love the ham, egg, and cheese on a sesame bagel for breakfast. My coworker says they have the best Cobb salad she's ever had.", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "Delicious Korean food with wonderful workers. Definitely a hole in the wall, and can easily be overlooked, but totally worth checking out", "author": "Vyvian N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-20", "description": "The staff couldn't be any sweeter her but the food is lack luster. I've gotten sandwiches where the bread is burnt and it is upsetting that it's an extra dollar to substitute avocado for meat and offer no discount for not receiving any meat. Vegetarians get screwed. \n\nThere are not a lot of breakfast options in the neighborhood so it's better to have this spot around instead of combing the aisles of Walgreens for a sub par breakfast. Overall this spot is great in a pinch when your tummy is rumbling but not worth going out of your way for.", "author": "Pamela H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-31", "description": "Great spot for a quick breakfast or lunch. One of my favorite characteristics of this cafe is their consistently awesome service. They are always in a great mood which is what keeps me coming back, not to mention their promptness. Pick-orders over the phone are ready in under 10 minutes. \n\n\nThe breakfast sandwiches are solid, there are also breakfast plate options and French toast. \n\nMy go to for lunch is the spicy pork  bowl on a a bed of rice and vermicelli. They even have Sriracha to go! The salads are great lunch options when you seek a lighter meal.\n\nGlad to have found this spot, I am a big fan!", "author": "Yiorgo L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "Great spot for lunch. The sandwiches are great. I ordered the hot pastrami which was about $7. In addition to the meat, you get lettuce, tomatoes, red onions, and mayo. Its all typical ingredients. The meat was fresh and flavorful, a bit too salty. The bread could be better but, overall it was a really stuffed sandwich that filled me up. They do phone orders for pick so if you are in a hurry you can call in and order your food ahead of time. \n\nThere is free water near the entrance.", "author": "Allen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "For a little cafe that serves food for so little, the quality is amazing! This might just be my own biased opinion, but I just had the seafood salad and I died. It had the best portion of crab meat, not too much mayo, and they were not stingy about the meat itself. The salad was also accompanied by cooked shrimp that complemented the yellow bell pepper and the cheddar cheese shreds. The lemon was a great mix to the whole bowl and I don't know why it took me so long to give this dish a shot! I opted out of the dressing just because I don't typically like soggy salad ( :P ) I'm so freaking glad I went here for lunch today, otherwise I'd have missed out again! If you're ever craving some light crab, shrimp, and salad, give this a try.", "author": "Tricia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "Service is fast and friendly, with a high emphasis on building a strong relationship which their customers. \n\nBeen here a couple of times, with the most recent visit, when their power was out. They did what they could with what they had and you could still see the regulars coming in to order what they had available (sandwiches, soups, etc.)\n\nWould highly recommend if you like quick service with a jovial smile.", "author": "Bjorn A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "Great place and convenient for those who live in the area. Total hole in the wall, but has great korean/japanese food. Definitely recommend for anyone local", "author": "Anthony D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "I give five stars because you get what you paid for. It's a no frills mom&pop cafe that does great Korean bbq even at 10 in the morning, but the bonus is that they have good breakfast till 10.45. The service is super friendly and superb too. I had a spicy pork bento at 10.30 am and not only was it good for the price it's filling too.\n\nWould come back again to check out the other stuff. As a disclaimer I'm not sure if everything on the menu is great, but the bentos and bowls all look good and so do the breakfast. They really make it as you wish. Awesome.", "author": "George G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-06", "description": "Great spot for breakfast and lunch. \n\nSpacious for ppl who want to eat in. Pretty constant flow of take out traffic.\n\nMetered parking on the block.\n\nConsistent in the quality of their food... breakfast foods, sandwiches and Korean bbq.\n\nMy favorite: \nShort ribs Rice bowl with no rice and extra vermicelli. That's right, no rice in the rice bowl ;)", "author": "Cando T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "LOVE this place. Great for a quick bite to eat. The staff is awesome.", "author": "Jenna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-11", "description": "This place is the best. My coworkers and I all go here since we moved into an office around the corner about a year ago. \n\nI personally love the spicy pork rice bowl and the sausage breakfast sandwich on an everything bagel. Both are cheap and a ton of food and sooo delicious. You can even get extra broccoli on the pork rice bowl for free if you just ask for it. \n\nStaff are super nice and peppy and always happy to greet customers. I call ahead on a regular basis and just walk over and pick up my stuff so I don't wait very long, although even if you don't call ahead the wait is never more than a coupe of minutes. \n\nExtra bonus: It seems like you can get a fried egg on top of almost anything.", "author": "Katie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "Love this place. Staff is friendly, food is good, prices are affordable.\n\nThey have a good selection of cold and hot sandwiches. Also sandwich/soup combo which I don't see as often as I'd expect.\n\nThe breakfast options are also great ranging from sandwiches to fried spam and eggs on rice.\n\nWhat stands out the most is the fact that they have affordable Korean barbeque for take-out. Sometimes you just really want a bibimbap, but don't need the stone bowl (but it's available if you eat there).\n\nGreat spot and it gets busy around noon for good reason.", "author": "Jason K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "Great breakfasts that are tasty and consistent. Customer service with a smile.\nDefinitely affordable and is my go to for breakfast and lunch.", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-25", "description": "My co-workers always order breakfast from here... The breakfast sandwiches are always yummy, I've had a few bites... The Cesar salad is nothing special... I was not impressed... Order for breakfast and they will customize your order... Bonus my boss can not have dairy products and they make french toast no dairy for him.", "author": "Mary W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-28", "description": "Great menu! I like the selection for sandwiches, Korean food, etc here. I had the hot stone bowl bimimbap(sp?) and was disappointed that there was very little beef. Great otherwise. Maybe one could pay extra for more meat and then it would be great.", "author": "E S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-18", "description": "I'm so excited to have a cute place like this near work. \n\nIt has a tremendous variety from Bento Boxes to Vermicelli bowls to sandwiches and breakfast bagels. I opted for a veggie burger myself, and it was seasoned great with perfect fixins. Very economical as well.\n\nThey have a great selection of chips, fruit, cookies etc. so it's even a good place for a snack. \n\nSeems to attract all walks of life, which is great, because at the time I went, I was shoving food in my mouth while on the phone with my dad yelling about parking prices. I seemed to fit in, but I was probably on the rowdier side. Either way, I was accepted with welcome arms.", "author": "Sam D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "The organization I work for always calls them for lunch orders. The food is great! Everything tastes fresh and the owners are quick but caring and friendly.", "author": "Lisa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "Pretty darn impressed with their bibimbap. I thought his was just a sandwich shop but I was pleasantly surprised when I walked in! Plus great price compared to other Korean foods in SF", "author": "Connors C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "Super yummy. I have been here twice so far, and got the hot pastrami sandwich both times. *super yum* Tried the spicy pork rice bowl which I liked but my mom thought was a little salty. Bibimbab bowl was superb - both of us extremely satisfied with portions and whatnots. Definitely coming back to try the rest of the menu!", "author": "H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-10", "description": "Had house omelette minus spam and was delicious and filling. Home fries were also legit and seasoned well. Would like to try their lunch as menu looked great.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-11", "description": "So Fresh! So Good! So much variety! Such great service!\n\nThis is my favorite lunch spot in the neighborhood. They have healthy, delicious options like: Grilled chicken salad, no cheese, add avocado. The veggies vary because they only use what's fresh & in season. This is a HUGE bonus in my book. \n\nBeyond my beloved salad, they have so much variety! From breakfasts to udon to burgers to house made deviled eggs, I always know I'll find something good, even if I'm in an indecisive mood. \n\nAnd the service! SO friendly! The staff are just so warm and welcoming! Really, service like this does not come along often enough. It is such a joy to walk in and order from them. Rain or shine, they have a smile for you.", "author": "Ileana S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-29", "description": "I was SOOO happy when my coworker told me about this place and when I looked at their menu.  REAL KOREAN FOOD not a stones throw away from the office?!!? AHYYYYEEEEUHH? HAJIMA!!  \n\nI ordered the spicy pork bowl hoping for that super red and spicy daeji bulgogi I'm so accustomed to in Santa Clara's best kbbq shops.  The bowl came with rice, 2 brocolli sprouts, some bean sprouts, some japchae (clear rice noodles), the meat and WAY too much teriyaki sauc.  Alas, my search for delicious daeji bulgogi near my office must continue elsewhere.  The meat was not spicy, and it lacked the flavoring that I'm so used to.  A little bland.  I had to add a crapload of siriracha to make it spicy... come on, it's SPICY pork! There shouldn't be a need for it. And WTF is up with the teriyaki sauce?!\n\nThe food is good, for a palate that is bereft of the knowledge of truly bomb ass Korean food. \n\nI came back again a few days later and got the beef bowl because I was short on time to eat for lunch.  Same deal, the meat tasted too \"teriyaki\" like.  \n\nI thought I had escaped the boring industrial complex deli's that are so abundant in the east bay when I came to work in the city, but it seems like resistance is futile.", "author": "Tu T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "The best spot for a simple lunch, including Japanese or Korean food. Great place to walk to - friendly folks. We go here probably once a week. Chicken salad is deliciously light. The kalbi is fantastic. The best place for a simple salad. The bento boxes are reasonable and ample.", "author": "Alan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-11", "description": "3.5 stars\n\nThis is a cute cafe near where I work. They have sandwiches, salads & Korean food. I have always been happy with the food & the price.", "author": "Christy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "ok so this has just become my favorite lunch spot after my coworker told me about this place. They serve mainly sandwiches, salads, and some signature korean food. I've been here 4 times and I've tried their chef salad, seafood salad sandwich, spicy pork rice bowl, and grilled chicken salad. They are alll DELICIOUSSSS!! I feel like I would want to try everything on their menu. Service is extremely fast that even if you don't call ahead of time your order would be ready within minutes. The owner is super nice and friendly. I really can't think of anything imperfect about this little gem :) highly recommend!!", "author": "Ying Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "I don't get to go to this little cafe often. I've had other items, but, in my opinion, their veggie burger is outstanding! The place doesn't have atmosphere. The prices are low. The quality is high. These owners want you to like their food so you'll come back. They are personable, and they really try to find a menu item that you'll like. I really appreciate their genuine care. The veggie burger is not random mix of items. To tell you the truth, I don't know all the flavors that they combine. I LOVE the taste. There is an ample amount of avocado, but the combination, to my palate, is just great! Sorry to be picky, but I abhor sandwiches that fall apart or that have an abundance of one substance in this corner, and another food item prevalent someplace else. I especially don't like it if \"the sauce\" is squeezed inconsiderately in globs. There is none of that mindless preparation in this burger! This sandwich is carefully made so that you get the same consistent tastes - a positive blend of tastes - with every bite . . . and the sandwich stays together. I don't get veggie burgers of this (consistent) fresh, delicious quality in other places. It means something to me that the owner cares that I think his veggie burger is outstanding! It's like they try harder the next time so that I'm not disappointed. They care! You don't need an expensive place, if you're going for a daily lunch, especially when the staff try hard to please you, like these kind people do. This is a favorite lunch place with friends of ours who are local. I have never been disappointed in anything I've eaten here, but I love their veggie burgers (better than I personally have eaten any place else). Considerate staff must attract considerate customers, because even though the seating is a little tight, it's a relaxed, restful atmosphere. (Reflects the smiling people behind the counter?!) Everything is clean, because they work at it! Even the windows are clean. The beautiful people - not just looks, but heart - make the experience all the better!", "author": "Ed R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-19", "description": "This is my \"Gangnam Style\" lunch in SF!\nIt is so addictive as the song\nI didn't know that it's Korean.\n\nThe Bi Bimbup, $6.75, was really good.\nThe rice was fresh, beef was tender, egg was nice over-medium, most Korean refers to get a sunny-side -up, but i liked the egg.\n\nThe Bento Box combo, $7.50,  \nEh- sexy Bento!\nOppan gang-namseutayil\n\nhttp://www.youtube.com/watch?v=mDpgzn7KuzE&feature=related\n\nNice cozy, my kind of place.\nI'll be back!\n\nKen K.said, \"I'm slowly getting sick of Gangnam style...after listening to it 100 times the magic is wearing off haha.\"\n\nI said, \" ME TOO!!!!! OhMAN, I AM SO SICK HEARING IT! But, its So idiotically addictive song ever!!!\"\nBut I'm sure, It'll be gone soon, just like that \"Macarena\" about 13 years ago? Remember that dance? I don't see any one does the dance any more.\n\nBut so far, this is I like, by Ra-On @ Berkeley\n\nhttp://www.youtube.com/watch?v=HmBByDQHJAA&feature=related", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-10", "description": "LOVE LOVE LOVE THIS PLACE!!!\n\nIf you're looking for a quick bite to eat or a breakfast/lunch cafe, this is the place to go! The staff are extremely courteous, the food is always fresh, never a long wait,  the prices are very reasonable and there are plenty of healthy choices!\n\nPacific Plaza has been my lifeline over the past few months. Never have I been disappointed. I'd definitely recommend.", "author": "Marie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "This place is pretty much across the street from my front door...\n\nThe breakfast croissant is to die for (especially if you add ham AND bacon) the spicy pork bowl is perfect for lunch...\n\nThey loose one star for not opening until 7am for breakfast...  Sometimes I have to commute to San Jose and arrive by 7:30am, a breakfast croissant sure would be great on that long drive in the am but I have to leave by 6:45am which means no breakfast croissant for me!\n\nThe four stars are purely for food and location the atmosphere leaves a little something to be desired but you can win em all...", "author": "Antoine V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "Pleasantly surprised - good food, good value.\n\nThe exterior is pretty nondescript; the interior is not too special, but inviting enough.  The menu has good variety - everything from sandwiches and salads to bento boxes.  I had the spicy pork bento box ($6.95), and was quite happy with it.  The portions are generous, prices are fair, service is friendly.  Nice option if you're in the area.", "author": "D B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-09", "description": "Popped in for a quick lunch and got the BBQ chicken salad. Not exciting at all. The chicken came out dry (and wasn't marinated so it lacked any real flavor). The dressing was your average soy balsamic vinaigrette. Overall, very underwhelming. Should've just stuck to Sccisso, which is only 10-15 minute walking distance away.", "author": "Vivian N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-07", "description": "Don't judge a book by it's cover.  I finally tried this little place and I am glad I did.  I had the vegetable rice bowl with tofu and it was really tasty.  The staff there is extremely friendly and I will definitely come back.  Why not the 5 stars?  As much as I like it, it is a little pricey and I cannot give it 5 stars just yet.  Plus I want to try the sandwiches first :)", "author": "Brian S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-07", "description": "This place should be a last resort if you're in the area and need a quick bite to eat. Trust me it's worth a 3 min walk down to Polk street.\n\n1) They should work on their sanitary practices - it really bothers me when the same person handles my transaction (cash) and then prepares my food without washing their hands.\n\n2) They're really frugal  with their ingredients - I got a large salad today, the container was filled 1/4 with greens, 1 table spoon of shredded carrots, a pinch of  cabbage, an even smaller pinch of cheddar cheese and  three sliced black olives. Rip off I could have made the same salad at whole foods for half the price. \n\n3) Unnecessary attitude and impatient - I haven't experienced this every time I've been here but the usual lady who takes orders does not like to answer questions about the menu. She also expects you to order in like 10 seconds and if you take any longer she'll tap her pen and roll her eyes.\n\nI don't like giving poor reviews because everyone has off or bad days but they are consistently....unpleasant.", "author": "Jessa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-07", "description": "They give you a good amount of spicy pork with the bento box lunch special. It wasn't spicy enough for me though, but the sriracha squirts helped. Service is fast and the place gets very crowded during the lunch hour. It's close to a Sutter Health MOB, so bonus when I'm visiting.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-03", "description": "UPDATE:  THEY TAKE CARDS NOW!!\n\nGreat, now I really have no excuse for not eating here every meal of every day..", "author": "Clarke D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-17", "description": "Fresh food and GREAT service. \n\nI've never been disappointed by their food and I eat there all the time because it's close to my office. They are so great they actually remember my staff member's classic everyday orders. Very impressive\n\nThey also tracked down one of my staff members when she left her debit card there. They could have just waited for her to come back but they made the extra effort to get it to her. It was a Friday and she commutes to work, she would have been without it all weekend.\n\nI really love this level of customer service. It's probably why at least one of my staff members eat there EVERY day!", "author": "Tina F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-07", "description": "Came for: weekday lunch in the area\nWill come back for: breakfast/lunch or even dinner for their wide menu offering that includes deli-types and K-foods\n\nThanks to guidance of fellow yelpers here, I found this place in my search for cheap good food in the area.  And expectations were met.\nI had the spicy pork rice bowl.  The menu listed that it came with vermicelli, but to my pleasant surprise the bowl came with not only generous portions of spicy pork, vermicelli, but also some sprouts and a little bit of broccoli.  The flavoring was a little too salty, but overall pretty good.\nI also picked up a grilled cheese sandwich - which came with slices of pickles - and the total for both was under $10.\nThe small family(?)-owned business is tightly-run and they seem to have a good number of regulars.\n\nTake-Away: Surely a place to keep in mind when hungry and looking for cheap solid eats to-go or to dine-in.", "author": "Carol K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-17", "description": "They are close to a place I do a good bit of work for, so I stop for lunch once and a while. They have a great Cheeseburger. That's all I've tried so far, but everything else on the menu looks good. I will have to try some other things once my craving for their Cheeseburgers wears off.", "author": "Adam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-07", "description": "I love this place.  The food is tasty, fresh, cooked-to order and can be healthy if you want it to be :)\nThe staff is super friendly and they try hard to fill orders fast even during morning and mid-day rush.\nIt's become my morning routine - I look forward to my coffee and veggie omelet every AM!", "author": "Kate J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-24", "description": "I work right around the corner and discovered this great breakfast/lunch and second lunch spot which I would never have known about.\n\nThe food is actually pretty amazing for the price point. From Deli sandwiches, burgers, salads, breakfast, asian food, this place has it all.\nPortions are definitely filling enough, healthy and tasty. \n\nYou can usually get away with a great breakfast or lunch for well under $10. The staff is amazingly friendly and the ambiance is \"it is what it is\". It's a cafe with ample seating. Good crowd. Seems like a lot of regulars or people who work in the area. \n\nIf you work or live around here, a very convenient and affordable place to grab a quick bite.", "author": "Rob H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-15", "description": "I generally like eateries that offer a ton of variety. A spot like this that offers traditional cafe foods (donuts, pastries, sandwiches, coffee) and also offers Asian food (Hawaiian breakfast, Korean rice dishes) -- I was sold right away.\n\nGreat place to catch a fattening breakfast of donuts/pastries and coffee or bagels and cream cheese, or eggs and bacon breakfast sandwiches. I have yet to try the Hawaiian breakfast of spam, eggs, and rice). But since I haven't yet been fired, I guess I will have time to try.\n\nI only had lunch in here once; I always order short ribs in Korean places.  I was disappointed with their version; theirs is more like Americanized Korean food. The sauce was very bland, almost like a diluted soy sauce and sugar water mixture. No red pepper flakes or green onion that I can tell. On the other hand, it was served in a bento plate with broccoli, sprouts, salad, and rice. No kimchee or tea comes with it. :( Perhaps they're served during dinner. I do appreciate that they trimmed off the fatty parts. The meat itself was very tender enough for me not to miss it.\n\nA lot of 4 tops. So, if a lot of people are eating here solo, you'd have to get over your shyness and just ask to share someone's table. There are about 40 seats or so.\n\nThe people who run this place are incredibly friendly. I've come back  a handful of times in the past week alone, completely making me forget about how I wanted to try a different place each day.", "author": "Ruiqiu K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-10", "description": "Fast, friendly, clean, fresh and DELICIOUS variety of food! I'm always thrilled when I have the time to make my way to Pacific Plaza Cafe. They are so friendly, the food tastes delicious and is a great price. I love the Korean dishes, very authentic; their sandwhiches are yummy with lots of good variety, and their salads are my favorite! Like I said, everything is fresh and healthy which I enjoy, the atmosphere is light and friendly. I've never ordered something I didn't like and I always make it out in less than 10 minutes. I'd recommend the chicken salad salad!", "author": "Mary Beth M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-21", "description": "Me and my buddies used to hit this spot up for lunch EVERY DAY in high school. The KOREAN BBQ HERE? LEGITTTTTTTTTTT. \n$8 = Short rib + Rice + side salad + kimchi = YUMMMM!!! \nI still come here as often as I can when I'm in the city and I;m never disappointed. The Korean lady is so nice and friendly, you can't help but smile and feel joy when you talk to her. \nThis place is small, and doesnt get too packed, as good as the food is which is a surprise to me (probably b/c not too many ppl know about it)   but it allows them to serve me my food faster :D \nThe only bad thing I have for this place is that it doesnt open on weekends, which makes me crave it some more. \nAll in all this place is awesome. Small, friendly, and delicious, you can't go wrong with this place. So if your looking for a value on a delicious meal this is the spot!", "author": "Raymond N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-05", "description": "This place is the best for lunch. I can come here if I need a quick sandwich to go, or if I want to do a crossword puzzle over a bowl of soup or some Korean BBQ - even a great hamburger.\n\nEveryone that works here is SO nice, like nice they ask you about your work or notice when you come in later than usual. I always want to patronize a family run place that is short on price and tall on politeness.\n\nGrilled chicken salad, hamburger, chili, club sandwich, chicken bento box are all my regular order. All delicious.", "author": "Alicia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-25", "description": "Great place to grab breakfast or lunch during the weekdays. The prices are very reasonable and the assortment of food offerings on the menu are all pretty delicious with portions large enough to satisfy. I've tried their breakfast bagel sandwiches, egg platters (includes toast and bacon or sausage and potatoes), hot pastrami and BLT sandwiches, and Korean BBQ bento boxes and udon soup. \n\nFast and friendly service too - the staff on hand always make you feel welcome. I wish this place opened on the weekends too!", "author": "Elaine W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-26", "description": "We stopped in here for lunch on a recent trip to SF and went back for breakfast the following two days.\n\nOn the first visit I got a BLT which was good and my husband got a grilled ham and cheese sandwich, which he really enjoyed.  The second visit I got a very good sausage, egg, and cheese sandwich while he got eggs and toast.  The third day I just got a bagel but he got a big breakfast with eggs, French toast, and potatoes, all of which he really liked.  The coffee was also good.\n\nThe owners were incredibly nice.  I think they started to recognize us by the second visit and on the third morning the wife chatted with us for a few minutes after bringing us our food.\n\nIf we ever make it back to the area, we'll definitely be stopping into this place again.", "author": "Colleen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-08", "description": "Great spot for lunch if you are local.  They deal with customers quick and they know how to handle a good rush.  Their food is tasty from their bento boxes to rice bowls to sandwiches and salads. All meats are good - spicy pork, beef and chicken.  Go for it!", "author": "N T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "Delicious, healthy, quick and inexpensive! My go-to for lunch at work. The staff is great, the menu has a wide selection of breakfast and lunch items from Korean BBQ to sandwiches and salads. This place is great!", "author": "Katie V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-29", "description": "The word for this Cafe is...PERFECT in every way!!!!\n\nI've gone to this little unassuming cafe for years now, and it never gets old. In fact, it gets better, if that's possible! \n\nStephanie and Steve, the owners, know everyone's name, they know what's going on in your life, what you like to eat, your food allergies and preferences, and they are absolutely the most efficient business people.....top quality, personal appreciation for choosing them all the time, and to top it off, when I take lunch out for a group, they label each sandwich carefully, and make everything perfect. \n\nThe word for this Cafe is...PERFECT in every way!!!!", "author": "M. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-18", "description": "Asked for the spicy pork without the teriyaki sauce at the end. MUCH BETTER! I think it's more like 3.5 stars but will round up to 4 since it's conveniently close.", "author": "Bern H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-29", "description": "Sandwich bread is thin slices from a plastic bag, not from a bakery. For the price I'd hope for at least dutch crunch, baguette, fresh roll or something. Lots of other options within walking distance makes this an easy skip.", "author": "jizzie b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-25", "description": "Great breakfast or lunch spot. I work nearby and happen to eat here about 3-4 times a week. Perfect if you want to grab a quick bite to eat alone or with a friend.  \n\nI like to order in advance right before I leave the office which is a 2 min walk and they are always done with my order when I get there. The staff is always friendly and they know I hate onions and pickles so I don't even have to ask them to exclude them any more. The chili is great! I've been trying to figure out the recipe since mine is always super watery. Also try the Korean bbq; the short ribs are fantastic. \n\nIf you are in the area and need a quick lunch this is the spot to be! Oh and bring cash; no credit cards!", "author": "Jen N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-05", "description": "I can't believe this place got an average of 4 stars! People obviously don't know know what good Korean food tastes like.", "author": "Ju-Young M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-03", "description": "I LOVE this place! I work a block from this place and have been going here for the last 7.5 years. The service is always quick and the service is always great. \nMy favorite is the chicken udon, it is the best meal for $5.37! Yes, i know the amount to the cent. and i also have to add that within the last 7.5 years, the price has only gone up by 2 cents. \nJust a note, call for your order, that way you don't have to wait in the packed restaurant.", "author": "Eva L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-23", "description": "This is one of my regular lunch spots near the office.\n\nI only get one thing, with 2 variations:\n\nChicken Salad Salad\nGrilled Beef Salad\n\nBoth salads are tasty and a good sized portion for the money ($5.50).  The salad is a mix of greens, peppers, asparagus, and either a scoop of Chicken Salad or Grilled Beef (Korean BBQ style, grilled fresh while you wait).\n\nHere's my secret:  when they ask you which dressing you want, go for 1 House and 1 Ranch.  The House is a soy-sauce based dressing, and Ranch is Ranch.  Pour them both on, give the salad a big hearty shake, and you have a healthy lunch with a light creamy/tangy dressing.\n\nThey don't always remember to include a roll, so ask for one.\n\nOther menu items include sandwiches (hot or cold), Korean BBQ, Rice Bowls, and Udon.  I've had the Korean BBQ and it's good.\nTheir deviled eggs are very good, too.  If I'm really hungry, I'll get one of these and eat it while I wait for my salad.\n\nService is quick and friendly.  Not a lot of ambiance in the restaurant, so I usually get my order to go.\n\nChicken Salad Salad - so nice, you say it twice!", "author": "Liz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-05", "description": "Every now and then I'll get a hankering for a good BLT, and sometimes that hankering will extend to a specific sandwich from a specific place.  It's a bummer when the place is over 200 miles away, but luckily this place is just down the street from where I work.   You get a choice of bread, I always get the roll - between the crispyness of the bacon and the crustiness of the bread, I find myself wandering in here for this BLT specifically.\n\nI regret I haven't tried their other sandwiches or salads yet - I keep meaning to, they all look good, but the BLT somehow always wins out. \n\nI have similar feelings toward the Korean fare as with the other sandwiches - I've nibbled many a bulgogi (or piece of bulgogi, not sure what the correct usage is here) off of friends plates and am consistently dazzled by it.   In all fairness though, it's better to eat the Korean stuff there since it comes in bento-style boxes and there's a ton of food (choice of meat, rice, salad, kim chee, all the fixings) - I usually get food to go if I'm just picking up.  \n\nBottom line, excellent BLTs, damn good Korean food, and I'm sure their other stuff is great too.", "author": "Sus... B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-18", "description": "There's something to be said for establishments that remember your name when you come skipping in 5 minutes before they close with a hot food order.  It's late lunch-goers such as myself  that keeps me out of the restaurant/ food service industry, as I'd likely be inclined to deliver these folks a lovely roundhouse kick to their respective groins.\n\nI'm always delighted when I'm greeted with: \"Porn star!!\" ~ okay not true - but they do address me by name and often throw in a free deviled egg or chips along with my sandwich order (at least they do for porn stars).  Oh - the deviled eggs are pricey (1.25 seems steep) - but they be good hangover remedies!\n\nSandwiches are basic, but they'll make em' as you wish - but the Korean BBQ is the sure bet!  Go for the Bulgoki (phenomenal) or the short ribs (three ring circus in your mouth).\n\nAsk for extra napkins.  5 stars!", "author": "Mc Matty b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-23", "description": "I won't know for sure till tomorrow or the next day, but I think their house chicken and barley soup cured what ailed me. And for less than $3, it was one of the cheapest remedies ever.\n\nPlenty of other good looking stuff on the menu - burgers, sandwiches, etc.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-22", "description": "We ordered an Udon chicken and a bento box with Spicy pork. My son like both! I like their taste and size!", "author": "Asianfood L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-29", "description": "My office just moved to this neighborhood, so I tried this little cafe right around the corner for lunch. It seems like the owners are Korean because in addition to breakfast, sandwiches, soups and salads, they also have Korean BBQ, rice bowls, and udon on their menu. Nothing on the menu was more than $7. The woman who took my order was very friendly and my order was ready in about 5 minutes. I ordered the marinated BBQ chicken breast which came with rice, veggies and kimchee for $5.50. It was a generous portion and I was even able to eat the leftovers for dinner. I noticed that they also have chap jae, which comes with your choice of Korean BBQ meat - also a large portion for $6. I'm going to try that next time. \r\n\r\nA good place for a no-fuss lunch. And I can get my kimchee fix!", "author": "Connie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-19", "description": "While my coworkers love to come here for their lunches, I never could bc it's cash only.  I'm the girl who will spend 99 cents on a bag of gummy bears at Walgreens and take advantage of their cash back system for $20.  So in reality, I'll spend $20.99.  Naturally, I never have cash, I do not know why.\n\nBut this past weekend I went out with a couple of friends and I put the bill on my card and scored some cash so I had some moolah I HAD to instantly spend.  I went over to this cafe two blocks away from my work and ordered one of their delicious looking salads.  The grilled chicken. For $5.50, it was quite a good deal.  Fresh grilled chicken on a big pile of fresh romaine, thinly sliced tomatoes, cucumbers, cheese, and two containers of their house dressing.  It was a satsifying meal that didn't weigh me down or make me sleepy....so I was abel to be pretty productive at work.\n\nConvenient, fast, friendly neighborhood cafe. Four solid stars!", "author": "Peggy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-17", "description": "I've eaten at this little breakfast / lunch cafe twice in the last week.  I am very impessed with both the quality of their food and reasonable prices.  The cafe decor is pretty plain, but you're not asked to pay for it either. \n\nI think it is run by a husband & wife team and you couldn't ask for nicer people.  This carries over to the other employees and makes for a very nice dining experience", "author": "Larry P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-12", "description": "Been here twice now. First time got a combo bento box short rib and chicken. This time got the rice bowl. Got a lot of food for the price and not just for the neighborhood and really good food at that! In general the prices are good ($8 Lunch) and u get enough for a full lunch or left overs for later. Bbq chicken is my fav for now. Haven't tried the soup but the couple next to me said it was very flavorful w/o being salty. The staff is also very nice as well!", "author": "Peter Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-18", "description": "YUM! one of those... hole in the walls that are damn good. For less than 8 bucks I can stuff my belly and drink my diet pepsi and be the happiest little gal on the block.\n\nTheir spicy, bbq pork combo with rice and the side dishes is soooo good. And the owners are soooo sweet and keep me coming back.. damn that charm! :)  \n\n*I'm korean.. so I know what's good. and this stuff is good for fast, take out!", "author": "Hana N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-19", "description": "This place is awesome.  From the friendly family that owns it, to the cleanliness, to the affordability, to the amazing variety of good food that they serve.\n\nThe pork rice bowl is by far the best dish on the menu.   Try it an you will be addicted!!!\n\nI go here at least three days a week and it is impossible to tire from the variety of fresh, well prepared food.", "author": "Guy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-17", "description": "Our entire office comes here for lunch at least once a week. Standouts: any of the Korean combos, rice bowl (with vermicelli & veggies) and udon (I recommend the beef and you can call this order in ahead if you're doing to-go since it takes 10 mins to prepare). The staff is super sweet too. There's a lunchtime logjam on some days so take note. Oh, and try those gigantic cookies that are Saran-wrapped on the counter. They look delicious, and they are. Bit greasy but it satisfies a cookie craving. \n\nCo-workers say \"eh\" about the salads and most like the sandwiches. I've ordered the breakfast sandwich with bacon on wheat toast and wheat bagel and both are enough to hold you well until 1 p.m.", "author": "Genevieve R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-29", "description": "Exactly what I was looking for: quick, easy reasonably price, good food, very clean environment, super nice and friendly, order and sit down. I will be coming back often.", "author": "Doug D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-14", "description": "This is my new favorite lunch spot.  The place is small and fits maybe 20-30 people.  But, obviously large enough that if you chose to eat in you could easily.  The people are ridiculously nice and friendly.  They are very open and learn your name quickly.  It's nice to be recognized and smiled at everyday.  \n\nI get coffee here everday.  Love it.  Super cheap.  I get salads, udon, korean bbq.  Everything I've purchased has been a generous portion and very very tasty.  Their menu is all over the place with chef salad to udon to korean bbq to salmon on fridays.  They have great soups too.  My co-worker lives for the chicken jambalaya.  Highly highly recommend this place for lunch.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-14", "description": "I discovered this place about a week ago. I was aimlessly walking around, looking for somewhere to eat lunch because I didn't want to be in the office and wanted to find somewhere new to eat.\n\nI've been back here almost every day since.\n\nThe Beef Rice bowl is the awesomeness.  Sandwiches are just ok.  I can't recommend straying from the rice bowls.", "author": "Robert L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-09", "description": "Got the combo bento box with bulgogi and kalbi and a deviled egg. All for less than $9! The bento comes with rice and a small salad and some other veggies. Good for a quick lunch.", "author": "Dennis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-13", "description": "Right around the block from my apartment, I grab a sandwich from this place from time to time.  They people working here are fast and friendly and even let me owe them for a sandwich when I was running short on cash.  Plus all the sandwiches are under 5 dollars.  \n\nThey cater to the working person and are open from 7 to 3 on weekdays.", "author": "Tom K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-09", "description": "10 STARS!! I LOVE this place as well!!! This is a cute little mom and pop cafe that's been around for more than 10 years! I know this because I've been a patron for that long. I would highly recommend the BBQ chicken salad with the house dressing. All the ingredients are fresh and the chicken is hot off the grill. The tuna melt and the BBQ bowls are also great. I would also recommend their chocolate chip cookies. Ohhh the buttery goodness!", "author": "Minie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-02", "description": "I work close bye and the lunches our pretty good and fast service with a smile.", "author": "Kyle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-29", "description": "My office is just above this place. Crowded place morning and afternoon.  Good food, good prices. Staff is very friendly. \nI have had their soups, and bagels sandwiches. Have not tried the korean plates or rice bowls, but my other co-workers seem to like them.  They smell good.  Definitely a good lunch spot if in the area!", "author": "Shelley N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-15", "description": "It's cheap!  It's fast!  It's good!\n\nBut...\n\nI need to talk about my obsession with their brownies.  How many times have you bought what looked to be a decadent brownie only to have it create  that icky paste in your mouth?  You know what I'm talking about....the cake-like dried out biscuit masquerading as a luscious, moist square of deliciousness.  Well these brownies are the perfect combination of chewy chocolate brownie with amazing frosting that isn't two sweet or cloying...my god.  \n\nI am going to get one now.  And thanks to the yelper who suggested using a container of both the house dressing and ranch for the grilled chicken salad...awesome.", "author": "Amber B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-16", "description": "I work right near this place and it is DELICIOUS. The staff is extremely friendly and while I've only been there a handful of times, recognizes me and also ensure that I \"have a good day\" when I leave. I HIGHLY recommend the Vegetable rice bowl. Call ahead and it's ready and waiting when you arrive. It has great tofu and generous vegetables. I used to be afraid of the hot sauce but now realize it's Sri Racha and delicious. Patronize this local small business. You won't be disappointed.", "author": "Lauren R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-11", "description": "I love this place.  From the moment I placed my first order they were very friendly and helpful.  I admit when I want a sandwich I am pretty specific and tend to get the same thing.  Now whether I come in for breakfast or lunch, they know what I want.\n\nThe prices you can't beat!", "author": "Myk O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-28", "description": "I hadn't been to Pacific Plaza Cafe in a few years because of taking a job far away. I really missed the great lunches I used to have there when I worked around the corner. When I drove by and saw a parking space yesterday, I grabbed it.  Steve and his wife were behind the counter as always and I was so glad I stopped. Can you believe they remembered me from 2006?  What a wonderful lunch! I eat out every day at work and sometimes find it hard to get a decent sandwich, much less something that is beautifully made and tastes wonderful. The club sandwich filled the bill. Also got a bowl of soup and a ham/pasta salad for dinner. Spent $15 (including tip) and ate well all day. Boy, do I miss this great cafe! I'm going to make it part of the week to stop in and get properly fed. Thanks, Pacific Plaza Cafe!", "author": "Linda B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-08", "description": "wandered over here for lunch the other day. The pastrami sandwich I got was good, very fresh, and very generous. I just wish they used better bread! I asked for sourdough, but the bread resembled Wonder Bread more than anything. On the upside, my sandwich was less than $6.00 and enough for two meals (although I, of course, ate it in one).", "author": "Michelle A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-04", "description": "I work in the neighborhood and eat breakfast and/or lunch here very often.  They know me by name already and know my orders, haha. Anyhoo, you really get your money's worth of food. I enjoy the bbq pork and chicken plates. The portions are substantial and they cost less than 6 bucks. The deviled eggs are really good too. Overall, its a really great, family run, lunch place. They are really fast with the food and everyone working is friendly and nice.", "author": "Maya L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-30", "description": "Love this place. I work a block away and eat lunch here 4 times a week. The sandwiches are always fresh, the service is excellent (very attentive) and the Korean BBQ is CRAZY good.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-30", "description": "Good soups, salads, and sandwiches (I'm a white girl, so don't ask me about the Korean offerings).  I usually go for lunch on a work day and get the grilled chicken salad with house dressing (sesame seed vinagrette) and it is usually satisfying (now and then the chicken is dry), sometimes even has asparagus spears and red pepper rings - yum!  The staff is quick and friendly.", "author": "Holly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-21", "description": "Good sandwiches and Udon at good prices. If you work within two blocks of this place (as I do) than your options drive you to give the place an extra star.", "author": "Rob S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-04", "description": "Korean BBQ, Udon and Sandwiches\n\nPros:\ngood, fast, cheep, clean, friendly\ngreat for take out  lunch if you are in the hood (not a special trip kinda place)\n\nCons:\nno dinner; eating there is a bit drab", "author": "Jeff E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-17", "description": "OK, I have to admit, I have a tiny addiction...to the grilled chicken salad...it is so simple, just grilled chicken with a little cheese, a slice or two of cucumbers, some shredded carrots, sliced red peppers, maybe some asparagus, on a huge pile of leafy green lettuce!  It's only $5.50!  so simple, but perfect for me (almost) everyday that I work nearby....which is about how often I eat it.  Sure I could make this at home and bring it to work, but then I wouldn't get to see the friendly owners, who always remember their customers and are so nice to talk to!", "author": "Tracy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "Delicious chicken udon is perfect for a cold day and divine grilled cheese for under $5. Love it.", "author": "Jackie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-10", "description": "The people who run PacCafe are incredibly sweet and lovely.  They make good, wholesome, reasonably priced food and are beloved by all of us who work in the vicinity.  Good coffee, great egg sandwiches for breakfast and good sammies and BBQ for lunch.", "author": "Michele M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-28", "description": "Pacific Plaza Cafe is about a block from my work, so I go there at least once a day.  Their coffee is good, and they also have a nice selection of tea.  Not too many pastries to choose from, but they always have fresh fruit (which i snice) along with an extensive breakfast hot food menu (egg sandwiches et al.).\nThe salads are a great deal considering their size. The Korean BBQ is also very good. I have not had a sandwich there (other than the yummy breakfast sandwiches), but I can only assume they are good by the quality of everything else they have in there.\n\nBottom line: Nice, reliable, family-run place.", "author": "Tara M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-09", "description": "The BBQ lunch specials are so yummy and price point is reasonable. I recently tried the breakfast and it is not bad either. The owner is friendly and this is just a nice convenient place to have a quick bite to eat.", "author": "Sabrina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-14", "description": "This is an excellent sandwich shop that also servers hot lunches.  It is a block from work. The staff is GREAT.  Food is good also.  Never had anything bad there.", "author": "Brian K."}
