{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "This place is incredible. I'll admit I was a tiny bit hesitant due to some of the poor quality food pictures on Yelp, but once diving in to our fantastic 10 person Kamayan dinner, I was sold. Everything was cooked to perfection and seemingly easy for them. Both baskets of our food came out within a minute of each other and were filled with seafood, meats, veggies, rice, and sauces. This place popped to the top of my favorite Bay Area restaurants immediately. \n\nOh also something that might be helpful- you can get a 2 person Kamayan style dinner. They just bring a smaller basket but there's still a ton of food for two.", "author": "Scott B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-30", "description": "Yes!! I love this place. +4 1/2 stars.\n\nThis is the foundation of great family restaurants. Spots like this make San Francisco beautiful. Some old timers claim the city isn't what it was. Guess what, it still is. Come check it out. This is the city. It's in here.\n\n+ Chicken Adobo - I liked this a lot! Everything browned in oil and I guess a little garlic and then I put it over the great garlic rice, dang, it's awesome. The meat cooked to the point it's falling off the bone and all the other ingredients soaking up the meat flavor. This was a great dish. We'll get this again. \n+ Sisig Baboy - Marinated and Grilled Pork - Excellent! It comes out on a hot skillet so it has a minute to caramelize and just wow. Get this! I was worried that it would be too hot with the peppers but it's not at all too hot. Actually just enough green stuff to mellow out all the fried stuff. The vinegar, soy sauce, and garlic mix are simply amazing. \n+ Lumpiang Shanghai - These are so good they are dangerous. If you get an order, which I highly suggest you do, be careful. They are tasty and crunchy and if dipped in the sauce, sweet and satisfying. With a sip of juice (see below) magic in your mouth! \n+ Calmansi Juice - This is the first time I'd ever had this beverage. They don't have fountain soda so I asked for a house made juice. Before the meal arrived I thought it was too sweet however with dinner it's perfect. \n\nAs we walked out, we thanked them for their great dinner. The reply, \"Thank you, tell your friends.\" I don't know if it was our server or one of the twenty something's that just took a table. That's what I'm doing. Come here. Bring your friends. The Bay area has a huge Filipino population so I'd assume we'd have a lot of great choices - but we don't.  Everybody needs to try this spot at least once. Get in here. The prices are great and food amazing.\n\nYou'll see us here again but with our friends next time.\n\nCredit Card welcomed.  They gladly take Visa, MasterCard and Debit. They do not take American Express.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "A family-run, hole-in-the-wall Filipino restaurant in a quiet corner of the Mission, Pampanguena is the place for a kamayan feast! An order of this comes as a huge spread of food on banana leaves: centered around scoops of white rice are a selection of grilled and fried dishes that are simply delicious. The lumpia were nice and crispy, the preserved egg added a perfect touch of salty flavor, and the grilled squid, chicken, fried fish, and marinated pork were all so flavorful in their own way! The fried shrimp were so crispy that you could just bite right through and eat the shell, and the broccoli, eggplant, and mango/onion/tomato \"salsa\" were nice and refreshing. On the side came four different types of sauces, and the staff took the time to explain to us which sauces went best with which dishes! In addition to the kamayan, we also had an order of the kare kare, an oxtail peanut-based curry with a bunch of veggies, including Shanghai bok choy, eggplan, and string beans. The curry was thick, gooey, and full of flavor. \n\nYou really can't beat the value for the food you get here. Even though we came close to closing, the staff still took their time to serve us, and I'd definitely recommend a visit!", "author": "David K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-07", "description": "Ordered a tray of lumpia yesterday and although they had a nice crunch, they were practically meatless. I'm disappointed in the inconsistency of their lumpia :( It sucks bc I know their potential... when it's good, it's SO good!", "author": "ashley l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Shayla loves food. Shayla loves... Filipino food. And, Shayla loves a Filipino FEAST! And honey, Shayla GOT a Filipino feast at Pampanguena! \n\nKamayan style! If you've never had a Kamayan style Filipino feast, then you've been missing out in life. You better prepare those salivary glands for take-off because this is gonna be one delicious @ss flight! This deal is really incredible! A full feast that will happily satisfy at least 6 people for less than $20 bucks a person! You know I'm all in! So, let's break it on down with the list of included food items:\n\nKamayan Animan (Feeds 6 guests for $68.95):\n-Chicken and Pork BBQ\n-Grilled tilapia \n-Grilled squid\n-Grilled Pork\n-Flitter shrimp\n-Salted egg \n-Lumpia\n-Mango/tomato/onion \n-Sweet yam \n-Steamed white rice \n-Steamed vegetables\n-Steamed eggplant \n\nIn addition to this, our party of 8 also ordered:\n-Sizzling Sisig baboy (grilled marinated pork)\n-Lechon Kawali (crispy fried pork belly)\n-Pancit Bihon (stir fried noodles)\n-Halo halo\n\nI'm gonna go right ahead and proclaim the sizzling sisig and the crispy lechon as the stars of this show! That sisig came out sizzling and it was sangin' a lullaby to me! It was juicy, flavorful, and marinated to perfection! But that pork belly though! OMG! That lechon was on fiyaaaaahhh! The crispy bake on the outside was PERF! Mixed with the tenderness of the inside... just melting on my tongue like whaaaaa?! You would have thought a girl had died after eatin' that! It was just sooo dayum GOOD! Mmm mmm MMM! \n\nMoving on to the other standouts: the crispy lumpia, the perfectly grilled tilapia, the fresh mango, tomatoes, and onions, the delightful BBQ chicken, and the perfectly sweet halo halo. I mean, THIS meal was like the meal from God! Somebody please please pleeeaase let THIS meal be my last one on earth because I will gladly accept it in a heartbeat!\n\nIf I had to nitpick, I would just say that the salted egg was just a bit too salty for me! I'm also not feeling the fact that this place is cash only, but I digress. Of course I can always say that I would have loved to have more food on the plate because there was NO food left behind here, kids! Portions sizes are ample and the prices are pretty damn cheap for what you get! My friend ordered 100 lumpias for take home for only $30 which is really a steal!\n\nThe place is pretty tiny with limited seating for large groups and it's pretty much first come first serve. The service was great and they were able to accommodate all of our picky little needs. They really handled our large group well and cooperated with us. The owner was super sweet and she came out to greet us and to check in on us several times during our stay. All in all, I had a fabulous experience and I cannot wait to dabble in this magnificent feast again!", "author": "Shayla B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-13", "description": "This place is spacious.\n\nWe ordered the family style Kamayan, it was HUGE. We had 6 people eating this thing and still had left over.\n\nThey gave so much side sauces. \n\nThey need to add a bit more rice though, they gimped out on the rice -- hello Filipinos need the kanin!!", "author": "Elijah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-26", "description": "Kamayan is the traditional Filipino way of eating with your hands, derived from the word \"kamay\", meaning \"hand\".\n\nPampanguena does well to give justice to this way of eating- accommodating large groups if you call ahead, and bringing the vibe of a Filipino family home to a restaurant.\n\nMy friends and I (a group of 9) were fine with an order of \"animan\" (for 6), and added on an order of pancit bihon, sinigang na baboy, and sisig. We chowed down hands first (minus the sinigang soup), and were pretty full afterwards! The animan was definitely enough for a group of 6 or 7, but with a large group, add on to the order!\n\nWe were given plate baskets lined with banana leaves, and dipping sauces for the various \"ulam\" in the kamayan meal. All the grilled meats were so yummy, as well as the lumpia, fish, and squid! The sisig, sinigang, and pancit were also cooked just like it came from mama's or lola's kitchen, so you know the quality of the meals is worth it.\n\nSarap!!", "author": "Mary F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-24", "description": "Filipino time was in effect I guess. \n\nWas here in morning of 4/21/2018 with other customers waiting outside on the street. Yelp time and door sign says opens at 10AM. Yet we got there at 10:15 AM and still closed. Called the phone number and got hung up on. Waited 5 mins to no avail and left. Went to another filipino restaurant instead.", "author": "Strykher V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "As someone who rarely eats Filipino food, Pampanguena quite surprisingly was able to beat my expecations. Came with a group of friends for dinner on Saturday night, and we ordered a huge spread of food for the table. From chicken to lumpia, rice to vegetables, shrimp to fish to salty eggs, this dish was like a treasure box, and we just dug right in. Highlights were definitely the lumpia and shrimp, but everything was very solid and the unique flavors went well together. We also had an order of the oxtail curry which was fantastic -- very rich with good amount of oxtail pieces to share.", "author": "Alvin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "FOOD COMA!\n\nI've tried Kamayan style before with friends, but at the wrong place.  I should have come here!  Family-owned small restaurant, always support small businesses.  Doesn't hurt that I also love Filipino food so much.  This place is way better than Pampalasa, I paid over $50 for a Kamayan style dinner at Pampalasa, supporting a friend's last-ditch effort to save an overpriced Filipino restaurant in SOMA.  It was definitely high-end Kamayan feast dinners.  When my Filipino friends told me Pampalasa was overpriced for Kamayan, I knew I had spent way too much $$$ aka sucker!  Needless to say, the restaurant closed.  \n\nLittle did I know there's this hidden gem of Filipino cuisine in the Excelsior District!  The staff are super friendly and attentive.  Josie the mom/cook is so awesome.  The ambiance is cozy and small, feels like eating with family once you start grubbin'.\n\nOur Kamayan dinner consisted of the following:\n\n- Lumpias\n- Meat\n- Shrimp\n- Fish\n- Calamari\n- Salty eggs\n- Eggplant\n- Rice\n- Broccoli\n- Mango\n- Sweet yams \n \nWe ordered a la carte sizzing sisig, lechon, pancit, and halo-halo for dessert.  You know I had to order a tray of lumpias to go for hubby and our growing boy.  They killed the lumpias in the morning LOL!  \n\nThanks to our friend Hazel C. for organizing this little shindig last minute, as we all fled to the city to beat the heat, but it didn't help...still HOT thanks to the heat wave!  We were all astonished when the bill came out to be $16 per person after all that food.  Keep in mind it's cash only, so bring it; otherwise, there's an ATM inside.  Can't wait for the next get together, let's take over the entire restaurant woo-hoo!!!\n\n'Til we MEAT again (get it) hahaha I crack myself up, see you on Yelp (SYOY)!", "author": "Christine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "HOLY MOLY! For my white Midwest (Indiana) husband's birthday, he requested a \"boodle fight\". He sees it all over our friends & family's social media and was curious. In comes Pampangueña. \n\nThe place is quaint and the decor reminiscent of restaurants from back home; lots of sea creatures and bamboo. We ordered the kamayan for 2 and a BBQ plate for the kids. From the mass of food from photos I've seen, I expected to have to wait a length of time and longingly looked at the food arriving at other tables so I was pleasantly surprised with how quick our order came. The \"dalawahan\" came with pork & chicken bbq, lumpiang shanghai, fried fish, rice (duh!), itlog na maalat and so very delicious mangoes, tomatoes & onions WITH a side of bagoong served on a banana leaf. It has been a point of conversation between the hubz and I how there is no \"fancy\" Filipino restaurant because our food isn't about pretty but all about taste. We're \"jungle\" Asians. Our food is typically served crammed in styro or slopped on a plate. Filipino food served on a banana leaf is possibly the \"sexiest\" way our food can be plated. Pampangueña hits the mark on making our food pretty AND delicious. \n\nAs food coma was about to set in, our server asked if we were interested in turon or halo halo. Both please. \n\nAfter our gluttony had transpired, en route to wash our hands from the kamayan, the owner(?) yells \"I JUST MADE SOME FRESH LUMPIA, DO YOU WANT SOME?\" ... well sh*t. \"Yes ate, I'll take two!\" \n\nTL:DR- Partook in serious feasting and couldn't stop eating. \n\nWe'll definitely be back!", "author": "Meryl Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-21", "description": "Meals: I ordered pork BBQ binalot, Laing, grilled squid... They were ok, not great, but just ok. Didn't give me the umph I was hoping for considering I don't get to eat out at Filipino restaurants that much. The halo-halo wasn't bad at all.\nThe downside: I was sooo hungry my acidity was killing me and when I asked for a simple cup of broth, they couldn't provide it! So forget about flexibility nor customer service, this restaurant doesn't have it. Oh... The son of the owner was trying but the mom, perhaps the owner or manage, didn't have customer service in her DNA.\nMORE DOWNSIDE: I understand not accepting Amex for payment. I understand extra charge for using credit card. What I doing understand is not being able to provide an official receipt!!! I asked for one and the mom/manager rudely tells me THAT IS YOUR RECEIPT! uhm.. It was one of those scratch-like sales order... No tax id number whatsoever. So yeah... If they're avoiding to pay taxes, at least I would expect a friendly service. For that, they're very lucky to get at least one star.", "author": "Abigail E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-10", "description": "This has the best garlic fried rice!! I don't like to order it cause it's usually overly seasoned and taste bad but my kids wanted it and I am glad I did. Definitely will be back for that. We ordered the Lechon, chicken Adobo, longanisa with garlic fried rice. We were happy with our food! Will definitely be back.", "author": "Denise T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "We had a great family cousin's lunch here this weekend. Food was delicious and the environment was inviting. We ordered two of the large group lunches, two bangus sisigs, one dinuguan, one lechon kawali, two halo halos, one order of turon, one order of leche flan, and countless sodas.... all for about $250 before tip.  We'll definitely be back!", "author": "Trish D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "I found this place because I wanted to try kamayan style. I've tried eating with my hands many times at my Filipino boyfriend's house, but never at a restaurant and never on banana leaves. It really is so liberating and satisfying! I've been here twice, both times with 5 other people, and ordered the kamayan anima for $68.95. It was a lot of food! I especially loved the grilled tilapia, grilled pork, lumpia, and salsa (mango, tomato, and onion) with rice. The owners are so nice and friendly. Eating here felt like eating at someone's home and we felt very welcome. The sweat yam at the end was also a pleasant surprise. Everything tasted so fresh and natural. My Filipino boyfriend approves as well :)", "author": "Priscilla L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-30", "description": "The restaurant is in my neighborhood and the people here are so friendly that I hate to givee this place an average review but, really, the food just tastes average to me.   I've gone to this restaurant several times over the years and, except for the turon, have yet to find a dish that I trusty love and crave.  \n\nThe kamayan dishes are presented beautifully and are a feast for the eyes but just tastes ok.   Whenever I have a friend that likes to photograph their food, I will usually bring them here because they will usually enjoy the place based on visuals alone despite the so-so taste.  I love their coconut juice which is also beautifully presented.   But, again, I only get these foods for the photographs and not really for the taste. \n\nEverything else that Ive tried so far is below average.  The making of the halo-halo is usually inconsistent but usually below average.   I once ordered the pork sisig to go and was horribly disappointed since it tasted funny.  I ended up throwing it away, uneaten.  \n\nThe only thing that I crave from this restaurant is the turon (fried plantain desert).   The crispy caramelization of the outer wrapping coupled with the sweet plantain inside is just heavenly!   It's usually pre-fried and ready to go near their cash register so makes an easy grab and go dessert.  If you're ever in the mood for something sweet and yummy while in the area, you must drop by and try their plantain.  \n\nOverall, I rate the place as 3 stars since nothing, other than the taste of the turon and the visual appeal of their kamayan dishes and coconut drink, really stands out here.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "If you like Filipino food, this is the place to go! \n\nI've been to the Philippines many times. Here in the U.S., it's really difficult to find good Filipino food. There are a lot of options in California, but most are like Panda Express style Filipino food. Barely warm food that has been sitting and is just okay.\n\nThis place does it right! Walking in, you immediately get this feeling you just stepped into a Pinoy restaurant.\n\nVideokee - Check!\nTFC on the TV - Check! \nTagalog being spoken all around - Check!\nA combo smell of pork, seafood, and fried foods - Check!\n\nThe food here is really good, freshly made, and the portions are huge! I love the sisig and BBQ pork! It makes me miss the PH and the people!\n\nOn top of that, the staff is really nice...\n\nI also love that they are closing for nearly a month to go on vacation in July! Sign of a true family owned restaurant!", "author": "Bryan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "A visit to Pampanguena Cuisine was my first time dining at a legitimate Filipino restaurant and I have to say it was a full-blown success thanks to my fellow Yelpers, some of whom are Filipino and some of whom had tried this type of cuisine known in Philippines as kamayan style which is the traditional Filipino way of eating with your hands and is served on a banana leaf. \"Kamay\" is the Filipino word for hands and as a foodie who believes the most authentic experience you can have while traveling is to eat like a local and Pampanguena Cuisine is as close as I'm going to get to the Philippines. \n\nI arrived with a party of eight on a very warm Friday evening to Pampanguena Cuisine on Mission Street in the Excelsior District of San Francisco. These people all very top-notch Yelpers who take their eating and writing about it seriously. We have been wanting to try a traditional Kamayan meal for a long time and now the time was right. They don't take reservations at Pampanguena you just have to wait for a table. After finding out that Pampanguena Cuisine serves a Kamayan meal for six people for only $68.95 I was sold. With the \"Animan meal\" you get Chicken or Pork Barbeque, Grilled Tilapia, Grilled Squid, Grilled Pork, Flitter Shrimp (which are deep fried shrimp in panko crumbs), Lumpias (Lumpiang Shanghai as they call them), Salted Egg, chopped up Mango, Tomato, Onion, Sweet Yams, three huge bowl-filled scoops of white rice, Steamed Broccoli and Eggplant. Served on a movable tray on top of that banana leaf, it was feast fit for a king. Most of food we tried was excellent, including the lumpias which were a crispy golden brown that paired nicely with the Vietnamese Sweet Chili Oil dipping sauce, the deep fried shrimp were fresh from the fryer, the pork was nicely seasoned, and the veggies were steamed warm, the tilapia was a little too salty even with the vinegar that you pair it with, and the squid was a little too overcooked and therefore a little tough. I loved the salted eggs (oddly enough because I thought they'd be too salty but they weren't for me) as it provided a nice balance with the diced mangoes, tomatoes and yams.\n\nThere was so much food all eight of us could have eaten this huge tray of food and been satisfied. But since we were here we had to try some of the staples of Filipino cuisine, like the Pancit Bihon which is rice stick noodles sauteed with chicken, celery, carrots and onions. I liked but didn't love this dish as it lacked in a little flavor for me. We also ordered the Sisig Baboy which had marinated grilled diced pork topped with chopped onion and jalapeno served on a sizzling skillet. The Lechon Kawali which is deep fried pork belly was fried to perfection and was accompanied by a special dipping sauce. And since our meal couldn't be complete without the traditional Halo Halo with shaved ice, scoops of ume ice cream, condensed milk and sweet beans. It was so weather was so hot around us that the ice literally melted before our eyes, but it still was a unique treat for me.\n\nIn the end, our bill literally came to twenty dollars a person, which for a meal for eight people was a real steal. One of my dining mates even inquired about how much they sold a batch of freshly deep fried lumpias for and managed to make a deal for a hundred lumpias to-go for only thirty dollars! Yet another example of a dining deal in a somewhat unkempt area of town. They only take cash, and they don't have their liquor license, so no booze to go with your large meal. But I'll be back with family members so they themselves can try for the first time the unique dishes of the Philippines at Pampanguena Cuisine.", "author": "Jason F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "Thank you *very* much to Leah F. for finding a hidden \"diamond\" of a restaurant!!!  Who EVER knew that there would be a humble, simple yet DELICIOUS Filipino Kamayan-style restaurant in the Mission!  :)\n\nDue to this discovery, I believe I've been here, at the least, 5 times!  \n\n*EVIDENCE* that this restaurant has wonderfully comforting and good Filipino cuisine!  ;)\n\nAte Josie and Chef Michael have my continued support of this wonderful restaurant.  :)", "author": "Nan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Super fun experience with your friends or family. \n\nI went with a party of 5 and we chose the 6 party portion. It was fun to try the different meats and sauces. Tomato and mango paired really well with everything! What BBQ isn't tasty? I appreciated the vegetables to balance heavy protein too.\n\n Fresh and beautiful presentation.", "author": "Rebecca T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-28", "description": "I've tried Filipino cuisine a number of times, not my favorite because I find the dishes to be a bit too heavy. However, I'm still down to try dishes I've never had before & had been wanting to try out Pampaguena Cuisine given all of their rave reviews on yelp.\n\nWhile the kamayan style dinner platters are definitely a better photo-opp & Instagram-worthy, we opted for more variety & ended up picking a few different dishes on the menu instead. We started off with the Lechon Kawali (crispy deep fried pork) -- it's pretty similar to the chicharrones you might find at Hispanic restaurants. Very crispy, moist chunks of pork. I wasn't a big fan of the tamarind based soup which I found a bit too sour for my taste. The Kare Kare (oxtail in peanut based sauce) was interesting, the peanut sauce is not too thick & the oxtail was very tender. Definitely a dish that goes well with a bowl of steamy white rice. We finished off the meal with Halo Halo.\n\nThe staff was friendly & helpful. Parking in the area is tricky, hit or miss. Cash only.", "author": "Ruby C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "The Bay Area has no shortage of Filipino restaurants.   I think I've been to most of them.   Pampanguena is one of the best Filipino restaurants I've been to. It's on top of my list along with Kuya's in San Bruno.  \n\nEating here brings me back to my childhood in Manila.  Pampanga is a province of the Philippines known as the culinary capital of the country.  I grew up admiring Kapangpangans for their relationship with food and passion for cooking. \n\nThe BBQ for six \"kamayan\" style is awesome.  It's a medley of grilled meats and seafood served on a banana leaf, meant to be eaten without utensils by everyone.   I especially enjoyed the squid, perfectly tender and not overly seasoned.  Very healthy portions (well, \"healthy\" as in generous not \"healthy\" as in healthy.  It's Filipino food, c'mon).\n\nA few downgrades, not really about the food.  The restaurant is cold inside.  Plus don't go here if you're looking for a good looking restaurant with a nice ambiance.  It's not that nice inside.  And for some very strange reason, it's cash only.  I mean, are you kidding?  It's completely inconvenient.  TOTALLY RIDICULOUS.  Also, parking is a pain.  If you can withstand all of these non food related drabs, you'll enjoy the experience of good food. \n\nFinally, the proprietors are very lovely and friendly folks.  You can tell they take great pride in their food, just like kapangpangans.  I wish the very best for this restaurant and hope they continue to do well.  But for heaven's sake...Stop the ridiculous cash only  practice!", "author": "Angel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Was in SF for a work conference, raised in SoCal, but now live in Hawaii.  There's a big Pilipina/o population there, but I haven't found a joint that does kamayan style.  So I yelled this spot up.  I was by myself but really wanted the kamayan, so I ordered the player for two.  Frankly, it looked like it could feed three.  The staff was extremely courteous and constantly checked up on me, maybe to make sure I didn't need to go to the hospital from the inevitable food comma.\n  \nAnyway, the meal was on point.  Massive amounts of BBQ chicken, pork, a whole fried tilapia, okra, steamed egg plant, broccoli, sliced mango, sliced tomato, and two salted egg.  Just for about 25 bucks.  The salted egg was the right consistency and flavorful without being overly salty.  It was probably the best salted egg I've had.  I love them to death, but with pre-hyper tension I gotta reduce the sodium intake.", "author": "Frederick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "Eating with your hands is such an organic way to feed oneself. There's something so satisfying about caving in to this oral fixation.  Then factor the smell of the banana leaves and rich aromas coming from the variety of fried goodness balanced out by veggies- what a way to experience Filipino cuisine! \nJosie is so  hospitable and genuine - you can tell that she enjoys cooking/serving her customers. I highly recommend Pampangueña for bigger parties - actually there is an option to  order a la carte. My buddy and I opted the kamayan style for 2- we were in disbelief when the food came- it looked like a platter for 4. Although more is never a problem as there's always take home. I especially enjoyed the mango with baggoong (shrimp paste)- great way to clean the palate. \nTip- According to Josie - you can order ahead for dining-in to cut the wait time. It does take awhile to prepare all that food- no matter - TFC (The Filipino Channel) plays on the Teli- catch up to your Pinoy variety show and Telesera.", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-20", "description": "Sadly, they don't serve the silogs all day on weekends. The server recommended the binalots (meat, steamed rice, eggplant, grilled tomato, and salted egg). She let me sub in garlic rice for a $0.50 charge and it's worth it. I love garlic rice! It was my first time getting a binalot dish and I didn't really like the sides. My boyfriend liked the eggplant though. I got the sisig binalot and he got the bbq chicken binalot. The sisig was too salty and too spicy from the jalapeños but the flavors were really good. I was able to push aside most of the jalapeño pieces and the rice helped balance the saltiness so it was okay. I've had better sisig elsewhere. The bbq chicken was really good. I love the slightly sweet and charred smoky taste of Filipino bbq. \nI also tried the lumpia and it was okay. It wasn't piping hot so I feel like it might've been sitting out for a while. \nThe service is super friendly, but the food is mediocre. Finding parking wasn't too difficult on a Saturday evening and there was no wait at the restaurant!", "author": "Emily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "Came here after a long walk. The breakfast menu was available all day and costs $6.50 to $8.50.  They all had garlic rice which was flavorful and garlicky, two fried eggs and tomatoes.  Overall the food was decent, a nice place for a quick lunch.  Noticed the customers were all Filipino, that means the food is authentic.  Worth a visit, if you are in the neighborhood.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-05", "description": "Expensive, but good. Went with my family. Probably won't come back. It looked nice online, but it was smaller and kind of dirty. Service is not that great. We were standing for a long time before realizing we just seat ourselves. They assumed we should know how it works there. For high dollar prices i expect high dollar service", "author": "Laura B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "So delicious!!! I love local joints like this and you can tell the people working there really cares about the food they put out. The only thing that was the downside was the squid was missing on our orders and the food was just too good for any of us to realized that was missing. With tax and tips, $20 per person and a full belly of yummy food. Come check this place out!", "author": "Sappho C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "Cheap, fresh and delicious with a family atmosphere and feeling. It somehow tastes better when you eat with your hands :)", "author": "Jasper P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-01", "description": "This was my first time going to this Filipino restaurant. I read from other reviews it's a mom and pop restaurant not too far from my house. It's a small restaurant with street parking and it is cash only. I met the owner and her daughter and they were so nice.  Their menu is pretty extensive with beef and pork dishes, seafood and soups. I was torn between the pork adobo and sinagang ng baboy which is a tamarind based broth. The owner herself recommended the sinagang so I went with that and I was surprised that it was a huge bowl for sharing. The broth was very tasty and you could taste the tamarind in it. It had chunks of broccoli, baboy, and some peppers in it. I definitely made 3 meals out of it. I also noticed the table by me had a spread on their table with palm leaves and their food wasnt on plates but on the palm leaves itself. She recommended me trying that next time, but I'll definitely need to share with my family since they are family size portions. All in all I'll definitely be back especially to try the pork adobo next!", "author": "Dianne E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-10", "description": "3.5 stars. \n\nWe ordered the platter for 2 people with lumpia, grilled tilapia, BBQ chicken, grilled pork, steamed broccoli, okra and eggplant. The lumpia are the best - it's fried spring rolls done Shanghai style, crispy and flavorful. and I liked the tilapia. But the steamed vegetables are flavorless and I didn't like the dish sauce that came with it. The grilled pork & BBQ chicken was a bit too salty for me. \n\nAll in all, great value if you like the individual things within the platter. If I come back here, I would probably just order individual dishes given my taste preferences.", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "Food is good , some unusual ingredients on the classic filipino food. Like zucchini on the kare-kare and broccoli on the sinigang. Service is pretty slow. Cash only.", "author": "Kristina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Food was super good! Home-cooked taste. It's really fun eating with your hands (or kamayan) when you're not in the Philippines, since it makes you feel right at home.\n\nTheir servings are quite good and the prices are reasonable --- we ordered the Tatluhan (good for three people) and we were able to finish it. Not too much and not too little.\n\nThe only tip I can give is that even though the store says it's open at 10, they open at 10:30-10:40.", "author": "Raine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "Authentic Filipino food that will wow your palate and stomach! Extremely friendly service too.\n\nWe shared the 2-people platter between 3 (hungry) females and it was the perfect amount. The platter was an assortment of carbs (2 bowls of white rice, mixed with diced mango, onion, and tomato), protein (grilled fish, BBQ pork and chicken), and fiber (broccoli, eggplant, and okra). I loved the variety and how each component complimented each other in the mouth. \n\nThe service was one of the friendliest I've seen. The owner explained to us about the sauce, and how to mix the rice and diced mango/onion/tomato together. They really made sure that we are enjoying our dinning experience there. It makes me happy to see how passionate they are about this restaurant and the food. \n\nAffordable pricing. $12/person and we had no left over and did not feel gross from overeating. \n\nPlenty of street parking near by.", "author": "Wendy F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-07", "description": "Service was prompt. We were immediately seated during our visit.  The server was very courteous and patient.  \n\nTheir food was so so.  It wasn't bad, but I wouldn't say spectacular, either.  It's a good place to get Filipino food if you're in the area. But I wouldn't purposely drive gete just to get my full of Filipino cuisine.", "author": "Rochelle 'Shella' T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-30", "description": "Came here and arrived at 6:15 pm. It says it closes at 7:00 pm and when I got here she said she doesn't accept ppl in after 6:30....it was barely 6:15!!! I was about to go HAM and order the whole damn menu and it was just 2 adults 1 child. I guess it's there loss because they could have made good money. But If you close at \"7 pm\" you need to honor that or let ppl know u actually close at fucking 6:14 pm on the dot. If you come here make sure it's like 5 hours before closing time to be safe.", "author": "Secret L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "I finallyyyy made it here after drooling over the pics since I've arrived to the Bay Area (after it was featured on Yelp's ROTD). I must tell you, I love places like this - family-owned, big portions, food made with love, and no sticker shock. It's refreshing to pay $10-15 for a great meal served with warm hospitality. It's one of those family businesses that you cheer on because they are so warm to you. The service really made my day because they serve everything with a smile and welcome you to their restaurant like family! \n\nWe ordered the family style meal for 2 (split between 3). It came with grilled fish, two piping hot bowls of rice, salted eggs that you mix with a mango/tomato/onion salad, lumpia, grilled pork, chicken, vegetables (I think I have it all?). Although to be completely honest, I don't think the Filipino food is up my alley, I do think if you enjoy it a lot, you would love the food here! \n\nAlso, the place is super kitschy and cute. Karaoke, Filipino drama, and cute and adoringly tacky decorations on the wall, this place really stole my heart. :)", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "Came here for dinner on a Saturday with 2 other friends around 7:15 and was able to get seated immediately. The server told us they had been swamped up till then and that we came at a good time, so we got lucky!\n\nOrdering food here was the simplest thing ever. We opened the menu, agreed on getting the 3 person platter, and that was that! I love how quick and painless it is here. Yes there are appetizers and entrees you can order a la carte, but since it was our first time here we wanted to get the platters that this place is known for.\n\nOn the platter there was:\n\nLumpia: the fried lumpia rolls were solid. There was enough for 2/3 per person\n\nFried shrimp: it wasn't as crispy as it could be but it had good flavor\n\nBBQ chicken (or pork): the chicken was kind of fatty but other than that it was good\n\nFried fish: it's so interesting that they serve the whole fish fried. It was kind of hard to eat since it came with all the bones and I didn't have chopsticks to pick out some of the bigger bones (had to resort to using my hand instead), but other than that it was fine\n\nGrilled pork: this wasn't my favorite as it felt just a little bit tough to eat, but there was a lot of flavor\n\nGrilled squid: surprisingly good given that I don't like squid that much. It was on the salty side but this might have been my favorite meat on the platter\n\nSalted eggs: these taste exactly like the salted eggs I grew up eating at home. I haven't had one of these in a looooong time so I was really happy the platter had them. To be fair, it was super salty so I had to eat a ton of rice with it, especially with the egg white, but it brought back many happy memories of eating them with my parents.\n\nSteamed veggies: these were all kind of bland. I ate a couple pieces of the broccoli but didn't touch the eggplant or the okra\n\nRice: there was soooooo much white rice on the platter, portion-wise definitely more than a bowl per person. Good thing we were all pretty hungry!\n\nAt the end they gave us some sweet potatoes in a sweet syrup as dessert on the house. These were pretty good, but at this point I was pretty darn full so I only tried a piece or two.\n\nOverall I really enjoyed the food and appreciated how much rice we were given to eat with everything. We demolished everything and only some of the veggies were left at the end, so if you come in hungry you can definitely finish the whole thing!\n\nThe food is 4 stars, and my last star is for the service. I loved our server who was really nice. I pointed out an oil stain on the table from the previous patrons, and he came over and scrubbed very furiously at the spot and apologized really nicely for missing the spot when he was wiping down the table earlier.\n\nParking is a pain in this area, watch out. I circled around for 5-10 minutes before I got lucky and saw this tiny street parking spot a block away from the restaurant. Definitely carpool if you are planning to come here with friends! I'm so glad we did.\n\nOur total came out to $17 pp after tax and tip.", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "Pretty good food, really friendly service, seems like a true Authentic Filipino place. Definitely probably better to come in a large group so you can order al ot and try a good variety. We only ordered the Sizzling sisig and the lechon kawali. Both super good and solid, crispy, yummy! Will definitely return.", "author": "Vivian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "4.5 Stars\n\nThe service here is excellent! They are super friendly and attentive. \n\nThere were 7 of us so we ordered the kamayan animan (for 6 people), lechon kawali, relyenong talong and sisig bangus. We also ordered fresh coconut juice, calamansi, mango juice and guava juice. The juices were good; I liked that the coconut juice was serviced in a coconut. \n\nThe food was delicious. Everything was brought out in a timely manner except it took a little longer for the sisig bangus to be served. The kamayan was more than enough for us; we had leftovers to take home. The kawali was meaty and tender. I pretty much only eat eggplant when it's prepared as talong, and this one was good. \n\nFor dessert, we ordered halo halo and two leche flans. The leche flan was super, super creamy. So good!\n\nPampanguena is such a chill and casual place. Will definitely be back for the kamayan again.", "author": "Rose A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-23", "description": "Hella food. \n\nSo this Filipino restaurant was featured on YELP for an ROTD review and I quickly bookmarked the place. I was checking their photos and I began to salivate as I scrolled through them and I finagled the Wifey into eating here a week later on typical cool and foggy San Francisco day. It was a just before lunch time on a Saturday and parking along Mission Street is always a challenge, but we managed to find a spot across the street. \n\nFirst impression of the place was a typical Filipino joint with decorations that is fitting more for a seafood restaurant with a nautical theme of fish, lobsters, seahorse, dolphins, crabs and anchors adorning the walls. I don't know where they got these from, but it seems like they got them from a yard sale and just hung them up for decorations and they looked out of place against the bamboos and tropical thatch shingles that are more appropriate decorations, IMHO. However, nothing screams Filipino like Karaoke and they definitely had that. \n\nOK, we weren't here for the decorations and we were here to order their \"Kamayan Style\" dishes and they did not disappoint. We ordered the \"Tatlohan\" for three people and sat back and enjoyed looking at the other patrons' orders as they were delivered to their tables as the Kamayan was the popular way to go. Kamayan means to eat with your hands, and you certainly had that option as there is a sink just in front of the counter for you to wash your hands if you choose to do so, but they also offered utensils for those who didn't want to go commando. Hey, eating with your hands is one of the most natural things there is in this world. \n\nUpon receiving ours on a bed of beautiful banana leaf covered straw platter, I had to quickly take a photo and marvel at what was in front of us: A cornucopia of different types of Filipino food that was well balanced from different textures ranging from crunchy, crispy and chewy to flavors from savory, tangy, salty and sweet. We dug in like hungry teenagers just coming home from school and left no evidence behind that such a scene was committed. In other words, you won't be leaving hungry and be prepared for leftovers if you're a light eater. \n\nI also have to give props to the service since it was definitely exceptional. I don't know if he owns the place, but they guy with the mustache was one of the friendliest and happiest person I have ever met working in a restaurant as he surely made it an enjoyable experience. \n\nLike General Douglas MacArthur said to the Philippines during WWII, \"I shall return.\"", "author": "John G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-16", "description": "If I wanted leftovers, I would have ate at home. This place was so gross, we poked at our food and couldn't wait to leave and eat something else to wash our pallet off. The food was not fresh, it was microwaved or thrown in the deep fryer to reheat. The taste was terrible. Service was bad and dirty.", "author": "Gloria T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "Tip: Cash only!\n\nTasty food! good experience. Luckily we found a spot right in front of the restaurant, but parking in this area can sometimes be difficult.\n\nI came here for lunch on a Sunday because it was nearby. The place was crowded so the service was a tad slow in taking our order. Otherwise, they were super friendly and explained how to mix the food to us. We ordered the 2 person platter for $27 with chicken bbq, and ordered an additional pork bbq skewer so we could try both. Great value for the size of the platter and will definitely be enough for two.\n\nIt came with fish, grilled pork, bbq chicken, veggies (okra, broccoli, and eggplant), diced tomatoes and mango, lumpia, two salty eggs, and rice. A big amount of food for two people but we easily finished it all....The lumpia was nice and crispy. The veggies and mango/tomato was okay. Excellent meat and dipping sauce. We were quite satisfied and will be coming back again.\n\nGreat, authentic food, and casual family style place.", "author": "Christina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Come hungry - and come with people. There is a lot...and i mean a LOT of food.\n\nI can only write a review for the Kamayan style dinner which is a set meal for 2, 4, or 6+ people. Basically they present you with a ginormous assortment of grilled chicken/pork, lumpia, a whole lot of vegetables, and fish as well as an assortment of sauces (or, what I would call crack sauce because it's SO good)\n\nService was pretty great too - I went once a few weeks back and when I came back, the owner/dude knew me as the guy who \"asked for the secret sauce recipe\".", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-22", "description": "First off the female greeter is hot\nThe steaks are not, but the kabobs will have you slapping your pop!!! Kabob Beef was tender and hot. The chicken was breast meat and juicy....love the basmati ricewill be back for the kabobs, not the steak!", "author": "Al T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Went to Pampanguena Cuisine today for a birthday party and we had the kamayan. Everything was delicious. Authentic filipino food kamayan style (using your hands). It had everything - grilled squid, fried fish, BBQ chicken, salted egg, mango, tomato. YUM!!! I kept wanting to eat more but I know I shouldn't. The staff was also very attentive and friendly.", "author": "Glenn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "4.5 STARS\n\nA group of friends had a joint birthday party last weekend. Since there was lots of liquor, we needed food. They decided to get some party trays for takeout from Pampanguena on Saturday, March 19th.\n\n*Lumpiang Shanghai: CRISPY, DEEP FRIED PORK EGG ROLLS\n*Pancit Bihon: STIR-FRIED RICE STICK NOODLES SAUTEED IN CHICKEN AND ENRICHED W/VEGETABLES\n*Barbeque: GRILLED CHICKEN MARINATED WITH OUR SPECIAL SWEET AND TANGY SAUCE\n\nThe grilled chicken skewers were huge and so good! I ended up eating two of them over the course of the night. The chicken was moist and tender with a nice char. The sauce, savory with a sweet tang. I loved this dish! The pancit was lukewarm when I got there, so the noodle texture was slightly hard. The flavors were really mellow, but I wished I was there to try this dish hot. I love stir fried rice noodles. Since I wasn't eating red meat, I didn't try the lumpia. It was very tempting though. Everyone seemed to love them and it was the first item to go.\n\nTheir bbq item was delicious. I'd love to visit the actual restaurant to try more things. Especially now that I can have red meat. Give me lechon, lumpia, sisig and more! My mouths watering just thinking about it. Yum!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-19", "description": "A very chill and relaxing place to grab a bite to eat whether it be for lunch or dinner.\n\nCame in today for dinner and had an amazing meal. \n\nParking was easy but it can be very difficult to find around this particular area. Most of the parking is metered so be prepared to bring quarters or have a card on hand for the machines.\n\nWhen you walk inside you see the seating to your left. There will probably be someone near the entrance as well to seat you and/or give you a menu as well. The servers here are very polite and gracious. They really seem to go out of their way to make sure you are attended to you. For that, I am very appreciative. \n\nAfter being seated I received a menu and everything looked amazing. They have a lot to choose from but I tend to be very consistent with what I like to eat at Filipino restaurant. Usually  I get adobo and bistek but today I decided to change it up!!! I decided to go with the Kaldereta and the sisig. It has been a long time since I last had either and figured why not be adventurous here, especially since the reviews are so good. Of course I had to get some lumpia as well because what would a Filipino meal be without lumpia!\n\nAfter placing the order I waited patiently. As expected, there was a TV with Filipino broadcasting on, TFC (Sometimes you'll see GMA but that tends to be rare). This place wasn't too busy either. There was only one other group here when I arrived so I figured it would get busy later on. \n\nBe advised that this is a CASH only business so keep that in mind. There is an ATM located inside but it is currently not working so you will most likely have to go to the liquor store at the corner to get cash or stop by the bank before coming here. \n\nIn regards to the food, everything tasted great. The lumpia was good. I liked that I could get a lot of pieces for so cheap. The sisig was OK but it seemed like there was more fat than meat but maybe I just being picky. The Kaldereta alright but it seemed like they might have put a lot of ketchup an tomato sauce in it to make it taste more flavorful. I did however like the peppers that they put in the Kaldereta, nice big pieces making it spicy!\n\nMy satisfaction with the meal is without a doubt FANTASTIC. But, getting a functioning ATM and/or becoming an business that can accept ATM and credit cards would make a big difference. I think I would come back to try the desserts here since I did not have enough room in my stomach after filling my belly. \n\n#salamat", "author": "Robert F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "Josie and her team were able to make a special catering request to cater fresh made Halo Halo at\nmy wedding. They were very accommodating and easy to work with. Their halo halo gave our guests the taste of my Filipino culture and that was very important to me. Thank you and your family for being able to accommodate us. It was one of the highlights of our wedding. Our guests enjoyed one our finest homemade authentic Filipino desserts for the first time!!  The only downside was it was pretty pricey per halo halo. Other than that we have no regrets.", "author": "Kristine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "It was my first time going to a Filipino restaurant. There's usually none around in SoCal so once I got here, I needed to try it out. The family owned restaurant is so welcoming and friendly. Not only are they friendly, but the food is amazing and very traditional. It's crazy how much variety there are and everything is so filling. The food served my appetite well. \n\nThis place is a must go type of restaurant. I loved everything about it. I would definitely come here again.", "author": "Don C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "Let me start by saying that I would totally come back to this restaurant. I'm Filipino and I think I'm pretty freakin' picky when it comes to Filipino food so for me to say that I would come back says a lot. I've been looking for a good Filipino restaurant and I'm happy to say I've found one.\n\nPROS:\nThe lechon kawali, fried pork, is delicious. It was my favorite dish and let me tell ya, I usually don't eat this stuff because it is a heart attack waiting to happen. But seriously, it is good and surprisingly, it didn't come out all hot so I was skeptical but the texture was crispy and tender on the inside. \n\nThe garlic fried rice is good. I love love love garlic and the fried rice sure does have a wonderful and garlicky rich flavor.\n\nThe grilled bangus, milkfish, is also good. I ordered it with the diced tomatoes, onions, and mangoes on it and I think it would have been better without it.\n\nCONS:\nWhile we were eating, two homeless-like people came in and I guess wanted money or something. From what I remember, I was told they come in because the customers tend to give them money. One of them was this lady and I had to say out loud, \"Excuse me\" so one of the workers in the back could escort her out. If I would have waited a little bit longer to say excuse me, the stuff running down her noise may have dropped in our food. I know, ewww.\n\nThe Kare Kare, pork stew in peanut butter, was OK. It was more on the soupy side and I prefer the sauce more thick and heavy. \n\nOverall, it's a good Filipino restaurant and the service is excellent! \n\nPS. They got karaoke inside.", "author": "Loreto D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-12", "description": "Came here ON A SUNDAY afternoon around 3pm. It was EMPTY. Place seemed decent. \n1- it is cash only \n2 we didn't wait I wanna say more than 15 mins for our food.\n3-ordered the 3 serving and it was a plentiful amount of food that w head hella leftovers to take home. I mean maybe it's just how I eat but ya we had leftovers. \n4- food quality was ok. It wasn't great and it wasn't not great. It was just ok. I've ate kamayan style before and I think it taste wayyyy better. Like really I'm not hating on this place at all, the food just didn't have me feeling like \"oh shit this is bomb\"  so it was just ok. We didn't order any of the other food BUT the 3 serving so I'm only basing it off of what we ordered.\n4 service was GREAT. No issues no nothing. Very helpful and always attentive. They even chopped it up with us for a bit which was nice since it was just is. And I never had to ask for anything. Like more water or napkins or anything like that. \n\nWhy knock off one star only because they ONLY except cash and the kamayan style meal we had didn't AMAZE me.  But really. No hate on this place at all. I would come back here to try the other food AND would refer people to come here to try it themselves. I mean we all have different taste right.", "author": "Eliza O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-04", "description": "I ate at Pampanguena to celebrate my brother's birthday the other week. We had reservations for 11 people and ordered the Kamayan style dinner for 4 and for 6. All the Kamayan style dinners come with the same items, just more or less of them depending on how many people it's supposed to serve.\n\nThe meals came and after scrambling to take a bunch of pictures, we finally dug in. Remember to mix up some rice, onions, mangos, tomatoes, and the salty egg! My favorite meat was probably the bbq pork. The sauces were also really good! They had the traditional vinegar (use for tilapia), shrimp paste (use with anything!!!), sweet chili (use for lumpia), and a sort of soy sauce-ish one (also good with anything!).\n\nMy family also ordered fried lechon and diniguan on the side. Both were delicious!!! I especially loved the fried lechon and the brown sauce... Mmm.. Tender meat with a crunchy outer crust!\n\nService was very friendly and accomodating to our large party. Pampanguena is definitely a fun place to bring your friends who have never tried Kamayan style Filipino food!", "author": "Tara A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-21", "description": "Cash only folks, in the Excelsior district, spot is good, you can eat kamayan or regular, let me break down what we sampled and how it faired\n\nShanghai lumpia - standard short, piping hot\n\nlechon kawali - deep fried pig skin, meat and fat how can you say no to this\n\nsisig baboy (pork) - sizzling plate of pork with jalapenos and onions, missing the fried egg on the top, not one of my favorite dishes here, the meat tasted tad rubbery/old\n\nkare kare (oxtail in peanut butter stew) - my measuring stick for most filipino dishes revolves around how well they can make this dish, here they made everything above par, heavy stew not watery, no extra seasoning needed (fish sauce, bagaoong), the string beans were super fresh they put them into the stew probably when they were bringing it out, made the string beans lil too fresh. the oxtail portion was decent, I would order this again\n\nchicken adobo - standard, saucy, vinegary, not oily, heavy portions of chicken\n\nfor what they offer everything is good, I do recommend bringing 2 friends so you can sample more then just your regular silog plates\n\nagain cash only, atm inside\n\nfood **** everything was good, sisig was not my favorite\nprice $$\nservice **** friendly, helpful\nambiance *** clean, bambooish decor, if you order kamayan leaves on everything", "author": "Clarence A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "We've tried Kamayan Style and it's super good. I highly recommend this place! It was really fun experience with family/friends, good service and great place! We'll come back again.", "author": "Maeda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "Lordy lord, where have you been all my life? OMG, if you havent tried pampanguena, you need to. This place is amazing and the food + service is on point. Basically in a nut shell, get the family style, Kamayan style dinner for either 2 people, 4, or 6 + folks and eat to your heart content. You will be presented with an assortment of grilled meats, lumpia, veggies, and fish to share among friends and family. The owner is so sweet and he encourages you to try everything. It's definitely different than what majority of the Filipino restaurants serve in the city. The owner emphasizes \"healthy\" eats. Take a look at the picture and do yourself a favor and just come here and come hungry. Also note, it's cash only :)", "author": "Diane T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Josie and staff are the best! We always have them cater our parties at work and they have the best Filipino food in the city!", "author": "Loco Moco M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "So grateful to experience this wonderful restaurant in the outer mission. I had no issues making reservations the day before for a group of 8. We had a very warm greeting from the workers and we  were seated right away. I believe the owner took our order and he was very friendly and patient with us. We decided on the kamayan dinner and it exceeded beyond my expectation. It was very delicious and it was plenty of food for us. I especially love the presentation. The price was great $$ I think per person it was $20 a person and that's with gratuity. I highly recommend you experience this gem .. it's definitely worth it. Great food. Friendly service. Authentic Filipino experience.", "author": "Ahline C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "Food was good. Ambience is nice but place was ok. But will definitely come back for the food. Btw, sadly, it's CASH ONLY.", "author": "Love C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-30", "description": "My husband and I went there for dinner last week. He's from Pampanga and loves to cook. He was not impressed with the authenticity of the food. I ordered (something \"safe\" for a mid-western American like me) barbecued pork skewers and streamed rice. I was impressed. It wasnt too sweet and was all lean meat. The portion of meat was impressive. Some of the best Filipino barbecue I've had. \n\n After we got our bill, I found out they didn't take credit cards. The waitress pointed to this makeshift ATM machine in the corner of the restaurant. I reluctantly used it and returned to the table. As we sat there counting out money for a tip, a homeless man tapped on the window and pointed at me. I tried to ignore him until he walked into the restaurant and stood at our table asking for money. We got rather frustrated and just wanted him to go away. My husband gave him a couple bucks to get rid of him. I doubt this incident would have occurred if I could have used a card, as I doubt the pushy, fragrant man took credit cards.\n\nWhy would a business not take credit cards? Are they doing something shady and don't want a paper trail? Please don't blame credit card fees, everyone knows they exist and they just get passed on in the price you pay. Not carrying cash is not just convenient but SAFER. \n\nI don't know the city all that well but this didn't seem like a bad area. They need to hire a security guard and  get a credit card machine.", "author": "David B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-16", "description": "My mom ordered the Kamayan for 2 and we were the only customers in the entire restaurant and it took nearly 40 minutes to put together? It was missing the fried lumpia and the lady said she was waiting for it to finish frying and that they'd bring it out ASAP so my mom and I started eating.. ready for the kicker?.. The cook was rushing to get the lumpia to us and as she was pouring them out of the frying basket, one fell on the floor... no big deal, it was just one piece.. BUT WAIT! There's more... the lady comes chasing after the loner lumpia that fell on the floor, PICKS it up and PUTS IT BACK ON OUR PLATTER!! Holy shitballs, you guys, I could not believe what I had just witnessed. \n\nSorry to say but after being here numerous times, after that incident, I will not be returning.", "author": "Kat P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-21", "description": "We come here to try eating foods with our fingers. It's amazing,  delicious and tastes very good. I would recommend to others. Cash only.", "author": "Popoy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "Best Shanghai Lumpia in town!! 100 pieces for $27, great for parties and pot luck. \n\nCash only!", "author": "Sam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Excellent Filipino food.  Family run, mother daughter, Aunt.  Fantastic service, attentive, you can see them getting regulars by name.  We got the platter for 3 and it fed 5 of us with leftovers.  Also got a side of lechon and sigsig.  All excellent and on point.  Garlic fried rice had the right balance of garlic and crunch.", "author": "Jing K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "Another SF Adventure!  Joseph A. recommended this place to us and he was right!  We came early so we were the first customer.  Josie the owner greeted us and welcomed us to sit anywhere.  The restaurant had lobster, crab, and seahorse decorations.  While we waited for our food we watched the Filipino Channels. They also offer Kamayan and preset menu for groups.  \n\n::Drinks::\nI got fresh Coconut Juice, it was refreshing. \n\n::Food::\nWe got Bangsilog which comes with a boneless milkfish, garlic rice, two eggs, tomato and cucumber slices.  I thought the milkfish could be a little bigger.  The Sisigsilog also came with garlic rice, two eggs, tomato and cucumber slices.  The Sisig was topped with fresh onion and green pepper.  It didn't have crunchy pieces but it was still good.  We finished everything and the portion was just right. The only thing I would request for when I come back is the egg, I prefer it to be sunny side up.  \n\n(http://www.yelp.com/user_local_photos?select=hsbQervgaDUQT6tbaSlWLA&userid=NO5e0WtLAOYcjheLU6OEVg)\n\n(http://www.yelp.com/user_local_photos?select=Zxt_Ib8b94PKUEZ8i5hdcQ&userid=NO5e0WtLAOYcjheLU6OEVg)\n\n::Customer Service::\nJosie was very attentive and friendly.  She even took the time to chat with us for a little bit. \n\n::Rating::\nI would come back here again. Customer Service was great and we enjoyed our food.  Overall, 3.5 Stars and rounding it to 4. \n\n::Tip::\nFree WIFI just ask for the password\n\n::M's Notes::\n-ATM Machine \n-Street Parking\n-Indoor Seating\n-Catering Available", "author": "MarVy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "Generally I would not give 5 stars to restaurant that had a broken credit card and ATM machine, and didn't have the first item I ordered (Adobo Chicken), but everything else made up for it.\n\nI had just moved to the neighborhood and after some initial unpacking, I needed to grab a late lunch. I had already gone north into Glen Park, so decided this time to head south to Excelsior. Very conveniently or dangerously, one of the closest restaurants to me is Pampanguena Cuisine. Growing up in Miami, there isn't a large Filipino population. And while I was friends with many at UCF in Orlando, there weren't real restaurants to go to. Since moving out here, any time I have the option to eat Filipino, I go for it.\n\nI walked in to a table of four finishing off their family plate, and a few other tables with people. The nice waitress quickly got me seated while she was doing three other jobs. Looking over the menu was tough - a lot of seafood options, some standout pork, chicken, and beef dishes, and plenty of noodles. But as I was tired due to moving, I wanted to go simple - adobo chicken and meat lumpiang. \n\nThis is when if it were another restaurant, it would be lower stars - first I was told they didn't have any adobo chicken left. But they did have pork, and like I'm going to turn down pork? Next was their card reader was broken. I did try their ATM, but that didn't work either, so had to run down to the donut shop (speaking of which, I should head down there this morning) and get cash. \n\nWhen I came back in, a Filipino couple joked \"Had to get your fix?\" We talked for a bit and they told me what they had ordered - the beef stew and the boneless bangus, and had loved both. Some things to try next time!\n\nAs for my order: the Lumpiang were really good, nice and crispy with a tasty filling. For the money they give you a lot, and it took a lot of willpower to save half for dinner. My main meal was the adobo pork. Delicious. A good mix of meaty and some slightly fatty bits, and the sauce had the perfect amount of vinegar. While I did have half for dinner, it was tough not licking the plate clean.\n\nBefore I finished a regular party came in, and instantly ordered the family meal for 6. The great waitress suggested I stick around and check it out, as did the owner/chef who came out to talk to the family. When it was brought out, I was impressed and liked that the owner told me to take a picture. She either knew I was a Yelper, or was really proud of her creation. Regardless, I now want to get a group together to eat it ourselves.\n\nSpeaking of the picture, I posted it to Facebook and all my Filipino friends back in Florida raved about it. The second they saw the banana leaf, they knew it was legit, and when I told them that silverware was optional, they were jealous.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-21", "description": "I've been searching for a place that has really good sisig & unfortunately after trying to place, I'm still on the hunt for that. \n\nI got the sizzling sisig and it was good but there wasn't any wow factor to it. The pork was a little dry and not tender or moist at all. It wasn't the traditional sisig. I did like the onions and jalapeños  on it which gave it a nice kick. \n\nThis place is *CASH ONLY* but they do have a ATM inside which I won't count on. My BF went to get cash from that very old ATM machine and no money came out!! The funds has been drawn out from his account as well. So we told the lady that worked there which I assume is the owner, and she accused my BF of having no money in his account. *insert rolling eyes emoji here* Good thing we were only missing a few bucks and found cash in his car. \n\nAt first we wanted to come back to try the kamayan but after that incident & the food being just average, we probably won't be coming back.", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "My first Filipino meal! After a coworker of mine brought some tasty lumpia to work, I was hooked! I have bookmarked Pampanguena for awhile and while searching for a Filipino restaurant on Yelp, this popped up.  \n\nGot there early so there's no line and I was lucky to find a parking space just right across the street.  \n\nI am guessing it's the owner and the owner's wife that's serving us and they were so very friendly.  Told the owner it was our first time having Filipino meal and he explained to us how to eat and what the food was.  Very down to earth and made us feel right at home.  \n\nThey use banana leave as plate and we were told traditionally food is eaten with the hands.  He also provided some silverware for those who aren't accustomed to the traditional way of eating with hands. \n\nWe ordered a two person platter and an order of 20 piece lumpia.  The lumpia came out freshly fried and pipping hot, just perfect.  The platter looked like a feast and came with a variety of dishes including pork, chicken, whole grilled tilapia fish, rice, mango/tomatoes/salty egg salad, and lumpia.  I devoured the entire fish including the fish head, it's that good! \n\nThey also gave us complimentary pickles and sweet yams to try.  Very simple but yet very tasty!\n\nAn excellent local family owned business that deserves 5 stars!", "author": "Shirley H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-25", "description": "Finally got to try this place and do kamayan style for our holiday get together (12 people.)\n\nFood = Great. \n\nAniman kamayan meal (says for 6 guests--IMO, could be 7 or 8 people) comprises of pork (or chicken) BBQ, grilled tilapia, grilled squid, grilled pork, flitter shrimp, salted egg, lumpiang shanghai, mango/tomato/onion, sweet yam/steamed rice, steamed seasonal vegetables, & steamed eggplant) = excellent. The various cuts of meat had delicious flavors, not dry; perfectly cooked fish, squid and excellent sides. The seasonal vegetables were okra, and they were ever so good (perfectly cooked and not slimy.) $68.95 x2\n\nSinigang hipon (traditional shrimp and vegetable soup (tamarind base)) = tangy, clear broth, and perfect with all of the food. $12.95\n\nLechon kawali (deep fried crispy pork) = delicious, crunchy and I took home the leftovers.  $12.95 x2\n\nChicken silog = one of the lunch companions couldn't resist the fried egg, chicken combination and had to get it. $8.50\n\nHot tea = $1.25 x7\nGuava juice = $2.95 x1\nCalamansi juice = $2.95 x3\nCoke = $1.25\n\nService = super friendly, polite and efficient. \n\nPrices = reasonable to moderate. Total lunch for 12 with plenty of leftovers came out to $229.52. BTW, bring cash as they accept only cash.  (They do have an ATM inside.)\n\nThanks for taking care of us and not shoving us out after 2 hours of eating and chatting! And for taking our picture outside! We'll be back.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "This place was delicious! Their service was on point! I usually don't think much of Filipino restaurants since we can make and eat these same foods at our own home but this spot was  worth driving all the way from Hercules from! Their kamayan style 6 person meal was able to feed 8 people in my family and then some! Everything wasn't too salty or greasy which can happen sometimes for Filipino restaurants but this place had all the right flavors! Already planning our next trip back!", "author": "Krizta R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-14", "description": "Food is delicious. Just wish the service was a little better. I get that you may be hungry and want to eat during your shift but at least dont ignore us when were the ones hungry as well.\n\nAnother occasion we were given attitude when i asked for utensils. I come here for the food, not the experience :)", "author": "Marvin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-09", "description": "Came here to attend a family graduation reception lunch. The food was really good, and plentiful. Lots of choices were served, most of the food was served boodle style. Some of the other saucy dishes were served separately. Service was very attentive. Food was really good. I would recommend this place to anyone who likes Filipino food.", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Excellent food! Thank you, Tita Josie for cooking yummy food for our son's 1st birthday party!", "author": "Leslie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-04", "description": "Ordered Kare-Kare, Bangsilog, Pork Sisig for pick up. I live around the neighborhood so parking wasn't a problem. Food is meh my kapampangan lola didn't approve(Emanyaman, maputla, malanyo, balamu palabuk sabo - kare kare, ditak pong mal) , she said Boracay grill has better kare-kare, and sisig. Portions are definitely on the small side fore sure. Bangsilog was puny. Superstar has better portion and has more buck for the money. 3 dish $40 not satisfied at all.", "author": "Clyde E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-06", "description": "So excited to try this restaurant. Drove from El Cerrito with family on Saturday and arrived at 2 pm just to find out they were closed. Yelp said they were open until 9pm. Disappointed.", "author": "Rosalinda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "First time actually coming to this place because we wanted to bring lumpias to a house warming party so I went on yelp and I found this place.  We ordered 100 lumpias to go and it took about a good 10-15 minutes and the girl server there at the time was really informative.  We were actually hungry too so we got this rice plate to go with pork and it was BOMBBBBB.  we were so hungry we decided to eat a couple bites before heading out.  We were one of the last ones to arrive at the party and the lumpias were the first dish devoured.  SO GOOD. I definitely will come back to try out their other foods.", "author": "Ben Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "This place is such a gem! I think this was actually my first time trying Filipino food, and I loved how authentic the whole experience was. My friend and I came here for an early lunch on a weekday (around 11:30am), and we were the only ones there until like 12:30pm. I'm not sure how crowded this place gets, but it seems like you definitely won't have to wait for a weekday lunch. \n\nWe decided to get the 2-person platter, and omg it was so much food. I think it could easily feed 3 people. All the food comes out at once, laid out on a giant banana leaf. Each person also gets their own banana leaf plate thing. Our waiter took the time to explain each food item to us--what it was, what sauce to use, etc. He also encouraged us to eat with our hands (the traditional way). It definitely felt weird at first, but once you get used to it, it's actually quite fun. The platter features quite a few items: lumpia, salted eggs, eggplant, okra, rice, chicken, pork, broccoli, diced papaya/onion/tomato mix, and a whole fish. LOTS of food. But everything was so good!! The salted eggs tasted a bit weird to me...but I think it's an acquired taste. My favorites were definitely the meats. The chicken was fantastic--loved the sauce they used. The pork was great. Both had so much flavor! And the fish, although a bit difficult to eat, was delicious! \n\nAt $26, this platter is a steal! The food is fantastic and it's a wonderful dining experience. Any questions that you have--the workers here will be happy to answer. They seem very passionate about sharing their Filipino culture, especially through the food...and their enthusiasm made the experience that much better! Come here with an open mind, an empty stomach, and CASH (this place is cash-only). I will definitely be back!", "author": "Ashley Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "Philippine favorites served picnic style on banana leaves.  Enjoyed the \"kamayan\" dining experience.  Tableware was available but eating with your fingers was encouraged.", "author": "Carmel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-21", "description": "Had the apattan kamayan set. Everything was good, and edible. I especially liked the fried shrimp and halo halo they made. I wish the set came with lechon tho, and the chicken had some type of teriyaki sauce I didn't like. \n\nDownside, restrooms were \"out-of-order\". Yes, we could wash our hands for the kamayan food, but we had to run across the street to the library to use their restroom.....", "author": "Jac T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "The menu is small but everything meals delicious. Good place for friends to get authentic food. But price is average.", "author": "Bennett M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Went here for my mom's birthday, made a reservation to ensure that we would get a seat and there were plenty! I arrived there first, on time for the reservation, but my parents were super late since parking is really tough in this area. Anyways, the staff was so nice in getting everything ready and being patient with us, especially since it was approaching their closing time. The food was delicious, you eat it kamayan style, with your hands on banana leaves, very traditional! Soooo much food we had to take some home! This place is great for groups, they have menus that cater to both large and small groups. There is a karaoke machine constantly going so it does get noisy, but what do you expect from us Filipinos? We love to sing! Everyone should visit to experience traditional Filipino dining :)", "author": "Larissa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "It's nice to eat with your hands every now and then. The food was so good and this was such a great experience eating with a group of friends. My favorite was the BBQ pork and fried octopus. Looking for an opportunity to come back!", "author": "Lynn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "This place gets the SFDives seal of approval - in my ever so humble opinion;)\n\nLinoleum floor circa 1960?  Check\n\nFormica tables circa 1980?  Check\n\nCash ONLY?   Check\n\nAmazing Food?  Check", "author": "E R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-20", "description": "Sinigang was good! I didn't like the Bistek (beef steak tagalog) though, it was too salty and for a pampanguena, I don't think their Beef Steak Tagalog was the Pampanguena version. It's more like Batangas (or south-like) version instead of the way someone from Pampanga would cook it. But overall, I enjoyed it.", "author": "Angel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-27", "description": "Gave this place a try a few years ago, and I'd say it's probably one of the Filipino places we've enjoyed the most. The only reason we haven't been back more regularly is because the street parking can be so incredibly hit or miss, which can be a big consideration when you live in the city.\n\nThat said, the menu contains all the usual suspects you'd expect to find at any Filipino place, but it's not set up in the common turo-turo style - you order your entrees and your sides, and they are served to you properly, like at any other sit down restaurant. The owner asked us if we wanted to try kamayan style, but since it was our first time there, and I didn't know if my Irish/German hubs was up to that kind of adventure, we skipped it. Definitely want to try that out when we go back though.\n\nAll these other great reviews remind me of why we gave this place a chance to begin with. Going to make it a point to come back one of these next weekends. They do a nice job here.", "author": "Rod V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "I ordered for pick-up so I can't review for their sit-down service but the food was really good. My favorite Filipino dish is Kare Kare and Pampanguena Cuisine's is definitely THE best I've ever had. The other dishes were great too: Sinigang, Pancit Bihon, Veggie Lumpia, and the Chicken Adobo. I plan on stopping by again sometime soon!\n\nAnother tip, this restaurant is CASH ONLY.", "author": "A. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "Casual, no frills place with delicious food. Also good for party trays / large catering orders. Great value for price paid in both quantity and quality. \n\nDine In - 5 stars for food, 5 stars for service. Minus on star for no real ambience, tables and chairs were pretty old, and parking was impossible.\n\nCatering - 5 stars for food (taste, quantity and presentation), 0 stars for packaging\n\nResearched places to cater a filipino brunch and picked Pampanguena based on combination of Yelp reviews and pricing.\n\nWe came first to try it out for dinner on a Sunday night and parked about two blocks away. We were early (about 5pm) and were the only ones there but as we were eating saw multiple people come in for take out/catering orders and by the time we left a few more tables had filled up. Servers were friendly and attentive and food came out relatively quickly. We had the longsilog and lechon kawali, both were delicious and very good size portions. \n\nWe subsequently placed a large catering order and the woman was very helpful with suggestions and portions. When we came to pick up, the food was ready on time. For 20-25 people we ordered 5 half trays of pancit, lumpia, sisig, chicken adobo and longganisa. Was plenty of food and we probably could have easily fed 40-45 people. Sisig and longganisa were the highlights. Pancit and lumpia were also very good. Chicken adobo was okay and was the one tray that was barely touched. Loved that the sisig and pancit were nicely arranged and garnished. \n\nSome tips for picking up large catering orders. \n- Call ahead when you are almost there so they can start taking the food out of the warming boxes and putting into cardboard carry trays\n- Come with at least 2 people. Parking was impossible both Sunday around 5pm and Saturday around 11am so we needed to double park while one person ran into to get the food\n- They are very generous with portions which is amazing but also makes the trays unstackable so either bring extra people or be prepared to make multiple trips back and forth to the car\n- Bring large garbage bags to put the trays in before you carry and/or put in your car. The packaging was horrible (just one piece of foil placed loosely over the top that barely covers the entire tray and does not stay in place). We were extremely careful and everything still got everywhere. The longginisa in particular came in a try full of hot oil/grease that ruined a favorite hoodie and led to a pretty expensive interior car detailing", "author": "Sarina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "First time here and everything we ordered was expertly prepared and the service was prompt, professional and friendly. We ordered diniguan (pork blood stew) 5 stars perfect balance of vinegar. We also ordered lumpia which was crispy and not at all greasy. We also had longanisa (sweet pork breakfast sausage) with garlic rice and vinegar. The best thing we had was the crispy pork belly. Needless to say this is one of the most authentic and best filipino restaurants in SF. don't sleep on this one", "author": "Daren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "Best Filipino food I've had. Fresh, non-greasy, delicious. Ten of us shared the family style feast and were all stuffed and happy without feeling heavy.", "author": "Redloci R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "Came with the hubby two days before Xmas, only to be told they were closed for catering orders. The sign still said open as did their hours so we had explained to them we traveled kind of far on a friends recommendation. \n\nThe lady who owned it and her daughter, despite being super busy, were ever so gracious and polite to allow us to dine in. We really did feel bad but at the same time we did drive all the way to the excelsior and risked parking in a really bad area to eat here. \n\nWe ended up ordering the poo poo platter for two which had a sampler of the following; a whole fish, bbq chicken (this was the best dish of all) lumpia, steamed rice (even though we asked for garlic rice instead but guess they forgot) sweet yams and pork along with some veggies. \n\nService here is very polite and courteous! Not once did they try to rush us and regularly checked in to see how we were enjoying everything. \n\nIf you do come here, go before dark (the area is a bit sketchy) and go for the platter where you get to try everything. I highly recommend them for their bbq chicken, lumpia and catering!", "author": "Petra S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "This place is a hidden gem! I highly recommend this restaurant. I drove into the city to visit my mom and grandfather and wanted to bring food. I usually go to the same few Filipino places near his house to ensure the food is still warm when I deliver it. This place is further away from Daly City but by the looks of the pics and reviews on Yelp it's well worth it. I called to see if they sell the Kamayan feasts for take out and they happily said YES WE DO!!!! They also let me know this is a cash only establishment.  \n    When I arrived I was greeted by the staff and noticed the ATM was broken. I was kindly directed to walk to the corner donut shop where they have a working ATM. The donut place was great so I ended up buying some of those too lol!  Anyway, when I got back to the restaurant They were packing up our feast. I told them to please be sure that everything is perfect because my grandfather will tell me I should of went to his favorite place.  They were so pleasant and accommodating.  The food was absolutely delicious and came with extra banana leaves in the shape of plates for everyone to have their own to eat off of. My grandfather said the meal was made and presented to perfection and wanted to know what restaurant I got it from. I'm so pleased that he was impressed. I will be back again and again.", "author": "Chanel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "This place was pretty good. It definitely has then wow factor with the Kamayan style meal. The 6 person meal was plenty. I was full and satisfied. Also it is affordable and reasonable. I would come again.", "author": "Grace O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "16.12.00             incomplete review\n                           Had the pleasure of trying out the 2 skewers\n                           It was an quick hit and run tryout\n\nPork Skewer & Chicken Skewer  \n   Both was $2.50 and cooked right.\n   Portion was huge for $2.50 ... \n   I can easily make 2 moderate size sandwiches! \n   The portion size caught me by surprise\n       could have ordered just one for snacking ... glad I didn't save the other for later.\n\nCan't wait to try the main entrees ... after trying the skewers!\nThe only reason I haven't revisit them sooner ...\n    I lived cross town ... just happen to be in the area or I would visit it once a week!", "author": "S.K. Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "Are you ready to get your hands all grubby but feast like a King? That's what someone should've asked me before I ate here. When a few friends mentioned dinner plans in the City & asked if I wanted to tag along, I said sure. I had no idea what I was in for. \n\nAnyhow, we showed up on a chilly Saturday night. I got lucky & scored nearby street parking upon arrival. Walking in, it was about 1/2 full. We were greeted & seated immediately. Altogether, there were 5 of us. Again, as far as ordering, I had no idea.\n\nI've had some Filipino food before, but never Kamayan. Fortunately, 2 of our party were Filipino, & Kamayan was specifically why they'd chosen this place. Since there isn't a 5-person size on their menu, we opted for the 6-person size.\n\nConsidering the enormity of the mountain of food that appeared at our table, our order really did not take long at all. Like a bunch of sophisticated savages, we dug in with our bare hands. There's definitely a technique to rolling up all the tasty morsels into tidy bite-sizes & popping it into your mouth.\n\nWhat an array of wondrously diverse deliciousness on that banana leaf platter. & there was so much of all of it. We were the 5 who ate as 6. But either way, 5 or 6, it was still more food for the $ per person than you'll find most of the time in SF.\n\nSo while my hands got all grubby & coated with the tasty juices of our meal, to the point of multiple hand-washings not completely eliminating that Kamayan odor, I absolutely feasted like a King! & on the cheap! Would I do it again? You bet.\n\nWho knows? Maybe with enough practice I could get good at scooping up well-composed bites with my bare hands. & for a bonus, they have karaoke. If that's your thing, tune up those pipes. They're game to let anyone belt out a tune or 2.", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "Good place to have dinner with the family. The decorations make you feel like you are in the Philippines. I recommend the Kamayan for 6 people but enough for 8 people. The food is not salty or oily like other Filipino restaurants. The service is fast and friendly and they treat you like family. Everyone loved the food.", "author": "Marc T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-23", "description": "My 1st time here & I ordered 4 diff. individual order + 1 dish on the side to go. Cashier was writing down all my orders & computing everything in her little pad. I thought okay weird she has to keep looking @the menu for the prices & did the math on the pad itself but whatever. So then she said sit down & wait for the order (I paid already). Mind you it wasn't busy inside or anything. They could at least offer me some water or anything but none. On top of that the cashier walked by & then asked me if I ordered already to her own realization that yes I did but she goes on & asked me if I paid already & asks for the receipt. I had to get everything out of my wallet in front of her looking for a receipt annoyed as hell & to finally realized she never gave me 1. So then she says oh yes that's right, your good! \n\nWhen I got home we ate the food, it was so-so except the sisig is REALLY good. I give them that. But when we we're looking at the prices on their online menu I realized they charged me WAY more for the whole order 'cause I'm pretty sure tax could not have been $10+! So thanks a lot for the great exp. Never going back there again!", "author": "Gem C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "First time being here and the food was great and fresh. Our server was nice and attentive definitely I'm going to go back here again next time with a larger group.", "author": "Mike T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-26", "description": "the different dishes by itself is three star a-ok, but Im a fan of appetizer plates and this is like a mealetizer plate, so Im a fan, wish they san miguel or something though.", "author": "Phuc B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "Great customer service and food was amazing. Cost is very affordable. Just know it's cash only. They have an ATM inside the restaurant to make it easier! The combo for a group is way more than enough. We came with 2 adults and 2 little kids and still had so much to take home!! Pampangas best! Salamat", "author": "Gerry M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "I had pampanguena cuisine for an event for my company and Josie (and staff) did an AMAZING JOB! Everyone at the event loved the food I ordered. Great service and great food, what else can you ask for?", "author": "Stacy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Amazing!  Did I say amazing?!?  Guided by an experienced hand, my Filipino friend Will. \n\nI had BBQ Pork Skewer. The perfect balance of sweet, meaty, and grilled. Cooked perfectly. I ordered Longannisa sausage on the side because I had to try it, and it didn't disappoint.\n\nWe also had Pancit which was ok. Kinda salty. \n\nEverything was made from scratch. The owners were SO friendly. Food was awesome, authentic, and made with love. \n\nWill be back!", "author": "Paul G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "4 Stars.....\nPAMPANGUENA CUISINE is truly an authentic, Filipino Restaurant, located in the Excelsior District of San Francisco.\n\nHeard alot of \"buzz\" about this place, and have been anxious to give it a try.  It also helps when you love Filipino food, which I truly do.  On a lazy early Thursday evening, 4 of us decided to pay PAMPANGUENA a visit.\nParking can be a bit challenging but much to our surprise, snagged a parking spot across the street.  SCORE!\n\nOnce we were inside, and seated, we looked over the Menu.  It was pretty much apparent we were going with the \"Kamayan\" style dinner for 6. Although there was 4 in our party, they do not have a platter for 5, so naturally, we were afraid of not enough food, so we ordered the platter for 6. OMG!  Never underestimate a Filipino cook. Tons of food!  Our platter consisted of the following:\n\nGrilled Tilapia\nGrilled Squid\nGrilled Pork\nFlitter Shrimp\nSalted Egg\nLumpia Shanghai​\nMango/Tomato/Onion\nSteamed Vegetables\nSweet Yam\nSteamed Rice\n\nA la carte, we also ordered (again, for fear of lack of food) Pancit Bihon and Sizzling Sisig.\nFor dessert, we enjoyed Halo Halo. Our two Beverage​ of choices were the Coconut juice and the Mango juice.  First of all, the food is very fresh and beautifuly presented. What an array of diverse deliciousness on that banana leaf platter, and there was so much of it!  Sure, we were the 4 who ate as 6, but either way, 5 or 6, it is still more for the $ per person than you'll find most of the time in SF.  It not only was exceptionally tasteful, it was also well balanced from different textures, crunchy, crispy, chewy to flavors from tangy, savory, salty & sweet. Also, despite the rarity of eating with your hands (although they are happy to provide utensils, when asked), I might become an \"expert\" at scooping up well composed bites of the platter food, instead of worried about the mess I was making. Practice does make perfect. Lol.\n\nWe sure did eat like a group of starving teenagers, who just came home from school, and left no evidence behind that a scene was committed. In essence, you won't go home hungry. And you might have some leftovers.\n\nPAMPANGUENA CUISINE is a Fabulous hidden gem. The owners are super nice, and you can tell they have love with their passion for the business.\n\nIt's not a fancy restaurant, but it is a casual, relaxed atmosphere.\n\nMy one complaint?  Maybe PLEASE don't be a 'cash only' operation.  Nobody likes to pay cash today. It would be beneficial to both you and your customers.", "author": "Janet T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "My first time coming here and it was definitely a good experience! I never had kamayan before but it was really delicious. We ordered two large plates and there was 11 of us and it filled us good!  My stomach was about to explode after eating all of this yummy food. \n\nGood service and good food definitely deserves a 5 star. I will definitely be back to try other things on the menu as well.", "author": "Monica W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-16", "description": "This place was featured in Adobo Nation (Filipino show) and the foods featured looks good. We finally decided to try and was very disappointed. \n1st- The place looks dirty and unorganized\n2nd - The TV was so loud that you barely can hear each other's conversation\n3rd - the food is okay\nI gave 2 stars because we asked to substitute the Tilapia fish to Squid and was accommodated to our request for an additional $. \nTried it, but will not come back.", "author": "CJ B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "It was. So. Good. Have to get the garlic rice. The bbq pork was amazing. Will have to come back and try the other dishes next time!", "author": "Hong T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "I was attracted to this place by the great variety offered for the party meals. I was very excited to hear this place opened back up 2 weeks ago, and came on the first day it reopened, and this was on a weekend. There were a few other parties, but we were seated immediately. The service was good from beginning to end of the meal. Although it did take a while to get our party for 2 plate serviced on banana leaves, it was worth the wait! The variety of food (which you can see from many pictures) was more than enough for 2 people. I loved the pickled duck eggs, very rare to see these in any Asian restaurants around the bay area. I liked the grilled pork and fish the most. The entire meal is quite healthy as well, with plenty of veggies (okra, eggplant, tomatoes, mango, broccoli). I was stuffed at the end of the meal and didn't feel a bit guilty. I recommended this place to friends and one friend who tried it loved this place as well. I am looking forward to coming back.", "author": "Alice S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "We wanted our asian friends to experience a \"boodle fight\" and eating with our hands. The place surely did not disappoint us! We ordered the feast that was good for 6, also ordered Kare Kare, sisig, and pansit. Everything was delicious! Highly recommend this place, and we will definitely come back again and again!", "author": "May D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "Place was packed when we went, waited for about 10mins or so. We ordered \"Tatluhan\" which pretty much have everything, from seafood to pork to veggies. Everything's yummy! We were given sweet yam at the end of our meal, perfect for dessert. The owners are nice and friendly. They only accept cash but fret not, they have atm inside which charges 1.40 dollar per withdrawal.", "author": "Ses R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "I don't think I've ever been somewhere where I was completely unfamiliar with the food and how to eat it that the restaurant staff really took the time to tell me what to get and how to eat each of the items. Our server was SO friendly and truly made us feel comfortable eating food that we'd never eaten before in a style that was unfamiliar. And it was freaking delicious!! We got the sharing platter for two (I can't remember what it was called, but you want it), and he told us how to mix the salad, which sauces to dip in what things, and that Filipinos would eat with their hands, but also gave us forks and spoons if we weren't feeling it. It was such a great experience, really delicious, and so much food. I'll absolutely go back for more. Ahhhhmazing.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-15", "description": "I brought my parents here for their joint-birthday luncheon. My mom said the food and presentation was spot-on! \n\nWe're a party of 3 and we ordered:\n- Dalawahan (a combo platter for 2 guests)\n- Miki Bihon (thin and thick noodles)\n- Sisig na Bangus (sizzling platter of marinated milk fish)\n- 10 orders of Turon (deep fried banana rolls)\n- Coffee for all\n\nWe loved the various dipping sauces: vinegar, soy/fish, bagoong, and sweet & sour sauce. The serving-size is good and we took home to-go what we couldn't finish. \n\nThe decor is on the casual side. Good enough for a casual first-time date. Overall, services was fast yet pleasant on a Sunday afternoon. They have good teamwork here. Our orders were delivered by different staff. When the food was served, they paused and took time to explain the item. The staff was warm and friendly and ready to strike up a conversation. \n\nTHE CONS:\n\nThe only mistake in our order was the Miki Bihon. My dad explained to me this noodle dish should consist of TWO different noodles, thin and thick. Our order had only the thin noodles.\n\nCASH-ONLY IN 2016. Our total order came out to about $80 with a generous tip from dad (yes that's for 3 people). My ego was bruised because it was my parents birthday, and I wanted to treat them out but I didn't have enough cash on hand. My dad quietly slipped me a $50. There's an ATM inside but my frugal mom gave me the no-you-wont-look. Why should I incur bank fees? Besides, I don't think it was working. This cash-only experience gave me a bitter taste. I WOULD NOT recommend this place for a large party that you'll be spending over $200. Who would carry that amount of cash on Mission Street? \n\nStreet-only parking can be a big challenge on this busy intersection on Mission Street. Be prepared to circle around. If you have children or elderly guests, do them a favor and drop them off first. \n\nI'll give this resto a 4-star (barely). The food was delicious. You just gotta factor in the cons I listed above.", "author": "Ericson H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "This place was outstanding!  Great food, great service, chilled and laid back atmosphere.\n\nWe ordered more than we could handle, they had their house made sauces which were perfect for dipping the various meats.  They had a banana dessert not pictured which we found when paying the bill (excellent!). Definitely will be going back to that little gem.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "We didn't try their famous kamayan menu options but what we ordered were DELICIOUS!!!! I don't try to compare Filipino restaurants to my Mom And Pops cooking but this place served up to my expectations.\nWe ordered kare-kare which was creamy, with moist, tender oxtail ...how it should be...paired with some pink bagoong and life was all of a sudden good again. We also tried the sisig bangus and it was so FRESH...simple ingredients but refreshingly delicious and the sauce it came with was exceptional! Additionally, my friend was curious about the BBQ...we opted for the chicken BBQ and it was well marinated, tender, juicy. Lastly, the lump is Shanghai...I wished it was served first before our actual meal but it came with all the other things we ordered...anywho this place was a great find! Servers were hospitable too AND the place was CLEAN!!!!\nCash only..and they have an ATM machine inside! Enjoy!!!", "author": "Dee R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-16", "description": "I'm not one to write poor reviews, but I'm going to do so while trying to be as fair as possible. Service was pretty bad, but that was to be expected. Its really the food that torpedoed this rating.\n\nWe ordered pork belly, grilled pork, steamed rice, lumpia, and noodles. In theory, these are fairly hard dishes to screw up and yet they were all really terrible. \n\nWhere to begin? First, the noodles were bland and the sauce had 0 flavor. I was worried it would just be sweet, but it was just flavorless and that was the highlight of the menu. Each pork dish tasted like it had been cooked in the morning and just reheated 10 minutes after we had ordered. There was a stale finish with each bite. Furthermore, it was over-salted overcooked, and just awful in every way you could imagine.\n\nThe rice was overcooked and cake like. All in all, it was close to some of the worst food I've had in my life.\n\nAlso, please don't interpret this as western food snobs showing up to an ethnic restaurant and having a soured experience. This was really cooking 101 failures across the board. Good food shouldn't be prepared 10 hours in advance and then fried to oder. Good rice is good rice no matter what country you come from.\n\nNot much else to say really.", "author": "Ajit K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "I've been meaning to try this place ever since I moved to the area, and I had the opportunity to finally do so this weekend!\n\nFor me, the quality of both the service and food really hits the mark on why I love family-owned establishments. \n\nFirst the food. We ordered the kamayan for two people, which really was enough for three (I ate the rest for lunch the next day)! The chicken, tilapia, and pork were packed with flavor and super tender. The feast also came with lumpia and salted egg (quite salty prepare yourself!). Eggplants, okra, and broccoli balanced out the meaty items, and the mango and tomato salsa rounded out the meal with a refreshing tanginess.\n\nLast but certainly not the least, the service was impeccable. Long story short we had a hiccup with the check (it was our fault), but the owner handled it in a way I am truly grateful for. I highly recommend coming here. You seriously will not regret it if you enjoy authentic, family-style filipino cuisine!\n\n(REMINDER: IT'S CASH ONLY. DON'T FORGET.)", "author": "Derick N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "6 of us shared the kamayan and ordered 3 total halo halos. Came out to about $20 per person. It was great! \n\n-Service is so friendly\n-Street parking\n-you can use your hands but there are utensils if you really wish\n-their non kamayan dishes smelled so flavorful too !", "author": "Veranna N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-25", "description": "IF I COULD GIVE THIS PLACE ZERO STARS I WOULD. I arrived an hour before they close their restaurant and they turned me away saying that their kitchen was closed. Like ???", "author": "Tabitha R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "We had just come home from a flight from Vegas and we were hungry!! Like every time we go out for food, we are starving!! Ahaha \n\nWe have always wanted to try out a Filipino Restaurant that has kamayan  (eat with your hands) This place is so close to us so we gave it a shot.\n\nWe get there and the restaurant to full! First good sign! The waiter was very friendly.  He sat us down fairly quick but also accomodated us when we wanted a bigger table when it became available.  \n\nWe ordered \"dalawahan\" (for 2) which comes with Lumpia, bbq chicken, pork, whole fried tilapia, steamed eggplant, okra, broccoli, salted eggs with tomatoes, onion, and mango and a mound full of rice.  Dipping sauces: sweet chili for the lumpia, shrimp paste, and vinegar.  Everything was delicious!!!\n\nWe had coconut juice from a coconut which was nice because after the juice was done, we scooped out the coconut pulp for dessert!  \n\nJust when we thought we were done, they bring out sweet yams for dessert. \n\nCome to find out, the workers were the owners! They provided excellent service!! We will be back!!!", "author": "Candice V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "First time at this place with my BF. Had a dinner date here after playing \"tourists\" in the city. The location is pretty good, but good luck on finding a spot; it's the \"mission district\". We just happen to be lucky; getting a parking space right in front of it, on a Friday night. The server was very friendly and attentive. Took our order and food was served to us in a timely manner. \nWe ordered \"Dalawahan\" and there was so much food on the platter, my man & I did not expect it to be that much. The platter had a variety of items. And it was fun to eat with your \"kamay\", but we totally enjoyed the food; especially how it was plated and presented. \n\nI am only rating this restaurant 4 stars because of the fish. The tilapia wasn't cooked all the way, the fish meat was still a 'lil raw inside. It wasn't seasoned as well. I guess we could've told the server, but we didn't. It was a small issue and not a big deal.\n\nI will definitely come back to try more items on the menu. And I will definitely ask them to cook our food the way it's supposed to be cooked.", "author": "Veronica D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "My family ordered the Animan menu for our kamayan dinner. Food was alright, just typical Filipino fare. We thought the entire table was going to be covered with banana leaves and food placed in the center. Instead, they bring it out on banana covered platters and give you bamboo plate holders covered in banana leaves. \n\nThe customer service was great. Everyone was very friendly and always smiling. Call ahead to reserve tables if you're coming with a big party. Check in with Yelp & they won't charge you for extra rice.", "author": "Mar H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "Seriously, Ate Josie and Kuya are the BEST! \n\nI can't even begin to say enough good things about this place. The kitchen is clean (unlike \"other\" Kamayan places), the service is amazing (unlike \"other\" kamayan places), and the food is so delicious! \n\nI love how they always have TFC on, how there's a karaoke machine just in case people want to sing, and that their children are usually at the restaurant studying. It makes me feel like I'm walking into their home. And you know Ate Josie, cooks like she is at home. She also loves to walk out and make sure everyone is doing well. \n\nI continue to come here because they always remember who I am and they always treat me like family. They feed me like family too! haha.", "author": "Rylan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "We love coming here even if parking is a challenge. We ordered the \"Kamayan\" for 4; there were 5 of us so we added an order of pork sinigang.  The tray comes with steamed broccoli, eggplant and okra; grilled tilapia, squid, chicken BBQ, fried shrimp, shanghai, grilled pork, and salted eggs with diced tomatoes and mango and comes with various type of dipping sauce ( shrimp paste, white vinegar, sweet and sour sauce and hot sauce) all that for less than $50. It was actually enough for the 5 of us.  The owners are very friendly. Anyway, I believe the kamayan meal also comes with sweet potatoes for dessert; but the owner gave us a choice of sweet potatoes or turon! Of course we chose turon so they gave us 5 pieces.  It was so good...so  light and crispy  and they are huge!  I'm a fan!!  P.s.  Sign shows Cash only, but they do accept credit cards.", "author": "Elle A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "This place is great! It's just a few blocks from where I live, yet I felt like I was in the Philippines. We got a platter for three with a huge variety of delicious foods on it including barbecued chicken, grilled pork, steamed rice, fried shrimp, steamed fresh vegetables, homemade dipping sauces and a Filipino salad made of chopped tomatoes, chopped mango and hard-boiled egg. I realize it may sound strange, but it was delicious! The owner was amazingly friendly, and he taught us the traditional ways to eat Filipino food. A really fun experience.", "author": "Ethan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-02", "description": "I didn't grow up with a big ass wooden spoon and fork on my wall.\n\nI never turned around when someone said, \"Psssst!\" or \"Hoy!\".\n\nAnd I sure as hell can't sing for sh*t.\n\nThank goodness I can blame my unFilipinoness on being just a quarter. \n\nConsidering that I didn't even know how to pronounce sisig until two years ago, I'm still learning about Filipino cuisine. It was just recently that I heard about Kamayan dinners. A meal that's made for parties of 2, 4, 6 or more with a banana leaf that's piled with mounds of food to be eaten with your hands.\n\nPampanguena Cuisine offers Kamayan dinners in addition to your typical Filipino fare of BBQ, silogs, and turo turo style of cuisine where you make your own combo plate by pointing at what you like from the hot trays. They also provide catering and is a good option if you need to bring something for a potluck (a tray of lumpia or turon is always a good potluck item). NO MSG is used as I called ahead to make sure if it. CC's accepted. \n\nThe staff at Pampanguena Cuisine is very friendly and welcoming so you feel like you're eating a Filipino family's house. It's a bit of an hole-in-the-wall that seats about 25 people with TFC blasting in the background. Not exactly a place to impress a date unless you wanna go home with blue balls.\n\nThe Kamayan dinner is the way to go at Pampanguena Cuisine as you can have a tropical buffet for just $13 a person. It's even cheaper if you go in a larger group as the Kamayan dinner for 10 is less than $100.\n\nOur Kamayan dinner for two ($26.95) came with bbq beef, bbq pork with a black pepper sauce (like a Chinese cha siu), a whole grilled tilapia, lumpia shanghai, fried eggplant, steamed broccoli & okra, two hardboiled duck eggs, two heaping mounds of steamed rice and accouterments of diced mangos, tomatoes and raw onions: http://bit.ly/YQwFbm. Several dipping sauces of vinegar, sweet chili sauce, calamansi, and bagoong (shrimp paste) was provided for your dipping pleasure. The meats provided were different than what was listed on the menu (I was hoping for lechon) but this was because they ran out of the meats listed so make sure to come early.\n\nThe bbq beef was tender and smoky, the bbq pork was plump with a peppery sweetness and the tilapia moist and flaky. You can never go wrong with the fried deliciousness of lumpia shanghai. Make sure to eat each spoonful of grub with the mangos, tomatoes and onion to get a pop of tangy tart sweetness. Nothing mind-blowing but the Kamayan dinner IS solid eats that will deliciously fill your tummy without breaking the bank.\n\nI use to cringe at my dad when he would eat with a spoon and a fork. It looked so unrefined but here I was shoveling the food into my mouth with a fork AND a spoon to get maximum grubage per a bite. Total savage status. \n\nTFC's popular show of \"It's Showtime\" was playing the entire time we were eating dinner at Pampanguena Cuisine. For 60 minutes, we listened to Filipinas soulfully singing hits from Taylor Swift, Demi Lovato, and Rihanna.\n\nMr. NSS: \"You're part Filipino so I bet you CAN sing...when are going to sing for me?\"\n\nMe: \"When you wanna go deaf, dear.\"\n\n*Hating my parents for never investing in a karaoke machine*", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "Really good and the kids liked it especially the bbq and fish. We ordered the dalawan, it's good for sharing.", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "Walked in with a smile, walked out with a smile and a full belly! What can we say that others haven't already? This gem of a restaurant is a winner when it comes to tasty Filipino food! Chef Michael was very pleasant on the phone to answer some questions before we came in, and he, along with Josie were very excellent hosts, making us feel right at home! We will most definitely come back! The wifey and I shared the dalawahan which is loaded with goodness! Do yourself a favor and stop reading reviews, get in your car, and pay them a visit!", "author": "Andres D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "The service is EXCELLENT. My friends and I got the kamayan for 4 (eating with your hands) The waiter explained which elements went best with each other and described how pampangans normally ate each item, but always said that it was completely up to us how to eat it! I appreciated the information and he was just so attentive. This is where I will introduce all my non Filipino friends to when then want to experience kamayan!", "author": "Kayla K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "I had the following during my recent visit: \n\nSinigang na Baka\nKaldaretang Baka\nBarbeque Chicken\nPritong Isda (Bangus/milkfish)\nGarlic Rice\nLumpiang Gulay\n\nOverall, I thought the food here was very good.  The Sinigang (tamarind-based soup) had the perfect amount of tartness to the dish along with tender pieces of beef and good vegetables.  The Kaldareta (tomato-based stew with beef) was also good - the beef was tender and the stew had a nice balance of sweet/sour...the vegetables were a bit on the \"crisp\" side, but still good.  The skewers of BBQ chicken were great - tender pieces of BBQ chicken with a sweet and tangy marinade and sauce...there was actually a great portion of chicken on each skewer.  The fried milkfish was perfectly fried with a nice tender and rich belly in the center for people to indulge in.  The garlic rice was great - the perfect amount of garlic and a nice texture to the rice.  The vegetable lumpia was also good with a nice rice paper and loads of vegetables in thick pieces of lumpia.  All the beef items arrived with the bones attached to the meat, which I know adds flavor to the dish, but is a bit annoying when trying to eat.\n\nThis place is very casual and has an extensive menu...they also have kamayan options (traditional Filipino dining with your hands) for groups of 2,3,4, and 6.  Keep in mind: CASH ONLY!", "author": "Ken G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "The food was fantastic and the portions were generous, but what really impressed me was the level of service. I've never met an owner so friendly and welcoming. He took his time to explain everything and always had a smile on his face.\n\nGreat place! Will definitely visit again.", "author": "Caroline P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-21", "description": "I made a reservation for 3 on a Saturday night at 6pm.. luckily I didn't need it.  \n\nHere's the skinny on our eats:\n+ kamayan for 3 - photo - http://www.yelp.com/biz_photos/pampanguena-cuisine-san-francisco#PmiEYaXFFUkV1er4aGartg).  \n** came with grilled squid, chicken, beef, shrimp, tilapia, mango and tomato salsa, salty eggs, okra, broccoli and lumpia of course!  The chicken and lumpia were my faves.  \n+ halo halo - photo - http://www.yelp.com/biz_photos/pampanguena-cuisine-san-francisco#MnX8603l17AmbkwwwHA1gg\n** FTW!~ It's the best I've ever had - not that I've had much, but hey!  I've had my fair share. They use jack fruit ice cream instead of ube which is actually WAY better.  The portion is perfect for 3 to share.  They don't skimp out on all the goodies too (red beans, coconut, etc).\n\nI was excited to have a 'home cooked' meal with my dad and introduce my man to some good eats of my peeps ~ sadly nothing in the meal itself stood out for me.  The halo halo though - man that's some real good stuff!\n\nThe family is very sweet and the service was great!  Also, the area is a bit sketchy so I don't recommend going alone, esp at night.", "author": "Beverly E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "I ordered a large amount of food for 50 people and they catered our party. The food was VERY good and authentic. We fed many people who had never had Filipino food. The price is good too. Joycie the owner has great customer service and made everything god smooth. This is the place to go for great food.", "author": "Crystal M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-22", "description": "+\nSolid Filipino cuisine\nGenerous portions for kamayan \nFriendly and attentive staff \n\n-\nCA$H ONLY!!!", "author": "Miss G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "Food: 5/5\nPrice: $\nPortion: 5/5\nService: 4/5\nAppearance: 3.5/5\nPresentation of food: 4.5/5\nOVERALL: 5/5\n\nCame by the other day with my husband, he had eaten their food before (and I have tried off of him from his leftover doggy bag), it is really good! So I decided to make a trip here with him and see whats this place is about!\n\nI'm just so sad that no one knows about this place! They deserve much more credit for their food!\n\n- Bbq Chicken skewers\n- White rice\n- Lumpia Shanghai\n\nThe bbq chicken is so tasty! It has a settle char 'bbq' taste, with a sweet kick of their bbq sauce. Chicken is moist and easy to eat (not tough at all!). Generous portion!\nI'm a rice type of girl and their white rice was the perfect pair to the chicken, it cuts through the flavors and the texture is soft and fluffy!\nLumpia is crispy, hot off the fryer, the pork and veggie inside is warm and perfectly seasoned! Comes in a order of 25 pieces, for a price of $6.50!!! Comon can't beat that.\n\nIf you are in need of a filippino food fix or just want to try something different in the area than the usual burritos, tacos, sushi, come to Pampanguena!\n\nP.S.\nThe owners are so sweet and friendly! Very attentive too made sure we had everything we need and that our waters were filled.", "author": "Eva H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Love the kamayan dinner! Excellent customer service. Delicious food and super clean resturant. Will definitely come with the family more often.", "author": "Megan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-13", "description": "Let me say this: it's hard to find good Filipino food within the bounds of San Francisco. For the number of Filipinos here, it's a travesty. Without getting into the centuries of sociocultural baggage that has led to this eventuality, I will just say that I am extremely happy to have found Pampanguena Cuisine. \n\nComing from a Kapampangan (sorry Dad) family, I spent all of my childhood summers in Pampanga, eating Kapampangan food. Frankly, anyone that says that any other Filipino region's cuisine is better, doesn't know what they're talking about. And boy does Pampanguena Cuisine deliver.\n\nPrompted by an intense craving for simple, down home, Filipino food, I came here and decided to chow down on the Kamayan for 2. SO MUCH FOOD and SO GOOD. It hit all the right spots. Grilled tilapia, check. Grilled pork (with their tangy, sweet house teriyaki sauce), check. Barbecue chicken, check. Served with various sides of okra, eggplant, tomato, salted duck egg, mango, broccoli (ok not so traditional), and of course, generous mounds of rice, all on a glorious banana leaf lined boat, it was impressive in its immensity. (FYI, the kamayan doesn't come with grilled calamari until after 3pm). Eating off woven rattan plates lined with banana leaf reminded me of the fiestas of my childhood. Knocking it all down with a zesty, sweet calamansi juice was just the right kind of Filipino comfort that I needed. \n\nSure the decor is a little island kitchy and the 80's/90's soft rock/Celine Dion music is confusing when overlaid over the TFC showing in the corner TV but even that made it feel all the more authentically Filipino. Really felt like I was back home eating at my grandma's house in Pampanga. What could be higher praise than that?\n\nAll of that would have earned this place five stars except for the fact that their posted hours on Yelp say they're open until 9. Word to the wise, come before 8 since there's a healthy chance that they'll be closed by 8:30 (which they were when I first tried to eat here).", "author": "Mark D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Ignore 5 stars; never ate here and just wanted to provide the following update. Currently closed 3/3-3/27 due to family funeral in the Philippines.", "author": "Allison Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "Close to our house!! Terrible street parking cuz on Mission!!\n\nBut the food is good.Reasonable prices for food.Love the lumpia shanghai is tastier than Nick's Kitchen to us.Had my hubby's work tested out which is better. They also have Vegetable Lumpia for vegetarians! I like my Beef&Vegetable anyway,lol! More too come...", "author": "Myra O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "Less 1 star for location/restroom. The owner admitted that they do need a better location. I hope they find one soon. The food, bang for buck, and service is excellent. The best Kamayan in the bay~", "author": "Suzette R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "Came here on Valentine's Day with my boyfriend after hours of searching for a place to eat since my go to Filipino food place was closed. Boy am I glad that we came here because for the price that we paid and the amount of flavorful food we received made my day. The owner himself hosted and served our food, he is a very sweet man and went about and beyond with his service. The food was served in a prompt manner which made me really happy because I was starving. the meal was served in a large bamboo basket type thing and it was enough to feed my boyfriend and I and leaving us left overs to take home. I am looking forward to coming back to this place and trying everything else they have.", "author": "Brenda H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "This place wasnt only yummy, but the waiters and the owner were so friendly!!! Came here on a sunday with my family and we really enjoyed the place. They even let my mom sing karaoke! Haha definitely get their lechon Kawali and turon!! The only problem is that they dont have a parking lot so you have to find street parking and street parking is pretty difficult to find there. :(", "author": "John R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "Super friendly, family run, authentic Filipino lumpia! I haven't found delicious Shanghai lumpia like this in SoCal! Kudos to the extraordinary accommodating owners.  I was in a real pinch to have a phone order fulfilled for a party platter of lumpia for the holidays and the owner made a one-time exception!  There were so many delicious lumpias that went home with many guests! Will definitely be coming back for more exquisite food and notably wonderful, hospitable service!", "author": "William H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Finally, a great Filipino restaurant close in my neighborhood! Tried it for the first time yesterday. Ordered the pancit bison, lumpias, and bbq chicken and bbq pork. Got it to go. The food was delicious! The lady that worked there was really nice and sweet. Next time, I will take my whole family to eat there because I want to eat with all the food laid out on the green leaves. Will definitely go back again. Unfortunately, it is CASH ONLY. There was an ATM there but it was out of order. All in all, it was great! Open to try new dishes from the menu next time.", "author": "Diana T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-15", "description": "We were in SF area and decided to get Pinoy food. So we started looking for the nearest Filipino restaurant with the highest rating on Yelp...and Pampanguena Cuisine was there on the top 5....so, off we went. \n\nThere was only 1 table occupied when we came in around 12 noon and seems like they're still waiting to get their orders as their table are empty...no water, no utensils, no plates etc. - can't tell if they were there for a while or they've just been seated when we arrived. \n\nWe're hearing some loud discussions behind the counter about problems on the internet connection, 15 minutes later and still waiting. \n\nAround 20 minutes or so, a lady came to the other table and took their orders and then she went to our table and asked if we're ready - told her we've just helped ourselves getting the menu books from the front desk and no, we're not yet ready and off she went\n.\nAfter 15 minutes, we are now ready to order but there's no waiter in sight, 10 more minutes and still nothing. So, I decided to go to the counter and told a guy there that we are ready to order, and he said he'll be on the table in a few....Okidokie...\n\nWe ordered the 4 person platter (though we're just 3), priced for $48. My companions ordered a side dish of pancit Canton and Pinakbet.\n\nI thought the order will take a while as they will still fire up the grill for the Tilapia and the Squid but after about 20 to 25 minutes, our order came...not bad huh?\n\nOh yeah, it was bad...you can tell the fish was at least a day old, probably leftover from yesterday - dried and discolored...meat was stale and yellowish, not white which was supposed to be the color of a freshly grilled though previously frozen Tilapia - I should know, I'm a weekend grillmaster and yes, I sometimes eat leftover grilled fish from a day or two ago and that's why I know a duck when I see one. The squid was also very very dry, it's either overcooked or leftover too from yesterday's... \n\nall in all, food was ordinary...even the freshly cooked ones i.e. lumpia, deep fried prawns, bbq were just ordinary, nothing to sing praises and hallelujahs about.\n\nIf they would have just served freshly cooked ones on our order (well, they should do it on every order all the time), then I'll probably rate them 3.0 stars. \n\nI just can't understand why on earth would a highly \"yelp rated\" restaurant like them will serve a day old dish (or maybe 2 days? or 3? who knows, I can't tell the difference) just to save few dollars? Do they really really think their customers can't tell the difference? Is the $3 or let's say $5 money they've saved on that old poor Tilapia worth the 1 star rating I gave them? \n\nHell no....my companion actually posted the picture of the platter before we dug in and 3 friends already posted comments even before we're done eating, asking if they're good and yes...your guess is as good as mine...wasted time and money...\n\nAll in all, we've paid $83 inc. tax and we left the waiter $10 tip...... for the LAST TIME.\n \nLesson Learned...\n\nFor us: we're always skeptic on Yelp reviews...it's always a hit and miss thing....and missed things are getting more and more frequent...so, we'll probably just go with our family's and friends' suggestions...but they're a hit and miss thing too...lol\n\nFor the owners: Please, you're really not doing yourselves a favor (profit wise) if you serve leftover dishes from yesterday's or 2 days ago or 3...you're just shooting yourselves in the foot. You already have high ratings on YELP...the only thing you need to do is to keep on doing what got you the high ratings and that is...SERVE GOOD FRESHLY COOKED FOOD.\n\n\nand what happened to that poor OLD Tilapia?.....no worries, it will still be of use...it will be mixed to an Ilocano dish... yes, Diningding, that's what's for dinner....my Dad's favorite dish...", "author": "Joselito A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "this place is drive all the way across town crave worthy fantastic - I make my girlfriend drive me here every other week at least. super authentic family owned Filipino.\n\nthe sinigang na baboy (tamarind soup with pork) is my favorite I've had anywhere and keeps bringing me back. perfectly sour broth and falling apart meat. a single order is more than enough food for me and my gf for a meal - really generous portions. \nchicken adobo is good but not as good as others I've had.\nbangsilog (fried milkfish with rice and egg) has the fish fried to perfection.\n\nservice is sometimes slow - but they're so freaking sweet I don't mind at all.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "The restaurant staff seated us even though we came in a little after closing time. We had the set meal for 6 and added \"ni laga\" for the cold weather. The food came out fairly quickly and was presented beautifully on a woven platter and banana leaves. The lumpia was crunchy and the sweet and sour sauce was just right. The vegetables were grilled which complimented with the rest of the flavorful meat and seafood. Definitely a place I would like to go back to and try the rest of the menu.", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "1st timer here.. What can say? BEST FOOD and BEST SERVICE. Will definitely recommend to everyone.. Happy tummy", "author": "Charlie b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-23", "description": "This spot is so damn good. Bring me back to when I was in the Philippines eating Kamayan every other day. \nThe quantity is huge. The quality is top notch and the selections are perfect. Their 6person setup is my favorite. Great service but parking sucks in the area. We will be back for sure. I highly recommend them to family and friends. A Gem for SF", "author": "Mckevin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-10", "description": "Ordered take out for the first time here , I wanted to try everything . They were very polite and welcoming when we came to pick up the food . \nComing from family that can cook some great home cooked Filipino food I have my opinion . \nI wish I could rate this place on their  dishes because some deserve 5 stars \n\nKare Kare- little to watery I like my sauce thicker but the oxtail was generous \nShanghai lumpia- I prefer a meaty lumpia this tasted more like a shrunken egg roll lots of veggies little meat \nSisig- now this was delicious and not very spicy  \nBBQ Skewers- delicious , generous amount of chicken and flavored wonderfully at an amazing $2.50each wow   \n\nChicken adobo- I wanted pork because we all know that's bomb and no broken bones in that traditional adobo . The flavor here was good and I actually ate This the next day with a fried egg and I loved it more . \n\nGarlic rice - save your money, put your rice in your rice cooker and just add some garlic cloves . \nI thought it would be a garlic fried rice . A bit disappointed", "author": "S R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-24", "description": "I remember that the food stretched down the entire table and I was too full to move after the meal LOL We came close to closing and was fortunate enough to be seated without reservations. As per a friend's suggestion and advice, we have to eat everything family style and with our hands. This was my first time eating a legit Filipino meal and the experience blown me away. In my opinion, the meats were too salty for my liking, but I enjoyed the lumpias, eggplant, okra and mangoes. The boiled eggs seems to be salted was not my favorite. The price came out to about $20 per person. Overall, I enjoyed the experience and I would come back with a group for the dining experience.", "author": "Sally Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-13", "description": "We just ate here for the first time last weekend with my family.... They say first impression last right? so we can say, there's negative & positive ones.\n\nPROS\n\nRegarding the food, we can't say bad coz it's good especially their inihaw. We just had their KAMAYAN for 6 people and ordered 2 for 13 person, and it's astounding, we still have to take out some of it. \n\nThe price range is I think not bad coz you're eating a nice and tasty meal, truly a home cook meal. We love it! \n\nThe ambiance, nice! If you're inside, It's just like entering into a bahay kubo\ntype of place. You're not thinking that you're in a different country.\n\n\n\nCONS\n\nFirst, this is a \"CASH ONLY\" restaurant... Not Good! They have ATM inside but as we know it, withdrawing money from a public ATMs means additional bank fees for us, so better bring a lot of CASH when you eat here... who brings a lot of cash nowadyas? too risky right?  Ofcourse they have a sign on the door that says.. \"CASH ONLY\" but the fact that you have to find your banks ATMs nearby if you don't want to pay some bank fees makes you a bit pissed of especially if you're that hungry, right? or else better just pay an additional bank fees. smh\n\nThe parking is on the side street only, If it's busy, you'll have to find some parking space which maybe a bit far from the restaurant. And remember, don't count the fact that you'll again paying for the parking space right? maybe $2.00 minimum an hour... smh... Ofcourse this is given to the fact that it's San Francisco area, but I just want to tell for others especially the ones that are not from around here, just want to taste their home cook meals. So just better be ready.\n\nFor their drinks, I think it's a bit pricey especially the \"Buko\" which you can't eat the inside of it coz the hole is a bit small, they should open it up big enough for the spoon to get in. We know that aside from it's juice, the inside is the best to eat.... better just stay with water.\n\nThe place is a bit jammed up too.... so, If you're a bit bigger, need to say excuse me to get to where you want to.... You know what I mean!\n\n\nIn conclusion, we had a good time here, going out full but the mere fact that we have some issues especially the CASH ONLY basis and the SIDE STREET PARKING FEES is just a 3.5 star for me and the rest of my family. Maybe this is not the eating place that you will keep coming back over & over, once in a while I think.", "author": "Lou H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "This is the first Filipino restaurant I have been to. As someone who is hispanic I am very unfamiliar with what to order and the staff was EXTREMELY helpful. The food was presentable and was flavorful. I was very impressed with everything.", "author": "Rebecca M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-17", "description": "I was really excited to try this place but it fell flat for me. The food was decent but not amazing (definitely not 4.5 stars worthy) The food came out cold, except the sisig platter which was the highlight of the meal. We ordered the huge shared platter for 6, and though it looks like a lot of food, it's mostly filler items like bland steamed vegetables and way too much rice. If you come here don't get the shared platter and just go with the pork sisig and maybe some garlic rice.", "author": "Derrick W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-11", "description": "THIS PLACE IS OVER RATED.\n\nI am giving this place a 1-star rating for the following reasons:\n1. The food was not amazing at all except for the \"DINUGUAN.\" \n\n2. The \"BARBEQUED SQUID\" was tasteless. No flavor at all. Dry.\n\n3. The \"LECHON KAWALI\" was a disappointment. It was old. Cooked days before. Akin to an order of another costumer that was a left-over days before; washed up; re-fried. Et voila! It was served to me and to my spouse!  Seeing it on our table was a shock to us. It was insulting, in fact. \n\nAs you must know, when the \"LECHON KAWALI\" Is freshly fried (or baked), its meat and skin should be crunchy; the fat- juicy, and overall color should be golden brown. Here, THE SKIN WAS NOT CRUNCHY BUT RUBBERY! The meat is dry and too dark. It was also served WARM, not hot.  It was a struggle eating it like me having to deal with TUG-O-WAR between my teeth and the F_ _ _ING PORK! Husband and I just tried one each and dang, that was it. \n\n4. I had expected a better food service from this place considering the fact that it has received a lot of 5-star ratings from its patrons. And for crying out loud, they even had a spread at the SFO Chronicle!!! Also, it is costly. Not worth it.\n\n5. Lastly, my  husband had expected an \"AUTHENTIC LECHON KAWALI\" as it is traditionally done (served as a whole chunk of pork and then, sliced into bite size when served. *SEE PHOTOS BELOW*). RE: the sauce- it is a joke. Too much gelatin. I didn't even recognize the liver flavor. it had a funny taste. Well, what do I say? It was a case of a recycled old LECHON! That's it. Honestly,  I sensed that the woman and the man who served us this were watching us all thru the time we were there; thinking probably that they got rid of their old forgotten LECHON to good use. Ha! Yes, we were screwed and we just decided to be  mum during the time we were there, dealing with this frustration and ordeal. But, hello- it is about time you folks know if it's worth coming here  at all (and dump your hard earned dough?). It's your call. Merci beaucoup!", "author": "E Olga P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "Thank you again Yelp for helping me find this gem! This is the first time my family and I have experienced \"kamayan\" style of eating Filipino food and this was really good! We did the Animan which feeds 6 people and the Tatluhan that feeds 3 people and definitely fed all of my family and still have left overs. Btw, there was 15 of us, half were kids and other half adults. Food quality is awesome because it's mostly grilled, not that oily and super fresh.  I would definitely bring friends and family over here when I'd come back to south sf.", "author": "Jocelyn Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "The serving is huge! The food is even better. We stayed longer after lunch and the servers are still accomodating to us and asked us if we need any more water or something.we had take outs. They forgot to change the bangus in animan meal and forgot the garlic rice but theyre very apologitic about it and didnt even charge us the upgrade meal and 15% tip we were groul of 8 i asked why they said because they felt they had bad service, which i didnt think so! I will come back definitely if im in the area! Great service, great food!", "author": "Jufi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "The bilao is worth the price! We got the 4person bilao and the meats are so good!! i will come back here when i go to San Fran! Ate is so nice to give us free extra rice and free dessert, minatamis na kamote(yams). Ate we will come back there ha!!! Free rice again hehehe", "author": "Rochelle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "We came to Daly city to get some Filipino food and we could not have chosen a better place. I got the fish sisig and it was delicious. My partner got kare kare and it was very good. Only thought was the restaurant could have been warmer; it was a little chilly.", "author": "Laura J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-21", "description": "Celebrated my daughter's 1st Birthday here September 20, 2015. Food is awesome, everyone on the party enjoyed everything that is served. Thank you to the owner Tita Jo, for being so accommodating and preparing a delicious buffet.", "author": "Estel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "Born, raised, and having lived in the Philippines for most of my life (23 years!), I could def say this is one of the more authentic Filipino restaurants in SF. I've been here over 3x and was impressed each time, especially with their boodle fight. I don't think there is any other place you can get a boodle fight on actual banana leaves! Definitely takes me back to my roots. I even am compelled to eat with my hands every time. ;) Their sisig is good as well, served on a hot sizzling plate with lots of onions - perhaps the closest you could get to authentic sisig from Manila. Had to leave out one star for service, however. Last time I went (Sunday at around 1PM), the wait was HORRIBLE. Had to wait ~20 mins to be seated and then another ~45-50 mins to be served food. I was hungry and irritable and it really ruined the experience... they also seemed to be all over the place that time, not cleaning up tables fast enough to free up more space for new customers, forgetting some things we asked for (like lemons for our sisig), etc. Would highly suggest that they hire at least 2 more waiters/waitresses to accommodate their customer flow! Other than that though, this place is really good, and I for sure will be back. Just hoping service is better next time!", "author": "Trisha D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "Auntie was very cute and helpful even towards my nonfilipino friend!\nFood was amazing! And really good for the buck! \nLeche plan for desert was so good and had left overs for another night! \nWill be coming back with more friends! Great place to introduce them to Filipino food!", "author": "Paul C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "28-September, Saturday\nWe ordered the Dalawahan special, which serves 2 and is beautifully presented on a giant platter & banana leaves. Not having had the taste of Filipino-fare before I wanted my friend to be able to graze on everything without having to commit to merely a single thing that he risked not enjoying.\n\n-chicken barbecue: that was tastefully seasoned, flavored, and cooked.\n-grilled tilapia: a bit smokey, fresh and flaky.\n-inihaw na baboy (grilled pork chops): similar to how my grandma makes it, deliciously marinated, char-grilled, and served as little cuttings that were about 1/2\" thick.\n-itlog na maalat (salted duck egg)\n-lumpiang shanghai\n-mango / onion / tomato \n-minatamis na kamote (sweet potatoes): with rich syrup \n-steamed rice\n-steamed seasonal vegetables\n-talong (eggplant)\n\nThe service is super friendly, the food is well within good value..\nAnd the atmosphere more of a hole-in-the-wall yet very inviting.", "author": "Ty T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-03", "description": "Drove took Bart and walked for over an hour to try this place out and it didn't disappoint .We wanted a home cooked meal on our trip to SF somewhere we thought the fam would like. Well it was worth the trek everyone enjoyed it.", "author": "Andrew J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-20", "description": "Their Kamayan is delicious!!! Soo much food for such a cheap price. Plus the service is great! Jozie and Lan the owners are really sweet, they love giving great service. They also do Filipino catering for large events! Check them out! \n\nYou have to get their turon and bbq (the best in town)!!!", "author": "Abbey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Yep, this place is good. I'm half Filipino, have been to the Philippines, grew up eating Filipino food for years at family gatherings, and took my mom to this joint when she was visiting SF a few months ago......needless to say we know a thing or two about this kind of food. We approve. Gonna keep it short and sweet and say you can't go wrong with anything on the menu (we ordered like 7 things). And trust me, I would say something if I thought the food sucked (see my other reviews for other Asian restaurants).", "author": "Lyle Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "Amazing food , excellent services and great atmosphere. It is a must go place. We got the plate for two and we almost couldn't finish.", "author": "Albert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Omg! This place got some good Filipino food. The food for 6 is really enough for 10. They give u lots of food. Great environment.", "author": "P M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-22", "description": "The food was great. We ordered the combo for two to share and still had some to pack home. \n\nThe reason I gave 3 stars instead of 4 is: as the waiter introduced the sauces to us, he kept robbing his nose, then used the same hand to touch the saucer. It was like this back and forth for 4 of each sauce he introduced to us. Don't get me wrong, the food was great. In terms of being hygienic, there is room for improvement.", "author": "Yc C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-28", "description": "Great place! Ok I'm biased because my blood is from Pampanga but the food speaks for itself! People are friendly and the presentation is beautiful! Prices are great too! \nCame here with my co-workers and loved it!", "author": "Marie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "The meal for two was awesome, lots of variety and great sauces. At least four entrees, vegetables, and mango tomato side. Presentation was very tropical, fun time trying to eat all of it. Prices were very reasonable, wait staff very nice. Will definitely go back and recommend this place.", "author": "Maria M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-21", "description": "Dont even think about this restaurant! Awful restaurant!  The price is not comparable to the quality of food! I would never go again to this palce for any reason and I dont recommend this resturant, not even to my worst eneym! In few words, you should better try McDonals on the main road! I gave all my food to homeless guy on the street!", "author": "Amir P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "It was our 1st time- good food, place is clean!\n\nWe ordered the kamayan for 6- it was very delicious.  Staff are very helpful & friendly, I'll be coming back!!", "author": "Cristina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-25", "description": "This restaurant should really be called -- JUST LIKE MY GRANDPARENT'S KITCHEN\n\nThat is all.\n\n*drops mic*\n\n*walks away*\n\nPS: The sinagang na baboy will rock your freakin' world AND The Filipino Channel is on 24/7.", "author": "Bruce R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "My friend and I had lunch here a few days ago after months of talking about walking around her neighborhood and exploring.  This place is totally unassuming,  It blends in to the rest of the block and would not have been noticed had we not been carefully checking out all the storefronts we passed.  When we made it in, we were greeted by a very friendly young woman.  We were each provided a glass of cold water with a slice of calamansi, a nice surprise treat!\n\nWhile trying to decide, we noticed that they have a few items on the board listed as their lunch special.  We decided to share their 2 dish combo of dinuguan and chicken barbeque.  What we got was a ginormous skewer of full flavored chicken yumminess, a generous soup bowl's worth of some of the best pork stew I can remember having and a scoop of rice, all for under $9.  We also ordered pansit canton because I felt the need to pretend that I am eating a balanced meal including some vegetables, however miniscule they may be.  Who knew this dish would turn out to be so delightful also??\n\nEverything we had had just the right amount of salt, which is usually a pet peeve of mine.  Customer service was awesome.  Prices per item were more than fair.  What's not to love here?!!", "author": "Yvette F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-01", "description": "I love small family-run places like this. You can taste their labor of love in their food. Mom cooks daily, dad and kids runs the the tables efficiently with a lovely pinoy-friendliness. \n\nLaing is wow!\nPansit bihon- my fave! Theirs is nice and the noodles are soft like luglog :)\nInihaw na pusit.\nBangus sisig - super MUST try!\nHalo-halo (fresh sweet kamote)", "author": "K O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "Great authentic home style Filipino food. It's a must try for all you Filipinos and Filipino food lovers. Excellent service and hospitality! I went around 330pm on Sunday so there was plenty of parking.", "author": "Russell A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Great food and service. Food is delicious and affordable. Highly recommend the 'kamayan' option and halo-halo for dessert.", "author": "Alliv S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "Tried this place out last week and I really enjoyed their food. I searched all high and low to find a place that sells good lumpia and this place would be my top 3. I also got a tocilog and longsilog dishes. The tocilog is my favorite, very flavorful and the garlic rice wasn't too overpowering like other places. Just the right amount of food too. I would def go back whenever I'm craving this again.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-13", "description": "Had the Pancit Bihon for lunch.  It's rice noodles with veggies and chicken.  A little oily but really tasty.  I couldn't finish.  Very basic space and service was slow, though I got my food pretty fast.  Next table had a sizzling pork plate which looked good.  Got out for $12 with tip, I'll be back!", "author": "Steven S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "This place has really good pinoy food, my fiance and I stop by one day while looking for philipino food and we loved it. The staff was super friendly. Great place to get authentic philipino food", "author": "Juan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "The staff was SO friendly and accommodating for our large party of 17! The food was DELICIOUS, everyone was stuffed and there was still food left over, there was amazing music and karoake, everyone had a great time, and the price for each person was very affordable. I would definitely recommend this place, especially for the friendly staff and fun atmosphere!", "author": "Kenny Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "If you're looking for delicious, authentic Filipino food...this is definitely the place to go. I'm kapampangan and can vouch for the place being legit, unlike some other filipino restaurants in the Bay Area. In addition to the great food, the service was excellent! We were a party of 12 and the owners were so friendly and super hospitable...almost felt like I was back home at some Filipino party. I would highly recommend this place! I'll be back soon Pampamguena Cuisine!! Thanks for making my birthday celebration such an awesome one!", "author": "Charlene F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-23", "description": "We arrived at this restaurant's location in Excelsior and it was empty. Not usually a good sign but we were hungry and intent on eating here based on the Yelp reviews. \n\nThe owner Josie convinced us to get the kamayan for two, and glad we did! It's meant to be eaten with your hands and we did. Very fun! It included bbq chicken, beef tapa I think, whole tilapia, lumpia, eggplant, mango salad, and the best bagoong ever (sharimp paste). Oh and salted egg? I think.. i don't usually like those, but these were very good. Everything was ooo yummy, tasted really good. The meats were good quality. And it was an event, so we had a real good time. We'll have to come back and try other items on the menu.", "author": "Vol T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "Pampanguena catered for an event I hosted last night and did not disappoint. We had the pancit palabok, garlic fried rice, chicken adobo, pork BBQ, chopsuey, and lumpia. My favorite was the pancit palabok and the BBQ pork. If you're looking for some good eats or a place to cater, try them out!", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "They got yummy Kare Kare :)! I'm really picky when it comes to that entrée, and they did it right. \n\nAs far as the portion, it was okay for $16. My fiancé and I gobbled it all up. So know that it isn't enough for a family of 5 unless you order something else. We usually order Filipino food from the peninsula, and they hook it up more. \n\nI ordered for pick up. I thought it was a bit inconvenient how they packaged it in a flat box container and by the time my fiancé got home- it was terribly leaking. But pro is they had the food ready in 10-15min. \n\nNote that you can only pay credit if it's $20 or more.\n\nThey are really nice but please don't expect them to be super professional over the phone. I'm Filipina American so I'm used to them chit chatting on the side as they took my order. \n\nCheers!", "author": "Pamela B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-05", "description": "I'm typically not a fan of Filipino cuisine, but my experience here was excellent.  The service, and food, was really well done.", "author": "Regina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-14", "description": "My favorite Filipino restaurant in my neighborhood. Their Kare-Kare and Beef Nilaga are my favorite. Had their longsilog recently and it was yummy. Loved the garlic rice the most and the plate presentation was nice.", "author": "Jennifer V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-06", "description": "I can't tell you if the food is good or not, because I left pissed off. We get there at 6:10, and the place is busy. We stand where the hostess podium is, but no one acknowledged us. So, I went to the back and asked the waiter if we can have a table for 3. He said, \"oh, i don't think we have any tables, can you just wait?\" SURE\nSo, i stand and wait by the podium again for another 10 min. I see people leaving, but no one came and cleaned off the tables?!?!? So, I sat down in the waiting area with my husband and son and waited even longer. They close at 7pm. It is now 6:45pm! My husband gets up and asks the same guy \"you close at 7 right?\" \n\"Yes we do.\"\n\"Ok, so should we just leave then?\"\n\"How many people in your party?\"\n\"My wife told you 3\"\n\"Oh! I thought you guys left! Give me a few min.\"\nWTF?!?!? I grabbed my family, and we left. Terrible! I wont ever go back. Hell no! Fuck that.", "author": "Val E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "This place is amazing! Great food, great people. Just amazing all around. We tried the tatluhan and everything was delicious, and since it's kamayan (hand, no utensils) it just added to the fun. They give you utensils, though, if that weird you out to eat with your hands lol. This is definitely a new go-to!", "author": "May M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-16", "description": "The platter for 2 is what's up. Add some bbq chicken to it if you and your fellow diner are hungry. REALLY friendly owner :)", "author": "Grant M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "I love this place... One of the few truly good... Great Filipino food. They make their own lumpia, not bought frozen. Their lechon kawali is really good as well as the Sisig baboy. If you like bitter melon, then the ampalaya con carne is a must try. The pancit bihon is also a standout! We come almost every week. We are only disappointed whenever they take vacation & we can't get our Pampanguena fix.", "author": "Amen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "We were looking for a brunch Filipino Style, decided to come here early 10:30ish. Reviews on yelp is spot on.  This place is great!  Lan, was very attentive and food was delivered within 15 minutes.\n\nWe ordered the Kamayan for 2 (eat with your hands for 2).  The presentation is very good.  The food is awesome!  Make sure you bring CASH!!! They DON'T take credit cards.", "author": "SFoodie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-16", "description": "Amazing working family and delicious food! I feel like hugging all of them and calling them Tito and tita because I'm so satisfied every visit! Shoutout to tita Josie!", "author": "Rob S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "The owner is super nice. We got here way earlier than their open time, he still served us, and prepare for our food. We got the 2 people Kamayan Dalawahan, with a list of 10 items!!!! You don't have to eat with hands if you are not comfortable with it! Food is amazing!! And we will come again for sure :)", "author": "Fanny Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "Delicious food at a great price. We ordered the Sisig and adobo around lunch time and were promptly served. The food is as good as it gets! Really flavorful and traditional Filipino cuisine. The adobo was especially good! Both lunch dishes came with garlic rice and some veggies. The rice was phenomenal and the lunch deals are a steal! Be aware that it is cash  only, however they do have an atm machine in the restaurant ($1.50 surcharge if I'm not mistaken). Can't wait to come back and try everything else!", "author": "Mark C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "Great place to get it all for a family party or for a nice lunch for work.", "author": "Lioness M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "We saw this place through Yelp and decided to try it out\n We were so glad that we did because the food was great\n I had combinalot, which had fried fish and shrimp. My husband has barbeque binalot. Those two orders came with eggplant, salted egg, and tomato. I also love how they do not charge too much. The orders were less than $10 each. I am looking forward to come back to this place. I have never eaten so much in a restaurant, but in this reataurant I DID!", "author": "Pauline P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "I've bookmarked this place for a while and finally tried it. It was delish and well worth it. Only had the kamayan so that we could try a little bit of everything.  You eat with your hands so make sure all your party washes their hands.  There is a sink in the lobby use you don't to go to the bathroom. The service was good which makes the experience even better. The only con thing about here is that it \"cash only.\"  If you come here, don't forget to bring it with you. They have an ATM in the lobby.", "author": "LZ T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "Amazing service! Best place to go for \"Kamayan\" experience!!!!! $50 for 4 people and they serve a good amount, ask for the secret sauce!!!!", "author": "Tiffany K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-03", "description": "The food was delicious. Try the group meal on the banana leaves. Those are delicious with plenty of selection! Will be back for more.", "author": "Ting Ting C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-13", "description": "I came here with some Filipino coworkers, who said this place had great Filipino food.  At $7.50 for two items with rice, it's a great deal.  You can order one item for $6.00 instead.  \nI blindly ordered and even though my coworkers told me the names, I don't remember them, except they've got long names.  However, they were all very good, especially the eggplant and pork with shrimp paste.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "Best Filipino food in the city IMO. I get really bad cravings every few months or so for Filipino food, so I'm happy I found this place.", "author": "John V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "We order kamayan for 2 .. a lot of food.. BBQ pork, tilapia, unlimited rice, steamed vegetables, salty eggs, mangoes. . My kids enjoy eating pork BBQ.", "author": "Janice R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "My girl always orders tocino for me in the morning, homemade tocino here is hella good, this is the first time I've eaten here at the restaurant,  the food here is made fresh and taste delicious, not many restaurants where they have a sink to watch your hands than sit down and grub using your hands and chow down on the variety of food. The lumpia, the grilled bbq, grilled fish, steamed okra and broccoli,  salty egg and big portion of rice in the middle. My favorite was the suggestion of mixing the mango cubes, tomatoes,  and onions together, oh man was that delicious. There is so much full even with an empty stomach unable to finish the portion of food we were given and that order was for two. Thank you, definitely coming back with family next time here. Ma sarap!", "author": "Jayson V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "So delicious! New favorite place - such good, fresh food, great variety, and really nice people.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "My first stop into SF right out of the airport and I was craving some Filipino food.  Not just any type, Pampanguena style.  With my family being from that region, my standards for the cuisine tend to be a tad bit high.  So I was quite please to find that Pampanguena Cuisine wasn't too far off the beaten path.  Went here with two of my aunts, and all three of us were very much impressed with the dishes.  We started off with drinks---consisted of a huge coconut and the top was removed so that we could drink the fresh coconut milk.  We decided on the Kamayan for 3.  When they say for 3, it really is for a family of 5 or more because the portions are big.  It included a whole fried fish, squid, pork and chicken bbq (Filipino style), salted egg, side of onions, tomatoes and mango to mix with the food, grilled egg plant and so much more.  The dipping sauce sides were also a nice addition, this includes fish sauce, shrimp paste, and some infused vinegar.  We also ordered their sisig on a skillet, which was just as I had imagined it to be.  Lastly, we each had some turon (banana wrapped in an egg roll wrapper dipped in sugar and deep fried)----my favorite.  The owners Josie and her husband were so accommodating and helpful.  I'm glad we tried it out.", "author": "Luarnie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-06", "description": "No need to fly to Pampanga Philippines! Just take your self to Pampaguena Cuisine! You will feel right at home to use your hands to eat the authentic Filipino cuisine! We are definitely going to make the trip again from Sacramento!", "author": "Mariza H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-17", "description": "This was my first time eating Filipino food, so I was really excited. I know pretty much NOTHING about Filipino food except that it's supposed to be greasy. Also, lumpia are the most superior form of egg roll in the universe. As you can see, my knowledge is quite limited.\n\nThe nice part about this restaurant (along with the food) is the nice service. I felt like I was in a Filipino household! The cook/mom came around the tables, acting very motherly and very friendly. She really wanted to make sure you were enjoying your food. It reminded me a lot of my family, despite our non-Filipinoness. Enjoying the food is the best thing you can do to compliment the wonderful chef.\n\nThe food itself was great! We got the special platter for two people. It had fish, pork, veggies, fruit, rice - pretty much everything under the sun. I liked mixing some things and eating some things separately - it really leaves a lot to the imagination. And it's family style, so it's very friendly and really nice to eat with a date or a friend! You're supposed to eat it with your hands, but I opted for the fork and knife. Maybe next time I'll try my hands - that seems more fun :)\n\nIt was a great experience and I feel much more comfortable with Filipino food. I can't wait to try more dishes! And the restaurant confirmed my original beliefs: lumpia are the greatest form of egg rolls. Seriously. Delicious.", "author": "Jade R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-22", "description": "Omg!! First time here with my friends to celebrate a birthday! It wasn't crowded and I thought it was neat how there is a sink outiside of the restroom for you to wash your hands! The service was nice, but then again my friends speak Tagalog.  They ordered Dalawahan which was a super HUGE plate that had grilled talapia, chicken bbq, mango, lumpia,eggplants, tomatos, grilled pork, broccoli, etc. ad sauces to go with. They also have basically unlimited rice if you check in, so don't forget to do that! For soup, we had a tamarind based soup with meat and vegetables.  Dessert was simple but tasty. Note: Great for large gatherings or group parties. It's also a bit on the pricey end so make sure to bring at least $15-$20 with you when coming here. But being that it was my first tme having this kind of cuisine, it was totally wirth it!", "author": "Lena T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "I found Pampanguena from searching the web, and I'm so glad I did! These guys are so nice! My party was yesterday...Food was delivered on time, Josie even let me use her chafing dishes, which was so helpful! Everyone LOVED the food & turon! \n\nExtremely happy with the food and service! I wish I would have known about you a long time ago, but I will definitely be ordering again, cant wait to try other dishes! Thank you so much =)", "author": "Leslie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "Found the best kamayan ever. The drive is worth it. The grilled food are the best.  The portions are just right for the price. Definitely coming back and will use for parties.", "author": "Jovencio B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-29", "description": "The food was great, the place was organized and clean, the owners and servers were friendly. \nWe ordered the kamayan and was served on a basket. Unlike other kamayan places were they just dump your food on the table. This place has class. They don't make you feel like baboy! (Pigs).\nI won't be embarrass to recommend this place to my friends, it's worth the drive from vallejo.", "author": "Rey D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-27", "description": "Ambiance:  The loud flat-screen TV distracts your attention from the food.  If I wanted to eat food and watch TV, I would've just stayed home.  How about playing background Filipino music?\n\nFood:  Expensive items that run from $12.00 to 16.00 for some of the big-ticket items, which do not require a lot of cooking technique other than fry, simmer, etc.  Pinakbet is good.  Bangus sisig is okay.  The cooking is not very skilled, I think.  \n\nThe drinks are also way too $$$.  Calamansi juice that I know comes from Safeway is $3.50 a glass!\n\nPresentation:  Divey plating.  No garnishes, no TLC given to the food!  \n\nService:  Friendly, attentive.  Don't like it that it's cash only.  ATM inside the restaurant -- tacky.  That \"Bahala Na\" attitude prevails (if you know it), and it kinda shows in the overall dining experience of the patrons, myself included.  :-(", "author": "B Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-01", "description": "Very tasty chicken adobo, friendly service.", "author": "Lisa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-14", "description": "My friend Val introduce me here since I am looking for a best Filipino restaurant here in San Francisco. I just got here last April from LA and being married to a white guy I need sometimes for my self, What I mean my own native food. I love the place, its cozy and the food is fantastic, worth every dollar we spent. I brought my husband here and they did not fail me and hubby love it much as I do.\nDefinitely I am still coming back once I get a chance away from my busy schedule.", "author": "Jisselle Marie R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-26", "description": "I called this place to get pricing for a tray of lumpia and the lady accused me of continually calling her for the last 1.5 hours. Uh no. This is the first time I've ever called your restaurant. And the last. Rude.", "author": "n m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-27", "description": "Great food btw friday, sat and sun they have a no spoon policy but for the people who doesnt wanna get dirty and still want to enjoy  the food ill suggest  to come in mon to thursday excellent experience i will definitely recomend this place for traditional filipino kamayan", "author": "Allan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-06", "description": "Takes credit cards at $10 minimum\nThe woman who serves my food is so sweet and always treats me like I'm a relative or friend. The food is delicious and seems fresh. \n\nI'm a fan of the adobo (natch), sinigang, and pretty much any other meat dish.", "author": "Candice B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-28", "description": "So, I was excited to get Filipino take-away food for my parents, but was disappointedly declined service. Ano ang ano ba? Apparently, the person who took my call commented they were so busy. Totally understand, but really?", "author": "Rowena R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Better than house of sisig. We order animan meal that fed 7 of us plus to go, and if you check in you get unlimited rice. After we ate they gave us free desert and bought there suman to go. Totally coming back here everytime we visit the bay", "author": "Cesar G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "This was such a blessing for us! We were turned away from a previous Filipino restaurant (and that restaurant wasn't even closing yet )before coming to this place, but here we were welcomed with open arms even though they were about to close! Salamat po!!! The staff is so beyond friendly it's like going to a family party where you feel right at home. Our server was the nicest man ever! I'm so sorry I didn't catch your name, but you're from Quezon City! Maraming Salamat Po!! The food was delicious and took me back to when I was a child eating Tuyo with my hands. It made me is visiting the Philippines. The owner was soo nice for welcoming us even though they were closing the kitchen and she was tired. Can't thank you enough! Garlic Rice is delicious and the eggs were cooked to perfection! I'll post photos too! Love the ambience of the place and the decor. If you're looking for Filipino food that'll hit the spot and remind you of home come here! Bangus Silog, Chicksilog, Tocilog all reasonably priced to around $7-$9. Calamansi Juice and Fresh Buko Juice! Yes! Drinking right out of a young coconut! :) I can't get over the customer service because everyone there was so kind and they did everything to make sure we were comfortable and satisfied this is so rare in restaurants and I truly appreciate it and I'm definitely recommending everyone I know.Thanks Again!", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "I had the Lechon Kawali as my main dish...  let me tell you the absolute delight of taking a bite of this delicious pork, the burst of juices and spices were  Sublime.   I was treated like a friend, as is the custom with all Pinoys.   Will definitely come back and wholehearted recommend.", "author": "Anthony A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "Our trip to San Francisco won't be complete without having a taste of Filipino food! We found this place through Yelp and glad that we didn't pay attention to the bad reviews. It was a slow evening for the restaurant as it was a weekday. We had the place to ourselves and ordered fried pork skins, lumpia, garlic fried rice, pork barbecue, Filipino beefsteak, crispy shrimps, pancit (bihon and canton). The portions are big and good for sharing! We love the spring rolls, beefsteak, pork skins and the fried rice! If you're new to Filipino food, order the spring rolls and \"bistek\", you won't be disappointed! The guy that served our food was very accommodating and very polite! You don't get to see that often  even in high end restaurants. It's best to dine here on weekdays (except Fridays) when the place isn't packed and you have to wait for an open table. Thumbs up for a great Filipino dinner!", "author": "Ferlinda U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "This place is so good. Perfect for when you're hungry, but don't want anything too greasy. The owner is so nice and gave a lot of suggestions for us newbies to Filipino food. I shared the dalawahan with a friend and it seemed like a LOT of food, but we just kept eating and somehow finished it!! Who doesn't love food that has a home cooked quality to it?", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-12", "description": "This place is amazing!  I go here whenever I am too lazy to cook.  The food taste like my mom's cooking and is inexpensive.  \n\nThe owner is so sweet!", "author": "Lauren W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "Very friendly and welcoming owners. home-like environment. Service and food was AMAZING", "author": "Jen O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-19", "description": "I called to place an order for pickup and was told that they couldn't take my order because they \"were really busy\". I wasn't even given the option to wait. Very disappointed. I was really looking forward to trying this place.", "author": "Orlena P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "Stumbled upon this cute little place on a random night last week thanks to Yelp! \n\nGot the Kamayan for 2 to share with my boyfriend and we were stuffed! It includes BBQ chicken, pork, tilapia, lumpia, veggies, onion, salted eggs & mango pieces! The portion size was really good (my boyfriend eats a lot and we were still both really full) and there was nothing on the platter that I didn't enjoy eating. \n\nWe've actually eaten at a similar Filipino restaurant in Daly City by In-n-Out and it was not nearly as good at this place! That place was a bit more expensive and their waitress was rude (and she also forgot my coffee until I was about to pay for the check)!  \n\nThe service here was amazing! They were really friendly, attentive, and super sweet. Kind of reminds me of my aunts. I'm not Filipino, but have eaten at a lot of Filipino places. This is by far one of my favorites! I am definitely taking my Filipino friends here sometime this week or next week!", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "Authentic Filipino food.Reasonable prices. To top it all, great experience and great tasting dishes", "author": "Zara A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-09", "description": "Ok so this place is much more better than house of sisig. The place is relatively small like house off sisig but the food taste so much better. I was a little disappointed that they didnt have the platter for 8 anymore but the bbq was flavorful and not dry, also the vegetables were fresh.. Will definitely come back, but be warned you might have to wait to be seated.", "author": "Thomas G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "Awesome place to eat Pinoy cuisine!", "author": "Tonie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-13", "description": "My first time here and I do realize my family and I were their last customers. We sampled their Kamayan Apattan (a meal made for 4 people, usually eaten by hand). Included in the deal for $50 dollars is: Chicken BBQ (which had a wonderful sauce slathered on), Grilled Pusit (Squid), Grilled Tilapia, 8 PCS of steamed and lightly fried shrimp, Inihaw na Baboy (Grilled Pork), Itlog na maalat (salty egg), lechon kawali (fried pork pieces with Mang Tomas sauce on the side), Lumpiang Shanghai (Lumpia), Minatamis na kamote Sweet Yam), steamed veggies, rice and eggplant fritter -with a side of mango salsa. \n\nAlthough the menu stated that all of that feeds four, I swear it could totally feed 6 and those 6 people would either be completely full or end up bringing leftovers home. Meaning, yes the portions are HUGE. I also ordered their diniguan (chocolate meat, as well tell kids), Menudo and Bopis. Although I didn't try their Bopis, the Menudo was really good and the diniguan was fair.\n\nFor a small space that seats about 40 people, they do a really good job keeping the place clean. My biggest surprise was the bathroom.  No offense, but being in the Mission District, I prepared myself for the worst. The bathroom is extremely clean and nicely decorated. Something that never ceases to amaze me. The workers are extremely friendly and nice. They constantly check up on you asking if you'd like refills or if they can get anything from you. They are very hospitable and considerate.\n\nMy only disappointment? They ran out of Turon (Fried Banana with Jackfruit). Although, who can blame that? Turon is such a lovely treat, I'd be more worried if they had more left at the end of the day.", "author": "Shilo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "This place is legit. From the toasted garlic in the rice to the kare kare to the bbq chicken. So good! It is a family owned place that makes everything fresh to order.", "author": "Joe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "Gotta say... Glad we found this gem.... Great food, great service, great price. We truly enjoyed it!", "author": "Cecilia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-17", "description": "It's so great to be able to find a good place for Pinoy eats in the city, especially without having to go to South SF or Daly City. I took a few friends here and we shared the Kamayan plus some sisig. Both were delicious and the price wasn't bad at all! The server was nice and accomodating and the place itself is small but worth it. Definitely recommend.", "author": "Stephanie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-26", "description": "Boo for the metered parking! Anyways, I'm giving Pampaguena 3 stars because the owner was really nice and the restaurant is clean, other than that Pampaguena has okay Filipino food. I had the chicken BBQ with rice and my mom had the 2 item plate. The rice was really dry and a tad bit grainy. Maybe I just like my rice fluffy and soft! The chicken BBQ on a stick was okay, but lacked flavor. I heard they have kamayan, which is cool, but I probably won't be back to try that.", "author": "Joyce E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-08", "description": "They are on family vacation and not coming back until 8/18. I had expectation trying their food yesterday but they are closed for now.", "author": "Mimi N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-02", "description": "Came here with a bunch people who hadn't tried Filipino cuisine before...and I'm not sure this was the best place for them.\n\nThe food was more of a fast-food style, which is nice to see the food to order, but since nothing was labeled, it was hard for them to figure it out.  The guy helping us was super friendly, and explained everything to them so choices could be a little easier.  \n\nI really wanted chicken adobo, and made sure we got it. The chicken was ok. Not really juicy, but saved from being dry because it was on the bone.  But it wasn't overly great.  We also got meat on a stick (chicken and pork), and basically took the last pieces they had to serve. The meat was pretty good but SOO hard to get off the stick! I was afraid of flying meat...\n\nI don't know., maybe I haven't had too much experience with Filipino food, or maybe I only have had really good ones, but it wasn't exciting for me. I'm glad its around the Excelsior for more variety in food, and for a quick fix I can see why this place is good. The area is clean and the service is nice. But the food itself isn't something that makes me dying to come back. Its just...ok.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "Simot saa SOBRANG SARAP at mas mura pa sa Isla. More meat and ulam lesa sa 911 food... Lol", "author": "Maria Theresa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-03", "description": "hay nakoooooo! shit, i'm not even pinoy and i think this spot is awesome!\n\nstumbled upon this spot after a quick yelp search for some good filipino food. the filipino breakfast plates are awesome and i ended up getting the longsilog plate, while my friends got some pancit, kare kare, and some lumpia to share. the portions are decent and the garlic fried rice was on point. the kare kare (my favorite dish) was cooked perfectly and had a good amount of ox tail and veggies (don't forget the bagoong- shrimp paste!). overall the food was great and it even ended up being the best meal during the weekend Frisco road trip with my friends.\n\ndefinltey will come back again if i ever plan a trip back up to the bay area!", "author": "Jeff K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "Great family owned restaurant. Kamayan was the best I've had in the Bay Area! Fresh coconut juice was so good! Will definitely come back and recommend to my friends and family!", "author": "Crystal E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-07", "description": "im a big fan of family style and interactive dining which was what enticed me to come check out this place for the kamayan dinner. even though we were told that ordering a kamayan dinner for 6 for 7 people was more than enough, i personally felt like it wasn't enough food and i only had a little bit of each item too. and since they did say 6 was more than enough for a party size of 7, it doesn't really quite make sense to charge us extra for ordering \"less\", especially since there wasn't even a kamayan dinner for 7 option available.\n\ni am a fan of filipino food but there wasn't anything impressive about the kamayan dinner itself. i did enjoy the mixture of tomatoes, mango, and onions though with the BBQ meats. that was something new. i wouldn't mind coming back here with others that want to give it a try, but i would just get a smaller order of kamayan and entrees off the main menu", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-07", "description": "Love this place!  The food was really good, the service was great, and the price can't be beat!\n\nMy husband and I came here for lunch.  The husband and wife owners couldn't be friendlier.  They made a couple of great recommendations, and we also ordered a couple of our standard favorites.  Everything was really good.  I would give the slight edge to Fil-Am on their bbq due to flavor, but the quality of the meat at Pampanguena was better.  I will definitely be back!", "author": "j k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-16", "description": "Josie always comes through from on site food to the quick catered meal.  My mom would make a quick phone call to PC and Josie would be very accommodating.  We usually order the BBQ and Turon for big parties, which are delicious.  Normally, Filipino places would be facetious from attitude to the food, but this place isn't.  I feel like family on the phone or in person.    All in all, convenient, friendly, and good Filipino soul food.", "author": "John Michael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "Food was amazing and authentic. And the owner is really nice and easy to talk to. Definitely recommended it!", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "I love their kamayan and breakfast. Their service is super friendly, restaurant clean and prices wallet-friendly. This is a hit with the out-of-town guests. My fave filipino restaurant in SF.", "author": "Catalina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-13", "description": "we drove here for almost an hour but they didn't have most of the food that they advertised on the menu. the reason being that its a sunday and they are out l. i was really craving for the sisig and chicharon but was informed that its unavailable.", "author": "Christian A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-30", "description": "Food was phenomenal. I wanted to take my in-laws for a Filipino Kamayan experience. We ordered the animam which was plenty for five adults. The place was superbly clean which was one of my fears when entertaining non-filipinos to Filipino food. Most definitely will be back again and will use the restaurant for any catering needs that I may have in the near future. The deserts are A1 too.. Had the Halo Halo and Leche Flan..", "author": "Alexei L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-19", "description": "The food is soooo good & fresh. The place is clean & the owners are very hands on with the cooking & serving. The prices are very affordable.", "author": "Dorcas C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "If you are looking for authentic Filipino food, great service, and great taste, you have come to a great place. I have not seen a place in the Bay Area with Filipino food this good, and I've been in the Bay for the past 10 years! Excellent quality, from the use of banana leaves to provide that homesick feeling of eating on leaves in the Philippines. If you are new or only familiar with Filipino food, this is also a great place to start. Squid, shrimp, mangoes, tomatoes, each have their own story. The salted egg also reminds me of the salted eggs they sold in Manila when I was a kid! And they're service is excellent. Really nice, accommodating family restaurant. They have been featured on TV as well. The only caution I have is that people usually eat the food with their bare hands. If you aren't comfortable doing that, I would get spoon and forks. Highly recommend this place and I'll definitely be back! salamat!", "author": "Sam N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "Fantastic service. Amazing food. Free WiFi. Employees were enthusiastic about helping us take pictures. Only downside was parking. Still well worth it!", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-08", "description": "I had the pinakbet here, as well as the bbq pork.  The pinakbet was very fresh, and the pork was really well seasoned.  I also thought I was even more hungry than I really was, so I also ordered some lumpia shanghai, and got really stuffed.  Everything tasted so good though.  I highly recommend this place if you're hankering for Filipino food.", "author": "Lawrence C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-23", "description": "We ordered the \"Tatluhan\" which is one big bilao of Tilapia, Longanisa, Beef Tapa, Tocino, Grilled Squid, Crispy Shrimp, Vegetables and 3 cups of steamed white rice.  At first I thought we wouldn't be able to finish it because my daughter does not eat much. But the food was fresh and the grilling was spot on so we finished it all! \n\nI'd give it five stars but they accept CASH ONLY, which I didn't get from the other reviews.  This could throw off anyone bringing just their debit/credit card.", "author": "Jonas J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "First time eating here, saw many pictures online, and since I'm here from Glendale, celebrating my Moms Birthday, we decided to give it a try, staff was very pleasant and food was delicious. Very highly recommended for authentic Filipino food..", "author": "C D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "I have never had Filipino food before and this place did a great job of introducing me to some of the unique flavors. My girlfriend and I ordered the large platter for 2 and it was an awesome deal for the price - got a ton of food and it was really good! The owners and staff are super friendly and have great recommendations as well. Next time I want some Filipino food I will be back!", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-18", "description": "We went to this resto last night for dinner and Josie was the one who came to the table :) i love her - shes so friendly and the food are soooooo good!!", "author": "Maria D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-19", "description": "Loved everything! \n\nWe paid a rare visit to Daly City to get fitted for a barong and do some dress alterations just down the street at Pioneer and began craving Filipino food. Since my fiancee is Kapampangan, this was a perfect find to satisfy our craving. Very friendly owners and the food was delicious. I had the beefsteak and chicken BBQ and it's as good as it gets. TFC plays on the flat screen while you eat :)", "author": "rodolfo m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "Perfect place to eat if you want a homestyle Filipino ambiance. Food is great!. The dalawahan is perfect . It has barbecue, broiled fish, steamed veggies, lumpia, etc. It came with sauces that are so good as well. I definitely will come back.", "author": "Carol C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "Ate here a few days ago and the food and service was great :) The family running this place is super friendly and seem to know the majority of their customers by name. Atmosphere is 'standard filipino joint' look - could definitely use some sprucing up and better presentation, but it's clean and that's the most important thing.\n\nWe got the bangsilog and the longsilog, both were delicious but longsilog took the cake. We also got turon at the end. I thought it'd be better if the turon was freshly cooked though and not served cold....\n\nAll in all a great establishment that I'm sure I'll be visiting again.", "author": "Maria Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "The place is very good. Real Pampangueno food.  Everything we ordered (lechon kawali, pansit bihon, daing bangus, pinakbet, chicken adobo, lumpia  shanghai) was awesome!! The halo-halo was good too! Super sarap!!", "author": "T M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-17", "description": "The owner and host is very energetic and entertaining.  The bbq with  mangoes, tomatoes, and onions complement the entry well - delicious", "author": "Ulysses D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "Quality Filipino food and quality service! Everyone who works here is so genuinely nice and helpful. If I am ever in San Fran, I'll be sure to stop by here again!", "author": "Kiana F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-09", "description": "just reviewing the service.  seems unorganized and need to be more considerate of people who call and want to try your place.  after putting us on hold for over 5 mins saying you are doing something else, then still hanging there and then have someone else pickup the phone and then tell us you are closed.  well, you don't really want customers to come, then we won't.  simple.", "author": "Food Is L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-12", "description": "Went here with my family Sunday April 7, 2013 with the family. I must say, they are regulars of this restaurant. (We went early for lunch 12 noon and were the first so it felt like first class service )Service was excellent (very tentative), food was awesome. Everything was fresh. I am a stickler for good rice. The rice was cooked to perfect. Vegetables were fresh. This is actually the first Filipino Cuisine I have eaten at. I will not count Goldilocks's. I will definitely return real soon.", "author": "Iris W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-23", "description": "I LOVE YOU NINANG JOSIE!!\n\nthis is my first godmothers restaurant! OMG..i didnt even know she opened one in the bay!", "author": "Jessica d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-29", "description": "I'm baffled by the positive reviews. I popped in for lunch recently and had chicken adobo that was obviously old and rewarmed -- and only half warm. Service was so-so (the one waitress seemed spread a bit thin) and the prices were way too high for the poor quality. I live only 4 blocks away but doubt I'll be back.", "author": "Bruce M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-12", "description": "I love being Kapangpangan. Pampanguena is what you would call a woman from our area. So I spotted PC and made a U-turn to meet this woman - who is from Macabebe. Its right across from the Excelsior Library. \n\nThe restaurant is \"turo-turo\" style, which means you point and show  - \"Turo\" what you want.  The sister running the show was really sweet.  People cook things differently, many Filipino dishes are stewed, and tomato/soy sauce/peanut/tamirind based - you have to ask what everything is or might be and she was patient and generous with \"darling's\"\n\nThey cater, they have barbeque, which I'll have to return to try, and PC has various sweets - karioka - filipino sticky rice donut with caramelized sugar on a stick, bibinkga - the stick rice kind or cassava kind, and puto bumbong - sticky sweet purple rice.\n\nThe space is a fresh green, with some art. The chairs and tables are basic, and eat-in is served on paper plates on cafeteria tray. It was a bit cold in there, but we were the only people inside eating as some people made orders.\n\nI have to go again to try more things - A 2 item plate with a soda was about $8. In the meantime, exercise you mouth:\n\nMA-Ka Baybay Puto Boom Bong!", "author": "Cheryl D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-22", "description": "Don't order the kalabasa and sitaw.  Under cooked squash and so so taste.\nBinalot na Sisig with eggplant? under cooked eggplant. \nWas hoping the inihaw na Bangus & Tilapia would be the saving grace but found out they forgot to include that in my husband's take out order.  And yes, he already paid for it.", "author": "Moe G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-23", "description": "Serviceable food served up by a friendly lady behind the counter...\n\nPrices are fair, as well...", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-14", "description": "Well after spending time in the Philippines earlier this year, I come home to see a new Filipino Restaurant which has opened in the neighborhood.\nI said to myself,self maybe your going to find some of the yummy food that you miss and crave.Not really. I went there one Friday for lunch. I was greeted by a very friendly lady behind the counter. It was only 12:00 pm yet they ran out of many dishes already. I ordered a few things along with steamed rice. \nThe rice was overcooked and burnt from sitting in the cooker too long. It is hard to screw-up steamed rice.The sides were not that warm considering they were in the steam pots. Price was ok, service good, clean and friendly ladies.\nAt least I enjoyed watching Wow Wow Wee while I read the Asian Journal.It is hard to make the adjustment when it comes to prices from the P.I. to the U.S.A.", "author": "Scott Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-26", "description": "The food is sooooo good!!  We ordered the kamayan for 2 and it's all worth it! Delicious! Big serving!  The owners are really nice and friendly. We will be back for sure!", "author": "Pin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-31", "description": "Decent shanghai lumpia at a reasonable price,", "author": "Kim K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-29", "description": "I came here for lunch today per coworkers' request. It is pretty nice decor here compared to most other Filipino restaurant where you order from a hot food counter. The selection features a good number of choices. If you order from the hot food counter, it's one item plus rice for $6 or two items for $7.50 (as I recall). There are also some set item plates that you can order instead. There's also a sign that says on weekends they serve buffet style for $7.99.  The lady there is very nice also.", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-09", "description": "I ordered food from Josie last Sunday, and she was really nice.  The food was also very delicious, especially the chicken BBQ.  Originally I thought they were closed on Sundays because thats what it said on YELP; however, it turns out that they're open on Sundays.  They also have a Buffet on certain days, which I will have the next time I go there.  Try out their delicious food, and I guarantee that you'll enjoy it.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-27", "description": "Good $7.50 lunch special with two dishes and rice, which can serve as two meals for me. I recommend the bbq chicken on a skewer and the plantain lumpias.", "author": "Chris N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "Fantastic authentic filipino food. Taste of fresh quality homemade goodness. Service attentive and friendly. Most definitely one of the best filipino food restaurantsin the area.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-09", "description": "Was craving for filipino food so tried this first time. 2 items was about 8.00 with free soup. I had chicken Afritada and bistik. Afritada was tasty, and bistik was ok. I was 3/4 into the Afritada when I saw a hair strand with red streaks on the food, yuck. I felt like throwing up. Anyway, lost my appetite even if I was hungry. I think the server and cook should wear hair nets. I should have told the lady owner who was there but was in arush and felt bad for the place. I was thinking of even doing the kamayan on a future date but I will not repeat due to the bad experience. Please wear hair nets!", "author": "Jose D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-26", "description": "DELICIOUS LONGANISA!! (the plump, red, tantalizing and juicy pork sausage) that is all I have to say haha. Decent prices (about $4-5)  for the silogs which are meals of rice, tomatoes, egg and an entree of your choice (fish, longanisa, pancit noodles, chicken adobo, etc) I love that the names reflect what entree you get (longsilog=longanisa, bonsilog=bongos (fish), etc etc", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "A friend recommended this place. I have always wanted to try them out whenever I plan to be in San Francisco. Finally, I was able to go today with another friend from the east coast. My friend and I were both hungry and ordered the Kamayan Special Tatlohan (good for three persons). We were not disappointed. The food was grilled just right, the chicken barbecue was so tender and flavorful, the fresh buko served on the shell was sweet and they even cracked the shell when I was done with sipping the juice so I could scrape the soft coconut meat. The dessert camote kept its cube shape until it melted easily in my mouth. Humble exterior, warm and attentive service, reasonable price, and of course generous portions of their good food. I will be back!", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-27", "description": "I'm not Filipino, but my bf is... and with all of the family parties and whatnot, it's safe to say I've had my fair share of yummy homemade Filipino food. Driving down Mission today, we decided to give this place a try. Sooo glad we did.... how did they know I was craving bbq-ed meat on a stick? Or ukoy, which makes three of my favorite foods (shrimp, sweet potato, and papaya) even better by way of the deep fryer? I'll definitely be back to try more dishes, though I would suggest arriving early because one or two looked like they'd been sitting there a little too long. The snacks and desserts at the counter looked delicious and the owners were very sweet, encouraging us to \"eat, go eat first!\" and just pay later. The total for two items plus a mountain of rice is just $6- go try it!", "author": "Lisanne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-30", "description": "The Excelsior has had a recent upsurge of good places to eat (thank god, finally!!!).  Henry's, Sushi Raw, Zabb Cuisine, Broken Record and to add to the list, this restaurant.  I've eaten here quite often and really LOVE their Menudo and Bistek.  I also order, on a frequent basis, last minute, 100 shanghai lumpias -- they fill the order, no big deal.  I recently had a house party and catered the whole thing from them.  Everyone raved about the food, and the party guests were mostly filipino, so you know this stuff is good -- there were some white folks there too and they loved it!  I want to also add that Josie and her husband are super accommodating and flexible -- everytime I called in to change my menu for my party, it was not a big deal to them.  You really feel like you're calling your Auntie/Uncle.  I highly recommend their restaurant.", "author": "Vicky M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-20", "description": "Had a great feast the other nite with some good friends form the neighborhood!  The smaller \"Feast Platter\" was plenty (with a couple of extra dishes of fave foods) for 7 hungry folks - plus some to take home!  Josie was great, and it was super to meet her mom too!  The BBQ was best, with the pork, beef and squid vying for top choice!  Pancit great, penagpet too - and the sisig was as well!  Definitely a place to head to for some really good authentic Filipino goodies!!", "author": "Will B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-17", "description": "This is my favorite Filipino restaurant in the area -- clean, friendly service, Filipino tv and papers and great food.  There's always a large selection, and everything's well-cooked and unpretentiously served.  I always order two entres and a couple deserts.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-17", "description": "My boyfriend and I were in the area and wanted to try Filipino food.We aren't too familiar with Filipino cuisine so we yelped and found this place. The service is pretty good, the waitress was kind enough to check on us to see if everything was alright or if we needed anything and I believe the manager also wanted to make sure everything was to our liking. We understood nothing, and yet the waitress was friendly enough to explain and offer a suggestion. I still don't remember the name of the platter we got but it is the platter for two people and consisted of grilled chicken, fish, pork, lumpia, assorted vegetables and rice. The chicken was tender juicy and grilled enough that you can taste the charcoal without it being overpowering/burnt. There wasn't any over riding spices which is a good thing because they provide dipping sauce so you can adjust the flavors according to your own taste. The platter set also comes with a sweet potato dessert that tasted like yummy bananas. I left feeling content. Will definitely come back to the restaurant if in the area.", "author": "L H."}
