{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Authentic, fresh, delicious local Mexican food! The salsas are made fresh and so are the amazing tortillas. I always come for the sopa de pollo. And not to mention, really great prices.", "author": "Nina R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-25", "description": "It's a great location for a Mexican food place with fun decor unfortunately the customer service and the food really missed the mark.  It's basically Mexican food for people who don't know what Mexican food is supposed to taste like. Super bland that even the peas in the rice where a dominant flavor. \nOnly redemption was that the spiciest salsa on the bar was delicious. \nWon't be back.", "author": "Angel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-26", "description": "Thoughts of warding off the chilly morning with some comfort food had me stopping by Pancho's for take out.\n\nSopa de pollo (Mexican-style hot chicken soup $9.95 per bowl) would sure hit the spot.\n\nUnfortunately what I got was a bowl of hearty but very bland soup. \n\nI squeezed the wedge of lime to give the broth a shot of citrus. And the soup had a bit of umph that disappeared in a flash. Spoonful after spoonful through fresh vegetables - carrots, onions, potato, celery and even bits of fresh avocado - as well as good sized chunks of chicken meat and rice, I was searching for that elusive satisfying bite. Never found it.\n\nBesides the tortilla that came with the soup, I did enjoy the complimentary warm house tortilla chips with pico de gallo salsa.\n\nMaybe I picked up the soup far too early in the day so the flavor had not had time to meld together from all the ingredients? But darn, I was so disappointed that my fond memory has been shattered.\n\nWould I be willing to try Pancho's soup again? \n\nYes, I would. But next time I'll keep in mind to stop by later in the day and hope the cook had the foresight to set the pot rolling with the soup early and that he remembered to season it well.", "author": "Joanna T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-30", "description": "No salsa sent with my bland burrito!! And the bag came with literally 5 chips. Why even send those?", "author": "Karishma M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-06", "description": "\"I'd like to order a torta with charred al pastor meat,\" said NO ONE EVER, but apparently that's what I must have said because that's what I got.  Sooooooo in this TORTA, you get maybe ten pieces of cut up meat squares, a smear of beans, shreds of lettuce, salsa (code for tomato), and mayo.... ALL FOR $10. Not worth it.  Could not enjoy it because the crunch of meat was not pleasant. \nHubby ordered huevos rancheros. Being Mexican and from the hood, he knows what those should taste like...he gave them three stars.  Tricky part: trying to eat then with plastic utensils- May the force be con usted (with you).\n\nIs this a MUST stop and try place??? Definitely not.", "author": "Silvia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "Quality at a reasonable price. Visiting town on business. Found Pancho's passing by on way to Bob's donuts a couple years ago. Dinner at Pancho's, dessert at Bob's Donuts has become a go-to combination. A burrito, chips, salsa, & a drink with a street view = satisfying.", "author": "Jim M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-10", "description": "I ate here three times and had three different things. Each time the food sucked and the service is horrible. We asked for the guacamole they forgot to give us and the guy said sorry we're too busy to deal with it. On top of that they are super slow! Never going back", "author": "Theo H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "My favorite vegetarian burrito EVER. They do fajita veggies, which take the burrito to the next level. Excellent salsa bar and low beer prices. \nLove you Pancho's!", "author": "Isabella A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "I love this little place on Polk street.  Just a little Mexican joint.  Everything is on point (I suppose I would prefer a few more salsa choices in the salsa bar, but I am quibbling)\n\nThe chips are thin and house-made, as are the corn tortillas. Get the carnitas.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Very good local Mexican restaurant with freshly made corn tortillas. We had two taco's with Carnitas and Carne Asada were both VERY fresh. Their accompanying beans and rice and their complementary chips with excellent salsas from their salsa bar are a must. Don't be fooled by some negative reviews this place is worth the trip!", "author": "Timothy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-24", "description": "Not a bad little slice of Mexico.  Steak nachos were pretty good, and the cheese quesadilla was decent (that's all our kids ordered... we had clam chowder from Swan's).  Cozy place with EXCELLENT service!  Quick, hot food!", "author": "David L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-10", "description": "Low quality. No flavor. I wish this place was good as its convenient. I won't be going back.", "author": "Jane C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "Don't EVER use your CC at this location!! Personally I will never step foot inside this location again. Yesterday I ordered a beer and fajita burrito. The cashier charged me for a water when I didn't order it, no big deal she gave me cash back for it. She kept the receipt to show her boss she had to refund me $4. My burrito when I got it was shrimp not steak. The following day I noticed 2 charges on my acct. I called my bank they did verify I was charged twice. I informed them I would be going to the restaurant and ask for cash back otherwise I would dispute the charges. \nI get to the restaurant the 2 ladies cooking completely ignored me when I walked in and saw me waiting to be assisted. 3 times I had to ask of someone would help me? Both ladies after I explained myself kept saying \"wait for the manager\" one of the ladies doubted I was there the previous night. I showed her a pic of myself and friends at the restaurant. She zoomed in all around the pic to make sure it was there location. I showed them the charges from my bank too. Finally the actual manager showed up, he told me they got a new credit card machine and I could have up to 4 charges. Really?? In what country? The conversation escalated into an argument. I had to tell him \"let's call the cops to get this resolved!\" He was rude, arrogant, kept telling me when a business gets a new credit card machine customers could have multiple charges. Who does he think he's fooling?? I finally got my money back. \nNot only will I never go back, I told him I would write a bad review on ever site possible (he said he didn't care!) but I'll never spend my money there again. The food wasn't all that good anyway!", "author": "Rosie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-16", "description": "After reading a bunch of reviews, I decided I needed to try this place out for myself.  \n\nI ordered two carnitas tacos and one borracho burrito for $18.  The carnitas inside the taco were tasty and the taco shell was more unique than your average tortilla.  I'm a fan of crunchy tacos, and these were on the softer side.   Not too much going on with the tacos unless you visit the salsa bar and load it up. The salsa bar is similar to other businesses, hot/med salsa, pico de gallo, a mix of cilantro/onions, jalapeños, or a green avocado sauce.\n\nYou'll either love or dislike the borracho burrito.  The bbq sauce inside throws a different flavor at you that might not be what you're looking for.  I personally would not get it again.  I like traditional grilled/marinaded flavors.  Also, I love normal Mexican rice.  This place seemed to go with the chipotle train and has what appears to be white rice.   \n\nOverall, the food wasn't bad.  Yet it didn't leave me excited to come back again.  And, I ate everything.  So it was very filling.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-08", "description": "Heather H was shocked and appalled to see that her favorite burrito joint got slapped with notice of closure and fined with a health hazard. \nHopefully, they will get their act together and cleanliness is the first marching orders. C'mon Panchos, don't let us down for God sake! You are the only authentic Mexican food in white nob hill/Polk gulch! don't let us down!", "author": "Jill F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "I am a Mexican from West Texas, full of Mexican restaurants. I came to San Francisco to find one of the best places I have even eaten at!!", "author": "Isela V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-07", "description": "It's a great neighborhood restaurant, good burritos and very fair prices.  I've definitely had mixed experiences here, food can be bland but the service is always friendly!\n\nDefinitely more of a pick-up and go situation because there isn't a whole ton of seating. However, this place is never too crowded so it's easy to find seating if you do choose to dine-in.", "author": "Celia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "The Borracho Burrito, really good. Very satisfying. Tortilla was very different and unique. \nThe Taquitos Dorados, very flavorful. Good and fresh ingredients.. Staff was very nice, friendly and very accommodating. The food is prepared Fresh and to order.. The place decor is authentic, I felt like I was in México.", "author": "Felix E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-19", "description": "Encaladas description specifically says it comes with 2 per order.  I repeatedly told the lady taking my order my request. Went to pay and noticed my receipt that she charged me for two orders. I asked for my money back and she refused becaus they already made it.", "author": "Philip F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "It is the best burrito ever.. no but it is darn good. I love getting the carnitas burrito. It is a good size and it comes with chips in case you need more. The salsa bar has this wonderful orange salsa that is medium spice and so good. The people there are very friendly and it is usually super quick. Pretty good place pretty good food. Pretty good all around.", "author": "Jazlyn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Handmade chips, check. What looks like handmade tortillas, real good. Salsa selection is also good. Personable and real people, check. Early hours, check. Location, double check. Authentic? better than SoCal? Who cares. It's good and I would recommend this local taqueria for sure.", "author": "Juls C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "This is a good taqueria. The customer service is very good. The place is clean. It does get crowded on the weekends at night. Pretty standard menu. It has everything a taqueria should have except for chorizo meat. Based on my previous visits I liked the Pancho's Nacho with Steak. It was well made and filling. Their Tostadas / Taco Salad was okay.  Their burritos were okay. This is the best Taqueria in the upper Polk area. I would definitely come here again if I had a craving for Tex-Mex food.", "author": "Hiroshi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "Never been sick from eating here, clean and you see them constantly picking up around the salsa bar.  Never seen roaches so not sure of those 1 star reviews.\n\nGREAT veggie options as well.  I don't why some of the patrons think that because it's a salsa bar that they can take 8oz to go.  Bad form and feel bad for the staff when people ask for a large containers to go. \n\n My go to burrito spot on polk.  Super polite and consistent.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "The food was so delicious! I got a steak and shrimp burrito and absolutely loved it. Great large size and very friendly staff. Overall great experience!", "author": "Ali R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-18", "description": "AWFUL! I ordered delivery from this place and my whole order was messed up. They forgot my drinks and my sides that my meal came with!! Their phone was busy every time I tried to call to remedy the situation.  HOW CONVENIENT! \n\nThe food was SO BLAND and when you order takeout they don't give you any salsa options. The salsa that comes with the chips and salsa is chunky pico de gallo. Picture big chunks of tomatoes and raw onions. SO MEDIOCRE. We couldn't even eat the chips and salsa properly because the salsa was so chunky and heavy and the chips were so thin they kept breaking. We had to spoon it over each chip. \n\nNEVER EVER AGAIN.", "author": "Jane R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "This place is so-so. The only reason why I gave it four stars is because of their homemade tortillas, and their guacamole. Everything else is a solid three, but I keep coming back for their tortillas and because I think their better than other options nearby for Mexican food. Also their mole and horchata are pretty good. And don't order to-go, it's just a cold sloppy mess and then there's no point in soft, warm fresh tortillas.", "author": "Gina B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-17", "description": "ROACHES they're brave enough to wander the floors, walls and signs mid afternoon too.\n\nI saw at least a dozen in the half hour I was there...", "author": "William B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-24", "description": "I eat here a lot because it's less than a block from my place. The quality is average -- get the quesadilla if you want a small bite and the burrito is good but nothing special. Their meat can be a little on the dry side. What's fun though is the red hot sauce. It's HOT. Typically I stock up on 3-4 hot sauce containers at the typical Mexican joint but here I only take 1 back. Yes, it's that hot and that good.", "author": "Young Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "The food was very good, authentic Mexican. Worth the little walk, a bit over priced I think but the portions are hearty. We would be back, maybe to split a meal considering the portion and price. Staff is nice and serves quickly.", "author": "Mariah P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-01", "description": "Taco Tuesday Review #1 needs to go to my neighborhood joint which I have frequented many many times.  Pancho's Salsa Bar is a fine place to get some Mexican food, particularly to-go, if you are living on this stretch of Polk Gulch.  It is also exceedingly unspectacular - which you can evaluate in different ways.  Unspectacular isn't necessarily bad.  It also means that this is not a place that you go out of your way to visit.  I have visited many times, though, because it is not bad at all and has a few nice features going in it's favor.\n\nSo, Pancho's is a chain but I don't believe that it is a big chain.  This location is on Polk Street as it transitioned over to the truly Nob Hill and then Russian Hill end of The City.  Pancho's is a pretty casual place with a nice vibe.  The food it pretty run of the mill, more on the end of a fast casual with a few entrees.  I think the menu is pretty limited relative to a more traditional Mexican place.  They have Burritos, and the options are listed out based on meat choices.  Same with Tacos.  Meat choices are Steak, Chicken, Carnitas and Shrimp.  So, not the big range.  They also offer about a half dozen entrees, such as Rolled Tacos, Tostadas (really should be called a Taco Salad), Tortas, Soup, Enchiladas and three combo platters.  All in all, not a ton of options.  You can't add a taco on the side.  The prices are in the $8/9 range for the Burritos and the $11 range for the entrees with meat.  \n\nI find the food to be a little bland and uninteresting.  Not bad, though.  I enjoy getting the Tostada (Taco Salad) even though I'd prefer less filler.  Rice in a Taco Salad?  The Burritos are just alright, however the Boracho Burrito with the sauce included it pretty tasty.  One of the Pancho's signatures is the homemade tortillas - I think that the Tacos are very bland, even with Guacamole.  You can load up at the Salsa Bar and flavor up your food if you want.  They have a nice little Salsa Bar.  One thing I will say is that I love that they always offer a $2 Tecate while you wait for your take out.  And again, the environment is nice enough.  I'll also add, I do have a few friends who like this place more than me - I'm not quite so crazy about it.  To be fair, you won't get awful food here, they have decent standards.  Just, not super interesting.  \n\nAll in all, I would not seek out the food, but I am happy to get it to-go since I live a few blocks away and this is the nice end of Polk Street.  But, I'd prefer the folks at El Super Burrito a few blocks closer to the Loin for food that is much more down home and flavorful.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-11", "description": "This little hole in the wall is awesome! Authentic, flavorful mexican food at a reasonable price. I came in and had the Huevos Rancheros. They were delicious! Crispy corn tortillas smothered in red sauce with two fried eggs and rice and beans. Washed it down with an ice cold Lagumitas IPA. Fresh salsa bar, very clean dining room with lots of character. Will def be back!", "author": "Devon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Excellent service excellent food tasty and delicious i recomend this place to everyone friends family tourists", "author": "Roberto R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "A very unassuming place with lots of homemade taste.\n\nPancho's may be small in space but it's big in flavor. The staff is friendly and very welcoming. Their options are varied and well described with options ranging in healthy to I'm just hungry. The latter was my approach. \n\nAfter placing my order, I was given a good portion of chips and made my own salsa selection at their self-serve salsa bar. Their pico de gallo and medium salsa are both colorful and full of flavor. Not overbearing and too hot. I was served my Sopa de Pollo which once again was generously served with shredded chicken and an assortment of vegetables. The meat was cooked right and seemed very fresh. The flavor of the soup was good and not on the salty side, which can indicate that it has been sitting in the pot foe a while\n The vegetables and potatoes were just right. The Steak and Shrimp burrito in a wheat tortilla was huge! Again the flavors of the black beans and its condiments welcomed you to a  Mexo-Caribbean experience. The shrimps and steak were balanced throughout the burrito and even though there was more beans than shrimp or steak, the flavors never waivered. All in all, it was a great meal and the place is clean and lacking that usual kitchen or bathroom smell that can ruin a meal.  Since I have been here many locals, have been picking up their orders continuously. \nGreat service, good food and great place. If my abuelita was alive, I would bring her here. \nBuen provecho.", "author": "Charly D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-04", "description": "Just moved to area. Got this place first time. I cannot believe how bland this was. They use the same low quality steak in their taco as what they call their fajita. I will not be back here. Food was low  quality and no flavor", "author": "Matt R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "I eat here 3-5 times a week. Steak and prawn or chicken burrito is what I always get and at this point, am pretty dependent on them. Keep up the good work panchos", "author": "Sean D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-11", "description": "I feel so disappointed after having to -go lunch from that place ! My order was chicken quesadilla and shrimp tacos . First at all their stuff is overpriced - small chicken quesadilla was around 9 $which too much for such size ! And all the filling was proportioned very unequally inside ! But the taste was not bad , more good than bad ! The complete catastrophe were Tacos -  too much fried and so fat ! But the fact which pissed me off then for 10 dollars for 2 pieces of tacos I got  small cheap shitty  baby shrimps ! I got used eating tacos with bigger sized shrimps ! So , I'm not sure about other stuff they have , and obviously won't ever be , but 20 doll for such a disgusting lunch   Made me feel very unpleasant ! Costumer service as usual -nothing to complain except but regular Latino poker faces .", "author": "Vadzim S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-20", "description": "My order is never correct! I've ordered food on like 4 separate occasions and it's never right! I recommend eating at the restaurant. In all honesty the food is great, they have hand made tortillas! My review is based on service, not food.", "author": "Vince M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "Pancho's has been around a long time and is my only viable neighborhood option for my burrito fix. It certainly looks the part - I love all the vintage signs. There's even an autographed picture of Jose Iglesias next to my favorite table. Service is generally friendly (with rare exceptions) and prompt.\n\nFood-wise, they do certain things very well here. I like their carnitas burritos and their fish tacos. The tacos are served on uniquely thick handmade soft tortillas, which I don't get often enough (because I'm so obsessed with burritos). Their chips are also great - light and crispy and not too oily. I like the salsa. Sometimes I wish they had more varieties, but the ones they make are good.\n\nI have enjoyed their breakfast dishes, but it's important to read and comprehend the ingredients carefully before ordering. Otherwise you might end up with a huge plate of eggs scrambled with lots of sliced jalapeños (meaning that, even if it's too spicy, picking out the peppers doesn't make it much less spicy at all). I like spicy food but that one was a little beyond me. (I still ate the whole thing, which says something, though probably more about me than the restaurant.) Again, I urge you to read the menu at the counter carefully before ordering breakfast. The breakfast burrito is a good choice.\n\nI actually avoided this place for a long time because the first thing I had there, their chicken burrito, didn't taste like much. (I still don't recommend it.) My only general complaint is that some of the meats just don't have a lot of flavor. I almost never order carne asada so I can't recall if it's good. But the carnitas and the fish are reliably tasty. The food is definitely consistent. There are also a lot of menu items I simply haven't tried due to my aforementioned burrito obsession. Overall, it's a good value and a decent burrito just a few blocks from home, so I'll keep coming back.", "author": "Jason G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "Great place to get Mexican food on Polk! The chips are super thin and amazing. Every time I come here, I leave happy :)", "author": "Lauren N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-06", "description": "I would have given them 2 stars if they would have remembered to offer me chips. From the outside it looked inviting so decided to go inside. \nLet's get straight to the point. Their food tastes like air. If you can imagine what the color white mite taste like, its this. The rice quite literally tastes like soft air. The enchiladas also shared the same memorable taste of air. The steak tacos weren't too bad though. And the beans topped with fresh cheese leave a nice after taste of air. And the napkins were far away too.", "author": "Daneia R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-16", "description": "Yo this place used to be semi decent but this new working at the cash register ruined my whole prefer and my lunch. After driving over from Hayes valley traffic to get a decent burrito they give me the wrong order and tried to sell me some watermelon juice the new is pretty much weird af he needs to work somewhere else not a taqueria the old guy was way cooler I mean if could give zero starts this is it!!", "author": "Jen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "Awesome steak and shrimp burrito, cool BBQ style burrito. Cool vibe inside, nice salsa bar", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-29", "description": "If you don't mind a 20 minutes wait for your burrito this is the place for you.\n\nIt kinda defeats the purpose of getting a burrito.", "author": "Soheil Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-12", "description": "The salsa bar offers three to four options and none are all that spicy. Even the \"hot\" salsa is pretty mild but it does have a nice smoky chipotle flavor. The handmade corn tortillas are great as is the chicken used for the chicken tacos. The tacos come with a big dallop of guacamole (score I love guacamole). The tacos were great. The rice and beans were just ok. You get salsa and chips with your order and you definitely don't walk away from your meal with even a little room in your tum left. I have mixed feelings about this place. I might give it another try.", "author": "Lyndsay M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-07", "description": "I used to really like Panchos's - great neighborhood Mexican restaurant with tasty home cooking. I was a regular but never again after today. I placed an order in the phone, took a Lyft to pick up the food. I paid cash for a $50 order and tipped the gentleman generously! I asked him to make sure that all the items on my order were in the bag. I took a Lyft back home and found a missing item.\n\nI called Pancho's and the guy who answered the phone took absolutely no responsibility. He stated that he couldn't help me as he just clocked in and wasn't the guy that took my order or gave it to me. He said that if I came back to the restaurant, he would get me the missing item. Wow - incredible customer service!!\n\nYou just lost a regular!", "author": "Viv A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "The service was great and the food was originally crafted in house. The food itself tasted excellent and authentic and it was a great atmosphere for the flavor.", "author": "Matt K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-13", "description": "This was a cool place to come to on a Sunday night. My food was delicious! I highly recommend the chicken and steak fajitas. They were the bomb.com. I wish they would open a location in my city. I will definitely be making a stop back here the next time I am in San Francisco.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "UPDATE: Pancho's customer service is much improved, so upping my rating.\n\nDear Panchos,\n\nI like your food, but will no longer be patronizing your restaurant, since your telephone customer service is so lousy. \n\nEvery time - and I do mean every time - I call to place a takeout order, the conversation goes exactly the same way:\n\nYou: Hi, Pancho's on Polk St, how can I help you?\nMe: Hi, I'd like to place an order to go: a chicken burracho burrito, no chips. \nYou: Can you hold on please? \n(few minutes later after dealing with customers in line)\nYou (same person): Hi, Pancho's on Polk St, how can I help you?\n\nPlease. Please. If you're not in any way ready to help me when you answer the phone, simply say \"Can you hold please?\" and come back when you are. Every other restaurant in the city has this down, so I'm sure you can do it too.   \n\nI'm going to try to again in a few months, and will update this review with my results.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-26", "description": "Busy as always .. But it's worth the wait!!!\nI had a vegan burrito! They have fresh ingredients and you get to see how they prepare your comida!!", "author": "Enrique R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-23", "description": "If you think I'm going to say this is one of those hole in the wall Mexican restaurants that has awesome food, then you would be right!\n\nIt seems like enough people know about it that \"hole in the wall\" might not be the proper term anymore, but it is small in terms of size and only having one person working out front, has that authentic feel rather than Americanized Chipotle, and is pretty easy to miss - luckily, my lack of 20/20 vision doesn't hamper my good eye for yummy Mexican food.\n\nI initially was sucked in when I saw the bar - the salsa bar! I love tomatoes and salsa. The pico de gallo here was amazingly fresh and perfectly spiced. Even better, you can just get a whole pint to go for $3.25! Pico is usually expensive so what a deal. There were verde and hot salsas. I would rate all highly on the salsa scale (on deliciousness, not spiciness). Although, the hot salsa did have a kick! I didn't get the guac, but it looked super fresh.\n\nOfferings: Typical authentic Mexican fare...but wait! They have vegetarian burrito...filled with not oily disgusting veggies, but steamed veggies. And my favorite veggie of all - squash. So burritos, tacos, salads, tortilla soup...just imagine typical Mexican fare and you've basically imagined the menu.\n\n\nPrices: Prices here are super reasonable. Portions are large. \n\nService: As with your usual hole in the wall, lots of people were in line and only two people were in the kitchen. Be prepared to wait a little to order and for your food. \n\nSo Pancho's (Salsa Bar and Grill). Not only do you deliver on the \"salsa bar\" promise, but the taste as well. (insert upside down Spanish exclamation mark here) Ole!", "author": "Libby J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-24", "description": "Mediocre food (and overpriced guacamole). Unfortunately it's one of the only Mexican food places in the area, as opposed to all the awesome spots in the Mission. They do have a salsa bar you can use, but overall don't enjoy going here very much.", "author": "Roxie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-14", "description": "The atmosphere was good but the meat was really dey", "author": "Grace N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-23", "description": "I wouldn't recommend at all. They have no good customer service at all. Very serious all the time. I ordered a torta and it was supper soggy. My friends plate was super hot yet the food wasn't. Obviously, microwaved. Will not recommend, nor ever go again.", "author": "Griselda M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-21", "description": "Decent burrito good salsa bar only a 3 STar review due to my SOl Beer being $6!!??? Shouldn't complain to much since norm at a bar but this isnt a bar..", "author": "Jay A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "Best Mexican chicken soup I've had at a restaurant. Very authentic and healthy/homemade. Really good salsa selection too. Staff is friendly and atmosphere is pretty chill. Great little restaurant", "author": "Cassandra C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "I eat here about once a month when I am in the area for work.  It's inexpensive, reasonably fast, seems clean and has a good salsa bar.  The food is definitely on the bland side.  While it wouldn't survive in the Mission, on the upper \"nicer\" side of Polk Street, it is a good value and very dependable.  The very thin chips are tasty and horchata is good.  Then you can walk down a few doors and get a few Bob's doughnuts to take home.", "author": "S. D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-25", "description": "OK - I like the food and the staff they are nice people...  They are a bit tight with the salsa (only have 1/4 oz plastic cups for it) OK maybe an ounce just to be fair...\n\nI'd give them more stars except they charge tooooo much for a soda with your meal.\n\nI recently got a sausage burrito and was shocked when I found I paid almost $3 for a large soda - hey gang this is way too much.  This place is fine for a neighborhood taco joint but it ain't Gary Danko so they should not be charging five star prices for a large glass of soda.\n\nIf you aren't on a hipster salary or just don't want to waste your money ask for a glass of tap water instead and get several of those plastic salsa cups so you get a teaspoon worth of it...", "author": "Dalt W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "Great happy hour beer specials! Order your burrito with less rice and beans and double meat. It's pricier but worth it.\nThe Carnitas and Asada Rock.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-30", "description": "BEWARE!!  Tons of roaches!  Disgusting.  The guy behind the counter super rude.  Gives me crap for taking more than the apparent approved tiny cups of salsa.  A hole, I get a burrito without meat, although you charge me for it.  Think maybe that's worth a couple tablespoons of salsa?  Spend nearly $20 on a bean/cheese burrito and some chips (which they charge EXTRA for) and you can't look the other way for a little extra salsa?  Salsa Bar (don't take more than a tablespoon or two or we threaten to charge you) and Grill (free roaches). The place never has any customers inside.  Maybe it's because the place is gross and the counter minimum wage guy thinks he can treat customers like crap.  Or the fact it's in a neighborhood with nothing but street bums.  My car got broken into and the cops told me it's notorious for that. BTW popular hospital nearby that USED to go here will  be boycotting me as well.  Can't wait til Trump builds the wall.", "author": "Lynne P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-25", "description": "Service is slow. I have an hour lunch and my order took 40 minutes for just a burrito and fajitas. One customer walked out angry with his order due to him waiting so long. They didn't even offer chips for us to munch on while waiting (which most taquerias give you in the meantime). The cashier seems confused with the orders as well. The cashier and cooks could use better communication and flow. I can't even enjoy my meal anymore because I only have 10 mins to eat. \n\nDon't make a hungry person angry!", "author": "Maellene D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "Authentic Mexican food served here! \n\nI got the combination plate of two steak tacos. Freshly homemade tortillas with NO fat in my steak pieces and tasty guacamole... Yum! It was delicious! \n\nRecommending to my SF goers :)", "author": "Marie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "Was walking around town with a few friends that were from out of town. This place caught our eye and decided to check it out. It was one of those restaurants where you walk up and place your order and wait for your number to be called. Seating was decent and the decor was pretty neat to take a gander at. It did take a bit longer for my order to come out while everyone ordered theirs at the same time (paid all together pretty much). Well, got to say that the wait was worth it. Had the bowl of Sopa De Pollo. Veggies were perfectly cooked where it melts in your mouth. Potatoes did the same and the rice at the bottom weren't overcooked (just right). Prices were pretty average (more or less a tad bit more since I live up in North Bay Area so totally understand the price difference between a bigger city and one that's a bit smaller), but worth it for some authentic Mexican dishes. Will most definitely come back whenever I'm back in the area.", "author": "Steve B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-25", "description": "Worst breakfast burrito on earth and it cost $7.  Picture attached. \n\nIt was mostly rice, one disgusting sausage that was fried and smashed up, and a tiny bit of scrambled egg. The sausage was not a breakfast sausage but a spicy polish sauasage. No cheese or sour cream or avocado. To dry to be able to eat. It was also more smushed together than wrapped. \n\nAlso it took 20 minutes to make and I was the one one in the restaurant. When I asked how much longer i was told that it takes 15 minutes because they have to make it from scratch. I don't think it takes 15 minutes to fry an egg. He was really rude to me in how he told me. \n\nNot worth buying at any price.", "author": "reza n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-04", "description": "Food is so good but only three stars cuz is no enough people working there, in busy time you need to wait a lot!! I know they want to save money but they sacrifices the quality of services!! \nI was working in restaurants and for experience I know this issue and is really bad overwhelme the persons working, never the services in your place is gonna be good!! That problem is not talking good about managers and owners!!", "author": "Arturo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "My homegirl and I (mainly just me actually) were hankerin for some Mexican food. She yelped a bunch of places nearby and came to the conclusion on panchos. I didn't really like the name of it personally, sounded to me like one of those taquerias down south that's made by a bunch of white dudes who would prefer French fries in their burritos. But we walked in and found it was the real deal, with some funny decorations on the wall that all fit the atmosphere.\n\nI pretty much always order enchilada plates wherever I go for Mexican food. But something caught my eye this time. Hand made tamales. It didn't matter what else I read, I knew my decision was already made. My homegirl got the fish tacos, which also had handmade tortillas. Both plates were delicious, but the tamales were the real fucking deal. So moist and delicious pork inside. And it came with this green salsa on the side of the plate that is simply fantastic. Tremendous plates.\n\nThe salsa bar is pretty good, I was expecting more for it being made multiple times daily. Pico was good, the green salsa was a bit sub par, kinda watery but I'm gonna chalk it up to being like 10pm when we walked in. The red salsa had to have been one of the hottest salsas I've tried at a Mexican restaurant, most places don't even offer shit this spicy.", "author": "Jim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "You know what? Pancho's really grew on me. To be honest, I didn't like it all that much the first time but subsequent return visits have made me appreciate it more and more. \n\nSo the first experience was mediocre... just something inauthentic feeling about shredded processed cheese tossed on top of a taco. (http://www.yelp.com/biz_photos/7qSq-m4LRu3PAfroD-LKJg?select=6Y4lSsH-43K89Ub5JCGxEQ#MclQEhVMXorlnld2PiozbA) With that said, the carnitas are really moist and flavorful here though. That's my go-to meat of choice here. I often get the carnitas in a small burrito which is large enough for me plus it's a perfect beer mop for an afternoon of drinks on Polk. The fried fish tacos here are pretty yummy too. Look out for drink specials on the board especially early in the week. I've had $2 Anchors here before. \n\nService is friendly and they get the food out to you quick. A quick stop at the salsa bar for some creamy salsa verde, fresh tomato salsa, and you are good to go. While the first meeting was mediocre, I'm glad to say Pancho's has grown to become a favorite pre/post drink tortilla fix on Polk for me.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "I've had the quesadillas, burritos, steak and shrimp tacos. The steak tacos are by far my favorite - the rest are okay. The tortilla is what really makes the tacos taste great (along with some salsa from the salsa bar).", "author": "Jerrin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-01", "description": "I called and asked If I could place an order for delivery and was immediately hung up. No worries, there are plenty of other restaurants around that deliver better Mexican food.", "author": "Allan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-29", "description": "Usually enjoy panchos, nice people, good ingredients. \n\nHowever today I watched them bang utensils on the trash and immediately use them to spoon food for customers not just once but multiple times, it was to empty the stuff stuck to the utensil.  They were also eating and dipping something while cooking, without gloves and without washing between putting things in their mouths.  It's not horrible but it doesn't make me feel good that the rest of the kitchen processes are sanitary.\n\nHappy to adjust my rating if management put a new policy in place.", "author": "Jason A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "Food \nChicken burrito with all the fixings - yum purdy good\n\nService \nYay accepts card. Order pickup at counter. Nice people \n\nAtmosphere \nFestively Mexican", "author": "Angela L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-07", "description": "Service was bad,they forgot my husban drink and my kids quesadilla,and they never apologies for that", "author": "Alejandra H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-13", "description": "Let me make it easy for you. Forget the lengthy reviews. \n\nYou've got a sweet tooth with a love of spice. Get the Borracho. \n\nIf you're fancy and don't like spice and like feeling fancy with a plastic knife and dork. Get the green chili enchiladas. \n\nIf you don't like Mexican food. GTFO. \n\nAsk for free chips.", "author": "Joe N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-20", "description": "The four stars come half from pretty good food, and half from excellent price. Any delicious food under $8 in this city is a steal.\n\nThe fajitas are fresh and flavorful. The corn tortillas taste just like the ones from trader joes, if you know what I'm talking about.\n\nThe buracho burrito had a sweet and spicy sauce that was a pleasant surprise with the first bite.", "author": "Ashley E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "Panchos was very delicious! There mahi-mahi fish tacos where amazing! My boyfriend had the mahi mahi burrito and it was Devine. The customer service was great! Would definitely come back and try there shrimp tacos!", "author": "Monica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-27", "description": "I ordered a chicken quesadilla for takeout here and was super happy with everything. The food was ready quickly and the price was perfect. Also super good tortilla chips. Will def be back :)", "author": "Jason S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-28", "description": "I don't think 4 salsa's constitute a \"salsa bar\"\nI live close by so I was really hoping this place would be good. But-\nBad service with mediocre food. Had the \"steak burrito\" although it had very little steak (3 pieces) It did have a lot of retried beans. Service took too long for lunch. And the cook was walking around like she had nothing to do, and there where 8 tickets in the window! It was a busy lunch and both cooks took time to get themselves a soda when they could see customers waiting for their orders. No love and it shows in their food. \nThe only good thing I can say is the chips were good. \nWish I would had read the reviews first. Next time it's Nicks Tacos or the Mission.", "author": "Leland L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-10", "description": "I went to this restaurant with my girlfriend. She ordered the veggie atomic burrito, neither one of us eat meat. While she was eating her vegetarian burrito she found a piece of meat in it. I decided I didn't want to make a big deal about it because it was just one piece, but I thought it would be a good thing to just let the staff know so they could be more conscious. I went to the counter with the piece of meat and politely told the woman behind the register that we found a piece of meat and just wanted to let them know so the kitchen could be more careful. A few minutes later as I was throwing out my trash I heard her speaking to the two cooks in Spanish (I'm fluent in Spanish) and she is basically talking shit and making fun of the fact that I told her about the piece of meet and then all three of them turn around and laugh. I know people in the food industry have to deal with customers complaining and annoying in general but in this case when it is a dietary restriction and I was polite about it, I find it very uncalled for that the staff acted the way they did. I will not be returning.", "author": "Hannah O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-21", "description": "Pancho's is a great spot for some quick and relatively cheap eats in Nob Hill. This place is super clean, but not fancy. The decor is kitschy and fun. They have an assortment of Mexican beers and a couple of single serving bottles of wine in the fridge. The tacos and fajitas are basically the same, but fajitas portion is smaller and comes with guacamole. Order the Tacos if you are looking at both. Tortillas are made in house and are delicious!\n\nThe staff spoke just enough English to understand our orders and were very accommodating. \n\nDon't forget to ask for free chips with your order. The salsa bar is rockin.", "author": "Joshua I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "Had a great experience eating here. The food was fresh, the steak in my tacos wasn't too salty. The salsa bar is frequently replenished, clean and bomb. The décor is kitschy but great. The whole restaurant is very clean.", "author": "Molly C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-29", "description": "Came here on two separate occasions. First time I ordered a chicken burrito. The flavors just weren't there for me and the ingredients just didn't taste fresh. The second time I ordered a combination plate which included two tacos (1 chicken/1steak) along with beans and rice. All I really enjoyed on the plate were the beans and rice. The tacos were each on an extremely thick soft tortilla and again, my food didn't taste fresh. On both occasions the meat was extremely dry as if it was cooked hours before. 2 times here is enough for me.", "author": "Jonathan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-29", "description": "I like Pancho's. Delicious tacos...tortillas made from fresh corn... mmm\n\nPrices are fair, convenient choices (tacos, burritos, etc) but I do wonder the freshness. The fish tacos and meat tacos aren't nearly as mouth-watering as some of the other gems around the city.\n\nHowever, for Polk, this is the spot!", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-22", "description": "They need to change the hours posted outside their door. I live in the neighborhood and walk by all the time yet have never been. On Friday night after having a few drinks I figured a burrito would be the perfect treat. I was pretty hungry and I remembered that Panchos stayed open till 12:00, so when I arrived at 11:00 I was not a happy camper when they said they were closed. Change the hours posted so you don't make more people hangry.", "author": "Claire B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-21", "description": "Burrito came out with a brittle tortilla, burrito that was supposed have guacamole turns out to have no guac. Taste wise and presentation not worth the wait.", "author": "Garrick L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-20", "description": "This place used to be a go-to Mexican restaurant in the neighborhood (with no contenders). I've been living in the neighborhood for 20 yrs and I must say this restaurant went all down hill. I'd rather go to chipotle! \nI ordered the steak and shrimp burrito. The burrito lacked flavor and moisture. The burrito was dry and not really fresh. I was unsatisfied with my burrito. It's been a full day and my stomach is still traumatized by the burrito.THIS PLACE GAVE ME THE RUNS : / DO NOT GO!!!", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-25", "description": "food: good\nPlace: lots of Mexican decoration\nRecommendation: get a quick bite and keep partying", "author": "Marcelo D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "OMG! I just had the best fish tacos in my whole LIFE!! Safe to say I can die a happy man now!! I totally recommend  this place if you like authentic Mexican.", "author": "Ponchin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-05", "description": "Been going here for over 10 years and it's consistently been a good semi fast food Mexican place my favorite are the cheese enchiladas with rice and beans the staff changes times but recently I've had the pleasure of being served by Malinda she was incredible!  \n she manage to keep the entire restaurant coverd when I was there", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Legit mexican food in a city that lost its culture.. My first time trying this place suggested by a m8. I got the steak and shrimp burrito and might i add i was not let down. Decent sized burrito and fairly priced which is seldom in sf. Not the most flavor ive experienced in a burrito but not bland either. If im in the area i will be going back again and likely trying a taco of each sort. I recommend that for any mexican establishment to know what their strong points are. One thing that i disliked was the layout of the burrito. Steak and shrimp however i didnt get both in each bite. It was literally segregated like a mississippi high school in the 60s. Top half shrimp then bottom half steak to where i questioned if i ordered steak in my burrito until i reached the halfway point. I wont deduct a point just a tip they should consider", "author": "Eltroy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-13", "description": "I've never been disappointed coming here.  Their salads are great, their meat is flavorful and juicy and did I mention they make their own tortillas?  Oh and that they serve breakfast all day?  Mmmmm breakfast for lunch......", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-15", "description": "What a great find for filling, yummy, inexpensive burritos!\n\nI managed to feed nearly 60 people on a production crew with the awesome burritos and tortilla chips from this place.\n\nAbel took my order and make sure everything was prepared correctly and labeled perfectly. \n\nTheir chips & salsa are amazing!\n\nEveryone got plenty to eat and left the craft service table happy and ready for some more work.  \n\nWe will be back.", "author": "Wendy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-28", "description": "I like that Pancho's offers some different burritos, like one with fried plantains, as well as having pupusas.  Burrito was 7/10 though, and salsa leaves a bit to be desired.  Wait was longer than expected for to go burrito.", "author": "Ben S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-30", "description": "Been going here for years. Just our go-to for good Mexican food. I always get the carnitas tacos and my husband gets the burrito, usually whatever is their special of the day.", "author": "Jillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "Loved the homemade tortillas on the tacos. Hot salsa is hot! But the salsas are kind of bland. I loved the atmosphere and the staff was very friendly.", "author": "Michaela W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-05", "description": "I used to love this place. But they've gotten cheaper and cheaper. The menu says the magi Mahi Mahi tacos come with avocado salsa. When they said they don't have avocado salsa, I asked for sliced avocado. Then they charged me. I've also recently had to argue to get chips. And it's FREEZING in there--and they employees just don't care, they keep opening that huge window above the door that acts as a wind tunnel. They also serve store bought packaged shredded cheese and cut corners with serving microscopic amounts of guacamole on their plates. So sad that after 15 years of being a good and loyal customer, I won't be going back.", "author": "matthew d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-07", "description": "I'm stunned such a mediocre Mexican restaurant can exist in San Francisco. This reminds me of the Mexican food I've had in rural Nevada on road trips. I ordered a super carnitas burrito (my standard) got big slices of unripe tomatoes, iceberg lettuce, cheddar cheese, unseasoned carnitas, poorly wrapped burrito. Chips and salsa were okay? Idk \n\nI guess all the fratty tech bros who live in Polk Gulch/Russian Hill think this spot is great but holy shit I haven't had such a bad burrito in awhile.", "author": "Max J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-14", "description": "Meat in the burrito was super dry. Not too many alternatives for Mexican food in this neighborhood. It'll get the job done if that's what you're craving and don't want to go far.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-19", "description": "20 minutes for a steak burrito that takes 5 minutes every where else. The couple in front of me also looked really annoyed that their order was taking forever. Wasn't even crowded, just those 2 orders and mine.", "author": "Tinou B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "Hidden gem. You don't need to go to the Mission for great Mexican food, it's right here!", "author": "Joseph A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "If you're in the mood for super casual Mexican this is a solid choice. They have a great salsa bar and the prices are super reasonable. Always order the beans and rice with your entree. It's really tasty.", "author": "Yasi N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-16", "description": "Super unfriendly counter person\nDisgusting burrito..barely any meat..totally flavorless and unripe tomatoes and avacado....I don't know why I give this place my money....continuously bad!", "author": "Nicholas F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-21", "description": "I really, really like Pancho's. And I have for many, many years. So this review is very, very overdue.\n\nPretty standard menu - and perfect sized burritos. Not giant bricks you'll regret eating an hour later yet also not small by any means. I love that they offer spinach or whole wheat flour tortillas - I'm all about the healthy and Pancho's makes it easy to enjoy Mexican food on the healthier side. Yummy pork, steak, chicken, or mahi-mahi for protein filling plus all the other fun stuff like guac, pico de gallo, etc.\n\nAlways service with a smile. Always. Mucho gracias mi amigos de Pancho's.", "author": "Meredith R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-12", "description": "This place gets a bad rap but they cook up decent Mexican cuisine. Whether you're looking for good carnitas tacos or a chicken mole plate to go, this spot has you covered. The green salsa is amazing, and the tortillas are homemade. That's about all you need to know.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-17", "description": "DO NOT EAT HERE. I'm a local here in the Russian Hill area and my housemates introduced me to Pancho's. We'd come here on Saturdays to eat great Mexican with a pitcher of beer. But, no more. A restaurant with a vengeful staff is not a place you want to eat.\n\nI ordered my usual enchiladas, and I guess the girl heard me wrong(?). When my plate arrived, it was tamales. She insisted I ordered tamales. I apologized and said that no, I ordered enchiladas. I even went up to the front desk, said I'm sorry again and offered to pay the price difference, which I did. I gave them a tip. Based on the looks I got from the staff in the kitchen, they looked upset. She asked me if I wanted green sauce. I corrected her and said, I'd like red. She said green again. I corrected her again. She said the meal would be ready in 10 mins.\n\nWhen the food arrived, it was covered in green sauce. Really? I figured I'd not make more issues and just eat it. Then I was shocked to find that the entire plate was covered in really, really hot sauce. Seriously? I've eaten here plenty of times and they never put hot sauce on everything. They want me to never eat here again, they made that message clear. And I'll be sure no one I know ever does either. Go to Taqueria Z on Columbus.", "author": "A. G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-31", "description": "I have eaten here a few times already but most recently this week and I can't wait to go back. Ordered the chicken enchiladas and they were tasty/filling -- entree includes rice & black beans. Also got a free side of chips and all the salsa you want.\n\nThe hot salsa is uncomfortably hot so I couldn't handle more than my first bite without blowing out my taste buds. \n\nWill eat here again (and again). My new go-to place for chicken enchiladas (my fave) although want to try other things like their steak fajitas.", "author": "D L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-10", "description": "Big Price...Small Burrito...\nfor what i paid i would expect twice what i got.\n\nthis place would do if i absolutely had to but i wouldn't go out of my way!", "author": "Ripley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "Chicken and pork tamales are good - they don't skimp on the filling. Their chicken and steak burritos are good too. Very fresh ingredients, good quality meat with few fat pieces. Burritos are large and very filling. Can never finish a whole burrito, so only eat half for lunch and save the other half for dinner.", "author": "Elaine L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-29", "description": "I got the shrimp atomic burrito. Not the most flavorful burrito in fact bland may be the best describer but it was huge & nice on the wallet. I guess if you're a size queen or like quantity over quality this joint is for you. \n\nSalsa bar ehhh not enough spice, even the jalapeños were bland. \n\nService was courteous and efficient. The cashier brought over some extra chips for us, that was nice. \n\nDoubt I'll be back.", "author": "Jade W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-18", "description": "I don't know how these guys do it, but they make the best damn bean & cheese burrito I have ever had...next to El Indio in San Diego. They may seem a little confused at first (for some reason ordering burrito without rice is weird in SF. In socal, it's the opposite. Get the filler out of my burrito!), but stand your ground!\n\nThey would have gotten 5 stars, but I must mention that I ordered a shrimp quesadilla and it was rather disappointing. There was a decent amount of shrimp, but it was really lacking in the cheese department...making it a rather sorry quesadilla. And shrimp ain't cheap to order!\n\nWhile I won't be ordering that again, they've got me hooked on the ol B & C burritos, and they have a super cheap ($10-$12, I recall?) beer pitcher & jalapeno poppers special I would really like to try.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "Love that veggie burrito it's delicious!\nPlus they're registered in my airline program so I get miles everytime I go, win!", "author": "Ajay T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-27", "description": "I go to this Mexican place for a while now, because the food is really good and the services is fast. I'm used to go at night, but today I decided to have lunch there for the first time. \nWhat a horrible experience. The place was packed and the guy that works there was really rude with me in front of everyone. \nI wanted to get the Combination #3 that comes with cheese quesadilla, a small burrito and guacamole. I asked him what comes inside the cheese quesadilla because every Mexican restaurant does its dishes in a different way. So instead of answering my simple question, he replied with \"what you just said? What is the kind of quesadilla you just said?\". And I asked him again \"what comes inside of the cheese quesadilla?\". And for my surprise he relied \"you've just said cheese, right? What do you think that comes inside of it?\" \nWHAT? Was that real? So I told him I DO know what cheese is and that I just wanted to know if the quesadilla comes with anything else inside, specially because I am sensitive to certain foods. And after I said that he completed with: \"do you see anything else written there? So NO\" \nThat was the meanest thing that have ever happened to me on a restaurant.\nSo I yelled at him saying he was REALLY RUDE and left the place. I will never come back to that place again. They just lost a customer that goes there at least once a week!", "author": "Fernanda D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-26", "description": "Situation:\nBurrito to go on a Friday evening\n\nThe Good\n- The restaurant itself was spacious\n\nThe Bad\n- The Chicken Burrito was very bland.  They must steam their tortilla's like Chipotle, because it sure wasn't right.", "author": "Dipesh G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-06", "description": "As often as I've walked past this place it recently dawned on me that I had never stopped in for a bite.  Pancho's is located just a few storefronts from Bob's Donut, and if you follow my reviews you know that I go to Bob's religiously.  I was in the neighborhood for yet another donut craving (now it's the jelly ones!) so I figured why go home and cook?  I decided to grab a donut or two anyways for dessert then headed over to Pancho's for dinner.\n\nThe interior inside this restaurant is very festive with all sorts of trinkets hanging on its walls (http://www.yelp.com/biz_photos/7qSq-m4LRu3PAfroD-LKJg?select=NQXFjOyDIAczDC8jOBUSDA).  Let's face it, if you go inside and you're feeling really bored studying these walls, looking at the trinkets and reading all the unique signs will alleviate any symptoms of boredom.  At least that was the case for me.\n\nYou order at the counter and your food is brought to you.  That was my case.  I noticed later with other patrons that their number was called and they had to go to the counter to get their food.  Either method works for me.  If there's food waiting to be eaten I'll get to it one way or another.\n\nI ordered the chicken enchiladas with the mild red sauce.  I had eaten a chicken burrito with spicy green sauce from another restaurant earlier that day and the fiery green sauce was still wreaking havoc in the background.  Pancho's mild red sauce is tasty and very, very mild with just a hint of chiles.  My chicken enchiladas (http://www.yelp.com/biz_photos/7qSq-m4LRu3PAfroD-LKJg?select=U4yl_-SieUH_JMR6EthRpQ) were ready with very little wait.  The enchiladas are served with rice and black beans and garnished with a little shredded lettuce, a sprig of cilantro, a single tortilla chip and a piece of radish.  A shredded cheese mix of cheddar and jack cheeses was melted on top of the enchiladas but not the beans.  I would have preferred the cheese be melted on the beans also. You can heap salsa onto your food at your own discretion at the restaurant's salsa bar.\n\nThe enchiladas were stuffed with lots of white meat chicken.  The chicken meat was moist but quite bland in taste absorbing only the taste of the mild red sauce.  The homemade cornmeal tortillas were also too thick for my preference.  I would have liked a thinner tortilla.  The rice had a very subtle seasoning in it but much of it was clumped together.  That kind of reminded me of eating leftover rice.  The black beans were good.\n\nWhile filling the enchiladas really weren't what I had hoped for.  I'll be back on another night to try something else from the menu.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-18", "description": "I would give them another star if not for the weird service. It seems that every time I come here, which is not often because of this reason, I get the woman who cashiers only until she reached me and then all of a sudden, she turned into...a server, a bus person, delivery person, etc. \n\nFor example, on my last visit which was yesterday, she stopped taking order when it became my turn, and told me, \"just a minute\" and then started running around and do stuff like refilling the salsa bar, get ice, deliver food to the tables, getting this from the kitchen, that into the kitchen, etc. And then finally, when she's back behind the counter, I thought she was going to take my order, but nooo...she started doing something else again. So another lady from the kitchen came over and started taking orders because now the line is getting really long.\n\nIf they are so busy, why don't they hire another person? Anyway, aside from that, I find them ok nice but weird. If it wasn't for the fact that I was craving Mexican food, I would have walked out because I am a bit impatient. Food is not bad which is what makes me go back even with the weirdness.", "author": "Missy X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-10", "description": "This restaurant is fun inside. I got the chicken burrito and it was so moist and tasty. I love the homemade tortilla! What a difference that makes in your burrito experience.\n\nOne burrito was plenty to share between my sister and I, and was the perfect snack before heading into red devil lounge. \n\nAlso a plus that we have something relatively close, so if you can't hit up the Mission, this is the next best thing.", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-05", "description": "The food: have been eating here for years and everything tastes good. Not great, and not super authentic in terms of flavor. However, and as a result, it is not greasy and is really easy on the stomach. The salsas are fresh and provide plenty of flavor.\n\nThe ambiance: it's a hole in the wall, but the wall decorations are kitchy, and it's very clean. This isn't a \"cultural experience\" type of place, instead more of grab a burrito / torta and go for the locals, which is just fine.\n\nService: good service. Fast and efficient.\n\nOverall, this is a solid local place. Good quality ingredients and a good value. For a more authentic Mexican experience probably should go to the Mission, but frankly, I am of the opinion that Mexican food in SF isn't all that good. Need to go to So Cal for that.", "author": "Oleg A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-06", "description": "Service and atmosphere were great- owners seemed very nice and accommodating. Salsa bar looked fresh and had lots of great variety. The other reviewers are correct in saying the food here is indeed a bland without any additions. I would expect the rice and beans to be seasoned well enough that this wouldn't be a problem, however!\n\nI ordered a steak burrito which came with chips on the side. The steak was tough and didn't taste fresh. There was not anything interesting to note on the other components of the burrito. I added fresh pico and the hottest salsa to the burrito (both were delicious and flavorful!), which helped enhance the taste. All in all still convenient and cheap comfort food!", "author": "Vicki S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-10", "description": "Panchos - a neighborhood favorite and has been around for a very long time.\n\nOccasionally I hit Panchos up when I am craving some authentic Mexican goodness.  What I love most about Panchos is their tortillas, they are hand-made, and are simply delish - I don't think I've ever had tortillas made this tasty,  and in every item on the menu you can really taste the fresh ingredients put in to make the tasty items.  \n\nI highly recommend the daily specials, as they are always a hit.  \n\nCase in point:\n\nThe other day during the lunch hour, I made a special trek to Panchos and was so happy to see something different on the daily specials menu.  \n\nIt was their Tijuana Tacos and they are not your average Tijuana tacos.  The ingredients included tender steak fajita, sautéed sweet peppers, roasted potatoes, chipotle sauce, fresh cilantro and pico de gallo.  I am sure I am missing something, but God those tacos succulent and delicious.  Writing this review, I am craving them right now.  \n\nHere is a little insight and is something I've learned over the years; don't be in a rush, especially during the lunch hour.  The ladies, God bless them, who cook in the kitchen tend to be on the slow side and do a lot, and I mean a LOT of gossiping (I understand a little (pico) Spanish).  And they are quite humorous in their discussions; but not on days when I am in a rush (like weekdays during my lunch hour).  \n\nSo due to my assessment, I have devised a different strategy in that I order and pay, then head out to make use of the time and do other errands in the hood.  I come back 15 minutes later and Voila! My lunch is ready and I am on my way back to work.  \n\nMy only gripe is sometimes they forget (and I should know better by now) to complete the order, that is, if you order something outside of the norm, say a side dish of rice and beans, sometimes they forget to include these items in your to-go bag.  \n\nSo this is something I need to keep in mind when ordering - before leaving check my bag to make sure I received everything I ordered.  8^)", "author": "Cris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "Delicious fajitas and burritos! Fresh and authentic. Homemade tortillas and great salsa! Highly recommend.", "author": "Nitzan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-10", "description": "For its location, the food is well priced, filling and satisfactory. Nice decorations, comfortable atmosphere. I like the double standard too. Good family place during the day, and also good for a night out. The salsa bar is there for a good reason, take advantage of that. \n\nBurritos are good if you're super hungry\nTamales and enchiladas are my top 2 recommendations if you're really in the mood to sit down and savor the taste of Mexico. (Hint; add a little red chile sauce to your tamales = heaven)\n\nmy all-time number one fave is the chicken mole. i was scared to try it at first but once i finally did i couldn't get enough of it !", "author": "Lena E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-13", "description": "This is one of my go-to restaurants on Polk Street. I've been a long-time fan and have been coming here for over a decade. The food is always made-to-order and the salsas are always freshly made. The watermelon agua fresca is a great addition to your meal as it is incredibly delicious and refreshing. \n\nI've been pretty much tried everything and enjoyed them all.", "author": "K. E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "I've been coming here for years, it's a very convenient spot from my apartment. They have really tasty salsas and I dig their cheese enchiladas and burritos. I actually ordered those delicious enchiladas last week, and was surprised when I got them home that they had made me shrimp enchiladas ( I can't eat shrimp, problem!). When I called to let them know of this dilemma they remade my order ASAP, and as far as I can tell were very understanding. We all make mistakes once in a blue moon,but rectifying the situation the way they did was very professional and kind.", "author": "Mary S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "Very tasty borracho burrito - ask for no rice and you will be surprised! Portion size is perfect, and the spicy salsa is very spicy!", "author": "Jared B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-06", "description": "The staff is nice and the decor is fun.\n\nThe food tastes like cardboard, the best choice is to go to the salsa bar and pile on the spices for flavor. I had the chicken enchilada, it was awful. This isn't my first time here either so I know it wasn't a fluke, I tired it almost a year ago when it opened (because I LOVE Mexican food - I could eat it the rest of my life, if it didn't make me fat). My roommate, boyfriend, and self have unanimously decided this place is not so good. Which makes me sad because it's basically at my doorstep. Muy triste.", "author": "Jenna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-01", "description": "After biking all day through San Francisco on the way to the Golden Gate, we stumbled on to this establishment and it definitely hit the spot. \n\nThis isn't a place you would go for the ambience or for a celebration, but the food was very fresh and tasty. I got the Sopa de Pollo, and must say that it is some of the best chicken soup I have ever had in the world. I am not kidding. The balance of flavors from the fresh corn tortilla, the sliced avocado on top and the lime and cilantro was to die for. I will definitely hit this spot again on my next trip to SF.", "author": "Devalina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-04", "description": "Came into Pancho's last night to a packed house! The line was 10 deep around 7:15 PM and the cashier was working her ass off between bringing out the orders and trying to take orders as they only had 1 person working the front and 2 people in the back cooking.\n\nI ordered the Steak Burrito and Baja Shrimp Tacos to go along with a $2 Dos Equis Mug while waiting --- and both the food dishes were on point. The shrimp tacos had just the beer battered fish, light toppings and the tortilla to really bring out the flavor.\n\nMy only compliant was that the salsa bar was not full --- however, that issue was not the employees but rather managements lack of staffing.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-20", "description": "Great service at the register and that's about it.  I ordered a super burrito with everything in it and it had no taste.  First and last time I eat at this place.", "author": "Oscar B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-22", "description": "I hate having to give negative reviews but sadly this place deserves one. As a former vegetarian with veggie tendencies I get excited about places that have burritos with veggies and don't consider a veggie burrito beans and cheese so I was excited to try Pancho's. Ordered the veggie burrito (minus cheese). It took forever for my number to be called. Despite ordering it to go I couldn't wait and unwrapped the foil immediately. It was a soggy mess. Tortilla looked like it had been run under water and the whole thing fell apart. I brought it home thinking I'd try to repeat it and maybe try again but it's now in the trash and Pancho's is off my list. And btw, for a place with salsa bar in the title, I expected more than 6 not even good salsas with containers larger than a thimble size.", "author": "Liz R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-06", "description": "I would give 2 stars if not their $2.50 beer and chips. The borracho chicken burrito was well below average. It seemed like it was put together by somebody with 2 left hands. Inside was a mediocre mix of lots of rice, some chicken, beans. I don't think i tasted sour cream, cheese, or guacamole.\n\nThe chips taste great. Salsa bar has like 6 different options, none of them are really great, but OK. \n\nOver all, I will likely comeback, when I'm drunk, its just not that great when you're sober.", "author": "Try E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-13", "description": "It took longer than I expected for them to make the food and call my number, but this was one of the better burritos I've had in SF. I forgot which item on the menu it was, but it had both barbecue sauce and guac, making for a pretty delicious and unique combination. Everything fell apart when I got to the very last bit of the burrito, but that's what the complimentary wet wipes were for!", "author": "Jenny Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-23", "description": "This is an overdue revue.\nCame here a few times for burritos and each time was fine.\nI've forgotten abut this place for a while, but I've been looking for convenient mexican, and I think I'm going back.... perhaps tomorrow!\n\nIts raining and I don't feel like venturing too far, so I'll take the 1 to Polk, hop off and grab some food from Panchos, then I'm headed home!", "author": "Ash R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-04", "description": "Clutch place for a burrito on Polk, especially after a long night. I love the atmosphere inside, particularly all the decorations on the walls.\n\nThere's a decently large menu to explore, but I went for my go-to; a carnitas burrito. There was something about it that kind of let me down. I had higher hopes for the pork, but it wasn't terrible by any means. My girlfriend had a bean and cheese burrito, which I tried. I thought it was great, but pretty salty. I'm a fan of that--she's not.\n\nOverall, I'd come back here out of convenience, and it not being too shabby. But if I'm in the mood for Mexican, I'll make the trek somewhere else.\n\ntl;rd Good, not great.", "author": "Tyler H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "Authentic Mexican food with amazing service. I love how I can run in here and grab something or sit with friends and have a good time! We live a neighborhood over and it's still worth walking over to get a burrito or two!", "author": "Lyndsay V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-11", "description": "Pancho's is one of the few remaining vestiges of Polk Street from the good old days before yoga pants and cargo shorts mucked up the whole place.  Even Herb Caen was a fan, and anyone should be.  Burritos are more Baja than Mission style so it never ranks among the city's best in all the top tens.  But Pancho's is on upper Polk Street where all the white people live, and Cabo is easier visualized than Cuernavaca.", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-27", "description": "I ate at several burrito places down on mission. Eating a mission burrito was on my friend from Florida's  bucket list. This place has better burritos than any I've had in the mission. I  visited places that were highly  recommended by travel and leisure and GQ  and they don't compare. The ingredients are all Fresh, the chips are made fresh several times a day. The flour tortillas are soft and delicious but dont fall apart which is saying something because these bad boys are well stuffed. I bought the small burrito and was still pleasantly full I can only imagine what the large would be like. \nAll in all its worth skipping the Hype of mission and stopping by Pancho's if you want a good burrito.\nIf you're a purist you will be disappointed these burritos have rice in them ( they don't use rice in Mexico) But whatever its delicious", "author": "Luis S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "Borracho burrito was bomb!! Had it with carne asada. They use their own Mexican style BBQ which has a nice little kick to it. My girlfriend had the normal carne asada burrito and it was very good too. You can tell they use good quality meat. same goes for their other ingredients.", "author": "Christopher Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "Service is kinda slow, but I'm guessing they take their time to cook everything just right. You can see the cooks in the kitchen, everything seems pretty authentic & fresh. Nothing beats their shrimp tacos & everything seems fairly priced.", "author": "Jules F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "I go here often because it's nearby. It's no where near the best in the city but it's definitely a great choice in the nob hill area and one of the spots you can always go to for a consistently good burrito as well as some good hot sauces. Stick with the burritos when you order too. They are pretty tasty and better than the other stuff on the menu. Also, the decorations are pretty fun to look at and they have a friendly staff.", "author": "Gordon Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-09", "description": "Two burritos for less than twenty dollars, fairly quick and really tasty. Good choice for a quick meal in the go. We had the fajita burrito with steak and steak and shrimp burrito and they were both very tasty and filling", "author": "Sara C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-27", "description": "One thing San Francisco isn't lacking is burrito places. To stand out from the rest, a run-by quick Mexican restaurant has to have going for it is both prices and quality. \n\nPancho's isn't the cheapest I've seen for burritos but they made a pretty damn awesome vegetable burrito, the likes I've not quite seen yet. Stuffed full with broccoli, two types of peppers, rice, cheese, beans, salsa and yumminess, it was a pretty damn good treat for me when I was in the process of crashing from no food for most of the day. Due to my decreased appetite I was only able to finish half of the pretty sizable burrito but I could tell that it was a good enough size to fill me for a meal yet not go to waste. Not too big, but not too small. It was JUST RIGHT in size.\n\nBeing around the corner from me, I'd be happy to swing by again for more tasty attempts. Three different salsas were available at the free nacho location, but I skipped out on it. My companion tried the \"HOT!\" salsa (exclamation point was necessary) and found it a very interesting garlic salsa that definitely had some punch.", "author": "Cassandra J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-29", "description": "I really wanted to like this place, it's decor was pretty nice and I hoped for something super authentic and yummy. The staff was friendly, but the food just wasn't all that good. Everything lacked flavor, so the end result was a bit underwhelming. The have sine good salsa though", "author": "Amaresh S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-19", "description": "I have read majority of the 5 star raters and they questioned why some of us are ranking this place so low. I share the same curiosity to how can they rank this place with 5 stars? For those of you who said you have never tasted any better burrito in the city, my question to you is when was the last time you ventured out to a burrito hunt in the city? My guess is probably 5+ years ago because I can name two places on top of my head where I've tasted better burritos. First of, go to Taco Libre and then come back and tell me Pancho's burrito was just as juicy, just as balanced with their rice/meat ratio, just as tasty salsa at the salsa bar. No offense to Pancho, but their salsa bar need a lot of improvement. I liked how there were a variety and I tried all of them since it was my first time here. Honestly, the only one that I can put in my mouth was the green one (I never know the real salsa names).\n\nI ordered the Borracho and I see more rice than anything else that was listed on the menu. I actually thought they forgot the guacamole, but realize there was one tablespoon worth in the center of the 8in burrito. The staff here is so nice so I have no ill-thoughts toward them and I sincerely wish they can improve on their taste quality. There were only two things that I liked from my experience here, their chips (kudos to the thin and crispy character) and my bottled coca cola.\n\nProbably not going to come back, sorry.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-24", "description": "I've been a patron of Pancho's for several years. The food is *usually* very good and prices are okay. Here's where I'd like to see them improve on: \n\nSopa de Pollo needs more flavor. It's bulked up on rice, potatoes and vegetables with only one piece of chicken. It's not Sopa de Pollo without the chicken!  \n\nThe tostada bowl is very good and generous portions. The grilled steak needs to be served hot, not cold or lukewarm. \n\nThe restaurant is always freezing cold. They leave the windows open 24x7. Seeing that SF is typically cold & foggy, customers don't want to sit & eat a hot meal in a freezing cold restaurant. Do your patrons a favor and close the windows, please... \n\nConsider adjusting the lighting to make the place a bit more inviting. The bright florescent lighting hurts the dining experience. \n\nThanks for reading,", "author": "Giselle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-23", "description": "i have been going here since herb caen wrote about it in his article (yes, i am old)\n\nit's always fresh and tasty and the space is always clean\n\nfair prices, hand made food", "author": "John G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-01", "description": "I had a small carnitas burrito. A bit pricey but the place is clean and spacious and the burrito was fresh. The salsa bar offered good variety. It's just a few doors away from the Red Devil Lounge so you can easily stop in between acts.", "author": "Henry Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-02", "description": "Simple, fresh, and decently priced Mexican food on Polk Street. I occasionally go here when I don't want to walk far from my apartment. Corn tortillas and salsas are all made from scratch. I recommend the chicken tacos.", "author": "Alya G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-08", "description": "First experience was good. Went there two more times after deciding not to return. The service was horrible the last two times and the food we received was a joke. There were fries in a dish that required none. Food was cold due to the time it sat there instead of being served. The only reason I would suggest to go there is probably their drinks.", "author": "Ana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-16", "description": "Panchos is my go-to mexican food place in SF. This is in large part due to it's proximity to my house, which requires just a less than 5 minute walk to obtain one of my fave chicken burritos. They are speedy, dependable, and give you free chips and salsa! All good things. \n\nGet the watermelon agua fresca, it tastes like you stuck a straw in a watermelon. Win.", "author": "Melinda S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-28", "description": "Thanks to my friend who suggested coming here this past Wednesday evening. I usually go for enchiladas when dining at a Mexican restaurant, and here they had shrimp enchilada as an option. A platter of two goes for $8.99. Not bad.\n\nThey also have a good deal on Dos Equis beer: a mug for $1.99 (or I think that was the price). Something good to wash down the enchilada dinner.", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "I come here a ton by myself for lunch and with friends after work! Love the atmosphere and salsa bar. Their combos are really good deals and comes with a ton! Be prepared to feel full when you leave! #mmmmm", "author": "Monica H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-13", "description": "Solid Mexican food served by friendly people.  Good chips and salsas.  Convenient location and the atmosphere is a step up from the usual taqueria.", "author": "Tom N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-24", "description": "Solid three star Mexican restaurant. Their rice and beans with sour cream, guac burrito is a go-to for me. But, I've actually gotten sick before off of their fish tacos, and their shrimp doesn't quite cook up to what it should be.\n\nAlso their salsa bar is a little weak. But the location is clutch and when I used to eat chicken they made a chicken soup that was just out of this world.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-20", "description": "I'm not even going to be ashamed about my love for burritos, or for Panchos, for that matter. Is this the best Mexican food I've ever had? No - but is it a hell of a lot better than the bland food you'll get a few blocks down the street at Nick's? Bingo. My boyfriend and I have been absolutely ADDICTED to Pacho's burritos lately - thanks to the homemade tortillas, delish salsa bar, and likelyyyyy the ridiculously low priced pitchers of beers. I usually go for the chicken burrito, and he's a fan of the atomic with shrimp and steak. Super friendly and quick service, and plenty of chips and salsa to be had while ya wait!", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "Ordered their carne asada tacos ... so good. Reasonably priced but the meat was dry for my taste. They were open late as I was on my way back to Sac.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-02", "description": "One of the better taquerias in SF. Pretty simple food, but the ingredients taste fresh and good. It's also not too terribly expensive for Nob Hill food (which is generally outrageously costly).", "author": "Jason K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-26", "description": "I usually get the Steak and Prawn burrito with extra guacamole.. Yum!!\n\nThe grilled Mahi Mahi burrito is good too, but it takes about 15 minutes to make.\n\nminus a star cause it basically comes out to $10.00 without a drink.", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-30", "description": "This place is pretty good in terms of convenience. They always seem to be pretty quick too. I wouldn't say it's astounding. I like the festive decorations but it might be a little much for someone else. They have a cool salsa bar.", "author": "Olivia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-01", "description": "This place is really good ! Service is amazing ! Love salsa verde and chips are great ! Black beans are super awesome. !", "author": "Prayank J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-08", "description": "It's really good for a casual meal.  I went with a friend. I had the torta al pastor (Mexican sandwich).  She had their soup and said it was very good.\n\nThey also had tamales on the menu.  Yum!  They have a fresh tortilla chips, agua fresca, a fresh salsa bar, and Mexican beer.  Those are all marks of a place trying to be authentic.  \n\nThere are better Mexican spots in the city, but if you're in this block and want something good, this is a great choice.", "author": "Regina W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-20", "description": "Total gringo Mexican.  No flavor - not salty, not spicy, nothing.  Even the \"hot\" salsa was bland.\n\nCheap, so if that's all you're looking for it's ok.  Edible.", "author": "Stacey R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-14", "description": "The food here is decent and the prices are reasonable.  The interior is bright and fun and the staff is usually pretty friendly.  It's certainly not the best Mexican food in the area, but overall it's a nice little spot when you are craving some casual, late night Mexican.", "author": "Riley D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-14", "description": "Found this place close to work and surrounded by other places for a quick bite, but should have asked for a recommendation.  I ordered a simple chicken burrito and was a bit disappointed when I seen the size for 8 bucks.  You have to hit home runs with your burritos at any Mexican place even if it's not authentic.  so many places to eat and the competitive nature of restaurants on Polk I will probably think twice before heading in again. Sorry guys.", "author": "Jason J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-31", "description": "Okay, the food here is awesome, the 3 stars are not reflecting the quality of food in any way, I would give it 5 stars only for the fact my order has been screwed up for the 5th time in 3 months.\n\nI always get a to-go order.\nFour times I ordered and paid for a Chicken quesadilla along with a Burrito and four times I get home to find NO chicken in the quesadilla just Cheese?\nSince I'm a few blocks from here I just chose to write it off the first 3 times, but not the 4th. Went back to store, complained, nicely I might add, I'm in the service industry too. \nThey fixed it with no issues. But really, my printout said Chicken so the kitchen order slip must also say same.\nPlease start reading the order slips more carefully.\n\nToday I walk in and order a regular Carnitas Burrito and go home & its a Small?\nLook at my order slip and it also says Sml, but I never mentioned Small once when ordering.\n\nI know English is not the servers first language, but really, I asked for a Carnitos Burrito, maybe its time to start verifying orders with the customer before sending it to the kitchen.", "author": "Jack H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-27", "description": "When I moved to Nob Hill I knew I would be giving up convenient, decent taquerias. Or so I thought. Pancho's makes consistently excellent tacos and burritos. Their meat is flavorful and never grisly, and their salsas are good. \n\nI appreciate the reverence of the \"hole in the wall\" (I guess the food truck is the new hole in the wall), but there's something to be said for a restaurant that decorates the interior nicely, is sanitary, and keeps the quality consistent. So, whereas other taco/burrito vendors may make, on a good day, the more exciting Mexican food, Pancho's is the sort of place you'd actually want to hang out in. It's a neighborhood restaurant, friendly staff you get to know, and cheap beer specials. \n\nHats off to you Pancho's.", "author": "Adam M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-06", "description": "Solid burritos with meh-to-decent chips. Their veggie burrito has a legitimate array of vegetables in it, as opposed to the standard/boring bean-and-rice variety vegetarians usually get saddled with.\n\nYou're in the area and want a burrito? This is the spot for you.", "author": "Greg P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-25", "description": "This place is a total hole in the wall, but it's delicious and affordable which is hard to find in the sea of \"upscale\" Mexican joints around here.\n\nUnlimited salsas too.", "author": "Sean F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-04", "description": "I went to Pancho's this afternoon with an eye on trying a new taco/burrito place near my house. It goes without saying that Nick's Crispy Taco's was presented to me within weeks of moving to SF, and I love it, but I wanted to try something else and see what else I could find.\n\nThe ambience is much preferable to Nick's or many other taquerias; it has nice designs on the wall, many tables, and a helpful and cheery staff. The food came out relatively quickly, and was served with some chips, but only like 8 literal chips - king of annoying. The salsa bar is nice and high quality (I really liked the green salsa quite a bit), but you have buy an extra thing of chips to really take advantage, unlike some other places that give you enough side chips for free to enjoy the salsa.\n\nI ordered a Borracho Burrito after reading some other Yelp reviews. I found the sauce to be interesting if nothing else, but a little too re-inventing the wheel for me. I couldn't really taste the cheese or guacamole, although the tortilla and meat were spot on. In general, I thought it was pretty good and different than a normal SF burrito, but nothing earth-shattering, if you ask me. Disappointing too because it is more expensive than El Super Burrito on Sutter and Polk, which offers unlimited chips/salsa with your burrito, and is more expensive than two Nick's crispy tacos. Again, I liked the salsa alot, though. I might come back next time and go to town on the salsa, order something more traditional, and enjoy the nice vibe of this place. \n\nIn general, I'd say Pancho's is definitely worth a swing-by quick lunch, and a good business to support helpful and cheery staff, although don't expect a life-changing meal in any context.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-19", "description": "Mmmm Burrito! ...honestly I've had better and I've had worse, these were not too shabby and successfully filled my burrito craving.", "author": "Maria E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-20", "description": "Nearest burrito place near my house.. not bad\nTheir basic no frills rice+beans burrito is pretty good..\nsalsa bar is not bad.. i like the ones at tropisueno and little chihuahua a lot more though\ngood after-work takeout place for me!", "author": "Aditya M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-14", "description": "I have to say, this place has some darn good fish tacos. Big pieces of fish is what really makes them really awesome. I don't get all the hype of Nick's Cripsy tacos. Is that place supposed to be a bar, a douchebag club or a taco joint? Something just doesn't connect. \n\nHowever, if you walk down Polk, you will find Bob's doughnuts and Pancho's. It's a win, win. \n\nAnother thing that is really awesome about this place is the fresh tortilla chips and the salsa bar with all the right fixins. Trust me, all of the salsas are good, which is a rarity. It's also pretty cheap compared to Nick's. (Once again I really just don't get the yelp hype on that place). \n\nThe only reason why I give this place 4 and not 5 is due to the fact the rice is more boring than my social life as of recently.", "author": "Krista N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-09", "description": "Hmm, how to rate this place. I have been here several times before Yelp and always enjoyed this place. However this time was my most disapointing visit. If this was my first time here I would only give 2 stars, but I averaged the 4 star visits from before to come up with the 3 stars. \nOn this visit I was greated and had my order taken quickly, but it went down hill from there. I ordered a 2 taco combo meal and sat down. Then another customer came in and ordered to go. They cooked my food, put it in the window. Then the other guy's food came up, they then got the to go order ready and sent him on his way, while my food sat in the window. When they brought me food, I then had to ask for chips.\nThe food might have been very good if served quickly, but when I got it, it was not very hot, had water on the plate, so the tacos were a little soggy. The flavor was good, and I do love the salsa bar.", "author": "Steve A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "I like the place. The decor is fun, with some old movie posters and ads from Mexico. The food was good -- I had a burrito with their BBQ sauce, which is sweet and spicy and quite large.  The man at the counter was friendly and bought the plate to my table.  There's a list of daily specials on the board to the right of the cash register.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "I've been going here for about ten years.. it's a neighborhood staple, basically! The food is fresh and the service is good, attentive, and polite. I'm not a huge fan of their burritos or nachos, but in a rush, they'll definitely do!", "author": "Cecilia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-19", "description": "Matt was hungry and had a craving for a Burrito, but not willing to drive out to the Mission and waste gas, valuable time looking for parking and smelling like poo afterwards.\n\nPancho's is closer and walking distance from the Fantastic-4's crib. Matt bought a Carnitas Super-Burrito with all the fixing inside the Deluxe Silver-Bullet. The $7.00 SB was a hefty size and very yummy for a Taqueria in this mid-section of Polk St., though this place might not win in a battle between the best taquerias in the city, like Matt aforementioned on a prior review. This place might surprise some judges and critics on their surprisingly tasty food\n\nThe taqueria was quiet and the staff was very stern and composed themselves very well, as Matt devoured his SB like a wild carnivorous animal from National Geographics. Some of you Yelpers, who have seen Matt eaten like a Human garbage-disposal, his monsterous appetite is back!!", "author": "Matt G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-15", "description": "This place presents one of the many Yelp dilemmas: how to rate a place where you REALLLLLLY LOVE only one particular item on the menu?\n\nUntil recently, Pancho's was often subjected to my general distaste for all things Polk. I found their burritos mediocre, giving them at least two or three tries with each one faring no better than the previous. In the end, I was more than prepared to consider Pancho's another wart on the anus-flesh that is Polk St. \n\nAnd then I tried their tacos... which have only just become my FAVORITE thing about my neighborhood. \n\nI don't know for sure, but on the subject of their taco tortillas, I'm willing to bet some little Mexican grandma is out there rolling and pounding these little bits of bliss into fruition. I can practically taste that smothering, latino-mother love in each bite.\n\nAnd where else can things go but up once you drop a small pile of deliciously seasoned carnitas on top? Hand me a Mexican coke and call it a day motherf***er I'm SOLD!\n\nSo back to my quandary... I very much adore their tacos, and indeed they are now a regular part of my increasingly shameful diet, but I must concede it's just plain wrong when people hand out a five star rating because a restaurant happens to do one thing very well... but perhaps my aversion to a five-star rating in this situation runs deeper... \n\nPerhaps I can't give it five stars because I often say rude, judgmental, borderline ignorant things about people who freely dole out a lot of five-star ratings. Indeed, I am just that type of person.", "author": "Brian K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-25", "description": "I got a steak Borracho Burrito and it was disgusting. I should've known better than to think that barbecue sauce would be alright on a burrito. The steak was dry and lacked just about every quality to think that what you were eating might be a burrito.\n\nI actually really liked the salsa bar because there wasn't a lot of salt in them.", "author": "Russ R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-25", "description": "Was in San Francisco for the weekend and craving some good authentic mexican food. We heard about this place just around the corner from our hotel. \n\nBoy, were we disapointed!  This place was not the real taste of Mexico we antcipated!  The carnitas and grilled steak burrito were bland to the core and needed a lot of \"on the table\" spicing up.  The taste of the tamales and rice were the same - no latin flare. \n\nOne positive, the beer was nice and cold. Overall, would not recommend !", "author": "Mike P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-12", "description": "I went here because it totally slipped my mind on Tuesday that Nick's has their taco tuesday night... and I didn't feel like waiting in line. I begrudgingly followed the better half to Panchos, and was pleasantly surprised.\n\nReally decent ambiance with a bunch of fun crap on the walls. Nice people behind the counter, and it wasn't too busy at all. Both my fiance and I have selective eating habits, so we made a bunch of changes to our food, with no issues whatsoever. Ten minutes later, our hot fresh delicious food was brought to the table. Ample portions, tasty, fresh ingredients. \n\nIt wasn't quite as good as Nick's Crispy Taco's... but it most certainly sufficed in a pinch. I'd come back.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-31", "description": "I love this place. Amazing corn tortillas and really nice staff.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-02", "description": "Hit or miss - passable Mexican food; not very notable. Good, fast service.", "author": "Nipul C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-04", "description": "I like stopping by Pancho's on my walks home from work. I always order a burrito and it's always tasty. \n\nFree chips in the bag, a well stocked salsa bar, and a nice environment to wait in. Thank you, Pancho's, for being there for me when I'm hungry.", "author": "Madeline N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-06", "description": "I know a good burrito when I taste one and unfortunately, Panchos fell abundantly short for me. After a long night of happy hour'dom, I was ready ready ready for a delicious, piping hot, flavorful, gargantuous burrito. With Pancho's I didn't even get one out of the four desires. It was bland, cold and definitely not as gargantuous as most of the gargantuous burritos I get in the Loin. \n\nThey use \"fresh\" ingredients and I've considered that in my rating. The guacamole they used definitely tasted like it had been made just minutes before they served it. The chips were actually pretty damn amazing. Typically the tortilla chips that places serve don't taste good by themselves; you HAVE to have salsa with them. But not with Pancho's chips. I was poppin' those puppies naked and loved every ounce of them. \n\nBottom line: If their burritos were as good as their chips it'd be a 5 star rating for sure.", "author": "Julia N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-28", "description": "The burritos here are great! I also have had a quesadilla and it was good too. The staff is friendly  the 3 star rating is because I ended up with a small rock in my burrito that apparently had slipped into the beans? I called them and let them know what happened and to give the chefs a heads up. They were nice about it, but said it happens sometimes... so watch out!", "author": "Kristina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-17", "description": "One of my favorite casual Mexican restaurants.  Have to say that they do seem to have \"off\" days when things seem rushed though.", "author": "John C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "Eh.  Ok for an edible burrito.  I usually only end up here because I am with a bunch of friends who are in a hurry to eat and can't agree on anything else.  Nothing special.", "author": "M S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-16", "description": "Rating based only on Chips & Salsa and 2 Dos XX at 4pm on a Sunday.", "author": "Andy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-13", "description": "A little expensive, not the best location, but the salsa and burritos are top-notch. And it's next door to Bob's for desert. (And Lafayette, if you're going to or from it on a Saturday.)\n\nGet a chicken fajita burrito on a chile wrap -- my favorite burrito in the city (and I am extremely picky about my Mexican food).", "author": "Jono S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-08", "description": "i need to come back and try the potato, eggs, rice, cheese burrito for $4.99.  \n\n$7.01 for a carne asada. ($1.04 to add guacamole) it's decent for the area. the salsa bar is not bad either.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-26", "description": "On a late night hunt for food, we came here and were completely impressed.\n\nBaha Fish tacos (deep fried) and Carnitas tacos were just outstanding.  Plenty of meat and super tasty.", "author": "Raider J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-11", "description": "I agree with other reviewers, the food is a bit blunt. I had the veggie burrito and guacamole on the side. The burrito was good, the guac was lacking flavour. Pancho's definitely a good place if you need a quick cheap burrito fix, and there aren't many Mexican places in the area (as far as I know).", "author": "Lisa O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-10", "description": "3.5 stars seem more accurate. It seemed popular, lots of people coming in and out, mostly for takeouts. It's in Polk Gulch and most seemed like they were nursing a hangover from the night before haha. I'm from San Antonio so I consider myself an expert on Mexican food. This one is good enough. Everything tasted pretty good. We ordered nachos, and the steak fajita burritos. I liked their salsa bar.. just took everything to our table. Service was fast, you order at the counter and they bring food to you. Decent prices. No restroom though! I'd eat here again.", "author": "Vol T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-04", "description": "300th review and i'm writing about Panchos...maybe because it's 3 in the morning and i have cravings...uh oh!\n\n5 stars for their chips and salsa!! soooooo warm and fresh..i can eat bags! \n\n4 stars for their chicken tacos! Comes w/ 2 per order and loads of chicken.\n\n5 stars for opening late...i felt so guilty for eating at 10:30pm on a weekday, but just couldnt resist...why cant they be open at 3am though??? darn!", "author": "M W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-06", "description": "I stopped by Pancho's for the first time yesterday after living in the area for five years. Super hungry and in need of a quick snack, Pancho's totally delivered. The staff was super nice and friendly. Their menu explains that tacos are sold in pairs, but I asked for a single taco as a snack and the cashier gave me a mega-watt smile and sold me a single taco. The taco was good, but not like a good old Filibertos of Tucson. I'll go back for a quick snack anytime.", "author": "Alice S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-10", "description": "I still love this place after so many years of coming here. The food is always great. I went to the first Pancho's back when I lived in Berkeley. They have a huge location there. \n\nOnce I moved to San Francisco I was happy they had one here. The food is always fresh and it is priced well. The salsa bar is great and always restocked often. Nice people and the place is always clean.\n\nI try to hit this place at least once every 7 to 10 days.", "author": "don h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-10", "description": "SPOILER ALERT! They use canned beans. Don't be fooled like I was by their \"we're-a-real-mexican-restaurant-I-promise!\" decor.", "author": "Gretchen V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-17", "description": "this place is soooooooooo goooooooooooooooood. i loooooooooooooove their burritooooooooooooooooooooos. steaaaaaaaaaaaaaaaak. sooooo goooood. yummmmmmmmmmmmmmmmmmmmmmmmmm", "author": "Andrew G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-02", "description": "Panchos is a three star burrito shop.  Some things come out right, but others don't.  For example, the corn tortillas themselves are fantastic -- we sometimes just buy the tortillas and take them home to make our own food since they are better than store bought.  The salsas, in contrast, are a pale, sloppy mess.  If you get a burrito, you'll be pleasantly satisfied, but you won't mistake it for anything you'd get in the Mission.  All in all, Panchos works because it's the only game in the hood.  I wish they had some competition...", "author": "Laurence W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-21", "description": "20 minutes for two tacos??  Tacos??  Seriously?  These people don't seem to believe in capitalism.  The tacos were plain with an ok taste, but again, 20 minutes?  Don't come here.  Worst spent $15 of all time...", "author": "Jaime C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-05", "description": "The chicken mole is the best around. Fantastic little take-out place with homemade corn tortillas to order. One chicken mole with extra tortillas = food for 2 people! Their chips and salsa bar are second to none.", "author": "Kristen K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-16", "description": "Pancho's is great if you're in a hurry or just want something cheap without a line. Honestly though, the food isn't that great. I've tried both the carne asada burrito and cheese quesadilla and neither were even close to spectacular. Additionally, the guacamole was terrible!! I would only recommend this if you live in the neighborhood & don't have much time.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-12", "description": "We got shrimp fajitas and a shrimp salad. Both pretty good and loved the salsa bar, especially the spicy marinated veggies. The corn tortillas were really fresh and yummy. But the 2 entrees could have been bigger, and this is from 2 of us that are not big eaters, not that much grilled veggies/shrimp with the fajitas. I always get shrimp salads at mexican places and still prefer the one at the little chihuahua to this one. What was there was good though, will have to try something else next time.", "author": "Faina G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-14", "description": "Hand made tortillas were really good everything else not so much. Customer service was good but food was horrible I can make better Mexican food. Still trying to find a good Mexican place on this side of town", "author": "Evelyn D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-13", "description": "Finally stopped in after walking by many times. Clean venue with friendly staff. Large and smaller burrito options. Diverse menu which can accomodate for various diets. They take credit cards which is awesome and they make recycling and composting your rubbish easy. Will definitely return.", "author": "Heather L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-28", "description": "It must be difficult to be down the street from Nick's Crispy Tacos but Pancho's stands in there and gives as good as it gets.  I occasionally stop in for a burrito and I give the carnitas a thumbs up.  You could do a lot worse.", "author": "Jay D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-12", "description": "Pancho's VS Nick's\n\nGO TO PANCHO's and TASTE THE LOVE\n\nPancho's is the best Mexican food on Polk hands down.  Considering that their only competition is Nick's Crispy Tacos.  Nick's is a great place only if you are too drunk to walk down a couple blocks to Pancho's.  First of all-Nick's does look like a brothel and is dark and dingy, as soon as you walk in.  It always has sticky floors, and what 's that fermented, damp-rag smell?  I'm always afraid to touch any surface in that place. The food at Nick's taste old, and you can tell there's no love in it's preparation adn it's always always slopped together.\n\nPancho's on the other hand has great food.  I have gone and ordered down the menu and have never been disappointed.  All their dishes are lovingly prepared, my favorite would have to be the taquitos dorados: three rolled corn tortillas filled with chicken, fried (but never greasy), served with lettuce cheese and rice and beans.  \n\nThe tacos are also very delicious, made to order, again with love.  You can taste the LOVE in those hand made corn tortillas...very authentic and have only tasted better in Mexico.  \nThe selection  of Salsas is great, the salsas themselves are made several times aday so you know it's always fresh.\n\nHIGHLY RECOMMENDED...", "author": "Jon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-10", "description": "Cool layed back resteaurent!  Really good food and relatively cheap for the huge food portions.  I highly recommend this Mexican place!", "author": "Thomas B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-04", "description": "It's just ok. The prices are a little bit lower than better Mexican places but that is also reflective of the quality of the food. Service is just ok too - a little slow but fine.\n\nStick with the burritos - I made a mistake ordering one of the combo meals and depsite being hungry could only finish about half the plate.", "author": "Pan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-09", "description": "They have an actual salsa bar!  Everything was delicious. Fast friendly service. Not a single complaint. Good stuff.", "author": "douglas B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-15", "description": "I love Pancho's because everything is fresh. Even at 10pm right before closing, they give you the warmest paper thin tortilla chips. Their veggie burrito is the perfect indulgent midnight snack. Not too big but enough to fill your stomach with fresh steamed veggies, rice, and the perfect (small) amount of cheese. Their all you can eat fresh salsa variety is just excellent. I also love their chicken soup and their tortilla soup, plus their Fish Tacos (the fried and non-fried fish are both great). You really don't need to walk all the way down to Nick's for a great fish taco :-). \n\nPancho's is a unique taqueria which has maintained their standard of freshness and quality for many years now. I'm happy to see it's a loved institution. What's also fun is going to Panchos and buying a load of their cheese-stuffed jalapeno poppers and heading to the Big Foot for beers. Ai Carumba.", "author": "Roxmarie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-15", "description": "Personally i really enjoy this place for a burrito. \nits very close to my house, the salsa bar is plentiful and fresh and has a delicious variety. the tortillas are super good, chili tortilla?!?! Z0mg!\ni enjoy the fajita burrito with carne asada, as well as their breakfast burritos! \n\nthe service is super good as well! id for sure suggest it.", "author": "Elliott G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-29", "description": "As others have mentioned, the Borracho Burrito is truly special and tasty.  But I also love their veggie burrito.  Their chips and salsa are both also exceptional.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-07", "description": "Very tasty food. Nice selection and GREAT service. Very quick and very clean place. Wish more places along Polk Street kept up their space inside and out. \nEveryone here seems to take pride and ownership in their work and the food there.", "author": "John G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-24", "description": "Ick... Just ate dinner here tonight because we were too lazy to drive out to the Mission. Lesson Learned: travel for quality.\n\nWe both got \"grilled steak\" burritos, mine w/ guacamole. I failed to notice that the burrito comes with lettuce, which is my pet peeve in burritos- I think it's hideous. But it was my fault that I didn't request the burrito without lettuce, so I won't hold it against them. \n\nWhat I will hold against them is the fact that the \"grilled steak\" tasted like dog food. It had this distinctive, very unappealing scent that immediately turned me off. I ate 1/3 of the burrito because it actually took me awhile to reach the steak, but I gave up soon after. I'm still shuddering thinking about how gross it was.\n\nThe one thing that doesn't seem like a total Yelp-lie is the yummy fresh tortillas. I ordered one on the side and it saved me from my butt-rito. I can't understand how a place with such quality tortillas can serve such shameful burritos. Both me and my boyfriend were bummed.\n\nSalsa bar was okay, although only two were actually tasty. 3 of the 4 were very watery. Chips were fine, but Nick's (down the street) serves stuff that's WAYYY better.\n\nYeah... I'd never come back here. I guess this is one of those times when I just have to shake my head in disbelief at the people who rate this place 5 stars. Do we even live in the same universe?", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-19", "description": "I'm new to the city, but I can't believe it gets much better than this. The steak and shrimp burrito kicks ass and so do the fish tacos. The salsa bar rocks too.", "author": "Poogie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-22", "description": "very mediocre experience. i ordered the steak fajitas and the meat had no flavor and everything else was bland. good value as just about everything on the menu is less than $10, but there is definitely better mexican to be had in the city.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-29", "description": "I really want to love Pacho's I mean really do but I always end up in the \"just friends\" zone. \n\nThe food is always perfectly adequate but it never really surprises me. Extra points for having a well balanced veggie menu and for giving out free chips with every meal. \n\nIf you want awesome Mexican stick to the mission but if you are on the Polk and are craving a burrito Pancho's will make you one that hits the spot...okay well hits a little to the left of the spot.", "author": "Nerd A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-31", "description": "Great price, yummy burrito, yummy green salsa and fresh thin crispy chips = lunch perfection.", "author": "arlene r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-01", "description": "A solid Mexican option when Nick's Crispy Tacos is too crowded. \n\nPancho's has a kooky but relaxed sensibility.\n\nIt's just an easy option for Mexican when on Polk St.", "author": "Sophie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-18", "description": "Chicken Borracho Burrito, por favor!\n\nGracias, Burrito de polla, por su ayuda cuando estoy cruda y tengo mucho hambre. Me gusta beber cervezas, y a veces estoy borracho. Entonces, en la manana proxima cuando estoy cruda el burrito borracho es perfecto para mi! !Gracias Pancho!\n\nFor those of you no hablan espanol, I love Panchos for hangover food. I zip over here on a nice little 2 block long, soothing stroll, getting some air  and sunshine into my system and get mi burrito to help my hungover ass not die of starvation/ lack of nutrients and/ or electrolytes/ vitamins. Then, the nice people at Panchos give me a delicious burrito, full of chicken, beans, rice, a generous helping of guacamole, and some special borracho sauce, for $7 and some change.\n\nI think borracho sauce helps people who were borrachos the night before, yes? Add some hot salsa, and I am a new woman!\n\nI mean it's a little gringo- y, but I'm just a guerra cruda. Who am I to complain?", "author": "Katie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-28", "description": "Tasty steak burritos here - one my favorite takeout spots back when it was on my way home from work.  Good salsa bar, constantly restocked by the attentive staff.  \n\nWould have given them the full 5 stars but the cute cashier girl seems immune to my mental suggestions.  Yes, no matter how much I smile and twinkle my eyes, she doesn't seem to understand that I would like her to toss in a few extra chips...", "author": "Steve H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-15", "description": "This place is great. Their service is so fast. I don't know how they do it, and their prices are totally reasonable. As well, their staff is very friendly and. I eat here at least once a week.", "author": "dAvid s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-29", "description": "This review is long overdue.  I was reminded of how long overdue this review of \"Pancho's\" truly is, when I (tried) to eat at the veritable sh**hole, \"Crema\" in the Chelsea district of New York - a restaurant so horrifying that it actually inspired me to write my very first \"Yelp\" review.\n\nAs a former resident of Pac Heights  in San Francisco, I am ashamed to say that I took this little gem, \"Pancho's\", for granted; ordering often and without a single regret.\n\nAs I now reside in New York, I have but one thing to say:\n\nI MISS YOU PANCHO'S!  \nYOU COMPLETE ME!\n\nThank you for years of perfectly spiced fish tacos, and the only chicken tacos so amazingly good that I was forced to turn my back on my vegetarian diet from time to time (be sure to order the \"higher end\" chicken tacos as they are served as part of the \"#2 Combo\", if memory serves).\n\nAlso, be sure to order extra chips (made fresh and served warm) and don't mess around with the self-serve salsa bar - just bite the bullet and get a half pint of ANY one of their freshly prepared salsas AND do the same with their guacamole.  Seriously, the best in this solar system.\n\nAnd for those of you who have complained about slow service...? Try throwing a few bucks in the tip jar when you order.  I've always tipped and have always received fast, courteous service.\n\nAnd in case you're wondering, NOT tipping at a little joint like this DOES absolutely earn you at least one, full month of bad karma.", "author": "Jim W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-19", "description": "Oh Pancho's, you're like the girl next door but not the really cute girl-next-door type but rather just the actual girl who happens to live next door. \n\nYou're so, so close. And it's just so, so easy. But c'mon, let's not pretend. We both know I've had better. I mean, it's not like I've never caught a glimpse of that Latin girl a few neighborhoods south.\n\nBut let's look on bright side Pancho - Monday nights still come 4 times month.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-11", "description": "I was pretty underwhelmed with my chicken fajita burrito, which was very dry and seemed to not have any of the things the menu listed it would.\n\nBut their chicken soup was a welcomed shot of healing into a household that's under the weather.\n\nPrices are high, but what did I expect for this part of town?", "author": "Jason R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-10", "description": "Great Taqueria, especially since there aren't many choices in the Nob Hill/Russian Hill/Pac Heights zone.  They have fresh ingredients and  I've been happy with almost everything I've ordered.  Better yet, they are fast and inexpensive.  They also have a cute small Taqueria atmosphere if you're walking down Polk and looking for a place to drop in.  OH and a great selection of Salsa's .  No beer on tap unfortunately, but they have bottled beer.  \n\nI still long for the Mexican and Latin food in the Mission, but Pancho's will do for now.  They also have some good options for the Nob Hill/Pac Heights crowd - like lots of veggie selections and whole wheat tortillas for the health conscious.", "author": "Peter S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-05", "description": "Pancho's answered a long standing question: Is squash appropriate in a veggie burrito? The answer is a resounding yes.\n\nSlightly high prices, but the massive steamed veggie goodness wrapped in a wheat tortilla was worth every peso, er, penny.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-01", "description": "There definitely not too many places to grab something Mexican eats in Russian Hill, so between this place and Nick's Crispy Tacos on the other end of Polk St., you've pretty much reached your options limit.\n\nI do enjoy their nachos, and their crispy taquitos though.  Try the chicken though, their steak/asada has a tendency to be a little chewy and dry.\n\nP.S.  They have great aguas frescas too!", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-21", "description": "We ended up here because Sliders is cash only and we left our house without the ATM card. No worries, we ended up having a fish burrito that was really tasty. The service was what you'd anticipate. You stand in line. Then you pay. You sit and someone brings you your burrito. Plain and simple. \n\nNot so simple? The ambiance at this chain-is cheesier than the food. Every surface slathered with Corona promotional materials including depictions of girls in bikinis and parrots cozily cuddling their cool long-neck bottles. We sat at the bar style seats along the side wall and avoided the spectacle of watching the parade of \"residentially challenged\" down Polk Street while Ranchero songs belted out of the sound system muffling the crunch of chips at each table.  \n\nI know a good taqueria when I walk into one and Pancho's is Mex-American blah. Burrito snobbery aside, the Mahi Mahi burrito was a nice surprise.", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-02", "description": "Good but not great.  I had a burrito--not much to rave about.  Fairly cheap.  Service was great.  Personable and quick.  \n\nFairly quiet on Saturday night.  Our group sat undisturbed for quite a while.  \n\nBurritos were just so-so.  The salsa was pretty good though!  If I'm in the neighborhood, I might try again.  Otherwise, I'm happy with Gordo's around the corner from me.", "author": "Melissa Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-25", "description": "This place hates giving out their meat. I've given them plenty of chances, and always...no meat.\n\n\"Too much!\" the manager screams at the chef as he slaps his hand. \"What if the earthquake happens tomorrow?\" he continues. \"Then what would we do, what would WE eat?\"\n\nThis place gets one star for having Dos Exious(sp?) on draft. Asides from that, goddamn. The final straw on reviewing this place was when I went there for lunch today. I had just got done working out and was in need of some serious protein. When I work out, I don't fuck around, people get killed. So I went there and got the fish tacos. When they brought them out I laughed. \"Seven grams of protein?\" I asked them. \"This is a joke, right?\"", "author": "Dave G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-14", "description": "Don't act like you can't get a legitimate burrito on Polk Street. You go here, or you go to La Parilla and you have a perfectly lovely time. Oh you like only crud in the Mission? It has to be cooked dirtball to be good? You are just like those girls who would rather date the STD-infested rockstars than your nice neighbor who will never cheat on you!\n\nI'm sorry. You're not like that. You don't like Nick's Crispy Tacos either?! Let's hold hands and skip.", "author": "Shannon V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-20", "description": "Dissapointed. I've been a few times, and it continuously is below my expecations. I will realistically continue to go, it is the closest place to get a burrito to my house.", "author": "osmahn k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-16", "description": "NEVER had bad guacamole here\nchips are always freshhhhhhhhhh\ncarnitas-absolutely delicious\nfriendly accommodating staff\ngreat flour tortillas\nquesadillas are excellent\nrefired beans-delicious\na real find!", "author": "Chris D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-21", "description": "decent food and salsa bar, didnt knock my socks off for price or quality.  next time I'll try a burrito.  my last visit I had vegetarian soft tacos.", "author": "Beth W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-19", "description": "EDIT 3/24/07:  Practices poor customer service.  Sorry, but it's bad enough that you fuck up my burrito, not once, but twice, AND not even apologize for it.  It's too bad, too, because I really liked their breakfast burrito.  \n\n------------------------\n\nThe burrito tasted flavorful.  And the chips were crispy, far from the stale chips I've tasted at other taquerias.  Service was quick and friendly, and there's also a dining area, which makes it nice if you want to scarf down your meal on the spot (like I did).  There aren't many options when scouting for mexican food in this area, but Pancho's surely satisfies.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "For those of you commenting that it's not \"authentic\", what do you know of authentic? If you want authentic, go to Mexico and order a plate of food at various restaurants. Watch \"Mexico One Plate at a Time\" on PBS. Otherwise, the decor is pretty darn authentic as well as the music. So is the soup and home made corn tortillas. The Boracho burrito with sour cream is very tasty. Pancho's is not perfect, but what place is?", "author": "Michelle V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-10", "description": "Great Happy Hour!  \n\nHow can you go wrong with cheap drinks and great food!?  \nWanna' share a can of Tecate?!", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-29", "description": "After a long hike up and down the streets of Nob Hill and Russian Hill, I was ready for a hearty lunch. I'd been talking with my friend about good places to get Mexican food for the last 30 minutes, so, of course, that's all we could think about. We decided to give Pancho's a try\n\nI'd been hoping they'd have some sort of vegetable nachos, but sadly they only have vegetarian nachos. In other words, no yummy veggies on top, just the typical non-meat nachos ingredients. However, they did have a perfectly good-sounding veggie burrito, so that's what we both ordered. We both agreed that they were delicious. I was disappointed by the fact that there were green bell peppers in mine, but she was happy there were no carrots; we did enjoy the onions, broccoli, red bell peppers (and more). \n\nI can't stop writing without mentioning the decor in this place. There is a tropical beach-front feel to the restaurant, with all sorts of things (sombreros, surf boards, octopi, etc.) actually sticking out of the walls and mounted on the ceiling.", "author": "Katie I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-28", "description": "Wow, after reading all of the horror stories I feel bad about giving this place 3 stars, but I like their fajita burrito and chicken tacos., so its gets 3 stars by me.\n\nThe decor is kind of cheesy, but I never eat there I take it to go. It is one of the only Mexican food places near my place so I am a regular. I have had much better in the mission and even in the FiDI, but this place inst SO bad, but I definitely don't crave it.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-17", "description": "Legit happy hour, friendly staff, works when I'm craving a little latin flavor!", "author": "Jodie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-10", "description": "Admittedly, many of these types of restaurants use rice as a filler for their burritos. The easiest way to take care of this situation? Ask for no rice. \n\nTheir chicken fajita burritos are my absolute favorite, the chicken is tender and the grilled peppers and onions are delicious. Even with the rice omitted I can't finish one myself. As others have said, their chips are hot and crispy. If you're feeling adventurous, add in a Mexican Coca-Cola and you've got yourself an awesome meal and a full tummy.", "author": "Lori M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-27", "description": "I'm a neighborhood regular at Panchos. It is right around the corner and is my quick fix. It is not the best mexican I've ever had, nor is it the worst. The prices may be a little high for a basic taqueria, but consider the rent on Polk Street as the explanation for that. This is not the Mission. \n\nTo address some of the other complaints seen here: 1) I'm not a fan of the meat served in ANY taqueria or ethnic place, so I just never order meat; 2) staff is not dumb; they are good, earnest folks just making a living and mistakes happen; 3) I can't speak to the supposedly bland burritos b/c I don't order them. My favorite dishes are the enchiladas and the tostada salad. Quesadillas are small and simple, good for kids. \n\nWHAT'S GOOD:\n- abundant warm, fresh, salty chips!\n- guacamole\n- salsa bar\n- consistency of product; my favorites are always just as I expect\n- i get a kick out of the goofy decor\n- easy, casual neighborhood place\n\nNOT SO GREAT:\n- bathrooms at places like this are always dicey\n- gets cold in there, they like to leave the window above the door open, so i always try to sit towards the back\n- sometimes my \"to go\" orders get mixed up, since I always ask for \"no this\" and \"extra that\". I always end up with chicken when i don't want it, so now i check before i take it away and try to not be too complicated when calling in an order.\n\nOverall, I am a fan and think it is a great addition to the neighborhood. Definitely check it out for yourself.", "author": "Ponytail W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-11", "description": "The homemade tortillas are plainly delicious and they gave me a small side salad and lots of chips with my order of tacos to go (didn't expect it, so it was a pleasant surprise). \nObserving carefully the decor, the place could easily be the setting for a Bunuel film ;-)\nDinner was good; the price was reasonable. I'll definitely come back.", "author": "Rosa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-29", "description": "Yelp you never steer me wrong....\n\nI had a hankering for some cuisine de Mexique, but I didn't want to venture all the way to the Mission for some good eats, nor did I feel like paying $10 for a burrito. \n\nSo Yelp led me here....literally 2 blocks from my place, it's exactly what I wanted.\n\nSuper fresh Mexican food with a great salsa bar!! You can tell there are plenty of gringo/as in the area since the jalapenos/carrot salsa was picked over and was just jalapeno salsa =0)\n\nThe #3 combo is super fulfilling (cheese quesadilla, small chicken/steak burrito, chips & quac). I ate as much as i could and ate only half of it. Which was great cus it made a really yummy lunch the next day.\n\nThe staff is friendly and hospitable. I plan on making numerous stops here in the future!!", "author": "Rana A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-15", "description": "Great grilled chicken quesadillas made on FRESH tortillas.\n\nQuick, fresh, cheap, friendly and clean - all good things.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-16", "description": "I first tried Pancho's a week ago and have already been back twice since then.  On my first visit I ordered a Borracho Burrito with steak and without the salsa. (Grilled chicken or steak in a homemade Mexican BBQ sauce with black beans, rice, salsa, cheese, and guacamole in a chile tortilla.)  I liked it so much that I went back the next day and had another one, this time with a side of sour cream which nicely cut the spice of the BBQ sauce just a bit without making it completely bland. (I'm a real lightweight when it comes to spicy foods.)\n\nToday, I took my boyfriend who had a steak Borracho Burrito (with salsa) at my suggestion and absolutely loved it.  I decided to try something different and got a grilled chicken Quesadilla on corn tortillas.  Oh my god.  Their homemade corn tortillas are so delicious!  Now, this quesadilla might have disappointed some people, since it contained only grilled chicken, cheddar cheese, and jack cheese, but, given my aforementioned lightweight status, I was very happy with it.  (For those of you who can handle more heat, there's always the option of dipping it in one of the salsas from their salsa bar.)\n\nThe place is small, so it can be a bit difficult to get between the tables when it's really busy.  Also, getting to the bathroom requires one to go through the kitchen, which I always hate doing because I feel like I'm in the way of the kitchen staff.  I'm not factoring those things into my rating, just noting them here for the benefit of others.\n\nI wouldn't compare the food here to that of a taqueria in the Mission; I think they're somewhat different beasts.  I'll keep visiting my favorite place in the Mission, but I'll also be going back to Pancho's many more times. (And both Mission taquerias and Pancho's are better than Chili's.)", "author": "Katrina J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-27", "description": "One of the better mexican places on polk, the chicken soup is awesome as well as the steak and shrimp burrito. the salsa bar is also very good and they don't scrimp on those condiments or chips", "author": "N A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "The guac here is very good and the people are very friendly. Burritos are not their strength. Steak tacos are great.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-14", "description": "I dunno what the hell Mike C. is talking about the burritos being two meals in one !!!   Definitely not for me!!, let's take multiplicative inverse of that relation: I usually get *two* burritos for one meal, but that's not because they're small, rather they're tasty and I have a super speedy metabolism and massive appetite!\r\n\r\nThat said Panchos makes good burritos, not quite The Best Burrito (tm), but they're just around the corner and they're willing to work with me on extras like avacodo, which doesn't come standard. 4 stars!!", "author": "I. O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-19", "description": "I don't know why everyone is hating on Pancho's. This restaurant is GREAT! Exactly half way from my boyfriend's and my apartment, it's a great meeting spot for a Mexican dinner. When I say dinner, I mean shrimp tacos, a steak fajita burrito and two beers for under $20. Beers are $1.50 Monday-Thursday - I have not seen that anywhere in the city. Not to mention the fresh salsa bar. YUM. Perfect dinner for a entry-level PR chick and her law student boyfriend. Wave to Pancho cooking in the back!\n\nUpdate: I've stopped by recently and the food is not as good as usual. Possiby under new management? Pancho, where are you?", "author": "Defne A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-07", "description": "The tortillas are really good, as in...REALLY GOOD. Thick, yummy - definitely buy these, even if you do not get the tacos.\n\nThe veggie tacoss are good, filled with grilled veggies, topped with some cheese sauce squirted on (calling this cheese is really a stretch), but they need salsa...which brings us to the not so good: the salsas are bad. I took my tacos home and added Trader Joe's salsa (I know, wtf? But that's the sad reality.)\n\nEither BYOS, take your food home for the TJ's special or pick up the tacos and walk down the block to Nick's to steal their salsa off the tables.  In fact, I suggest that Pancho's staff takes a field trip so that they can taste how good salsa can be.\n\nThe guacamole was like mashed avocado with nothing added. Why? \n\nI did get some free chips, though and service with a smile, so you gotta love that.", "author": "Melissa G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-05", "description": "The following is a mostly true story.\n\nOnce upon a time, I had a cute coworker.  I would walk past her every day and smile, and she would smile back.  It was nice.  Then I found out that Pancho's was her favorite Mexican restaurant in the city, and I never spoke to her again.\n\nPancho's burritos are bland.  They contain some unsavory chicken, crusty beans, and--get ready--iceberg f***ing lettuce.  That's not right.  Plus, it'll cost you $2 more than it would at a Mission taqueria.  \n\n2 stars for the nice salsa bar and really friendly service that ultimately won't be enough to win my patronage a second time.", "author": "Karin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-17", "description": "It is hard to believe that I have been going to this place for nearly 14 years! This place totally got me through college!\n\nThe best mexican on Nob hill. The food is always fresh, the salsa bar is the best in the area and the prices are really cheap. Beers are really affordable and the always have something on tap for super cheap.\n\nNot quite as good as some of the places in the mission, but for Nob hill it gets the job done.\n\nA must do for the citzens of the tendernob, Nob and Russian hill.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "I woke up crazy early and hungry on Polk St. Walked by here, peeped out the menu, but noticed they don't open till 10am. I walked around for a half hour searching for a spot to get a breakfast burrito. I saw a few restaurants that had the item on the menu, but I wanted a real Mexican joint type greasy ass chorizo potato deal. i stuck it out an extra hour and walked in at 10am. It was stellar. Each burrito comes with a nice size side of freshly fried tortilla chips and the salsa bar is well maintained and clean. \n\nCame back a few days later and asked the register gal what was the best burrito. She suggested the carnitas and it did not disappoint. Not the best one I've ever had, but very good. I always hold the rice with burritos, and even without that waste of a filler, it was huge. Stuffed with pork, beans, cheese, lettuce, tomato. Bomb. I really liked the salsa verde and medium red salsa too.", "author": "John L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-08", "description": "A lovely dinner any night of the week. Bean rice and cheese burrito with their amazing spicy chili. I am drooling. And nachos. I rarely ordered anything different and have never found chili like theirs. hop skip and a jump from the apt. did not hurt either. Other than the chili, it's not something spectacular, but if I was hungry I would definitely go in. The special chili (salsa) is hot unless you like spicy foods.", "author": "Lenore F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-27", "description": "Meh....I've had better indeed.\n\nI cannot tell you how ecstatic I was to bring my super chicken burrito home the other day after walking 5 miles home from the Sunset. The \"chicken\" burrito was half filled with steak which was way over cooked and extremely hard to chew. The thing was 60% black beans, 30% meat, 5% sour cream and 5% shredded cheese. Needless to say it left much to be desired and I don't foresee going back any time soon. Though one redeeming quality is their salsa bar. I love options....especially when it comes to hot, hotter and really F*ing hot salsa. \n\nPerhaps a good spot after late night drinking on Polk and Escape from NY Pizza is too far of a walk.", "author": "Kristy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-21", "description": "Probably the best mexican food I've had in a long time. The corn salad was great. The tamales just like mom used to make. The beans and rice were awesome. Great service. Super friendly and attentive. The reason I didn't give it better marks was spotting a roach scurrying along the wall the last time I was here. I guess it is a restaurant but I'd hope mgmt would spray on occasion...", "author": "Timoteo K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-25", "description": "You have to take Pancho's for what it is: a good place to get decent mexican on the cheap and quick. If you have a little more time and money, you should walk a few more blocks down Polk to Nick's Crispy Tacos. If not, Pancho's will do.\n\nI recommend the carnitas tacos, the chicken enchilada (especially with green sauce), and the atomic burrito. All quite tasty.\nYou get a free bag of tortilla chips that are warm, tasty, and go well with the salsa bar.\n\nFinally (and importantly), their beer is cheap.", "author": "Nick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-14", "description": "I miss Pancho's.  Every time I'm back in the neighborhood I try to make it in for a burrito.  I love that they give you chips and don't charge for them like some other taco places that I will not mention.   I love how fresh the salsa bar is, that they'll let you customize your burrito a million different ways with a smile, and I love their completely random decorations.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-15", "description": "NEVER AGAIN. \n\nI came in here at 1pm on a Sunday, hoping to find a new burrito place. What a huge mistake. \nFirst off, the line was very long and the restaurant understaffed, the cashier was also putting together orders and bussing tables. But that wasn't a huge deal to me, it gave me time to look at the menu, and I was very excited about going back to try lots of the items. \nI wasn't surprised by the long wait to get my to-go bean and rice burrito.. Until I realized that numbers ahead of mine were being called. And not only that, people that  had arrived after me were already finished EATING their meals. I went to the front to ask and they said that they had lost my ticket but would get right on it. Now, I work in customer service, I know, shit happens, whatever. By this time it was about 2pm and I was kind of annoyed that my super quick trip got so dragged out, but I just wanted to get home and eat. \nUnfortunately, when I got home I discovered that my order was messed up, and the burrito had NOTHING on it besides beans and rice, even though the menu clearly states lettuce, salsa, cheese, whatever.\nSo now I was pissed off. I walked back down to the restaurant and asked for a refund as calmly as I could, and they tell me that it's not possible. NOT POSSIBLE? If I don't eat your food, how is a refund not possible?? They offered me another burrito done right this time, and even though I was angry I decided to take it because I'm still fucking hungry. It is now 3pm and I'm finally sitting down to eat this damn burrito.\n\nIt is not delicious at all, even chipotle could do better, seriously.\n\nThe best advice that I can give after this painfully long, unsatisfying experience is for you to go to Nicks. It's right down the street if you're already in the area, and there's a much higher chance that you'll actually get what you order. And then enjoy eating it. This place is not worth your time whatsoever.", "author": "Elisabeth G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-18", "description": "Eh probably deducted a star because they forgot my family's order. The food was decent, but I definitely had better Mexican food (spoiled by San Jose/Mission).", "author": "Tif L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-21", "description": "Four stars for a simple reason:  I think this is the only restaurant in SF that has received a public endorsement from Julio Iglesias!  \n\nFor those who don't know, there's a autographed headshot of Julio hanging on the wall (in between fake fish, lassos, and neon signs) which reads:  \"Pancho - Amor los burritos\"  /s/ Julio Iglesias.\n\nThat pic always makes me smile.  Oh, and the food's not that bad either.  Steak fajita burrito and the steak torta are classics.  Fish tacos are also solid.  I can't speak for the rest of the menu, as I am a man of routine...much like Julio Iglesias?", "author": "Robson S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-29", "description": "Outside the Mission, \nGreat Mexi is hard to find, \nTamale Grande!", "author": "Brian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-10", "description": "Imagine a scene out of Goldilocks and the 3 bears...but maybe instead of taking place at a home in the woods, it's on some urban street in San Francisco. And maybe instead of the protagonist having long soft golden locks, let's just say she has dark uncontrolled curly hair. We'll call her Curlyfro. \n\nSo it's 11 p.m. and Curlyfro's stomach is growling! On the long drawn-out quest to find food, her search leads her and her cohorts to Pancho's. Why, what could better suit the need for post happy-hour munchies than good old-fashioned (fine, just good Americanized) Mexican food. \n\nLooking at the menu, Curlyfro is recommended the chicken tacos. She thinks to herself, \"Psh! Why those won't fill me up! That's not enough to satiate my appetite!\" Dissatisfied with that option, her head turns to the section entitled \"Burritos\". But just the thought of a huge one-pound burrito begins to scare Curlyfro - her appetite has begun to wane from where it was an hour earlier when the search for nourishment began. Her stomach may not be able to handle something as powerful as a burrito.\n\nBut lo and behold, Pancho's does not disappoint Curlyfro. A look to the bottom of menu brought Curlyfro to tears. \"What - a SMALL burrito??? Can this be for real??? Is my intoxicated state fooling me???\" See, a small burrito is not quite as heavy and large as an actual burrito, but still resembles a burrito in every sense; meaning that Curlyfro could eat the entire thing without wasting any food (waste is bad kids), and yet wouldn't feel her stomach exploding and regret her decision later than evening. \n\nCurlyfro found the perfect balance. She was happy. It was a good night.", "author": "Dalia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-05", "description": "Love this place! Their corn tortillas are homemade which is a huge plus!! We also got a couple burritos which were delicious. The resto was very clean too. Will be back!", "author": "Lindsay D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-10", "description": "What am I doing in Nob Hill hunting for a good burrito joint? Very counter-intuative, no? There's a reason they're called Mission-style burritos. \n\nSF taqueria geography lessons aside, I had just picked up two very hungry out-of-town friends in Russian Hill, & Polk St just so happened to the the closest restaurant thoroughfare on the way to our destination. It was decided that Mexican food was the cuisine of choice, & Pancho's hit the spot well enough.\n\nIt was about 1pm, & my deal with them was that the place in question had to have a yummy-sounding breakfast burrito, which of course, Pancho's did. And it didn't blow my mind, but it also didn't disappoint.\n\nI wouldn't make any kind of special effort to come back, but if you live in  or near Nob Hill & this is your local taqueria, you're not in bad shape.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-07", "description": "this place is close to my apartment, but it seems like whenever i come here, i leave regretting i did so.\n\nThe vegetarian burrito is too soft, not very flavorful, tortilla isn't crisp enough, overwhelmed by the beans, etc.\n\nOften it takes a really long time to get my food.  \n\ni guess my favorite part is that the salsa bar is pretty good.", "author": "Dustin E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-02", "description": "Pancho's is good for one thing and one thing only:  the Borracho burrito.  I've tried their tostadas, quesadillas, tacos, even their torta (I'm usually a huge torta fan wherever I go) but none of them is that good.  They're not bad, but you can't call them good either.  They're just \"eh.\"\n\nThe Borracho burrito though is awesome.  They put this so-called barbeque sauce in it, which mixes in perfectly with the black beans and rice to create a kind of gooey, oozy mound of deliciousness surrounded by the meat (I recommend carne asada over the chicken, but you can request carnitas too), cheese, and guacamole.  And the best part about it all is that they wrap it in a \"Chile tortilla\" which tastes incredible, and never comes unfolded, gets torn, or otherwise let you down and make a mess while you're eating.\n\nAs a testament to how good this burrito is, I went on a Pancho's binge a few months ago and ate at least 3 Borracho burritos a week for dinner for about a month.  I'm not joking, I would come home, sit on my couch, try to resist the craving, and end up going to Pancho's to get it.  I even tried eating terrible Trader Joe's frozen burritos for lunch to rid me of my burrito appetite for dinner, and that didn't work.  Finally it was the fact that I'd gained 5 pounds that made me think twice about basing a large part of my nutritional intake on the Borracho burrito.  If it weren't for my complex about a pre-mature coronary episode or my desire to attract the opposite sex, I'd still be on that binge.", "author": "David G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-23", "description": "Solid Mexican joint on Polk street. Fajita burrito is pretty tasty, and their salsas are definitely good. Not as good as say, the little chihuahua, but it definitely holds its own. Also, given its proximity to me, it is a great option for a quick bite\n\nbased on the yelp reviews, I think i need to try the borracho burrito", "author": "VL K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-27", "description": "We just happened into Pancho's while wandering around the Polk Street Blues Festival and were delighted to find yet ANOTHER great Mexican food joint! All I can say is neither my wife nor I had ever encountered a better homemade corn tortilla. They are sublime. You may think it odd to get so worked up over a tortilla but YOU JUST DON'T UNDERSTAND!!!! A good tortilla is worth its weight in cornmeal.\nHonestly, though, the ingredients were garden fresh and everything is made by hand on the premises. The prices were very reasonable and the portions generous, what's to keep it from rating 5 stars? Nothin'! We enjoyed the place and bet you will too. Check it out!\n(I had the steak tacos which were topped with fresh guacamole and wrapped with insanely frseh and tasty tortillas. Served with rice and beans (fresh, fresh, fresh). My wife had the grilled chicken quesadillas with a rice and bean burrito... she loved 'em but couldn't finish the burrito... fortunately, I was there to bail her out.)", "author": "Philip F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-20", "description": "Their burritos are fresh and fantastic - the steak burrito is surprisingly light and balanced (for a burrito), and my cheese quesadilla was awesome.  The handmade tortilla totally rocked my little world.\n\nThe decor is very casual and fairly quirky.  It's a good place to go with friends for chillaxin'.", "author": "Cat W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-05", "description": "This is my go-to place to satisfy my Mexican cravings, not because it's anything special, but it's the only decent Mexican joint in the neighborhood. The food is good but not outstanding, and the service is inconsistent, depending on who happens to be working. \n\nIngredients are always fresh and the salsa bar is great, but I'm always a little disappointed by the under-salted and overly greasy chips. I usually order the veggie burrito which is pretty good and predictable, or the veggie tostada which is yummy, but they never put enough veggies in it. The staff are all very sweet, but they have a track record of messing up something in my order about 50% of the time.", "author": "Emilie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-12", "description": "This is a really good Mexican place considering how cheap it is.  I have been coming here for a while and their al pastor is really delicious.   I have always had a good experience here except for tonight.  It was so bad that I must give it 3 stars.  There is a new lady that works at the register (the youngish white lady, I think she is new).  We asked for 2 tostadas (which include sour cream).  When they came out, only one had sour cream.  We asked her for sour cream for the one that was missing it.  She asked to see our receipt. When we showed her, she said she said that they had probably put the sour cream on the other tostada.  What?!?!  She said of we wanted extra sour cream, we had to pay $0.50.  We pointed to show that there was no sour cream that is included.  She kept on arguing that we needed to pay $0.50 extra.  A really nice woman that worked in the kitchen came out because she heard us arguing, heard the issue, apologized and brought out the sour cream.  Meanwhile, the cash register  lady kept on being extremely rude and arguing.", "author": "Dulce F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-16", "description": "SD style burritos are to have no more than (or less than) three ingredients: carne asada, pico de gallo, and guacamole.  Seems simple enough, right?  What's not one of the ingredients in an SD style burrito?  Curry.  The damned carne asada tasted like it should be wrapped in naan instead of a tortilla.  I have no idea if the guac or pico de gallo were any good.  t don't care if you make it with hormone free this, or organic that, it's an SD style burrito I'm looking for.  Not an SD style shwarma.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-14", "description": "I have been totally ripped off!!!!!!!!!!!!\n\nThe grilled steak burrito should been renamed the \"vegetarian burrito\". Burrito includes plenty of beans, rice, sour cream, tortilla  (everything cheap - filler) except the meat!\n\nSAVE YOUR HARD EARNED $6.39 - GO SOMEWHERE ELSE.", "author": "Herman S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-03", "description": "I live right by this joint so I've eaten here plenty of times. It's not bad but nothing outstanding; it's very convenient. The servers are friendly the salsa bar is good so it gets 4 stars from me.", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-06", "description": "I really like to salsa bar but the Borracho sauce was so good I drank it. I don't know if all Borracho sauces are this good.", "author": "Bebe L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-23", "description": "Such a mixed review list already for poor Pancho's.\n\nI enjoyed this place.  I usually got the same thing:  chicken tamales.\n\nNever was disappointed but it is a bit pricey for what you get.\n\nReally the only decent mexican joint in Polk area.", "author": "Diego S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-01", "description": "Pancho's = Not a Mission taqueria, it isn't that great, but if you're in the mood for a burrito, quickly, and you're in the Marina or Nob Hill, this isn't a bad alternative.  The burritos are alright, try the atomic burrito, it's smothered and is actually pretty good with the red sauce.\n\nI think the problem with Pancho's is that they don't put much flavor in their meat, so everything you get doesn't have much flavor.  The salsas are generally tasty but aren't quite up to par with some of the better taquerias in the Mission.\n\nI guess not every place can be Farolito or Cancun in my book, so maybe I'm just spoiled...", "author": "Craig E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-12", "description": "I get that when ordering grub at an \"ethnic\" restaurant, there is a high chance of your order getting screwed up because something was lost in translation. But when the waiter brings our plates (we both had grilled mahi mahi tacos) and asks who had the one with no cheese, and places 2 identical dishes in front of us (both WITH cheese), there was no miscommunication - just a dumbass waiter. He realized his mistake, left the food on the table, and went back to his other orders, completely disregarding the cheesy mishap. Ummm... my friend is lactose intolerant! It took so long to get the tacos in the first place, she just ate them (con queso) and got a stomach ache (which, I suppose is her fault, but I still hold dumbass waiter responsible).\n\nThe tacos really weren't that impressive anyway. 1 star for the tub of guac.", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-13", "description": "Man, was just about to pop on here and give Pancho's a happy 5 stars, but the last time I ate there, and tried the Steak Fajita Burrito, I was pretty disappointed.   Meat was dry, and tasteless.  Well, I take that back, it did have a taste, and that was an overwhelming amount of pepper.  I much prefer juicy, steak marinated overnight in Carne Asada seasonings.\n\nOtherwise though, I've had a lot of great experiences here, the chips and salsa, surprisingly enough, are the best reason to stop here.  Usually the people behind the counter do not hesitate to hook you up with a few baskets of deliciously, oil-covered, and warmed chips, and they always keep the salsa bar freshly stocked.\n\nEverything else I've eaten here, aside from the Fajita Burrito, has been great.  Steak Fajitas on fresh tortilla's, Vege Burrito (who knew squash would be so good!,) Nacho's, all good!\n\nProbably some of the better, more authentic-sided Mexican you can find outside of the Mission.", "author": "Tyler D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-21", "description": "I tried Pancho's for the first time today, and it will be my last. Had a chicken burrito and I was not impressed at all... dry, barely warm, and too salty. The chips were not very good either. With all the good burrito shops in SF, there is no reason to settle for this one.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-19", "description": "I frequent Pancho's far too often, as it is the only Mexican place I have found near me. Not as authentic as the stuff in the Mission, but good and fresh.\n\nI usually get the #1: two chicken tacos, rice & beans. I love the chicken tacos. The tortillas are made fresh to order, and they are generous with the fixins. I generally pass on the rice, but the beans are yummy. The chips are also good.\n\nSalsas...yum! I usually go for the more mild pico de gallo (which still has a good kick to it for a mild sauce) and the HOT tomatillo sauce. I like dipping my burritos and tacos in the hot stuff.\n\nThe new salad they introduced is good if you are going that way. Nothing special, but the dressing is good and they give you just the right amount.\n\nThe TORTILLA SOUP is the bomb. It is tomato based, garlicky, and yummy. They make it fresh to order, so be prepared to wait for a bit. The pollo soup is also good, especially on a cold day. It comes with a tortilla or two, freshly made.\n\nNachos are good, as well. The chips are a little thin to hold all the stuff they put on them, so make sure to have a fork handy.\n\nI have tried most of the stuff on the menu, and it is all pretty good. Wow, I spend way to much time there!!", "author": "Annie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-01", "description": "It hits the spot - not bad - not amazing like some of the spots in the mission. I tried one carnitas and one chicken taco HOLD THE CHEESE. They forgot that part...Alas. The homemade tortillas were the best part. If you need a mexican fix and the line at nick's is too long, this could do the trick.", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-02", "description": "I've been to Pancho's numerous times; I've eaten in and taken out. They get kudos for consistency, but the food is just OK. This place wins two stars for its proximity to my living quarters. The other star for fast service and good chips. \n\nThe burritos are just OK. I can't put my finger on it, but something is missing. I've sampled the fajitas as well and found them to be underwhelming. \n\nCould someone please open a GOOD burrito place on Polk, preferably close to my apartment? Thanks!", "author": "Lara L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-04", "description": "I've only had their burritos so the stars are mainly for the burritos. And I'm not saying the burritos taste bad either, because it doesn't really taste like anything. It's so BLAND!! WHY!? ...meat? ...beans? ...lettuce?? ...pico de gallo?? ...guacamole?? ...sour cream??? Why aren't my taste buds reacting? If you're gonna get a burrito from them, just get the cheapest one becaue it's gonna (not) taste the same anyway. And I also think it's pricey for the size too.\n\nMaybe they're trying to tell us that American burritos have too much stuff inside and it's clashing with each other?? But then why not just take all the extras out and make it an authentic meat burrito?\n\nThe tortilla is too dry, or too thick? Because my tongue and the insides of my mouth end up like towel. Oh and so were their limes.\n\nI guess they're trying to compensate for the lack of taste by prettifying the interior, and I personally like their tacky walls with little paintings and pictures and what not, but again I see a lack of taste in them too.\n\nBut I will go  back because this is the only taqueria around. *sigh*", "author": "Seaweed F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-02", "description": "Well, it's better than Taco Bell, which is really one way to consider Pancho's.\n\nNo, it's far from the best Mexican/taqueria you'll ever find...the menu's a bit thin, the tortillas have a kind of different/funky taste to 'em, and the prices are a touch higher than what you should probably be paying. \n\nStill, I'd rather see this than some jive-ass chain...and it fits in really with the scope of Polk Street's diversity.", "author": "Derek R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-21", "description": "Pancho's is good when I don't feel like trekking to the Mission for a fantastic taco or burrito. It's not the best in town but, it's pretty darn good.\n\nI love the salsa bar. Nice touch with 6 different ones to choose from.\n\nThe chicken soup can't be beat. It is a cure-all. Whenever I'm feeling sick I am off to Pancho's to pick this up.\n\nThe service is always friendly. \n\nNot much more to say. I'll be back.", "author": "J B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-22", "description": "Another biting the dust? Sign o' the time? C'mon! This used to be my fave Mex taqueria in the City. Took a long hiatus. Went today. It's gone down the tubes -  but still salvagable. Here's why: - salsas used to be thick, now they're way too watered down (this place is known for its salsa bar); the burritto was loose, not tight , the ingredients were not as fresh as in the past. I still say \"Try it!\" it wont hurt, but it's not the best anymore...sigh...well, next week I'll try my other Mex fave, and hopefully, I'll find it still a fresh yummy burritto that slam dunks my day!", "author": "Meg D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-20", "description": "Eh, I had to bring Pancho down a star. Last night, I had a pretty weak burrito. Not only that, for some reason, the burrito chefs placed a single chunk of cheese in the middle of the burrito. it wasn't even melted. Really strange. I don't think the burrito typically comes with cheese. But, that really didn't bother me. I'm all for chunks of cheese. Yet, the steak was extremely dry. Everything wasn't very well mixed into the burrito. The rice was really dry too. \n\nOn top of all that, when I asked for some chips along with the order, the girl at the register asked if I wanted small or large. I paused to think and she recommended I go with the small because she'll put a lot of chips in the bag. I thought, Ok! When we got our order, the bag of chips had, well, a small amount of chips. I would have gone for the large! \n\nI'll probably still go back though. It's in walking distance, their chips are great, their salsas are awesome and the burritos are generally great. \n\nOh, I don't recommend the Chile tortilla for your burrito. It wasn't as good as the normal flour one.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-04", "description": "I am very happy with Pancho's. I have eaten there several times in the past few months and have always been happy. I eat here about once a week and am never disappointed. The salsa bar is small but a nice touch. I don't know if this is authentic Mexican food but I am happy with it.", "author": "Isaac S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-28", "description": "I've been here a few times and it has been pretty good. Fast and friendly counter service as well. Try the veggie burrito. It is different but tasty.\n\nI just wish they had a rice bowl of some sort.", "author": "Stu M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-17", "description": "Its ok.  I'm glad its here for when I absolutely must have Mexican food, but nothing has struck me as super delicious.   \nOne time I found a paint chip in my beans so now I only ever get the steak Fajita burrito cause there aren't any beans in that one.  The chances of that happening again are probably slim so you could have something with beans, I'm just being cautious.", "author": "Flemm F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-04", "description": "I love this place - great salsas, atmosphere and quick service.  I eat here at least once a week for lunch and have tried everything on the menu - i love it all!", "author": "Nick G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-25", "description": "Great decor - lots to look at. Friendly fast service. Ok food.", "author": "Heart T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-22", "description": "The fajita burrito is next to godliness.  No joke.  The staff is friendly and helpful.  The restaurant is clean.  I love love love this place.  :)  One dislike....footprints on the ceiling....really?", "author": "Tiffany G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-19", "description": "The chips and salsa were good.  Steak Burrito not bad.  Nothing spectacular.  Nothing to get excited about.  Maybe I'm ordering the wrong stuff?  \n\nI probably would go back if I was walking by and starving.  Otherwise, I like Nicks better.  Sorry.", "author": "Noneya B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-30", "description": "For almost five years I used to go in here several times a week for lunch because it is close to work and fairly fast. It isn't mission mexican, but it is serviceable. Then the other day I see they are serving mole enchiladas for $8.99. So I order cheese enchiladas with the mole sauce, but the total is suddenly almost thirteen dollars. I ask why so much?\nUsually, the total is just under eleven dollars for cheese enchiladas, which are $7.99 on the regular menu, plus my drink. I expect the total to be a little more because the sign says mole enchiladas are $8.99, but still it seems pretty expensive, so I ask why so much?\nThe guy says that mole sauce is $1.50 extra. So, I point at the sign that says they are $8.99 and he says that price is for chicken only, and that if I order cheese enchiladas that it is a $1.50 extra, which makes no sense at all to me because cheese enchiladas from the regular menu are $7.99. So I'm already paying a dollar extra for mole sauce even though $8.99 is the regular price for chicken or beef enchiladas, and they are still $8.99, even with mole sauce.\nSo I ask, for clarification. He is basically trying to charge me $8.99 for $7.99 cheese enchiladas, plus $1.50 extra for mole sauce because I'm not ordering chicken? He says yes. I say no. I'm not paying extra, twice, for something that costs less on the regular menu. Especially since the advertised price for mole enchiladas is the same as the regular price for chicken or beef enchiladas. That just makes no sense at all, no matter what the extra charge might be. They don't charge extra depending on if you want red or green sauce.\nWell, way to go amigo! You just lost a customer! I'll get my mole in the mission, where it doesn't cost anything extra, but only for cheese. And my lunches? Well, there is no shortage of places to get lunch along Polk Street.", "author": "Pause P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-26", "description": "Ordered the chicken mole enchiladas dinner plate. Being that it only comes with 2, I asked for 2 more to be added to the order. The male cashier went to the back to ask what to do about this. He came back & rang it up. It wasn't until I had sat down that I realized at looking at the receipt that he had charged me a full plate price for just 2 X-tra. When confronted about the issue both he and another employee proceeded to lie that they were unable to refund or discount the price. It wasn't until they were told that I would come back the following day to speak to the management that I got a cash refund on said item. Watch your wallets at this place. On a good note the food is really good.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "All I order is the bean and cheese burrito, so I don't know if I am a qualified reviewer, but I know I love that burrito, especially with some of their green salsa drizzled on top. Its cheap, it comes with chips, and it comes out fast and fresh. my boyfriend gets the chicken burrito and loves it.", "author": "Kristen R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-31", "description": "Better tacos and burritos can be found a few blocks up the street at Nick's, but I do pop in here occasionally for the nacho plate - Pancho's Nachos (no meat, but it can be added). They make their own chips and tortillas and use grated cheese, which is nice. Their burritos taste a bit off to me so I avoid them.", "author": "Neil K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-13", "description": "It's really hard to mess up a burrito, but these guys managed to do it with the Fajita Burrito. It was full (like 50% full) of sticky white rice, the chicken wasn't seasoned at all and we had to drown the thing in salsa just to create any kind of real taste. The rice overload made the thing really heavy and two of us felt like we had a baseball-sized lump sitting in our stomaches for hours afterward.", "author": "Austin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-03", "description": "Cute cute cute inside--I love all the Mexican tackiness! The people are always friendly too.\n\nI pretty much ALWAYS order the Sopa de Pollo (chicken soup for those of you who live under a rock and can't translate it yourself), which is full of chunky veggies, lean chicken, and is accompanied by one of the Pancho's warm, handmade, thick corn tortillas (which are pretty much worth a trip to Pancho's themselves). They even put avocado on top: GENIUS. I would certainly never think to put avocado on/in soup, but it complements it perfectly. It's healthy and cheap, and unfailingly delicious! And the free chips & salsa bar are a yummy plus.\n\nHowever, the one time that I strayed from my reliable soup, and got the mahi mahi tacos with avocado salsa, I was horrified to discover my mahi mahi with cheese melted on top. Ew. Not genius, and not tasty. But people seem to love the burritos, sopes, chicken mole, quesadillas, etc, so maybe I'll go out on a limb again one of these days...", "author": "SM A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-16", "description": "Absolutely, the very BEST taqueria in San Francisco and the very first to have a \"salsa\" bar! Back in 1973, the first taqueria in town opened up on Mission street, near 25th and was aptly called \"La Taqueria.\"   Right now, there must be over 100 taquerias in San Francisco (half of them in the Mission district) and I have tried many of them.. Most of them are pretty good, but none come anywhere near Pancho's. Their fresh, hand-made tortillas (and chips) are better than anything you can get in the country side of old Mexico (forget about Mexico City, the \"nixtamal\" -grounded corn- from where the tortillas and chips are made is regulated by the government and contains not only corn grain, but the cob and the husk!!!)..San Francisco is very blessed to have this place", "author": "Victor M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-23", "description": "The service is great - they're always really nice. I get carnitas tacos and I have to say, the meat is so much better here than at Nick's - lean and flavorful, falls apart but maintains its texture, in general perfect pork...and I am a pork fiend. The salsas are unlimited and really good. The tortillas are delicious too. I give five stars because going here makes me feel good all over.", "author": "lauren c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-26", "description": "I've been coming here for years - it's part of my hood.  The food is pretty good - certainly the most 'authentic' Mexican food you'll find on Polk Street.  If you want cheaper and/or better - go to the Mission.  Chicken soup is great.  Soft taco dinner is very good with genreous portions.  Salsa bar and chips are an added value.", "author": "R F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-20", "description": "Three of us ate here. My wife thought her steak burrito was just ok--a 3. My daughter felt the same about her burrito. However, she/we felt the chips and salsa were great--fresh, crispy, and tasty. I had the \"special\" chipoltle tacos and they were just amazing--a 5+. This item you will not find on the menu, but if a special, gobble it up!!  Oh, we also had the nachos--very average--nothing special at all.", "author": "Vincent N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-04", "description": "Love me some good Mexican... this place was alright. I like the  nachos.", "author": "Marla Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-11", "description": "Panchos ROCKS. It hits the spot every time.. well, to be honest, I have only had the Bronco Burrito about a thousand times...  its this BBQ burrito that is soooo good that I haven't gotten myself to try anything else yet. But my boyfriend always eats different things there and never complains. mmmm", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-30", "description": "I ordered a shrimp burrito which was good. The food came with one basket of chips which costs $1.70 to refill. The drink was free refills. They have a salsa bar with little 2-3 inch plastic containers to put salsa in. The salsa bar had red sauce, green sauce, pico de gallo, pickled jalapenos, beets, and onions with cilantro. Good for cheap food.", "author": "Sholom J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-13", "description": "Perhaps it's not the most \"authentic\" taqueria in the City, but damn if they don't make a good burrito in the form of the Borracho burrito! Clean, quick service, and a convenient location on Polk Street. Used to go here all the time when I lived in SF, and made it my first stop when I was back in town. Burritos just aren't as good in Austin (although the other Tex-Mex certainly is).", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-02", "description": "I eat here at least twice a week. The chicken tacos are great. The guacamole is good. Carnitas awesome. The salsa is always fresh and free. Nice selection of beer on tap and one is always at a special price($2 Dos Equis, Tecate, Anchor Steam and Sierra Nevada). Nice people too! The food is cheap and good. Ask for free chips.", "author": "Tom D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-31", "description": "Ugh....  I went here a couple of times and found it to be weak at best but I kept coming back hoping for something to cling to 'cause I live in Nob Hill.  And so I go in one day and get a carnitas burrito and, I shit you not, it tasted just like Vick's Vapo-Rub.  I understand that everybody has their own interpretation of a burrito, but nobody wants a medicinal petroleum paste stinging their eyes whilst they eat it.  One star for effort.  If you are going to have a crappy mexican place you may as well as take the kiss of death and serve queso dip.  Walk up to Van Ness and hop the 49 to the Mission if you don't want to throw most of your burrito away.  Its worth the trip.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-03", "description": "it was friday night and even tho i went grocery shopping a couple days ago, nothing beats going out for some mexican food.  my roomy and i being new to the area of Polk St for 5 weeks now, wanted to check out the mexican flavor.\n\nlemme tell ya that the mexican vibe in this neighborhood is not as rich as, say the mission district.  nevertheless we checked yelp and found pancho reviews to be satisfying, yet not stellar.  and that's my conclusion.\n\ni had the borracho burrito and wasn't too fond of the sweetness coming from the bbq sauce.  it was quite overpowering at times.  the steak was good and juicy, the salsa was mediocre.  i think someone was right when they said the tomatoes came from a can. YUCK.  \n\nGrabbed a Corona (oh how cute! they had these lime slices with mexico's flag toothpicked on. SO cute!) and a small order of tortilla chips (thin and crispy) and my burrito as well for $10.00  the price range sounds just about right for what i got.  whoopah!", "author": "Janina U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-03-10", "description": "Health Dept!!!  I ordered the battered fish tacos.  Before I started eating I noticed dark chunks in the batter.  I tore a couple of these chunks off and found that they were hunks of charred, black, burnt  food from the grill.  I'm not even sure what that stuff was really.  Also, I will never know how that stuff got into the battered fish which never sees the grill.  Disgusting.  I wish I could give no stars.  At least I got my money back.", "author": "CAKE E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-19", "description": "Pancho's clearly means mediocre en espanol...", "author": "Brian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-28", "description": "OMG, this place is awesome. I live around the corner, but I never went in. I had a steak burrito as well as some nachos, and they were both fabulous. I am picky when it comes to Mexican food, since I hate Cilantro. They got it 100% right - no cilantro-loaded salsa or cilantro flakes in any of my food. Now I'm totally stuffed and am going to take a nap.", "author": "Maren P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-09", "description": "Where are these 5-star reviews coming from?   Have you actually eaten the food or just photographed it with your camera-enabled-phone?  After a long wait for this chicken burritto, I find it to be pouring out grease.  I can deal with some grease (aka vitamin G), but it tasted nasty.   The chicken was all charred and burnt, rice was dry, and was falling apart everywhere.  I consider myself wise in the way of mexican eats, and this place should be avoided at all costs.   Even the chips suck.. maybe the salsa is decent, so pour yourself a glass of salsa and enjoy.    This was not one occation either, food was bad many times.", "author": "Dan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-27", "description": "What can I say...Nick's was closed so we went here instead for lunch.  It was actually good.  Their tortillas are handmade which really added to their tacos.  The carnitas were good too...no weird fatty pieces.  I would definitely come back BUT only if Nick's were closed ONLY because it's farther away from my house.", "author": "Kirsten M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-01", "description": "My default taqueria spot in the neighborhood. I went astray for awhile, thinking they had lost their edge to Nick's down the street, but I think they've stepped up their game as far as flavor and menu variety is concerned, so I'm back. Had an awesome mushroom quesadilla my most recent visit, and I'm a fan of their Atomic burritos (massive burrito smothered in a spicy red sauce and cheese). Ingredients are really fresh, and they maintain their salsa bar like nobody else. Nice staff. Cool Mexican posters, advertisements and art all over the walls and ceiling. Clean restaurant. Always have gotten good comments from folks I've taken here. Cold pitchers of beer! Jalepeño poppers! Good stuff. Try it.", "author": "Barbara K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-23", "description": "I used to work right next to this place.  For some reason that spot has burrito mojo.  It used to be called Percy's, a burger joint.  They made the best burrito's in the area, even though it wasnt even on the menu.  The burgers were honest, nothing special, just the way i like it.  Pancho's has the best chicken taquitos ever.  You have to eat them there cause the togo box kinda steams em.  Never had the sickly overfull typical post taqueria syndrome, wierd.  The salsa bar is a dream come true for salsa purists.  Remember its all about the combos.  My favorite is the more watery tomato salsa mixed with the chunky tomato one. They have all kinds.  They must hate me cause I reap it.  They even give me an extra large salsa container because I use like ten of the normal ones.  Oh yeah and Bobs is right next door.", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-28", "description": "Shrimp atomic burrito (covered in red sauce and cheese). Hungry yet? While this isn't the kind of Burrito you'd expect from the Mission, it's as 'authentic' as Nob Hill can get. Prob best place to grab a quick bit of Mexican in the surrounding area.", "author": "Navid N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-16", "description": "They have a salsa bar which earns one star on it's own.  Specials that you actually want to try and a regular menu that has all the goods: tacos, enchiladas, burritos.  Friendly service, too.", "author": "T-Bone L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-30", "description": "Synopsis:\nThe decor is interesting and the food is pretty good. They upped the prices and for that reason, one less star.\n\nThe Scene:\nPancho's is basically covered with license plates, plaques, photographs, and other paraphernalia from Mexico. It borders on tacky but as soon as your eyes adjust it doesn't look too bad. With so much going on, there's always something to look at.\n\nThe Food:\nThe Chicken Quesadillas are really good, especially with the homemade corn tortillas. Those things are delicious. The enchilladas are also really good. I would recommend asking them to put the mole sauce instead of the normal sauces because its really good. It's not on the menu, but if you ask, they will do it for you. Make sure that after you pay for your order you ask for tortilla chips. They will give them to you for free. The salsa bar is somewhat limited, but it does the job. Order time is pretty short. The food here tastes best fresh, so I don't fully recommend take-out. I once took some food to go and when I got home the sauces mixed, the tortillas mushed, and it really lost all its magic. Eat there and enjoy the atmosphere.\n\nThe Best Part:\nThe Homemade Corn Tortilla", "author": "Franc S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "I've always been very happy with this location. Good, solid burritos, quick & friendly service, fabulous salsa bar and nice warm, thin chips. Mmm... I once ordered the carnitas tacos here with absolutely wonderful results, too. Highly recommended.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-24", "description": "I love this place.  Great burritos, awesome fresh salsa bar, nice folks.  Get the Borracho burrito with steak - my top choice.  Or the Fajita burrito.  They have $1 beers once in a while too.", "author": "Ben K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-22", "description": "I really like Pancho's.  I used to live around the corner so I was a regular, but their Chicken Fajita burrito is really tasty and really filling.  They have an excellent salsa bar with hot peppers, several kinds of salsa, and the like.  They include lots of chips with any order, and the food all around is just top notch.  They generally have some sort of special of the day.  Pancho's is a tad expensive, it'll set you back like 8 bucks, and the Mission clearly has superior burritos, but that said, this place is really good.  It would put most cities burritos to shame.", "author": "Jim D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-31", "description": "what i ate:\n\nwhole wheat tortilla, beans, rice (with no chicken broth), house-made salsa, onions, the good thin house-fried chips, $4. \n\nno complaints. perky girl with dimples working the register. she was awesome.", "author": "Sunny Joy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-02", "description": "Mmmmm, their homemade sopa de pollo (hearty chicken, vegetables, and broth) and tortilla soup are the best things since sliced bread!  My mouth is watering just thinking about them.", "author": "Maya G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-29", "description": "I work in the area and i must admit this place isnt the best place to get mexican food. They charge a higher price for lower quantity/quality. And the name plenty of us get mistaken for Pancho Villa.", "author": "Frank M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-09", "description": "I'm sure this place doesn't compete with Mexican food in the Mission, but it kicks the crap out of Nick's which seems to always screw my order up.  Has pretty good prices, friendly staff, and is just close enough that I can walk to it drunk!", "author": "simon r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-29", "description": "Ay, mi Panchito's, cómo te quiero!", "author": "Rafa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-02", "description": "I'll repeat what others have said.  Baraccho Burito.  Get it.  Trust me.", "author": "Brett J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-07", "description": "Panchos is very close to my home and hence my husband and I frequent it often.  If this restaurant were in any other state, it would be a 5-star Mexican establishment.  Here in SF, with all the great Mexican food, I give it a solid 4-stars.  The food is fresh and consistently delicious.  Try the atomic burrito; it is a lot less spicy than advertised and exceptionally tasty.  Evertyhing is great.", "author": "Abby T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-03", "description": "Sorry, Carlos. I used to really like this place, but it's since gone waaay down hill. I just ate there on Halloween, and  man, this was a real disappointment. Chicken enchilada platter: beans were like little rabbit turds! Hard and rolling around everywhere! Rice was bland! Chicken was just in a big lump stuffed inside the tortilla! The only thing good was that the staff are extremely friendly. I think I can make a better burrito at home, even if my only Latina heritage is from living close to TJ.", "author": "eliz s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-20", "description": "a co-worker took me here the other day because i was sick and she said they had good chicken soup...boy was she right!! i've been back twice for the soup and have a craving for it all the time. it's like grandma used to make only with avocado slices on top and cilantro. SUPER TASTY. also, their black bean salad is really yummy. if you're looking for a lightish lunch at a mexican restaurant (generally somewhat hard), get a cup of the soup and a side of the bean salad and you'll feel like a million bucks.", "author": "Cristabel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-15", "description": "I'll start by saying that the service here is really good. I've been about a half dozen times and they've been friendly and fast each time.\n\nThe burritos are really good but the chips taste a little funny. It makes me wonder how often they change out the cooking oil. The salsa bar is always a plus so points for that.", "author": "Yelper S F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-26", "description": "ok, update.  their burritos are fairly good.  inconsistent, but i find myself craving a chicken burrito from there every now and then.  the hot sauce at the salsa bar is quite tasty.\n\nalso, the phone in order finally worked the way its suppose to.  good job panchos.  \n\nresult: bonus star.  maybe a star and a half.\n\n*************\nBurritos are not very good here.  The salsa bar is pretty good though.\n\nAlso what i really don't like is that if you place a phone order, they don't start making it until you come in... which equals more waiting.  That's annoying.  It would be very nice if I call in my order, and by the time i get there, i can just pay for it and leave.\n\nDespite all this, you'll still find me here from time-to-time... I need my Mexican food fix!!", "author": "shaun l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-31", "description": "Pancho's is perfectly adequate when I am too lazy to venture to a better, but further away taqueria. When I ask for avocado in my burrito they are generous with it, even though I sometimes have to eat 1/3 of the way through my burrito to hit a giant avocado pocket.  Chips are pretty decent. There are better places for Mexican around town, but if you are in Nob Hill and craving Mexican, Pancho's satisfies.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-18", "description": "after a four-hour bike ride over the golden gate to fairfax and back, a guy could really got for a delicious breakfast burrito to replenish some lost carbs. this is just the place for that. that was one of the larger, more delicious burritos i have had in quite some time.\n\nthis is a fairly typical mexican joint. it's a bit unlike the mission joints where you walk down the line, but they serve most of the same food. their soft drinks come in tiny wax cups, which is annoying just because i hate going up for refills. and there IS a bathroom if you need it - it's in the back of the kitchen. there's one table setup outside if the weather's nice, and plenty of seating indoors.\n\nnob hill scares me - not as much as the marina, but it's still weird to find myself there. but if i happen to be over there, i'd like to drop back in to pancho's for a regular burrito and see how that compares..", "author": "Jeremiah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-05-01", "description": "I had the best nachos I've ever had in my life last night. I haven't tried anything else here but I bet it's damn good. This is now one of my favorite Mexican food places in the city.", "author": "Monique O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-09", "description": "Chicken burritos. Salsa. Super friendly staff. 'nuff said: go there now!", "author": "Roland A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-12", "description": "Polk street options for Mexican food are slim.  Pancho's burritos are ok, the salsa bar is ok and the service is friendly.  I want to give 4 stars but the food is just so average I cant bring myself to do it.  Plus I think their prices are too high for what you get.  Better than Nick's crispy tacos down the street but for great Mexican food, one has to leave the neighborhood.", "author": "Nilu r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-26", "description": "My favorite mexican place within walking distance but I would go even if it wasn't just down the block. If you go, you should try the two taco plate with rice and beans. It is around $7, which seems like more then your used to but you get what you pay for. I like to get one steak and one chicken taco. Both are served on homemade corn tortillas, with lots of delicious guacamole (enough to dip your chips a little). The only thing, if you go with more then one person and you order together, they try and stiff you on the chips. I don't know why. They have a SALSA bar for a reason don't they? Just ask for the large basket of chips and they will usually \"upgrade\" free of charge (sometimes it is an extra $1).", "author": "Becca A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-18", "description": "i'd take a mission taqueria any day over pancho's but this is a decent option if you're on polk street and want a mexican plate. they have a good variety of options and burritos are decent, but i prefer nick's down the street if i'm craving a taco or burrito.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-16", "description": "I wish I could write a big long review of this place's menu but I can't seem to get past the plain ol' bean and rice burrito with trimmings.  I get it every time.  (Creature of habit.)   All summed up it's a good place to get a cheap Mexi-meal.", "author": "Argonaut A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-30", "description": "The food was Meh. Made me feel kinda sick afterwords. Might of given it 2 stars. but...\n\nWhat really chapped my a$$ was the fact that the guy brought my nachos out and they had chicken instead of steak. Honest mistake right? WRONG!!! I took my food back to the counter and told the cashier that my order was wrong and he said \"We ran out of steak\" What!!!  Were they just gonna try to sneak this by me? Where they too lazy to leave the kitchen and ask? I have a good friend that is allergic to poultry what then? \n\nThis was unacceptable, just come out and tell me before you make the food. I might have just ordered something else.", "author": "Dani Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-04-18", "description": "Oh my gosh, this place is so awesome!  Freshly made tortillas, great meats with their tacos and burritos, the best nachos you'll find and everything is so authentically Mexican you'll become an instant regular to this place.  The ambience is very condusive to a good dining experience and the service is excellent and very friendly.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-16", "description": "Pancho's is great for a quick lunch.  The tacos are fresh and tasty, and the salsa bar is a welcome addition while you're waiting for your food to be brought to you.  Though the food was not bad by any means, I was neither floored by authenticity nor style, and felt that much tastier tacos might be found at Nick's a short walk away.  Pancho's might make a nice spot for an afternoon snack and beer with friends, if one doesn't mind fast-food type decor.", "author": "MScott S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-28", "description": "Good cheap eats!  I wish they had more salsa selections, but the ones they have are good.  The menu is pretty expansive and the food averages around $7.  They even have beer to go with my yummy tacos.  I would say try it out!", "author": "Rise G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-05", "description": "I'm not a big fan of Mexican food of this restaurant but fresh ingredients and homemade tortillas are good.", "author": "willie l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-30", "description": "I eat at Pancho's once every six months or so. It's close, it's convenient, and about twice I year I'm bored or hungry enough to give it another try.  \n\nMaybe they've gotten better since last time, I think to myself.\n\nMy optimism is never rewarded.  Dry meat, bland salsa, 'home-style' corn tortillas that taste like carpet...  in a word, 'Meh.'  \n\nI've never actually eaten anything there that made me gag, or take the food back (although the enchiladas came close), but I'd steer clear of this place if any other burrito joint in a three mile radius is open.", "author": "Trevor G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-05-25", "description": "I had the nachos here and they were pretty good, but they were also $8.50!!!  This is Taqueria food, not the Ritz Carlton.  While watching the cooks, I noticed they were mad skimpy with the some of ingrediants in the burritos too.  It's just cheese guys, hook it up.", "author": "matthew w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-02", "description": "Great salsa options and tasty nachos with yellow and orange chips. Yumbo! Good value.", "author": "A Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-04", "description": "this place is highly underrated by most.  sure, it ain't the mission, but pretty darn good burritos this side of market.\n\ni say hells yes to pancho's chicken fajita burrito.", "author": "Joanne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-02", "description": "i love Nick's Crispy Taco's fish taco... and compare to that, Pancho's Baja Style Fish Taco is so much better. it definitely has a better flavor. perhaps it's cause of the home made corn tortillas.\n\ntry it.", "author": "Dot K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-24", "description": "This place is OK. As far as taco's are concerned, you may want to check out Nick's down the street. But Nick's is more of a gourmet type taco whereas Pancho's is more of your traditional taqueria. If you live in the area, and are in need of a taqueria, I suppose it's your best bet. There is El Super Burrito down the street, but yuck, don't go there.", "author": "M S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-10", "description": "I live in the neighborhood and come here for my Monday night burrito fix.  I always get the same thing: a chicken fajita burrito.  It's not phenomenal, but it does the trick.", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-15", "description": "This place may not be uber-authentic, but when I need a good burrito made with homemade tortillas, this is where I go!  I've had the sopa de pollo as well and it hit the spot!  Your food is made quickly and the staff is friendly.  The prices are right on.\n\nThe decor is kitsch without being annoying, but we usually take out.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-01", "description": "The best thing here is anything that contains the homemade corn tortillas.  The tacos, the quesadillas - yummy!  The tortilla is fresh and slightly thick, which adds up to delicious.  They also have the best carne asada tacos I've had in a long time: the beef is fresh, tended and lean (I hate it when you order a steak taco and get a beef-flavored lard taco instead).  I'd recommend forgoing the burritos because they're nothing to rave about... standard hole in the wall fare.\n\nAbout the atmosphere: generally I hate restaurants that have lots of \"flair\" on the walls.  But Pancho's manages to pull it all together and be more interesting than obnoxious.  My favorite is a painting of a rotund man in a dress... stylin!", "author": "Alisa N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-08", "description": "i think i would really give this place 2 stars but im just too nice!\ndefiantly not the best mexican food in sf, or the area for matter\nbut... their veggie burrito is better than nick's crispy tacos \nits actually pretty good, basically when im feeling too lazy to walk any further.\nthey are really nice and its not too expensive and its decorated really fun, you never run out of things to look at while youre eating...", "author": "cate d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-06", "description": "Middle of the road, convenient Mexican.  Right outside my place, which is a huge plus...slow takeout is a small minus.  My favorite so far is the chicken tacos, but I really just think that's because their corn tortillas are awesome.  I would give 3.5 stars if I could, because I just remembered that their chips are perfectly crispy and they have guacamole to die for (which is making me fat).", "author": "Alison P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-16", "description": "Decent burritos. The regular chicken is good. If you like BBQ, go for the Borracho.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-21", "description": "My husband and I drove into town to see our son play at a club down the street from Pancho's.  We were hungry and didn't have much time so we thought this place would fill the ticket.  We were pleasantly surprised because the food was pretty decent...not the best but we weren't expecting great.  The chips and salsa's were wonderful and if you do try this place, you have to order their homemade tortilla's....they are 5 stars.  Worth trying if you are in the area.", "author": "Shell M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-28", "description": "I had lunch here with a bunch of friends one afternoon.  The general consensus was that the food was good, but nothing to write home about.  If I was in the neighborhood and wanted a burrito, I would probably go here again....but I wouldn't go out of my way.", "author": "Luci B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-01-23", "description": "I wanted to like Pancho's, I really did.  Their combo #3 sounded right up my alley, a cheese quesadilla and a small chicken burrito with a side of guacamole, but I wasn't that impressed.  The burrito was kinda wierd, there was way too much lettuce and sour cream, and the quesadilla was only okay.  I'd give the combo three stars, but I had to knock them down a star for the flan we ordered.  I've eaten a lot of flan over the years and this was the worst flan I've ever had.  It had literally no taste at all.  Overall Panchos seemed like a nice place, but the food just didn't do it for me at all.", "author": "Rich C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-22", "description": "After a really bad experience, went back and they're way better.   Good food, friendly service.  And speedy, but still good food.", "author": "beth s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-21", "description": "Pancho's is the home of the Baracho Burrito.  If that doesn't mean anything to you, go have a try!\n\nChips are great, and free with my burrito.  There are things on the menu that aren't great.  And there is SF's best burrito.  Quesadillas are good.  Chips are good when hot, okay later.  Beer is cheap if you order off the special board.   All this without having to trek to Valencia St.?  What's not to love?\n\nIt's not Gary Danko.  But I can afford to make myself happy here everyday.", "author": "Craig R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-11", "description": "Killer salsa bar. I still think the Inner-Richmond location is better. Sorry Mark S.", "author": "bill a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "LOVE the Chicken Borracho Burrito!!  They put some sort of Mexican BBQ sauce in it that I just CRAVE.  And those Baja Fish Tacos are some of the best fish tacos in the city.  And they always keep the restaurant so clean, unlike other taquerias in town.\n\nAnd you can't go wrong with the Pancho's Happy Hour!", "author": "Mick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-05", "description": "Out of the two I've been to, this is like my favorite place to get burritos.  My boyfriend's favorite things are the atomic burrito (veggie, of course) and the green salsa.  I love the chicken taco salad and the chicken fajita burritos are amazing.  The neighborhood is sketch, but there is an amazing donut place nearby!", "author": "Olivia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-21", "description": "to many, polk street is one of the best streets in san francisco. i concur. restaurants, bars, shops, cafes. it's got it all, except a decent taqueria. and that's a big shame... panchos is probably the closest thing to a taqueria on polk, but that's not saying much. the food is just average here. it's often bland and dry. definitely can't measure up to mission taquerias or even, * gasp * baja fresh. * gasp again * wow! did he really say that? hell yeah i did. that is how disappointed i am with polk street when it comes to taqueria options, or lack there of. sad. really sad.", "author": "frisco j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-20", "description": "We just moved to the area recently, and though the burritos may not be as goods as those in the mission, this is a great substitute and it's very cheap.  The veggie burritos are great, the service is fast and friendly, and the decor is vibrant and clean.  Also, the salsa bar is a fun plus.  I'd go here if you're in the neighborhood and craving solid mexican food.", "author": "Suzanne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-03", "description": "i love this joint. there, i said it.  pancho's #1 combo (1 steak, 1 grilled chix taco) is absolutely fanfuggintastic.  the salsa bar is on point if they do bless you with tortilla chips...consider yourself lucky if you do receive golden deep fried salty gifts from the trans-fat gods!  \nmoving on...the staff are just as pleasant as the hand-made corn tortillas, they are  f'n amazing!!  why are you reading this and not eating pancho's taco(s)?  \ni can honestly say that my meals here blew Mexico DF out the water.  Granted i ate there once, but the \"chipotle\" chix tacos left much to be desired.  EAT @ PANCH'S!!  Don't be a pinche cavron!....pindejo puta!** hehehehe!!!\n\n\n**all Spanish and spelling learned in restaurant kitchens\nhow's that for opinionated?\n\n***PPS:  The burracho (sp?) is fucckking amazing!!!!  especially since there was a small sampling of a not-so-vintage strain of Trainwreck that inspired my appetite almost immediately.   This burro may have inspired my taste buds to pack up and head straight towards Kansas City...or Austin.  Guess I'll let the yelpers choose for me :)", "author": "Karl H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-01", "description": "I wouldn't recommend the tacos here, but the burritos are quite tasty.  I especially like that they sell \"small\" versions of their burritos for days when I'm feeling just a little less gluttonish.  Friendly staff and good service as well!", "author": "Sally A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-02-24", "description": "I HAD A BURRITO WITH A SMALL BLACK ROCK IN IT. I CRACKED MY TOOTH, AND THE COUNTER GUY SAID THERE ARE ALWAYS ROCKS IN THE BLACK BEANS WHEN THEY GET THEM, AND THEY TRY TO SORT THEM OUT WHEN THEY WASH THEM BUT THEY CAN'T GET THEM ALL... I AM REPORTING THIS PLACE TO THE SF HEALTH DEPT AND ASKING THAT THEY BE SHUT DOWN.", "author": "rik f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-21", "description": "The food is a bit gringo, but good quality and at a fair price.", "author": "Oleg A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-01", "description": "I'm a life long Mexican food addict but I've avoided Pancho's for the past 5 years (despite the fact that it is located one block from my apartment) primarily because it looks like a typical whitewashed Mexican joint.  I broke down today and gave it a shot.  This place is embarassingly bad and I absolutely cannot believe that this place gets decent Yelp reviews.  I started with the tortilla soup.  The lady behind the counter told me that I could not have avocado and cheese, only one or the other.  Very strange.  I opted for the cheese - this was the first time I'd ever had tortilla soup without avocado.  Not to worry, though, because no avocado could have salvaged this \"soup.\"  The soup had so many tortilla chip strips in it, that you could barely get to the broth - the texture was compaprable to an oatmeal.   Truly nasty.  Then came my enchilada combination platter.  Oh boy.  I had asked for one cheese and one chicken enchilada but they had told me they could not accomodate such a request and that I would need to choose one or the other?  Really?  Why?  That's strange.  Don't you make these to order?  No.  They are pre-made and frozen.  Lovely.  Literally the worst enchiladas I have ever had -- hardly any cheese, awkwardly hard tortilla, I could go on.  The beans and rice were terrible -- black beans, barely warm with a tiny bit of cheese sprinkled on top.  I think the moral of this story is simple: If you want to eat here (why for the love of god would you do such a thing?) you should just go with a burrito because it's impossible to screw up a burrito.  Alternatively, you could get down to the mission and eat good Mexican food.  It's somewhat ironic that my favorite and least favorite Mexican food spots in SF both have the word \"Pancho\" in their name.  \n\nOne positive: The chips were good.  Light and warm.", "author": "Randy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-22", "description": "The only reason I ever go to this place is because it is so close.  Nick's Crispy Taco's is superior Mexican food, so as long as I'm not feeling really lazy, Pancho's isn't getting my business.  Burritos, tortas, and tacos are all below average.  The tacos are often soggy and I'm always a little disappointed with the quality of ingredients.", "author": "Luke P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-13", "description": "For a Mexican restaurant in San Francisco, this place is mediocre.  I have been living in the hood for 6 years and I rarely eat there.  The burritos are ok and the tacos are not great.  The service is not bad.  All in all, it is not one of the better places to eat Mexican food.", "author": "Matt J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-09-22", "description": "i haven't actually eaten much of their food, but the burritos are enormous and look good.  the agua fresca is made on the spot and is excellent...i had the watermelon!", "author": "Roshni R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-19", "description": "got a chicken fajita burrito.. in spinach tortilla, which was perhaps a bad call. the chicken just wasn't very good... kind of dry, hard to chew. the salsa, veggies, and rice were decent. the salsa bar was okay, their salsa fresca was good, the other stuff was not. basically, like the 3 star symbolizes.. it was a-ok.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-29", "description": "I had a delicious dinner at Pancho's tonight - warm, fresh corn tortillas with carnitas; a rich tortilla soup; and a cold beer. For a small Mexican spot on Polk, it's a gem. The staff is also worth noting. I left my purse in the restaurant and when my boyfriend when back to get it, the staff had placed it behind the counter and everything was still inside. I'm very grateful.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-27", "description": "i was recommended this place by a fellow yelper. i had been here once before a couple months ago but decided to give it another try. \n\nfirst strike occurred when they ignored me for several minutes while i stood at the counter. next strike was the super rude worker. i got tamales to go.  the salsa bar is nice though, so much cleaner than el super burrito. the hot salsa, the orangey one,  tastes like burnt socks though, but the pico and the green one were both above par.\n\nnext strike is that they throw chips in the same steaming box with the food, so of course they're steamed and stale tasting by the time you get home. luckily, i had some mission chips in the cabinet. the tamales were super bland, but they did seem genuine. they were wrapped in several layers of pesky banana leaves. \n\noverall, the food was mediocre, but i probably would check this place out again just because it's close and it's way cleaner than el super burrito.", "author": "Saikat P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-24", "description": "Cheap and very tasty.  Two char-grilled chicken taco plate is what i usually get.  Different types of freshly-made salsa to choose from.  They also have coke in a bottle and cheap beer.", "author": "Tom Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-25", "description": "The juevos rancheros made my BF's stomach churn.  I had the nachos, which were pretty good.  But I don't think I'll go back unless I'm desparate for mexican on polk st since I banned La Parilla.", "author": "LT B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-24", "description": "The two taco plate is awesome!  They have, by far the best corn tortillas I have ever eaten.  The salsa bar is great and they have cheap pitchers of beer.", "author": "Brooks O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-04", "description": "Most of the time it is GREAT.  Food is fresh.  Salsa is awesome.  The specials are always interesting.  The burritos are fresh:  the salad is crunchy, the tomatoes are fresh, the sour cream is awesome.  The peole there are friendly and it is very reasonably priced.", "author": "Charles P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-25", "description": "Not even close to the best burritos/Mexican in the city, but it's close to home and they have pickled jalapenos on the salsa bar - sweet.  The food is passable, the people are nice, the tables are clean AND they have $2 beers, so if you are walking by and hungry, it is worth stopping in.", "author": "Matt A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-19", "description": "another good nob jill mexican restruaun and well fed, and portions, good veg options", "author": "Leigh McInnis Lee G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-19", "description": "chips are good here - thin-ish and crispy and they have a pretty o.k salsa bar. try the borracho burrito...sweet tangy sauce - it's excellent. some nights they have $1 beers - what's better than $1 sierra's and a huge burrito?", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-20", "description": "only ever had the fish tacos. they're really, really good. crispy and deep fried. highly recommended.", "author": "erik l."}
