{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Panda Express is my favorite restaurant. In fact I just tried the food here and it was delicious. The food I tried was the teriyaki chicken and rice.", "author": "H M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-27", "description": "If I could rate no stars I would. This place lacks professionalism,  customer service skillset and compassion.  Half the food is not completely cooked through. It should close!!", "author": "Lynn J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-19", "description": "After a food poisoning incident at this Panda location and extreme pushback from the manager who didn't want to refund my money (I brought her the leftover raw chicken and the receipt), it took me almost 4 years to return to Panda Express.\n\nI'd never been sicker nor more offended by the lack of concern. I'd even called the first thing the following morning to report the issue so no other customers would get ill. \n\nFlash forward 4 years: I went today and it was as expected. There was lots of staff behind the counter but an odd lack of efficiency. They weren't rude but not solicitous, either. \n\nI chose the Angus steak which was just okay (chewy, lacking flavor and very oily) and the black pepper chicken that was unexpectedly delicious and full of flavor. \n\nI chose brown rice to pair with the beef and chicken and it was decent quality. The black iced tea was also okay (it was a weaker brew and tasted slightly sweetened).\n\nPanda is located in an area larded with fast food choices (Popeyes, McDonald's, a couple sandwich shops including Subway). It's quick and relatively inexpensive and uses better ingredients. \n\nAnd now that the scales are zeroed out, I might go back in again sooner than 4 years and if all goes well, I'll add a third star.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-22", "description": "Wasn't expecting much from such restaurants but the staff attitude gives me a bad taste. I was asking for the code to the restroom and the person who looks like she's the manager there seem irritated and disinterested. I understand they have a problem with the homeless in that area messing up their restrooms but don't take it out on us customers. Then I was the only one at the queue and it took me a while to get at least one staff to notice me to take my order. I am not expecting any service at all but their unfriendliness is striking.", "author": "Chern L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-05", "description": "If your looking for Panda Express do not come to this location, horrible service, burn food and bathrooms were the worst I ever seen ! Worst experience I have ever ever experience. Never coming at this location ever again. Couldn't even eat my food in peace just for the fact the restaurant was just a mess and stinky smell", "author": "Gladis J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-05", "description": "Visiting the San Francisco area and decide to stop by at Panda Express, I had high expectations but as I was ordering my food I asked to get a sample and the workers told me that they were not allow to do that?!? Like WHAT! That made me really disappointed. When I got my food the chow main tasted burned! Made me just not wanna finish my food honestly. To top it all off the bathroom smelled horrible that I almost threw up. They really need to put someone to clean those bathrooms(deep clean!) I had to run my 3 year old babygirl to a different restaurant just so she could use the restroom. This Panda Express needs a better team management. Not stopping by this Panda Express never again!", "author": "Carina J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-11", "description": "the old woman of all is very bad person She is very rude whenever I come here she makes me angry. but no more. She will definitely not take my order again. She thinks she knows it. also always wrong in my order.", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-17", "description": "Horrible, ordered a kung pao chicken that didn't even seem like it was cooked or cooked right, asked to used the restroom but they only had one open & the bathroom smelled horrible like it hasn't been cleaned for days. Waited on our food for 20 mins or so.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-13", "description": "Avoid eating at this restaurant!! Purchased food from Panda Express today and found some sort of insect in my food on the vegetables. Called the manager and she offered to give me \"store credit\" to get more food; had to clarify that I wanted a refund. Very disappointing experience.", "author": "Brandee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Very nice and tasty food with cheep prices. \nThe customer service is great; they are quick and friendly", "author": "Mo'ad A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "this food is amazing and affortable i wish they were a little closer ti where i lived hut they are still my go to place with just me, my family, or my friends i love there orange chicken and white rice the most. they also have reeay good service and an ordering systerm", "author": "Chloe A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-28", "description": "I'm a patron of P.X.\nReasons being,\nAll of their produce is fresh \nAnd prepped daily,\n+they don't use \"added\" \"MSG\"\nIt's my pseudo Guilt free\nFast food Choice.\n\nToday I ordered the:\nHoney Walnut Shrimp, \nBeijing Beef,\nKung Pao Chicken\nand \nhalf half White rice/Lo mein.\n\"Normally\" that's a winning combo,\nNormally...\nBut today not so much\nThe Shrimp was over cooked,\nThe Beef was dry and not totally coated,\nThe Kung had no \"Pow\" (Chicken).\nI never expect gourmet from  P.X.\nBut today they didn't even try...\nI won't give this location another shot.", "author": "Maurice L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-17", "description": "They burn the all the food, I don't like the taste of any entree over there, I won't come back here again", "author": "Murat U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-23", "description": "I ordered a bowl with black pepper chicken to go and I found out only big onions in it .\nThis place need to fix its service .", "author": "Habesha E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-21", "description": "The food is great!\nThe problem is the place, they should hire some guards or something. It's risky cause you never know. They should do something.", "author": "Erick B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-27", "description": "The worst panda I have ever been to bad slow service over cooked chicken and very rude employees the guy that's usually there with the glasses has a very bad attitude I will not spend my money here  I will never come here again second time here 2nd bad experience they usually have a line out the door very overwhelmed With phone orders not enough help their meat always taste like it's been sitting and not fresh this is the worst panda I have ever", "author": "Sac M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-27", "description": "panda express keeps good quality control so what I am reviewing is the atmosphere of the place.\n\nit is dirty and the trash is always full like you are putting the leftover on top of the trash can not into it.\n\nMaybe should I do another review for take out because they take out experience was one of the best.", "author": "Wai C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-01", "description": "Let me start by addressing that I've had a lot of Panda in my life...\n\nThat being said, I went to SF State and we had Panda Express in the Stonestown mall (best one in SF) and it is worth driving to that one if you're craving that orange chicken.\n\nGo to the stonestown one, this one is very meh and i think it very well could be because it's not always busy like most other Pandas.. (food was cold / tastes old).", "author": "Naveed B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-12", "description": "One the worst and most disgusting quality of food I have ever seen in a Panda Express!!! Don't waste your time they also give you all the filler around the protein instead of actual meat. And then when you ask for some actual meat they respond with, \"Only one scoop.\" Well motha fucka take out some of that damn fruit and shit and lemme get some actual fn chicken!", "author": "Sodro K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-14", "description": "The Panda Express could definitely be better in my view. I have been here twice and quite hate the long lines. I had their fried rice and honey chicken both times. Each time, it tasted slightly different from that other. For me the rice was a little too grainy and honestly lacked taste! I quite expected something unique from an Asian fusion place but I guess they more catered for an American demographic. This place is definitely not my cup of tea. I have had better elsewhere! Panda Express is not for me!", "author": "Daniel J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-06", "description": "I use to love some Panda Express but something changed its just not the same to me any more maybe its just this location because its never really fresh unless you catch them brining it right out otherwise good luck!! The chicken egg rolls are always dry and over cooked the orange chicken which is suppose to be the best isn't not at this location.", "author": "Mychelle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "Preamble:\n\nPanda Express was a New Experience for me, which is simply a fact and not a braggadocious statement.  New Experiences for me seem to be getting more expensive as time goes on, Panda Express was quite a thrifty bargain in this quest.  Panda Express is the McDonalds of \"Chinese\" food. Serving up a reported $2B+ in servings last year.  Panda has captured the hearts and stomachs of the time challenged & wallet challenged who aint into: \"Two all-beef patties, special sauce, lettuce, cheese, pickles, onions - on a sesame seed bun\". While MCD posts $26B in reconstituted beef burger and fries sales, the Panda Express is a shining sign post of the times and FAR more satisfying.\n\nFood & Service:\n\nIs Orange Chicken the best dish in the Chinese food universe? Not really, but it is a tasty savory sweet dish. Beijing Beef was also tasty. Egg rolls were crispy but somehow lacking in the quality that I was expecting. Itsa cafeteria style where the \"guest\" does the \"point to food\" and \"scuttle along\" the glass enclosed display case of the food items. \"American Chinese\" is the self designated cuisine. While this Fillmore Street location is the first and only Panda E. location I have been to, I think it is not typical but I can't be sure since I was a Panda Express virgin. The dining crowd pushed the limits of S.F's hallowed chart of diversity; it was a dining crowd on the edge of consciousness and social cooperation, 'nouf said. \n\nI liked Panda Express.", "author": "Matsuo U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-09", "description": "bathroom is nasty. employee is rude. I was gonna buy food but was discouraged because of that one employee who would not let me use the bathroom because I haven't bought the food yet. overall bad customer service!", "author": "Ivana S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-21", "description": "The food isn't bad, prices are reasonable, there's a bathroom inside. But what I'm really concerned about are the huge number of homeless that stick around this area including the Safeway parking lot right next door. They will talk to you, stare at you, get too close. There is a ton of foot traffic but I still don't feel quite safe. Luckily they aren't inside the restaurant. I'd either hide in here or run to the car or home.", "author": "Alice S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-13", "description": "I took my daughter to Panda Express on Fillmore Street in San Francisco tonight. She ordered her food at 6:18 PM.  The Manager proceeded to kick all the black people out at 6:22 PM.  I made his racist ass give me a refund immediately!  No more Panda Express for us!", "author": "Karla F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-13", "description": "Corporate Panda Express needs to make this Panda Express Safer! Turn up the lights, hire security patrols, guards.\nSeveral people below have already comments that the Parking lot is filled with dangerous guys dealing drugs, panhandling, basically making any customer feel very unsafe.\n\nWe made it through that area -- good selection of food, the service was friendly and fast. We will try to come back or find a safer location. We feel for the employees working here -- so much of the 'street' they have to deal with. \n\nTime for everyone to step and demand safer restaurants, stores, streets, etc. We pay taxes to be safe and not mugged or killed in SF.", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "I like this location because it is in a mall. I get my usual here. Which is fried rice, orange chicken and spring rolls. The line here was short. But the food here is good.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-21", "description": "Why am I writing a review for Panda Express, you may ask? I think we've all had our fair share of Panda experiences. We know the menu, we understand what we're paying for, and we take the risk of our bodies hating us directly afterward. If you read my reviews, you might notice a recurring theme- not only do I enjoy nice dinners with quality wine and a bill that makes you cringe, but I also love late night junk food excursions. I enjoy the best of both worlds!\n\nI've always held Panda Express in a higher regard within the \"junk food\" realm. On par with In N Out. It's junky, it's low brow, but it's delicious and hits the spot. Unfortunately, this location of Panda missed that for me. \n\nThe Orange Chicken, which I remembered to be delicious and crunchy, was soggy. The Walnut Shrimp that I had remembered to be oh so delicious, was horribly fishy (I couldn't even finish it, which is a big deal for me). My fried rice was overcooked and barely edible. My divine memories of being dropped off at the mall when I was 14 just to eat Panda with my friends suddenly faded. Was it all a lie?\n\nThank god my chicken egg roll was actually REALLY GOOD or I would have ran out of place in hysterics. So much so that I went up and got a few more. But, as for my actual entrees.. All I have to say is Yikes. Might try again, probably not.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "This is one of the best Panda Express restaurants I have patronized. The food is fresh, staff members are friendly and restaurant facility is clean. Broccoli Beef, Steamed Rice and Cream Cheese Rangoons are fresh and delicious. Staff members here speak English and Cantonese, it is indeed a very good thing.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-20", "description": "This Panda Express is just like every other Panda Express except hypodermic needles right outside and a shattered glass panel in the front. Food is still good?", "author": "Clay P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-17", "description": "inconsistent...I order from here via doordash all the time...doordash is super fast, so the food is always still warm/hot when I get it. The issue is this store doesn't follow the recipes in a la carte orders in order to save money...I worked for a Panda location in my teens and know what the ratios are supposed to be. If you order a standard plate, you're fine here...but if you order a la carte, you're going to get screwed most of the time...chow mein that is 70% celery and cabbage etc...today was the worst...i ordered a large string bean chicken and a medium rice....the string bean chicken had maybe a dozen shreds of chicken, it was 95% green beans....I ordered the exact same thing maybe a week ago and it was made properly to the recipe ratios.....i had a similar experience with broccoli beef a few months ago that was even worse...(three pieces of beef in a large entree order)....i love panda, but it isn't cheap and i'm tired of being ripped off....going to try the westfield mall location next time and see if I have better luck.", "author": "Joe B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-30", "description": "Pretty good choices for vegetarians. \n\nAlways a great choice whenever I'min a rush and In Filmore (and have no money after spending it all in the Beauty Supply that's around the corner). \n\nThe food is always fresh, hot and tasty.", "author": "Court S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-14", "description": "I'm still looking for my local Chinese walk up that has quality food as well as reasonable prices in SF. In the meantime, Panda at this locale can do no wrong. Great late hours. They are mostly and surprisingly friendly. They ask if you would like to sample an item. The place is generally clean and kept up, which is major for an area populated by drugged out homeless. For dessert, if they're open, go next door to the ice cream shop and say hello to Tom. Allot yourself 15 minutes for parking because Fillmore is the 2nd worst street in SF.", "author": "David D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-04", "description": "Not authentic Chinese food. What they do have is oversalted, overpriced and the small portions give me indigestion. Their lousy steam table food is served in plastic or styrofoam containers with plastic forks which degrade the taste even further. Nothing is cooked to order and there is no waiter service.\n\nThe counter staff speak little or no English and customer traffic is light. Take-out is available. Sketchy neighborhood with thugs hanging out in the adjacent Safeway parking lot. Going to Panda Express after dark is not advised.\n\nAll I can say in Panda's favor is that the restaurant is clean. However, its seating is hard and uncomfortable. The only alternative in that small strip mall is King Lee's Chinese dump, but it's so bad that the usually lax SF Health Dept. put it in the bottom 5% of local restaurants. Eating there is definitely. not recommended. Unfortunately, there is no good Chinese food in the Fillmore.", "author": "Pam J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-08", "description": "The food is solid, a good value. But i was served by a woman with a cold wearing no gloves or face mask, and she coughed openly into the kitchen. This needs to be fixed.", "author": "Sheridan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-05", "description": "Panda Express in the ghetto?  Sounds about right.  Parking was a bit tough, but I managed to find a spot by the park.  For it being 9:30, there were quite a bit of people inside.  They were all doing their own thing.  Some were eating, some were loitering, and others, I have absolutely no idea.  There were two people in front of me, who of course took forever to order.  \n\nI ordered half fried rice, and half chow mein, along with orange chicken and kung pao chicken.  They were quick, and gave a lot of food.  A lot of people complain about the fried rice now being made with brown rice, while others absolutely love it.  Although, I have no problem with the brown rice, I feel they should offer both.  The orange chicken was sweet and crispy.  The kung pao chicken was hot and spicy.  The chow mein was average tasting- a little dry, and mixed with too many vegetables, but it was not too bad.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-03", "description": "Why o Why in a city full of great Asian restaurants did I eat here. Why didnt I buy google at 100? Why didn't I buy that great property in 1985?  blah blah blah.\n\nI must be cruel to this place. To put it as one of my fellow yelpers put it, Blows. The food was Salty, cold, tasteless, and just plain bad. Their Chicken was like cardboard. The rice was flavorless. Perhaps this will make up for some of my past transgressions in life? Nah.", "author": "David G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-23", "description": "Seen a roach in this place , will never eat here again ! Gross ! Save ur money and go to another Panda Express ! Very gross !", "author": "Tatiana M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-14", "description": "I like coming here because its busy and the food is usually fresh, but today I came here and the lady who was serving food was also taking care of the register. She sneezed into her hands, then took cash from the customer befor me and then tried to serve me without washing her hands. I asked her if she could wash her hands and she got a attitude with me and said her hands are clean... I told her I just watched her handle money and sneeze into her hands and she smacked her lips and walked away. I don't no if she washed her hands or just walked out of my view.. I don't think she washed her hands because she literally walked away for 10 seconds and came back. Even if she did wash her hands I don't feel like it was long enough to clean them... I feel like she just wet them and walked back to the line and started serving again. Will not be coming back here. Seems like every Asian restaurant I go to in sf, I get a very rude attitude. It's pretty sad.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-13", "description": "The price is resonable compare with the portion of what you get. Their staff are very quite, I though because their long work in the rainy day. I had to said twice for what I want and the reavtion of the staff seem very sleepy (I came at 7.30pm). These made a long like for sleepy staff. Another thing is the taste of their food. I ordered 2 Entree but both of their taste are very similar!!! Very strong flavor of vinegar and spicy sauce which made them taste very similar even I ordered 2 different things of beef and chicken. I couldn't tell which one I am eating.", "author": "Orange S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-06", "description": "This Panda Express was out of terriyaki chicken which really ruined my night and I went home and cried", "author": "Jaylen E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "Great food! I love there honey shrimp!! Super delicious. Great customer service and smiles on their face.", "author": "Porcelain B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-23", "description": "Great place for a quick, filling lunch!\n\nLots of options to choose from, I usually get the Panda bowl which is one side (white/brown/fried rice, noodles, veggies) and one entree of your choice. I had the kung pao shrimp (which is $1 extra, I didn't know this until I got my receipt) with the veggies which was really good! I also tried some of my BF's eggplant with tofu which was NOM. I'm totally going to order this next time. \n\nService was quick and there was plenty of seating inside. Located right on the corner so you can't miss it!", "author": "Sam F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "Four stars for being open on Christmas Day. We grabbed Chinese food to go and had a picnic in Golden Gate Park. The staff was friendly, the store was clean and the location in amazing. The food is exactly what you expect from a fast food Chinese restaurant, but isn't that good enough when nothing else is open?", "author": "Luis P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-26", "description": "Everytime I go to this Panda the food is always super fresh. The service is always up to par. The cook is always hella  cool and always is making the favorites fresh when I get there. If you looking for a fresh lunch hit it up!", "author": "Perris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-11", "description": "Panda Express. I give this place 4 stars - no more, no less. Why is everyone hating on Panda! This location is right next to my church and is the perfect go-to spot when we need to grab a quick lunch nearby. Depending on your timing (or luck) it can get a little busy pretty quickly. Nonetheless, the wait isn't for more than a few minutes and the staff are friendly enough. Scenario 1: They offer you a sample and you happily take it or Scenario 2: You ask for a sample. They give you one to you and you happily take it! If you're looking for a light meal, my favorite thing to order is the Panda bowl with half fried rice, half chow mein, with Orange Chicken! During my last visit here I tried the Honey Chicken Sesame (it was a little too dry for my preference) and I felt like I was cheating on my Orange Chicken. Never again. They've also recently? offered Orange Chicken + bacon for an additional 50 cents. It was interesting but probably not worth the extra two quarters. Pro tip: Fill out the survey on your receipt to get a free entree the next time you order a 2 entree platter :)", "author": "Grace J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-20", "description": "This Panda Express is a hit or miss. A few times I ordered the Orange chicken and it would be a little hard. I gave 2 stars because it's fast and they seem to keep it clean.", "author": "Nicole V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-29", "description": "I've been coming here for at least 9 or 10 years now, since Taco Bell closed and they took it's place. And they have definitely improved the quality of their food and the quality of the staff. \n\nThey are friendly & knowledgeable of the food. Most of the time the food is fresh and hot. Occasionally something looks old & shriveled up or they are out of a dish, but you can always ask them to make a new tray if you don't mind waiting 5-10 minutes for it. I almost prefer to wait as the food is so much tastier hot.\n\nAs far as fast food Chinese goes, it's the best, in my opinion.", "author": "Venus S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-30", "description": "They're a little pricey for their quality.  King Lee's is right around the building and their prices are less, with food quality and freshness that really beats Panda out of the water.    They're pretty standard as far as panda's go, i.e. I no longer go here when I can help it.   I would recommend anything that they have they're rolling out as new.  They always have delicious new menu items, the only downside is that they're like 2 bucks more... :/", "author": "Jesse M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-02", "description": "Unfortunately, panda express should not open in sf which is a city owns a lot of good Chinese food. There isn't orange chicken and brocoli beef in China actually. Some of dishes are too sweet, some are too salty. I would say panda express is only an Asian American fast food restaurant. Don't go if you want to try real Chinese food. You should go to China. Those food in BJ, SH,GZ,HK are amazing!", "author": "Zi Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-17", "description": "I like Panda Express cause the dishes are amazing prepared but personal in this location are very unfriendly. I was disappointed. I love Chinese food and they do it well, but the service is terrible.", "author": "Irina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-21", "description": "Excellent 5-star restaurant. Absolutely nothing bad I can say. I took my current girlfriend on our first date here and she absolutely loved it. The valet service is excellent and took great car of my expensive car. We then proceed to be directed to our 720 degree view of the top of San Francisco. We ordered 5-pounds of the orange chicken and one large tub of a mixture of editable stuff that I couldn't name nor cared to. We ate, both went #2 -- twice, and then went home extremely pleased. Excellent food, service, valet, private dining, breath taking views of the city. Highly recommend.", "author": "Andrew G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "Just came in today 8:35pm and it looks like they close late. I always seen the commercial on tv about this place so why not give it a try. There chow main is very good never tryed thin noodle chow main but it's just as good. It's a very good place with lots of room and tables. The cashier lady is very nice and respectful. So far so good. I love there honey walnut shrimp it's good and for that item it's very cheap.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-21", "description": "Definitely the worst Panda Express I have been to so far. They were very nice but once I tried their food it was dry and over cooked. Chow mien, orange chicken, broccoli beef and the ragoons was my meal and every single item was really hard to chew. I absolutely love panda and I know you guys can do better! I'm surprised that there are many positive reviews about this location so I don't know what happened on the day I went there.", "author": "Red H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-12", "description": "If you are looking for authentic Chinese food, look no further. I have not had such authentic, home-style Chinese cooking since my travels in the far-off backroads of the Hunan province where I ate in the kitchen of an old lady descended from the personal chef of the last emperor. At Panda, I ate delicacies fancifully named \"Orange Chicken,\" \"Beijing Beef,\" and \"Broccoli Beef .\" My taste buds danced with delight as memories of my travels flooded back. \n\nThe service was also spectacular. Before you can even think of it, the food appears before you. You then point to it, and they put it on your plate. Truly amazing. \n\nAt the end of the meal, if the wisdom contained in your fortune cookie is not enough to solve all of your problems, this Panda Express has an extra special bonus: it is frequented by an elderly gentleman who I call \"Mr Johnson.\" Speak to him to receive the wisdom of the ages.", "author": "Eugene H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-22", "description": "This panda express is definitely not good. I have only been here once but I'm afraid to go again and waste my money on nasty food. \n\nI got orange chicken with white rice. The orange chicken was okay tasting but some pieces were really hard, chewy and nasty. The rice tasted weird/different too.\n\nI do not recommend this place", "author": "Lauren N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-12", "description": "Well its one of my goto places for quick meal. I love it, definitely better than one in westfield. If you are a first timer in PE you wouldn't like it cuz they don't explain menus well, but if you are a usual panda dude or girl and know what to get. Then there really isn't something to complain about. If you think this place suck, goto westfield and see.", "author": "Jake B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-19", "description": "This Panda Express is like any other Panda Express. Standard pricing, preparation, service, and quality as most other locations. The actual restaurant is clean, as well as their restroom. Their location is great...in NOPA/Japantown area on Fillmore. Close to a Safeway, parking and a farmer's market across the street every Saturday (9a-1p).  \n\nVariety of food was a bit larger than a few other locations I've been in, but again, the quality was the same. \n\nOverall...fast and easy Chinese food in a pretty awesome area of the city. Enjoy!", "author": "Dru M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-14", "description": "I like panda express. Panda express falls under the Chinese fast food restaurant concept.  It has a wide variety of Americanized Chinese food presented on a steam table. The quality of food is good, and consistent. Granted, this is not authentic Chinese, but that could be said for a lot Chinese places. Customer service here is pretty friendly. It just shows that just because your are English challenged, does not mean you have to sound rude. The presentation of the food is good.  The place seems clean and well run. It is a good place to go to satisfy your Chinese food fix quickly, and if you are not too sure which Chinese restaurant to check out.  I tried other Chinese Fast food places, that were worse than this place.", "author": "Hiroshi K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-26", "description": "I was convinced by my boyfriend to try Panda Express and he said it was his favorite fast food. I'll start off by saying the only fast food I eat is either Jamba Juice or at a Taqueria. I'm not a snob; I was just raised with hippy parents and I've been a Vegan,Vegetarian, pescetarian almost my whole life. So preservative filled MSG \"food\" just doesn't taste good to me.\n\nI ate the shrimp and walnut dish at Panda express with the spring rolls. My spring rolls were soggy and partially raw inside; completely inedible. The shrimp dish was alright but I swear the food made me feel depressed... and whatever my boyfriend ate was toxic when he passed gas all night long!! I know TMI but listen it's the god honest truth.\n\nI know this place is a popular chain but I just have to say save your money and eat some real food at home...", "author": "Mikaela s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-28", "description": "Food is good here, but the soda sucks. I bought a Mountain Dew and they gave me Mountain Jew (the cheaper knockoff version). If they decide to get some legit MD in this place then I will raise it up to four stars.", "author": "Huan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-10", "description": "I go to Panda express at Fillmore location twice a month at least because it is close to my work. \n\nPros: fast, clean, cheap and good location\n\nCons: not a best chinese food(below the average) , poeple working there are not that nice\n\nSince there are not many chinese retaurants at this location I dont have a choice 0=", "author": "Ashley Joon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-26", "description": "Panda Express if you need to have a fast food experience than come to this place and enjoy the Chinese food.", "author": "Michael N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-19", "description": "you know...it's panda express...the chinese fast food giant!\n\nyou really can't say much about this place...the food is alright for what it is...every panda looks the same...and the prices are decent.", "author": "Jen W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-10", "description": "I'm a pretty big Panda Express fan - but this location is one of the worst I've been to.  The food seemed to have been sitting for a long time, and several entrees were nearly empty.  The staff seemed confused and discombobulated.  Being on the fringe of a not so great neighborhood, the crowd in and around the restaurant was a little rough and didn't make me feel completely comfortable. \n\nAnd they didn't even give me a fortune cookie.", "author": "Steve B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-06", "description": "It's a Panda! You're about to read a very reliable and expected review:\n\nThis Panda Express is like any other Panda Express. It's priced, prepared, served, and delivers like all other Panda Express.\n\nBut! This location: The farmer's market opens right across the street from it, so it's real lively on weekends. Almost makes for a hang-out spot during lunchtime. Almost.", "author": "Eugene L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-27", "description": "The food is basic and pretty good. Fills you up real good! And reasonable price. Hygiene wise - idk...", "author": "DeesQue N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-02", "description": "So this is where I go to get the quick fix of almost Chinese food. I mean, it looks Chinese, but it is missing some of the subtle tastes I like to be surprised with when I eat the real stuff. So the food is not surprising, which means it is consistent. And I think that is a good thing, because if you are in a hurry, you don't want to be surprised by your food, now or later when your body is trying to assimilate the food. \n\nI prefer to get pretty much anything except the orange chicken. I feel that the orange chicken is a Disneyland Fantasyland make believe Chinese food, so I won't eat it. Also when I did try it, I didn't like it. The food coma came too soon.", "author": "Ushra M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-19", "description": "$7.10 for 1 item with fried rice, you could do much better price and quality in a real Chinese restaurant, the fried rice had not been cooked enough before it was fried\nso it was hard, they must use a lot of salt as it was very dry you will need to order water with it $1.80 for small bottle water, price seems high, I got the orange bacon chicken which cost 50 cents extra, I only got 4 small pieces of chicken and a 1inch piece of bacon,3 pieces tasted good the forth was dry,i would have left hungry but they gave a lot of rice,so small portions ,not worth the price,place was dirty but there was a lot of people there,staff were very friendly,\n\nthe only good thing it was instant", "author": "cc c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-10", "description": "Yes I went to Panda Express in SF. I was in a rush. And, I got a little nostalgic. My new thing is to get kids meals if I'm going to go to an unhealthy fast food place. Small portions and low prices. The portion on the kids meal here was especially small. LIke I have 3 little pieces of shrimp. The cookie was processed and sort of gross. I had my fill of Panda Express for 10 years at least. +1 star for the fresh brewed, respectable iced tea.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-14", "description": "Ah, one of the more friendly Panda Expresses I have dined at. The employees actually speak Cantonese, which is excellent. I feel like I have a bond with them already. They are genuinely catering to the customer and your needs. Acknowledging that you exist while serving someone else is not something you find everyday at a Chinese fast food franchise. \n\nMost of the entrees are fresh and hot and trays are okay in terms of being stocked. I did have to wait on one of my extra entrees but that's not a problem as fresh foods are always good in my book. It's not as populous as other Panda restaurants which is nice if you want a bit of a quieter setting. Portions are pretty generous and prices are within reasonable range. If you're not really thirsty, just ask for a cup for H2O. The caps actually fit the cup, unlike the sad plastic cups that are tiny and flimsy.\n\nIf you get your order to-go, make sure to grab a fork and napkin(s) by the beverage area so that you can actually chow on your food and clean up after your mouth area.", "author": "Dominic T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-10", "description": "This place received 5 stars based on Andrews AWESOME customer service...\n\nI'm one of those persons that always places difficult orders, but not intentionally, so upon my turn of ordering, I bashfully asked Andrew for orange chicken but to pick out the small pieces only  ;)\n\n,,,and as I requested, no matter how silly it may seem to him or others, he scouted out the small pieces with a smile and light conversation..\n\nPanda hours stays open late and I was coming from the Laurel district where Asqew Grill (my fav place) was closed.\n\nThe place itself is CLEAN and also their bathrooms!!!!  \n\ncontinue to keep up the good work and THANKS ANDREW!!!!", "author": "LoLa L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-31", "description": "Expensive for chinese food. You find better chinese food cheaper than this.", "author": "M L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-19", "description": "The chow mein is good with the thai sweet and spicy sauce.  The sauce u have to buy else where.  The sweet and sour chicken is good and the egg roll which was firm and crunchy with the dipping sauces was good.  My friend brought from this spot.", "author": "John F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-09", "description": "I come here often since it's cheap and fast.  There are times I liked to raise it to 4 stars, there are times I'd like to give it negative stars.  Let's leave it at two stars and call it a day...", "author": "George A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-28", "description": "Love this Panda, frequent it almost once a week at least.  Nice staff and fresh eats.  Good stuff!!", "author": "Sin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-21", "description": "Ask me where the best chinese place is..and I'll have to say Panda Express.  \n\nSorry, I love their orange chicken. Yum....with the hot, spicy sauce that comes in the package.", "author": "kari t."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-06", "description": "I believe, the ONLY \"1\" I have every given.\n\nMr Panda, you may be cute and all, but you are dead to me!", "author": "Bruce R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-03", "description": "Well it's Panda Express - it's not meant to be anything more or less.  For being a chain fast-food place, I think it's pretty good.  The servers are friendly and efficient, the place is clean and has lots of seating, and it's open late for those nights I get out of class at 10pm.  The food is boring but good.\n\nI go here when I'm really strapped for time (it's a block away from my apartment) or if I'm completely broke.  Like, I have a 20 dollar bill to last me the rest of the month and my credit cards are cut off.  Sadly, that happens every once in awhile, and then Panda Express is my friend!!!\n\nYeah, there are better, more authentic Asian restaurants up the street - no one is doubting that - but if you just want a Panda Bowl to go with fried rice and orange chicken, this place is really not bad.", "author": "Laura W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-25", "description": "anyone who has seen harold and kumar go to white castle can understand \"the feeling that comes over a man when he gets exactly what he desires\" (yes i can quote that movie from memory). and whether you're fiending for \"those tender little white castle burgers with those little, itty, bitty grilled onions that just explode in your mouth like flavor crystals every time you bite into one,\" or just some deliciously-detrimental, artery-clogging orange chicken, sometimes the stomach simply cannot be ignored. \n\nbut eater beware, should you choose to indulge these cravings, you must be prepared to face the aftermath of eating junky fast food. the lethargy... that bloated feeling... the meat sweats. so go ahead. have some orange \"chicken\" every now and again. just don't say i didn't warn you when you're laid out on your couch for the next hour, lacking the energy to even change the tv channel.", "author": "Kris G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-04", "description": "Food was decent, the usual. But service was so bad!!! When I was ordering, the guy was extremely impatient and rude. I was all smiley towards him but all I got back was an attitude. Wow? It seemed like he didn't want to work anymore. Don't go if you don't want to face a snarky attitude.", "author": "Annette L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-05", "description": "Panda is not bad.  It's fast food and they have some healthier options... sort of like Subway of Chinese food.", "author": "Erika C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-12", "description": "I know this isn't REAL Chinese food, but I cannot say no to that juciy, glazy, delicious orange chicken! I like it so much, I wish I could marry it!  Great food to cure hangovers and smother your alcoholic belly would greasy goodness.  \nI always get the half/half friend rice and chow mein, and brocolli beef and orange chicken of course.  \nMmmm", "author": "James C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-28", "description": "A few years back,  I was studying at UC-Berkeley for the summer and had just returned to Berkeley from a good meal at House of Nanking in San Francisco.  I was raving to my friend about the sesame chicken at House of Nanking and asked if he had ever tried the food there.  My friend, who is Asian, said, \"I wouldn't try the place; I know it's bad already; any place with an American name is meant for tourists and non-Chinese and isn't good.\"  \n\nThese words had a great impact on me for years as I stayed away from such places at Silver Chopstick Restaurant, The House of Peking Duck, and Uncle Tony's Dim Sum.   Until recently, I had stayed away from Panda Express in my neighborhood and resisted the temptation to try this place for almost two years.   Panda Express has an American name, and its slogan is \"Gourmet Chinese Food\" so the red flags immediately went up.  What is gourmet Chinese food and would you really be able to get it for $5.49 at Panda Express?   \n\nA good friend of mine loves the orange chicken at Panda Express and his family hails from Taiwan.  Just the other day, he said, \"I have probably had rice just about every day of my life.\"  My friend, let's call him \"Brian H\", has to know Chinese food much better than me so I wondered if Panda Express orange chicken could actually be good.  It would defy all logic and cause me to rethink the earlier lessons I learned about choosing a Chinese restaurant.  \n\nI went into Panda Express with the sole purpose of ordering the orange chicken.  As I was in line, I ordered the orange chicken and rice.  The guy behind the counter told me I could have another entree for eighty five cents so after trying to bargain with him a little more, I took him up on his offer and ordered the garlic chicken as well.\n\nTo my surprise, the orange chicken is good.  I've had a lot worse orange chicken in more expensive Chinese restaurants.   As far as the other dishes, the garlic chicken was passable for fast food and the rice was alright.  I would just recommend ordering the orange chicken a la cart for a few bucks.  \"Brian H\" had recommend only the orange chicken, and he is right; it is good chicken.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-15", "description": "Okay, so normally this would be a three star place, but I don't like orange chicken. But my friends say it's good. However, I'm not really impressed with the taste of it overall. Sometimes, the food is too dry. Sometimes, the food is too greasy. Maybe that's what I should expect, but maybe they should just take more time to do proper preparation. \n\nIf you're really in a bind, go here. If not, then walk the extra block and get some Japanese.", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-08", "description": "For what it is and how much it costs Panda Express is pretty good. I've been to a ton of locations and they are consistently good. The orange chicken is always good and I also like getting the kung pao chicken. \n\nThe way they run the place makes it so you get in and out quick so if you need to grab a quick meal or are running short on time this is the place for you. I'd much rather spend 8 bucks for a huge lunch at panda express than the same amount at McDonald's, Burger King, etc. for some subpar ass grub.", "author": "Tommy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-19", "description": "I have never been to a Panda Express, but love this type of food. My boyfriend and I went the other night when we didn't feel like cooking. We paid about $8 for the two of us to eat! We got one entree and three sides and split it between the two of us. It was plenty and I loved the orange chicken! It is a must when you go to Panda Express. \n\nThe lady that helped us was very nice!", "author": "Carly W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-23", "description": "So deliciously addictive. Obviously it's not authentic home made Chinese food but it's quick and relatively healthy if you're careful. Watch out for the Beijing beef though apparently it's like 850 calories/serving everything else ranges from 150-500.", "author": "Marc L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-29", "description": "It's pretty awful, but it is next to my gym and it'll do in a pinch.  The prawns are ok-ish. The staff is always totally bitchy and robotic, and they try to sell you things, but phrase it as statements, like \"You want this...\" Cracks me up. It really is not that cheap, either.  More expensive than a lot of the Chinese places I eat at, in fact.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-26", "description": "Panda Express is one of the better Chinese-American fast food restaurant. While it isn't all that healthy, it's orange chicken is award worthy with a crispy skin on the outside and the perfect variety of spicy and sweet. However, for the other foods quality, it's price range is quite high. The grilled chicken is very fatty and chewy. The chow mein is decent, but a little bit bland, could use quite more flavor. The fortune cookies lack good luck fortunes and sugar. The broccoli beef tends to get stuck in your teeth quite often especially if you have braces. The fried rice contains too many peas and not enough carrots and eggs, which is quite disgraceful in my opinion. The kids meals are too small in portion size even an infant could eat five helpings. Also, they are overpriced because they are the same price as the bowls but the bowls contain more product. The other day, I visited Panda Express, and I specifically asked for teriyaki sauce on my chicken, payed for the sauce, and the catchier noticed there was no sauce, but still didn't do a thing about it. I've had a few incidences similar to this before, so I would say the service isn't too great, even though it is quick. In conclusion Panda Express has amazing orange chicken but needs to improve on service and almost every other dish offered. Not to mention the overpriced dishes.", "author": "Hetty K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-27", "description": "As I was I having the most stressful day in recent history, I spotted that beacon of fake-Chinese goodness known as Panda Express.\n\nI know, I know, it's not \"real\" Chinese food, but it fills me up and it's cheap (just how I like my women too).\n\nThe Orange chicken is the dish de nom here but I prefer the black pepper chicken. \n\nThat beautiful chemical known as MSG quickly calmed me down and I was ready to get on with the rest of my stressful day.", "author": "Arin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-19", "description": "Well sometimes I come here cause I don't feel like cooking dinner, and I find some of their food selections to be gone or almost gone so there isn't much left.\n\nBut even so, they give me a lore more than I can eat anyway so I have leftovers (-:", "author": "Csndra L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-17", "description": "Best Panda Express in the city.\n\nAlways ask how long it will be for the fresh batch of whatever your looking to eat. Most of the time, they're either already making some or it will be less than 10 minuntes. They're ALWAYS cooking in the back. and it's a clean kitchen. you can even see the fresh vegetables in the clear, clean fridge. This ain't no mall Panda....\nStaff is appropriately friendly considering how much abuse they get sometimes. Prices are more than reasonable for a meal. Great fast food. ALWAYS a better fast food option than that horrible Burger King just down the street....but thats a whole other review.....", "author": "stesha w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-24", "description": "All I have to say is the food is just ewww, even for fast food.", "author": "Cody M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-07", "description": "The only reason to go to this Panda Express is if you're in a hurry to catch a show at the Fillmore and you're looking for some hot food (ie. not Subway next door).  Then by all means, fill your belly.  But if you take a second to look around, there's better Korean food across the street & Japantown is not too far away.  You know what to do.", "author": "Akshay S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-27", "description": "What is it with recycled food?  How do you mix dried up crispy orange chicken with freshly made orange chicken and serve it to your customer?  It simply does not make sense.  You want your customer to patronize your spot again and again, right?  so why serve them nasty food?  Caramba!", "author": "Alcides G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-07", "description": "fast food at its finest..\n\ncalm down.. i'm just kidding..\n\noverall.. the food isn't too bad..\nand when you're hungry.. it can actually be quite good..\n\nthe orange chicken tends to be a bit much for me..\nsickeningly sweet..\nbut i like pretty much any of the meat stirfried with veggies.. like the broccoli beef && the mushroom chicken..\n\ni'd stick with other food options though..\ni think the subway across the way is a lot better..", "author": "monica c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-22", "description": "I've probably had this location before, or maybe not. What I had today wasn't as flavorful as some of the other entrees I've chosen, but thats okay.. cause it was still good. Since the Chinese lady that worked here today seemed really nice.", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-15", "description": "How greasy do you like it?  Panda is really the equivalent of a KFC, McDonalds and chinese food spot rolled into one.  The orange chicken is a spoil, but anyone who eats at the Panda more than once in a while is either broke or extremely obese.  Gotta love America.", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-02", "description": "let's be fair now, it is rather nice having it here.  solves the ages old question of.... 'what's for dinner' for the millions living at the fillmore center.  we get it to go, dinner problem quickly and easily solved.  \n\nquality chinese food, it is not.  actually, only those with very ignorant palates would be calling this chinese food to begin with... but pretentious and expensive, it isn't either.\n\nall i can say is orange chicken...mmm.  it's like taco bell's mexican pizza.  authentic?  hell no.  but tasty, satisfying, and bad for the body?  yes!", "author": "Miss K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-06", "description": "If you've eaten at one Panda Express you've eaten at them all. What sets this particular gem apart is the floor to ceiling windows that allows you to bask in the glory that is Filmore south of Geary. They should advertise a floor show with their dinner. My favorite meal was when I felt a certain electricity in the air and what do I see when I look out the window? Lo and behold..... GIRLFIGHT!!!!! It was amazing the second the fight started a crowd showed up to egg the fighters on not to stop them . I swear I saw side bets being placed and I kid you not but there two guys videotaping the fight. Now, I am not a religious man but I will tell you what I did just like when I saw my first  girlfight in high school between Bobbi Jo and Laura, I prayed. This was my prayer: \"Dear Lord in the ensuing pandemonium please allows boobs and or a boob to pop out.\" No luck at Panda, but in high school it worked my friends....it worked.", "author": "Bucky K."}
