{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "Pretty decent food for relatively cheap price, but not so friendly staff though.\n\nI ordered Beijing Beef with rice here. I liked the quality, it was very fresh, but they put only 1 scoop of meat and a lot of rice.", "author": "Ivan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-13", "description": "Their bejing beef is really good. Good fast service. Chow Mein is so tasty and not salty.", "author": "Allen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-28", "description": "Most of the time, PE locations are consistent and have good food. This place would be an exception. It is a iffy location and the beef was very chewy.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-01", "description": "Maybe I'm being extra but I love Panda Express but I strongly dislike when I ask for the simplest thing to help me out and someone feels like they can't help me out. I ordered my food and everything was cool until I got to the register. I was asked if I needed a bag which I stated yes, but had also been shopping as well as had my work bag with my laptop in it, but I also didn't want to be looking like a bag lady. She proceeded to open a grocery store size paper bag and I asked if they had anything smaller. She stated no then I saw a worker roll past a with a trash can and thought they could give me a trash bag then I could put my food into one of my many other bags. Sharon the cashier stated they didn't have any more bags so I looked at the trash again and asked \"...so that was the last bag?!\" She stated it was so I instantly felt like she was lying but didn't say anything but opened my yelp app, stood back and took her pic. I strongly dislike when people can't be straight forward and say what they really would like to. Just tell me you don't want to give me one for the price of the brown paper bag. The food was alright as well. Rice kinda shrimp fried rice-y. But overall cool.", "author": "Itika D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-16", "description": "I was standing in line waiting for my turn, when there was a chinese guy came out from the kitchen, his face is dripping with sweats!!!...seriously it was coming from his pores that he looked like he just washed her face. So he grabbed two pieces of hand tissues from the dispenser and wiped his face, but his sweat still dripping from his face, went to trays of food, grabbed serving spoons with his hand he used to wipe his face to fix the food in the tray then went back to the kitchen..that was disgusting!!!Can't imagine how those sweats dripping from his face while cooking. I decided to leave and went to japanese restaurant next to it.", "author": "Cris S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-04", "description": "A typical Chinese's fast food restaurant. All their dishes are oily and unhealthy. I'm not a fan of such food. I wish they would look into how to provide healthy dishes to their customers. I had their two mains and a side combo. I've had their prawns which is good and their beef. I prefer their rice over their noodles only because of the oil. The area is clean and their service is good. No complaints other than I can't eat this often.", "author": "Julia J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-01", "description": "We have gone there often but 0n 9/29 we went and had their Chicken Honey special and their Angus Steak. We've had them both before and they were good, but this time both had irregular shape pieces of meat (very small an large) and both had tough pieces. The chicken had a gristley piece that was unchewable and inedible. We may eventually go back, but it will be a while.", "author": "James Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-20", "description": "I went there today. After I finish my meal, I asked for cup of water. Employee name Li, said I need to show her a receipt! Very bad customer service!!!", "author": "Anton M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-19", "description": "Food is ok, but the location is terrible, definitely not the safest place to be. I used to go every other week and there was always something going on, and somehow I always came back, but on my last visit I witnessed how someone snatched a girl's cell phone while she was inside the restaurant finishing her food. And that for me is unacceptable.\nIf you dare to go, please be really careful, extremely aware of your surroundings and try to stay in a defensive mode all the time. \nI can assure that I won't be back, for me is just not worth it.", "author": "Andres G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-12", "description": "First of all. I love Panda Express.  I have eaten at this location semi-regularly.\nWhile eating there this afternoon, there were 2 beggars in the store!  Employees sometimes kick them out, most often they do not.  Beggars should not be allowed in the store period,end of discussion!\nAlso there was a vagrant digging through the trash.  Again should not be allowed!  It did not help that the trash was OVERFLOWING and people were leaving trash on top.\nI guess I won't be eating here!", "author": "Scott B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-16", "description": "Can't go wrong with Panda Express, or generally any franchise. Food is generally consistent and you get what you're expecting, at prices that are relatively cheap.\n\nAt this Panda Express, I feel the portions were a little smaller than the other Panda Express' I've been. It does get very packed and to keep the line moving, I guess they quickly give you a scoop to move the line. The seating is limited for the number of people (6 PM on a Friday Night, at the mall food Court), so don't be afraid to just ask to sit next to a stranger (some of the tables are kinda communally arranged)\n\nSF is expensive, but your food choice doesn't have to be.", "author": "Thomas K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-10", "description": "This place has horrible customer-employee relations, and they can't control the cleanliness of their store. Emily who worked there Sunday called my son out for trying to get a water cup while we paid for food here, disgusting quality and chipotle nearby is much, much better Ajisen Ramen has much better quality and service. I will never be going to spend a dime at a Panda Express ever again.", "author": "David G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-25", "description": "These people are rip off I just noticed that they charged 0.10 cent extra for carry out bag tax on top which I didn't see at the same time got bad service the cashier raised her voice at me while facing another person, she said wasn't talking to me was talking to the person next to me but clearly she was talking to me otherwise why would she raise her nasty voice at me when didn't say/do anything to lady, also didn't tell me anything about charging me extra 10 cent bag until I found out later was too late turn back she have given me, since didn't receive any bag from them they have done this without telling me you only charge people for bag when you give them one not when they don't have one ripping them off to get more money out of them professional scam artist ought to be big shame of yourself giving me bad service while charging me extra money to get more money out of your bad services karma better goes right back to you all and bite everyone back in the face never work plus open this shop ever again. \nYoung lady while she was yelling at me ask me same basic questions which she know the answer to ask me do you want any drinks donate money some tips, less unfortunate, etc... I already gave you my answers to these questions when you were asking nicely so why are you annoying me with the same questions repeatedly and screaming at me same time, you children working at Panda Express obviously have no manners toward customers treating us like animals we're human beings same as you guys we deserve to be treated with respect/dignity not how females workers at Panda Express wanted us to be since you lame jokers can't see us in positive form we'll be talking our business somewhere else.", "author": "Lorrie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-01", "description": "This place always has a line cause it's cracking. Fast food Chinese food, Panda Express does it right. Don't expect authentic Chinese food here, but I do find the food super comforting! I love their Chow Mein, Walnut Shrimp, Orange Chicken and Spicy Egg Plant, they are my go to every time! Service is super fast here and staff are very kind. I am not surprised why they do so well, it's definitely satisfies cravings and filling!", "author": "Natalie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-03", "description": "Going to Panda Express you: (1) can't expect it to be authentic, (2) shouldn't be under the illusion that you're eating healthy just because there are a few veggies, (3) should stay hydrated because there's a lot of sodium and (4) should order the fried stuff, because that's what they do best.  There's definitely a lot of better food out there, but there is something nostalgic about taking a break from the bougie San Francisco food scene to eat orange chicken in a mall.\n\nCream Cheese Rangoon: No crab or \"crab\", but that's fair, since they advertise it was a cream cheese rangoon and it's an inexpensive add-on.  For me it's really about the texture contrast of the crispy wonton wrapper against the oozing cheese inside.\n\nOrange Chicken: Apparently this is their signature dish and it's deserving of the title.  Kinda like popcorn chicken tossed in a sweet and sour sauce.  I'd probably like this more if there was some orange zest in the mix, but that's probably too bougie for fast food.\n\nHoney Walnut Shrimp: A big disappointment compared to what you'd get at San Tung or Hunan Home's.  The batter is soggy.  The walnut pieces are very small and don't have that nice caramelized crunch.  There is no sticky white sauce on top.  And the shrimp didn't taste that great.\n\nBeijing Beef: I like that the beef seemed to have a light battering and got fried so it was crispy.  You don't really see that often.  The peppers and onions were kinda blah, I'd rather just have more beef.  The sauce was ok.\n\nChow Mein: Bland. Not a great mix of veggies; mainly seemed to be cabbage and onions.  More exciting than rice, but not by much.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-22", "description": "Terrible service.\nProbably it was the cashier's first day on a job.\nI know more on how to service a customer in a Panda Express than her. \nShe opened my container with food and put her finger inside to show what is in chow mein to a different customer.\nAfter I asked to change the meal she told me that it's ok to eat. No apologies at all.\nLost my fortune cookies and never gave me one.\nDidn't offer any drinks and even managed to lose my teriyaki side sauce.\n\nHealth score 90, which is less than usual in this chain.", "author": "Sergey S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-05", "description": "I've always been a little surprised seeing most Panda Express outlets having 2-star ratings. Honestly, the last time I visited was a long time ago but I do remember the food being more than decent.\n\nI ordered their 1 entree + 2 sides combo and got chow mein with black bean chicken and kung pao chicken since they seemed to be the two most popular ones. And although the chicken dishes were good, the chow mein was a real let down. It was so bland that even the tasty Kung Pao chicken couldn't salvage the meal. \n\n3-star rating since both the kung pao and orange chicken dishes were decent and I'm guessing they just had a bad day with chow mein.", "author": "Gaurav K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-31", "description": "The location is good, for American style Chinese food was ok. I did my order from a middle aged Chinese lady, I wanted half rice and half noodles, but she only give me 1/3 noodles. That is ok. What unpleasant was when I asked for chopsticks, she told me it is in a self-service area. I could not find it over there, than I went back to her asked for it, she gave me that look like I was upset her. Bad bad service. Don't know what was her problems. I will not recommend eat there. Unless you want to put up with her wired attitude.", "author": "Derick W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-09", "description": "Expectations met - fast turnaround, but not the best quality meat (Kung Pao chicken).  Good for a quick stop in the mall while shopping.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-31", "description": "Overpriced attempted at Chinese food. Came to Panda Express a few times at different locations and it is all the same. The food is overly salted and the company uses a cheap oil that has a nasty after taste that last for hours on end. \n\nAnd the cashier here is extremely rude. \n\nBetter off running to any mom and pop Chinese place than going to this fast food chain.", "author": "M C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-18", "description": "I got a bowl, and when I asked for white rice she basically filled the entire bowl with rice, and when I asked if she could take some out to make some kind of room for my entree she completely ignored me. And then when it came to my entree which was orange chicken and I counted exactly 6 pieces of chicken... so basically paid $8 for rice... what a complete rip off.", "author": "Corey R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-20", "description": "I liked the Beijing Beef, it's not bad for asian fast food, I like that it's made to the same standards at all locations, consistant and the prices are very reasonable, for the price you pay they serve a decent amount,  good value and quality, always fresh, they dont serve old leftovers, they try to keep everything fresh. I rather eat at PANDA EXPRESS than other fast food chains, even though it's not authentic Chinese cuisine, it's still better than a lot of other fast food places out there.", "author": "Mr Bolo B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-31", "description": "Panda panda panda panda panda haha. Panda is americanized chinese food. They always have a long line and I get it. It's fast and delicious. I always get the chow mein with orange chicken and sweet fire chicken breast. I suggest ordering online and coming to pick up because it's faster. They literally scoop the stuff when you get there too. It's never sitting cold on the side.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-16", "description": "So, I usually don't do this but for the losses I incurred, others need to know. The cashier at the Westfield when I came to pick up my (online)order chose to acknowledge me waiting but continued to help traditional customers waiting in line. One customer in line acknowledged that I had been waiting for awhile and the cashier physically waved her hand in the air (at chest to eye level) to indicate as if my time is not valuable and stated that my food \"hadn't even been prepared yet\". That gesture left a bad taste in my mouth and the patron in line was puzzled judging by the look on her face as well. By this point I had been in line for just about 10 minutes where my food was to be ready  seven minutes earlier. I ask the cashier what was the hold up and with no direct reply to me she ask a line employee (Rhea) about an online order which was just an empty box with my receipt attached ( I pre-paid as to not have to wait!) just randomly places behind the line. At this point the line employee was a gentlemen and took care of the order right away. Aside from the disposition of the cashier, I had nearly become incensed because my time was egregiously taken for granted for food that was already prepared and ready to go. I'd ordered a 3entree \"bigger\" plate with grilled chicken & was under the impression it was being made and that it just hadn't been communicated to me, wrong! Then to top it off and to no fault of the line employee my third entree (black pepper chicken)leaked through the bottom of the bag almost immediately and soiled my slacks. So for what should've been an express, expedited order I spent nearly 15 minutes more and I'm sure those pants are in dire need of dry cleaning because of the oil stain.", "author": "Joaquin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "I was at Westfield Mall today and I knew I was going to stop at Panda Express for a quick bite. Now we all know Panda, decent food for a decent price. But for their food I'd only give them 3 stars, 3.5 tops. Why 5? Well, today I was quite impressed with two of the young ladies on their staff. These two ladies were out in the eating area keeping the place spic and span: moping the floor, wiping off the tables. And I know that's to be expected, but these two ladies were like busy bees, non-stop and no frowns on their faces. \n\nThey had great enthusiasm for what they were doing even though it was hard work. I was only able see one of the name tags: CiCi. She and her co-worker should get bonuses for the hard work they were doing. I just want to let you know, I noticed you.", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "I mean, its Panda Express... The Original Orange Chicken", "author": "Kegan K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-21", "description": "Food is great and has been coming here for years. Workers on the other hand needs to learn how to treat customers with great service. These guys are well trained to be stingy like the extra food they're giving you is coming out of their own pocket not to mention that they're straight up rude at times. They also need to stop asking for donation. It gets annoying when you go there and eat often. I feel like it's rude how they pre-calculate your change and specifically ask if you can donate it. \n\nGreat food, but rude, stingy, and greedy workers!", "author": "Sey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "I am giving this Panda Express a 5/5 stars because the staff and the food were amazing! I ordered catering for a work meeting and because I'm not from San Francisco I under estimated the time it would take me to park and pick up. The staff brought the food to my car!  not only were they especially helpful but the food was great! I made it to my meeting very late but everyone was very happy with the food. Seriously, best staff EVER", "author": "Melissa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "I wouldn't come out of my way to eat here given the trove of Chinese/Chinese-American food in the city, but the service here is nice, the portions are hearty, and the after-tax price at the time of this review for a standard, 2-item plate (without \"premium\" entrees) is under $10.", "author": "Barack O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-17", "description": "I try to avoid coming to this panda but the location is convenient. It's always busy so the food is always fresh, which is a good thing. \n\nHowever, portions seem to keep getting smaller. On top of that, WORST customer service EVER. They are never friendly or welcoming. They can never seem to even FAKE a smile. I hate writing bad reviews but the ladies working here shouldn't have a job in customer service!", "author": "Kay C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-11", "description": "I really don't get all the 1 star reviews: it's a Panda Express for crying out loud, you can't expect much from them.\n\nIf you want something cheap, fast, and easy, then come here. Well, it can be not so fast if you come during the lunch rush and they have a super long line; I'd recommend avoiding 12:00 - 12:30. I generally come here when I'm too tired to think-of/walk-to/wait-in-line-for a better option, but I am never dissatisfied.", "author": "Anthony P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "I became an American citizen over 20 years ago. \n\nHave voted in every presidential election since I was able to. \n\nBut today, I am a real American because I am admitting... I like Panda Express.\n\nAs a first generation Chinese American, that is hard for me. I feel like I must scoff and be dismissive. But I am declaring this because not only am I using my first amendment right of freedom of speech, but because... dang, Orange Chicken tastes good!\n\nI had been a closet Panda Express eater for a few years now. I don't do it too much... because you know... what if someone sees me. I am still very much a newb. For example, last time I came here I got the Orange Chicken and the Bejing Beef and discovered they basically taste exactly the same, just different color. Rookie mistake.\n\nBut now that I am uncloseting, I will get better at being a Panda Express eater. I will learn the tricks. I will not eat in fear and shame... not anymore.", "author": "Bonnie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "Bahagianya bisa ketemu nasi kalau di LN , resto ini adanya di dlm mall di area sktr union square.  Kita bisa pilih nasi putih atau nasi goreng ditemani pilihan sayur dan berbagai macam lauk yg rasanya menurut saya cukup enak sesuai lidah kita. Porsinya cukup besar jadi kalai anda biasa makan sedikit mungkin di share aja. Harga berkisar $10 - $12,5 termasuk minum", "author": "Rino T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-31", "description": "This is a review for this particular location, not of the Panda Express brand. This location, in particular, has little regard for delivering an accurate order. I ordered take out and when I went to inspect the bag, the woman at the register ensured me that everything was there and rushed me away as quickly as she could. Sure enough, I get home and they had both given me incorrect items and forgotten to pack our side order of fried wontons. I get that it is \"fast, convenient\" food, but I've never been one for confidence in lackluster service.", "author": "Luis P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-23", "description": "It's a Panda Express in the Westfield Mall.  I don't really know why I'm reviewing it.  All I know is that I went for about three years not eating Panda Express because usually there are much better food options in a mall.\n\nMy friend Spencer raves about the orange chicken.  It's amusing and somewhat endearing about his love for orange chicken.  This time, I did get orange chicken along with beef and broccoli, and chow mein, and to my amusement, the orange chicken was actually the best thing I had in my box.  Which may or may not be saying much because I thought the chow mein noodles should have been thicker, and the beef was atrociously bad (usually beef and broccoli is pretty reliable, but here, it was a total trap).\n\nThe orange chicken is basically sesame chicken or general tso's chicken but without the sesame seeds and with just a little of the spiciness.  The flavor is a bit tangy and the chicken is deep fried and crunchy.  However, I still disagree with my friend that getting two orders of orange chicken is a good idea.\n\nFor $8 I suppose you get a lot of food (2 entrees + rice/noodles).  This place is still not my number one choice for mall food by any means but I guess I could always come back for the orange chicken.", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "I like this location because it is in a mall. I get my usual here. Which is fried rice, orange chicken and spring rolls. I don't like that there seems to always be a long line here. I don't like that. But the food here is good.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-01", "description": "This restaurant is in the Westfield San Francisco Central Mall. The environment is nice and the waiters are so kind. They offer many kinds of Chinese dishes, rice, noodles and beverages. I ordered fried rice and two dishes. It tastes good.", "author": "Nancy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-05", "description": "I'm a sucker for chow mein and springrolls and keep coming back to the Panda for more because they're delicious and comforting. I could seriously eat them all day long. However, half the personnel I've encounterd was unfriendly, impatient and either they're hard of hearing or the just don't want to listen to you, combined with poor English and no intention to try doing better. The other half took just a bit more time and had a better understanding of the English language which already helped a great deal. So please Panda people, learn the language. And young Panda people, it's super unprofessional to hang out with your friends while you're supposed to be working!\n\nOther than that, Panda Express really needs to add a wider range of (wholesome) vegetarian dishes, because basically all I can eat here is the chow mein and springrolls, which in the long run just isn't good enough. So more yummy veggies please!", "author": "Bekkah R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-10", "description": "the worst experience in this fast food, mediocre place. the customer service was the worst. very disrespectful, rude. i will never buy any on this places. this people is so stinchy, the portions are ridiculous, so minimal. i am used to great chinese food, this is far from it and the customer service is AWFUL!!!!!!!!!", "author": "Brenda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "Not sure why there's several 1 star reviews. This PE is like any other and their servers and cashiers are polite and welcoming. Granted it is at a mall so the line can be long sometimes but they have great customer service, ask each person if they want a sample, and pretty friendly with the hundreds of customers they get. It's a bit limited on spacing when it's meal hour but that's expected.", "author": "James L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-30", "description": "Never again...ate here this afternoon and my stomach has been in so much pain. Almost considered going to the ER. This was my first meal of the day and haven't been able to eat anything else. Definitely not eating panda again, it's not worth the food poisoning. Blehh.", "author": "Sonia R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-17", "description": "Standard Panda Express.\n\nFriendly service, clean location, and there's almost always seating. Perfect for when you have that inevitable orange chicken craving!", "author": "Yanni L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "Earlier this year, we were eating inside this Panda Express when we heard loud \"bang\" sounds from somewhere nearby. Moments later literally everyone in the mall scattered and ran into the nearest store or restaurant, including the Panda Express we were in. Not knowing what was going on beyond the sight of many scared people running, all of the diners, including us, quickly got up, moved to the back hallway where the restrooms are, and ducked down. There must have been about thirty of us cramped together in that small hallway, including families with kids who understandably seemed very frightened. Fortunately, not long after that, the employees of Panda Express lowered the gate to the restaurant, and we were all able to get up, spread out, and breathe a sigh of relief for a moment. The employees also told us we could get out through the back exit, so we all followed each other through the kitchen, which led to a series of hallways and stairwells, which eventually let out on to Fifth Street on the west side of the mall. After we exited, we headed towards Market Street where we came across a whole bunch of police cars, fire trucks, and ambulances. We found out that someone had just been shot near the entrance of the mall.\n\nThe sight of everyone in the mall running, hiding in the back of that Panda Express, and not knowing exactly what we were hiding from was definitely a scary experience. So the purpose of this review is to commend those employees of Panda Express for what they did for all of us that evening. Thanks you for protecting us, and for putting the safety of your patrons first. As for the food itself, I still come here all the time and I think it's excellent! The broccoli beef, orange chicken, and honey walnut shrimp are the best!", "author": "Kevin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "I don't get why this place gets less than 5 stars, units of happiness / gluttony per dollar is pretty darned amazing especially given the location! I live nearby and this is a staple. About 10 bucks for a refillable soda, 2 entrees (Orange chicken is the new crack rock, but the bacon version is not worth the extra fitty cent), and chow mein in a bougey mall... Nuff sed. Get over hurr asap.", "author": "Roger L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-10", "description": "I always like Panda Express, because it's affordable and it's nice American tasting Chinese food. I never have a problem with the food or service. At around noon is when it becomes incredibly busy with people on their lunch break, so go before 12pm or after 2pm. My only complaint is whenever I go to this Panda Express inside the mall, there are always one or two homeless people hovering around guests asking for money or food. It just makes eating a bit uncomfortable.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-17", "description": "I happened to be in Westfield shopping for a gift during my lunch break, and was excited to eat at Panda Express because I rarely get to eat here. Came in, ordered chow mein, beijing beef, and fiery sweet chicken. Sat down, started eating, and within moments of eating the beijing beef, I found a long black hair sticking out. I then proceeded to look around more, and found a second long black hair. Mind you, I'm a male with a short hair, so this obviously isn't some stunt to get a free meal for $9.03. \n\nI walked over quietly to the manager, so not to make a fuss about it publicly to let them know their beijing beef has hair (PLURAL) in it, to see if I could get a refund. When I told the manager that I found hair in my food, and wanted a refund, she offered me more food instead. I politely said no, just a refund. She asked for my receipt, I said I didn't take it because you know, who keeps a receipt for lunch unless you're traveling for business. She said she couldn't help me without the receipt. \n\nI find it hard to believe that nothing can be done when a customer clearly found long black hair in their food without a receipt. She said she couldn't look up my purchase without it. I know accidents of hair falling into food happen, but twice is just awful. Mind you this wasn't just laying on top of the food, it was deep in the sauce of the food and I pulled it out. You would think that after seeing her employees hair in her customers food, she would do whatever it takes to make sure you don't leave upset.\n\nHere's some advice Panda Express, get a freaking contingency plan for when people don't have their receipts, instead of just letting your managers just stand their like a deer caught in the headlights. Train your managers not to allow paying customers leave without doing anything so they go back to work and write up reviews like this. Just be happy that I'm not someone who likes to make scenes during these kind of moments. Could of easily made a scene and informed people in line that there's hair in the food they're about to eat. It's just bad business, and frankly gross.\n\nBetter yet, how about making sure hair nets are used at all times. \n\nOn top of all that, the food was very sub par, and I won't be eating here or any other Panda Express ever again. If you've read this, make sure to check your food for long black hair that might be sitting in your food. Or more wisely, do yourself a favor and don't eat here anymore. Disgusting.", "author": "Stanley K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-22", "description": "I can neither confirm or deny that their chow mein cures hangovers. \n\nBut you should try it sometime.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-13", "description": "I love Panda Express ! I go there every time I visit the U.S. I enjoyed the new eggplant tofu dish. Orange chicken is always a must eat.", "author": "QL M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-27", "description": "Ok so sometimes you just gotta have a bit of classic Chinese mall-Food & Panda Express is fast & convenient & not AS Expensive as other places in Westfield! \n\nOrange Chicken, Broccoli Beef, Chow-Mein, & fried rice is good although they TOTALLY are SKINT on Portions!\n\nC'mon now this food certainty isnt of such valuable quality!", "author": "Julian I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-15", "description": "OKAY, it's Panda Express so we really can't expect that much. That being said, there are some glaring problems at this location:\n\n1) Service has markedly declined in the last several months. The workers at this location are rude, rude, rude. I've been kept waiting for several minutes while I was the only customer in line. I've been shooed away from tables for lingering too long. I've gotten eyerolls for asking for soy sauce. It's terrible. \n\n2) Portion sizes are much smaller. Sometime in the last 6 months, the portion sizes have declined. Yesterday, the woman next to me in line asked if she could have a little more Beijing beef on her bowl. The server rude told her \"No, no. Portion size is one scoop. ONE scoop.\" \n\nThere used to be this really nice manager here, I guess he is gone. Unfortunately, my favorite quick lunch spot is no longer worth coming to. I will probably go to the Japanese place across the way instead.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-12", "description": "Gotta love Panda Express...if you crave sweet sauces, this is your place. Form the Bejing beef and orange chicken to the honey walnut shrimp...this place has you covered. There are a few healthier options like tofu   but if you go you might as well go on your cheat day. I would show up before 12:00 to avoid the long line the stretches into the general area....they're pretty quick nonetheless so they'll get you out of there fast even if you're at the back of the line.", "author": "Sergio L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-17", "description": "This Panda Express is just like any other Panda Express I've been to. Service is okay. The food is okay. Quantity of the food is less than any other Panda Express. Waiting in line takes about 5-10 minutes during lunch and dinner time. Non busy days takes about 2-3 minutes. If you want to pay more, and eat less, this is the place to eat.", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "Having read the reviews for this location, I was kind of dreading the customer experience when I came here to satisfy my Orange Chicken craving on a late Tuesday. But, I was pleasantly surprised by the reception and the patience with letting me taste two other dishes and contemplate for several seconds :-) It may be different from staff to staff and time to time (this was not rush hour), but Brent did a great job! I feel good customer service should be appreciated, so I signed up on Yelp just to write this and compensate a bit for the other reviews :-)", "author": "Fredrik O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-02", "description": "I called for a pick up and someone answered and took my order I went on my lunch break so it can be quick but when I arrived they said they don't do pickup over the phone.they didn't help, they just stood around like they don't understand me. They don't have good customer service. I should know I used to manage restaurants", "author": "Jessica A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-11", "description": "This place has terrible customer service. Their Wi-Fi was not working so my gift card would not go through and I had no other form of payment. They kept my card and proceeded to question it's authenticity. I was almost left without food but luckily some kind stranger paid for by meal.", "author": "Nick I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-10", "description": "I have no idea...but I like Panda Express. Even if it's not really 'real Chinese food' lol  (Trust me....I know real Chinese food, and I can make it.)  \n\nI like their noodles, and pouring multiple packets of hot chili sauce on it.  I like the orange chicken (when it's fresh); and I like their veggies, when it's not saturated in cooking oil.  I like their eggplant tofu dish too, but it's usually 2 pieces of eggplant to 8 pieces of tofu. :(   (Tip: if you want the Orange Sauce, go to COSTCO and get a huge container for under $10.00!)\n\nPrices...leaves much to be desired as it costs about $8.50 for a two-item combo plate.  And that's without a drink.  (I usually come here when I happen to be in the neighborhood and can tolerate dealing with the lines for lunch.)  Somehow, prices have gone up and portions have gone down here, but just like everything else in this downturned market, it is what it is.\n\nService = friendly but curt.\n\nOverall, I come here a few times a year to satisfy the Panda Express cravings.  (Residual college nostalgia, what can I say?) \n\nOh, and I really, really hate fortune cookies from here.  It's like reformed stale rice crackers.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "Panda never disappoints. I love to grab the bowl with black pepper and kung-pao chicken coupled with Chowmein and Fried rice half and half.  This location is kind of a hidden from street as it is on the Basement floor in the Westfield right next to Powell BART station and it took me sometime to locate it, but it was worth it.", "author": "Mrugen D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-17", "description": "The Peking Beef wasn't bad but they dole out the portions as if it was Tiffany diamonds.\nVery VERY stingy portions. There isn't a lot of value to it and the ingredients are are not costly.", "author": ".James A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-07", "description": "Small portions compared to other Panda Expresses. The Firecracker chicken very stingy on the chicken to many onions! Brocolli beef contained more brocolli and 2 slices of beef! Wow super stingy. Cheapy paper plates which were about to fall a part if not for the tray. \n\nWon't go again.", "author": "Lauren W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-01", "description": "I'm always a fan of Panda Express. The only downside of this place is that it's always packed! I've never seen it dead before...It is also a gamble with the employees. Sometimes you get someone that is energetic and sometimes you get someone that makes mistakes on your  order. But it's okay since whenever I'm in the city and I'm craving Panda Express I come here.", "author": "Diana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-08", "description": "2 1/2 stars for this gold mine of a fast food joint?  Not in my book.\n\nHow can you be mad at:\n\n- Cheap food\n- Generous portions\n- Friendly and FAST service.  \n- Free samples\n- Choice of fried rice, white rice, or chow mein (you're already eating unhealthy here so might as well get fried rice)\n- Chicken and string beans (that sauce... is so effing good smothered all over rice)\n- Mushroom chicken (that sauce... this time with mushrooms...mmm)\n- Kung pao chicken (that sauce... this time it's spicy)\n\nSurprisingly, I never get orange chicken... it's so over the top heavy and I feel really guilty eating it... but its so damn delightful.\n\nI remember college days when I used to finish a 2-entree combo all by myself... now I stick with 1-entree panda bowls.  \n\n... MY GUILTY PLEASURE ...", "author": "Kat C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-10", "description": "I asked for orange chicken, and they gave me a heaping mound of it. Then they tried to charge me for a two item combo. So I asked if I could just have one portion, and the woman dumped 3/4 of it back. In the end, I paid $10.55 for five pieces of chicken, a scoop of rice, and a drink. Never again.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-12", "description": "Love Panda Express noodles so I ordered a two item combo with noodles as a take out.   I watched as the line person correctly filled my order.  Got home to discover that this is not only the food I saw placed in the container but I paid for somebody else's order.  Cashier's are rushed and do not recap what you ordered so make sure you have them open up the carton and verify otherwise you will end up with Panda Surprise when you get home.", "author": "Stan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-24", "description": "Came here twice between this month and last month, the food is ok and the service was quick. Why I took out two stars was because of the people that comes up to you asking if you can buy them something to eat. If you say no, they won't leave and keeps bothering you. Last time was a young black guy. Today was a young black woman. People can't eat in peace and there aren't many security guards doing rounds.", "author": "Jen M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-07", "description": "In the criminal justice system, shrimp-based offenses are considered especially heinous. In San Francisco, the dedicated detectives who investigate these vicious felonies are members of an elite squad known as the Shrimp Victims Unit. These are their stories.\n\nhttp://www.youtube.com/watch?v=-8lDYrvTILc&feature=related\n\n3:12am. An iPhone 3G rings on a nightstand. Detective Dave G. reaches for it, half asleep. The call drops. The phone starts to ring again. Call drops. Again the phone rin-call drops. Finally the call goes through. \"G. here,\" says Detective Dave G. \"Detective we nee\"- call drops. A text comes through, \"GET YOUR ASS TO THE PANDA LESBIAN AH GODDAMN AUTOCORRECT THE PANDA EXPRESS GODDAMMIT\"\n\nDetective Dave G. arrives on scene, steps off Muni, and heads towards the food court.\n\nCop: \"You gotta be shrimp crimes.\"\n\nDG.: \"Dave G., SVU. You Chow-Mein-On-Side?\"\n\nCop: \"Sorry, just Pork-Fried-Vice.\"\n\nDG: \"So who found the body?\"\n\nCop: \"Couple of lookie-loos, eating at Rubios. This way.\"\n\nA dead body is sprawled on the floor (guest star Tim Allen), a takeout box in right hand. Detective Dave G. kicks the limp body out of the way and picks up the takeout box, examining it. \"Honey walnut shrimp...of course.\"\n\nAn overpowering glaze of artificial honey sweetness and soggy tempura batter combines to make a deadly mixture of texture and taste. The shrimp, dry, rests rotting inside its toxic shell.  The walnuts feel soggy and have a nuclear high fructose syrup sweetness to them.\n\nCop: \"Fit any recent MOs?\"\n\nDG: \"Yeah... The Panda's...\"\n\nCUT TO COMMERCIAL", "author": "Dave G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-12", "description": "Always packed and the tables don't get cleaned well, but the food is hot and constant to the taste of this chain.  They try to move the line well and it is in a good location, though.", "author": "Lyndsey C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-29", "description": "I got food poisoning after eating here on Sunday. I have been puking and pooping since I ate there...", "author": "Won't B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "Got a free sample of their surf and turf on 4/17 - greasy, meaty (huge chunks of beef and shrimp), with a smattering of veggies (green beans, surprisingly crisp potatoes). Great deal, will definitely get a full size entree next time I eat at a panda express", "author": "Michelle J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-31", "description": "This Panda Express is the one located at the food court inside the Westfield shopping center.  The latest offering is the honey walnut shrimp (minus the mayo dressing) which was very tasty and had a nice crunch as far as fast food goes.  It was almost as good as an entree you might order at a Chinese restaurant.\n\nIf you want smaller portions of food, request a Panda bowl.  You can get a choice of chow mein, fried rice, or steam rice topped with one item of your choice.   You can't go wrong with chow mein topped with the infamous orange chicken.\n\nIf you're really watching your waistline, order the kids' meal.  You can still get the 1 side with 1 item and a small soda.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-02", "description": "Not quite in a Chinese style, too sweet. And under the big mall, just fast food in a what so called \"healthy\" style.", "author": "Xwoman W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-07", "description": "My mother dragged me here today for lunch.  For 6.99, you can get a side (chow mein, fried rice, mixed veggies, or steam rice) and two items from the steam tray.  My mother picked the green beans with chicken and egg plant/tofu. The serving size has shrunk to half of what it used to be.  It's sad actually. \n\n For 6.99, we got about two scoops of white rice, a couple of beans, about three small pieces of tofu and eggplant, and five small slices of chicken.  I liked the chicken. The eggplant was sour.  The tofu was bland.  The green beans were crunchy and tasted fresh.  I wish they served hot tea here.  It would have helped us to swallow the hard rice that came with it.  Anyway, I would never come here unless I was dragged here by someone.  Do yourself a favor and go to Buck Horn (or McDonalds, Kentucky Fried Chicken, etc.)  if you are in the mood for chain restaurant food. This one just doesn't cut it.", "author": "Lorissa W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-03", "description": "I'm super disappointed in this Panda Express. \n\nTheir portion sizes are far too small! If I had a pair of balls like the woman behind me, I would've - like her - asked her to add more. I literally received 3 pieces of beef in one of dishes, and 10 pieces of orange chicken. When they're the size of almonds, that's just not enough!\n\nThe peeps at the register kept complaining about how busy it was, and how they don't get breaks. They also kept trying to up-sell me sides. NO! I don't want any cream cheese rangoon, for the third time!!", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-05", "description": "Panda isn't a bad lunch spot.  But most of you will agree that you can do better (especially in the Bay Area).\nBut every once in a while I will seriously crave their Orange Chicken.  There's something about the super sweet and overly breaded delicacy that I cannot resist.  And I tend to scarf down within a couple minutes.\nBut then it hits.  It's like drinking to the point where you feel the room is about to start spinning.\nOh the remorse of eating badly, the impending consequences, the PAIN OF IT ALL.\nSorry stomach.\nI find myself harping back to what I wrote earlier about finding something better . . . that is until the craving hits again.\nAgain sorry stomach.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-11", "description": "They charged me same every panda express, the portion was almost half of the other panda express stores.", "author": "Rose F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-05", "description": "ok, i admit to eating here, quite often. DOn't go during lunch time, the line will be long. The food is fresh and tasty and every month or so they have a new unique dish, this month it is garlic chicken, yummy. \ni generally get half chow mein and half fried rice. all the dishes are great.\nI would give it 5 stars, but they really have to do something about people who are not eating there, using the bathroom, this is a problem. I have seen some \"sqautters\" using the bathroom...not the best of things when you are eating, plus the smell of a smelly person is not condusive to a pleasurable meal.\nbut overall, it is the cheap food and quality that wins out", "author": "barabara b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-30", "description": "I know everyone has been to Panda Express at least once in their lifetime.  However, I decided to write a review for the one in San Francisco at the Westfield shopping because this is my most favorite Panda Express.  They have a very high volume in this particular location so the food never sits in the trays for too long.  There is always a line here and the food is always fresh.  Which makes it taste way better than all the other Panda Expresses that I have been to.  Whenever I am in the San Francisco mall I always have to order a china bowel.  They are also very organized and have lots of people working so you don't have to wait too long.  This is the cleanest Panda Express that I have been to as well.  There is always a lady that is cleaning up and whipping tables as soon as someone gets up.", "author": "Alice T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-14", "description": "The frustration of paying almost $9 for 6 pieces of honey walnut shrimp and 10 pieces of crack orange chicken is enough to make me go postal on the cheap bastards. \n\nIt's appalling.", "author": "Ty M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-11", "description": "First off, assistant manager, EVA, was not listening to my choices of entree. She just put random things on my plate when I didn't even tell her I wanted those things. Then before I can tell her she was wrong, she just leaves.\n\nThen I yelled at another worker saying that EVA wasn't listening, so she put the food I DID NOT PICK back in the tray. Then she got my order correct. It seemed like she didn't want to deal with me, so she just leaves also. It wasn't even my fault her assistant manager sucks.\n\nSecondly, I had a receipt that said I can get a free entree. I asked a worker how we can use the free entree receipt. He said you need to buy a 2 entree meal first, and then you get a separate free entree. But he was wrong. The deal was, you get the 2 entree meal and then you get one entree of those 2 entrees for free. The cashier explained that to me. That one star is for him. \n\nSerramonte's Panda Express has nicer people and they actually can speak to you when you have questions!", "author": "John P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-19", "description": "Awful.  Chilly employees, gristly chicken parts in the orange flavored chicken, dry over-heated string beans, and pricier even than the Panda Expresses back in downtown Chicago.  A 2-item combo and drink came to $8.91?  Jeesh, I know this is San Francisco, but come on.  Another reviewer wrote that this location is awful.  I concur and propose that of the dozen or so Panda's I've eaten at around the country, this mall location is the worst.\n\nThen again, perhaps it was karmic that I traveled all the way from Chicago and ended up at the same place I eat at a gazillion times back home.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-22", "description": "Panda Express is the spot to go if you want a quick lunch. This isnt the best spot inside the Westfield mall for food, but if you want Chinese cuisine this is the spot. This location gets super crowded during lunch time, anywhere between 11-1pm be ready to be greeted by a long line! \n\neveryone raves about the orange chicken, but it's a bit to sweet for my taste so i always skip that dish. the food here is cooked pretty well for a fast food chain. I get a SUPER FAT food coma after eating here all the time! so i try to skip this place for lunch unless everywhere else is jam packed! \n\noverall, Panda Express is a-ok!", "author": "Jenny G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-21", "description": "Inexpensive greasy shiny Chinese food, good on a cold evening if you want to build up some fat. Very busy place and I did find they always have the food they try to sell to be laid out first when you line up. It might be better to go and check first before lining up and ordering.\n\nI can't say it's totally authentic Chinese food but it has some trace to it.\n\nThe paper container did almost fall apart by the time I got home with all that hot and steamy food.", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-18", "description": "I can't believe I'm writing a review on Panda Express, but watever! I love this place. I don't know why everyone's hating on this place....I think it's good. Today I tried their new item on the menu \"Shanghai Angus Steak\" fucking hella good!!! the beef is soo tender and it comes with mushrooms and asparagus. This is my new favorite item on the menu for sure. I'm bout to go to vegas this week and if there happens to be a panda express I'm gonna get it again I don't care what anyone thinks. Pretty straight forward when you come here, no gimmicks, and food is yummy.", "author": "Diane L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-08", "description": "It's the worst place I ever eat. Foods taste disgusting!!!!", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "Pretty decent food as always! Workers are decently nice but can have attitude. I understand as a food service worker that if a customer takes too long to decide you go to the next person because you want the line to continue. Others without the experience might take it personally. I will continue to come back because I love their food and fast service", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-04", "description": "If I could give this location 0 stars I would. I have never have had such a negative experience in any resturaunt EVER. They mixed up the containers when I was at the register and charged me for someone else's food.. The cashier verified what I had by mumbling and speaking so fast I said I cannot hear you -this happened twice. Then one of the other workers yells out \"she asked you three times what you had\"  So she charges me again - now I owe more money??? When all was said and done I paid $14.00 for what should have 9.60 +tax. At this point I didn't want the food, never want go to a Panda Express ever again. The staff are just plain rude.", "author": "Janet C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-28", "description": "ITS PANDA EXPRESS YOU SHOULD KNOW THAT BEFORE YOU WALK THROUGH THE DOOR!!\n\nOF course its not the best Chinese food in SF but ok.\n\nThe trick with Panda Express is to go when its kind of busy but not too close to their closing time.  That way the cream cheese wontons will be fresh and so will the Chow Mein.\n\nIf you think it costs too much then don't buy a soda and get a water instead..", "author": "ben G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-12", "description": "I have great experience dining in panda express. Their foods are always fresh and you know it is because they cook it right in front of you. The foods are great, and services too.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-14", "description": "This is my spot. I've been coming here since it opened in the mall and it has cured many hangovers. I even have a memory throwing up in one of the garbages during a meal lmfao. I know most of the staff that work there and all the ladies are real cool. They hook me up with the food sorry if you guys dont reap those benefits. Orange chicken will always be my favorite I dont know how they make it but its so good. I will eventually become the duke of this spot, whoever it is your gunna lose it hahahahaha...... adios!", "author": "Marvin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-08", "description": "the following review is based on the orange chicken alone:\n\nAmazing.", "author": "Felicity M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-14", "description": "The thing about yelp is that the whole star concept is kind of misleading.  I mean, Panda Express is absolutely deserving of 4 stars based on the crack-laden Orange Chicken alone.  However, this doesn't mean that the food is on par with like Slanted Door or Perbacco or anything.  Just want to make that clear.\n\nHOLY GOD I WOULD MAYBE GIVE UP A KIDNEY OR A LUNG FOR MORE ORANGE CHICKEN.\n\nThat stuff is possibly the tastiest thing EVAR.  I want to put my arm around it while watching a nice RomCom.  I want it to hold my hand dearing the tender parts of said film.  I want it to get a little too fresh in the theatre despite my protests.  I want it to buy me dinner and somehow BE the dinner too.  Basically I want it in a really dirty, can't take home to mom kind of way.\n\nAlso this place gained an extra star for being kind of sassy to my friend today when he inquired about some dumplings and the lady acted like she didn't understand even though she clearly did.  And all the ladies that work here have suspicious names like \"Alice\" and \"Sophie\" and while those are lovely names I'm guessing those aren't actually their real names.  Awesome.", "author": "Evan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-08-31", "description": "Any resemblance between this and Chinese cuisine is purely Occidental.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-12-12", "description": "I apologize to my stomach for eating here. \n\nI apologize to the Asian community for eating here.\n\nI apologize to Yelp for even reviewing it. \n\n(Insert vomiting sound here).\n\n*groan* I should've known better....", "author": "Jay H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-09", "description": "Absolutely one of the most horrible Panda Express' I have ever been to in the Bay Area.  The service was ridiculous...ask for a fork, get a napkin...ask for 2 cups, get 1 cup... ask for a fortune cookie, and get no cookie - they said that they put one in my bag, but didnt and said i could not have another one.  On top of that, the got my order wrong....the place wasn't even busy, and i was already annoyed by the time i paid for my food. \n\n\n\nONE STAR for this disgrace of a Panda Express.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-07-12", "description": "I got broken glass here in my chow mein. Yep! Really. My molars found it.\r\n\r\nDid I get my money back? No. Not from the restaurant, not from Panda Express Headquarters, nowhere.\r\n\r\nSo there ya' go.  Don't go to Panda Express. It will make you bitter and snarky.", "author": "Missy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-23", "description": "Me no love you long time.\n\nMe had to find bathroom QUICK after lunch with you.\n\nMe no recommend you at all..", "author": "First C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-06", "description": "A place I love to hate....damn you Orange Chicken!!  Your crack infused glaze tempts me once a year.  \n\nI'm going to go puke now.", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-14", "description": "Certain things you are taught not to do in life:\n\nLooking directly at the sun.\nSuperglue as lube.\nOffer a cop a doughnut after being pulled over.\nGo on the twirly roller coaster after lunch.\nThink the movie \"Waiting\" is fictional.\nHave an ultraviolet light party at your Motel 6 room.\nEat at Panda Express.", "author": "Bill P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-28", "description": "I love Chinese food and Panda Express makes it so easy to order!  You just tell them if you want chow mein, fried rice, or steamed rice, and then you tell them how many selections you want.  It's easy because the selections are all on the steam table behind glass, so you can see what you're getting.  I like the beef broccoli, orange chicken, and egg rolls.\n\nWho needs to go all the way to Chinatown?", "author": "Dave Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-05", "description": "They must use some magnetic magnet to attract teenagers because the food here sucks major orange chicken! Somehow, I'm attracted ot this place as well during my former lunch time activities around the downtown area. \n\nGranted its mall food, but why does the orange chicken taste like reprocessed chicken meat deep fried and battered and drenched in sauce, spewed up Fear Factor style and cooked for the public to eat? \n\nI have tried almost everything on their menu and I'm safe to conclude that the restaurant chain should be renamed Diaherra Express. Even their veggies are filed with oil... wowzers for those on a diet.\n\nMall food is bad to begin with, and even if they write gourmet on it, it does not save them from being labeled mall food.\n\nDiaherra, cha cha cha!", "author": "Wilson L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-12", "description": "Extremely generic chinese food.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-28", "description": "It's not authentic Chinese food, but psh, if I wanted authentic Chinese food all I need is me, a kitchen, and a bag full of groceries from Ranch 99. \n\nNo, I come to Panda Express because I have some ridiculous and totally inexplicable love for its orange chicken. The chicken isn't very high quality, and sometimes there's so much breading that there isn't even chicken in the piece...BUT THAT'S OKAY. Because it still satisfies me in a way very few other things do. \n\nIf you're getting a 2 item plate, always get it to go because you'll get more food. I recommend the black pepper chicken for your 2nd item. The first being orange chicken, obvi. And if you just need an emergency orange chicken fix but can't take a full meal, order a kid's meal (one small portion side, one small portion item, chocolate chip cookie, small drink)\n\nnote: I would totally have given five stars to its orange chicken, but minus one star for this particular location of Panda Express. The store itself is okay, but it's in the old, sad part part of the SF Shopping Center and the environment is awful.", "author": "Ada T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-03", "description": "I know their food isn't the best for you but I looove their Orange Chicken!!! It's the best!\n\nMe and my sis came in here after shopping and had some orange chicken and broccoli and beef with some fried rice...yum!!!\n\nYeah..yeah...it's bad for you..but not if it's only once in awhile :)", "author": "Jade B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-22", "description": "Gee, and I thought McDonald's was bad.\n\nWith every bite you can taste the jelly blobbing FAT gushing out onto your tongue. Theres always a long line here, which totally pees me off. I'm just hungry and I want food! For even cheaper prices, you can get stuffed in any one of the 3 chinatowns in sf---real chinese food too.", "author": "Colleen W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-21", "description": "I'm all for Panda Express. It hits the spot...most of the time. This location is AWFUL. My fried rice was cold and stuck together and they were running really low on the side dish I ordered, so I had to wait at the cash register for a ridiculously long time. \nSkip this one.", "author": "Sophie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-23", "description": "AHhaha!\n\nContrary to everyone else, I love this place!  LoL  Mall food.\n\nI LOVE the orange flavored chicken!  Sometimes it is over-sauced, but it is great for sweet/salty/crunchy cravings.  \n\nI find it interesting that it has so many bad reviews, because the line is ridiculous and typically more than 20 people deep.  I think the poor reviews are from people who are hoping the lunch crowds will disappear.\n\nIt's consistent too, thanks to being a chain.  I've had it all over Cali to Texas...it's all the same.", "author": "Ladi Da A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-20", "description": "Earlier today I came to Panda Express inside the Westfield Shopping Center and saw that are correction were advertising \"Surf and Turf\" at the time it look good my experience well!!!  Not I what I wanted \"I wanted the Surf and Turf\" You know some type of Fish and Meat or Chicken anyways I walked in I told the young lady who took my order I wanted the Surf and Turf and I am not a fan of fried rice she start off Chow Mein or Fried Rice I told her I didn't want Fried Rice or Chow Mein she repeated to me again\" Chow Mein or Fried Rice\" again I told her I wanted to Surf and Turf what's on the window? She tells me I need to get Chow Mein or Fried Rice first. I avoided getting into argument with her I calming choose the nasty Fried Rice and now the third time I wanted the Surf and Turf the knucklehead behind the counter says \"OK\" and also said what meat do you want In my head \"Who in the hell hired your stupid ass\" I said\" Shanghi Agnus Beef\" she tells me its a dollar more In my head again \"WTF\" A dollar I was better off going to McDonald's instaed this place \"REALLY\" a dollar. And I ordered Pot Stickers and Nasty ass Egg Roll and a drink. And I got a small portion of Beef and 3pc of the Pot Sticker that Panda Express in the mall Suck Balls!!!!!", "author": "Chris Ackord P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-07", "description": "Not big on the Chinese food, it's like sushi to me.  I really, really have to crave it.  Otherwise, I'm really not that into it.  But I heart Panda...I know that in S.F. you can gets tons and tons of really good Chinese food, and most of it delivered to your door, but I don't care what anyone says...\n\nPanda makes the(E) best orange chicken.  And I love that you can see all the ingredients behind the counter in clear storage bins, and that it's always so clean back there.  So for that it gets 3 stars.\n\nI don't even want to know about all the other places, what I've heard, what I've seen is enough to scare me away!!", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-06", "description": "Don't pretend that you're better than this place. \n\nYeah it is crap, but before you moved out to the big city & you were some pimple faced moron making minimum wage at the mall you know you craved this \"food\". \n\nwait....that's just my life. Oops.\n\nI'll stop projecting now.", "author": "Rebekah K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-28", "description": "They no longer seem to make my stringbeans + beef, but they do make a string beans + chicken. They let me get the kid's meal, which I think is the best deal. For a little under $5, I got a serving of fried noodles, a small serving of string beans + chicken, a chocolate chip cookie, a fortune cookie, AND a small soda. WHOO! Food itself was alright. Typical americanized chinese food.", "author": "Melody L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-15", "description": "Panda Express is kind of like fast-food crack: you know it's bad for you, you know it's mass-produced, you know there are a ton of chemicals as part of ingredients that make that orange chicken, but you ignore it because as soon as it enters your system, you are overwhelmed with a feeling of comfort.  Yeah, you can find gourmet Chinese food in San Francisco, but Panda Express isn't even really Chinese Food...I'd call it Exotic Fast Food...wow, now I don't feel as guilty.", "author": "Ken G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-09", "description": "1 star for being cheap\n\n1 star for being what my cousin wanted and being a recognizable name in a sea of unknown food\n\n1 star for plenty of seating", "author": "Gracie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-01", "description": "Sigh, we had to succumb here when the new food court at Westfield was overflowing with ppl. There were at least 20 ppl in line waiting for Beard Papa's and millions of others at other outlets. It was like a famine scene at 3:30pm! \nDude, it wasn't even lunch or dinner time but I guess when shoppers forget to eat at their regular hours, this is what happens. Line moved quickly at PE and we satisfied our hunger but I kept reminding my bf that Kung Pao chicken and Orange Sweet Sour Chicken is SO NOT chinese!", "author": "Yan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-08", "description": "This place is always full when I go here. Never a good quiet place to chill and sit down. Either with friends or yourself. The food is ehhh okay...", "author": "Ronnel C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-11", "description": "A haiku:\n\nwhither shall I find\n\n     the Chinese food I crave here...\n\n                  \"Outlook not so good.\"\n\n   -- Yosa Busan (1716-1783)", "author": "Gilberto Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-15", "description": "I do not take drugs, but I think I did Sunday, when I accidentally ate here. I thought I would just regret it for the guilt factor, but the burps I had the rest of the day made me want to become Catholic so I could repent, and repent good.\n\nAnd to address some reviews below about how Chinese people would never eat here, that place was FULL of Asian people that day.", "author": "Shannon V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-18", "description": "I actually ate at this Panda Express once about four years ago. Of course it was pretty terrible (but kind of hit the spot). The only reason I stopped by was that I craved some vegetarian food and my blood sugar was low after spending hours in Urban Outfitters (this is pre-H&M days, mind you).\n\nAs an aside, I don't think Dakota Fanning is on Yelp yet, but she is apparently a HUGE fan of the Panda Express. She obviously has horrible taste and will end up bald and crazy like Britney. Check out this awesome snippet from People (feel free to share this trivia with friends and miserable Panda Express workers... I'm sure they'll be fascinated): \n\nRobert De Niro moved a restaurant to a different US state to celebrate Dakota Fanning's birthday!\n\nThe 'Godfather' actor threw a surprise party to mark the child actress turning ten on the set of their thriller 'Hide and Seek' in New York.\n\nTo make it extra special he arranged for food and staff from her favorite restaurant in New Jersey to be flown in.\n\nDakota, now 12, told Vanity Fair magazine: \"Bob De Niro, everybody calls him Bob, gave me a surprise lunchtime party for my tenth birthday. They brought in my favorite restaurant. It's Panda Express. It's Chinese fast-food, but good.\n\n\"They don't have one in New York City, so they brought it in special from New Jersey, and the cupcakes spelled out 'Happy Birthday Dakota'.\n\n\"I walked into lunch, and they had all these pamphlets with pandas on them.\n\n\"I turned round and there were all these Panda Express people with their spoons, ready to give me chicken and stuff, and I turn round and Bob's in this bloody raincoat from the film, saying, 'Happy Birthday.'\"", "author": "Trey F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-13", "description": "Generic-ass CHinese food.. Yes. But yummy? Yes indeed. Maybe its cause I'm sick of eating all the traditional.. but the food here is very flavorful and colorful indeed. \n\nI'd hate to bust out my own people, but for the sake of fairness and Yelp, I guess just this once. Most of the employees working the counter are Chinese ladies. And today I heard them cuss at a customer in Chinese \"sei pok guy\" which would literally translate into \"dead, trip on the street\" but its not meant to translate in just literalness. \n\nConvenient, fast and cheap for food at the mall.", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-14", "description": "One of the most expensive Panda Express locations you will ever go to. $6.99 for 2-entree plate and $8.29 for 3-entrees. \n\nI went later in the night so it wasn't as busy as the dinner rush when the line is by the door. One would think that you would not see Chinese people dining here but there are. I always opt for the 3-entree with chow mein. Entrees vary between: string bean chicken, sweet fire chicken breast, Beijing beef, broccoli beef, orange chicken, and eggplant tofu. The eggplant tofu at this location tends to be very fresh and tasty. Note: everything will most likely be soaked in oil, so don't be as disgusted. I asked for fresh string bean chicken as not even a scoop was left in the nearly empty tray. I've grown to like the sweetfire chicken breast even though I am allergic to pineapples. Half the serving was pineapple pieces though. UGH. The broccoli beef was alright...I've had better at other Panda Expresses. The serving of chow mein I got was disgraceful. This is the case for ALL Panda restaurants. If you were to compact the chow mein (or whatever side you get, be it fried rice or white rice, etc), half of the takeout-box compartment would appear.\n\nNow maybe it's just me that has a fast metabolism but I am not full after a 3-entree course. I always do the surveys on the back of the receipt for the free entree; it saves me $1.25 at least! But anyway, portions need to be seriously more generous for the price the restaurant is asking. I left the restaurant after I got my togo box with fresh string bean chicken, which I had to wait 5 minutes for. I sat down at the lounge chairs in the Food Emporium and took out all the boxes from the plastic bag and did not find a fork anywhere, mind the napkins that were not present either. I totally forgot those were self serve and the employees didn't even care to remind me. I had to give up my cushioned seat and marched myself back just for utensils. I had to find a lone seat at a counter and ate the night away. I'll always be a happy camper at Panda Express, for the most part. \n\nOne more thing, the restaurant is pretty darn clean. The \"sanitizing lady\" does a fine job of cleaning the chairs, tables, floors, glass, counters, etc. Props to her!", "author": "Dominic T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-25", "description": "Well, I'm Chinese and I have no IDEA what AUTHENTIC Chinese food is suppose to be like. But I LOVE this place...AWW...come on...American people are complaining about how this place sucks and that it is not Chinese food. And yet....they go to Starbucks(they don't serve genuine coffee), McDonalds(frozen items to be reheated),etc...etc...\nThe Orange Chicken, Shrimp of the Day, Hot and Sour Soup, Fried Shrimp, Mongolian Beef, and Spicy Eggplant and Tofu are all must haves!", "author": "Club G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-25", "description": "clean, fast, quality chinese food. oh free water!", "author": "Freya-Loki O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-30", "description": "I mean, I don't know what anyone really expects for chain chinese fast food.  I don't know what I expect for that matter!?  I mean, sometimes you are just fucking starving and you think no one can fuck up lo mein and beef and broccoli.  It's just barely edible.  I'm not completely ignored.  So they get 2 stars.", "author": "Miles L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-12", "description": "Like any other Panda Express really. I just like how their portions are pretty big! Before going to this Panda Express, I went to the one in Great America and their portions were soooo tiny! Glad that this place gives you lots of fried rice, even if I couldn't eat it all. More is better when it comes to food :)", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-04-12", "description": "why would any self respecting tourist come to SF and eat at FRICKING PANDA EXPRESS?  morons.  I guess that's just it.  they have no self respect.", "author": "Fong L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-03", "description": "Beware... none of their food is vegetarian... don't let them fool you.  I had to go on some back page of their website where it says everything is made with chicken stock.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-24", "description": "I would make love to orange chicken every night. He gives me orgasms, more than any man can. wink wink ;p pick u up around 3 tomarrow for some afternoon nookie. I mean fortune cookies.", "author": "Nancy K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-04-11", "description": "two stars only because of good memories. i remember when they first put in a p/e in stonestown. we used to sit around being mall rats when we discovered one of the bestest games ever. you down a few packets of that spicy yellow mustard sauce, do about twenty jumping jacks, and see who can fart the most. ahhhhh good times. \r\n\r\nthe food? ehhh its mall food what do you expect?", "author": "Euge L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-29", "description": "Say what you want to say. There is no better place to eat... in the San Francisco Shopping Center. Go when they're busy. The high turnover = fresher entrees which makes a HUGE difference in taste.", "author": "Tom L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-13", "description": "Speed and efficiency.  Food is average but filling and satisfying.  Need a quick fix for the next few hours?  This will do...", "author": "R G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-24", "description": "I really like Panda Express when I am shopping downtown. I am suprised by all the negative comments. It's always freshly made because of the crowd it gets. I love their kung-pao chicken, chowmein! It's awesome for mall food.", "author": "minerva m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-02", "description": "i  eat here to get my orange chicken and chow mein fix, ha!ha!ha!. i've tried the other location at Stonestown Mall, it was ok. But, this location really cooks the best in my opinion.", "author": "m e."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-05", "description": "You know that their cooking sauce has like 50 weird ingredients that you can't pronounce in it? Just imagine all the chemicals that food has. I'll admit its good but it makes you wanna throw up afterwards from all the chemicals.  Never again im eating there. Plus, they don't give you a mall employee discount. Fuck Panda.", "author": "JK R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-06", "description": "though i'm not the biggest fan of panda express, i'll eat it once in a blue moon... \nbut not here... somehow after i head something from here it just gives me this bad feeling.  not sure exactly what it is... maybe that i'm trying to stuff the whole 2 item combo in one sitting?  that might be part of the problem as the portions are plenty for two (people or meals)\nthe lines get super long here... which tends to be the case for most panda express locations... the good thing about that is the orange chicken doesn't get a chance to just sit there... so at least it's as fresh as food at these places get...", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-30", "description": "i can't believe i had panda today! i was craving chow mein and this is all i can find in the area that's cheap.  i was going to order only a side of chow mein and the lady showed me 2 sizes, one for $3.96 the other fr $6.19.  you barely get anything so i went ahead and ordered a combo meal...chow mein, orange chicken, and string beans with chicken.  panda ia not a good representative of chinese food but sometimes their food just hits the spot.  longs lines during lunch cuz it's in the mall but they give you a lot of food.  order to go cuz i think you get more cuz the box is bigger than the eat-in plate.    \n\nif anyone knows of a good chinese restaurant to go in the union square area..please let me know.  and i'm talking about good chinese food...rice plates, chow mein for cheap.  the tian sing place across my work is good but way overpriced.", "author": "D W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-05-21", "description": "So awful.  So terribly terribly awful.  Seriously, just don't go there.  I know some people love that \"orange chicken\" but I swear there is neither any orange, nor any chicken in that dish.  I'm not even sure what that meat stuff really is.  I've never been able to re-create it from a real chicken.  And I've tried.", "author": "matthew w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-27", "description": "i ate here for lunch today. while i was in line, there was a bum digging through all the trash cans and brushing his hair. when security came he mysteriously vanished. right after i paid and sat down the bum came storming back ran behind the counter and started banging his head against things, stirring up all kinds of bum dust. it was pretty hilar, the food was whatevs and the atmosphere today was pretty sweet with all the commotion,  but i wouldn't recommend eating here for the rest of the day, due to bum contamination.", "author": "marky m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-07", "description": "This is the place where I'll go and have one egg roll and regret it for the rest of my life.", "author": "Jackie I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-23", "description": "There is no \"chicken\" in the Orange Chicken.  Batter disguised as chicken in a gloopy sauce does not a chicken make.", "author": "K W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-03-13", "description": "It's just OK.  About on par with mall food, and nothing spectacular.  When I go, I order the artery clogging Orange Chicken, and balance it out with the grilled Mandarin Chicken.  Like I said, nothing to write home about. Good if you are on the run.  Could it be we are spoiled in SF with some really great Chinese food??", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-13", "description": "I like Panda Express just like I like McDonalds. The food isn't that good, but what do you expect from the mall's food court. Panda introduced me to chow mein and for that I'll be eternally thankful.", "author": "Philip M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-12", "description": "If you don't want to traverse to Chinatown nearby, and you just want a choice of the few places in the San Francisco Shopping Center, I'd say this is an ok spot to choose. But if you are like me most chain chinese places still use MSG. Panda doesn't and that's good for someone like me. The orange chicken and beef and broccoli are good, along with the fried rice and lo mein. The new bowls are good as well.", "author": "Anthony F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-12", "description": "The broccoli beef and orange chicken are decent.  Everybody knows this is just quick, fast, bastardized Chinese food, but hey, better than the other garbage they serve at the mall.  I have noticed that the portions are getting smaller and smaller.", "author": "Tinou B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-06", "description": "Wow! I must love junk food too much or something? No one seems to think highly of this place unlike me? Well, I can't help but love their fried rice, chow mein, and orange chicken! I don't go here as often but sometimes when I smell it, I can't help but be tempted. They have other dishes that I like like the beef and broccoli or their kung pow shrimp! Yum!", "author": "Mel P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-06", "description": "Of course it's not authentic, but what do you expect. It's not bad for fast food. Some of the food is addictive. Horrible for your waistline, but everyone has to indulge one in a while!", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-05", "description": "I usually love Panda Express Orange Chicken. Like LOVE IT. If I know anyone mentioning they'll be within 100 miles of the mall at any point in their day I ask if they can grab me some orange chicken. However, the one time I went to this Panda Express it wasn't really that good. Sadness.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-10", "description": "I only like the Orange Chicken here! Everything else is total fast food style Chinese food. Definitely not top quality......just trust me and only order the orange chicken and you will love this place.", "author": "Tyler D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-23", "description": "The food here is okay, not real good Chinese food. That's pretty much expected. The menu was pretty expensive compared to the amount of food they give. I ordered the 2 entree and got the chow mein, orange chicken, and sweetfire chicken breast. The people scoop very little for eveerything. They scooped some orange chicken into my box and took some out. When I began to eat my food, eveerything was super dry and left my mouth that way. I didn't order a drink since the whole thing was costly enough. Overall, it was okay, not that great.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-06", "description": "I had never tried Panda Express before, but I walked in here today during my lunch break and was pleasantly surprised.  The fried rice was pretty good, the chicken with beans was sweet (as in sugary) and the spring rolls were not tasty.  Service was super-fast, but not friendly.  I've eaten a lot worse for more money in the food court next door, but I don't think I'll be back.", "author": "Marijke D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-04", "description": "this is one of my favorite fast food chinese places. whenever i go to a mall and i spot one of these i stop searching and grab the best they have: orange chicken.", "author": "papa c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-14", "description": "i like panda express.  but this one is really really stingy.  their workers are probably told to barely scoop in the food.", "author": "T. N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-20", "description": "I love their food and this is the best panda express despite the heavy load of customers they handle. They need to be a little more consistent with their portions and I will go for a 5 star service.", "author": "S A."}
