{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-14", "description": "Pane E Vino serves classic Italian food with great service. Dishes include a big plate of fresh food (the fresh pasta items are the best!) and each meal comes with warm bread. Pane E Vino's olive oil tastes so good with the bread and is definitely different from the olive oil you might find in a typical grocery store (add salt and pepper into the oil for extra flavor!)\n\nThe menu for this place is huge and includes a ton of different Italian dishes. The server was very friendly when I couldn't decide on which pasta dish to get and he said he would \"surprise me\" with his favorite. It ended up being the \"pappardelle con funghi galletti e prosciutto\" from the specials menu. It was basically wide egg noodles in a cream sauce that was so delicious. \n\nPane E Vino is a bit pricey but I would say the price is pretty spot on for this type of \"date night\" restaurant. I think this place also caters to an older crowd; at one point during my dinner I looked around the full restaurant and noticed that my table was the only one that has diners under 30 years old. Even so, the environment was homely and inviting - I didn't feel out of place despite the age gap. \n\nI plan on coming back and trying a few other pastas as well as ordering a wine from their huge wine menu!", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-22", "description": "This restaurant obviously panders to a certain crowd. A crowd that looking around is probably retired or close to. \nThe service was slow but friendly. The bus boys were quick to clear plates but never refilled water. \nI had a glass of Prosecco, and would have liked a second one with my main course but was never attended to by the waiter or service staff. \nMy friend had the Scallops as an appetizer, they were fragrant in all the wrong ways but apparently palatable to him. He rated them 5 out of 10. \nMy entree was the Risotto with Seafood and it was bland/plain (probably to cater to older palates) the shrimp was hard and had more bite then most of the clientele and I could not eat much more as it was simply unappetizing. An Entree for 25 dollars and I will probably hunt down a slice of pizza else where on my way home. \nThis was a major disappointment on all levels.", "author": "Laurence T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-03", "description": "If your looking for a place where they use prepackaged dried pastas, basic table bread and basically cater to the seniors of Pacific Heights old money crowd you've found the place. \n\nMy date and I were sat fairly quickly after a couple who had a reservations. We were sat inbetween a loud group next to us and the couple who had reservations. The host was disingenuous with his service and our waiter was hardly seen throughout the meal. I got the clams vongole and my date got the spaghetti with meatballs. Hers looked better than mine but she only ate maybe half of it. My clams were very briney and I had a few with sand still in them... My pasta was undercooked and the sauce was less than average.\n\nNeedless to say Im not coming back here not only on my experience but the lighting and decor was less than ideal. The price was good and affordable but I felt like being at an old folks home being in there. Also, part of the restaurant looks like a deli with a refrigerated display case... so strange.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-17", "description": "3.5 stars\n\nTL;DR fairly unremarkable interior and limited seating, but great food. That house bread and olive oil....oh, my.\n\nWe had...\n\nENTREES: Capricciosa Pizza and Roasted Half Chicken (special). The pizza was one of the best I've had and tasted great even the next day. (FWIW, I'm a Chicagoan. I've been told this makes me some sort of pizza guru..go figure.).\n\nDESSERT: Profiteroles. These were filled with gelato, not cream as they traditionally are (and as the menu had written). The chocolate shells were no bueno.\n\nCOFFEE: Espresso and Cappuccino. The capp was delish!\n\n\nService was okay -- not overwhelmingly friendly or quick, but decent. We were also celebrating a special occasion, and our servers either forgot or were unaware.", "author": "Nic Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-20", "description": "Very delightful dinner.  Loved the bread and olive oil.  Was going to buy a bottle of olive oil.  Really enjoyed the pasta.  Loved the server, who was funny.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Excellent service by Favio and the rest of the staff.\n\nThe special antipasti Guazzeto Di Pesce (similar to cioppino with clams, mussels, shrimp and calamari in a delicious slightly spicy tomato sauce) was fantastic. For sure I'll have this again $19.95\n\nThe special Pappardelle con Funghi Galletie Prosciutto (extra wide egg noodles, chantrelle mushrooms, cream snd prosciutto) was awesome $22.95\n\nThe Montepulciano d'Abruzzo wine was great ($11 per glass)\n\nThe bruschetta has the most tomatoes I've ever had. Delicious.\n\nThe dessert gelato was delicious although a bit too pricey at $10.\n\nThe dessert Profiteroles's cream puff seemed old $10.\n\nThe coffee seemed like Nescafe.\n\nOverall this is a great Italian restaurant.", "author": "Vic M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "After seeing Aladdin, we stopped by Pane E Vino for dinner. We parked at a parking structure a couple blocks away and it was not very crowded around 5:30. \n\nEverything was delicious.  From the olive oil to the last bite of dessert, the food was so good. They served bread with real extra virgin olive oil for dipping. The spinach salad was excellent and even the regular dinner salad was good.  They were not overly dressed and the pancetta added the special touch to the spinach salad. The calamari was crispy and the marinara sauce served on the side was super flavorful. The ravioli covered in browned butter and marinara sauce was amazing. The chicken with vegetables was also delicious. The penne with cream sauce was great and not too rich. The desserts were not super heavy and they tasted great. The cheesecake was creamy and not too rich. The fruit tart was light and the cream went well with the tart berries. My favorite dessert was the affogato. It was the first time I had every tried an affogato and it tasted like the best coffee ice cream I had ever had.\n\nOverall, the whole food experience was delightful. The service was great and the restaurant had a relaxed atmosphere.  I do not typically order dessert when I go out for a meal, but a three course meal is a must here. If you are in the area, stop by and try this place.", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "We had a big family dinner for 20. The owner was more than accommodating and gave us our own table in back. The food and service was delicious! For appetizers, we had antipasto (cured meats and vegetables), salad, and pizza (white and mushroom, mushroom was my favorite). I ordered the capellini pomodorro for dinner. My wife and I loved it! Angel hair pasta with tomatoes, garlic, and basil (STRONGLY RECOMMEND). For dessert, everyone share multiple affogatos and tiramisu. Both desserts were delicious, everyone cleared the plates. Overall great service, incredible food, and relaxing atmosphere. Anytime our family comes to San Francisco we'll come to Pane E Vino.", "author": "Dustin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-06", "description": "If we've a large party and a special occasion this is where we come. Tried and true. Lot to be said for that when you're feeding many and don't want to experiment with food or service. \nBoth here are terrific. We were 11 people this time and were well-cared for from start to finish. The service never waivers. They're accommodating and check in regularly in an unobtrusive manner. Whatever you need they're happy to accommodate. Not one of these places that sighs when you ask for more or different. \nThe antipasto starters for the table are delicious. Cured meats and pickled vegetables are just perfect to whet your appetite. We had everything from salmon to pasta, pork and steak; the food is terrific. \nIf you need a go to real Italian San Francisco flavored restaurant, then this is a lovely place to come. We will of course be back.", "author": "Peddie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Oh man, was this spot delicious! A little piece of Italy hidden in a rather unassuming neighborhood spot, if you will! (The wait staff even speak in Italian).\n\nWas visiting with a friend, and Italian food had to happen while we were in town. Found this spot, and decided to reserve a table using their website (It wasn't crazy busy at first, but it picked up fairly quickly after being seated, so I'd recommend reserving a spot!). We were seated upon arrival, and provided with excellent service throughout our visit.\n\nThe free appetizer bread w/olive oil was stellar (great, crunchy crust with a airy, soft crumb). I ordered the fettuccine al formaggi with a glass of wine, and was treated to some of the best pasta I've come across in quite some time, as well as ever! My only regret is that there wasn't enough time in my short visit to SF to come back and try some more stuff here.\n\nCome here, and forget about counting calories for a day. You'll be glad you did!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "My boyfriend and I came here for date night on a Saturday around 7:45pm. We were expecting a long wait, but it was only 15 minutes! Definitely a crowded spot though, and would recommend making a reservation.\n\nWine: we brought our own bottle, and the corkage fee was $30. A little expensive, but not terrible. Most bottles there were around $40- $50.\n\nFood: the bread they give you is BOMB. it came out hot and fresh. I wanted to get a salad, but none of them on the menu seemed that appetizing to me. They were all pretty plain. We each got a pasta- he got the linguine- frutto de mare and I got the the truffle mushroom pasta that's not on the menu. They unfortunately did not have the special tagliarini that it's usually made with, but they let me pick which pasta I wanted which was nice. I got fettuccini. Overall, the sauce of the pasta was really good, but I saw some other pictures on yelp that had shaved parmesan slices which I did not get. I enjoyed it and it was a good size portion, so I would give it 4/5. I think if I had gotten the taligarini, it would have been 5/5.\n\nOverall: I would come here again for the same pasta dish. Kind of annoying that there's a $2 per person charge... just because. with no reason.", "author": "Jenna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "The patio is where to be. The food is great and the selection is incredible! We went with a large party and they were able to accommodate quickly. The patio makes you feel like you're in Italy somehow. I loved it.", "author": "Gianna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "Wow! We had a family dinner at Pane e Vino on Saturday, and our group of 12 had a fantastic meal. We had pre-arranged a set menu with several appetizers and a choice of main course. We all enjoyed a house salad and platters of their Antipasto Della Casa, then an assortment of pizzas. Our main course options were delicious and our group was commenting on how tasty the pasta, chicken, and salmon were. We were well tended by servers and they were so accommodating with bringing out our own cake that we had brought, and singing happy birthday to my brother. It was a lively and lovely evening with family and friends and we will be back soon for another great meal!", "author": "Alison J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-02", "description": "Great place, the service was a bit uncomfortable specially when we asked to split the bill between the four families, I understand it is work but there was not clients anymore they had lots of time and we were a party of 30 people, the server just came by and left, we asked him to help and he just walked away mad. We had Been there the night before and went back with a big party, so I think they should've noticed we liked them place. I think they need to pay more attention to clients.", "author": "Custo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "Love this place. The food is a little uneven but it has such a wonderful selection of pastas. It's a big menu without being overwhelming. It is not the same old same old menu that you would get around town with just spaghetti and meatballs and basic boring stuff. Their pastas are truly great. Highlights include the Penette, the Fusilli, the Bolognese and the Bucatini.   The Steak (bistecca) is also great. As is the Seabass. \n\nThere are things on the menu that don't always live up, but overall it's very yummy, cozy place.", "author": "JT B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-20", "description": "I love the food and casual atmosphere here! Good for first dates or family dinners. My favorite is the simple capellini dish but all the pastas are good. The service can be SUPER slow so don't go before a show but it is usually worth the wait.", "author": "Alicia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "Delish! We were walking by and looked at the menu came back after they opened.  They were totally booked with reservations but did have seating in the back which was perfect.  Very friendly.  Bread was great  but would have been better with parmesan  cheese to dip in with the olive oil.    Dinner was solo good and they pizza was to die for.   Again delish and would go back in  heart beat!!!  Keep up the great work !!!!!", "author": "Angel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Popped in late near closing time to find a full house.  Didn't think we could get seated but they got us in and did it with a smile. We had a great meal, very solid pasta offering, nice portions size.  Service was likewise fantastic, warm and inviting and they didn't rush us.  Thank you!", "author": "Eric M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "I came here for the first time last night with a friend. It was packed and we didn't have a reservation but we were seated immediately. Both of our pasta dishes were fantastic and we were stuffed by the end of dinner. \n\nOur bill came out to $67.16, we split the tab and it came out to $34 even. It's not a big deal, considering it's only 84 cents, but why was our bill rounded up? If they do that to every customer, that can add up. Anyways, good Italian spot, but I'll keep exploring for others in the area.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "Had dinner reservations, seated within a few minutes. The restaurant is small but provides a romantic setting. The food we had was good, standard Italian menu options. Service was quick and friendly.", "author": "Jasson C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-12", "description": "I have been coming here for more than 18 years. Like way back when it was in the location where Terzo is. The food has gone completely down hill. \n\n1.  Artichoke app is tasteless. Period. \n2.  Papardelle alla contadina (chicken and pink sauce) - I have had solely this fish for years and it was bland and tasteless. \n3.  Baked Eggplant app (think eggplant lasagna) - ok\nService - I asked for parmesan cheese around 3-4 times before it came.\n\nHonestly, food is most important and I am not coming back here again which is too bad because the neighborhood needs a homey Italian restaurant (and don't tell me contrada is homey).", "author": "Deal G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "Came here for dinner with my team from work and was surprised by how fun their service was. We tried ordering wine but they didn't have the bottle we wanted so they kept offering us another bottle that was more expensive. \n\nTheir bread here is really good and we also demolished their prosciutto board pretty quickly though it didn't come with any melon :/. I got the truffle mushroom pasta which was so good, and my friends calzone looked awesome too. \n\nThey also threw in a couple of tiramisius on the house which was super nice! \n\nPrice point is a bit more expensive but worth checking out compared to lots of north beach places for Italian!", "author": "Kristie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "Another smashing success at dinner with a buddy this past Monday. Instead of pasta, I went for the lamb scottadito, with veggies. It was to die for.\n\nThank you guys!\n\nA shout out to Fabio", "author": "Massimo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "I don't usually get fish at an Italian restaurant, but while flipping through Yelp reviews I saw several pics of grilled white fish that were reminiscent of meals I enjoyed while in the Mediterranean. Moments after I showed the chef he exclaimed, \"ah the branzino!\" He assured me it was grilled, no butter, \"just olive oil\" and would be great. I accepted. When the meal came I became thrilled as each bit was perfect. The delicate fish was grilled to perfection and not a minute overdone like so many other careless places. It was served on a bed of thinly-sliced moist potatoes and served with a side of veggies. It was such a simple dish, fish, olive oil, pepper, salt, but the irony is that the most simple dishes are the easiest to mess up. I can't wait to return.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Its my all time favorite Italian restaurant where you cant go wrong with the food. \n\n- Classic, old school; cozy ambiance in the main room. \n- They have extra sitting at the back glass room with is great for large groups/parties. \n- The service is superb, very attentive. \n- Its always busy with regular returning customers. So best to call ahead to do a reservation. \n- The secret which is not on the menu but has a loyal fan following is the Truffle mushroom pasta, its delish and turns me into a vegetarian every time.\n- The portions are good individual portions.\n- If 2 people, best to take the carafe of wine to share for $22\n\n Good hearty Italian food in SF.", "author": "Payal B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Date night with wife. Wednesday night seemed busy but they got us a table right away. Had the antipasto plate to start. It was like we were back in Italy. Wife had risotto. It was great! I had veal scallopoini. It was great also. The service was the best I've had in a long time.", "author": "Keith M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "We went to pane e vino for my sister's birthday celebration a few weekends back. Had a reservation, but got there 15 mins late. They had saved the table for us and we were seated immediately in the enclosed patio area. The staff was friendly and attentive. \n\nWe got a lot of food - \n\nMinestrone soup - light and filling, a little lacking in seasoning.\nBruschetta - great\nCaprese - Good\nInsalata pane e vino - decent\n\nA made to order veggie pasta with marinara sauce - good\nMushroom and black truffle pasta - not on menu, special request - amazing!\nVeggie risotto - completely lacking in flavors- definitely skip this one.\nMargherita pizza-  simple yet tasty - awesome.\nThe chef special fish dish - cant really recall the type of fish, but the dish was tasty.\n\nProfitroles - cream puffs with gelato and chocolate - decent stuff\nAfogatto - delicious.\n\nOverall a good meal with family.", "author": "Dee V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-13", "description": "I have not eaten at Pane E Vino since they moved from Steiner street probably 10 years ago...maybe more.\n\nI must say the meal was just okay. The ambiance is really cute and the place was buzzing for a Wednesday. Service was pretty friendly, albeit my friend eats there all the time and they know her there really well.\n\nFood: The misto salad tasted fresh but it was just a salad no surprises there. The mushroom pizza was good but a tad soggy on the bottom...bummer for a thin crust pizza. I am going to be totally honest California Pizza kitchen had a much better thin crust pizza. \n\nThe pasta, a tagliatelle with meat ragu was actually pretty good. Nice all dente spinach and egg pasta with a hearty meat sauce. Pasta was cooked well not over salted and the meat sauce had wonderful flavor ( probably the best part of pre dessert meal). Our roasted chicken was very very mediocre. Flabby chicken with meah skin and meah potatoes and vegetables...pass.\n\nThe sangiovese glass of wine was pretty great and the pour was very generous.\n\nDesserts were excellent: Tiramisu was tasty albeit small and the cheesecake was rich and delicious.\n\nWould I go back???   maybe....but there are some really dynamite Italian restaurants in the city that I would much prefer to go to.", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "Great b-day dinner for my dad on a Saturday. Located in the quieter section of Union and apparently a strong local following with several shop owners and other patrons greeting each other and the staff. Made reservations ahead of time so were seated immediately. Certainly busy but not overtly crowded.\nGood variety of some traditional Italian offerings along with a list of specials. We started with a bean soup of the day and a lovely caprese salad. Entrees included 3 pasta dishes: smoked salmon with bowtie in a beautiful light cream sauce, pappardelle with grilled chicken & porcini in a light tomato cream sauce, and my favorite of the 3: rigatoni with sausage, the tomato sauce had a wonderful flavor enhanced by the sausage\nFor dessert we shared a seasonal berry tart (raspberry) and a good tiramisu slice.\nOnly negative, no recognition of my dad's b-day even after putting notes on the reservation and making a point to order dessert", "author": "Kat H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "after a long day of being tourists at fishermans warf, we felt like we were transported to italy when we walked into the back patio. the service was prompt, everyone was speaking Italian, the food was flavorful (not to mention the wine was out of this world) this spot is a treasure.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "The food here tastes so good. Just as good as food in Italy. This is my go to Italian restaurant.  I kind of don't want to let the secret out, but I feel like I owe it to the world.", "author": "Kathryn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "I made a reservation for my daughters birthday solely off of Yelp reviews.  I am so happy I did!  I wanted the dinner to be special for my daughter and her friends....and moms too, so I called Salvatore at least 4 times with questions.  Each time he was polite, and gracious, and assured me all would be ok.  He was right, it was awesome!  We had a large table in the back and it was just perfect.  There were others dining in the same area, however it still felt very private.  \nEverything was awesome, the food, atmosphere and the wait staff!!!  Thank you for helping to make my daughters birthday celebration memorable!", "author": "Lin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "This place is lovely. I am surprised I've never been here before since it is so close to my house. My fiancé and I came here when I was too lazy to cook dinner and we didn't want to walk far. \n\nAs soon as we entered, it smelled really great. There was a combination of tourists and locals. \n\nOur server was hustling. I appreciated that he knew the menu super well, even when we butchered the Italian. He was able to recommend us wine as well. \n\nBeware on the wine. They poured our glasses super full. My pizza was solid and my fiancé loved  her mussel and clam linguini. \n\nI would come again if I was entertaining my family or taking a picky eater out.", "author": "Mitch C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "Some of the best Italian food we've had! We happened to walk by and decide to eat here, and what a good decision that was! They were busy, but quick to find us a nice place to eat.  I ordered the ravioli which was made fresh that day - it was AMAZING! So so so good. My husband had a margarita pizza (baked in the stone fire oven) and it was also amazing... Everything was so fresh and tasty.  The staff were so lovely and the atmosphere was charming.  I'd definitely go back and I 100% recommend this restaurant.", "author": "Leanne J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-01", "description": "It's been several years since my friend and I visited what was once a fantastic restaurant. Last night we returned and were deeply disappointed in our food experience. The service, as always, was professional and warm; however, the same cannot be said for what we were served.\n\nWe began with the mozzarella caprese. At the peak of summer when tomatoes are at their best, the three slices presented were hard and tasteless and the mozzarella no better than what one might find in a supermarket. The overpriced calamari fritti was disappointing served with a tasteless tomato goo. In view of the first two courses, the penne puttanesca was OK, however, the bread and recommended rosé wine were very good. \n\nTime to get the kitchen crew together and bring this place back to its former level of quality!", "author": "Tom B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "I have been here twice and had a great meal both times.  The bread is fresh and delicious, the wine list is good, the service is perfect, love the ambiance, oh and the food is delicious! \n\nMy favorite are the pastas and pizza.  Authentic, simple, perfect.  \n\nHighly recommend.", "author": "Cari N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Awesome, Awesome, Awesome..... Did I mention Awesome..... We live in St. Louis Mo, home of the Italian area called \"the hill\". Real authentic classic Italian foods, with no less than 20 highly rated restaurants. Simply a huge benchmark to compete against. And did Pane E Vino do that, they defined freshness and service. Easily finer than anything we have here. I requested if the Seafood pasta could be made with White Wine sauce instead of the Red, served perfectly. We also had the Fettuccine. It had the right balance of cream sauce, not over bearing like some. Everything was so fresh.... Get there early as the place filled up quick. Definitely on my top 5 list period.... You have set a higher bar for our local Italian favorites. We will be back, next time in San Fran, thank you very much Pane E Vino..... I forgot to mention, we regret not grabbing one of those deserts after that meal.... Next time for sure!!", "author": "George M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "Loved this place as it has an old school feel! \n\nLove the eggplant parmigiana as it is not salty at all. It is moist as well so it is juicy and not dry. \n\nThe burrata was fresh but I did not get to really ascertain how it tasted because the serving was not that generous unlike the Burrata serving size  at Cowgirl, Ferry Bldg. It had only one dollop. At first bite, it seemed fresh and good. \n\nMy friend had the putanesca which was OK according to him.\n\nExcellent customer service esp by Jose, the food runner/ bus boy who kept my water filled up, bread basket and olive oil dip refilled, and even ran after me to give me my sweater which I forgot. Jose is due for a raise!\n\nClean restrooms!  The only caution is this restaurant has no valet service and everything here in this area is street parking but it is also residential. We had to park near Fort Mason and walk back so that we can park our car.\n\nRecommended.", "author": "Kitty D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-31", "description": "This place was like a little piece of Italy, the food was delicious and the service was outstanding. They give great recommendations if one were to be indecisive, and the final presentation of they're platters can't go unrecognized. Overall, it was a great way to spend a Sunday evening with my family.", "author": "Jullianna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "This is more a review of how well we were treated than a review of the food.  My wife and I are both vegans and were in a rush to get to the theater last Friday.  From the moment we arrived at Pane e Vino we were taken care of graciously and promptly by the maitre d.  He informed us of a short wait and minutes later gave us the option to sit at the bar.  We accepted and let him know we needed to get to a show by 8.  He expedited everything food, biil, cc and 30 minutes later we left having had a delicious if rather fast meal.  Thank you, thank you, thank you.", "author": "Scott W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "OH HO HO haaaapppy tummy... This place is dangerously good. \n\nThe first time I came here I was pleasantly surprised by how it was ACTUALLY an Italian restaurant in SF with actual Italian men cooking- so for that A+.\n\nFirst stop - seafood appetizers: #holymoley. Fresh tomato sauces that were more alive than anything I've ever tasted, bruschetta you could die for, and then stepping into entree land was like a walk in wonderland. Everything. Everything we ordered was perfect.\n\nI left happy, full, and probably buzzed. \n\nNow as I sit in my food coma writing this review it is with great joy that I report this place did it again. Like wow. Ummazing truffle pasta- incredible eggplant with smoked moz and hell yes- even the olive oil was on point.\n\nThere was no room for dessert. I repeat: no room for dessert. \n\nAs far as other things you need to know: call ahead for more than 2 people and ask to be in the main room. Back room = a little lame. \n\nCorkage fee is $20 and a pretty good idea because the wine list is okay but $$$$.\n\nThat said. Food is SF-reasonable ($$)\n\nAlso, one of the best things about this place is that while is nice and in a great location - it's not prissy. The people are cool, waitstaff is there when you need them and no more than that. And the vibe is very family/friendsy. \n\nGo, go go, go GO.", "author": "Andrea D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "This is our go-to place in Cow Hollow.  The soups change every day and are always excellent, as is the service.", "author": "William W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-14", "description": "Cozy atmosphere. Good for a chill date night or a small group because it's not loud. Good service and  traditional Italian food.", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "Favorite Italian restaurant in San Francisco.\n\nSmall 40 person dining room but has a nice patio outback.\n\nPasta dishes are authentic and unique, no fettuccine alfredo here!\n\nPasta dishes range from $14-20, and you're getting bang for your buck. Medium portions, but food is rich and fresh.\n\nThe only odd thing to me is that appetizers are priced similarly to pasta dishes so are therefore a bit expensive. A caprese pasta will cost you $13.50, and a house salad $9.50.\n\nStill, this place is great, give it a shot!", "author": "Peter T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "Wow!  Came here just because we could walk from our hotel. What a find!! Great food, good service, nice atmosphere. Worth the price, and more. Try it next time you're in the city.", "author": "Frank S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "The owner and staff are very welcoming. Getting seated in the back patio is highly recommended.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "Such an enjoyable experience. Good Italian dish, not heavy garlic, clean flavors. Waitstaff very attentive and helped with choices.", "author": "Lisabeth L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-03", "description": "We walked into this place on Saturday evening spur of the moment. We were hungry for some good Italian, so I consulted Yelp! Even though they were booked, they fit us in! We really appreciated that. The floor manager is a great guy, I can't remember his name (I had quite a few mimosas that day). \n\nThe restaurant has a nice, homey vibe, and it smelled incredible! They brought out bread with oil and balsamic vinegar, yum! We got a nice bottle of cab for the table and ordered our entree. I heard no complaints from anyone at the table, just silent, happy eating people. My own entree was wonderful, when I want comfort food, I always go for angel hair pasta with Alfredo sauce. A very simple dish but it had the best Alfredo sauce I've ever had.. Which says a lot! Because I order it frequently. The others ordered more complicated dishes. The price was where it should be. The only thing that brought down one star was our server, we had to look for him a lot and he wasn't as attentive as he should have been, he was also snappy with the birthday girl who had asked a simple, sweet question. Tame the cranky Sir!\n\nWhen I go back to San Fransisco, I will eat here again, I recommend it.", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "Pane e vino is my favorite Italian spot in the city. It's super under the radar and a locals go-to. You won't find tourists here and patrons may know the owners. Very cozy. The pasta is homemade and tastes like it. Check it out - or don't so we can keep the crowd down.", "author": "Courtney C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "What a delight! I wanted authentic pasta for my birthday dinner and this place didn't disappoint. \n\nThe service was impeccable - our host was cheery and knowledgeable about the menu.  The food was delicious. There's a private room in the back for large groups - I might just have to reserve it soon for my family when they visit!", "author": "Kathryn D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-28", "description": "Ordered the mushroom pizza and a mista salad.  Supposed to have olive oil on the salad but had some thick, yellow nasty dressing instead.  Pizza was supposed to have wild mushrooms, but had button mushrooms.  Ate the dinner and got SICK AS A DOG less than 30 minutes later.  Threw up TWICE!  Can you said FOOD POISONING????????   I don't know what it was or if the food was UNWASHED And UNSANITARY!  But I was dizzy and throwing up! \n\nAVOID THIS PLACE AT ALL COSTS !  UNLESS OF COURSE YOU WANT FOOD POISONING!", "author": "gina b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-31", "description": "Came here tonight with a reservation. Was totally disappointed with the host at the door. We were 20 mins early before our reservations and there were plenty of tables free but he didn't care to sit us down. Until 5 minutes before our reservation I got paranoid and asked  him to sit us and he still refused and said it is not your reservation time yet. Excuse me? No one else is coming and you have more than 4 empty tables. At last he unprofessionally and disrespectfully told us to sit. After dinner we waited for 20 minutes for our dessert menu. He gave other tables the menu but purposely neglected us. He is the most unprofessionally and disrespectful host I have ever met.  Thanks to our waiter who at last gave us the menu. \n\nThe food and the waiter who took our orders and served our table were fantastic though. We love our waiter who was attentive and friendly, unlike the host. It is sad that I have to give 2 stars instead of 5 all because of the host.", "author": "JJJ W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "Came here for a dinner date with the BF on a Saturday night and was so glad to have reservations - the restaurant was entirely filled, and after dining there I can definitely understand why. \n\nPane E Vino is a simple and affordable Italian restaurant tucked away on a street corner. It offers no frills service and simple, amazing and affordable food and wine. Don't expect super polite wait staff to fawn all over you- all you'll get is quick, efficient, no nonsense service. And when there's good food to be had, that's A-OK with me. \n\nWe sat down and were promptly served by a waiter - I ordered the Pappardelle special which had mushrooms and pancetta in a cream sauce, while my boyfriend had the Parppadelle with chicken and porcini mushrooms in the tomato sauce. OH MY GOD. I have to say my dish was mindblowingly good - the pasta was hand made, and oh-so-delicious, and the sauce, oh god the sauce was to die for. I am not usually a fan of cream sauces, but this one was perfect, it was ridiculously delicious without making you feel sick or overwhelmed at the end. At the end of the meal, all I wanted to do was to lick my plate which was pretty much what I did... with the remnants of the bread basket. The boyfriend's pasta was also quite tasty but I don't remember anything of the evening aside from my super delicious to die for orgasmic pasta dish.\n\nWe ended off the evening with a fresh seasonal fruit tart which tasted neither fresh nor seasonal, but after that delicious pasta dish, this place can do no wrong. I am already dreaming of my next visit.", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-23", "description": "My buddy and I stroll in on a Sunday evening. I wasn't expecting it to be busy because it was Sunday, but this place was, which is a good sign, no? Miraculously, there were two seats available at the counter area, which we did not hesitate to take. We promptly ordered wine and we wet for the three cheese ravioli and sword fish. The bread and olive oil was your typical stuff, but we were impressed by the food. I have not tasted more delicious ravioli than I did here. I wish I would have had the stomach space to order a whole other plate of it because it was good. We then opted for the Profiteroles, which are white chocolate gelato filled cream puffs topped with hot chocolate sauce! This was heaven! I can't wait to go back.", "author": "Jeanette Jane G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "This is probably a five star place, but I'm stingy with those. That said we had a great experience. Small place with a feel of home. Attentive staff and great food. Went for a birthday and found them through yelp after our chosen restaurant had our reservations so late. We were able to get earlier reservation times and was a busy Saturday night. Highly recommend.", "author": "John P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "Wow - incredible. We could have just had the salads and deserts!  The food is delicious and service is very on top of the game. \n\nWe did make reservations and that was the best recommendation Yelp handed out. It got crowded very quickly.  And they have a lot of take-out customers keeping the kitchen busy. \n\nA terrific place, terrific food, great service.", "author": "Phil J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-10", "description": "This used to be a favorite. But the last few years it has gone down hill fast. After 3 disappointing dining experiences in a row. I had to accept that this old grey goose isn't what she used to be.\nAside from the food being hit and miss. The artwork is hideous. Like a plague that spread on their walls.", "author": "Cindy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "We are back in SF after one year and for our first dinner we decided to come back in this restaurant for the third time (twice one year ago) The food is still great. Definitely one of the best Italian ever experienced in the USA. From anti pasti to desserts, via wine list, everything is awesome. \nPlus, even though there is no kids menu, they propose half plates for half the price (seems logical to you, huh!), and won't charge you for sharing your dessert (logical again?). \nI highly recommend this place to Italian foodies. To all foodies actually.", "author": "Jordi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-22", "description": "My girlfriends and I went to Pane e Vino for dinner on a recent Friday evening. The restaurant is small and had a charming feel of a casual, neighborhood spot. With a reservation, we were seated within a few minutes. We started with the baked eggplant, spinach salad with pancetta and egg, and a bottle of prosecco. The prosecco was the perfect way to start the meal, but we were mostly left unimpressed with the food. The baked eggplant arrived hot and full of molten cheese, but was under-seasoned. The spinach salad was fine, but nothing to write home about--although I thought it was odd that they served it with slivers of a hard boiled egg instead of a soft boiled egg that would have served well with bigger pieces of pancetta. \n\nAs for the entrees, my friends and I shared the angel hair pasta with fresh tomato sauce, linguine with clams and mussels, and pizza marguerita. The pizza was forgettable, and the linguine was incredibly under-seasoned. It could have used more salt, pepper, and a hit of acidity. The angel hair pasta dish was the best out of the bunch, but it tasted a bit heavy which isn't what you expect from a fresh tomato sauce. \n\nService was good--they even brought out a complimentary tiramisu (which was delicious) with a candle for my friend's birthday--and prices we're reasonable (less than $40 per person for the whole meal, including 2 bottles of wine and tip). They do take reservations via OpenTable, so that's convenient. Overall, the food was disappointing, considering that SF is such a food-centric city. We had a good time, but I would go elsewhere for good Italian cuisine.", "author": "Parada O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-18", "description": "I had a delicious eggplant parmigiana. The work group I was with seemed to enjoy their dishes which ranged from steak - pizza - grilled fish -- pasta -- salad.\n\nThe service wasn't very good though. It took a long time to order the food, to serve the food, and to get the check. But...we sat for a long time and I never felt rushed. ;-)", "author": "Leslie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-12", "description": "Horrible. Instead of pappardelle with porcini they gave us pappardelle with shiitake mushrooms. Service was horrible too. Think management of this restaurant have changed cause last time I've been here 5 years ago it was amazing...", "author": "Vlad E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "This is an excellent Italian restaurant! My boyfriend and I were visiting for the week and couldn't be happier that we stumbled upon this place. We shared the Cesar salad, black truffle mushroom pasta and cheesecake for desert. Soo satisfied afterwards.", "author": "Alice T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "Was recommended to check out Vino's by a friend for dinner on a Friday night. We didn't have a reservation, so the wait was around 45 minutes, which isn't too bad compared to the other waits we had for other restaurants that weekend. They put us down and gave us a time to return. They even told us we can walk around the area and come back at that time and that they would definitely have a table for us, which we did.\n\nWe got the Bruschetta Carciofini al Olio, Salsicce Italiana mini-Pizza, and Fettucine con Prosciutto e Funghi. \n\nThe Bruschetta had a ton of flavor, and each one was overflowing with the toppings. It was actually a lot for 2 people.\n\nSkip the pizza. Snobbish New Yorker here, but I was expecting somewhat authentic pizza at an Italian restaurant, but alas, disappointed again. \n\nBut the Fettucine. It was more than enough for 2 people. Actually, the table next to us seemed to barely touch their pasta as well, and had to take it to go, but as it turns out, each plate consists of a lot more than you expect. They even separated it into two plates for us.\n\nThe fettucine was definitely the highlight though. Al dente pasta, not overly oily or watery for the sauce, and just the right amount prosciutto, tomatoes and mushrooms. The sauce was actually too good, and I scraped the rest of it with the extra bread that we asked for.\n\nThe place is pretty small, being in the back room of a hotel, and I could have reached over to snag a bite of my neighbor's food if I wanted to. But it wasn't overly loud, and service was good (although the waiter hovered a little too close to my face at times). If you're looking for a last minute somewhat casual/fancy (we came in hoodies and sweats), come for the pasta. Just the pasta.", "author": "Benson C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-05", "description": "\"Bueno Sera!\" I soon heard exchanged between my grandma and the host, I immediately had flashbacks about my Italy trip two summers ago - expectations were high! \n\nOn the table you are served warm complimentary bread with a small dish of olive oil for dipping... Addicting!!! \nWe started off with the ANTIPASTO DELLA CASA which included prosciutto on 2 cracker sticks, 2 pieces of flavorful bruschetta, salami and coppa scattered throughout, succulent not-to-spicy peperoncinis, voluptuous olives, grilled charbroiled-like tasting eggplant and a pile of pickled peppers. The meat was thin and fresh, and the peppers were tasty. Wish there was more and had some cheese. (See pic) \n\nFor my entree I ordered PAPPARDELLE ALLA CONTADINA since I love wide pasta/noodle. It got to me nice and warm, noodles having the right thickness and delicate texture. The creamy tomato sauce was light and had a soft taste which made me want it more. There were a lot of mushrooms that really tasted like mushrooms. The chicken is breast but had a simple but kind of bland taste, which was ok since it provided some protein. (See pic) \n\nMy dad and grandma both requested their own creation which consisted of simply tagliarini noodles with meat sauce. They ordered it since my grandma used to make some bomb homemade pesto with tagliarini noodles. They were both thoroughly satisfied with their meals, cleaning the bowl. They said the noodles were perfect and the sauce had more meat and less tomato which they liked since they aren't fans of acidic/greasy spaghetti sauce. (See pic) \n\nMy dad also ordered an iced tea which they gave him his own small pitcher along with his glass. \n\nMy sister ordered the CALZONE which she enjoyed due to the soft crust, fresh ingredients which can be tasted in each bite. It smelled really good when it arrived to her, giving off a nice buttery aroma. There was a generous amount of marina filling up almost half the plate on the folded part of the calzone. \n\nMy sister and I ordered tiramisu for dessert which was pretty good. The mascarpone was rich and the cocoa powder gave it a hint of chocolate. It didn't seem like there was any rum, or at least a taste of rum, which disappointed the inner alchy in me.  \n\nThe service was exceptional, giving off positive vibes as well accommodating my dad's custom pasta. \n\nOverall, I give this place 4 stars. Has potential. Will come again and try a pizza since there was a steady flow of to go orders getting picked up during my dinner.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-23", "description": "We arrived right after opening on a Saturday night without a reservation and were seated right away on the back patio, which is adorable. I had high expectations because of the name, pane and vino (bread and wine), which I love.\n\nHow did we start the evening, you might wonder? With pane e vino of course! Bread and olive oil were yummy and the drink menu is extremely affordable--I ordered a refresher prosecco & bitters cocktail for $6 and my date ordered a glass of Chianti for $6-$8 I believe. \n\nOur meal beyond the bread and wine was OK. Even though the restaurant was not full, our meal took a while (we had to order another basket of bread while waiting). \n\nMy date ordered the rabbit special, which was delicious, except that it was not de-boned so it was like working through an obstacle course to get to the meat (to be fair, neither of us has eaten rabbit before, we could just be naive about this, but it was not an enjoyable experience). \n\nI ordered the butternut squash ravioli, and while it was tasty, I was disappointed at the quantity--there were maybe 8 thin ravioli and the tomato sauce on top looked and tasted like it was from a can. Even with the second order of bread and my main meal, I was not satiated.\n\nI would recommend this place to enjoy its so-named items--bread and wine (and maybe an appetizer). \n\nI'll just add Italian dinners in North Beach tend to be the best of the best in SF, so gauge your expectations when indulging in Italian in another part of the city.", "author": "Ashley P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "Great neighborhood place that I have had the pleasure to enjoy for many years now. You can have an easy quick meal or you can go all-in and enjoy the passion the Chef/owner Bruno put in every single dish and choose from a broad wine list. I had dinner alone at the bar, dinner for 2, 4,6 and more in the dining room and had large private parties in the room they have in the back and while  I often ask to be seated in Dario's station since I got to know him over the years,  I never had a bad experience there while dining in nor when I ordered food to be picked up. Carlos has always been extremely welcoming and I feel that just like Bruno they never miss a day at their restaurant. Grazie Mille.", "author": "A. G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "After a show my family and I felt like a dinner. We had a hard look and then we ended up at this place. They served food and drinks efficiently. I ordered tagliatelle which was good and not crazy rich. Another person in my party ordered the roast chicken with vegetables the chicken was moist and there was a delicious sauce with a great variety of vegetables.  \nOur party also order puttanesca which was also delicious but you need to be careful of the olives which have the pits inside. The staff were also nice. I can't wait to come to this restaurant again.", "author": "Will D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-26", "description": "Ugh, I hate to be the one writing the average review but here it goes. I was treating a girl friend out to a birthday dinner and she said she wanted to  have Italian. Long story short- her boyfriend doesn't take her out for Italian because he thinks it's a waste of money to spend that much on \"just noodles.\" She knows I love Italian and that I'm always down for pasta so I told her I'd Yelp somewhere good to try. Sadly to say I wasted her one pasta outing in almost half a year on mediocre pasta. I could tell as soon as the pasta hit her lips that she was disappointed and me being a pasta lover of just jar sauce and spaghetti was also disappointed. I felt my sauce was a little too watery and it didn't stay on the pasta well. I didn't finish the pasta and didn't even bother taking it to go (that's the first for me). So odd because initially I just picked this off Yelp and thought I've never been here but when I showed up I realized I have been here years ago and I don't remember if it was good or bad then either - not a great sign. Anyways, I'm lovingggg Nostra as of now for my go to pasta place. A tad more expensive but very, very delicious.", "author": "Yvonne L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-16", "description": "So this review is more of a 3.5 stars. I had made dinner reservations the day of and had to change it a few times due to unforseen circumstances. So I was very thankful that they were still able to accomodate us! After checking in with the host, we were immediately led to our table, which was at the back of the restaurant. It was actually really nice because there were real grape vines hung on the ceiling and the patio area had a certain atmosphere to it. \n\nEach table gets bread and olive oil and you can ask for the balsalmic vinegar too if you like to dip that with your bread. Anyways we each ordered a pasta dish. When everyone's dishes arrived, I was surprised that the pasta dishes were smaller than anticipated. My chicken pasta dish was pretty good and creamy. The wide egg noodles in there were interesting but was tasty with the sauce. My dish definetely tasted good but the flavors just didn't impress me too much. Also, my family and I didn't feel completely full after our meal and I usually get pretty full when eating pasta dishes! So for the price and how much they give you, I feel like it wasn't quite worth it. But the service here is great and sitting in the patio was awesome! I saw other tables ordering pizzas, which looked really good! So the next time I come here, I think Ill try their pizzas instead.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-19", "description": "We went for dinner with another couple on a Saturday night. We had a reservation and were seated right away. Pane E Vino is a super cute restaurant, very busy with a fun atmosphere, but the food is average and the service is atrocious. Definitely bring your own wine, the wine by the glass selection is minimal and corkage is only $20. I started with a glass of Pinot Grigio, as other Yelpers say, it's was a healthy pour but it was quite possibly the worst Pinot Grigio I have ever tasted, and it's hard to mess up Pinot Grigio. \nI ordered the Fried baby artichokes to start from the specials menu, they were actually pretty good but not what I expected. Instead of fried quarters of artichoke hearts that you normally see, it was sliced and fried fresh baby artichokes. So I ended up with a lot of leafy parts and not much of the meaty artichoke heart, but again, I enjoyed it. I decided to splurge and get the Lamb entree. It was just okay. The lamb was cooked nicely and the sauce it came with was decent but the dish just wasn't that flavorful. It cost $38. \nMy husband got the gnocchi which was just weird. It was a dish of sliced gnocchi with the sauce served on the side. He said it tasted like pan fried mashed potatoes. We looked up the dish later on the Internet and apparently it's a specific type of gnocchi dish that is supposed to be that way, it would have been nice if the waiter told us, but he was too busy not caring.\nI had the tiramisu for dessert and it wasn't very good, it tasted premade and seemed to be missing an ingredient (maybe the liqueur?) \nThe worst part was the service, if we weren't out with friends enjoying thier company we would have been even more annoyed with our waiter who literally never came to our table. He even brought my husband the wrong beer. He never poured our wine that we brought to we just poured it ourselves. Other Yelpers talk about the bread and olive oil, I wouldn't know because we ran out of olive oil and he never replenished it ever though I asked.\nRedeeming qualities include that the host was very friendly, fun atmosphere, and our friends knew one of the waiters, he seemed nice, if we had only been seated in his section this review may have been a lot different! Oh, and I didn't wake up with a migraine this morning so they must not use MSG, that is a plus!", "author": "Holly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "Everything is just great. At this point I can say I'm a regular. Every time I come here for dinner I order a different thing and I have never been disappointed.\nBruno is an amazing chef. \nIf it's your first time here I would order something from the \"day specials\". Leave some space for dessert though.\nI will keep coming back for more :)", "author": "Maggie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "Thank you for a lovely meal! Service was excellent, food was delish (esp. the duck ragu, calamari, margherita pizza and affogato!) and outdoor seating was perfect for our family with young kids. Parking was perfect - could easily park on the street with metered parking. We would highly recommend this place!", "author": "Tricia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-07", "description": "I met Bruno for the first time today and he showed me the secret to his homemade fresh pasta that he was making. Exactly the way I used to remember New York when the chef used to take you for a tour through the back kitchen without you even having to ask him . I had a great meal to say the least. Two thumbs up. f.y.i request a reservation in the back atrium - Bruno's words - its the best kept secret in town. Nice setting, great for a smart but casual night out, or a romantic evening in back underneath the real clusters of grapes overhead.\n\nThank you so much for a great dining experience.\n\n- rich and Isabel and Chloe", "author": "Rich S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "I have been so many times and this is Union's hidden gem. Personal faves: Carpaccio, gnocchi, pappardelle (!!!!) , and zeppole! Attentive staff,   Homemade delicious pastas and sauces, great wine.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "What a great local place! Friendly, attentive service, tasty food and nice wine at a good value.", "author": "Cathleen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "Great neighborhood spot with great service and a homey feel. I live a few blocks down and appreciate that they have the same regulars and make people feel like they're at home. Many of them also speak Italian which is neat. \n\nWhat we've had: \nCalamari - a bit pricey at $17.95 but always a good starter. The marinara is served warm and it's fried just right. \nPappardelle- I love that it's freshly made and the chicken is moist pulled chicken and not dry chicken breast. It's surprisingly light too. \nPennete with pancetta in a light tomato cream sauce. Cream sauce is great and not too creamy, flavor is excellent \nTiramisu - light, flavorful, and a wonderful way to end the meal", "author": "Zara H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "Walk in Friday night ...we sat at the bar across from front kitchen ...Generous glasses of excellent red merlot ...duck breast hearty and delicious with perfect roast potatoes ... chicken good but just a little dry... and excellent generous portion house salad . Atmosphere is relaxed not too noisy, staff authentically cheerful,  and clientele local... Getting the check a little slow. A very enjoyable experience and will return.", "author": "Robert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "We felt like we were in Italy!  Relaxed  atmosphere with delicious Italian entrees.  Casual, charming.....a great place for a relaxed date night!", "author": "J R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "This was my 1st time here.  The art on the wall is creative and eye pleasing.  The staff is attentive. The owner is warm, friendly and makes you feel at home. The duck is to die for.  The sparkling red Italian wine was tasty! I could have drank the whole bottle. I'm coming back here again.  I'd make reservations though.  My boyfriend and I were lucky to get a table with no reservations. It was packed!", "author": "Geraldine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-17", "description": "Visiting San Fran with family - 3 teen boys and husband.  Picked close to hotel and recommendations from Yelp.  Overall tasty food, filled and mainly locals.  I had a special homemade papadelle with wild mushroom black truffle cream sauce.  Wanted to lick my bowl.  The four cheese pasta on the regular menu  with smoked mozzarella and three other cheeses was incredible.  One sone ordered a special ravioli which he lived. A margarita pizza - bit if a soggy crust but devoured. My husband had the beef rigatoni which was meh - hence the 4 stars.  Waiter was friendly and a bit busy.  Ended with the BEST cheesecake we have ever tasted - usually too dessert pick so we have tried lots.  I had profiteroles - they were fine but envious of the cheesecakes my family was eating.        \nThey bring crusty delicious bread with olive oil when you sit down.  Dine here maybe stay away from the pasta with red sauce.", "author": "Moab E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-05", "description": "Pane e Vino is an excellent, small, 'neighborhood gem' of an Italian restaurant.  I have been a fan of this restaurant since it was called Via Vai, and I eat here either take-our or dine-in basically monthly, sometimes more often.\n\nThe menu is extensive, and while there are great items on it- some of the BEST items are their nightly specials.  Always inquire about these before making up your mind.  They can fax the list to you if needed- helpful when you do a lot of take-out like us.  One of the greatest things about take out from Pane e Vino is their very responsible packaging- no messes- they are fortified in armor and the food looks great when you arrive home and it's ready to go!  Plus they always throw in bread and butter!\n\nMy favorite regular item on the menu is the calzone- really the best I have had.  Right now, they are being made with two types of cheese, ham, and delicious heirloom tomatoes.  Marinara sauce comes on the side.  Love it!  Their soups are delicious, great bruschetta appetizer, great pastas, and a wonderful raspberry tart for dessert!\n\nAfter just one meal, you will surely become a fan of Pane e Vino.  Reservations are helpful but not always critical- however the place is not so big and can fill up quickly.  Although the style is not precisely the same, it compares favorably to Capannina, Ristorante Milano, Mint 54, just to name a few. I'm sure you will enjoy this place just as much as I do!", "author": "Andy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "Very nice, classy atmosphere and professional staff.  High end dining experience at a reasonable cost.\n\nStarter salad and burrata cheese and tomato caprese salad were both fresh and delicious.  Chicken piccata and capellini pomodoro pasta were good, but not out of this world.\n\nGreat for a date, walking distance to nightlife.", "author": "Ty S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "I have been wanting to come here since I moved to the area last April. We finally came and LOVED it!\n\nThe staff was super welcoming and friendly. We ordered 2 pizzas to split between 4 of us, as well as calamari and a starter salad. All was amazing, especially the pizzas. Would love to come back and try a pasta as well!", "author": "Alexandra W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-27", "description": "We were sadly not happy with our dinner here.  The bolognese was sugary and the noodles were soggy -- we've had much better at Jackson Fillmore or Trattoria Contadina.  The sand dabs were served on the bone, which seemed odd.  We order this dish often and it was disappointing.  I had the cream-based truffle sauce with mushrooms, it was okay.  I actually saw a friend there that evening and she was actually disappointed with the food as well...  On a positive note, the bread they served before the meal was delicious and the wine pours were very healthy.  But, I don't think we will return to Pane E Vino.", "author": "Tami S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-09", "description": "Once again, we had such a wonderful meal. Everything we had was made in house. Great pastas, of which my favorite was the PAPPARDELLE ALLA CONTADINA. Delightfully fresh. I'm also a big fan of their carpaccio. They also have a very reasonable wine selection. All in all, we had a wonderful evening with consistently great service. Dulce's were heavenly. Located in a quaint neighborhood in the not so busy part of San Francisco called Cow Hallow. My suggestion is to use Uber or another on demand taxi service if you are not driving for your trip home. Not the easiest place to hail a taxis thanks again to Carlos for keeping this such a fun place to dine.", "author": "John H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-31", "description": "I'll start out by saying that I'm from an Italian family and have relatives who run a family restaurant in Italy. So - my expectations for Italian food might be unreasonably high, but take that as you wish. \nOverall - this place was good. Not great, but definitely good! I picked it mainly because it was more reasonably priced than other similar spots in the area. Authentic Italian style menu, listing appetizers, primi piatti (pasta dishes) and secondi piatti (main dishes). \nMy friend and I both ordered pasta dishes which were both very good, but the actual pasta (I had angel hair) did not taste like it was made fresh. It tasted like box pasta. Which is fine, but if I'm going to pay to eat Italian food out, I want homemade pasta. \nI may go back at some point because it's so close to my place, but overall, if I am craving quality Italian I may look elsewhere.", "author": "Catherine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "Great service\nDelicious meals, true italian cuisine \nBear in mind: the pasta courses are not very large plates as pasta is considered a starter in italian cuisine, not a main dish. \nWe had pasta and pizza, both great!", "author": "Santiago R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "I've travelled all across Italy several different times , and Italian food is my favorite.  This restaurant is my favorite Italian restaurant in the States.  It's just so, so good.  Weekends tend to fill up, but take out is just as delicious.  Desserts are heavenly as well!", "author": "Jenny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-06", "description": "I've been here twice in the last year, and it's been a great experience both times. The first time, it was a large group of us - maybe 10 family members, and we ordered a ton of items off the menu. It's a great place to order family style and have a taste of the pastas, anti-pastas and entrees. \n\nService: 5 stars. They're helpful about the menu, super friendly and there's no pressure to rush through your meal. If you're vegetarian, they'll walk you through the menu and create vegetarian alternatives for some of the dishes that include meat. \n\nAmbiance: 5 stars. The back sunroom, is a great private room for a large party, and the main room in the front is cozy and comfortable. Great for large groups, or small parties. You can make reservations easily online. \n\nFood: 5 stars. The eggplan parmigiana is delicious! Not too salty, perfectly cheesy and simply delicious. The Italian sausage and lamb chops were juicy and perfectly seasoned. The dessert is wonderful too - try the flan or the fruit tart! Yummm", "author": "Neesh B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Our friend, a local, introduced us to this restaurant. Certainly packed on a Saturday night but the owner accommodated us graciously. The food was absolutely delicious and the cheesecake was the best I've ever had. I would return in a heartbeat!", "author": "Sunny H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "Loved every bit. Very cute and homely! Traditional Italian - and they have gluten free pasta! \n\nCan't wait to go back!", "author": "Stan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-01", "description": "Authentic Italian food with authentic Italian servers haha. Good location. Make reservations because this place is small and gets packed!! I will definitely come back", "author": "Glenda G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-17", "description": "Every one and place has an off night and last night was to our way of thinking a bad night for Pane e Vino.\n\nThe chicken I ate was 8 minutes from dry and that means it was far from sublime.\n\nSimilarly, the \"medium rare\" preparation of my wife's salmon as promised (warned as if, is that okay?) by waiter was, well, dry. It was over cooked and a piece of salmon is a terrible thing to waste.\n\nFinally, the vegetable melange served with our main plates was over cooked in too much butter.\n\nThe front of house staff are warm, cheery and bright as one would expect at an Italian restaurant. And they're being let down by their kitchen.\n\nNot a great night for us and Pane e Vino.", "author": "Jay D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "YUM! Great food and ambiance!  Authentic cuisine.  Try the pizzas!!!!", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-14", "description": "Disappointing - definitely not a 4-star experience in this price range and in this town. Came here for dinner with a friend and was pretty underwhelmed by both the food and the wine. We sampled 3 items from the menu - the burrata appetizer, the mushroom pizza, and the fettuccine - and 2 wines. It all tasted a lot closer to what you'd get at Pasta! than what you'd get a similarly priced Italian restaurants in San Francisco - I'm talking of Delfina Pizza, Uva Enoteca, A16, Montesacro Pinseria, Gialina's etc.", "author": "Ruben K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-13", "description": "We were pleased to get a table for two on short notice on a Friday night. Once seated we experienced the Good, the Bad and the Ugly. The Good was represented by the timely service and the tasty Bresaola Con Rucola antipasto and Tagliatelle Verdi Alla Bolognese. The Bad was the tasteless Siciliana pizza, especially the crust which was like a cardboard make-out-of-the-box variety. MUCH better pizza can be found at Delarosa, Delfina, Rose's Cafe and A-16. We found the service staff to be Ugly as they were extremely fast and abrupt, dropping dishes on the table or asking questions so fast and departing before we had any chance to react. The emphasis in the restaurant seemed to be on speed and moving customers through rather than on a slowly paced enjoyable meal experience. We hadn't been to this restaurant for a long time and will not return again for a long time.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "Always a warm welcome.\nA reservation is a good idea, typically they're busy but go out of their way to accommodate where possible.\nI'm a repeat customer.\nCiao bello!\n:D", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "I loved the calzone so much i want to come back again and I liked the cake a lot!    -Cruz age 8", "author": "Alicia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-26", "description": "Went with 4 friends and we all enjoyed our dinners (we all got different pastas).  Atmosphere was nice (we got a table in the back, which we loved) and our server was friendly and knowledgeable (albeit a little slow sometimes).", "author": "JJ M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-19", "description": "Came here for a quick dinner after a haircut with my Fiance!\n\nI actually used to live 2 blocks away but never went it! We made a quick reservation, thanks to yelp/open table and grabbed a spot in the packed house on a wednesday night. \n\nThe server and staff was very attentive and very italian. \n\nOrdered a great 1/2 bottle of Malbec ($18) and a Caprese salad to share. \n\nI ordered the flat chicken with tomatoes (lacking flavor but I was trying to be healthy) and my fiancé ordered the veal, excellent. \n\nOur dinner was under $100 and we had a great little date night. \n\nI would definitely recommend if you're looking for authentic food. GO FOR THE PASTA!!!", "author": "Heather H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "Love this restaurant and Bruno, the owner and chef!! Come here often with friends and always have a great time.", "author": "Didi S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-18", "description": "Very surprised by all the 4 and 5 star ratings.\n\nService was prompt, polite, attentive to my water glass, but not very helpful or chatty. Which is a-ok. \n\nOrdered a grilled raddichio wrapped in proscuitto appetizer, bucatini all'amatriciana, the pappardelle with chicken and mushrooms, and the tiramisu. \n\nThe appetizer was probably the most unique thing we got, which was just an italian twist on bacon wrapped asparagus. As for the pastas and the dessert, all were painfully average and lacked flavor. I've definitely had better of all three. Though it should be noted that the texture of the pappardelle was quite good. \n\nAn okay place, but won't be coming back as there are tons of better italian places in North Beach.", "author": "Tiffany Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-27", "description": "This is the BEST Italian Food I've had in San Francisco.  Considering its two blocks away from our apartment, we go approximately twice per month, and have become regulars.\n\nWhat I find humorous about some bad reviews that people have left placed on yelp is of the service.  Let me fill these people in on a little secret...when a restaurant is busy they don't usually have time to coddle you like a 4 year old.  The service is fine.  They may not be the most attentive, but for the most part they are knowledgeable on the food and wine.  The staff is mostly form northern Italy, and if you've ever been to Italy you will know the personality of Italiano's.  So I understand if the personality rubs San Franciscans the wrong way.  However, as an aside, once you become a regular, they treat you like gold. Also, if you attempt to speak Italian when ordering, they appreciate that as well.\n\nAs for the food: I've had mostly everything there. My rule of thumb is \"order whatever pasta is handmade:\n\n1.  My wife usually orders the Truffle Pasta, and loves it.  Its the fan favorite.  The Pasta is handmade.  Also a vegetarian option.\n2.  Any pizza is great. Thin crust, fresh sauce.  I recommend the Mushroom and Prosciutto \n3.  The Gnocchi is handmade and incredible with any sauce\n4.  The wild boar pasta with pappardelle is my personal favorite\n5.  The Veal Steak is very good.  Has a lot of rosemary and fresh veggies\n6.  Calamari appi is ok but I don't think I'd order it again.\n7.  Bolognese is good.\n8.  Cornish Game Hen is good too.\n9.  House Chianti.  We usually get the house Chianti.  The first few times we went they had 2007 San Vincenti Chianti Classico which is to die for.  They then ran out and now have a 2009.  DO NOT GET THE 2009.\n10.  If you prefer Chianti and they dont have the 2007 get Collefrisio Zero.  Its not as good as the 2007 but is somewhere between the 2009 and 2007.\n\nHope this helps.  Maybe we will see you on a random Friday at  Pan e Vino\n\nCiao", "author": "Jeremy E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "had the Chicken Toscana for some light fare good Italian food. Did not disappoint.  Plan to return to try the Pane E Vino Lasagna", "author": "Aaron F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "Really great place. The atmosphere had a relaxing community vibe, and the service was great. The best part was the food.. Absolutely delicious and authentic. I'm glad my friend recommended this place to me!", "author": "Ali R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-10", "description": "All day I was thinking about halibut and there it was in the menu. Delicious but a little over cooked. Burrata was prefect though! Service a little slow. But a sweet spot over all. I look forward to returning next trip to SF.", "author": "Dee F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "Fantastic place for a date, drinks with friends or a business meeting.\n\nBruno is warm and friendly to diners and you feel very much at home on the first visit - almost a regular.\n\nThey have bar stool seating at the back where you can watch the kitchen work on desserts, salads and pizza. Great place for a first date.\n\nFood is amazing!", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "One of my favorite neighborhood restaurants.  Great spinach salad with bacon, fresh pastas such as the spinach bolognese, pizzas and the chocolate profiterole is my favorite.....", "author": "Molly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-18", "description": "Great comfortable, classic, non-pretentious but still interesting Italian food. I agree that the menu almost doubles with the daily specials which don't seem to be listed online, but there are a lot of intriguing options - we saw a couple of rabbit dishes.\n\nWe were started with a lot of excellent rustic bread - of course, an excellent sign. The olive oil was pretty light and not too flavorful, and I would have liked some balsamic vinegar to have with it, but the bread alone was superb, so that was fine. The wine list is quite extensive, but our waiter helped guide us once we had narrowed it down a bit.\n\nWe shared an order of bruschetta and an antipasto plate among 4 people, which was more than enough for everyone. The only bruschetta we saw offered was pretty plain (the classic tomato, basil, olive oil), but it was spot-on. The bread was perfectly grilled/toasted and the tomatoes were flavorful and delicious. The antipasto plate was a bit unusual to me - no cheese, various meats, and lots of vegetables and beans. I loved the peppers and both white and kidney beans, but found some of the pickled items a bit too strong. \n\nI had the pollo marinato allo griglia (chicken breast with tomato, basil, and garlic) because I felt like protein rather than carby pasta. I have to admit that I was expecting a rather dull dish, but it was *delicious*! The grilling was perfect so that the chicken breast was very flavorful and not at all dried out. I loved this meat, and there were also a lot of nice vegetables and a couple of small pieces of potato on the side. The only thing I would have changed would have been to have more tomato on it.\n\nThe pasta I tried was cooked perfectly. The bolognase was a serious meat sauce - I would have also preferred this with a lot more tomato! But it tasted good. I'd love to come back and try some other pasta dishes and the pizza.\n\nI was also impressed with the dessert. The sorbet was truly outstanding - normally I feel like sorbets are substandard and thrown on a menu without care. We had three flavors (mango, raspberry, and lemon), and all were delicious - especially the lemon! There were a couple of wrapped cookies with it as well - very nice. The cheesecake was surprisingly tasty and the berries that came with it were wonderful! I also enjoyed my cappuccino. \n\nThis is a fairly cozy spot, and I was definitely glad we had reservations on a Saturday night (there doesn't seem to be much space to wait for a table!). It was bustling, bordering on loud, but not overly so, luckily. The service was generally good, although when we arrived, we were \"jokingly\" interrogated for being two minutes late for our reservation. That's fine if we were long-standing customers, etc, but as a first impression for a restaurant, it was odd. We were seated promptly. Our waiter was generally very helpful and accepted a substitution with absolutely no fuss, which was great. But a couple of times we had a bit of trouble getting his attention, and he brought out one incorrect dish (but promptly corrected it). So, a little hit or miss, but overall the service was pretty good.\n\nIt seems easy to go to really high-end, expensive, fancy Italian restaurants in the city, but actually harder to find a more casual, but still nice, classic Italian restaurant. I think Pane e Vino fits the bill and I'd be happy to go back.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "My wife and I took 5friends from out of the country to dinner here last night (5/24/14). At first they tried to squeeze us all into a small corner of the restaurant. But after we protested they move us to a larger table in the back. Reservations is an absolute must at this place because it is small, popular as well as a local gym.\n\nThe food was good and probably the best part of our visit. The staff was friendly but a little nonchalant when it came to service. They were slow to respond and we had to flag them down constantly. They actually got one of our appetizer orders wrong. They didn't charge us for it though. The restaurant was busy but not so busy that the staff couldn't be more attentive. Hence the 4 out of 5 as opposed to 5 stars.\n\nIn my opinion the prices are a little high for what you get. But it is San Francisco at a very popular restaurant which is well reviewed. We will probably go back but only occasionally.", "author": "J W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Delicious food, lovely ambiance, would absolutely come here again on a special occasion / nice date night. We sat at the counter and got to chatting with the owner. He was very Italian, and he insisted that have dessert (on the house)!", "author": "Carly A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Authentic Italian food. My wife and I (and now our 20 month old daughter) have been eating here at least once a month for over 6 years. The food is consistent, prices very reasonable and the staff are all extremely friendly. \n\nAll the items are standouts, but a few favorites include the sea food linguine, all of the pizza's, and the wild boar pasta.", "author": "Greg H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "This place hits on all cylinders.  Top notch Italian.  My son had gluten free pasta and even that was prepared perfectly.  I had the rabbit and it was assembled with pancetta and by a masterful hand that loves the food that they prepare.  Just a random find while on vacation and it blew me away.", "author": "Howard L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "I Live 2 blocks away and it only took 7 years for me to pop in, but I finally did and I would for sure come back. The servers were really attentive and helpful when it came to selecting a bottle of wine. He suggested a great bottle of Pinot (Barnett Vineyards) and at $49, it was a steal since after checking retails at $45, so not a crazy markup that we are accustomed to see. We shared spaghetti and a margarita pizza (with anchovies), and it was delicious. A great family run atmosphere, whether it was or not, but had that caring feeling.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-15", "description": "Well, I gave it 5 deserved stars back in 2013! Then I went last Friday night and as I always do I sit at the counter and just want to enjoy looking at the guys cooking and say hello to Bruno and taste whatever he is making and offers me to try. I ordered the meat raviolis and they were great but my waiter was the ultimate worst!\n\nI had never seen him before but he was extremely unattentive and it took 40 minutes to get just my raviolis! A couple came in and sat next to me way after I had arrived and they were served before me! When the plate was taken from me no one asked me if I would like desert and the bus boys were helping me not even my waiter!\n\nThen to top it off the couple was charged for my meal! If I had not made a comment on the service they would have left paying for my meal. The attention to customers has unfortunately gone down hill. So, unfortunately I have to say good bye to another restaurant from my past that just is no longer the same.", "author": "Yvonne J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "Every meal I have ever had hear has been AMAZING!! Definite go to!!! The owner is so sweet and the staff is friendly. If you sit at the bar the owner Bruno usually will come talk to you and give you special treatment with a little extra treats!", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-10", "description": "Foreigners and immigrant beware!\n\nWent here with my wife and father to enjoy a genuine Italian food experience. Well, the food was ok but that doesn't cover the fact that the waiter tried to steal from us.\n\nThe food and wine was acceptable, but not as good as some people have described it. I could easily name 10 better Italian resturants in SF. \n\nThe waiter was very hospitable and friendly throughout the meal, and based on our Scandinavian and accents (we moved to SF a year ago) and his choice of topics it was obvious he thought we were tourists-just-of-the-boat.\n\nWhen the check came in he had done something that I have never experiences before in the US - he had filled in the tip himself (25%) and just asked me to sign.\n\nWhen I asked him what this was (first politely) he just very casually said, \"Well, this is the way we do it in the US and we always do it in this resturant as a courtesy to our guest, so they do not have to worry about it\". \n\nAt this point I understood that he was playing us for major fools and actually tried to STEAL FROM US and went ballistic.\n\nAfter being face with my Viking wrath for a couple of minutes he confessed that, \"No, they didn't do this to all customers and no they certainly not didn't do it to their regulars\" \n\nTo add insult to injury he started to rant about how important the tip was to all their employees, and went on to call me insensitive for not understanding that he had to make a living too (Yes, he truly sounded as a cliché character from a mafia movie, I kid you not)\n\nWhen I asked to speak with the owner he said he was the owner. True or not, that means that this problem is not just one lousy employee but a very rotten business practice.\n\nI explained to him that the tip is decided by the guest and that what he just tried to do was stealing from us under a rosy disguise.\n\nFor the first time in history I actually gave 0% in tip and just wished I could have made it lower.\n\nI would rank this as one of my worst resturant visits ever.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-29", "description": "This was a spur of the moment decision to go here and I'm so glad we did!  Food, atmosphere, service, and most importantly dessert, were impeccable and authentic. \n\nIt's unfortunately I am only visiting San Francisco  or I would become a regular.", "author": "Regina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "Service was pretty good.  Pasta was al dente.  Tiramisu was blend.  Not a lot of flavor and not rich enough.  Mascarpone is supposed to give that rich creamy taste.  This would be my only complaint.  Otherwise everything was good.", "author": "Maria B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-02", "description": "~~~~~~ ABSOLUTELY TACTLESS ~~~~~~~\n\nFood - excellent, service (while getting food) - great, but (!!!) when we stayed after dinner - the manager came over to ask us for a favor - and moved us to a smaller table (two of our guests left leaving the two of us at a table for four). We happily obliged. \n\nAND THEN - every few minutes, a waiter came over to us asking us if we would like anything else. On the fourth time (he COMPLETELY RUINED our good impression of the place) - I said: \n\"LOOK, YOU ALREADY ASKED US THREE TIMES, please leave us alone and let us sip our tea, we do not want anything else!\"\n\nThen the manager comes and says: we are so sorry, we have people waiting.\n\nLISTEN, PANE E VINO, I AM SURE YOU MADE AN EXTRA $50 for the extra 15-20 min (max) that we didn't spend at your place, but you lost me FOREVER as your formerly happy customer. And you lost people to whom I would have otherwise recommended you.\n\nWHERE DID YOU LEARN YOUR MANNERS? \nAt McDonalds??? \nBurger King???\n\nLEARN A THING OR TWO ABOUT NOT ANNOYING YOUR CUSTOMERS (who were just so happy about your place, and would have come back)\n\nABSOLUTELY TACTLESS", "author": "Igor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "Great authentic Italian food. Came here for a dinner date and left extremely satisfied. The pizza was to die for, thin crust with the perfect amount of sauce. Pretty decent wine list also.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-09", "description": "I had a mixed experience which was overall positive. It was for a friend's birthday.\n\n\nThe Bad:\nDespite there being several waiters about, throughout the meal it was never clearly established which one was ours. Throughout the meal I resorted to asking random waiters and managers (they had at least 3 men dressed to work but not as waiters) for various things. We always ended up getting what we asked for but it made me feel awkward that I didn't know who our waiter was.\n\nWhen one of the managers brought our wine, he left it on the table and walked off without opening it. \n\nThe Good:\n\nThe wait staff were friendly and nice and did brings things relatively quickly. When they sang happy birthday to my friend I think the chef came out and joined them, and they sang in Italian with fantastic tone and  strength.  The anti-pasti tray was great and had a lot of food on it, and their bread is good.\n\nThe Mediocre:\n\nI ordered Linguine Con Le Vongole and it was highly mediocre. I cook and can make it better than this place, which is not a good sign. It's an incredibly easy dish and was just boring.", "author": "Jordan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-08", "description": "A girlfriend and I were meeting for dinner. As we usually end up in her neighborhood, we decided to try something in mine. I'd never been and/or heard of Pane E Vino, but thought it was worth a shot.\n\nThe place is cute and quaint, and absolutely Italian. (By this I mean, the service is parallels that of Italy- SLOW.) I arrived at 7:40 (about 10 minutes late for our 7:30 reservation). My girlfriend had already been seated. It took them 30 minutes before they took our drink order. That being said, they were friendly and accommodating. \n\nGirlfriend ordered the Frutti de Mare pasta, and I had something off the specials menu. (Orrechette with broccoli rabe and pancetta- I added the pancetta.) The pasta was cooked to perfection, and I ate every bite. I'm not sure this was indicative to how delicious my meal was, or just how damn hungry I was since I had waited so long to eat!\n\nAll and all- a decent meal. Nothing fantastic, nothing terrible.", "author": "Annalise F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-16", "description": "Great food, good house wine and decent dining area. The service was very good. I had corkscrew pasta with eggplant in tomato sauce, the best one I had in a long time. The house wine was good.\n\nThe place is a little pricier, but a perfect place for a date or a family dinner.", "author": "Srikanth N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "Excellent meal - all 3 of us had the local Sanddab fish (similar to Sole) which was one of the best fish dishes ever!  Service was very good. Waiter recommended a great wine for us which was only $40. This is a very local place so I almost (almost) hate to rate it fearing tourist will overrun it.", "author": "Clayton A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-14", "description": "I have been to this location twice now. \n\nThe first time, I went with my parents and we just walked in. We had a very nice time. I had the special of balsamic duck and spinach... Very delicious. The parentals had risotto which I think was the best out of everything. I would rate this experience as a 5. \n\nThe second time I went with a group of 5 girls and we had made a reservation a head of time. The waiters were very rude. We were not being difficult, making ridiculous requests (we all ordered food off the menu as is), nor were we loud. It's not as we expected special attention, but the service left me feeling irritated. I would rate this experience as a 2. The food was still good, so that is why I would say 2 over a 1 star. \n\nDefinitely mixed feelings on this place. I probably would go again to see if I had a better experience. Maybe the waiter was having a bad night. If I had the same rude service as my second time there, I will not be going here again.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "I was pleasantly surprised by this local Italian spot, however super disappointed I didn't try their tiramisu. Looks fantastico!\n\nWe dined here on a Quadruple date, which was very fun yet still intimate enough where we could all easily chat over vino and pasta. So overall, very good for groups. Everyone had a different dish; gnocchi, pizza, risotto, ravioli....and everything was delicious. The pasta is obviously homemade, light not heavy and perfectly proportioned. \n\nService was good but not anything special. We will definitely be back!", "author": "Meredith M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-25", "description": "I had a delicious dinner there at their bar which has four seats. This is a great place to meet some of the locals who frequent this place. The spinach pappardelle with bolognese was perfectly al dente and the sauce had great notes. The lady next to me had some delicious looking baby octopus but I didn't taste (I didn't know her but she was a regular). \n\nThe apple tart was good but not amazing. The zabaglione sauce on the place was great with what tasted like notes of orange zest.\n\nMy favorite part of the night was meeting some nice people from the neighborhood. We had great conversations along with good food.", "author": "Raul H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-21", "description": "I love this place! My favorite restaurant in San Francisco. It is a 'special occasion' place for my husband and I, only because it is a ways from us. If we lived in the city, it would be a regular destination. \n\nBruno, the owner is amazing. He is an incredible chef, who creates authentic Italian meals. The rest of the wait staff is efficient and friendly also. I think the people complaining of slow staff don't get the concept of enjoying a meal. This isn't a fast food drive-thru. Everything is fresh, from the meat and fish, to vegetables and even herbs. The menu is extensive and we have tried many different meals here, and everything is spectacular. From homemade pastas, pizzas cooked in a brick oven, to daily specials. And the deserts - WOW!\n\nThere are nooks for intimate romantic dinners , and a beautiful enclosed back patio (with real grape vines!) perfect for bigger parties. Great for singles, couples, families, really any size party.\n\nIf you've never been, it's definitely worth a visit.", "author": "Misti D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-27", "description": "Service is somewhat good: drinks are refilled, fresh ground pepper and other garnishes are always offered, and they are really friendly.  They also hustle like no one I've seen before, but then it also feels like they're rushing you.\n\nThe main course, however, was like waiting for the Muni bus. The digital sign at the bus stop will say arriving, but you don't see any bus approaching. Then the sign will change back to one minute.  Same thing with our main course.  It would look like the server was walking towards us with our dish, but then (\"sike\") drops it off to another table. \n\nGood flavors in my sausage and artichoke rigatoni, but rigatoni was too underdone so I couldn't even be impressed by their \"homemade\" pasta  So disappointed! My fiancee's chicken was really dry and somewhat bland.  \n\nSlow service thinly veiled by waiters walking fast coupled with expensive, underdone/dry food is annoying. I probably won't be back.", "author": "Dorothy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "I hosted a large party for my husbands birthday.  They were super accommodating.  They didn't charge us corkage and everyone enjoyed the food.  Be aware though that they only allow two credit card per table.", "author": "Yana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "Pan E Vino is my favorite local restaurant. Whenever I need my comfort food, either eating in or take out, I go there.  My favorite dish is Melanzane Fusilli. The food tastes as good as eating in Italy! The waiters and staff are always sweet and welcoming. They offer nice wines with healthy servings.", "author": "Sandra A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-10", "description": "Complimentary bread is always a great start for dinner. My dear cousins and I ordered two appetizers: calamari and rare beef+cheese (refer to pix).\n\nThe calamari was very lightly breaded. It lacked the fried crispy texture, and it was very bland. Even the lemon and side sauce couldn't save it.\nThe rare beef with cheese was the exact concept of the Vietnamese rare beef. The beef was thinly sliced and there was cheese on top. \n\nI ordered the salmon and shrimp in a garlic mushroom sauce. For $18 and it was on the special menu, it didn't \"wow\" me. Don't get me wrong, I love how they emphasized the garlic in this meal, but nothing really got my attention for this dish. I wouldn't crave for this dish at all. \n\nOne of the other dishes that was ordered was this clam and mussel dish. The mussel still reeked from the Ocean =( stay away!\n\nAnother dish was the wild mushroom truffle. My cousin kept insisting how awesome it was. I admit that was good for a dish with NO MEAT, but for $20, I'll pass. It's a great dish for mushroom lovers. It's creamy.\n\nFor our last dish, I don't even remember what it was. I remember that I tried it, but it wasn't anything out of the ordinary. It had something with chicken and tomato sauce. \n\nService was great though! Food was okay.", "author": "Sandy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-20", "description": "We came in late after a tradeshow. We had a big table, so we shared some of the dishes. It was delicious. \n\nReally quick:\nThe wine was tasty. We all shared a bottle.\nThe caprese salad was beautiful. \nThe calamari was ok. I have had better. (and worse!)\nThe mushroom pasta was yummy.\nThe veggie pizza was good. I liked that they added eggplant for a more meatier taste, but I like a more crunchy, cruchy crust.\nI didn't try the sausage pizza or the spaghetti, because it was at the other end of the table, but they said it was really good.\n\nAll in all, it was really filling and just what I needed after being at a tradeshow all day.\n\nI would go there again if I wanted a local place in the city. Truthfully, I also like the mushroom pasta at Donato Enoteca and it is closer to my Redwood City apartment.", "author": "Samantha E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-17", "description": "Honestly was not impressed.  Came here with a few folks after a rock climbing excursion.\n\nWhat stood out the most was the kindness of the owner/manager(?) there.  Guy with the vest.  He was SUPER sweet and very kind... for that they get a star.  The other star goes to the GIGANTIUM pizza!  Looked very good, unfortunately it's not what I ordered... boo.\n\nCaprese salad was yummy, but pretty hard to jack that up.  Proscuitto wrapped asparagus, also yummy, but also hard to screw up.  For my meal I had the truffle pasta.  It was OK, maybe they use summer truffles?  I don't know too much about that, just know the flavor was not pronounced enough for me to write home about.\n\nOk, second time we've gone to an Italian joint and bf ordered the rib eye.  He's not a pasta guy so when we go Italian, he gets something meaty.  Huge disappointment.  Meat itself was just ok, totally lacked any flavor, even for a rib eye.  Even if you just LIGHTLY salt a rib eye before grilling it, it can come out flavorful and juicy... not here.\n\nDessert was the chocolate covered gelato puffs... simple and good, but when you've had the chocolate sauce at Buca, it's hard to impress me with anything but.\n\nOk, now the service... ECK... we were here for three hours and we didn't even have wine, nor did we linger.  The tables around us clearly were served before us.  Granted there were six of us, but I still don't expect it to be delayed THAT much.\n\nUnfortunately not a place we will be back to.  Oh well, onto the next...", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-02", "description": "I'd highly recommend this place for large event gatherings.  I spent my New Year's eve dinner in a party of 15 (somewhat intoxicated young adults), and was quite impressed.\n\nThe restaurant itself was really dressed up for the event, with party favors on the tables, and balloons hanging from the ceiling.  Nice.\n\nThe service was absolutely impeccable.  Our waiter came back countless times to check and refill our wine and water glasses, put up with our bad jokes, and was extremely helpful with payment.\n\nFood's okay.  I ordered wheat noodles and duck ragout which was quite enjoyable.  Nothing special, but given everything else I was quite satisfied.\n\nThe big surprise was the check -- dinner, drinks, for 15 people? $35 a person!  Including tax and tip!  Unbelievable.\n\nAnyway, good times here on New Year's.  If I had to organize an event in the Marina next year, I'd definitely check here.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-17", "description": "Excellent little restaurant, the interior is decorated well, the bar has a TV, there's a cool little wine area and the seating is filled with booths and tables.  The service was really good and attentive.  \n\nI really enjoyed one of their house specials, the veal shank with saffron risotto.  The veal was very tender almost like oxtail.  The risotto was well cooked but I wish there was more flavor, or maybe they could make it with some cheese or something.\n\nWe also had calamari and pizza with prosciutto for our appetizers, the pizza was good, thin crust with fresh ingredients.\n\nI would recommend this place for some good Italian food.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Had a wonderfully relaxing dinner with the family. The service was incredible, and so accommodating in every way. Seated us an hour early and very welcoming like we were family. It felt like the restaurants we visited in Florence. The Pappardelle with mushrooms and sausage was delicious, olive oil for the bread was extremely flavorful.  The Mille dessert  and cappuccino was yummy. The environment is lively but not rushed. Can't wait to go back!", "author": "Karen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-14", "description": "\"He enjoyed the Meal\".   For a tough customer like my Dad,  that is high praise.\nStumbling upon this place as the dinner options were closing, we were pleasantly surprised to find a great selection of well crafted Italian dishes to eat.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "I love this place !!! Their service is excellent ! And so is their food! Specially their pizza!! I gotta say this is one of the best Italians restaurants I've tried so far. I definitely recommend it.", "author": "Berlin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "We love love love this place! Every time we visit San Francisco we have to come here for at least one meal. My husband is Italian, so we rarely ever go to Italian restaurants, he's too picky plus he's a good cook. Anyway, we love the pizza and have tried most of the pastas and they're all good. The tiramisu is amazing too! Almost as important as the food, the service is amazing. We go every 1 1/2 to 2 years and they treat us like regulars. It's good Italian food without being fussy.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-21", "description": "Delicious! \n\nMy family is very sceptical when we go out expecially for italian because we have had more crappy meals than good. I hate to spend money on an average meal when I can make it myself, better. I am an italian cook and a damn good one (if I may say).\n \nThis restaurant was outstanding! We had a few different pasta dishes and shared them. We all loved out meals. I had the pasta with pancetta and mushrooms, my daughter had the spinach fettuchini with bolognese, my dad had the veal scallopini, my mom the risotto with asparagus and rock shrimp and my husband had the angel hair pasta with tomatoes.\n\nFor dessert we had the profiteroles, apple strudel and the puffed pastry with fresh berries and cream ( my favorite).\n\nWe went on a Thursday for a 7:30 reservation and were leaving at about 9. The place was still packing in the people. You know that's always a sign of a great restaurant!", "author": "Kara K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "Great service and really good food. \nThe staff is very nice and accommodating. I wanted a risotto that was not on the menu and they just whipped it up! It was exactly what I wanted. \nThe small seating area makes for a very enjoyable and personalized experience. \nWe will sure come back here!", "author": "Patricia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "After hearing about this place and its great reviews by a friend, I decided to try it out since I was up in the city this past weekend.\n\nAll I can say is wow!  The food was wonderful.  Great people.  Nice ambiance.  Everyone was very welcoming.  The wine was delicious!  I can tell you that out of the 2 entrees, 2 apps and dessert, there was nothing bad!  The portions are good size as well!!!\n\nIts a little small but I think it makes it more intimate!\n\nCant wait to go back and try more things!", "author": "Melissa P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-03", "description": "I've been here twice so far, and both times had similar experience:  excellent food, bad service.  I really like their Penne Alla Puttanesca (tomato sauce, capers, olives, and anchovies) and their special pasta with truffle sauce and shaved truffles was excellent.  Their pizzas are pretty good too.  The problem is that the service is just bad.  Even though the food comes out quickly after you order it, the wait staff are very slow and basically disregard their customers until you waive them down.  Each time we were there, we had to get the manager's attention, who then chased down our waiter, just to place our order and also to let them know we were finished eating.\n\nWith all that being said, I would go back again because the food is good and the prices are reasonable.  Just don't go on a night when you are in a rush or have something planned for after dinner.  Don't expect a fine dining experience either.", "author": "Ghaz M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "Came here for my sisters birthday last week. Fabulous Italian food. They give you very tasty bread and oil to nibble on while you wait. We had the salad as an appetizer and it was really good. Also had some mozzarella cheese thing with some pita bread. For the main course we had the ravioli which was very rich and tasty. The sausage pizza was also fabulous. We left with our stomachs full for sure. The wait staff was amazing! They sang happy birthday to my sister in Italian and let us cut our cake there. Very nice place and great atmosphere. Will return!", "author": "Scott B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-01", "description": "Love love love their food & the front dining room is cozy & good for a romantic date. \n\nIf they try to lead you back to the anterior \"patio\" (or whatever they call this terrible, dirty space) run like a rabbit. The space is akin to a patio in some suburb in a city that died long ago with no ambiance whatsoever. If you then feel like you've been relegated to Outer Siberia, well rabbit, you have.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-17", "description": "This is the best Italian restaurant I have been to in San Francisco.  I'd call it a hidden gem, as I had to walk by it many times before deciding to go inside.  (I should have been clued in by the fact that it is almost always packed.)  \n\nThe food is authentic Italian.  I highly recommend the pasta bolognese.  The service is good.  Maybe a 4.5/5, as occasionally some of that chauvinistic Italian attitude comes out, but it is never too brusque in my opinion.  If you haven't been here, you need to try it - it may become your favorite neighborhood Italian.", "author": "Evan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-27", "description": "Very average Italian food. \n* The rav special lacked flavor. \n* The pizza was just meh (go to Delfina for good thin crust pizza)\n\nAs an FYI - just because you are yelling at your staff in a language I don't speak doesn't mean I don't pick up on the negativity.\n\nProbably would not return", "author": "Captain B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "There is nothing like a small homey Italian restaurant with real Italian waiters. Good menu and wine list to compliment your meal. We ordered antipasto, pizza, wine, coffee and dessert...Excellent.", "author": "SJ O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-12", "description": "I was very excited to return to Pane E Vino last night after having an enjoyable meal here last year. Unfortunately, my return yesterday proved to be one of the worst service experiences. We ordered two salads, a pasta and salmon. The food was all very good with the exception of the salmon. The piece of salmon was gritty and fatty throughout. We shared the feedback with our server and he literally grabbed the salmon from the table and said - this is how our salmon is served.  I explained that I imagined I would enjoy the salmon, but this piece wasn't up to par. Instead of empathizing he walked away and never returned ... we were then approached by a new server who apologized and said that our server was no longer working ... such a strange situation and quite honestly ruined our meal.", "author": "Jacqueline G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "Service, ambiance and food is always wonderful. I've been going to Pane e Vino since 1991 and have enjoyed every calorie consumed - probably eaten here over a 100+ times.  Best stuffed artichoke - bar none. If I would to change or suggest anything it would be to add some new sorbet flavors.", "author": "Diane P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-22", "description": "In town for a 2-day respite from Silicon Valley, I came with my husband and 8 yr old for what turned out to be the best meal the three of us may ever have had!  The fusilli with smoked mozzarella and eggplant was amazingly flavorful.  The pizza was just right- excellent sauce and perfectly made thin crust.  The house wine was okay, but desserts more than made up for that- especially the homemade cheesecake.  \n\nOur waiter was wonderful and the atmosphere of the place was just what we were looking for: nice but not too snooty, lots of character, family friendly.  We will definitely be back again!", "author": "Joan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "Authentic Italian in a rustic, homey vibe. Great family or friend spot. Not for a first date. Food is excellent. Pastas are homemade - had the mushroom truffle oil linguine last night. Shared that, sea bass, and a spinach and pear salad, one glass of chianti and we were out of there at 42 per person including tax and tip.", "author": "Christina N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-25", "description": "I thoroughly enjoyed my meal here a few months ago - sorry it took so long to review!\n\nI had the pappardelle with a light cream sauce and it was AMAZING! I cant remember what the bf had as his main course, but we shared the artichoke salad. Good, but kind of hard to eat.\n\nMy best friend's gf had the mushroom pizza and since they were going to the Fillmore after dinner, I took it home - it was even better the next day! \n\nI would absolutely eat here again, as it is nearly three months later and I still dream about that pasta. Highly recommended :)", "author": "Kate R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-17", "description": "I came on a Friday night to grab dinner with the boy and a couple friends. We called ahead of time and were able to put our name on the list for a table, which was really convenient.\n\nWe started with the insalata pane e vino (mixed greens w/ parmesan cheese, croutons and vinaigrette) which was refreshing.  Nothing special, but something nice to start off with.\n\nThe menu here is pretty extensive so there's something for everyone.  After debating between ordering off the regular menu vs. the specials menu, I eventually decided to go with the osso buco dish off the special menu.  The osso buco came served with a saffron risotto, and (with the boy) I ate almost the entire plate.  The meat was very tender and had good flavor, and the risotto was also prepared expertly.  It really was a large portion of food, but it was so good we ate til we were past full.\n\nThe boy ordered another special dish: penne with smoked salmon and caviar in a vodka cream sauce.  The dish was really good but the smokiness of the salmon was a bit strong.  I only had a few bites of it (mostly because the boy enjoyed it so much it was going pretty quickly) but I thought that was enough.  I probably wouldn't have been able to eat the whole dish.\n\nOne friend ordered a spaghetti with tuna roe and clams, on which we really weren't sure if there was actual tuna roe on it, but our friend nearly finished his plate too.  Our last friend ordered the guazzeto di pesce (clams, mussels, shrimp, and calamari in a tomato broth) off the appetizer menu, but it was plenty big for an entree for one.  She also said it was really tasty.\n\nThe service here seemed a little distracted, though I suppose I would also lose interest in a table that hadn't really decided on food or drinks after \"browsing\" the menu for several minutes.  \n\nAll-in-all, I really enjoyed pane e vino, and because of the wide selection of dishes  I can see myself coming back for more.", "author": "Naoko M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "Great authentic Italian food! We went for valentines day and the restaurant was bright and not exactly \"romantic\" but the service was good and the food was delicious! Great neighborhood spot.", "author": "Erin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "One of the most amazing meals of my life. Especially, the best Italian restaurant in the marina/cow hollow. Extremely romantic and cozy with a wood burning pizza oven and quaint decor. We had the cured meats (salumi), striped bass and grilled veal chop. Literally, melts in your mouth with the perfect seasonings. For dessert lemon cello, chocolate terrine, and Lambrusco. Go there. You will thank me.", "author": "Lisa F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-30", "description": "I just had the biggest lunch in the history of mankind. I ate so much I cannot even move. I feel and probably look like Jabba the Hut during the middle of his \"heavy\" phase.\n\nSo what I do to help remedy all this? I write a review about food.\n\nThis past Saturday my niece put together an impromptu surprise birthday dinner for my sister.  We needed some place that accommodate five and offer vegetarian dishes (no seafood or chicken etc) and still have plenty of carnivore offerings and provide a fun and lively atmosphere.\n\nEnter Pan E Vino\n\nWe arrived at 8:30 and were quickly ushered to our table. Our waiter took drink orders and were sitting in front of us within just a few minutes. Our waiter took awesome care of us and never once did we feel neglected. Our starters were brought out within a decent amount of time and the spacing between that and our mains was perfect.\n\nAt the end of the night, four desserts were carried out by four different waiters who sang \"Happy Birthday\" in Italian. At least I believe it was Happy Birthday? My Italian these days is not so bueno.\n\nAll in all, a perfect evening and the perfect restaurant for us.", "author": "Rene C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "Loved this place, the service was great, the food was perfectly portioned and delicious. It also was reasonably priced. This is my new go to neighborhood Italian restaurant for sure.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "We had a great experience here for dinner.  Very busy considering it was a Monday.   We were here with kids and mother in law, and service was good, food was good (recommend the linguine tutto mare and the Veal my husband had)", "author": "christina o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-28", "description": "I find myself in the Marina with my visitor friend craving Italian food after her pedicure. For whatever reason I realize I have been to all Italian restaurants in the Marina.....although I live in North Beach. And I also realize that when I want good and reliable non-fancy Italian, I go to Pane E Vino. And it never disappoints me.\n\nWe walked by many empty restaurants on a foggy Sunday evening, but Pane E Vino was busy as usual. It took us 15 minutes to get a table. The warm ambiance and the festive atmosphere made it a great place to have a cozy catch up with my friend. \n\nWe had the fresh burratta with heirloom tomatoes and anchovies for starters. It was one of the daily specials, and I never had it there before. I went to heaven! If you are ever there when they have it on the specials menu, GET IT! Our neighbors were jealous too!\n\nMy friend had the ravioli with spinach and prosciutto, while I had the pizza marguerita. They were both really good. What is even more extraordinary about this place is the price - $10 for such an amazing gourmet appetizer?? $12.50 for that huge and yummy pizza?? \n\nThe wine list is relatively good too, and after a couple of glasses of malbec, a super comforting meal and a lot of catching up, we were both ready to wrap up our weekend. We were thankful. Thankful for life, thankful for Italians and thankful for Pane E Vino.", "author": "Simone W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-21", "description": "Wait staff and manager were very friendly and attentive.  My dish was good, but not great.  Lots of specials, and I suspect if I had an opportunities to try a few more items I'd find some real gems. \n\nThey gave us as much bread and zesty olive oil as we desired, which I certainly enjoyed.  I'd recommend they add some balsamic vinegar to the mix.", "author": "Jordan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "We were looking for a hidden gem and found it.  Using yelp, we felt this was a good place to try. WOW, what a great find.  Atmosphere is warm and inviting and reminiscent of a true restaurant in Rome. Food was simply amazing.  We split a salad and had the ravioli and corkscrew pasta. Both were amazing. The ravioli a were obviously homemade and cooked perfectly. We had to share a dessert because we were so full.  We chose the profiteroles and they were amazing.  Also in a nice part of town with plenty of boutique type shops up and down Union Street. You can tell it is really good because almost all the customers are regulars and locals.  The staff knew just about everyone.  And by the way, the staff is super on top of their game.  Super service!", "author": "Rob J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-02", "description": "Love this spot!!! We come on the regular because the food is delicious and fresh! My staple is the fish and veggies and couldn't be more satisfied!", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "This is my favorite Italian restaurant in all of SF. I've lived here for almost 5 years and have been to many Italian spots. Maybe there is a bit of bias because it's just a few blocks from where i live, but the food is amazing. The risotto is a must have and any pizza you order will be so tasty. This place is very popular with the locals, even I've become a regular. It's always busy, so make sure to make a reservation.", "author": "Fabiola S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "Stumbled across this place by fluke. Was amazing. We got there just before the rush, it gets busy on a Wednesday night! We were served two lots of bread while waiting - best bread I've had in SF. The house red wine was delicious, no Corona but they do have Heineken. The food came out fast (because we beat the rush I assume), the pizza had a delicious sauce, it looked boring but tasted great. The salmon was simple, cooked well through with veges being brocolli and carrots lightly tossed in olive oil. Service was fantastic, they all appeared to be Itallians (with their accents) and one waiter loved to chat to us, so stopped at our table a couple times in passing - probably because of OUR accents :p", "author": "Sarna B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-17", "description": "Forgettable. The pappardelle with duck ragu seriously smelled and tasted like chef boyarde but they nicely offered to replace it with a eggplant cheese tomato pasta dish.. Much better but still totally average. Nice wine list and staff.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-15", "description": "Given the high Yelp rating, I was truly excited to try this neighborhood Italian place with my husband on a recent Saturday night. I should first say that the atmosphere was lovely - perfect for neighborhood Italian - tables spaced far enough apart, good lighting, nice decor.  The wait staff was also very nice and attentive.  The bread on the table and olive oil were fresh and yummy.\n\nUnfortunately, our dishes were only average.  They are known for their pastas - so I ordered the spinach ravioli with brown butter and sage (and tomato sauce?)  The two sauces did not work together - it was like I had 2 different dishes on one plate.  I ended up scraping the tomato sauce to the side.  And the pasta was too al dente for my taste. My husband had the wild boar ragout over wide noodles.   Again, it was ok - not great.\n\nWish I could give it 3 1/2 stars - that's probably a more accurate rating for the 4 star atmosphere with the 3 star food. The pricing was good for the entrees - so we'll probably try it again - hopefully we'll  have better luck next time.", "author": "Nanny M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-28", "description": "Great food, great place and super friendly people! Make sure to have a reservation... Always pretty full cause the food is delicious!", "author": "Bruno V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-10", "description": "Really has gone down hill. Used to be our favorite.  Pizza crust was tasteless and the pomodoro was also much different and nearly tasteless. New management?   Won't be back.", "author": "William O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-26", "description": "I would honestly give 4.5 stars if I could.  Yelp needs to catch up with the rest of the world where such is easily doable.  But even at that, this is the highest rating I have ever given any restaurant.  All the food was magnificent, from the warm bread to the cheesecake.  The service started out great, then got a little spotty after the food was received, including a bit of a wait to get my check.  All this while the restaurant was not crowded at all, hence the loss of half a star (if I could).  But I will definitely return.", "author": "Anthony H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "I know I know, I wrote a review just a month ago, but after my last outing, I couldn't resist writing another. The heat wave had just dissipated, so we were walking down Union, after a stroll in the park with our pup, enjoying the \"normal\" Spring SF temperatures. We walked by Pan e Vino and thought it would be so nice if we could eat our favorite truffle pasta outside with our dog. My hubby figured there was no harm in asking so he went in and talked to the host. Within 30 seconds, he scooped up a table, carried it over his head, and proceeded to set it up outside for us. Now that's service!!!!! We were so appreciative and the great service didn't stop there. I wish I knew our server's name, but he was so friendly and attentive. He always made sure we had enough water in our glasses and oil and bread on the table.  A bus boy even brought or dog some water in a to-go container. It was such a pleasant evening and we are looking forward to returning in the near future for another delicious meal outside with our pup!", "author": "Kelsey K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-15", "description": "We live a few blocks from pane e vino and it always seems crowded, so we decided to try it out. We made a reservation and they sat us ~20 minutes late. After being seated, we had to ask for a drinks menu about ~20 minutes later - they totally forgot about us, which is hard to do in a tiny restaurant. The food wasn't very good at all. We ordered the calamari, which was extremely fishy tasting. We also got the bolognese pasta and margherita pizza. The pizza was the only good thing we had. The worst part? There were all of the gnats flying around - 1 flew into my pasta and we told someone and they just removed that piece of pasta like it was normal with no apologies. So gross! The highlights: pizza and wine. Low points: appetizer, pasta, service, and bugs in food.", "author": "Jillian P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-05", "description": "Charming atmosphere\nWarm waitstaff\nGood bread\nAuthentic, delicious pasta\nMy friend had the veal chop and he and those who tasted it really liked it\nGreat choice for Italian to frequent with good friends", "author": "Chetan I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-18", "description": "Very cute neighborhood spot on a fun street to walk around. Sadly, the food was awful. The caprese salad's mozzarella had no taste and they put dried oregano on it. The Sea Bass had a strong fish taste and was completely over cooked. The chicken lasagna had good flavor but was also completely over cooked. The bread and wine were great.", "author": "Louise S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-21", "description": "Lu can not find good Italian in this neighborhood. I was very disappointed. Bread was good. Wine list cheap and good. Minestrone ok. Salad ok. The veal stew and buccatini amatriciana were not good. I wanted to walk out and try another place because I hate eating bad pasta (under seasoned. Watery), but it was too late. I will not go back. Wife did not like it either. Restaurant was full and lots of people seem to like it, though. I do have very high standards for Italian restaurants.", "author": "nick g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-12", "description": "One of the greatest places to eat in San Francisco! The service, food, and atmosphere feels as if I am in Italy. I would HIGHLY recommend this place to both locals AND tourists.\n\nI would recommend the Fusilli with Eggplant and mozzarella cheese. The smokey flavor really entices you to keep on eating it. I could eat this dish everyday for the rest of my life! Also, the pizzas are to die for!\n\nThe waiters and staff at Pane E Vino are some of the most hard working people I've seen in the restaurant world. Fabio, especially, is one of the best servers I've come across. I am aware he has been serving at Pane for many, many years. He is polite, friendly, comical, and on point. I ask to be seated in his section every time I come in to eat. Carlos, the manager, is someone I look forward to seeing when I come in.\n\nI am very surprised there are negative reviews about this restaurant. 5 stars are well deserved!", "author": "Jacob S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-11", "description": "If authentic Italian is what you're after, this is your spot. Some of the best Italian I've ever had - just try to come before 7 if you don't have a reservation - they get very busy around that time.", "author": "Tina H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-04", "description": "Three of us had. Petrale Sole .  We all agreed it was a bit too meaty for sole.  The lemon sauce lacked flavor.  The portions were extremely generous but I not recommend this dish.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-01", "description": "Awesome authentic Italian, from fresh bread to fresh fish, homemade pasta, this is my favorite go to restaurant.", "author": "James D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-03", "description": "Where do I even begin...\nFirst of all, I live a block from this place (DANGEROUS). It is an adorable little romantic Italian joint, with that mom & pop feel. They have yummy Italian vinos. The minestrone soup was to die for!!! I could seriously eat it everyday! And delectable Veggie Lasagna! this place is a great date spot  : )", "author": "diane s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-24", "description": "nice atmosphere, friendly service,  and generous portions but food was either very bland (seafood appetizer) or very salty (fish of the day).", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-13", "description": "There are many reasons I adore Pane E Vino. \n\n1. Consistency: the dishes are always the same. No surprises. Everything listed will be on the plate. You bet the roasted half turkey is always cooked juicy to perfection. And that pizza is cooked perfectly, cheese divine, prosciutto top quality, arugula fresh. You get the idea.\n2. The owner/manager: charming Argentine man, so kind and always says hello to his locals. He is an absolute pleasure.\n3. Ambiance: cozy, warm, bustling. Great place to get out of the fog.\n4. Service: efficient. Much like being in Italy - they do not interrupt conversation and are not there to entertain you. They're there to feed you and let you be with your party. They don't hustle you out. The table is yours. You can be the last table in the place and you'll barely notice. They will clean quietly around you.\n\nPerfect place to celebrate, be romantic or catch up with a friend.", "author": "Meredith R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "Great date restaurant. I went there on a date a few weeks ago, and have been there with family many times. The wine selection is great, and the pasta is very good as well.", "author": "Zach H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-05", "description": "If I could give 0 stars, I would. \n\nWent here with a group of 14. Granted, we were a large group, but we ordered a lot of food and were courteous. We sat outside where nobody else was sitting- it wasn't terribly busy. The food was so-so, a step above mediocre. I might go back and give it a 2nd chance, except....THE SERVICE WAS GODAWFUL. The staff were rude and they basically didn't give 2 sh*ts that we were paying customers, there to enjoy a nice meal. \n\nWe had to ask for our check at least 3 times, and when they finally brought it, they left it on a nearby table, so I had to stand up, walk over to this table and bring it back to ours. Then, nobody came to pick up our payment for 10-15 minutes. I was fuming so I walked into the indoor part of the restaurant, asked for the manager, and practically had to beg to pay the bill. We should've dined and dashed, maybe then they would've paid some attention to us?? Oh and of course, cuz we were a large group, 18% gratuity was automatically included. I guess they had no incentive to treat us like human beings. \n\nAVOID.", "author": "Lanakila T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-18", "description": "Came here with mad craving for bolognese, and on that front, they didn't disappoint.  Their taglitelle alla bolognese is satisfyingly meaty, the perfect sized portion, and served up quick and piping hot.\n\nThe bruschetta, on the other hand, was less than perfect.  The bread was charred, and the flavor was nothing to write home about.  At $3 per piece, they had better be out-of-this-world delicious.\n\nIn fact, while I did really enjoy the ambiance, service, and bolognese, I flip flop on whether or not it was a good value.  The pasta was $16 a pop... standard for an evening out to dinner, but for some reason I have a hard time justifying the cost in comparison to other cuisine.  However, if you have a craving, like me, or just love Italian, this is a pretty solid place in the neighborhood.", "author": "Allison B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-16", "description": "Good, standard Italian food. Don't expect anything really innovative or authentic - this place is moreso your typical American Italian restaurant. Service was okay and we didn't have to wait long to get a table on a Friday night. There's easily a handful of better Italian places in the area.", "author": "Gina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-03", "description": "Good, casual, local, clean simple Italian food! great service!", "author": "Kirk M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-03", "description": "I was so excited to eat here after reading Yelpers reviews.   \nThe food however ... was just mediocre.    The service was great! \nGreat Host ... great wait staff.   Just a little disappointed with the cuisine. \nPasta Di Mare ...  hardly any pasta noodles and pasta was over cooked - not al dente. \nSauce tasted great ... just with there was more pasta & wish it was al dente.   We also ordered the Oso Bucco ... was just okay.  The saffron rice didn't really \"wow\" us.  Seemed like it needed more wine or garlic ... something.  It just tasted like bullion flavored rice.   We also ordered the Pizza Margarita ... it was okay .. pretty good. \nAnd ... we ordered the fried calamari appetizer.   For some reason they brought us a combo plate with other fried appetizers.  It was okay ... pretty oily and a little chewy. \nWhat I did love about the restaurant was the atmosphere ... it was charming & romantic.   Would be a great date place ... just wish the cuisine tasted better.  I would not go back here again.   Once is enough for me.", "author": "Suzie Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-27", "description": "Brought my family here last night, super friendly service, super food and sound levels allowed for easy conversation.  Ordered a Carbonara dish not on the menu, it was outstanding! Five different dishes ordered and all were above average.  The calamaris appetizer was actually large enough for all to enjoy, unlike in many other eateries.  Can't wait to come back.", "author": "Donald R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "We have been eating at Pane e Vino for over 20 years and love the atmosphere, the great staff and the really top notch Italian food.  It is a complete winner.  Every time we are in there, we are treated well, and the food is consistently great.  Judging by the staff interactions with other customers, they clearly have a huge number of other faithful regulars.  We have taken numerous friends there, and have yet to have anyone not really like it.  My cousins from Sweden got married in San Francisco recently, and picked Pane e Vino for their after ceremony dinner, and it was a great experience.", "author": "Kirk L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "Great cozy place. Our pasta was really good. My husband raved about his pasta with mushrooms and truffles. I had the penne with mushrooms and pancetta. The light tomato cream sauce was excellent. The flan I ordered was pretty standard, nothing noteworthy - it was tood bad that the berries it came with were not ripe and didn't add much to the flan. Come here for the pasta!", "author": "Jenny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "Totally enjoyed our evening! Great service and food!", "author": "Christine B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-03", "description": "Unfortunately for Pane E Vino, this is one customer that will never return.\n\nA group of 15 ppl, we were placed in the back section. It's a beautiful back room, with clear ceilings so the sunlight can shine in. Flower pots hung from the terrace providing a wonderful outdoor feeling. As the only group in the back, we felt like VIPs! SCORE!!!!! \n\n...not!\n\nWe were neglected. Given menus, the waiter leaves. 15 minutes, 20 minutes. No one come backs. Finally a busboy walks by and we waved him down. He said he'll get the waiter. Another 5 minutes, 10 minutes. Where the hell is the waiter?! The same busboy walks by again. Ummm...we would like to order. He said he'll get the waiter...again.\n\nMoving forward...\n\nThe food was good, some more enjoyable than others. Their usual pastas are flavored well. I had order off the special menu, risotto with quail and mushroom. The arborio rice was slightly undercooked (not enough liquid). I was quite surprised that they serve the dish with 2 quails. The quails were quite delicious but difficult to eat. The risotto itself was plain and bland. Had to mix the juice from the quail to actually enjoy it.\n\nSo here comes the worse part of the dinner, which made me vow to never come here again...\n\nThe total bill came to less than $300, which was pretty good for 15 ppl. 11 people paid in cash with 4 people charging their own portion on their credit card. Our waiter takes our cash and cards. 10 minutes later, it was the manager that returns with the bill and receipts. He goes...\"Here are your cards. But there's a problem with the cash.\" He takes a stack of cash and counts it in front of us. \"You guys only paid $97.\"\n\nOMG. We were all like WTF?! I don't know about other people, but when my friends and I pay as a group, we usually make sure that everyone paid their portion and the bill adds up. \n\nWe were so upset, because here we are, being accused of shortchanging the bill. We had counted $227 in cash and added up the separate credit card charges before handing the waiter our bill. Even if we were off in cash, I don't think we would be short more than $100. We told him we paid more than $200 in cash. And the manager insisted that this is what our waiter had given him, which led us to suspect that the waiter had taken our money.\n\nTime passed and the manager just stood there expecting us to do something. Of course we weren't gonna put in more money, since we KNOW we paid the right amount. Finally, with us not budging, the manager goes out and asks the waiter. THEN...he comes back in and apologize saying that there was a confusion with the bills.\n\nLike the song...it was \"too late to apologize\". One sorry was not enough. We were disgusted, with the manager, with the accusations, with the whole situation. \n\nThe food is definitely not good enough to make me come back. Never again.", "author": "Marti L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-13", "description": "I have been coming to this place since its location on Scott Street.  This place was my first carpaccio experience.  I have yet to find a better carpaccio.  This new location also has an outdoor patio, which is cool in times of good weather.\nUnfortunately service is lacking.  The servers and host barely speak any English or Italian.  Not the same interest and zeal from the staff as it was 15 years ago.  Times change though.  The food is still good.", "author": "D B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-28", "description": "I looked this place up on Yelp and expected it to be a great experience based on what I read. However, the only reason it isn't receiving a fourth star is because of the service. The host/manager(?) wasn't the politest to start off. He guided us to the BACK of the restaurant which was still nice but almost abandoned if you will. Then our server took way too long to greet us, but once he did..he was quick and impersonal. I've worked in a restaurant before and I know that the servers are supposed to greet the guests regardless of how busy you are. We had to ask for bread and water refills way too often, it was annoying. The only person that was nice was infact the water boy who of course spoke no english. The server was impatient for the entire meal as well. He wanted us to order pretty much right as he greeted us and didn't care to accomodate my younger sister (she's 10 years old.) I don't care how FINE of dining you think you are, you accomodate your guests regardless. He didn't recommend any dishes suitable for a child her age nor did he take the time to recommend anything to me and my friend. The best part of the meal was of course, the food. We had a margherita pizza, eggplant lasagna, and plain pasta with butter. It was filling and delicious. The server didn't check up on us at all throughout the whole meal which was again, annoying. Like I said, no water refills unless you asked, no bread refills unless you asked, and no conversation...AT all. \nTo sum up, he received a poor tip and I probably wouldn't go back unless it was a free meal. Ha.", "author": "Bree G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-09", "description": "Small neighborhood restaurants are always a favorite of mine. I usually come here w/my favorite Italian :) Makes it that much better! Everyone always greets us kindly and I feel like I'm entering my family's home.\n\nA few of my favs here:\nGUAZZETTO DI PESCE\nMOZZARELLA ALLA CAPRESE\nLINGUINE AI FRUTTI DI MARE\nCAPRICCIOSA-pizza\nBOSCAIOLA-pizza\n\nIf you like whites:\nBIANCO DEL FRIULI\n\nIf you like reds:\nBARBARESCO, Produttori del Barbaresco, Piemonte'06", "author": "Lola D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-31", "description": "Excellent! The appetizer was so fresh, it tasted like the tomato was just picked. Recommend the wood fired pizza! It's large enough to share with 2 people. The waitstaff was excellent and very attentive. Casual atmosphere. Didn't try any wine, but the list was extensive. If you're in the area, definitely visit this place!", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-07", "description": "Food was good, not great. Good atmosphere, and did a nice song+tiramisu for a birthday.", "author": "Erin F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-06", "description": "Went here for a nice evening out and was completely disappointed, I ordered a daily special which was ravioli with ricotta and spinach in tomato sauce, what I got was literally 6 regular sized, under-stuffed ravioli that was incredibly bland in flavor. The ceaser salad I had as an appetizer was also nothing special. I left the restaurant still hungry over a meal I could have made myself with better results. This wasn't my first visit there, but it will be my last.", "author": "Rachael T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-11", "description": "Just edible italian food, not disgusting NOR mind-blowing.  Service was quite slow but we weren't in a hurry and enjoyed eating at the counter watching them assemble pizzas and bread sticks.  So many other places to try in the area, so I wouldn't be back again.", "author": "Janet L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-13", "description": "OK, here I go again.  I AM a foodie and I have high standards. And I mean that in the best possible way. So take that under advisement.\n\nThis is NOT a hidden gem.  This is not a great Italian restaurant. It's been around forever--they moved a few years back, but longevity does not insure high quality.\nThe food is truly in these days in SF a B-.  They cut corners, they are not in the least bit fresh or creative--it is standard old school not terrible expectable Italio.  The service is pretty good, the ambiance is OK--tables much too close together, crazy Italian pop music too loud.  But sort of fun in a wacko way.  The wine is OK.\nI guess they've just been at it too long and need a shot in the arm, like a visit to\na few other Italian restaurants that shine, like_____ and ______.\nBut I guess it works for them.\n\nYou must realize that so many reviews on Yelp are by people in their 20's- 30's who just really don't have much experience or taste.  So, consider the source.  I'm a snob\nand a very experienced one.  I admit I ate here out of desperation and wondering if they'd improved since 6 years ago, the last time I went.  Oops.", "author": "harmonia b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-09", "description": "Definitely a meal I won't soon forget! Walked in as a party of 5 without reservations and was politely sat between reservation times on a busy Friday night (Fleet Week). Saw gorgeous mushrooms in the display case so I ordered the pasta, mushroom and truffle special - which was perfectly executed! The table's wines, pizza, buffalo cheese app and olives were also equally delicious. This is an understated memorable dining experience I'll share with good friends and family, for sure.", "author": "Josh M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-06", "description": "Turning the tables!  Deplorable for a restaurant anywhere less San Francisco. Ah Europe where one can dine without the host or waiters hovering saying, \"Take your time\" and asking if you want the check.\n\nGood food, good service but leave me alone when I have a $100 tab for 2.", "author": "Tex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "This is our go to place for Italian and great company. Our little girls love the staff including Carlos the owner and they talk about going to visit him :)", "author": "Ross M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-12", "description": "Feeling like Italian last night, we ventured in for a bite. It had been a few years since our last visit, and unfortunately, for their location and fierce competition in the neighborhood, the meal was akin to something you could pick up from the frozen section at Safeway. I'm not hating on their establishment, just offering a fair assessment compared to other local places like Campannia or Amarena. \n\nThe baby octopus starter was tasty, however the grilled sausage and 1/2 chicken mains were both dry and average tasting. Service for both the waiter and busser was intermittent and disengaged. I'm not expecting the Danko experience of attention, but some genuine interest in our satisfaction would have been nice. \n\nSadly, with all the choices around, we will not be returning here.", "author": "Informed C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-15", "description": "When we're in San Francisco we make sure to dine at Pino e Vino. Every time we're treated as if we are regulars from the neighborhood. Not only is the food delicious, the service is very attentive. I highly recommend Pino e Vino for great \"foodie\" experience.", "author": "Angela M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-30", "description": "I would really give this place 3.5 stars for the food, but I'll round up because the service was awesome.\n\nI went here with a few girlfriends last night to celebrate a birthday.  After we walked in, I felt a warm and welcoming atmosphere.  Our server, Favio, was extremely gracious and gregarious.  We got a great round table and a round of champagne and bruschetta on the house (it definitely pays to be a group of laughing ladies!).\n\nI ordered one of the risotto specials ($18): asparagus and rock shrimp.  The portion was just the right amount to fill me up without weighting me down.  It was light yet creamy, savory but not overly salty.  It could have used a bit of heat, but I lived without it.\n\nI really, really loved how they decorated the restaurant.  Salmon colored walls, soft lighting, and Italian ceramics filled the walls.  i actually felt like I was in a small bistro in Italy. \n\nIf I was in the neighborhood again, I would come here.  Parking is a pain, but as it gets later in the evening--Monday-Thurs-- it lightens up.", "author": "Marissa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-28", "description": "Favorite place to grab Italian outside of North Beach, and conveniently located close to my girlfriends place. Everything we have had here has been excellent (pizzas, apps, pastas), but I especially love the pappardelle alla contadina (egg pasta w/ chick and mushrooms in tomato cream sauce).\n\nAlways over-order, but anything brought home is always gone by the end of the night...", "author": "Kent S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-02", "description": "I took my parents here for dinner. We had the capellini with fresh crab, sausage on polenta, linguine vongole for dinner,  We all LOVED our dishes. The service was impeccable. They were extremely busy but the wait staff didn't miss a beat.\nI am glad to find another great neighborhood restaurant.", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-14", "description": "I've been all over Italy so I know what real Italian tastes like and Pane E Vino knows what that is as well.  Surprisingly not that many places in SF actually do.   \n\nPane has a huge variety of pasta, fish, meat and appetizers, everything was very authentic, the bread wasn't great and since it's part of the title and a staple in Italy that is something they should work on.    Some dishes were simple and almost homely and some very elaborate with flavors expertly intertwined together.  Just depends on what you want..  The portions are great too, not too big and of course you have to have wine.  \n\nThe courtyard is great too, gives you a completely different feel for dinner.   It can be romantic or just social for a group.  It's like being outside but it's covered so good for any day since we can't really depend on the sun in SF.", "author": "Inga W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-22", "description": "3 people, 1 appetizer, 3 main courses, 2 desserts, 1 bottle of wine = $125.00. For the food that we received, which was average at best, I consider the food overpriced at $125.00 before tip. I would not go back again. Also, the ambiance combined with the sub-average food made me wonder that Denny's, TGIF Friday's, or a diner would have been a better choice. However, I did like the neighborhood and the surrounding bars.", "author": "JH J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-07", "description": "Best Italian restaurant in San Francisco.  Amazing pizza, especially the \"prosciutto cotto and funghi\". I have been going to this place for over 3 years and I am crazy about it.\nVery friendly service.", "author": "Cece P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-31", "description": "Great pizza - very thin crust, not stiny with the toppings. Delicious cheesecake - large and not too sweet (but still not as light as Zanze's). The pastas with fish tasted too fishy. Still good though, but until the fishy taste goes away, I'll give him a higher rating. Great Italian restaurant...I want more.\n\nJONASAPPROVED!", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-12", "description": "I know this is a popular place but I was there  a few days ago and the truffle pasta was almost inedible. They must have poured an entire a box of salt in my order.  The canolli dessert was nothing special.  The staff was ok but the young greeter/manager was pushy, loud and  rude with other employees which made the atmosphere stressful.", "author": "Helen Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-15", "description": "One of my favorite Italian places in the City, if that tells you anything. \n\nThe place itself is a bit small and always busy, but the hand made pasta is fabulous. Fast, helpful waiters and oh, the food!", "author": "Ben R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-01", "description": "This is restaurant is absolutely wonderful. Unless....you're a fan of the wanna-be-authentic-italian-restaurant: Olive Garden. {vomit}\n\nMy boyfriend celebrated my surprise birthday dinner with friends here. Both the service and food were excellent. Not only was the food fantastic, but they served my cake and our bottle of champagne at the exact time we  asked them too - they were very, very, helpful. The restaurant owner, who is a completely easy going man, was completely helpful in coordinating such a special day.\n\nNow, we celebrate each special day, including our anniversary, at this restaurant. Every time we go, both the service and food meet up to our standards.\n\nAaaaaaaaaaaaaaaaaaaand, let me tell you - their wine selection - pssssssssst! It's out of this world. \n\nAlthough all their dishes are d-licious, both the Gnocchi and the Truffle pasta are to die for!!!! I think they only serve the truffle pasta dish on Mondays though. \n\nThis restaurant is always packed during weekends, and weekday evenings. If you're stopping by during the weekend, be sure to make reservations or expect to possibly wait outside - their {standing} waiting area is teeny tiny, so you'll probably be waiting {standing} outside.", "author": "Rosa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "I celebrated my birthday here, my friends and I had a great time ! Food was delicious and filling, everybody enjoyed their dishes. Service was also excellent, we stayed until they closed and they never tried to push us out.", "author": "Mary R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-20", "description": "Delish, delish, delish.\nMy father moved from Italy about 35 years ago so when he loves a spot, I know it's going to be great.\nI recently moved back to SF from a two year stint in Italy and was meeting up with four Italian friends when my dad suggested Pane E Vino. No one was disappointed. \nThe service was great, the restaurant is adorable and the food awesome! We love to share in my family, so I sampled a ton of dishes. We had a generous sampling of antipasto and then each got a first course. The porcini with truffle sauce pasta was my favorite, but really, they were all delish.\nYum.", "author": "Francesca F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-07", "description": "This was a fine dining experience. The host was very friendly and causal, asking us where we would like to sit. The food was decent. I felt that my parpadella pasta was a little salty and so a lot of the ingredients that they put inside didn't come through. However, the noodle itself was really soft, as it should be and the sauce that came with it was thick, the way it should be. \n\nStaff were friendly as well. The only awkward things that happened were 1) they don't give you plates for bread 2) our food didn't come at the same time. \n\nEven though Yelp says the dress is casual, I would recommend wearing something dressy casual...if that makes sense...", "author": "Joyce L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-12", "description": "As I am Italian .... It is not easy for me to find a good Italian restaurant in SF but at Pane e Vino you can find a decent Pizza as they have a brick oven ... you can  try   Pizza Tirolese   or  Pizza quattro formaggi  and  Prosciutto  sometime in the special that you can share  as a starter .\nPortions are big for the pizza:) \n\nI also reccomend to avoid the Pastas in all the Italian Restaurant in San Francisco  and  go directly to the main course Menu  .... \nsuch as  the Ossobuco ( Veal Shank )  served with Risotto .\nFor the pasta go on youtube and cook it at home \nhttp://www.youtube.com/watch?v=QPN1rxOd0-8&feature=related\n\nBuon appetito :)", "author": "Rudy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-10", "description": "7:45pm: Arrive on time for our reservation. Seated promptly. \n8:10pm: Place our order for a pizza and a pasta. They ask if we want one to come out first so we say we'll take the pizza first. \n9:05pm: They bring out both dishes at the same time. The pizza is cold. In my mind, my future Yelp review plummets to 2 stars. The pasta is pretty good luckily (and not cold). \n9:10pm: Waiter realizes the pizza didn't come out first and apologizes profusely. Offers dessert on the house to make amends. We don't really want dessert but we take it anyway (I am incapable of turning down free food).  Mental Yelp review goes up to 4. \n9:40pn: Tiramisu arrives. It's decent. I'm happy. \n10:05pm. No sign of the check (or anyone to ask).  Getting sleepy after all the wine. \n10:15: Finally get the check. The dessert is on there. Are you freaking kidding me??? Mental Yelp review nose-dives to 1 star. \n10:25: We finally get the bill fixed. Profuse apologies yet again, mildly eases my frustration. \nNext day: I eat the leftovers and they are DELICIOUS. If only the pizza had been hot originally.\n\nFinal verdict? 3 stars. But it was quite a roller coaster.", "author": "Priya N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "I got the special --- spaghetti with Main Lobster. It was only $26 for the entire lobster --- I thought that was a pretty good deal!", "author": "Karin Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-25", "description": "I don't like salmon. But, salmon colored walls work surprisingly well for this restaurant.\n\nCame here for a business dinner last night with my coworkers. The restaurant was empty so we didn't have to wait for a table. The menu is pretty extensive, but do yourself a service and order a pizza.\n\nThe Puttanesca(w/o Anchovies) was good, but their thin crust pizza's looked friggin delicious. I do plan on going back for their pizza sometime soon. \n\nWhat else?! Speedy service, but that could be due to the lack of clientele on a Monday night. They did rush us out as the owner wanted to close early, but apologized profusely. Parking is a bitch. \n\nDo give it a try", "author": "Tushar V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-30", "description": "The ambiance is warm and inviting. The menu was creative, seasonal, and varied. The food was beautifully prepared and delicious. We had burrata with radicchio salad from the specials menu and fusilli and Mediterranean sea bass from the regular menu. Every dish had some flavor or side that made it unique. The wine list was extensive. Service friendly but not intrusive.\nPane e Vino is now on my favorite restaurant list.", "author": "Kendra M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-09", "description": "So, we had a little Acton mini-reunion, but had trouble getting reservations for 16, where 9 of the 16 were kids.  Even in a bad economy, this is not an easy task, but we managed to get a table at Pane E Vino on Tuesday at 6:30.\n\nThey were very patient as the arrival time ended up stretching from 6:30-7:00 (understandable if you are a parent).\n\nFree parking is not so easy, but I managed to score rock star parking.  Helps when you are the only single one in the group and you leave work early.\n\nThe food was really good.  I had the Pollo Marinato Allo Griglia and the Ahi Salad. I also had some good Italian beer, while most everyone else had something from the killer wine list..\n\nThe dessert was ok, but I should have ordered the profiteroles instead of the mela caramellata.  The bill was steep, but considering we hogged the best table in the place for 3 hours while entertaining ourselves of stories of the hometown, it was a small price to pay.", "author": "Will A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-31", "description": "place was ok , food was good , nice to have  dinner out  nothing fancy", "author": "A. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "Consistently very good.  Their pastas are always on point, and their meats are good too.  Wonderful wine selection and service is always warm and inviting. I've been coming to Pane e Vino with my family since 1993.  We started at the one in Montecito and have since visited LA and SF locations too.   Always a hit!", "author": "Carrie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-10", "description": "Can't believe that I've lived across from Ft. Mason for 3 yrs and never been here!\nThe wait staff was terrific, reminding me of the jovial ones back in Siena, Italy.  I half-expected a 'Ciao bella!' sometime during the meal.\n\nOrdered: whole-wheat pappardelle with roasted duck ragout (special) with homemade noodles.  \nCapricciosa flat crust pizza\n(Tomato sauce, mozzarella, prosciutto, mushrooms, artichokes, olives and oregano)\n\nThe pizza was delicious for breakfast and pasta for lunch today. \nI'll definitely be back.  Good thing bikini season is over and I can start indulging in Italian carbs once more.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-01", "description": "Super disappointing.  I'd been here before for a birthday and remember it being great.  Took a date here tonight and the service was terrible.  The waiter seemed off in his own world and not attentive at all.  We kept having to ask for refills on water and no one checked on us throughout the meal.  My date was as unimpressed as I was.  Food was decent, but as I used to work in a restaurant and my date is currently a server, we both will not being going back.  Kinda a buzz kill for us.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-06", "description": "Went here on a whim about a week ago. No reservation, and it was very busy. They apologetically offered a table in the back room - which turned out to be great. It's a covered patio with the ambiance of a grape arbor, and a view of the kitchen complete with cooks rushing around and gleaming copper pots hanging in the window.  If only the food had been as good. I usually order veal the first time at any Italian restaurant - both because I like it and because it's a good gauge of the quality of their cooking. I got the scaloppini in a mushroom sauce and while the sauce was excellent, the veal itself was like cardboard. The bread, with a good dipping oil, was yummy - crusty outside, soft inside. Well of course; it was from Acme. We got the caprese salad, attractively plated, tomato fresh and in season - but the mozzarella fresca was on the firm side. At Il Cortile in NY we were served soft, falling-apart bufala mozzarella, and have rated capreses ever since on that standard. I can't remember the hub's entree at Pane e Vino, and neither can he, but it was equally o-k but not great. On the way out, we saw that the main dining room was dimly lit, loud, and crowded. We were so glad we'd just dropped in and were ushered to the second-class compartment .", "author": "Leigh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-25", "description": "The place was full on a Friday night, and I was glad to have made a reservation. We changed the reservation from 4 to 6 a couple hours before and they had no problem changing that, which was appreciated on our part. \n\nI had the Napoletana thin crust pizza. Very delicious if you like anchovies and capers. If you don't, obviously, there was more going for this pizza than just the anchovies and capers, so I'm sure one of the many choices will satisfy you.\n\nOur table had everything from pizza, to a roasted half-chicken, to a lamb shank, and everyone was satisfied. \n\nThe pizza is the most economical way to go, as I paid $23 (for the $13 pizza and my share of the wine + tax/tip) and still had 4 slices left for a midnight snack and the next day's lunch. \n\nThe decor is very nice here. A homely rustic Italian feel with friendly servers.", "author": "Saori E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-17", "description": "Pane E Vino is an intimate Italian restaurant full of warmth that offers food rich with color, texture and flavor. \n\nWe love their authentic Italian pizza- thin crust, aromatic with just a handful of high quality ingredients-simple but special. \n\nI am vegan and they were happy to make my pizza without cheese and it was amazing.\nMy husband and I enjoyed our meal and service was stellar. We would definitely go back!", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-04", "description": "Really fresh, authentic Italian food at a very reasonable price.  Plus, they make one of the best thin crust pizzas in the entire city.  I would recommend Pane E Vino with two hearty thumbs up.  (Though make sure to bring your appetite when you dine here, portions are HUGE!)\n\nNote: Technically I think that this restaurant is more in Lower Pac Heights than Union Street/the Marina/Cow Hollow as it's located at the corner of Union and Laguna.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-15", "description": "I love good food, good service, clean well kept environments and people who love their customers.\n\nI went in with friends on a Saturday night without reservations. The owner was able to make seating for us at a small table and asked if this would be suitable. Ok by me, especially when the aroma of the kitchen is calling my name in a most seductive way.\n\nWine list, oh my golly golly, one of the finest selections from CA to Italy with premiums by the glass, none of which had the taste of being opened for more than a hour or two.\n\nMust Haves:\nSpinach Salad - baby leafs in a warm balsamic with caramelized onion and bacon. Egg and tomato round out for a light dinner selection. I love this salad, simple perfection.\n\nBistecca - Thick ribeye marinated in olive oil, garlic and rosemary grilled to rare bloody perfection. More meat than the average person can eat. Tender and delicious.\n\nPollo Griglia - garlicy good, nice balance of spice with tender breast which isn't overcooked and dry. Wonderful dish.\n\nThere is a reason why this restaurant still packs them in at dinner. Great food and service with ownership that cares about your experience.\n\nHighly recommended!", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-06", "description": "Awesome place for group wining and dining. They have an \"outside\" area that is still inside but in another section of the restaurant where they place large parties. You definitely miss out on some of the ambiance and a little of service but I felt they were attentive enough. The staff id a great job at waiting a party of close to 20. Food came out on time and delicious. Pizzas were thin and hot. Pastas were fresh and satisfying. Osso Bucco was braised with great love and attention. Very good traditional food and hospitality.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-25", "description": "Hard to find anything wrong with the dining experience here. The best part of the evening was the great service provided by our waiter. He gave us good advice on what to order. The wine list was extensive, a definite plus. My house salad was excellent, and the chicken was good, a tad dry but more than salvaged by the fresh tomatoes and other vegetables cooked to perfection and served alongside.\n\nI'd definitely come back ... helps that it's perfectly located right in my neighborhood.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-26", "description": "Had an AMAZING dinner here with my mother the night before she flew home. Found the restaurant on Yelp and decided to give I a try. We arrived late into dinner service, but we're warmly welcomed and attended to promptly.  Our server, Manuel MADE the night perfect and made us feel at home. We shared a carafe of wine after being given a couple of samples to help with our decision. Beef carpaccio was fabulous, with fresh and generous topping of parm-reggiano and capers. Homemade fresh pasta! To die for! Old fashioned technique made it exceptional! Black truffle cream sauce with mixed gourmet mushrooms... I still dream about this dish! Wonderful tiramisu and limoncello.  I can't wait to return! Again, a thanks to Manuel for giving us such a fun and enjoyable evening!\n   Sheri", "author": "Sheri S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-10", "description": "Maybe I didn't order the right thing but my experience here was...meh. I went with my family for my birthday, and it has a great location, but lame atmosphere.  The music was so quiet it almost felt awkward, and there are tacky fake flowers everywhere. Despite this I was still excited since it had a 4 star rating on Yelp and I LOVE me some Italian food.  Our service was great, and we were seated at a great booth table, so things were looking up.  We ordered a delicious bottle of wine--really great wine list. Our food came out very quickly--sausage with polenta, pasta, pork, and salmon.  My sister and I split the sausage and pasta, and neither was mind blowing. I was really disappointed in the pasta and the polenta was absolutely flavorless. My mom was actually a big fan of her pork, but my boyfriend thought the salmon was too fishy. The food wasn't necessarily bad, but it just was not what I expected for 4 stars! After dinner our waiter brought me a tiramisu with a candle, and the dessert was actually delicious!\n\nIn summary, the service, wine, and dessert were all amazing, 5 stars on that front, but the food was just a bit disappointing. I'd be willing to try Pane E Vino again, but might get a pizza next time.", "author": "Julia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-14", "description": "Pane E Vino is one of the few fine, classic neighborhood restaurants left in San Francisco. It's been a favorite of my family's for many years, because of the excellent food, the hospitable, professional service... there are not a lot of places with that sophistication.  It's a relaxing yet elegant restaurant that people who really know the city go to, but it isn't scene-y or self-conscious... so, it makes you feel like a native San Franciscan... albeit one on vacation in Italy!  There are waitstaff that have been there for decades, greet you like family and steer you to the best specials and treats. (A visiting friend who is a denizen of New York's best Italian restaurants was so impressed by our tone-perfect waiter --friendly and entertaining, yet thoroughly professional-- she always asks how she can steal him away to work in New York!) A cozy spot for a couple, but if you're with a few people, you get  to order multiple courses and share everything - from carpaccio to risotto to profiteroles, yum.", "author": "Megan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-10", "description": "I liked this restaurant better when it was Via Vie.  The food had a lot of flavor and everything was delicious.  Not so now.\n\nWhen Pane E Vino was on Fillmore, it was one of THE places to eat -- always a line, one had to have a reservation.  I went there for lunch recently and, not only was I disappointed in the food and service, so were my guests.  I ordered a spinach salad and eggplant parmesan.  They brought the eggplant first, while my guests were waiting for their food.  The food was brought out willy nilly -- not one of us were given our dishes at the same time.  One good thing: my salad was superb.  However, the eggplant was tasteless.  No flavor whatsoever.  I took 2 bites and brought the rest home so I could doctor it up.  One of my guests had puttensca.  She was really looking forward to it, but also took 2 bites and said it didn't have a lot of flavor.\n\nIt will be the last time I dine there.", "author": "Lois L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-15", "description": "I burped up this dinner for hours and even my burps tasted delicious.\n\nThe calamari was cooked perfectly and was accompanied by a tasty marinara sauce.\n\nMy saffron risotto with lamb shanks and porcini mushroom sauce was absolutely amazing.  I blame burping on this dish.  I kept eating it, even though I was stuffed and practically had to be rolled out of the restaurant.\n\nThe tiramisu was good.  Good = nothing is better than Tomasso's tiramisu IMHO....try me.\n\nService was excellent and I will be back, if I'm stuck in the Marina which I kinda loathe.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-27", "description": "Good food, unpretentious, cool patio with real grape vines (swear those grapes looked fake), reasonably priced.  Waiter encouraged us all to try something a little different and all were satisfied.", "author": "Grey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-13", "description": "Great authentic Italian food and friendly wait staff.", "author": "Melinda A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-11", "description": "We loved this little restaurant. The pasta dishes are fabulous! It could be the best pasta dish I have ever had. The wait staff is astute and charming. The atmosphere is casual, yet nice. This sounds funny, but the mint they give you with your check  is extra special tasting-I won't describe it so it will be a surprise. Go here for a tasty meal!", "author": "Karen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-15", "description": "This place would rate higher, but they don't have their liquor license yet.  What's up with that.  If you can't have a drink when you're eating your meal, why should you go somewhere?\n\nI thought the food was great, but considering the limited options for drinks this place isn't worth a repeat visit.  \n\nOwners - you need to fast track this filing.", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-07", "description": "Italianfabulous!!! Had an amazing pizza there last night. Arugala, mozarella, bresaola and parmeson cheese. Simply delicious!\n\nMy Italien friend from Rome had highly recommended this place, now I understand the hip about it. \n\nAlso had the carpaccio which did not disappoint. I can't wait to head back.", "author": "Nez B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-17", "description": "I really enjoyed this place. The staff welcomed us in with a smile and sat us down at a front table where we were able to do a little people watching. It's a comfortable setting with a slightly older crowd and many tables seems to be filled with families. \n\nThe wine list was well created and they had a few great bottles that were very reasonable in price. Their appetizers were great and everything was extremely fresh like they were picking veggies and herbs from a garden in the back of the restaurant. Our main courses were fantastic. Again, everything tasted incredibly fresh and what else would you expect from a good restaurant? A lot of us shared and I have to say there wasn't once plate that I didn't like.\n\nI would encourage everyone to try this place at least once.", "author": "Gabriel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-27", "description": "Great service, perfect Italiano food, nice atmosphere and wines.. Nothing less than five stars, cant get any better at this price level..", "author": "Michael P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-23", "description": "I'd rate this place 3.5. Food was allright but nothing super exciting.", "author": "Vladimir P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-03", "description": "I'm going to resort to my ol' standby method of rating: \n\n(+)\nParking was relatively easy, on a weekday afternoon\nPizza was reaaaly quite good... thin and crispy and the price was right\nFor a sit down place, I'd probably not go back, but for take out: sure thing.\nWe were a group of 4, and when we ordered our dessert, he threw in +1 w/o charge because the dessert came in sets of 3..... how sweet.. : ) \n\n(-)\nFancy pants ambience is right, as Arlene C says... it's not exactly what we were wanting (a group of gals out for a quiet evening out) so I'm debating as to whether it is fair for me to list this as a minus, but for me, it was a minus. \nPasta that I tasted was not that remarkable... or memorable for that matter...\n\n\nOverall: not a bad choice.. but probably a better place to take your parents or grandparents, not a place to celebrate with girlfriends!!", "author": "M'ia K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-17", "description": "3.5 Stars \n\nI think I enjoyed the service and people here more than I did the meal, although the food was definitely enjoyable. Our server was SO attentive and nice. While trying to figure out what kind of wine I was going to have with dinner, he offered me three glasses with very large \"tastes\" in them. Not only was it fun to sample the wine but I got entirely drunk on them alone! I just love it when a restaurant goes out of their way to make sure you're getting what you want. It's such a nice feeling to know that your money is being well spent. \n\nWe ordered the Eggplant Parm appetizer to start which was good. I won't go as far as to call it great because it wasn't cooked quite how I like it. I like eggplant when it melts in your mouth and this was a tad chewy. For our main course we split a pizza which was yummy. I would have liked to see the crust on the bottom a little crunchier. It got a little soggy in the cooking process. The dessert was the best part of the meal in my opinion. The profiteroles were fantastic little puffs of pure joy (ice cream and hot fudge). \n\nThe only bothersome part of the meal was this tiny black bug that kept circling our table. Every time I thought I had swatted it into oblivion, some how it found it's way back buzzing in my face. Grrrr....", "author": "Julia N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-18", "description": "You ever seen Big Night?  Primo, the uber-traditional (read: F.O.B.) Italian chef, refuses to give a customer spaghetti with meatballs because that's not how Italian food is meant to be prepared.  Last night at Pane e Vino, my friend ordered a halibut dish and asked whether the chef could substitute mushrooms for the tomatos in the sauce.  \n\nThe waiter  responded by saying that the sauce was already mixed.  Well that was sort of a bad sign...pre-made sauce?  Tell me, what size jar was it in?  But he said the chef would add mushrooms to the fish.\n\nThe halibut came out and, no joke, the mushrooms came in a dish on the side.  Why?  Because the chef felt they didn't go with the dish, and they actually took the time to put them in a separate plate.  Now, that is Nick Cannon HI-larious.  What part of \"service\" industry doesn't this place understand?\n\nTo his credit, the waiter was really polite about the whole thing -- it was clearly a chef issue.  But it was a little strange.  My pasta wasn't bad, although the plate of mixed vegetables on the side tasted like it had been microwaved.\n\nSo plus stars (1) it's inexpensive and (2) the prosciutto was excellent and the serving generous, and (3) nice decor.  But minus stars for an arrogant chef and, more importantly, a casual Italian restaurant should have more than four choices of red wine by the glass, especially when two of the four are chianti.", "author": "Geoff K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-19", "description": "I used to love this place -- not any more.  The service last night was abysmal.  They kept us waiting for almost 1/2 hour before taking our orders.  I asked to taste one of their wines and was told \"We don't do that\".  When I asked the host to recommend a wine he said \"No, you choose.  If I choose I know how that will go\".  The food was mediocre at best.  Tomato sauce tasted like it came from a jar.  Seafood and fish were not the freshest.   Pasta was very ordinary.\n\nSad to say -- we will not be returning.", "author": "Debbie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-20", "description": "Update: Went back last night, I'd highly recommend the caprese salad as a started, one of the freshest I've had in a long time. My friend and I split a pasta (the excellent fusilli) and then a pizza, which left us nearly over-stuffed, in a good way. This is the sort of Italian eatery every neighborhood should have, and indeed, outside of us, there seemed to be a preponderance of regulars, a nice sign on a Monday evening.\n\n----\n\nTried this Marina Italian eatery for the first time last night. It's very cozy inside, and you get the sense that the staff is all family. There are a lot of options to try, but I went with the homemade lasagna, which was excellent, and hopefully an indication of the rest of the menu (and why all the tables were full on a Sunday evening). Nothing fancy here, just good honest Italian cuisine, but that says a lot.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "Very good and in a great location on union. We had a pizza for an appetiZer, I had the spaghetti and meatballs and tried some of the other dishes but everything was very good. I thought the portion sizes were a little small (but we didn't do the full 6 course meal). I would order an insalata next time as well but other than that, it was a solid place.", "author": "Tami G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-02", "description": "I've walked by this place every day since I moved to the neighborhood last February. It's always busy during the evening, and I've noticed happy, laughing, satisfied-looking people coming out of there--never heard so much as a grumble. \n\nPersonally, I'd not been there, because I normally end up flying solo, and it's a white table cloth type of place. I always thought, well, maybe next time... \n\nA friend was up from So Cal a couple of months ago, and he was going to pick the restaurant. We walked all the way down the south side of Union from Gough to Fillmore, continued up Fillmore to Chestnut, did both sides, checking menus, etc, and all the way back on the north side of Union. The last place before we got back to \"go\" was Pane E Vino. He must've read 20 menus...he says \"This is it!\". \n\nSo, yeah, I got to try Pane E Vino finally. We ended up getting bruschetta, which is always good isn't it? And pizza \"Napoletana\" (tomato sauce, mozzarella, capers, anchovies and oregano)--very yummy. \n\nI haven't been back, but sometime I probably will. I'm avoiding Italian food for awhile--too many calories!", "author": "Java G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-20", "description": "Update (decreased review by 2 stars):  Came here last night for a large party.  I was disappointed to see the eggplant appetizer is prepared differently and just not as good.  I'm even more disappointed that the sommelier brought out the wrong bottle of wine, which ended up being $150 dollars/bottle, double the price of the bottle we ordered.  We didn't catch it until it was already opened.  While we probably should have checked the bottle (but, really, who does that), I've never had a restaurant so blatantly mess up on our order and then do nothing about it even when we mentioned the mistake.  It's unprofessional.     \n-----------------\nThe eggplant/smoked mozzarella appetizer is to die for!  This place is very consistent and has good pasta, pizza, etc.", "author": "Mitzi C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-17", "description": "How does this place have 4 stars?  This place is beyond mediocre.  Yeah, the staff is Italian.  Makes them look super legit, right?  NO.  My salad was an overdressed mess.  My pumpkin gnocchi with brown butter and sage came with a huge dollop of tomato sauce.  Know what doesn't go well with brown butter?  Tomato sauce.  The gnocchi themselves did not taste at all like pumpkin.  My boyfriend's pasta (with some kind of beef) was \"gamey\" and \"unpleasant.\"  We skipped dessert.  It's sad-I remember coming to this place years ago and liking it.  But i've now come 2 times in the last year or so and it is just beyond bad.  We live in a foodie-city.  You can do a lot, lot, lot better than this.  The service was also moving at a glacial pace.  Won't be giving it another \"last shot.\"", "author": "K H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-19", "description": "Maybe it's because they were closing in less than an hour. Maybe it's because I was wearing a hat and both E-Class and I rocked hoodies. Whatever the reason, Pane E Vino didn't seem very happy to have us.\n\nThe guy who seated us looked disappointed, and our waiter seemed annoyed when E was not ready to order two minutes after we arrived. He eventually seemed to warm up to us, but maybe that's because time heals all wounds - he ignored us from after our food was served until we were finished. I was THIRSTY.\n\nSo yeah, the service kinda blew. The food, on the other hand, was pretty darn good. I had my first cheeseless pizza, which was tasty but could have used, um, cheese. My bad. E had something with mushrooms and it was delicious. Weird, cuz I almost always pick the better dish whenever I go out to dinner with people. \n\nWe agreed afterward that we should have split one pizza - we would have saved some dough and possibly looked a little gay, which is always sweet.", "author": "Trey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-17", "description": "We recently had our wedding rehearsal dinner here, and if a restaurant can please both my picky Italian family, and me and my vegan husband, then it's a winner in my book.\n\nThey put us in their private room in the back, which was the perfect space for a big, casual dinner. They were very accommodating and took great care of us. It seemed like every time we turned around our glasses were being re-filled and there was new delicious food.\n\nI don't really hang out on Union Street much, and they only have a few veggie dishes, but definitely a great family restaurant and a good compromise when you find yourself with omnivores. The service is what sells it though.", "author": "Sharon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "With all the sub-par Italian restaurants on Union St, its easy to associate this one as part of the bunch. But from the past several times Ive eaten there, this restaurant stands out and gives North Beach a run for it's money.\n\nIm like Poppa Shanley and judge the quality of an Italian retaurant by the strength of their meat sauce. Pane E Vino has a damn good meat sauce!!! My go-to is the egg noodles with meat sauce. It leaves me with a full and happy belly. Raviolis are homemade and awesome, I love the one in the pink sauce. Pizza is fabulous too, so fabulous that when I took my dad here he ate his meal and polished off half my pizza as well. I have always been pleased by their service and they love locals. Great venue for dates and small group gatherings.", "author": "Heather S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-10", "description": "I almost don't want to write about this place, for fear the lines will get even worse.  It's a special day when I enjoy eating in the Marina.  Usually, I am most displeased by restaurants there and even more displeased at how many people seem to enjoy subpar food in the Marina.  This place is a marked exception: it is superb.  Their pasta is perfectly al dente, their pizza crust is thin and light, and their waitstaff throws in tasteful Italian here and there.  It's the best Italian that side of Russian Hill.\r\n\r\nUPDATE '06: subsequent visits have tempered my enthusiasm for Pane E Vino.  The pizza seems thicky and soggier.  What's up?", "author": "Pamela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-06", "description": "One of the girls I worked with recommended this restaurant to me and I took my husband here for his birthday. Customer service was phenomenal and the staff was so friendly! The food was delish and not too shabby on prices. If you're a fish lover, I recommend their bass. It's not on the menu on the website but it's on their physical menu at the restaurant. At the end of the night some of the staff brought out my husband a tiramisu cake and sang Happy Birthday in Italian! It was perfect with a great audience behind us. Service, food & prices I will give two thumbs up!", "author": "G P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-17", "description": "What's not to like? About a year ago I started going to this restaurant because it is close to my business and I could get in for a nice meal at the end of a busy day. You will always be greeted with a smile and the food is consistently of the freshest quality. Try the spinach salad. It's great, as are the pizzas. Locals fill up the seats, so try and get in early or make a reservation.", "author": "Roxanne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-26", "description": "Amazing thin crust pizza.  Try the siciliana with spicy sausage.  I am wishing I saved a slice for this morning.\n\nWarm spinanch salad and flattened chicken breast were also really good.  Some decent house wines and its really hard not to leave this place happy.", "author": "Brad C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "Pane e Vino has the most delicious pasta and risotto in the City.\n\nI particularly enjoy the fettucini bolognese or with mushrroms and truffles, the risotto with wild mushrooms and the gnocchi with green sauce or with fresh tomato sauce,\n\nBruno also does agreat Branzino witt garlic and fennel", "author": "Kath A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-07", "description": "We hadn't been to Pane e Vino in about 10 years, and I was skeptical about it since it had fallen off our radar.  We could not have had a better dining experience!  The food was delicious, the waiter was awesome, and the bill very reasonable.  They got the whole back room to sing Happy Birthday the b-day boy.  To think I had written this place off for all these years.  We'll definitely be going back!", "author": "Beth D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-26", "description": "Another neighborhood gem! I've been going to Pane e Vino for many years now and back when it was known as Via Vai.  The owners closed their other location further down on Union St and combined the two. This restaurant is definitely a place for solid Italian cuisine combined with an authentic serving staff. \n\nNow I've actually played the \"who has the best pizza in town\" game and upon visiting the classic favorites incl. Delfina and A16, I always come back to Pane e Vino for their authentic, Italian thin crust pizza. It, truly is the best you can find in SF. They've got about 15 difft pizzas to select from and it's hard to go wrong. I've had the margherita, sicilliana, and capricciosa and they're all winners. If you're looking for something really special - get the quattro formaggi and add prosciutto. The pizzas are a fairly good size so remember to share!\n\nMore favorites of mine include the housemade lasagna, ravioli, spinach salad, and the roasted chicken. If you don't know Italian reds too well, consider bringing your own ($20 corkage).\n\nWhether you're looking for a romantic date night, authentic Italian cuisine, casual dinner spot, or just some good take out - keep Pane e Vino in mind.", "author": "Josephine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-22", "description": "I liked this restaurant when it was located on Steiner street at the current Terzo location.  It had a cozy feel and lovely outdoor herb garden.  The pasta was really good, fish selection was nice, and the portions were not overly huge.  I have only been to the current location once but I am giving it four stars because I was incredibly impressed by their pizza.\n\nThis is a pizza like no other.  A16 gets rave reviews for their pizza, but personally I wasn't thrilled.  I once offered up my A16 pizza to a homeless man who turned it down.  What to think on this?  The pizza at Pane et Vino is different than any pizza I have had.  It has a generous amount of cheese, but not too much.  I ordered a pizza that had prociutto on it, and vegetables as well, and my vegetarian dining companion was able to eat the other half because they miraculously separated!  The cheese and prociuttto were fresh , the cheese melt in your mouth, and the crust perfectly thin.  I think this is the best pizza in the city!", "author": "apple r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-17", "description": "I've only been here once, but if the next time I go its anything like the first, 5 stars all the way!\n\nA regular at the BStop happens to be a chef here, so I thought, hey why not go visit Bruno and bring my parents and one of my dad's (British) colleagues along (who happens to have a holiday house on the Amalfi  Coast, ergo he knows Italian) and get a free meal outta the situation.  SHAMON.\n\nWe walk in and I immediately go over to say hi to Bruno, then take a seat and prepare myself for deliciousness.  Next thing I know we have some prosciutto ham on sticks or whatever it was coming our way and it was made by the Man just for us.  It was AMAZING.  If it were possible, my entire meal would be pig on a stick.\n\nThe rest of the meal was fab, and I walked out of there about 10 lbs heavier and high off good vibes.  The actual restaurant is a little tiny and can get crowded, but I didn't notice that much since my face was in my food all night long.  I don't know if it was expensive because, well, the parents paid.  Duh.  BTW, the Brit said the food was legit, so it must be authentic.", "author": "Erika C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-03", "description": "My first night in San Francisco (this would be about 3 years ago), I moved into a house on Scott and Union and a friend of mine who seems to know every great Italian place on earth said, \"there's a great Italian place near here, let's go.\"  Hey, when Babe Ruth wants to have a catch, you have a catch, know'm sayin'?  So there we went.  It was a Tuesday evening.\n\nWe ordered bruschetta and calamari, primi piattis and secundi piattis, and had a meal as good as any I've had in Florence or Rome, and with the same portions, which (in my experience) is almost impossible to come by.\n\nThe thing that really grabbed me, though, was this woman and her fourth grade daughter who were having dinner and doing homework at the bar, enjoying each other's company and living their lives in a sophisticated but low-key place that catered to their needs in a relaxed, professional way.  It's what makes Pane e Vino special, a high-class neighborhood joint serving terrific food and wine without being all uppity about it.  It's a snapshot of what I love about living in a city.  Who says you can't have it all?  Not Pane e Vino, that's for sure.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "well it was pretty good.  the service was great, which made up a bit for the food.  i'm not saying the food was bad - just not the italian i'm used to.  i have a feeling i'll be back again.\n\nps - if you get a table it the back, make sure you have a t shirt underneath you because it is hot.  i would have been comfortable in my underwear and a personal fan blowing on me but apparently you can't do that in public.", "author": "Hammer Time H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-10", "description": "We've really enjoyed Pane E Vino over the years (previously Via Vai) and still love the kitchen and dinners served. But I have to pull 2 stars off the rating currently on service. For the first time, my wife and I had pressure to turn over the table. The service staff took my salad plate before my wife finished hers. Bad tone on pressuring the other person at the table. Then brought the dinners before she was done. We had a bottle of wine and expected a normal leisurely dinner, but even the dinner plates were under pressure to be removed and we had to request the water glasses to be re-filled. It wasn't our normal Pane E Vino experience, so maybe it was a one off and we'll go back to 4-5 stars next time. Time will tell, but it will be hard to convince my wife to go back anytime soon.", "author": "Jon G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "Their bolonese sauce was very tasty, not the run of the mill type, their spinach and egg pasta was fresh and cooked perfectly. I will say that the dessert course was the kicker! We enjoyed the warm and golden ambiance, yet I think the noise level could have been louder than \"average.\" But this was a Friday night and one couldn't possibly expect a room full of Italians to be any less vocal :) All in all if you're in the area check this place out.", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-18", "description": "Hadn't been to Pane E Vino for over 15 years, since they were on Fillmore street.  Brought the kids and had a fabulous, authentic Italian meal.  Everything we had was well executed, from the minestrone soup to the housemade gnocchi.  I loved the atmosphere--all the waiters speaker Italian, and many of the customers speaking Italian.  Lots of regulars in the crowd.  The restaurant had a great, warm neighborhood feeling that was so nice to be a part of.  Very nice for families.  We were a party of 5 and had the circular booth, which was perfect.  A really good Italian meal in a city full of pretty lackluster Italian food.", "author": "Mae O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-15", "description": "I came here on Valentine's day with my boyfriend - we were just walking around looking for somewhere to drop in (with no particular place in mind, no reservations, dressed in jeans an hoodies)... we walked in, were greeted warmly by the host and ushered to our table on the back patio within 5 minutes.   ------ 5 minutes..... on Valentine's day...\n\nStar #1 - No wait - see above.\n\nStar #2 - Service was impeccable.  Our waiter was friendly and knew the menu well.  He was able to recommend wine and the best dishes, and was attentive to us even while it was very busy.  There's nothing worse than asking a server for recommendations and having them not know about the menu or not care about the people dining.  Oh, and our server was Italian, *bonus.  And... even though we were dressed very casual we weren't paid less attention to because of it.  \n\nStar #3 - The food and wine was really really good - we picked a Pinot Nero from Italy that was better than I was expecting for being one of the cheapest bottles on the menu - $38.  I'll be looking for it in stores.  The food was plentiful, flavorful, warm and delicious.  I had the basic salad which was better than expected - and the farfalle salmone (bow-tie)with sun-dried tomatoes and peas in a tomato cream sauce - b o m b.  It was rich and delicious and I was full before getting halfway through it.  I'm looking forward to eating it again tonight as left-overs.  He had prosciutto wrapped asparagus and a mushroom/chicken/cream sauce pasta that was also very good.  The asparagus was to die for.  \n\nStar #4 - The crowd was mellow, and of all ages.  I like going to restaurants where there are older couples, families, young couples on dates, and groups of friends.  There was a lot of variety, so I know it's a great place for any occasion.  The tables aren't too close to each other either - we were able to have a private conversation without thinking other people were listening or having to whisper.  It wasn't too loud, and the music was delightful - they played Pavarotti! I hate having to talk louder than normal to have a convo or be watchful of the people next to you hearing your every word.  The ambiance was perfect.\n\nWhy no 5th Star?  - The bus boys were a little clueless - I saw them delivering tea/coffee to the wrong tables, my doggie bag was given to someone else (before I hollered that it was mine) and one kid dropped a knife on our table.  Some might have been upset with it but we didn't mind - we're pretty easy going.  \n\nOverall, a great experience for a last minute decision on Valentine's Day.  I'm looking forward to the next time I dine at Pane e Vino.", "author": "Alice H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-16", "description": "This is one of my favorite italian restaurants because we really like the food and service.  We're pseudo-regulars and I tend to order the same thing every time I'm there.  Lame, I know, but holy boboli....the tagliatelle verdi alla bolognese is melt in your mouth goodness.  The pasta is Always so fresh.  I've ordered bolognese elsewhere but it never compares to pane e vino's.\n\nWe do occasionally order different things off the menu and the  lambchop special last night was AMAZING.  It's not on their regular menu so I hope it shows up as a nightly special again.  I'm not normally a big fan of lamb, but this was AMAZING.\n\nLots of good desserts too!  The eggless flan is a favorite.\n\nThere's usually not much waiting involved to get a table here, but on Friday and Saturday nights, it's always a good idea to make a reservation.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-13", "description": "THE BEST AUTHENTIC ITALIAN RESTAURANT IN SAN FRANCISCO!!\nMy boyfriend is Italian and he's very picky about Italian food. \nThe wait staff ALL have Italian accents and I can't pronounce the food on the menu because they are all in Italian. The waiters get a kick out of me trying to pronounce them! The food is fabulous, real authentic and a great selection of wine. Expect to pay about $25 per person (not including dessert). We've been here twice in one week! That should say a lot!", "author": "Dhoris P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-02", "description": "I love coming here with my bf and his family for dinner, its not fussy, the food is always consistent and good and the servers are all very nice. \n\nThe pizzas are delicious I think they are great for sharing as a starter, they always have excellent burrata and I like to get the osso bucco if they have it (its part of the specials). Other than that for the main course they do a great half roast chicken and you can never really go wrong with pasta.\n\nThis is a very decent choice for a low key yet nice italian experience I frequently have cravings for this place...the menu is pretty large and so are the daily specials so you will never be bored with only a few options.", "author": "Cristina F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-23", "description": "I went to this fabulous restaurant last night for the first time. I had a large group and they handled us with ease. All of the food was fantastic and I would highly recommend it to anyone. The employees have great hospitality. Great restaurant.", "author": "John D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-14", "description": "I've been to Pane E Vino multiple times and just had it for take out the other night.  It's good Italian food and a comfortable space.  Nothing fancy about the place or the food but is somewhere I would definitely eat again as it is reliable.  I would recommend the pizzas here.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-02", "description": "AMAZINGLY authentic Italian food selection. Wow. I want to go right now just thinking about their pasta dishes, mushroom and polenta appetizers and thin crust pizzas. Just go, and anything you get you'll be happy with- not one of those places where you can't find anything on the menu that looks good.  Friendly service and the waitstaff are very enthusiastic about the menu.  The calamari is also insanely tasty!", "author": "Christina V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-27", "description": "My favorite place on Union street!! My first time here I ordered the 4 cheese pizza and the truffle mushroom pasta and I was blown away.  I have tried some of their other dishes as well (gnocchi, etc.) but the truffle pasta and 4 cheese pizza are my favorite.  Note: I am biased because I LOVE truffles.  Amazing food and Italian elegance.", "author": "Nick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-16", "description": "Cappelini pomodoro was good! Garlic tasting because the oil has garlic in it, but you don't get garlic breath because the garlic is thrown out.  Perfect!  My coworker exclaimed, the veal ravioli changed my life.  Wow. I guess I should eat that next time.  Helen was digging the tiramisu.  \n\nAll around really easy going easy on wallet kind of pleasant dinner place.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-11", "description": "Loved it! Walked in without a reservation on a Saturday night with my mom and they sat us immediately. Great menu and the food we ordered was high quality. We each started with a salad, I ordered a pasta and my mom had salmon for entrees. Will definitely go back because the pizza's looked yummy!", "author": "Alyssa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-03", "description": "It was the perfect date place to take my girlfriend. The food was beautiful and tasty, and the waiters even say Italian stuff like \"Bon Apetit\" (or however you spell it).", "author": "Ben R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-28", "description": "I went on a date here a few days ago and had a really great time!  Good company yes, but the food was pretty good too.  I had a great pasta (on of the fettuccine dishes) and a chicken entree (which was huge).  I was too full for dessert, but will come back for their profiteroles which looked amazing.\r\n\r\nIt's a great place for a 1st date (romantic, but not over the top).  A very cozy little nook that I plan to visit again soon!", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-06", "description": "Update:  Revisited the trattoria over the weekend.  Finally tried their pizza.  Impecable.  Prosciutto, funghi, olives, artichokes, parmagiano regiano... Just how they do it in Toscana. Talk about major. Yeah, this is my trattoria. But you may visit as often as you want.\n\n------- \n\nHot damn, this is some down home great Italian food.  Pasta dishes are pretty damn tasty and hearty.  I had some pasta alla arrabiata with lobster.  Fuuuuuuuuuck... now that's good eatin'.   I'll be trying their pizze as soon as I can get back there, cuz they looked crack-tastic.  Even though prices are gonna be $15 -20 per plate, you get some good food in return.", "author": "Zo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-12", "description": "My 4th visit to Pane E Vino over a 10 year span. Have had wonderful food every time and great service 3/4 times (the other time was fine, just not great). Last night was there with a party of 4 and we had a fantastic waiter who was attentive, helpful and downright charming. Always sets the stage for a great meal. We were all starving as we were eating a little late and the waiter quickly brought us a basket of warm bread and plate of olive oil; delicious and we just devoured it. We had a range of dishes from a pizza to 2 pastas and one secondi (chicken). Everyone loved their choices and the whole dining experience.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-17", "description": "We liked it very much. This is a local restaurant to go with your family. We had a Prosciutto Cotto e Funghi pizza and a Tiramissu for the desert. Wonderful taste,  good price and good ambience. It was Saturday 8:30 PM we had no reservation. there was no need to wait. I definitely recommend.", "author": "Flavio G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-10", "description": "A gf from out of town and I wanted a nice place to relax, stuff our face with pasta, and get a wine buzz. I picked Italian because sometimes my fellow Virginians aren't quite ready for the diversity of SF cuisine.\n\nI made a reservation with Pane E Vino, and we were seated promptly. We inhaled the bread they gave us and then chowed down on our pasta. I got the seafood linguine and it was fabulous. My friend got the fettuccine and it was like eating butter, in a good way. \n\nAnd because when in an Italian restaurant, order the Tiramisu; we did and it was so delicious. I will def. come back here again!", "author": "Chrissy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-16", "description": "We have visited Pane e Vino nearly every time we come to San Francisco for the past 15 years.  This time we were sorely disappointed.  The service was terrible and the food was worse... nothing Italian about it.  The presentation was totally unattractive and I have tasted better in a TV dinner.  My daughter's dish had frozen peas and carrots... nothing fresh, and my sugo tasted like reconstituted hamburger with sauce from a can.  Utterly disgusting.  We will not be back.", "author": "Mary J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-20", "description": "I love Pane e Vino with a passion. My European friend came into town wanting some authentic delicious meals so I knew Pane would be the perfect place. Why does it rock my food loving face...\n1) I go here for dinner no less than 3 times a month. You never have to wait for a table.\n2) Great wine list, and honest wine recommendations\n3) Our Italian speaking waiter surprised us (after the bill), with a tasty (free!) creme caramel custard.\n4) The pizzas are crispy big and perfect for splitting. \n5) The daily risottos melt in your mouth.\nIf my Euro friend approves then you know its good. Only down side is now I'm so full from pigging out they had to roll me home.", "author": "Jamie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-05", "description": "It was crowded, but we were seated promptly. Service was quick and efficient, water glass was always full, staff was helpful and knowledgeable.\n\nWe got an antipasto appetizer to share--a random assortment of vegetables like eggplant and cappellini onions, as well as slices of deli meat, including one that was prosciutto wrapped around a thin breadstick--a meat-flavored pocky, if you will. Good plate to share with friends and family.\n\nI ordered sausages with grilled polenta and bell peppers. The grilled polenta was awesome, but the sausages were a little too salty for my taste, but otherwise excellent.\n\nI didn't order wine, but they seemed to have an expansive list. I got an Italian beer instead, which was pretty good too.\n\nOverall awesome Italian place.", "author": "Josh C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-06", "description": "We had an excellent meal here on Sunday.  My parents were in from out of town, and it was a nice time.  The ambiance is perfect for taking out of town guests for an uncomplicated meal with good food and a nice ambiance for having a conversation (without too much noise).\n\nThe chopped salad and pizzas were excellent -- as was the tiramisu.  The pastas were good, but not as tasty as the other things we had ordered.  The prices were reasonable, and the meal wasn't a big \"production.\"\n\nAll-in-all, a nice place to go for dinner on Union Street.", "author": "Kimberly G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-02", "description": "If I could give it zero stars I would. I can't understand how this place has received so many four or five star reviews. I think there's something going on behind the scenes to game the system. The food here is horrible! The best tasting thing that we ate was the bread! Everything we ate here was not worth it. My husband said it would have been better had we gone to some chain restaurant like the Olive Garden. I had the Clams and Linguine and it was so tasteless and bland. When we tried to complain to the waiter, he suggested that it was because we had added parmesan cheese to our dish, which made no sense whatsoever. Service wasn't much better than the awful food. We left there feeling taken advantage of. Wasted our money and time and made our evening feel blech!  I was remarking to my husband that if this had been our first date, we might not be together still. BEWARE! It can ruin your evening!", "author": "Jade C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-18", "description": "We walked in early on a Saturday night and were greeted and seated right away.  Excellent meal, excellent service!  The owner/manager spent some time chatting with us and we felt like we made some new friends!  Would definitely go back.", "author": "Mary W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "This is a great Italian place with a good atmosphere. I come here quite often and always like what I get. Last time we shared the pizza appetizer and some bruschetta. Then I had the veal scaloppine and shared the Lobster risotto. There must have been half a lobster in pieces in there - it was great.\nService is good too.", "author": "Conny F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-11", "description": "I have been here twice. The first time was a date with a girlfriend and I had just moved to town and she was visiting and we didn't know anything. So this place looked good. \nI honestly can't remember what I had, because this place isn't going to remind you of that quintessential meal you had on the coast of italy, but it is good italian food, prepared well and tasty. \nThe service it quite good, i felt like my waiter must have been working there forever he knew it so well and was quite good. \nand it isn't a very loud place, so you can have a nice conversation. basically, if you are looking for an easy casual dining experience that happens to be with italian food, this place fits the bill.", "author": "Rich B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-01", "description": "Pane E Vino was pretty good.\n\nThe food was excellent.  I had raviolli with spinich and ricotta filling, with sage butter and tomato sauce.  The raviolli was tender and delicious.\n\nThe service could have been a lot better.  I made a reservation for 7pm for a party of 5.  We got their right on time at 7pm.  They didn't have a table ready for us, so we had to wait  a few minutes.  It wasn't long, and I would have forgiven them, until they led us to our table, which was basically a normal square table for four with a small round table for two put next to it.  It wasn't _that_ big a deal, but a mild annoyance.\n\nStill, the good food trumped any frustrating service so I still gave them 4 stars.  Yum.", "author": "Joshua E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-21", "description": "3+\nThe food was good. I liked sitting at the patio in the back on a warm summer evening. It was a big party, maybe 12 people and everything went fine, except for two things: I insulted the gay guy at the other end of the table. (I said he looked like the guy from West Wing. You know, the old guy? He died a while back?) \n\nSecondly, we brought a bottle of white wine and asked the staff to put it in the fridge. They (and we) forgot to have it served. The next day my honey and I went to pick up the wine and picnic in the park. 'Yes, we have it. Here you go.' \n\nI was shocked! Shocked! It wasn't even chilled!", "author": "Michael R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-23", "description": "I had my birthday dinner here and I'm glad I did, because my whole party and I were all very satisfied with our experience.  \n\nThe pasta was authentic and very flavorful.  The staff was super friendly and for a second it felt like we were family! haha!  The ambience was a lot better than most of the typical Italian restos you'd find in North Beach.", "author": "Candice M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-22", "description": "I took my husband to Pan E Vino on Father's Day and it was very disappointing. The \"B-Team\" was working that day and it looked like the owners had taken the day off. The waiter who greeted us was unfriendly. We made reservations in advance but our table selections were near the open door,  near the bus station or near the table set-up for a party of 10. He gave us our pick in the worst locations. A same size family came in afterwards and they were allowed to sit in a booth. They loaded our small table with water glasses, sugar and carafes etc. so it was very difficult to place down any food dishes. I kept having to ask the busboy to clear the dishes.\n\nMy husband and I ate linguine with clams and mussels. The first mussel I ate was under cooked, the second one I ate had a shell in it. So I stopped eating the seafood and ate only the pasta. Later in the evening my husband and I both got sick.\n\nThis has been a place where my husband likes to eat. But, I have taken this restaurant off our list of choices. My favorite Italian restaurant is North Beach Restaurant. They have valet parking, they are always open, you can walk in and get a nice  table, the waiters are helpful and friendly, the table size and space around the table is comfortable. The food is always great any day of the week.\n\nIf you live in Cow Hollow and are regulars perhaps you will be treated better. And if you dine while the owners are on the premises the food preparation may be cleaner.", "author": "Maria E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-12", "description": "Excellent food and excellent service - what more could you want?\n\nVeal Chop - superb!  Calzone - enough for two but I ate every bite myself.\n\nThe spinach salad was delicioso with plenty of bacon bits - and anything with egg gets my vote.\n\nAnother plus - it's quiet! Wow - what a concept when almost every restaurant is so loud you can't have a conversation.\n\nA great date restaurant.", "author": "Glen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-04", "description": "Favorite Italian restaurant in the city.\r\n\r\nExcellent homemade bolognese pasta.  \r\n\r\nFriendly wait-staff, and I never have to wait.", "author": "Jacob J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-14", "description": "After eating at Pane E Vino (formerly Via Vai) at least 30 times with my buddies, I am finally writing a review. Well, I have been there 30 times...do you think I like it? All kidding aside, there are three great reasons to come here.\n\n1. Staff - They are always cordial to anyone, and more importantly, everyone. You are greeted at the small entry way (with just enough standing room for 6 people) by one of the 3 fantastic hosts there. They make sure you are comfortable and don't have to wait long. On 3 separate occassions, they have allowed us to sit at the bar with a complimentary appetizer to help with the apparently long wait ahead. Once seated, service is friendly, and low pressure while still being attentive. The wait staff (if busy) clearly works together to pick up slack if need be. This makes it better for us, the customer.\n\n2. The Restaurant - It is never too loud, but never too quiet. Large groups can feel as much at home as a few good friends or a couple. The lighting in the restaurant is romantic, but not dim. The aroma of the wood burning ovens is nice, and the seating is fairly comfortable. Even out in the back patio.\n\n3. THE PIZZA - I have heard so many of these New Yorkers talking about our pizza this, our pizza that...blah blah. I'll give it to them, their East Coast pizza is better than our East Coast pizza. BUT THIS IS NOT EAST COAST PIZZA. This is BETTER pizza inspired from countryside villas in ITALY. The crust is crisp and very thin. the sauce is not smothered on like  finger paint, but put on lightly, the ingredients are not Pepperoni and cheese, but Prosciutto, wonderful mushrooms, basil goat cheese, etc. The temperature is always perfect, and it always has that smokey flavor that it should have.\n\nOverall, the appetizers are good, the entree's are good, but the pizza and service are great! Oh and by the way, their wine list is pretty extensive. Prices are definately fair.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-08", "description": "Caresse was a little tough (both tomatoes and mozzarella)\n\nEggplant was super cheesy which we liked\n\nThin crust pizza was delicious (artichoke, mozzarella, prosciutto) \n\nAmbiance was authentic Italian...better than corny NBeach shops.", "author": "Jon D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "Another great meal.  This place always delivers great meals and service.  They always seem to be able to accommodate last minute resos even for large parties.", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-27", "description": "Soooo OK I went to this place for dinner. The food, the service, Amazing... The only thing was, I was on the worst date of my life when I came here and I was waiting... waiting... waiting for the check and it took a while... I think cause the guy was talking to me the whole time, while I was bored & thinking about how I was on the worst date ever, the waiters took it as a sign that we were not ready... We were ready... Great place to go to for dinner, I highly recommend it... Just went there with a horrible date... haha", "author": "S. B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-04", "description": "Met two friends here for dinner on election night so it was particularly empty.  The owner/manager was quite friendly and sat us right away.  Our waiter was energetic and knowledgeable.  The wine list was solid and reasonably priced but not outstanding.  I had the Italian sausage on polenta with cooked vegetables.  Nicely executed.  I also had berries with zabaglione sauce.  The berries were fresh but the sauce was a little excessive.  (Should I have expected something different?)\n\nOverall good but not great especially for the price.", "author": "Matthew O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-22", "description": "Love Love Love!! Best Italian food in the city. We just opened a salon across the street (Studio Mod Vellum) and went in there a few times while taking a break from getting set up. The service was excellent, food was delicious, and the owner  welcomed us to the neighborhood with a piece of tiramisu. Cake is one of my favorite foods (along with bacon, which is really sad because I'm a vegetarian) so they are my new bff!", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-30", "description": "Well, this is a restaurant I have been going to for years and this last visit on May 20th proved to be underwhelming indeed. I will not go back. Oh well, perhaps it was an off night.", "author": "Lori D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "Went here with my parents after just moving into the neighborhood and found it an excellent place for dinner. Pretty busy on a wednesday night (not full but enough people to feel like you're not dining alone. The food was great, we all had pasta dishes, the capellini pomodoro was especially good with fresh tomatoes and garlic. Our service was great, had a couple different waiters but both were very accommodating and friendly. Overall I'll definitely be going back!", "author": "Kara G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-14", "description": "To be a yelper is to be willing to make the ultimate sacrifice - sharing a treasured restaurant with others while hoping word-of-mouth won't make it so popular that you can never easily get a table again. So I'll tell you about this gem, but only if you promise to keep it just between us, OK? Now consolidated with Via Vai, Pane e Vino serves regional Italian-style cuisine, featuring simply grilled fresh fish and meats, thin-crusted pizzas, and exceptional pasta dishes, all of it extremely flavorful. Despite the name, man cannot live by bread and wine alone, so start out with the spinach salad, the crisp leaves tossed with warm pancetta and eggs in a balsamic vinger-olive oil dressing. Move on to farfalle (bowtie pasta) with smoked salmon, firm peas, and sun-dried tomatoes in a rich cream sauce. Then dig into a rosemary-scented rib-eye steak with a side of Tuscan beans. End it all with any one of the following - a caramelized apple served with sour cream and almond sauce, profiteroles filled with white chocolate gelato and topped with hot chocolate sauce, or a heavenly tiramisu. Considering the upscale Cow Hollow location and the quality of the food, prices are shockingly low - pastas are $12 and $13, entrees run between $15 and $25, pizzas from $10 to $13, and most desserts are $6. Service is impeccable, and regulars are treated like family (albeit one that still must pay the bill). So go. But remember . . . don't tell another soul.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-07", "description": "Yummy!  Appetizers, Entrees and Desserts all delicious.  Crowded most nights, but not super loud.  Affordable and filling.  Best part for us is that it's right around the corner from our apartment.  Definitely worth the visit to this Italian restaurant.  The wait staff is very friendly and efficient.  Pasta is good, but looking forward to tasting the pizza on my next visit!", "author": "Anjali K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-13", "description": "Delicious pizza - paper-thin crust, not greasy...just so good. We went there last night with friends, and were sort of in a rush and the staff was extremely accommodating, friendly and helpful.", "author": "Kate T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-17", "description": "More like 3.5 stars, but I can't quite muster up a 4th...The food is very fresh and the pizzas are delicious. It's a great rainy Sunday night spot when all you feel like doing is making the commitment to a carb induced coma and going home to watch American Idol on Tivo. The crowd was a bit too old for my taste and I felt a bit out of place surrounded by all of the large,  boisterous families. However, the food was quite good and I would like to give it another shot, perhaps when the 'rents are in town.", "author": "Kristen D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-27", "description": "ode to gluttony.\n\nmy friends had their engagement party here so we had the back room.  the best part though was that we got to try out so many things on the menu since we were a big group.\n\nthe bruschettas were good, the mozzarella alla caprese were so fresh, the carpaccio was tasty, as well as the calamari.   the pasta was only ok, nothing special - rigatoni and fettucine but maybe they were the democratic choices for entrees...same can be said for the pizzas - there were a few choices which were all good - thinner crust and not oily.\n\nthe engaged couple brought in their own bottles of wines since he is a big wine guy so i can not attest to their wine selection.  over all, i'd probably rate it average but since it was our friends, we had a great time.", "author": "Anh V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-03", "description": "I came here for the first time well over a year ago on a second date.  My first visit was awesome.  (My date would probably tell you that our dining experience was great because of her.)  Everything was excellent from the eggplant appetizer to the pasta to the wine to the dessert.  I think the only reason I got a third date out of the lovely lass sitting across from me was because of our meal.  (God knows it wasn't because of my scintillating witticism and bon mots.)  Our experience was so great that we eventually returned for a group dinner about a year ago.  Talk about a total 180.  Bad service, sub par food, and a total ripoff job on our wine selection.  We chose one bottle, and they did a bait and switch with another.  This resulted in a $150 bottle of grape juice landing on the table.  Bad form.  This experience so soured the lovely lass mentioned above that we did not return until last week.\n\nHaving just returned from my annual Christmas sojourn in Jersey, I was missing Momma's cooking, so I wanted some Italian grub.  Somehow, someway, we ended up in Pane E Vino.  This would be the rubber match.  I was rooting for Pane E Vino to redeem itself.  The lovely lass had it in for the place.  Things started off badly for Pane E Vino when we got there.  The hostess was completely incompetent.  We did not have a reservation, so she was totally befuddled.  She said that she had several groups coming in later with reservations.  Several means three.  I saw four open tables.  I then looked into the reservation book and saw two reservations coming up in the next half hour.  You could see the smoke coming from the hostess's ears over the complexity of this higher math.  She told us to go sit at the bar and have a drink.  We did.  Problem.  It's not a real bar.  And no one asked us if we wanted anything.  \n\nJust as I was about to lose it, our waiter from our very first visit walked by.  If you go, ask for him.  He's the dude with the shaved head and the shirt two sizes too small.  (I have heard that chicks dig this look.)  He immediately began apologizing for the delay, pointed out a table being prepped for us, and told us that it would be ready in a minute or two.  Message  to the owners: fire the incompetent arithmetically challenged wench who was working on Sunday December 30th and give shaved head guy a raise.\n\nFrom there things were fine.  Our waiter was about 12 years old, but he knew the menu and answered all of our questions.  We ordered a roasted eggplant antipasto that was a special.  It was delicious.  I then had the ravioli special.  It was superb.  It came in a sage butter sauce that was interspersed with a chunky marinara.  This may not sound very good, but believe it was.  Two great tastes that tasted great together.  The lovely lass had the fettuccine with porcini mushrooms.  Also excellent.  The portions were perfect.  We were satiated, but did not roll out the door.  The bill was a little higher than I expected, but we got jacked on 2 glasses of mediocre Sicilian wine.  (Aren't mediocre and Sicilian redundant?  Or is it criminal and Sicilian that are redundant?  I can never get those two straight.)\n\nCongratulations Pane E Vino, you won the rubber match.", "author": "Chris I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-17", "description": "Great neighborhood Italian in Cow Hollow! This place is consistent, has everything you could want on the menu and doesn't break the bank either. Last week I had the chicken but normally I get the sausage pizza. Both are very good as are the pasta dishes. Also, the owners are Italian, the chef is Italian and most of the wait staff are as well. I always feel that adds to the experience when the staff of an ethnic restaurant are of that ethnicity! At first I gave Pane e Vino five stars but when I looked at the rating of \"Woohoo, as good as it gets!\" I had to bump it down to four. Yes, I am a fan of this place but I can't say it's as good as it gets. Great place for a quick mid week dinner!", "author": "Jim M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-01", "description": "After the glorious ratings here, I thought I should give this place a try... Well, it's mediocre. I had their Antipasto Della Casa - the cured meats were fresh and tasty, but the house-marinated vegetables were so so. And then I tried their Pizza Margherita (really, the first thing one should try in an Italian restaurant). Well, I've had much, much better - and I've spent a month traveling in Italy. Service was attentive and atmosphere is pleasant. But for a much better food go to Capannina!", "author": "Margarita B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-17", "description": "i know it's going to be a good evening when i can find parking right outside a restaurant when i'm on union st.  i came here on fri night w/ wakako and our other friend, and it was so much fun!  we originally made a reservation for 2 ppl, but our friend decided to join us at the last minute, and we were still seated right away.\n\nwe started w/ a half carafe of the house red, and bread was brought to the table right away.  we started off w/ the caprese salad and the spinach salad.  we then shared the capellini al pomodoro, the capricciosa pizza, and a ravioli special, which i didn't try.  i loved the capellini, b/c it was simple w/ lots of fresh tomatoes.  we were originally not going to order this, but we saw the ppl next to us eating it and they highly recommended it!  the pizza was good too, but since there were a ton of toppings on it, it became a bit soggier than i had hoped.\n\nfor dessert, we shared the apple streudel and tiramisu.  like wakako said, i ate like 3/4 of the tiramisu myself b/c it was so good.  overall the experience was pleasant, as we got to sit in the back patio and chitchat w/ our neighbors.  service was excellent as well.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-14", "description": "This is a good solid Italian place. I think it's better than Capannina and more consistent. The ravioli are good so are the gnocchi.  I would give them 3.5 stars.", "author": "T O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-21", "description": "Have been there several times in the past months. Love the service, the ambiance and the food. Recommend soft jazz for music instead of pop", "author": "Barbara H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-21", "description": "Pane E Vino was finally picked after an hour of searching for a place to eat, and I'm happy we spent the extra time to find this wonderful Italian neighborhood restaurant. The food is comforting and cooked with an attention to detail and a concern for authenticity. I was in Tuscany in the end of May and I could have been fooled this evening. We shared  the caprese salad, the fusili pasta dish and finally a mushroom pizza. All were satisfying and made me wish that Pane was down the street from my house. Every neighborhood needs a great reasonably priced family style Italian joint. For a Monday this place was close to capacity, I think we got the last seats, so get here a little early or be ready to wait on a busy night.  It's worth the wait.", "author": "Phil M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-11", "description": "this place should be called pane e pazzo hostess. \n\nIt pains me to write this as I have had some good experiences here, but last nite's mishap is enough to scare me away for good. It's Sunday and I decide i want some good neighborhood italian, I call at 4pm and get reservations for 7:30 for a party of 4 no problem. Or at least that's what the hostess says...\n\ncut to 7:30, I walk in and was ignored by the hostess for a good five minutes, she's dealing with another party of 4, they seemed angry, she seems stressed. She then walks away for 10 minutes, still hasn't said anything to me, by now it's obvious she's avoiding the hostess area. Other people have walked in too, she looks over every now and again and just takes us all in, as we collectively are all annoyed. Finally she walks over and I have to say (to the side of her head), \"excuse me, I am here for my 7:30 reservations.\" She goes, \"what?!\"  This is the lady I talked to 3 hours previous who took the reservation (I can distinguish her voice), and obviously did not write it down. she just goes, \"well it's crazy tonite\", and walks away FOR ANOTHER 10 MINUTES. \n\nNow my party is annoyed as well, finally when she comes back after avoiding us all again, we just ask when we can be seated, at this point we still want to eat at the restaurant and want the simple kindness of being told when we can eat, which 25 minutes into it she has not told us or even hinted that she can tell us. She YELLS back at us, \"LOOK IT'S CRAZY TONITE HERE AND I AM ALONE, JUST GIVE ME ONE MINUTE...GIVE ME ONE MINUTE!!!\" she obviously had a breakdown, and was screaming excuses to us in a very aggressive manner. All she had to say was, i'm very sorry, here is the situation...we can seat you in x minutes, we will do everything we can. \n\nWe walked out and went to Luisa's and had a great dinner with AMAZING service. i'm glad it worked out because our party of 4 involved my boyfriends parents and who wants to have a bad experience with the 'rents?! \n\nin my opinion this place has gotten too popular for it's own good, the food is good, but there are other italian options nearby with the same caliber food.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-14", "description": "I like the pastas here, especially the Risotto and the Farfalle w/smoked Salmon. It can get pretty expensive if you order the Antipasti and desert too. Go for the fancy pants ambience. If you want to go easy on the wallet go to any of several other good Italian restaurants.", "author": "Arlene C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-04-06", "description": "How is this place getting good reviews?  It's just so overpriced for bland, boring Italian food.  It seems that when it changed locations, it lost its flavor.  Then again, it's just like most (but not all) of the restaurants on Union Street -- not so good.  I guess that when you have a lot of foot traffic you can afford to be mediocre at best.", "author": "marie m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-17", "description": "Well, though I hate to write a not-so-perfect review, I feel I need to with this place. \n\nFirst time we went, about 6 months ago, was with someone who was a SF icon, as well as well known by the owner of this restaurant.  We had a fantastic time, treated with great service, great GREAT food, and just a positive experience.\n\nLast weekend we went again, alone, just the 2 of us.  We felt rushed, the food was good but nothing overly special, and the service was just ok.  We had a lengthy wait for things we asked for (bread, oils, wine, etc.) but never got the feeling like we did the first time we were there.  It made us think that because we had been with someone important, that we were treated that way.  And, when we went ....  just us, it was different.  A little disappointing as the first impression was so amazing.  The last impression wasn't the same, and therefore, we'll probably not rush to go back!", "author": "J L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-30", "description": "had the whole fish there.  It was nice and fresh, tasty sauce, good service.  I give it a solid 3; however, i thought the price/performance was a bit lacking... good back up choice when the other places fill up.", "author": "andrew t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-08", "description": "The pizza here is freaking amazing.  True thin crust with the freshest toppings.  The portions here are not gigantic like my stomach but they aren't skimpy either.  The eggplant parmigiana antipasta dish is probably the best eggplant parmigiana ive ever eaten.  Fattys like me love parmigiana because lots of cheese and sauce really makes the belly grow.  Not only is the food here amazing, but the other diners are my heroes as well.  Sitting next to people talking about how much money they have is freaking awesome.  I wish they would give some to fill my fat ass.  The highlight of the night was a 30 year old asian lady coming in on a date with a 70 year old, balding caucasian male.  I am pretty sure she was either a mail order bride or into his good looks.  I have big titties!  Who wants to take me out to dinner?", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-30", "description": "Consistent, cozy Italian fare.  Delicious wood-fired pizzas.  Friendly staff.  Since consolidating what was once two separate venues (Via Vie and Pane E Vino) into the old Via Vie space, something has been lost from the atmosphere.", "author": "Amme P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-01", "description": "Ok i hadnt been to the new location for this restaurant. My summary: this place is awesome! I moved here from nyc a long time ago and still havent found anything resembling nyc italian in this city. Last night's meal changed my mind.  The prosciutto/mushroom pizza is insane. I will be ordering that as take out. The crust is thin and the taste is superb. My mouth is watering just thinking about it. I also ordered the spinach/ricotta ravioli with marinara sauce and it was equally impressive. My friends had the duck said it was \"good\"; the lasagna was \"good\" and the flat noodle with meat sauce was \"ok\". I guess i was the best orderer in the group! I will be back again and again..you will recognize me as the guy in the corner who looks pregnant.", "author": "Not M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-31", "description": "I actually wish more out of towners would write bad reviews so us locals could have the place to ourselves! Not much to say here except it's our favorite restaurant in our neighborhood. Incredible service...the staff has become friends of ours over the years. Great wine by the glass/carafe list, and the pizza is perfect. Great salads too. Pasta selection is extensive as well. We've had private events for 25+ people in the back room...overall a great value and ambiance.", "author": "jeff l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-27", "description": "Popped in last night starving after working out  so I was very pleased when my dinner companions decided upon family style and we ordered like crazy. The highlight was the special whole fish, it was done perfectly. Although the sides of 3 new potatoes and veggies were blah. \nOther highlights included the fresh fettuccine with chicken & mushrooms, the risotto and the ravioli. All that and a great bottle wine. I'm glad to see they are still top notch.", "author": "Cbr A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-19", "description": "I really enjoyed coming here. We made a reservation on a Friday at 7pm. We were greeted and seated by a friendly hostess and then greeted by an even friendlier waiter with a very obvious Italian accent. To start we ordered the ANTIPASTO DELLA CASA which was a assortment of cured meats and vegetables. It was good it had a variety of different flavors and spices. For our first course we had the pumpkin gnocchi and it was incredible. My boyfriend ordered the veal shank osso bucco served on risotto. The veal literally melted in your mouth and the risotto was perfectly cooked. I had the chicken breast topped with tomatoes and garlic. The flavor was great but the chicken was a little dry. I would love to go back and try something else.", "author": "Melanie V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-26", "description": "pane and vino is a neighborhood jewel . It has the freshest most wonderful pastas and salads ! It is warm and gracious and fun! It is a great experience and one can not  express how true and fine it is!", "author": "Claribel j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-21", "description": "Went on a Sunday night and was lucky to get a table at 7PM... this place is a local institution.  The key word is pasta and you have lots of choices here, the mushroom ravioli was delicious.  A great casual date night place or just hanging out with old friends.", "author": "Annabel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-01", "description": "You might think I'm biased b/c I live literally across the street ... but I used to trek all the way down the hill from Pacific Heights before I lived on Union Street.  Hands down my favorite Italian place.  I've gone here for birthdays, dates, going away parties, and even called for take-away.  The waiters are friendly, courteous, and helpful.  The food is good . . . I have too many favorites to list.  YUMMM!  I'm getting hungry for pasta just thinking about it.  Excellent pizzas too!", "author": "kristen h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-19", "description": "I used to love this place and went every week for years.  After they consolidated restaurants and closed the Steiner location, things have not been the same.  Still a great place for an intimate meal, and the dishes are solid.  Most of the specials are good, the pizzas crispy and tasty, and pasta here is fresh.  I think the wait staff is a bit pretentious, which was balanced because the maitradi was great and friendly.  He left, and now you have some snots seating you too.", "author": "Kapeli M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-22", "description": "Incredible food, incredible service, incredible ambiance.\n\nI agree with the reviewers who weren't sure whether to divulge how great Pane e Vino is.  \n\nThe Puttanesca is delicious and full of flavor.   The gnocci is done comfort food style, and the Pizza is a wonderful indulgence.\n\nFor two, I recommend splitting a pasta dish and a pizza and trying a few glasses of wine.  My favorite pizza is the one with arugula and prosciutto (be sure to pronounce it \"pra-SHOOT\").\n\nThe desserts are delicious, my favorite is the cheesecake.  It's not to sweet and is among the best I've tried.\n\nPane e Vino will make you feel like family.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-07", "description": "Went there with a group of 8 and were seated promptly in the atrium in the back; a very pleasant setting. We shared appetizers including the veggie pizza and mixed green salad. The pizza was good with fresh eggplant and bell peppers. The salad was drenched in oil. For the price of the salad ($8 or $9), I expected either fancier greens or larger quantity. For my main course, I had the fusilli con melazane with smoked mozzarella which was on the bland side. It would've been better with less pasta, more eggplant and cheese, more garlic, and a bit more salt. For dessert, I had the flourless chocolate cake which I found dry. Service was friendly and came by frequently to check up on us. Overall it's about 3 to 3.5 stars.", "author": "Veggie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-20", "description": "Terrible.  The food was nothing thrilling and we waited forever for our meals.  To be honest it tasted like chain food.   Go elsewhere on Union as this is nothing to write home about and skipping it all together would not be a big deal.", "author": "Nicole F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-06", "description": "(4) I love this place.  i met friends here the other night and had a fantastic meal.  i NEVER go to italian food because i misguidedly think it's all the same.  I had the homemade sausage with pancetta and peppers and it was off the hizzy.  even the bread and olive oil was ridiculous.  we had a couple great desserts, too.  \n\nEverything is fresh and homemade, the staff is authentically interested in your experience and the whole scene is friendly and fun.\n\nWe went early, like 630, and were sat right away, though it got packed really quickly on a Friday.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-05", "description": "We have had some nice meals here but the manager was extremely rude to us on our last visit.  We confirmed a reservation with the owner earlier in the day...excited to be bringing our friends to our neighborhood place, and he could not have been nicer.  People without reservations were being seated before us...tourists reviewing the menu outside...leaving no table for us except the drafty one right next to the door.  That was not great ,but the yelling from the manager in response was anything but acceptable. We plan to speak to the owner soon.", "author": "carrie m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-31", "description": "I agree with whomever said that this is a restaurant you go to if you're within walking distance.  Not work hiking around the city for, but very good if you happen to live by.", "author": "Lindsay T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-30", "description": "I don't know what everyone else is talking about, but this place was out of this world. Normally I look for restaurants on yelp so that I can find new places and not have to go to the same place all the time, but I am definitely going back here... lots of times. I went on a Monday night at like 6:50, and by 7:10 the place was almost completly full! (I must not be the only one who thinks it has such good food)\n\nThey give you bread and olive oil... the usual (althuogh the bread was warm = yum), but then we got the bruschetta. ah so good! Hiiighly recommend it! For my main course I got a pasta dish with marinara sauce and eggplant, and added a bunch of parmesan. Oo it was so good!! \n\nI'm definitely going back to try one of their thin crust pizzas!! ...and some of the other things that sounded delicious. \n\nI may even go change my other 5 star reviews to 4 stars because pane e vino was definitely better than any other place I've been to recently.", "author": "Caitlin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-25", "description": "2.5 stars.  Decent food, but that unfortunately didn't make up for the fact that our water was never full and we didn't see our server after the plates were put in front of us until we waved him down for our check.  It's a little on the cramped side and while the pasta was yummy and tasted home made, it probably wasn't worth the $$.  I'd give it three, my fiance gives it two, therefore we're compromising and giving it a 2.5, probably won't go back again.", "author": "Chrys W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-19", "description": "Now that's I've been here twice, I can safely say that I love this place. It's not swanky, but the ambiance is perfectly nice. Great place to go when you feel like consuming 10 million calories of yum.  \n\nService: The service is hand-down fantastic. Both times we made reservations with almost no notice and were able to get tables (although the restaurant seemed quite full). When we showed up fifteen minutes early, (no bar at which to wait) we were graciously shown to our seats and brought menus. The waiter (same waiter both times) was gregarious, helpful, and ever-present, but never intrusive. He recommended a delicious Spanish dessert wine to enjoy with our Tiramisu. \n\nFood: We ordered a gorgeous Barolo, which they happened to be out of, so they brought us the same wine, but a better year, for the same price.  Wine list had a lot of great Italian choices.  The bread and flavorful olive oil with the wine ... stunning...  \nTo start, we had the Mozzarella alla Caprese and the Scallops with Grilled Polenta.  The mozzarella was good, the tomatoes and basil fresh, no complaints. The scallops were flavorful, but a bit chewy for my tastes; however, the tomato cream sauce and grilled polenta were incredible. I had to be restrained from licking the plate clean.  \nI followed up with the Taglialini with Mushrooms in a Cheese and Cream  sauce -- it's on the specials menu -- get it. So decadent, so creamy, so very, very bad for you. You WILL come back for this. My friend had the margarita pizza, which was also incredible. \nWe finished up with the Tiramisu, which we didn't need, but had to have. \n\nAll in all, a great comfortable place to have a nice dinner. Our bill for two was $180, but $100 of that was wine.  There are great vegetarian options, and a vegan option.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-04", "description": "I absolutely love this place.  I live across the street and eat here about once a week.  We almost always order the same thing: Fusilli con Melazane (the best!!!), Caprase salad & a Margherita pizza and they never disappoint.  We usually order the food to go, but it's nice to eat there as well.  It can get busy though and there isn't a ton of space.  I have yet to eat on the patio in back.  Maybe this summer...", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-16", "description": "I went here last night a Tues for dinner at 8pm. The service was slooowww and very erratic/hectic/messy/poor. The food was very good, but I most likely will not be rushing back anytime soon.", "author": "Jody K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-25", "description": "My husband and I love this place! We have had a lot of dinners there by ourselves, for birthdays, and other guests visiting. The reason the food tastes so good, is that the chef Bruno Quircini, has a passion for what he does, and it shows in the food. All the food is authentic and always fresh. If you haven't tried their thin crust pizza, it's to die for!\nThey put great specials on the menu, like lobster, quail, rabbit, just to stay unique, but they have so many things to choose from it's hard to decide. My husband loves their Veal or the Lasagna, and I love their fish specials and the ravioli.\nThe place is always busy, and we have a lot of friends that go in there. \nYou canmake a reservation, and it is a good idea for dinner time.\nThe service is great and anxiouis to please.\nThe wine list has a good variety of not only Italian, but wines from all over.\nThis place is a must for all who love Italian food.\nThere is also seating in the back enclosed patio area for larger parties.", "author": "Fog City Girl L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-21", "description": "Consistent food and service for 10 years!!!  I always look forward to dining at Pane Vino.  My favorite dish  is still on the menu . They also have the best  sausage pizza  I have ever eaten.  \n\nFor large groups.. you can enjoy the outside patio... which we have done with family, friends, guests from out of state, and even had business meetings there. \n\nI have always had great, consistent service and I've never had a bad meal.  Yum!! Yum!! Yum!!", "author": "denise c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-30", "description": "This was one of my go-to restaurants in SF back when it was called Via Vai. I think the name has changed but the management, food, experience are pretty much the same. They have a great olive oil (comes with warm bread) that has a grassy taste to it. Their pastas are made with fresh ingredients and their pizzas are fantastic--very thin, light, with high quality toppings. On a busy night it can be a hassle to get seated without a reservation so book ahead. Try the berries for dessert.", "author": "Toby S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-14", "description": "Always trust Pane e Vino.  I know I'll get a good meal with friendly service.  So it's not \"true\" Italian, but it's as good as it gets.  The pastas are always good.  The meats are cooked perfectly.  I know if I just want a hassle free meal without attitude and snobs, I go to Pane e Vino.  It's never a \"scene\"...just good food married to a good wine list.  Can't beat that!", "author": "Sonia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-02", "description": "This is the first place I've been to since Italy that nailed the Napoletana pizza.  Amazing. \n\nThe first time I went there I had the gnocchi, okay but I'm a harsh critic as I used to live in Italy.  \n\nBut the pizza... again, amazing.\n\nThey were also very accomodating as I was eating alone and had just come in from the gym - so I appreciate that they treated me the same as the normally-dressed clientele...  I don't make a habit of going to restaurants in gym clothes - but I think it says a lot that they're service was still excellent.", "author": "Molly R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-27", "description": "Nice Italian food in a warm atmosphere. Staff make you feel really welcome. Prices are good for Union Street. Lots of Pacific Heights types so maybe not the trendiest place in the city.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-03", "description": "One of the few Italian restaurants my picky mother will willingly frequent (trust me, that says a lot) and the only Italian place I will take my friends from Italy.\n\nI've loved this place since I lived near their original Steiner Street location (it still breaks my heart that they moved 8 blocks away).  The wait staff is friendly and attentive but I won't share my favorite waiter's name cause I want to horde him to all to myself cause he treats us like family every time.\n\nThey have a wood-fired oven where they cook pizzas and other entrees.  My personal favorites are the insalata mista (a simple mix of greens and shredded leeks w/oil & vinegar), pasta puttanesca (capers, anchiove and olives will never steer you wrong), grilled salmon and when I'm feeling especially gluttonous, the bistecca alla fiorentina.  Seriously, the steak is like something you'd see on the Flintstones and comes with huge portions of sides like yummy beans.  It's really two full meals and could easily be shared or take half home for the next day.  I find that it's helpful to order the meat a bit more rare than you would like (example: I like medium but I order medium rare - this works most times).  All of their desserts are usually delicious but their tiramisu is especially light and yummy.  And if you're a \"regular\" don't be surprised if they comp you a plate of bruschetta and sometimes wine and/or dessert.\n\nI HEART this place!", "author": "Gelsomina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-23", "description": "The atmosphere is warm, the service is attentive, and the food is delicious. It's also very convenient, located across the street from my office. Perfetto!", "author": "Scott W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-13", "description": "Wandered here w/ the BF looking for a good place to eat on a random weekday. It was surprisingly crowded, but we only had to wait 10 mins for a table. \n- homemade pasta was amazing\n- wine was decent\n- service was very friendly and they had good opinions/suggestions about what I should order", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-21", "description": "Such a great neighborhood standby!! Wonderful service, amazing pizzas!!!! Affordable wine...the Seghesio Zin is fantastic for $36 per bottle.", "author": "CMF l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-23", "description": "Could not have had a better evening!!!  Pane e Vino is tops in my book.\nThe food and service were superb.  Hands down this place is delicioso!!!  It serves actual ITALIAN food.  What flavor...what taste!!!\nAsk to be seated in Fabio's station, he will show you what ITALIAN hospitality is all about.  \nEnjoy!!!\nCiao", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-23", "description": "One of my favorite restaurants in the city.  Conveniently located on Union Street in Cow Hollow, the staff falls all over themselves to provide top notch service.  I opine that it is family owned because I seem to see the same Italian-speaking staff year after year.  My usual - carpaccio followed by the quattro stagioni pizza (proscuitto,mushrooms and artichoke hearts).  MMM - so good.  Also, great for groups.  They have a large back room and are reasonably priced.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-10", "description": "Went to Pane E Vino last night for a friend's birthday. All of us really enjoyed our dining experience there. The waiters are actually Italian, and the menu has lots of interesting choices that you won't see at your typical Italian-American restaurant, like black ink pasta. Other pluses are the ambiance and reasonable prices.", "author": "Katie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-09", "description": "Great service, excellent wine list, nice ambiance.  The new location on Union is great with more room and nice decor.  The wine list is excellent and don't be afraid to ask the manager for a recommendation.", "author": "T C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-19", "description": "this is my favorite place to eat on union street. in fact, it's my favorite italian in sf besides beretta. the tirolese pizza is AMAZING. the service is great. did i mention the dessert is fantastic? LOVE LOVE this place.", "author": "Tenika S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-04", "description": "we walked in here without any background knowledge... and it was great!  delicious crusty bread, vegetable thin-crust pizza that was AMAZING (more like a crepe-crust, but in a really good way); spinach raviloli done RIGHT, meaning good balance of flavours, not over-cooked.  great portion sizes, not skimpy.\n\nexcellent, warm service.  in a white-tablecloth place, they didn't miss a beat when we rolled in with our toddler, who they had a high-chair for (and proceeded to coo over for the whole meal).  \n\neveryone in the restaurant seemed to be having a genuinely good time and it was clearly a neighbourhood joint.", "author": "Elmo G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2004-11-30", "description": "Delicious Italian food served in a cozy but comfortable restaurant in Cow Hollow.  Ideal for a romantic dinner or small gathering of friends.  Not big enough to accomodate a big group, though.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-30", "description": "I agree with Margo B. This place is mediocre at best. Went there last night after unsuccessfully finding a good place in the Marina area that wasn't horribly overpriced (not my favorite hood but had to go to Paper Source so we decided to eat there).The back patio was nice. Food was mediocre, service was awful - we had to ask for everything and they overcharged us by $10 and then gave us $10 in cash because \"voiding it would be very difficult\" - seemed sketchy after I overheard the table next to us saying they had overcharged her by $16 and they did the same thing - money laundering perhaps? Not going back.", "author": "M B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-26", "description": "I was with a large group for a work dinner, so we ordered pretty much everything on the menu and shared.  No complaints from me!", "author": "LT B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-27", "description": "Pane e vino is one of the best Italian restaurants in the city. I like that they have a good variety in their menu (not just pizza and pasta) and good Italian wines (the Valpolicella is very good). The service is friendly and the place is warm and cozy. I highly recommend the Antipasto Della Casa and the Carpaccio to start with. Both are delicious and fun! You'll see what I mean when your order them ;)", "author": "Loubna M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-09", "description": "I went here with a friend who absolutely raved about this place.  The layout is kind of weird but we got a small table in the back.  The best part was the waiter.  I can't remember his name but he would bring out little appetizers and things while we waited for our food.  The food is OK but the servings are really small and the food unremarkable.  Again, the waiter lifted our spirits by bringing us little glasses of lemoncello.  It is to die for and they make it there!  Overall, the food is overpriced for what you get, but if you get this particular waiter, he makes it worth it with the little freebies he brings out.  Oh, and I cracked a crown eating the bread!! '-0  What is it with the TOUGH bread????  And my friend, who had been gushing good things about this place, went one night with her BF, didn't get all of the special treatment and goodies, and now says she hasn't been back since.  Go figure!  Guess it helps if you're female and single, hmm?  I gave it a third star because of the waiter and the extra goodies!!  And I would go back for the lemoncello!  YUMMY!!", "author": "Paula W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-23", "description": "I've been here a few times including this past Monday and think the food is pretty good.  I had the sole and the minestrone soup (soup was better).  The pizzas are really good too!  My biggest complaint is the place is so freakin' crowded which leads to inattentive service and getting bumped into when people are trying to squeeze past your chair.", "author": "Glen E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-10", "description": "I am happy we tried it.  I'm pretty picky about my Italian food, but its in our neighborhood, and I figured we'd give it a go.  The caprese wasn't all that interesting, but the two pastas we had were delicious. Everything seemed fresh.  The service was good and friendly.  I would definitely return.", "author": "Aimee D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-19", "description": "Even though our meals were pretty dang good (we had the most amazing Fettuccine Ai Formaggi- really the best thick yummy rich cheesy pasta I've had in a long time) I have to take stars away due to the totally lame service. \nMy husband and I went there Saturday night and I just had the feeling that our waiter didn't like us for some reason- I tend to be fairly smiley and am rubbed the wrong way when people don't return the gesture- especially when that's their job!!! I just got the sense that he was bothered by our presence. I just noticed Trey c's comment and it sounds like we had similar experience! \nOur waiter topped off his lack of interest in us by completely  disregarding our table after we had our food. I had to ask a bus boy for the dessert menu and the hostess ran my credit card (after it had been sitting on the table for almost 10 mins- even the manager-looking-person walked by and looked at it but did nothing).\nBeing a former server myself, I'm kinda a stickler about leaving 20% but I okayed my husband to drop it to 15. It would have been less but then I just feel like I'm giving them a reason to be rude to people in hoodies- quite the dilemma :)\nIt's a shame. I work just a few doors down and would have been excited to have a new favorite pasta place so close- but I really didn't feel welcomed.", "author": "Robyn K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-13", "description": "We selected Pane e Vino because they have a back patio available which we reserved for a birthday party for 20-30 people.  We specifically did not want a \"long table\" experience because it is difficult for people to mingle.  We confirmed with the restaurant the day before and day of the event.  When we arrived, several of our party had discovered a different group had been given the back patio and we were given a long table in the front.   This was an extremely disappointing situation which effected everyone, especially the person who was celebrating their birthday.   The staff did nothing to help and at the end of the evening lied to us and pretended that they never agreed to give us the patio.  Another member of our party had a similar experience several months ago.  I recommend people not consider this restaurant for any group event, as they are completely unreliable and have a pattern of duplicity.", "author": "Steve K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-10", "description": "the first time i went here the food was to die for. the second time - i got the same dish, it was just okay. i thought it would turn out to be my to-go-italian place to go but after the okay showing the second time - i never went back. a friend swears by this place and he has impeccable taste - so i am going to have to try it again...", "author": "Miss O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-12", "description": "my girlfriend wanted comfort food and she hadnt been here in a while.. i had never been here.. i was the person who nearly licked her bowl clean.. yummy fresh delish pasta.. very enjoyable.. good atmosphere.. will def come again...", "author": "Aditi M."}
