{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "Tasty friendly fast. The owner stayed open for us at 3:05pm even though they close for the afternoon. Bonus points for honoring the lunch special. \n\nBrownie points for meaty duck pieces in the duck fried rice.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "Great neighborhood restaurant. Good food. Family owned. Great lunch specials. Thoughtful presentation and very tasty!", "author": "Claudia B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-30", "description": "2.5 STARS\n\nThe roommate and I had just made it back from the Caribbean and I was starving! I was particularly missing Asian food after not having it for a week. We decided to order lunch from Patpong Thai Cuisine on Saturday, September 9th at 12:58pm through Delivery dot com. It arrived at 1:48pm. I live in Outer Richmond.\n\n23. Hot & Sour with Shrimp (Tom Yum): Hot and spicy, With kaffir lime leaves, galangal root, mushrooms, roasted chili paste ($12.95)\n28. Spicy Basil Fried Rice: Hot and spicy, Chicken with crushed chili peppers, onions, tomatoes, bell pepper and Thai basil ($10.50)\n30. Pad Thai: Thin rice noodles stir-fried with Chicken, fried tofu, egg, bean sprouts and green onions with crushed peanuts on the side ($10.50)\n37. Green Curry (Gang Keo Warn) with Chicken: Hot and spicy, With Chinese eggplant, bell pepper, zucchini, green bean and basil ($11.50)\n*Chef's Special Papaya Salad: Prawns, tomatoes, carrots, green beans in chili-lime sauce, no cashew nuts ($11.95)\n*Brown Rice ($2)\n\nWe have our usual Thai spot we order from, but they weren't delivering for lunch, so I just picked this restaurant. Overall, I thought the flavors were too one note. And everything was overly sweet. I wanted more spiciness and fishiness to balance out the papaya salad. The curry had a good amount of heat, but I found it thin. I tend to like a thicker curry. The soup also needed more lemongrass (or something) for contrast. The roommate ordered the other two things and seemed to enjoy them.\n\nKinda wished our usual spot was delivering as I wasn't impressed. Everything just needed more flavor. Especially spice as I noted most things extra spicy. Oh well, at least I tried a new spot!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Was able to deliver to the VA Hospital in less then 30 mins. The spicy basil beef was hot and fresh, a welcome relief from hospital food. I will definitely order again.", "author": "Eric V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-20", "description": "It has been years since I last ate at Patpong Samila. I had to stop by the medical supply place next door and was pretty hungry afterwards.  I ordered the lunch special Duck Fried Rice with crab added.  I also got the fried egg rolls.  I enjoyed the egg rolls more than the rice.  The fried rice was dry and bland tasting.  The duck meat was dry and a bit hard, maybe it was old?  The lady server was nice but when she brought my bill she asked me to pay in cash.  I asked her why, and she said that they don't have much cash money.  I was irritated especially since I wanted to use my credit card.  I guess I know why I won't come back.", "author": "Emy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "Just a great place for lunch. I always get the eggplant rice special with fried tofu side and brown rice option. The portions are huge and the food is delicious.", "author": "Ho N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-24", "description": "Good enough when hungry. I've had better Thai food. I had roast duck fried rice only which was okay. The service was good and the lunch combination looked reasonable price.", "author": "Kay D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-26", "description": "I ordered Guay Tiew Rod noodle online with extra prawns,and turned out there were only two prawns in it. It is said on the menu that extra prawns will come with 4 pieces of prawns. Not to mention the noodle itself will have prwans as well. Why there only two pieces of prawns? Super bad service. The quality is not good either.", "author": "Steven Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-29", "description": "All the dishes were very bland and we ordered medium to hot spice level. Watery soup. The appetizer had zero meat and it was supposed to be a dumpling filled with meat. Literally no meat. Poor quality and flavor. Good price points but I guess you get what you pay for. (This was for delivery).", "author": "Brooke S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "Patpong is really tasty with excellent prices. Its a neighborhood restaurant that has lasted all the changes.  I would recommend you try them for lunch or dinner and they deliver.", "author": "Susie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-02", "description": "We were craving Thai takeout and had no idea where to turn after our favorite neighborhood Thai place closed.\nWe chose Patpong! The food arrived fairly quick, maybe 40 minutes or so, and the driver was friendly. \nI ordered the Chicken Satay - tasty, great peanut sauce, good cucumber salad!\nAnd the pineapple fried rice, and it was boring. The best part was the cashews and raisins in the rice. There wasn't enough seasoning, and we had to add quite a bit of soy sauce to get it to taste like anything. It was underwhelming and I'm not sure if we will be ordering again.\nThe best part of the meal was the Thai Iced Tea...those were delicious!", "author": "Larissa S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-18", "description": "Disappointing. Been here three times already and each time the flavors were inconsistent. I got the Tom Yum soup and it just tasted like hot water with chilies. Their basil chicken was bland with no flavor what so ever.  \n\nNot a place I'd recommend.", "author": "Me V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-31", "description": "Pad Thai with crab was not fresh. I called to ask if it was fresh, real crab. They assured me it was, when we picked up the food and brought it home, the crab meat smelled strong and had a white grey appearance and was slightly mushy - all signs that it's not fresh. I even tried a bite and couldn't swallow it. The pad Thai without the crab was too sweet and had a bad aftertaste. My friend's pad kee Mao didn't have basil in it. I avoided this place for years because of the name, and I'm glad I didn't bother eating there judging from the food we tried. I hope they improve their food or maybe don't have crab on the menu unless it's fresh then make it a special for the day.", "author": "Heather U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "This is my wife and my favorite Thai restaurant in San Francisco! When we lived in the city we ordered it about once a week. The Pra Ram and the Ka Pao are our favorite dishes! The curries are also very tasty. And of course you have to get the garlic rice. The food is very flavorful, the meat is fresh/high quality, there is a great selection, and they have great prices. The staff is also very friendly. One time, we brought family from out of town and the staff showed us how they fold origami flowers from the straw wrappers and place it on top of the straw.", "author": "Joshua F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-25", "description": "This place has a kind staff, but the food is disappointing. \n\nI tried this place a couple of times and I can never say I was fully satisfied. The beer filled but it didn't get me tipsy and I feel that way about he food too. The curry is weak, the fried rice lack luster, and the pad Thai was dry.", "author": "Rodrigo C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-20", "description": "This place is horrible. We were looking for a quick bite and went in for some pad thai- everything else in the area was closed. It was covered in ultra sweet syrup. The noodles were gummy. No part of the dish even resembled pad Thai. Could not eat more than a few bites.", "author": "Ema H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Great staff, very attentive and the papaya salad and tofu pad Thai were 10/10. Highly recommend.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-18", "description": "Not bad for a pickup the food was hot and fresh \nVery bland cooked food, nothing special to write home about. Good food if your hungry and in a hurry", "author": "Irving S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "\"Meow!!!!!\"\nThis cheetah shouts as he and his friend realize that every restaurant in the area seems to be packed and has a long wait for seating. With the both of us feeling quite hungry for dinner, we had almost given up hope, until we happened across patpong and saw no wait and many open tables. Destiny? Or maybe a case of the place not being that great? We would take the chance and find out! \n\nPatpong is one of those restaurants I always pass by, but never actually got the chance to give it a try. \nIt is a block or so away from the \"restaurant row\" of Clement, so perhaps that's why. \n\nThe menu here has your standard options you expect to see in a Thai restaurant. To which of course I had to get pad Thai with chicken as this is my go to. And what cat can resist a Thai iced tea? *note* they even had a yelp check in offer for a free one too! \n\nThe meal came out very quickly and was presented beautifully. The entire restaurant on that note was actually quite pretty. Very elegant and pretty decor that made me feel like I was somewhere else. \n\nDelicious! The pad Thai with chicken was perfectly done, and just enough flavor an slice to make me purr. All the while, extremely friendly service and a waiter who was very attentive to our needs. \n\nPrice wise, pretty standard for a Thai restaurant. Not necessarily for diners on a budget, but you won't break the bank. \n\nTwo paws up from this spotty cat! \n\n*chirp!*", "author": "Jei C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-03", "description": "I got a ton of noodles that were very dry, they were coated in minimal sauce and very little meat... It was also flavorless, which forced me to add a ton of chilli paste...", "author": "Eric W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "Lifesavers. I order delivery from this place regularly and they're always fast and great. The veggie pad Thai is superb and the Thai tea is excellent. Can't say enough good things about this place.", "author": "Bianca H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Why is this place not 5-stars? It's ambience is perfect, food tasty, service friendly, prices reasonable, and parking is fairly easy.", "author": "Sergey A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "This is an authentic Thai experience. We were pleasantly surprised by the delicious lunch specials we both ordered. Service was friendly, timely and the place is clean. We will return.", "author": "Tambi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "Patpong is a good little spot if you're craving good inexpensive Thai food. Everything I've gotten is pretty good but not the best Thai food I've ever had. They have good service and their take out is pretty quick.", "author": "Jenn A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-20", "description": "Google menu incorrect. Says soup is 4.5 per person so I ordered 2 but was charged 10+ for 2 large soups. Unwilling to negotiate or take off extra item. Just paid $40 for 1 entree and some soup. Food was just ok, disappointing since they're close to home.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-06", "description": "came here bc my friend recommended it \n\ni only ordered pad kee mao. it didnt taste like thai food, it was more like chinese food with a lot less flavor. it wasnt very spicy and it was super oily. also, the portion was not worth it for the price", "author": "Amy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-05", "description": "The Lunch Specials are a great deal. For a rice plate you get soup (meh), salad, appetizer and entrée with rice (I like brown rice).  You choose an appetizer, I like the fish cakes or chicken satay, and the kind of protein with your entrée (tofu, chicken, beef, pork, seafood or prawns).  The one I like is the eggplant with prawns or chicken, my husband likes the ginger.  There's quite a few choices and curries too.  Lunch costs between $10 -12.  Service is great and the place is usually quiet for good conversation.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-29", "description": "Close your eyyyyes, amieee,\nAnd you can beeeeeee wihith meee!\n'Neath the waaaves, through the caaaaves!\nI'm hot. ter. than. a. sum. mer. day.\nSting raaaay, Sugar Raaay\nKnu! ckles! all. up. in. yo. faaace!\n\nAs much as I wanted to eat actually IN the resto behind the Dirty Dancing-esque neon window logo, I had to get takeout so I could catch the Boz Scaggs vs Missy Elliott showdown that was rabble-rousing its way through my home speakers.\n\n#4 GREEN ONION PANCAKES $5.95: I was expecting pajeon, but it was puff pastry triangles. They should change the name; croritos (croissant x Doritos) could be pretty hot right now.\n(photo http://www.yelp.com/user_local_photos?select=uJnr3RNJdChGUqc8CtFLNA&userid=WALNtcSZlONK4Yj-o3pzKA)\n\n#53 MO MONEY MO PRA-RAMS CHICKEN $8.95: I chose the hottest spice level. Yawn. The dish was deece though - not too much chick, not too much veg.\n(photo http://www.yelp.com/user_local_photos?select=caHszcFbuLiNHxj_2fhXUQ&userid=WALNtcSZlONK4Yj-o3pzKA)\n\nI should go back and dine in at some point. I'm keeping an eye out for the #62 STILL SHAVE MY CHO CHA RED SNAPPER.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-07", "description": "My roommates have dissuaded me from eating here, and the Yelp reviews were average. When I saw  my neighbor purchase some food for pick up, I decided I needed to make my own informed decision. \n\nI ordered Pad Thai and egg rolls, customer favorites on Eat 24. The spicy level of the Pad Thai was mild, but I wish I ordered it medium because it had no flavor. I thought it was just me, paying more attention to Game 2 of the NBA finals instead of my meal.  But alas, it really didn't have any flavor. The egg rolls were okay too. Most of the flavor came from the sweet and sour sauce. \n\nI'll probably try this place one more time so hopefully tonight was just an off night.", "author": "Vira P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Fast delivery \nFood was super hot upon delivery and everything tasted lovely. The spring rolls were deliciously fresh and crispy & loved how the veggie spring rolls don't have mushrooms! Had the Thai green curry which was also nice. Reasonably priced too.", "author": "Emma G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "Very welcoming environment. Waitress was friendly and helpful. You can feel the love from little details like the paper rose and cute plates. (See pics) Food is yummy~ I had fried chicken wings with basil. Love the crispy basil on top!! Tom yum soup and silver noodle salad were good~", "author": "Maddy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-14", "description": "Pretty average (bordering mediocre) Thai place in the Outer Richmond. I ordered pad see ew when I came here for dinner, and I thought it was very under seasoned. It was a pretty big entree, but I didn't really enjoy it that much. I thought it could've used a lot more sauce in the way the noodles were cooked and not how I usually see pad see ew made. I thought the Thai tea was good though!", "author": "Steph V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-01", "description": "This place has great service and friendly staff!  It's apart of EAT24 so they deliver!\n\nI ate too many Gu Chomps on my long run and the caffeine ended up upsetting my stomach at mile 9.  I was supposed to go 10 miles that day but after holding in my upset stomach, I had to find a bathroom.  I had just finished running downhill through the Presidio and the residential area so I was desperate.\n\nI saw that Clement Street had businesses open for dinner on Sunday and ran into this restaurant.  I quickly ordered a Thai tea to go and went to the bathroom.  After calming my upset stomach, I drank a glass of water and the rest of the Thai tea happily as I walked another mile back to my car parked at Golden Gate Park.\n\nThe End.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-08", "description": "I had really great fried rice, lots of flavor and different vegetables. I'm not the biggest fan of spicy foods so sometimes Thai can be hard but the restaurant had a lot of options on the menu. Felt like a pretty standard neighborhood eatery in the Richmond. Staff was great and helpful. The papaya salad was a refreshing way to start the meal with some Thai iced tea!", "author": "Kylie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "My partner, who is from Thailand, and I visited 11 different Thai restaurants in San Francisco, looking for the right mix of good food, intimate location and friendly staff.   It helps, of course, that he speaks fluent Thai.  \n\nWe chose Patpong Thai for our after wedding ceremony dinner seating 24 people.   We met with Sak the night before and selected our menu.  There were some special requests required as two guests were Vegan and one had strong allergies to anything fish (including fish sauce used for many dishes).   The staff suggested buffet style, but we insisted on family style seating and serving (3 groupings)\n\nWe were extremely pleased with the at the end of the evening and all of our guests greatly appreciated the high quality and taste of the food we selected.   It was a challenge to serve the 7 courses family style, but the staff rose to the occasion and the kitchen really performed extraordinarily.   We were very pleased with this business and appreciated EVERTHING they did to make the evening special for us as well as our guests.", "author": "Justin Thomas A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Delicious! This is an outstanding Thai restaurant. They have the best Tom Khar and Green Curry I've ever tasted. Very nice staff.", "author": "Debbie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "For the price, it's a 10/10 Thai joint! My go to for take out or fast sit down.  The Pad Thai and Pra Ram always a go too!", "author": "Devin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-22", "description": "My family was feeling thai food the other night and we saw this place across the street so we ventured in and tried it. The restaurant was completely empty, all they had were a bunch of take out orders near the door for people who ordered ahead of time.\nNow for the food. Surprisingly, I liked the pineapple fried rice the most! It was full of flavor even though it was just fried rice. The noodles and curry we ordered were okay. The curry tasted super watered down, and the noodles were either very saucy or oily..\nThey also give you a thai tea for checking in! Remember to mention that you checked in to redeem it before you order it or else they will not allow you to redeem it AFTER you order, which is a bit odd but whatever.\nThis place was just average, there are better thai restaurants in the neighborhood.", "author": "Kev L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-02", "description": "Decent honey roasted duck, but the portions were smallish.  Good service.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "I'm afraid.\n\nI'm afraid to write a positive review of this restaurant, as it will tip the scales just a bit closer to wonderful, and then it will be flooded by nimrods, bent on finding the next hip place, based on stars, their \"foodie\" friends, and long lines. \n\nWith that in mind, I will say nothing to bolster your knowledge of the generous portions, tasty, although not overly-spiced curries, and seafood based delights. I choose not to declare that this establishment is the best, in the very Thai restaurant  prevalent neighborhood. \n\nIn fact, this place pales to the amazingnessness of Burma Superstar, or Ike's, or Taqueria Cancun, or The Stinking Rose, or any of the other crappy restaurants that the masses rave over, because their friends said so.\n\nSo yeah. Stay away. This spot is mine.", "author": "Darrell L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "I'm definitely a fan! \n\nMy roommate and I were walking around for some good dinner when we stumbled upon this place. So glad we did! \n\nWe got the Tom Yum soup and the Shrimp Pad Thai.\nBoth were delicious, large, and we left full and happy.\nOverall, here's how I broke everything down:\n\nPROS:\n*Great friendly service\n*Yummy food\n*Clean environment\n\nCONS:\n*Music was a bit soft, it made our talking feel really loud and a bit awkward, but that's my only problem, this place was great.", "author": "Cara O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-03", "description": "I'm a regular customer here and I order the food about once or twice a month. I have never eating inside but always order for delivery . I stick with what I like and always order the red curry chicken with vegetables , for some reason the lady who Answers my call always make mistakes , forget my chicken couple times and I was very disappointed . I assume when a regular customer orders the same thing all the time , she should know already .i work in a upscale restaurant myself and I am a manager of the business . When a customer requires certain things it's better just reply politely and correct it instead of arguing back and forth . She was constantly arguing about the order instead of saying ok I will let the driver deliver it for you. It's totally wasting of time . I suggest when you make a phone order , repeat 3 times on the phone so you don't get something you don't want . Especially calling between 5 to 8 pm . Food overall is good but bad customer service .", "author": "Lidia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-13", "description": "Although Patpong is a tiny space, they've managed to turn it into a chic restaurant.  The interiors are are modernized with slender openwork wood dividers along one wall to give a minimal sense of privacy, smooth wood flooring, granite tabletops and sleek styled seating.  The walls and front hostess area are adorned with exotic,authentic Thai motifs.\n\nNow for the food!  My gf and I both had lunch specials for $7.95 which came with soup, salad, an appetizer and an entree.  What a deal!  Both of us decided on the Eggplant basil dish with red pepper, mushroom, onions and a choice of meat.  I had the duck for and extra $2.  It was so good, I could have inhaled it had her and I not been chatting it up!  The appetizers:  The fried wontons were light and lacked any greasiness.  -crunchy morsels of joy...  The fish cakes  were a little on the stiff side but okay with good flavor.  It had a texture closer to a fish ball which I'm not a fan of.  The salad was plain with a hint of a sweet dressing which was hardly noticeable, but I typically enjoy very light dressing on salads anyways.  The service was friendly but a bit slow in the beginning.  However, it was understandable given there was only one server during lunch hour.\n\nI would definitely return next time I'm in the area.  This place is aesthetically pleasing, friendly and serves good food.  What's not to like?!", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-24", "description": "Have been a longtime customer (delivery only) and was a big fan, especially of the Spicy Basil Tofu. The last time we ordered we had dinner the first night and were finishing up the leftovers on the second night when much to my horror I found a DEAD COCKROACH in my food. I'm not sure I'll ever want to order take out again...", "author": "Margaret W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "This is my jam! I, like the majority of the population in san francisco, love thai food. This is my local place, i've been to every thai spot in the richmond, and yeah king of thai is cool, but for a local in the richmond, this place is it. Chicken wings w/ fried basil leaves. pad thai, pumpkin curry w/ duck, pad kee mao, pad see eew, duck fried rice. These are all the things i like. \n\nThis is the only place I have saved on my phone for a restaurant. phone to table in 20 minutes. I love america.", "author": "Elton F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-02", "description": "Quick delivery. My spring rolls and pad thai got here after just 30 mins. The rolls are fresh, crispy and delish. The pad thai, while not amazing, was good. \n\nI plan on being a repeat customer!", "author": "Chef C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-13", "description": "Down the street from me, ordered take out---was fast & efficient---restaurant was empty.\n\nVeggie egg rolls: large portion for relatively cheap price, bland and greasy, tastes sorta like late night fast food chinese from a food court. \n\nVeggie Pad Kee Mao: tasty, good flavor, nice ratio veggies to noodles but small portion (or I am just a heifer) or both. A little spendy for what it is.", "author": "Cec D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "Had to put in a good word for this place.  We have found our new lunch delivery spot, after tiring of the general un-flavorliness of Tsing Tao (and also the unfortunate discovery of a hair in my coworker's lunch)....and it is Patpong.  We all ordered chicken pad thai the first time (to accurately judge a thai place, you need to try it, right?) and I thought it was really good.  Good flavor, not greasy, a good amount of crushed peanuts on top, and a generous takeout portion which easily provided me with two meals.\n\nThe next time, we ordered delivery for about 15 people for a lunch talk.  They carefully labeled each dish with the person's name on it, and not a mistake was made...on 15 orders.  Maybe I just have low expectations from delivery, but I was pretty impressed.  And everyone's food arrived, on time, and piping hot.  A+!  Everyone gobbled up their lunches happily, and most had leftovers for the next day.  I ordered the spicy basil chicken which was the right amount of spiciness - not burning my mouth off, but definitely with a kick.\n\nSince that order went so well, we ordered again the same week.  This time I went back to chicken pad thai, again, perfectly satisfying the craving.  My two coworkers (one who is Korean and loves spice) ordered their dishes spicy.  And oh my goodness were they!  We had just taken a few bites when both of them started sweating and needed to get an ice-cold drink from the vending machine.  However, they really liked it.  I will be sure never to order anything \"spicy\" from them, though!\n\nWe'll definitely be back.  It's our go-to spot for lunch delivery in the Richmond!", "author": "Caroline K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-03", "description": "Delivery is cheep and fast enough, but the Panang curry was NOT very good. Thin curry with little taste. Meet was ok but the curry dish doesn't even come with rice!", "author": "Chris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-09", "description": "delicious food! they are so nice whenever i walk in to pick up food togo and fast!\nIve come back several times.\nLove it!", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-19", "description": "This is my go to Thai restaurant!  Service is always fast whether dining in or using delivery.  \n\nMy favorite order is the yellow chicken curry and garlic rice.  The pad see ew, Thai fried rice, and pad Thai is delicious too!  The service is always great. \n\nHighly recommended.", "author": "Shae O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "Excellent lunch here. Curious that we were the only ones here. We would definitely come again", "author": "George Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-19", "description": "We ordered the beef salad and the garlic chicken.  Both dishes were flavorless, unthoughtful and just seemed lazy.", "author": "mark l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-08", "description": "Ehhhh. Their food is pretty mediocre. There just was not enough flavor in the things I tried. Also, every time I get a chicken dish, the chicken is a bit on the dry side. The only thing I'll come back here for are the shrimp rolls - they're the best ones I've ever had. \nThere are plenty of other Thai restaurants just across the park in the Sunset that are much better.", "author": "Allison D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-04", "description": "Eat lunch here regularly. Always fast. Always great. Year after year. The server is a joy.", "author": "Noel S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-16", "description": "I have been going to Patpong for over 8 years at least once a week.\nI spend a lot of money there.\nTo go or eating inside.\nOne night that I am sick and that I asked them nicely to deliver me food, they are refusing to deliver for $4 missing on their minimum, which is $15 , I live on 29th and clement and they 3 blocks from my house.\nAfter having me in their system for over 8 years and being treated like a total stranger is HORRIBLE CUSTOMER SERVICE. I WILL NEVER RETURN !\nThe most amazing part is that they don t care.", "author": "Matia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-29", "description": "Love this place's service and tasty dishes. Everyone who works here is super nice, right down to the management/owner who, I'm pretty sure, delivered a meal to us at 10 pm on a Saturday. \n\nI recommend the pineapple fried rice, crispy chicken fried rice, shrimp rolls and FOR GOODNESS' SAKE the mango sticky rice.", "author": "Christina R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-20", "description": "I'm sad. Why does it always have to come to this?? A one star would never happen if I was at least moderately satisfied, but no. On to the review. Ordered delivery. Green curry and chicken pad Thai and added shrimp. The green curry was watery as hell and bland. I had to add salt to get some flavor. The pad Thai tasted ok but I asked to add shrimp and they added TWO little shrimp. Really? I'm not about that. That's rude cause I paid extra for it. But now I know. I may just give it one more try if I'm absolutely desperate and not close to Kin khao downtown, but I highly doubt it.", "author": "mel l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-13", "description": "I think it is fair to say that my obsession with Patpong is real. I used to live down the street, and would order take out here at LEAST once a week. Now, I live in Oakland, and still come here when I get a chance. VEGETARIANS: do not miss the Pon Ga Ree! Best curry I've ever had. It's not spicy, but full of flavor, which is the key to my heart. \n\nI would rate them 4 stars because they had a delivery guy who once gave me a menu to a different thai place and told me to order from there instead, LOLZ. But this love is unbreakable. Silly delivery guy, you'll never get between us. But whatevs, I currently have my mouth full of Pon Ga Ree so0o0o.... #notevenmad\n\nMoral of the story: eat here!", "author": "Alyssa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "Love this place. Great thai food. Pad see ewe and the pad thai are very well prepared. My favorite dish however is the wings. So good!", "author": "Daniel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "Hubby is currently in SF Veterans Hospital. I had Veggie Green, steamed rice and Thai iced coffee delivered. It arrived hot and was delicious! No delivery charge (though they did charge me 10 cents for the bag... Which cracked me up!) I did take a star off only because it arrived with no napkin or silverware. I will order them again, I know. I will just stress that I need silverware!", "author": "Alan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-08", "description": "Patpong provides solid Thai food with quick service and convenient delivery.\n\nOne of the great things about this place is that it never seems to be crowded, even during peak hours for lunch and dinner.  This is probably because most customers either order over the phone for pickup or delivery due to its convenient location in the Richmond district.\n\nThere are many neighboring restaurants within the vicinity so the options are out there should you decide on something else.  Parking can sometimes be tough since this is one of the busier parts of the Richmond.\n\nThe space is medium-sized but as previously mentioned, seating is never a problem.  The decor is pretty standard for a Thai restaurant with your Buddhist statues and various plants laid out to give it that ethnic and traditional feel.\n\nTheir lunch menu is a perfect quick fix for that Thai craving, such as the crab meat or roasted duck fried rice, or any of the clay pot dishes.  The pad thai and the pad see ew are also pretty good.\n\nOne of my favorite main entrees is the herbal red snapper which is sauteed in special herb sauce, bamboo shoots, baby corn, bell peppers, eggplant, green beans, zucchini, and Thai basil on a sizzling plate.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-13", "description": "I've been here twice and our waitresses are always nice and attentive, but the food lacks flavor. The first time I ordered fried chicken over garlic fried rice - fried chicken was soggy and the fried rice tasted too plain. Second time I had the pad thai: it was way too tangy with too many noodles and not enough veggies and meat.\n\nOn top of that, I checked in on Yelp right after I ordered during my second visit and was granted an offer for a free Thai iced tea, yet they refused to honor the coupon. So they made me pay for the Thai iced tea I drank during my meal, and gave me another iced tea to in a plastic to-go cup. What the f***, how hard is it to enter your computer system and delete a drink off the tab?\n\nAfter reading through other reviews on Yelp, it seems like the general idea is that Patpong refuses to take an extra step to establish a clientele. Its a disappointment cause I want to like this place, I really do - its clean, the food is marginally acceptable, and its within walking distance of my home, but they have no loyalty and their food isn't good enough to overlook that. Spend your money else and treat yourself to better Thai food by driving further down Clement for King of Thai.", "author": "Felix C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-12", "description": "Zero stars ! I've been coming here for almost 6 months since they are my neighborhood Thai food .Today I ordered a pad see ew chicken Togo, when I went home I ate half the dish when suddenly I smelled and taste something spoiled and funky- it was the Chinese green broccoli. I walked back to the restaurant and told the waiter. \n\nThey said they cannot do anything about it because I ate half the noodles and that was the problem\n\ni told her the problem was that they served me expired vegetables to begin with\n\nThe owner came and said pad see ew is their most popular dish ,he said I was wrong and they never serve spoil food. \n\nHe never even apologize, just dissed me and was in denial. They have no restaurant or business Ethnics or customer service. \nNo wonder they have a 78 HEALTH SCORE Gross . Don't go here. \n\nThe dish was only 10$ but they lost a neighborhood customer forever.\n\nNo wonder their business is so slowwww. \n\nGo to king of Thai instead", "author": "Quyen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-21", "description": "Over the years, the service has gone up and down. It's on an up again. The food is always good. The prices are great.\n\n The atmosphere is excellent. A serene place for dining and company. A favorite place of mine to bring guests when you wish to sit and talk over dinner. Cannot tolerate loud noisy restaurants. \n\n One of the best places for lunch on the Outer Clement Corridor.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "Great food, super friendly service, and nice atmosphere. We'll definitely make this a go-to spot when we eat Thai food.", "author": "Kayla G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-05", "description": "Wow! This Thai restaurant is really authentic! I brought my in-laws for dinner and they loved it! Fried chicken wings and basil Thai rice are the bomb! Friendly people too.\nWill be going back again next week.", "author": "Liza M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-21", "description": "Interesting night:  my wife and I decided 1) we had no interest in cooking dinner, and 2) we felt like driving to 25th and clement, getting out of the car, and randomly picking a restaurant to eat at.  There's a bunch of options on that short stretch of clement, and we stumble upon Patpong Thai and decided to check it out.\n\nThey have good stuff here.  I ordered the pad thai with crab meats, and it was one of the least oily, lightest pad-thai's I've had in the city.  I'm not saying that's how pad thai is supposed to be, but at 8pm on a worknight, and after eating a giant pile of pad thai, I didn't feel like passing out on the spot, which was good.\n\nMy wife ordered the eggplant chicken, and she was fully impressed as well.\n\nThis place won't knock your socks off, but if you're hungry and have a hankering for thai food, it's worth it.  Decent prices, good service, and tasty dishes - works for us.", "author": "Tim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-02", "description": "This is best Thai in outer richmond, I've tried them all. Pad see eww was solid. Spicy basil chicken and rice great! The lady that's always there is so nice!", "author": "Blake S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "Now it's pretty good service and clean. However. The menu has remained the same for years and certain dishes are quite good, though now lower quality than before. Crab cakes and the Tom Khar soup are my favorite. Tries chicken with rice noodles but it did not differ much from what you could get at a chinese place. Overall, ok.", "author": "Alan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-25", "description": "Craving coconut.\n\nDefinitely in 100+ degree Myanmar. Fresh coconut water was a highlight from an incredible trip to an incredible country: www.sfgate.com/travel/article/Experience-newly-open-Burma-before-the-crush-3705543.php\n\nNot so much otherwise. Which made Patpong's non-coconut milk curry Gang-Pa Curry an easy choice.\n\nLighter curry meant more focus on the salmon, bell peppers, zucchini, pumpkin, green beans and broccoli. Delicious medley with a nice balance of each.\n\nHoped for a bit larger quantity for the $12 price plus tax and tip. Quality was not an issue. Nor was the very friendly and welcoming staff.\n\nThai food cravings can be satisfied here. For coconut cravings I can't recommend Myanmar enough.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "We stopped by after visiting my dad at the va hospital. The food was amazing.  Great taste at a great price.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-26", "description": "This is my favorite Thai restaurant in San Francisco! My wife and I order from here about once a week. The Pra Ram and the Ka Pao are our favorite dishes! The curries are also very delicious. And of course you have to get the garlic rice. The food is  Very flavorful, the meat is fresh, there is a great selection, and they have great prices. The staff is also very friendly.", "author": "Josh T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "This place is just one block away from my apartment so I have to admit that I am slightly biased due to shear convenience.  Aside from the location, the food is pretty good.  We always go with the Pad Thai (which could use a little more flavor).  They do a great job at cooking the tofu and egg rolls are quite tasty.  The best dish I've gotten here is the Basil Chicken.  It has great flavors and just enough spice.  The worst dish I've gotten here has been the Cashew Chicken.  There is nothing terribly wrong with the cashew chicken just slightly flavorless.  Overall, I still give this place credit for being a great Thai place with fantastic customer service.  They can give off a fast-food-Thai flavor, but the prices are great.", "author": "Samuel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-25", "description": "I've eaten in person as well as gotten delivery from here.  Their food is decent.  Delivery service is prompt.  One time the delivery person got lost (miscommunication between cashier and him about my location) but otherwise quite reliable.", "author": "SF O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-23", "description": "Larb: no mint in a \"herb\" salad? only had green onions in it... no mint... still upset...\nPad Thai: flavorless noodles, no green onions, no onions, noodles were not mixed well with the other ingredients. no \"usual\" lime to go with it... not exactly sure if it was any better than the box kind of pad thai...\nChicken Wings: got these for my friends so I can't entirely comment but it looked promising with fried basil leaves; it was a wet rub, coated with some red sauce. She said it was sweet and sour'y but I cannot confirm or deny.\n\nNot ordering from them again. Timing was fine. Estimated time was an hour (order was placed at 11:40ish) and it showed up as estimated.", "author": "Vicki T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-14", "description": "I ordered to go and it came quickly, but the food was mediocre. The noodles stuck together, and the rice dish had big chucks of carrots it in. I give them credit for having brown rice available.", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "Great neighborhood Thai restaurant with an excellent lunch special.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "Great food, good service, good price. We got the spicy chicken wings, duck curry, fried wantons, and pad see eww (drunken noodles) and everything was great. Would highly recommend to anyone wanting thai in sf.", "author": "Evan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-26", "description": "[M]ona: 3.5 Stars\n[W]ayne: 4.5 Stars\nAverage: 4 Stars\n \n+ Lunch Specials\n+ Inexpensive\n+ Accepts Credit Cards\n+ Very Clean\n+ Spacious\n\n+/- Quiet\n\n[W] We came here by accident I would say. We were actually planning to go to the lunch buffet at the India Clay Oven restaurant but we missed it by half an hour..........so I looked across the street, said \"babe you want Thai?\" she said yea sure and here we are haha. This place was surprisingly good and I'm glad we ate here. When we when in, we were greeted very nicely by the host and he let us sit down anywhere.\n \n[M] The restaurant is nice but very quiet even with the Thai music playing in the background. It was good though because we didn't have to talk over anyone's voice. Today we had the lunch specials which was a great deal for a lot of food. Wayne ordered the Spicy Basil and Veggie Eggrolls over rice http://www.yelp.com/biz_photos/5HoFK6YbKYjrVjeAp34puA?select=KKUUo8hLgKOhxtZnVKCPtQ while I had the Green Curry with Chicken Satay http://www.yelp.com/biz_photos/5HoFK6YbKYjrVjeAp34puA?select=Pok4Cg6E3-B_dEoBIttoDQ. Our lunch also comes with a side salad and salty and sour veggie soup http://www.yelp.com/biz_photos/5HoFK6YbKYjrVjeAp34puA?select=J7g-Y0mGBNoolhJ0ze5H0w which was pretty good also. \n \n[W] Other than the fact that the peanut sauce being too alcohol-ish, everything was really good. I really enjoyed my dish which was flavorful and saucy. The meat had a lot of sauce, which is a plus, and the eggrolls were fresh and crispy MMm MMmm. If I had a chance I will definitely eat here again. The server was really nice and the food was good. Again I'm glad we found a new spot to eat!", "author": "Mona C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-05", "description": "I have only been here once and it was not bad. I have had better thai food. I base how good thai food is by pad thai and then so on and so forth, just because pad thai is a main dish and you would surprised how different it can vary among restaurants. \n\nTheir pad thai was okay, it had some different tastes that I wasnt use to. I cant pin point it. I also had tried some of m friends yellow curry which was quite decent as well. I had the duck, it was nice and moist and thankfully not dry. My friend enjoyed her chicken satay.\n\nThe service here was good, it wasn't very busy, its small, which i believe most Thai restaurants are. I would come back to try more dishes and make another judgement.", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "I'm a flight nurse and try and find all the good Thai food next to our receiving hospitals on the way back.  This place was great!  Quick service, excellent food, and a free Thai tea with a check in.  Will be back next time we drop off at the VA :)", "author": "Luke S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-09", "description": "Got pad thai, cucumber salad, and steamed white rice delivered. Took 45ish minutes and my pad thai was hard and the noodles were stuck together. I was eating it in noodle chunks! It was also unlike any other pad thai I've had in that it was more chicken-tasting? Even though it was shrimp and tofu...but I guess it was okay. The cucumber salad was yummy!", "author": "Tania C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-28", "description": "The restaurant is attractive and the service is good. We had an OK lunch, nicely presented. Unfortunately, the kitchen radio was blaring the whole time. We were the only patrons in the restaurant and didn't feel like we could ask to have it turned off. \n\nLunch was unpleasant. Their food would have to be a whole lot better for us to go back again and put up with the noise.", "author": "James V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-30", "description": "This place is OK. Food is Ok. Service is OK. \n\nI would give this place 3 stars except it is pretty horrific that they charge for white rice for my lunch to-go order. My beef and string beans came with NO RICE. What kind of thai place serves lunch and gives you no rice!!??? Sorry. Definitely gonna try other options before stopping here to order my lunch.", "author": "Mai H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "This place is very consistent, very quick, family owned, and probably the best thai in the richmond (and I've tried a ton of them). I'm baffled as to why they aren't packed every night. Highly recommend.", "author": "Frankie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "Love this thai place. We ordered pad thai, green curry with veggies and brown rice, crab cakes and fried chicken. The green curry was amazing. I didn't know you could choice your spice level. I probably got the regular and it was so flavorful with a kick at the end. Everyone at our table loved it. The pad thai had a great sauce. Also, the cucumber salad served with the crab cakes is to die for. The dressing is fantastic. Will definitely be back. Fast service.", "author": "Anna M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-27", "description": "I first started ordering here a year ago for delivery and the food was AWESOME! But this last couple times I ordered food it was AWFUL!! I don't know what happened! I ordered the thai toast which i normally got before which was truly amazing and the last time it tasted like a rubber tire like burnt plastic or something, it was awful, I couldn't eat it!! So I thought maybe it was just a bad cook that day or something...tried again and got the wontons instead and they tasted exactly the same as the crappy thai toast I got before! Ugh, this food used to be amazing and now it sucks, I'm not even going to bother trying again. It's a shame!", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "FAST delivery. I have tried most other Thai in the area and so far this is all around the best. The spicy chicken wings come with 8 wings. The pic on eat24 is inaccurate. They are crispy but covered in spicy sweet-ish sauce. The spring rolls are five rolls with a nice light sweet-sour sauce. Liquid not sticky. Rolls are crispy and not oily compared to most other delivery rolls. I asked for several substitutions in my rice and curry orders and everything came just as I ordered. And the delivery guy was nice! I will be ordering from here again.", "author": "j s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-24", "description": "Service was great, but the food was not up to par. The soup that came with lunch was very sour. The grilled chicken was dry. I had many Tom yum noodle before and this place was by far the worst.", "author": "Vera W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-31", "description": "There are a lot of Thai places like Patpong in SF - a little bit above average, inexpensive food that will not change your life, but will leave you satisfied. Patpong is one I like a little more than the others, especially for delivery in the Richmond. Nearly every time I order from them, it comes so quickly it almost seems impossible. Friendly folks, too.", "author": "Matt C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-22", "description": "I love to come into the Richmond District at night as the thinning professional crowd coincides with the thickening waves of rolling fog coming from the ocean. Without much foot traffic, it gets particularly chilly walking in this neighborhood while others flock toward the Inner Richmond or other parts of San Francisco for a warmer cozy dinner. As a wealth seeker in the most unlikely places, I often go in the opposite direction from the places that bring in a crowd. This and an advice from my good friend B.B brought me here for an evening of Thai cuisine. There is nothing more comforting than to walk in and out of the cold with a warm ambiance and spicy food waiting to indulge my curious mind and empty stomach.\n\nThe restaurant was gorgeous. It had all the characteristics such as dim lighting, dark wooden floors, sleek tables, and nice dining sets with warm candle light to induce an exquisite intimate atmosphere. It reminded me of Wuong Luang Thai of Concord where everything in the backdrop had an aesthetic purpose. Sometimes I feel apprehensive about going into such a nice restaurant by myself but since there were only a few people it was easy for me to swoop in without causing an odd spectacle.\n\nContrary to what I might have expected from such a fancy restaurant where a table for one could render one's invisibility in the eyes of the servers, the two people who were there actually gave me a strong sense of belonging as they were highly attentive, warm, and knowledgeable. I was initially disappointed when they ran out of fried taro appetizer but instead my orders of fresh rolls ($6.95) and poh turn ($12.95) were a pleasant surprise. My pair of fresh rolls came with a mixture of cucumbers, bean sprouts, tofu, eggs, and mushrooms wrapped in fresh egg roll skin topped with tamarind sauce with a dab of real crab meat. With the wrappers served warm and fluffy, the taste of sprouts, mushrooms, and eggs really stood out while still submissive to the tamarind's sweet and savory accent. For the price I thought the crab meat was rather decorative and could be more elaborative and integral to the overall experience.\n\nWhile some restaurants hold back on its authenticity by succumbing to the mainstream palate, my poh turn arrived just the way I liked it: Spicy bodacious and yelpalicious. With strong lemon grass, kaffir lime leaves, galangale root, and chili peppers anchoring a good mixture of prawns, scallops, fish, calamari and mussels, this dish sizzled. While portions were small, this dish grappled with my imagination with its sharp, spicy, and sour flavors that was jaw dropping delicious. I loved to eat my Thai food with sticky rice ($2) and thought it was a decent complement to such a flavorful dish. \n\nTo further add to the experience, my cup of water was never empty and they were very attentive by making warm eye contacts with one arm folded to the back as a part of being great hostesses. They also surprised me in the end with a free pumpkin dessert with warm coconut milk to give my dinner the appropriate finish. In the end when I asked for a take out menu, instead of pointing to the stack at the door, the server went out of his way to bring me a copy. In terms of good customer service, this was one form of personalization that will keep bringing me back. \n\nBesides these strong attributes, I thought their prices could be lowered and portions could be more generous. Otherwise, this place deserves a very strong 4 stars for its wonderful unyielding flavors and unparalleled dining experience. I promised B.B. that I would come back for their spicy crispy chicken wings and hopefully by then they will also have the taro appetizers too.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-06", "description": "Eat here about once a week! Love the spring rolls, crispy chicken wings, green papaya salad, ginger tofu, cripsy garlic chicken over rice. Love it all!!!", "author": "Lady G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-05", "description": "Worst Thai food I've ever had. On top of that, we waited 2.5 hrs for delivery to come. I would never recommend this place.", "author": "Miranda B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-25", "description": "not what we expacted .. pumpkin curry..13$? Only two pumpkin and not even handful beef.. only lot of soup...and the favor is not good like the Thai restaurant I used to have... too sweet...and all in all I think I can make better myself at home ...... go to king of Thai!!", "author": "Roxy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-02", "description": "This is my first time doing a review here but I've been here before.. This time it was a let down.. The times before the food was good but this time it was far from good.. It was pretty plain and not worth even going back for..Tom Yum soup was inconsistent and not very good. Pad Sew Yew was good but the veggies in it weren't even cooked consistently.. Some where still raw while some were cooked just right. This time the food was a letdown.. I am sure I will not be back..seems like they have a hit or miss type of service.. Some days it will be a hit but this time it was a miss..your mileage may vary..", "author": "Kiel V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-16", "description": "I have been getting food from here for a while, the service is always very nice.the food was good in the beginning, but lately there's been a decline in the food. It's becoming very flavorless. We ordered from here the other night delivered , It got here fast and hot ,but it all taste the same.", "author": "Pat C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-17", "description": "This place wasn't all too bad when I stopped by here the other day with the boo!  It was much better sitting in the restaurant than it is delivered I can tell you this!  \n\nI ordered the pumpkin curry, which wasn't too bad.  It definitely could've been spicier in general, and it was just a tad bit bland, but not all bad at all! My boo ordered the prick king, which wasn't bad either, but it didn't taste as good as I tasted it last time at this restaurant though.  The food was barely average, but like I said, the delivery isn't very good though =/... maybe because the food already got too cold when it got to your place or what...?  I don't know. \n\n What at least sets things right is the service.  The lady who served us was friendly and helpful.  However, I don't think I'd be going back to this establishment because the food hasn't improved.  They have plenty of customers because they deliver so I think their business should be fine, but if you want some good Thai I suggest dining elsewhere if you're sitting in that is.", "author": "John H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-06", "description": "We stopped in to get some takeout right around the time that they'd closed for lunch, but the super friendly server told us it wouldn't be an issue. She sat us down, got us some water, and in just 15 minutes, we had to-go containers and utensils ready to go. Only issue was that by the time we got our food to the park, prepared to dig in, the sauces had nearly soaked through the bottom of the to-go containers and had turned all of the napkins into a soggy blob. It was a bit of a mess, so we kind of had to rush chowing it all down, eating out of the plastic bag it all came in. Bummer, but still tasty. My advice? Eat at the restaurant.", "author": "Stefanie J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-03", "description": "Heard some good reviews about this place in the past so I thought I would check it out.\n\nHas to be the worst experience I have ever had at the many restaurants I have ever been to. I ordered their veggie spring rolls and when I bit into my 2nd roll.......\n\nI BIT INTO A BOLT. YES A BOLT!!!!!\n\n I would have to say a 10m and about an inch long\n\nThe owner could not explain why and how it got in there. I got up and walked out. \n\nWill never go back!!", "author": "Jon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-07", "description": "I ate here with my boyfriend on our last day visiting San Francisco, the last weekend of May. We had the Shrimp Rolls, Thai Toast, Fisherman's Choice,  and the Pad Kee Mao (seafood combo), along with Thai iced teas. Everything was was really great, the seafood was nice and fresh and for Thai food (I love Thai food) it was super yummy. I also ordered a side of peanut sauce and they came out with basically a small cream dish filled with peanut sauce, it was awesome! It was also reasonably priced, I would totally recommend this place!", "author": "Melinda F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-01", "description": "We got in right when they opened at 5:30pm and they weren't excited to see us. \nThe spring rolls were overly peppery, unlike any spring rolls I've had.\nThe shrimp pad thai and cashew chicken was good.\n\nthai iced tea was yummy - and only 1.75 !\n\nWouldn't crave this food and they seemed much more excited to see us leave, we got a very nice goodbye from the staff. :)", "author": "Lora J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "I am a regular at Patpong and get take out from them all of the time. It's my go to, too tired to cook after a long day of work place in my neighborhood, and it always hits the spot! The women who work here are the best. They are just so sweet and kind. I always get the eggplant chicken, add green beans, with brown rice which is delicious, as is the fried sweet potatoes and all of the soups. Thank you for always being there like a dependable, comforting friend, Patpong!", "author": "Ben S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-16", "description": "For Thai food delivery, I normally go with King of Thai. Great taste, great portions and reasonably priced. But heck, Patpong is closer to our Outer Richmond address so I figured I'd send some business their way.\n\nOrdering was easy, they have their menu online and the descriptions are clear. Phone order was good so no problems there. Delivery was free so even better. I ordered 5 dishes - spring rolls, tom yum soup, Thai style fried rice with chicken, spicy basil duck and prawns with spring peas. A decent selection from the menu right? Well, when we got the food, it was a big disappointment. Who said the portions are huge? They must not have been talking about the delivery servings. For the price, since we got these puny portions, I thought maybe the quality and taste is worth it. WRONG. Nothing made my tastebuds go \"YUM\". Even the Tom Yum soup didn't do that and it has YUM in the name! King of Thai Noodle's Tom Yum soup has a lot more goodies in the soup like lemongrass and huge pieces of ginger so you know its real. Patpong's version made me wonder if it was yesterday's left overs.\n\nPatpong, we gave you a chance and you didn't deliver. Don't worry, when I walk by, I'll still wave through the window.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "This is a solid place for Thai food if you are in the neighborhood.  The food was very good: I had the pumpkin red curry and fish cakes.  I also tried the yellow curry and curry fried rice.  They were both good but nothings spectacular.  However the garlic calamari was amazing (from the specials board).  The breading was light and crispy (garlicy but not overwhelming so).  The calamari was in good sized pieces instead of rings and ooh so tender.\n\nIt was pretty empty when I went for lunch but there was a lot of delivery and carryout business.  Our server was very attentive and friendly.  The lunch specials were a great value and come with soup when you dine in. The plate presentation was simple but attractive.", "author": "Gwen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-23", "description": "Veggie Pad Thai for my friend here.\n\nThis is a great little place with an even better menu.  Lots of great appetizers as well as my favorite Papaya Salad.  They made it perfect, with thinly sliced papaya tossed in the classic sweet and tangy lime sauce with lots of chile peppers that made my lips fall off.  We warmed up with the Tom Yam, the hot and sour soup flavored with bits of lemongrass and red peppers.  The waitress kept hitting on my friend, who unfortunately, was gay, so I felt bad.  But she kept the food coming fast, and our last dishes were the Veggie Noodles with brown sauce and the Seafood Curry Sauce.  The noodles were my favorite thick wide rice noodles and the Seafood Curry brimming with shrimp.\n\nWe left, feeling a bit warmer and rounder to ward off the colder Sunset evening chill.", "author": "Miika M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-24", "description": "I don't know why other people are raving about this place.\nThe appetizers are good (and cheap), but everything else is average at best.\nAlso except for the appetizers (normal size), many of the entree food portions are relatively small considering the prices they charge.\n\nThere are too many other better restaurants nearby, so this place is usually empty.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "The dish that I use to judge/rate all Thai restaurants is Pad See Ew.\n\nTheir menu is quite extensive for such a small little restaurant.  There are dishes with chicken, seafood, beef, and vegetables, and they had Pad Thai, other noodles, and about 4 different types of fried rice, including Pineapple Fried Rice.\n\nTheir Pad See Ew ($7.50) was delicious; just the right amount of sweetness, and the noodles were tender and didn't stick together.  The portion is just enough - usually I have a hard time finishing the dish at other Thai restaurants, but this was perfect for me.  I wish the chicken wasn't in such large chunks, because they took away my knife I think when they brought me the dish, and so I couldn't cut up the chicken.\n\nHalf star off for the waitstaff having family members around and therefore not really paying attention to us (no one came by to see if we needed anything).  They gave us some sticky rice with custard dessert on the house, and that was really delicious as well.\n\nOverall 4.5 stars; definitely someplace I'd return to if I'm in the area.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-01", "description": "Small & cute dinning area.  I'd recommend this place to take a date for dinner if you don't want to get overly stuffed because the portions are way small (See pictures).  I've gotten more food for the same price at other Thai places I've gone to, but I guess you're paying for the ambiance. Plus, this place was just around the corner of where I live. \n\nMy friends and I all ordered some type of stir-fried noodles, and they were generous enough to let me have a bite so that I can rave about it on Yelp: \n\n-I shared the chicken Pad See Ewe (noodles with sweet soy sauce), which was just ok...sorta plain. Probably wouldn't order that again. \n\n-Another ordered the Crab Meat Pad Thai, which I liked because they used real crab meat and the lemony aftertaste left my taste buds dancing. \n\n-Another ordered the Pad Kee Mao (noodles with spicy sauce), but after a couple of bites it was unbearably spicy for her.  But nonetheless, it had more flavor than the Pad See Ewe.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-08", "description": "A couple of nights ago our workplace had a night event. My boss had completely forgotten that he was supposed to provide dinner, and was stuck in a meeting.\n\nI frantically looked through a bunch of delivery menus and cross checked them with yelp. \n\nPizza? No.\nChinese? No.\n\nThai? Hmm. yeah!\n\nWe ordered about $90 worth of fried rice (pineapple and thai style), noodle dishes (pad see ew: one veggie & one with beef. and pad thai)\n\n(A) The food came in about 40-ish minutes. \n\n (A++) The Pad see ew was THE BEST PAD SEE EW I've EVER had. When it comes to thai, I always get that plate. \n\nSometimes when you eat noodles, you can tell it was quickly prepared when you're shifting through the noodles and see some white parts of the noodles. Though Patpong's pad see ew, every noodle and piece of beef was well marinated and cooked. No white parts. No chewy feeling.\n\nAdditionally, nothing felt too salty, sugary or oily. Which is a risk you take when you order delivery.\n\nAll my co-workers also loved the pad see ew and the other dishes. We will definitely buy lunch/dinner here again!", "author": "Sophia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-31", "description": "I only had their Panang Curry with chicken and some shrimp + basil.  Both were really tasty and decently priced.  It's a bit of a small shop but has nice decor and partitions between each booth that aren't really all that partition-y.\n\nSide note: I did seem to get some sort of an allergic reaction, possibly nuts in the curry.  I asked before ordering and the waitress assured me there were none, still I got a mild reaction.\n\nTimes visited: 1", "author": "Amy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-30", "description": "Went here last night with a few friends. At first, we actually turned tail and walked away when we saw how empty the place was. Then we figured perhaps it was just too far away from the action and would be, as described by a local we met at the nearby Tee Off Bar, exceptional Thai food.\n\nAlas, it wasn't. The place smelled a bit dank and there were flies (at first just one, but then the lonely guy was joined by two family members, or were they just friends?) buzzing around our heads. At first it was amusing - trying to catch them in our hands. But then the novelty wore off and we realized it's just plain gross.\n\nThankfully we only ordered the onion pancakes (greasy as we'd predicted). At least their Singha beer was delicious and cold but the coup de grace was when one of the flies pulled a kamikaze dive bomb into my half-full (I'm an optimist) beer. That's actually the first time that's ever happened to me inside a restaurant and I didn't quite know how to react.\n\nI just felt sad. We left and went to a Japanese place down the street which also had a few flies but otherwise was quite good.\n\nI hope these guys get it together - these are little problems that can be solved and I believe their food might be quite good.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-05", "description": "This place is quite good and the delivery is smoking fast (I'm only 5 blocks away). Definitely order #7 (Sa-tay) and #32 (Pad See Ewe).\n\nThis rating/review is based on food taste/delivery only.\n\nFood: 4 stars\nDelivery: Speed: 5 stars (25 min on a Sunday evening)\nValue: 3 stars\nAverage: 4 stars\n\nI have been meaning to try this neighborhood Thai place for a year or so now and finally decided to order some delivery from there and was very glad I finally did so. \n\nI tried 3 dishes to get a feel for the restaurant:\n#7 Chicken Sa-tay: 5 stars! (this is one of the best I have ever had and the peanut sauce was mildly sweet but not crazy sweet like one reviewer said) - $7.95\n\n#32 Beef Noodles With Sweet Soy Sauce (Pad See Ewe): 4.5 stars. Really a great dish. I really liked the wide noodles and the taste of the dish was neither too sweet nor oily. - $7.50\n\n#48 Spicy Basil Pork (Gai Ka Pow): 3.75 stars. Good taste but very watery. Make sure you order rice on the side or try #28 with the rice mixed in (I haven't tried that one). #48 - $8.50\n\nI liked that the food was not too oily like some places but the Ka Pow was a bit on the watery side. I actually found the dishes to be pretty average in size (lower value than most Chinese food but comparable to most Thai places I guess). One dish is plenty for one person but don't expect lots of leftovers unless you fill up on rice.\n\nI found the food better than other Thai places in the area and I will definitely go back.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-17", "description": "Leaving the Legion of Honor two toddlers (niece & nephew) and three tried and cranky adults who were all very hungry and couldn't make up our minds on what to eat when we walked by this place and it just smelled awesome! We went crazy over the menu since everything sounded so good, I think we ended up ordering 7 dishes. Even my nephew who is a very picky eater ate! \nSince I live in Oakland I won't be able to go back as often as I would like, I know that I would make the trip out there again just for this place.", "author": "Kirsten C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-16", "description": "Boyfriend has never liked thai food before, which I think is a travesty, so I took it upon myself to change this. We wound up at Patpong after walking around the neighborhood, and the restaurant looked inviting enough so we went in.\n\nServers were nice. Unfortunately that's about where the good part stops. I ordered Tom Yum soup and spring rolls and the boyfriend ordered pad see ew from my recommendation. I've never had a Tom Yum quite so terrible before (and I've had A LOT of Tom Yum). There was no hot or spicy or sour or really any good flavors at all - honestly it just tasted warm and overpoweringly fishy. The pad see ew was decent, but very bland. I think the best part were the spring rolls. \n\nThoroughly unsatisfied, we left and decided to definitely not return. Boyfriend promises to give thai food one more shot before giving up, so I hope I pick a better place next time.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-31", "description": "Nothing to complain about here. Cute place, great service, right price point. Its never really busy so they wait on you hand and foot. Ive only been here a couple of times, but I have tried several dishes and they have all been fantastic. The most recent trip we ordered:\n\nThai iced teas (ahem 2 for myself) - 5 stars\nYellow Chicken Curry - 4 stars\nChicken Basil - 3.5 stars\nCucumber salad - 4 stars (you cant really mess this up)\nThai 'french fries' - 4 stars\n\nSeems like some people have issues with some of the food here, but most of what they ordered is actually Chinese. I don't know why Patpong is kidding themselves like that - stick to the Thai people!", "author": "Holl T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "My go to choice for thai delivery in the Richmond district.  Delivery is generally 45 minutes, but if you'd rather eat in the restaurant, the staff is very friendly and quick about taking orders and refilling drinks.  Recommended for a quiet sit down lunch or dinner experience (with the periodic phone calls from folks calling for delivery).  The coconut based soups and entrees are delicious for my vegetarian and meat eating friends alike.  My favorite dish is the ginger chicken.", "author": "Desiree C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "We came by here at lunch time, we really enjoyed the tasty meal. The place is cute, decent and clean. I highly recommend this place.", "author": "Sam A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-07", "description": "We came here craving some Thai, and left pretty satisfied and full. \n\nThe menu is fairly large here, allowing for a lot to choose from for those who might be adventurous and want to explore. In our case, we opted for the Spicy Basil Chicken, Chicken Pad Thai and a side order of rice. What we hadn't anticipated was that the portions were going to be large... especially the rice, which turned out to be a regular tub of it. Not only are the portions big, though, but they are also inexpensive and good.  That's a winning combo. The only downside is that the kitchen is nearly out in the open (hardly covered at all) and can get a little distracting with chatter during a meal, but that's a real small complaint.\n\nAll in all, this place was probably one of the better Thai restaurants we have been to. It gets a solid recommendation in the end.", "author": "Sami R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-13", "description": "My friend and I originally wanted Sushi, but we forgot that most sushi restaurants don't open (again) until 5 pm, so there was a choice between Thai food (here) or Indian food across the street. Obviously, we picked Thai food.\n\nThe decoration of the place was nice. I thought it was interesting that my friend was stating that the decor reminded her of her grandparent's house because of the statues and whatnot. \n\nAnyway, the place was pretty empty when we came in. There as probably two other guest there besides us, whom btw showed why too much PDA inside a thai restaurant. However, we were too hungry to really care.\n\nWe both ended up getting the Lunch special, pretty sweet deal if you ask me. I got the Spicy Basil with Fried Tofu lunch special. My friend and I both thought the soup was way too salty and sour. My spicy basil wasn't really spicy, and that too was salty. However, the thai iced tea was good.\n\nThe service here was good nothing to complain about. The girl was friendly, attentive and quick. \n\nThis place wouldn't come to mind when I think of Thai food, so I wouldn't come back unless my luck with sushi failed me again.", "author": "Tina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-23", "description": "WINGS!!!! I am addicted to these wings.  on tuesday I ordered [delivery] one order [10 wings] of the wings.  They are topped with crispy basil, crispy skin to perfection, and sauced just enough.  So the following day, wednesday, I ordered two orders.  I ate all of them and i cant stop thinking about them. YUMMMMMMMMMMMM!", "author": "Mylea G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-05", "description": "They deliver to my far out neck of the woods, which makes me happy.\n\nWe always order the same thing: chicken pad seew and ginger tofu - it's not overpriced, it's not greasy, & the flavor is good.  It's an awesome change to all the worse-than-mediocre chinese delivery places around  (n fact, if you read this, & you live in the hood, & know of a kickass chinese place that delivers, let me know. Also, if you know of a place that makes kickass american-style chinese, let me know, because sometimes that's just exactly what I want.)", "author": "Robyn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-30", "description": "We had the Papaya salad with prawns.  Very nice.  I'm a big fan of papaya salad and this one was pretty tasty. Then had an order of fresh rolls.  They were fine.  Large portions!\nFinished with Three buddies Pad.  Another tasty dish.  Like this place a lot.", "author": "Scott K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-14", "description": "I'm a big fan of Patpong.  I've actually never eaten at the restaurant but I've ordered delivery from there SEVERAL times.  They are always really quick too (about 30 minutes tops).\n \nI get the yellow curry with chicken pretty much every time because I love it.  I get full easily so I always have leftovers for lunch.  The flavor in the curry I think is really good.\n\nMy boyfriend gets the spicy noodles with beef or the spicy basil duck and really likes it.\n\nI wish they had corn cakes but an appetizer but I really enjoy their \"Green onion pancakes.\" I put that in quotations because it's not your typical green onion pancakes. They're more light and flaky and I think it's super good! (Do not go into it think they're like normal green onion pancakes though).\n\nI also really like the Thai Iced Tea but I've never had too many bad iced teas in general. \n\nI would definitely recommend ordering from here!", "author": "Anjali P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-04", "description": "Patpong Thai Restaurant...What can I say? You clearly haven't grasped the concept of delivery and it shows. Last year, my office ordered Patpong for our holiday party. Patpong is conveniently located new our office in the outer Richmond, so we thought it was the perfect fit. Placing the order with the restaurant was quite simple, but actually getting our food was another story. We ordered about $300 worth of food for a party of 20 to be delivered at noon. Not a huge order, but substantial enough that I thought it would be given proper attention. I called in the morning to verify the order and the noon delivery time and was told everything would be delivered on time. Noon rolls by and no food. I wait another 15 minutes and no food, so I decide to call. The owner tells me that driver is out for delivery and should arrive any second and sorry for the delay. So we wait.....party begins at 12:30pm, but still no food. So I call the owner again, he explains the driver can't find the building....my response was, \"Really? The driver can't find the main entrance to the VA hospital?\" In response, I got a bunch of excuses. So I hang up and wait. Another 15 minutes rolls by and still no food. I call the owner again and ask him to call his driver. (At this time, I am beginning to become agitated). He says, \"Oh I tried, but the driver dropped his phone in his car and can't find it.\" I respond that how could he possibly know this if he hasn't been able to reach him. Silence on the other end. I get a bunch more excuses and finally I say to him, \"I am not hanging up until the food arrives.\" So we sit on the phone for 10 minutes in silence. Finally, I see the driver's car and have a fellow colleague run out and grab him. To my shock the driver steps out of the car in his pajamas with a cigarette hanging out of his mouth and a half-dressed girl in the front seat. The driver doesn't even offer to help bring the food into the building and just sets it on the trunk of his car and waits until we make multiple trips to bring it in. Sadly, he also delivered our curry in the pot it was cooked in, no plastic serving bowl that we were promised and paid for. \n\nI must say, Patpong is the worst delivery in San Francisco. Their blatant disregard for customers and ability to lie is deplorable. I will never order from Patpong again, nor would I recommend it to anyone who wants their food actually delivered. The food is average anyway, so you aren't really missing anything. Try Another Monkey in the Mission, if you want good quality Thai in San Francisco.", "author": "Alice S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-10", "description": "This is my go to place for thai!  I love the food and the thai iced tea.  You can't go wrong with their yellow curry.", "author": "Joanzie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-06", "description": "Must put in an excellent word for this gem of a Thai restaurant.  Food is outstanding, well priced and they have tremendous variety.  They can adjust spiciness to your liking and strive to please.  With deliver,y food always arrives hot.\n\nVery impressive and worth a try!", "author": "Jerome B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-10", "description": "After figuring out that Patpong had merged with Samila and that the location was not on Geary, we decided to walk the extra distance to the Clement location. There was one couple eating when we arrived and they completed their meal before our dinner arrived. During our meal a couple folks arrived to get take-out. The staff was attentive and pleasant. The decor was pleasing. We ordered the vegetable Tom Ka soup, brown rice, Ginger Salmon and a noodle dish. The food was prepared and served quickly. The spices were interesting though not remarkable. The homemade noodles were tasty though cooked just a minute or two too long (the peanut sauce was tasty).  The portions were more than sufficient for the two of us making for a reasonably priced dinner out.  All in all an average Thai meal.", "author": "David O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-22", "description": "Patpong is one of my favorite Thai restaurants. Their staff is super friendly, food is always fresh and when ordering delivery it comes within 20 minutes of ordering. I recently moved out of the city and cant wait to make a trip into the city just so I can eat here again. Chicken pad thai and chicken thai fried rice are so yummy!", "author": "Sharyce A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-13", "description": "I've read a lot about Patpong's and could not wait to try it out.  I was disappointed with some of the dishes on my first visit.  I will rate this first visit 3 1/2 stars.  We have ordered these dishes...\n\n*Garlic fried calamari - hmmm, not want I expected.  I didn't taste much garlic and thought this dish was a little bland and greasy.\n\n**Pad Thai with chicken, thin rice noodles stir-fried with fried tofu, egg, bean sprouts and green onions with crushed peanuts on the side.  This is Pad Thai on the wet side, not dry fried as expected.\n\n***Red curry beef, pumpkin, bell pepper, green bean served with rice, Served with cucumber salad topped with crushed peanuts on the side, and fish cake appetizer.  Tasty flavor\n\n****Spicy, crispy fried chicken wings - Crispy chicken wings marinated with spicy Patpong sauce, topped with crispy basil.  Great flavor but is greasy when delivered to our table.  It would be nice if they could mop up the fresh grease after taking out of the oil.\n\nThe good: The Thai decor is a nice simple contemporary. \n\nThe bad:  The deep fried dishes are greasy.  Maybe, a few minutes in the oven or mopping the grease with paper towels would do the trick.", "author": "Nanette L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-09", "description": "Originally i wanted to go to Bai Som but it was closed so we continued further down the street and tried this Thai restaurant.  It was good, but I prefer Bai Som.\nSmall restaurant, cute, simply decorated, clean.\nthe person i was with doesn't like spicy, so we ordered non-spicy dishes.  They were a little bland.\nStuffed Chicken Wings - after ordering them, we were told they were out of them.   \nThai Style Fried Rice - good but fairly standard.\nCrab Meat Pad Thai - good, but it seemed the crab was just put on top... not marinated and not a lot of flavor.\nBasil Duck - meat was tender and cooked well, but really not much flavor.\nOverall I'd say the dishes were good, but weren't very unique or flavorful.", "author": "Nedra D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-09", "description": "My car broke down in San Francisco on Memorial Day, and my boyfriend and I were stranded. The one car shop that was open that day (Clement Street Auto Garage - I'm reviewing that next) was down the street, and we were looking to find some place to eat while the shop ran some diagnostics. Having stayed in the city for 3 nights, we still hadn't eaten any Thai cuisine, so we decided to eat at the tiniest Thai place we could find, something that looked family owned. We found Patpong Thai.\n\nThe decor is nice, the server was friendly, and the food came out pretty quickly.\n\nThe lunch specials are a great price! You get soup, a little salad, an appetizer, and your entree with rice for about $7-9.\n\nI got the vegetable red curry with the fried wonton appetizer.\nThe soup was okay, but I've never had Thai soup, so I have nothing to compare it to. The fried wontons were pretty good, as was the dipping sauce. The peanut salad dressing was deliscious (though it cracks me up how the unhealthy dressing totally cancels out the very little nutrition that is in that type of \"salad\"). The red curry was very good (though I prefer it a little spicier; I guess I should have asked for green?), and the rice was the perfect texture.\n\nMy boyfriend got the chicken? pad thai. I don't like noodles/pasta in general, but I could have stolen a heck of a lot more bites from him, than I did. It was REEEALLLY good. Again, I didn't have any former experience of pad thai to compare it to, but I don't like noodles and these were fantastic! Perfect amount of cabbage and carrots and crunchy peanuts and all that good stuff. He seemed pretty pleased as well, but we were both exhausted from our trip and our 2 mile hilly trek from my car (not to the restaurant, but earlier in the day), so he didn't say too much. \n\nThe exhaustion brought him to order a Thai iced coffee. He seemed quite pleased with that as well. I only had 2 sips because coffee puts my stomach in knots, but it tasted pretty good. I'm not a fan of sweet stuff, but it was creamy enough to counter the sugar. Again, I had no prior experience with Thai iced coffee with which to compare it.\n\nAll in all, Patpong didn't completely blow my mind, but it was good enough to take my mind off the fact that my car was broken and we were stranded for who knows how long with nowhere to stay in a still unfamiliar city.....\n\nThis is one of a bagillion reviews that I'm posting from my San Francisco Birthday 2010 trip. Check 'em out!", "author": "Kate C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-04", "description": "I have been to Patpong for lunch many times, and find the food consistent, flavorful, and the portions generous.  It is my favorite Thai I have tried within SF, and I have probably tried about a dozen others.  \nI strongly suggest the pad kee moa, pumpkin curry, and veggie spring rolls.  I think what sets them apart from the other Thai restaurants is the quality and freshness of the ingredients.  She food is always served piping hot because the servers are attentive.    \nThe lunch combinations are an incredible bargain.  My only suggestions for them would be to update the wine menu.", "author": "Carla K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-21", "description": "I stopped in for lunch, and the menu was very small.  I was hoping for a bigger selection.  I went with the lunch combo- 1 appetizer, one entree, and soup and salad for $7.95.  Sounds like a great deal, but needless to say everything was tiny.  The food was just no good.  It wasn't horribly offensive, but I probably could have made it better.\n\nWhat really turned me off though, was the server.  He was wearing converse, which he wore more like clogs so he could slip his feet in and out in a hurry I suppose.  He scuffed and dragged his feet all around the dining room.  He also wore his hair in a dramatic bob, which was constantly in his face.  There were too many little service problems for me to list them all, but the icing on the cake was when he put the check down, went to drop off another check, and then came back immediately to pick up the check.  I was still eating!  I just looked at him and said I wasn't done yet, and he scuffed off.\n\nWith Bai Som a few blocks away, I won't be back.", "author": "Theresa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-11", "description": "The smell when you first walk into this place is very pungent.  Smells like sewer water.  Can't figure out what it is neither.  hmmmmm????  I came here a few times prior and wanted to order enough food so that I can give an accurate assessment of this restaurant.\n\nThe staff is very friendly.\n\nGarlic Rice with Chicken (this dish really stands out)\nspicy basil tofu\npad thai\ncurry duck \nminced pork with basil\n\nAll very mediocre.  You can probably get better food at Chabaa, Marnee Thai(although I boycotted them), Osha thai on Geary, or Thai Spice.\n\nPrice is average for thai food.", "author": "jason g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-09", "description": "Love this place. When I first rolled in, I was a bit skeptical because the exterior was so so. But the interior is surprisingly clean and nice.\n\nEverything I've had there has been good at a very good price. The duck, the noodles, and anything else I can remember has been good.\n\nNormally I'd give 4 stars, but they do have good prices, so I think it warrants a fifth star.", "author": "Al L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-09", "description": "Me and my buddy were walking down Clement and their widow menu caught our eye. Very reasonable price for their luncheon specials. So we went in and wre greeted by a friendly young lady with a beautiful smile. I ordered the red chicken curry and chicken satay(2) for my special. It was really tasty with good size portions. I will definatly be going back. My buddy will be writing his own review.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-07", "description": "Great food\nGreat price\nUngodly wicked fast delivery\nI am a believer", "author": "matt l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-01", "description": "Phucket.\n\nMe, \" How do you say it?\"\n\nmy #1 son, \" Just FXXX'n' say it dad, I know what you thinking.\"\n\nMe, \" No, no, not that, I know that. but really, how?\"\n\nmy #2 son, \"Phuck it dad, just phuck it,\" \n\nmy #1 son, \"shut it, waitress is coming.\"\n\nWaitress,\"Have you decide?\"\n\nSo, we ordered:\nGreen onion pan cakes.\nPapaya salad.\nveggie green curry, we ordered extra spicy! \nspicy basil tofu.\nvege noodle,\n2-garlic rice.\n1-brown rice.\n\nmy both sons loved the Young Coconut juice.\nUgh!\nI didn't like the juice!\nBut everything else was really GOOD!\nSpicy Good!\nThe waitress was really nice.\nThe bathroom was a bit skanky, I looked for a light but the sign says out side that inside of the door after I found the switch out side.\n\nmy #2 son, \" So, hows your Phucket?\"\n\nme, \" Oh, this shit is pretty good. I like it.\"\n\nmy #2 son, \" Phuckin A,\"\n\nIt's a thai beer. I like Shingha too but I couldn't help try the PHUCKET.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "Food was fresh and tasty.  Nice cozy atmosphere.  Friendly service.  Really inexpensive for the quality!!  I would return again.", "author": "Forest H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-19", "description": "They only gave me half a carton of the Tom Gah Kai (better known as chicken-coconut-mushroom soup-crack which fuels my life.)  HALF a carton.\n\n: /\n\nIt was delicious and it made me sad that there was not more of it.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-17", "description": "Came here for dinner one night and it instantly became a favorite.  Service is usually fast and always friendly.\n\nPad Kee Mao (spicy noodles):\nAmazing.  Spicy enough to make your nose water yet not spicy enough to where you can no longer taste the food.  They use green beans, tomatoes, and bell peppers as the vegatables along with the spicy basil leaves and your choices of chicken,pork,beef.\n\nHoney Roasted Duck:\nThe duck is almost tender.  It is the best duck I have ever had.  The sauce they put on it is sweet and compliments the duck well.\n\nTheir fried banana dessert is something you must try if you have never had it before.  The fried banana part is longer than at most Thai restaurants, it looks like they took a banana and cut it in half and then fried it, instead of being in small fried balls.  The batter they use is light.  The two pieces of banana are served with a scoop of coconut ice cream.  When it comes out they draw a happy face on the ice cream.\n\nThe best Thai I have ever had in the city.", "author": "Brooke R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-11", "description": "Wow, lots of unhappy customers, but I have had nothing but good food and service the two times I have been to Patpong.  I might not travel across town for it, but I have sampled eight or ten things on the menu and would eat any of them again.\n\nThis place is special because it is quiet.  There isn't anything else special come to think of it, but I definitely would be happy to eat there again.  Great appetizers and a very accommodating staff.", "author": "Quinn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-12", "description": "Been to this place many times for quick lunch. Big fan of green curry. Fresh ingredients and good quality. This is my local favorite Thai food place", "author": "Dhiren P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-23", "description": "I have been a customer of Patpong for quite some time.  Recently, I took a former employee of mine here for lunch.  We had the Fried Tofu and Chicken Satay as appetizers and the Chicken Spicy Basil and the Chicken Green Curry as entrees.  For their lunch specials,  you get an appetizer, entree, soup, salad and rice.  We each liked our meals and the price was right.\n\nFor dinner, some of my favorite appetizers are Chicken or Beef Satay, the Fish Cakes, and the Fried Tofu.  My favorite soup is Tom Khar Gai (coconut soup with chicken).  For the entrees, my favorites are veggie Pad Thai, Spicy Basil Chicken and the Panang Curry.\n\nI have a soft spot for their Panang Curry.  I have tried that dish at half a dozen different Thai restaurants and Patpong always does it the best.  I consider myself a meat eater, but I will order the Panang Curry vegetarian as a good change of pace for my palate.  It is a great treat.\n\nI am a big fan of Patpong.  I have seen some of the reviews on the chairs being uncomfortable.  Unfortunately, I have to join the other Yelpers in this regard.  The chairs were there from the previous restaurant before Patpong took over the space.  But overall, Patpong is great food nonetheless!", "author": "Janet H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-30", "description": "EDIT 01/16/08:  I've been here a couple times in the past month after having not been here for nearly two years.  I knocked them down a star (to four), because I've been to soooo many more Thai places to know that they probably aren't five star worthy.  BUT, they're still good and reliable--a place I can count on when I crave that fried deliciousness that are sweet potatoes.  \n\n--------------\n\nThere's seriously at least one Thai restaurant on every block on Clement; if one's closed, another's sure to be open just down the street.  What's nice about Patpong is that they're open from morning to night--none of these lil siesta type deals where they have to close between lunch and dinner.  If I roll out of bed at 3 p.m., I wanna know that I can get some decent Thai food in my stomach by 4 p.m.  The food is very good.  (Try the fried sweet potatoes.)  The portions are generous, and the waitstaff was attentive.  My only complaint is that if they continue to play boy-band music over the speakers while patrons are eating, I'm going to have all of the food that went into my stomach out by 5 p.m.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-01", "description": "the food is pretty good here, decent sized portions, but the service isn't very attentive- the beer comes after the food, appetizers served with the main course, not before.\nThe noodle dishes are really good, soups great, salads would be better if they didn't use plain iceberg lettuce.\nOverall, good, decent Thai at a fair price, with bigger portions than bai som down the street.", "author": "Ali M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-07", "description": "I've driven by this place a few times and have been meaning to try it for a while.   The dreary day out today made me want the yummy goodness that is my comfort food aka Thai.  Ben got the yellow curry, extra spicy with chicken and I stuck with old faithful, the pad see ew with shrimp.  The curry apparently was seasoned with dried chili flakes rather than chili oil, which was different but good.  It was almost like the aroma of the sauce was where you picked up the spiciness, so that when you inhaled you tasted the spicy, rather than instantly when you put the food on your tongue.  The sauce on the pad see ew was really, really rich, sweet and kind of syrup-y.  Ben really liked it, said it's probably his favorite pad see ew of all the Thai places we've tried.  I liked it, but I'm not running out the door to print a t-shirt telling the world how great it was.  Portions were perfect, not huge but not too small either.  \n\nThis place is pretty small inside and unfortunately due to the fact that it has wood floors, wood on the walls and basically seems like it's trying to break some record for acoustics inside a restaurant, we had to listen to the girls across the room talk about their myspace drama.  Oh dear, the world will surely end if Johnny doesn't friend request Suzie.  Other than that the decor was nice, there was soft music playing the background and it had a generally calm, relaxed feel.  Service was good, although like with many other Thai places I've been to, my food and his rice came out about 3-5 minutes before his curry came out.  Awkward.\n\nWith rice to go with the curry it came to $17.  I say it goes on the Good for 2 under $20 list.", "author": "Courtney N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-24", "description": "Ok, I might be a little biased here because I live above Patpong... but I'm going to post this anyway.\n\nService: SUPER friendly. If your take out order is not ready, they will seat you and bring you fresh tea as you wait.\nPrice: Eh, a little over priced, but it's a quality place, so I can't complain.\nFood: Yum! Opt for the yellow coconut curry and rice. HOLY MOLY it's so delicious. OH! And the Thai tea is delicious too!\nLocation: Smack dab in the nicer part of the Clement.", "author": "Amy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-08", "description": "I've converted...to the altar of curry! I was never a big fan of curry...must be cause when I've eaten homemade curry before and I'm always left with yellow greasy teeth.\n\nLinda L. and I ordered the usual Pineapple fried rice and the green curry seafood combination vegetable dish. Usually when I get the fried rice, it's usually served in a pineapple half bowl. But I was surprised with the square plating. The fried rice was all right, but mix in with the green curry sauce, was the bomb! Curry with pineapples and raisins...who'd have thunk it.  I could have licked from the curry bowl...except I was in public (sigh). Both servings were appropriately sized, not too much to feel obese, but not to skimpy to feel like I was ripped off.\n\nService was brisk and our lime water was always filled.  Nice decor, pretty candles, the chairs looked like they belonged in a school auditorium...but overall, I had a good experience.", "author": "Pauline L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-12", "description": "Despite what others are saying, I always thought Patpong's prices were pretty reasonable, ney, cheap. While the restaurant is small, it is very nice inside and the food is always very good. \n\nIt's definitely an all-around better dining experience for about the same price as you would pay at the King of Thai up the street.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "A little, unassuming place, but my favorite restaurant in all of San Francisco.  Always great food and friendly staff.  I could eat there every day.", "author": "Timmy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-16", "description": "I miss you Patpong! I used to live one block away and would order delivery about once every 2 weeks. \n\nI love their crispy shrimp rolls. I always ask for extra sauce and then pour it on my pad thai. yummmm. \n\nMy usual order:\nChicken Pad Thai\nCrispy Shrimp Rolls with extra sauce\nChicken Pad See Ewe (YUM!)\nGreen Curry\n\nI've eaten at the restaurant a few times and always had a quiet, pleasurable time. Sometimes I even picked food up here! Talk about not being lazy! :P\n\nDelivery is pretty fast (maybe cause I lived really close) and you can pay with credit card for delivery and add the tip when they come. I like that. I rarely carry cash, so this was always convenient.", "author": "Ali R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-10", "description": "Actually, I wanna give them 3.5 stars.  Came here for lunch with my boyfriend.  I'm supposed to be a vegetarian for the next couple of weeks so I figured Thai food would be nice.  Being super loving, my boyfriend agreed to let me do the ordering so we got the lunch combo with Veggie Red Curry and Veggie Egg Rolls (came with soup, salad and rice) and a Pad Kee Mao with Tofu.  I was kind of upset that they didn't bother to tell us that the soup was cooked with chicken broth even though we ordered everything vegetarian...%#*&@!!!  Anyway, the red curry was mediocre and didn't have many veggies in there...just lots of tofu.  Loved the pad kee mao though.\n\nI've eaten here/ordered take-out about a dozen times from here before and I like that I can always count on them to make a nice and spicy pad kee mao.  Their portions are kind of small but I'm okay with it because Thai food is so fattening anyway.  Overall pretty good Thai food.", "author": "Katelynn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-14", "description": "Delicious food. Their green curry is to die for.\nFANTASTIC service!\nYou absolutely need to order the young coconut juice at the end of your meal... I plan on going there at least once a week for it!", "author": "Chelsea H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-06", "description": "When my favorite Thai delivery joint closed, I almost cried - and then the delivery guy consoled me and whispered, \"Here's where I'll be working,\" as he slipped me a new menu. I've been hooked ever since.\n\nAll the usual haunts like delicious, mild yellow chicken curry are on the menu - as well as some unexpected (at least to me) delights like cashew nut chicken (unique taste unlike your standard Chinese variety). I'm always pleased by their prompt delivery (every time they tell me 45 minutes, it's more like 25 or 30) and really nice service - and it's hard to exhibit stand-out service in delivery.\n\nMaybe one day I'll actually go into the restaurant - but for now, I'm just loving my drive-up dinner.", "author": "Kiesha R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-08", "description": "I've been meaning to do this for a while. I haven't been back to Patpong in many months. I don't know if they changed ownership or what, but I feel seriously betrayed. The last two times I went here were bad.  I'm sorry Patpong. I used to love you, but I can't in good conscience  leave you with that 5-star rating.\n\nBoth times there was a huge table full of people with uncontrolled, unruly kids running around making a lot of noise and playing with toys all over the floor. I guess they are the family and friends of the owners because they seem to always be there.  I don't have a problem with kids being kids, but the screaming... it's a bit too much.\n\nThere was a new waiter there who is not good.  All the times I'd gone before, I was served by a very courteous and kind waitress.  This guy is crap in comparison. Like I said, it's been months since I went back because of this guy, so I actually have no idea if he still works there. Hopefully he's been fired so I can give Patpong back one star.\n\nThis was when I decided I would not be coming back. I ordered the Pad See Ewe with beef.  It arrived with chicken. Okay, no big deal. I decided to just eat it instead of make a complaint.  Then, when I was about halfway through the dish, I feel...something in my mouth.  I spit it out and it is a piece of eggshell. Gross!  I forked through the dish some more and discovered another HUGE cracked up piece of eggshell. It was like 1/4 of the shell, and I wonder how the hell someone could miss this?\n\nSo I called this bumbling waiter over and pointed it out to him, and all the while I'm talking he has this huge grin on his face. WTF!  You're supposed to be apologetic and nod sympathetically, not grin at me! \n\nTo be fair, shortly after he took the dish away, one of the female waitresses stopped by our table to say they were very sorry. I got a replacement meal to-go. This time it had beef and no eggshells.  They may still be a decent carry out choice, but I wouldn't eat in again until they get rid of that waiter and the crazy kid family.", "author": "Megan Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-31", "description": "We had the pad thai, pad see ew, larb, and red curry. The food was OK. I really liked the larb and pad see ew especially. The pad thai was very average. However, something happened that took away one star for me.\n\nWe ordered for delivery, and it came about an hour later as promised. The total amount was 28.40, so we decided to give $34 even, which is a fairly decent tip if I do say so myself. :P The kid who delivered the food didn't even count the money and left. Two hours later, we received an angry phone call from him! I can't believe he had the audacity to do that!!! He claimed we didn't give him any tip!! We reminded him that we gave him $34 for a $28.40 meal, and he apologized and quickly hung up. I am tempted to call back and ask for my tip back, because I didn't give a generous tip to be yelled at...\n\nAnyway, don't take deliveries from this place. Grr.", "author": "Bekki J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-24", "description": "I'm Thai, I understand Thai but I didn't speak any Thai while ordering here. I was born and raised in the United States. So I didn't have a Thai accent when ordering either. We were the only guests in the restaurant around 5pm. There was a little kid that belong to one of the workers on his heelies and falling ever so often saying SHIT. Keep in mind this is a little kid, about 7-8 years old saying SHIT every 2 minutes.\n\nThe food came, I'd have to say it's okay. I guess being Thai, all this stuff I can get from my mother. But nothing really astounded my taste buds. \n\nWhat irked me the most was the SERVICE!!! We had to come across one of the bitchest servers there. On the menu it says Desserts \"special daily\" and nothing else, therefore you assume to ask the wait/ress So I asked the male waiter when he came by. He said he had to ask the other waitress (bitch). Now their conversation happens in Thai. He askes, he comes back and tells us. We didn't feel like eating Fried Banana and Ice Cream and he goes back to get our check. She says with a Thai valley girl accent (yes, it's possible) \"Do they want it?!\" he says \"No, they didn't feel like it.\"  Then she gives more attitude to it and says \"REALLY!?\" We sat about 10 ft away so I could hear everything. Like it was rude of us, to ask what the daily dessert was and not to wanting to get it. \n\nI only came here cause I got 4% back cause of Upromise. But considering the service I won't go back.\n\nMaybe it's just me, but if you don't understand any Thai, go ahead. But Now you'll assume their going to be talking crap about you. ^_^", "author": "Kimberly S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-08", "description": "Really good thai. dont get the wantons. the egg roles are good though.\n\nI love curry and I got the panang curry. it was great and was actually spicy which is rare.", "author": "Will U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-18", "description": "Great Thai food delivery.\n\nFood tastes fresh and clean.", "author": "Veronica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-22", "description": "We were seeking an inexpensive lunch in the neighborhood and ran across Patpong's lunch special. Soup, an appetizer and a rice plate for $7.95. A great value!\n\nThe space itself is pleasant - not a warm and cozy spot, but fairly attractive, with bare floors and granite tables. It took me a minute or two to warm up. \n\nThe waitress brought us a bowl of tangy hot broth with a nice balance of sweet and hot. For my appetizer, I ordered the spring rolls and my girlfriend ordered the chicken satay. Both were excellent - the chicken had some serious love applied to it prior to grilling and the satay sauce was the right combination of sweet peanutiness.\n\nThe cool environment propelled me towards a curry. I had the chicken green curry, which was rich and spicy. The bowl had generous amounts of chicken (breast meat) and veggies.  My girlfriend ordered the red curry with pork. Both curries were well done with a satisfying amount of spice and flavor.\n\nUpon leaving, we were ecstatic to see that not only was the food great, but they deliver locally, too! \n\nI'm looking forward to trying some of their other dishes, if I can tear myself away from the curry section of the menu. I'm a big fan of the Thai House (Express) in the Castro and this is definitely of that caliber.", "author": "Libby S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-10", "description": "came in on a weekday. at like 3:30. We are the only table.There is just two of us.\n\n The Menu has so much, it took us surprising amount of time to choose. We finally did, Our Waitress was very nice but our food came out at different times. I dont mean like a few minutes. It was close to 10 minutes apart. \n\ndid i mention there is just 2 of us in the restaurant? Although that kinda bothered me at the time. I must say the wait was worth it because I thought the food was extremly good. Very spicy. Which made it even better (for me) \n\nI would give it 5 stars for the food.\nbut the enviroment was just so awkward, and silent and the staff stared at us while we ate ( because we were the only ones in there)\n\nI will order \"to go\" next time.", "author": "Joy I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-21", "description": "this is my favorite thai place!\nthe thai tea here is the best i have ever had!\nthe green curry with chicken is good, even though it had coconut milk in it, its not overpowering like other places.\nthe spicy crispy chicken wings are so good, i tihnk they are better than san tungs wings. \nthe green onion pancakes are also good, as well as the calamari.\n\nand this place isnt too pricy, so its affordable to come!", "author": "Stella J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-21", "description": "EDIT: 8/29/07\n\nKnockin' one star off because I got the pad woon sen yesterday and there were no veggies in my noodles whatsoever (besides green onion and regular onion).  I love picking at the carrots and napa cabbage!  It tasted good but without the veggies and the semi smaller portion I'm not as impressed...\n______________________________________________________\nThe Pad Woon Sen (Silver Noodles with Veggies+Meat) is pretty frickin' awesome here!  I haven't dined in before, but the times I got it to-go were quick and easy.  Prices are fairly reasonable.  The people here are friendly and nice.  \n\nLocated around 25th and Clement... so pick an order up and head to either Baker or Ocean Beach to eat tummy Thai food and enjoy a spectacular view! =D", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-12", "description": "Hey, there are some days when you just want to put the uglies on and have food delivered.  This place is great - I get delivery in half and hour and their chicken larb is yum.  Don't ask them to make it spicy because it is crazy spicy; as in local eaterie in Thailand spicy...  or have I just become a woss (sp?).\n\nAnyway, give it a go - I have not been disappointed.", "author": "Mei B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-06", "description": "I love this place!  They have the nicest servers and a great atmosphere.  The restaurant is kept clean and has a calming ambiance.  Their apps are fantastic - try the fresh rolls or the fried spring rolls.  For dinner, their garlic chicken is awesome, as well as the green curry and the ginger beef or chicken.\n\nDelivery is typically around 30-45 minutes and comes still piping hot and intact (don't you hate it when delivery food slops all over the container?)\n\nTry this place and you won't be disappointed.", "author": "Jennifer U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "This place is great for dining in and they deliver takeout orders as well! The pad see ew with beef is delicious, lots of flavor! Their green curry and panang curry are spicy and flavorful, and everything is generously portioned! The prices are also great, with entrees under $10! Definitely will be a regular.", "author": "Carolyn G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-02", "description": "I was disappointed in the food we ordered to go.  \nWe were totally misled by the reviews!  A warning to take reviews with a grain of salt. It wasn't that good at all. \nWe ordered the papaya salad, Duck Basil and some peanut sauce chicken dish.  The papaya salad at King of Thai is actually better.  This papaya salad was a bit bland and waaay too expensive for the quality that was put out.  They must make SO much money because the ingredients aren't that great!\nThe Duck basil was mostly fat.  I understand that roast duck is fatty but we only scavenged about 4-5 small slices of meat from the whole $9 dish!  The chicken dish was worse yet.  It was just boiled veggie and boiled pieces of chicken...with a super sweet and chunky peanut sauce over it.  The sauce could totally be for dessert! It was THAT sweet.  Makes me wonder, maybe the chef mistaken sugar for salt.  \nOverall, it was totally overrated and not good enough.  Places like these, make me not like Thai food all that much.", "author": "Tu L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-31", "description": "I've been going to this place for lunch for over a year now.  With the recession and all, a lunch set is @7.95 for soup, salad, choice of appetizer and entree.  Not dirt cheap, but you definitely get what you pay for -- good prep and fresh ingredients. What I particularly like is being able to order the fishcakes as a lunch set appetizer.  At other places, I'd have to place a whole order which is too much when dining solo. I've tried the curries and they're good as well.", "author": "Bodhi D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-09", "description": "How in the world does this place survive, and on Clement Street no less?  Mediocre food, took forever (35 minutes for food for 4, and there was 1 other table in the restaurant the entire time), and it was freezing in the dining room.  $9 for 2 of the most suspect looking cups of Tom Kha Gai that I've ever seen?  The Pad Thai was watery and devoid of anything that implied quality.  Ugh.  Avoid till they seriously review their recipes and ingredient selection.", "author": "Rob P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-06", "description": "I had been here a few times and the food wasn't bad but it wasn't great either. I was mostly dropping cash here because I earn united miles and sometimes I'm a lazy ass and don't want to trek all the way down to Bai Som or up the street to the no longer there King of Thai. That was until they served me the most heinous tofu pad see ew ever created on the planet. Pad see ew happens to be one of my favorite things to eat and I don't think I've ever put something in my mouth that was this awful. Rancid tofu and funky veggies are not a good combo!\n\nIt's not a destination spot, there isn't anything really special about it but if you're really lazy it isn't that bad. Just don't order the pad see ew with tofu.", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-12", "description": "There's nothing in the world worse than overpaying for bad food. Not even mediocre food, just bad. \n\nWe used to order from here a lot because my boyfriend likes the seafood curry dish even though I always thought the pad thai (my litmus test for Thai places) was just OK and skimpy on the shrimp. This time, though, when we ordered we realized that they raised their prices. \n\nYou would think that the portion sizes would at least stay the same. The pad see ewe was so skimpy I am still hungry!! I used to get at least 2 meals out of the pad thai and pad see ewe dishes, but now I'm still hugry after eating the whole thing. To ice the cake, it wasn't even good! Pad see ewe should be sweet, this was just salty. And the beef was so grissly I had to spit it out. \n\nTo top it all off, the thai tea that my boyfriend ordered arrived on its side, leaking all over the bag it was wrapped in. And no straw. \n\nWhen I called them to tell them that I was dissapointed in their shrinking portions, the chick on the phone almost seemed bored. All she could say was, \"sorry about that\". Gee, thanks (for nothing!).\n\nAfter travelling through Thailand I am familiar with good and not so good Thai food. There are lots of great Thai places in the city, and with the choices being almost unlimited, I will never order food from here again.", "author": "Amy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-16", "description": "I recommend starting with the mini crab cakes appetizer.  Unless I am there and they only have enough for one order left.  Then you will let me have them.  I'm not kidding.  Being a mini-chick, I already have a high appreciation for all things mini, but these really are amazing.  Perfectly seasoned, nearly bite-sized and accompanied by a refreshing cucumber salad.  The sweet potato app and the samosas are also pretty good, but not at the same level and can slightly suffer the fate of mush if you get them \"to go\".\n\nMy favorite dish here is the prawns with ginger chili paste.  It's weird because I have had this same dish at other restaurants and enjoyed it but it is prepared differently here and it really stands out.  Something about the the sweet/spicy combo that is just right.  \n\nWhat's especially nice about this place is that the ambiance is really quiet, softly lit with candles and gently scented by the jasmine oil that is heated in the back of the restaurant.  Even when it is crowded, the noise level is low which makes for a nice, casual, neighborhood restaurant date vibe.  Even the servers are attentive, but quiet and non-intrusive.  In other words, they are there when you need them but don't hover.  \n\nStreet parking can be challenging, but there is a lot just down the street if you get frustrated.  I usually end up circling 2-3 times and finding a spot without a problem.", "author": "Trina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-29", "description": "The food was delicious.  I had vegetables in red curry, and my friend had spicy salmon.  We were both very happy with our choices.  Staff was friendly, atmosphere was nice.  The only thing that was not good was that they brought my entree first and we had to wait for his.", "author": "sophia I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-03", "description": "Great lunch! The pumpkin curry & spicy Thai basil entrees were about as good as I've ever had. The soup & salad included in the lunch specials were pretty good, and the veggie eggrolls outstanding. Fish cakes a bit bland. Based on the entrees alone, I'd give it 5 stars. A bargain at $7.95 a person!", "author": "J R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-03", "description": "Here's how this night went - \nWe were starving and decided to make an adventure out of the evening and find a place on Yelp to try. The place we chose.......CLOSED by the liqueur control board! DAMN!! \nSo we start walking down the street to window shop for a new place and we come across this cute little Thai place and I grab my Iphone to check out the Yelp review - IT'S GOOD!  We decide to give it a go.\nFirst of all, the chairs did NOT look comfortable, but they were. The Prices were PERFECT. And we both dive right into the menu - there were a TON of choices. We order 2 Singha while we read the menu thoroughly. The beer come out with two chilled mugs - EXTRA POINTS there!\nFirst course - an order of fried spring rolls and some crispy chicken wontons. The plate presentation was beautiful and the taste was delish. A perfect portion for each of us and enough of the sweet sauce to coat it all in. This place was surely a 5 star Yelp in my book. \nHere's where it all went wrong - \nI get up to use the restroom and wash my hands of the sticky appetizer sauce. The bathroom was DISGUSTING!! Only one toilet for the whole place (that's fine) and it looked like a hobo threw up in there. Cleaning supplies strewn all over the floor (USE THEM!, don't just display them) and its cramped and dirty. Then I notice there is no toilet paper and no new rolls laying in this filth to replace it. \nAs I stand there washing my hands, I am literally thinking of how I hope my date doesn't have to use the bathroom and I really hope I can just forget about this bathroom and still give the place 5 stars!\nIt only gets worse - \nOur entrees arrive while I'm in the bog of eternal stench.....I casually walk back to the table as if there was nothing to see there. \nWe have Phad Thai, Some Rice, and an order of Sweet and Sour Chicken (don't even ask why we decide to try this) - And the Phad Thai is generic, your basic Phad Thai. I take a bite and CRUNCH! I must have bit into a rock or some sand or something. I mean, I felt like I had a mouth FULL of ground up teeth! Really weird. I am thinking that it was some dirt from the green onions or something. Nothing I can't handle - but lets make a note that this was a lot of flipping sand, ok? Then The Sweet and Sour Chicken gets there. This junk was like a giant bowl of orange ectoplasm with some fried chicken and veggies floating around in it. It was SUPER SWEET. there isn't enough rice in the WORLD to sop up all this soup. I wouldn't be able to even pick out the pieces I wanted cause it was all COVERED in slimy, sweet goop. This dish was inedible. \nThen my nightmare continues as my date gets up to use the restroom. Oh No......\n\nAs a side note, the service was great.", "author": "Jena D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-02", "description": "I kicked and screamed when my room mate demanded that I try Patpong for delivery. Had I known they were on Clement and 25th I would have totally nixed the idea since we live in Hayes Valley . All I can say is 5 STARS! If there were 1O I would give them 1O STARS \n\nPrompt delivery and the delivery kid - so gracious - so kind ! My friends think he is very cute= if that matters. \n\nTalk about fresh ... F R E S H !!!! The garlic black pepper beef- wowsa - the flavors and seasoning were perfect -the meat was excellent - the sauce.. slurp - with just a tiny dash of mint -- VERY GOOD. The green and yellow chicken curies - again done perfectly - not to blah not too spicy - just right - spot on. The chicken plump and juicy. \nUnlike most Thai and Asian places - they don't freeze and then shave their meats. \nEvery vegetable in every dish was fresh, ;and perfectly ripe for that dish. \nThe brown rice - be sure to order extra - these folks know how to do rice - not over cooked or made hours before... hot - PLUMP and so good. \n\nI am one hard kat to please too! \n\nIf you truly love and appreciate Thai food - the flavors - the complexity - the elegance - PATPONG KICKS ASS!!! 1O STARS", "author": "miguel p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-24", "description": "Update #3  2-10-07\n\nI finally managed to make it in for a sit down dinner.  The food was delicious and came out quick.  The service was friendly.\n\n----------------------------------------------------------------------------------\n\nUpdate #2  11-1-06\n\nI have yet to find a better Thai place so I gave Patpong another chance.  I still haven't dined in the restaurant but the take out service was quick and easy.  Maybe they were having an off day last time.\n-----------------------------------------------------------------------------------------------\n\nMy once favorite Thai restaurant now  leaves a bad taste in my mouth.  I worked in the restaurant industry for 5 years.  I know how important good service and customer service is ... if there is a problem or error ... it should be remedied IMMEDIATELY.  \n\nMy friend and I phoned in an order for pick up.  First of all, we were told it'd be ready in 20 minutes ... we gave them 25-30 and it wasn't quite ready.  When we got home, our appetizer was missing.   We called right away, they acknowledged that the appetizer had been left out.  They apologized and said they would deliver it.  I live 4 1/2 blocks away.  40 minutes later, we were still waiting for our appetizer.  \n\nBy this time we had already eaten the rest of our food.  I called to inquire about the missing dish and I was told it was on it's way now.  It arrived 10 minutes later ... soggy and cold.  (It was a deep fried appetizer ... like tempura ... something that doesn't taste right cold or warmed in the microwave).  \n\nI called back and let them know the dish was soggy and cold and that nearly an hour had passed since I was told it would be delivered.  I was told repeatedly that, \"the restaurant is so busy, very busy.\"  I pointed out that just because we weren't eating in the restaurant doesn't mean we shouldn't get good service ... it was their error ... we had already paid for the dish ... and the fact that I live soooooo close.  \n\nWe no longer wanted the appetizer and asked for our money back.  After several minutes of discussion (I was passed around to 4 different people on the phone and had to reexplain the situation to each of them), I was finally told I could have my money back but they wanted the appetizer back.  \n\n45 minutes passed and no one had come to pick up the dish or bring us our money.  I called AGAIN.  I was told I had to wait 20 more minutes ... until the restaurant closed.  I told them we didn't want to wait 20 more minutes, we'd already been waiting 45 minutes for our money and another hour prior to that for our food.  \n\nI pointed out how ridiculous it was ... especially since I was only a few blocks away and it was their error in the first place.  I told them we couldn't wait any longer ... that we had plans to go out.  Then the woman had the nerve to tell me I should have told her sooner that I had plans to go out ... had she known I wanted to go out, she would've had the delivery guy come back right away.  I seriously doubt that.\n\nIn the end, we had to go pick up the money and return the food on our way out.  When we arrived the staff didn't say a word to us, just handed over the money.  The woman I spoke with on the phone stared at me with a mad look on her face.  \n\nLooks like I'm on the lookout for a new Thai restaurant.  \n\n2-24-06\n\n-------------------------------------------------------------------------------------------  \n\nI've never had a bad dish at Patpong.  The food is delicious and looks and tastes extremely fresh all the time.  I'm only giving 4 stars because I have yet to dine in the restaurant and experience the service, but I give them 5 stars on their free and fast delivery.  I eat Thai food about twice a week and this is the best place I've found in the city so far.  I highly recommend the garlic pepper pork or prawn dish and the Fresh rolls.", "author": "Miss Purr fec t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-03", "description": "We have Entertainment coupon book and we were going to give Greco-Romana a try but unfortunately that place was closed (due to fire), therefore we went to Patpong instead.\nWe ordered soft shelled crab ($10.95) and salmon ($9.95).\nBoth had good flavor although the salmon came out a bit overcooked.\nThe service was really good here. The waitress never forgot to fill up the water and always smiled.\nOh, rice was free for lunch. The rice smelled good - I think it was jasmine rice.\nThe bathroom was clean but needed more lighting.\n\nNote:\nAs a comparison to the famous Marnee Thai on Irving St., they have slightly better and more authentic food although they were stingy on the portion of the food that we ordered (fish in banana leaf). They stuffed cooked cabbage and other veggies under the fish so that it looked plumped!", "author": "Oribel .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-22", "description": "I've been here 2 handful of times over the course of a year and I really can't find anything bad to say.\n\nI think the location is very easy to find and parking isn't like finding a needle in a haystack.\nThe prices are very economical for UBER TASTY Thai food.\nThe menu is abundant and even though I haven't tried every single thing on the menu, I do feel confident that they are all good, or at least decent.\nThe decor is modern yet warm and unpretentious; this is a local low-key eatery meant to be enjoyed with good company.\nThe servers are pleasant, patient, and courteous which makes the dining experience much more relaxing.\n\nIt appears that most reviewers have complained about the portions being small, well I scream to differ.\nMy boyfriend and I went just 2 weeks ago and we split Thai toast appetizer, honey roasted duck and thai basil pork w/ eggplant entrees and we each had individual rice bowl and that was much more than ENOUGH! I drank water and my boyfriend had a beer. There wasn't anything fancy or extra, we went straight to the point.\nI really find it hard to believe that you can't be full from sharing some entrees and rice. You gotta be really greedy and regularly eat huge portions like a gaping pig to complain about the amount of food served! Good food is meant to be savored and enjoyed slowly NOT have mass quantities shoved down your throat!\nYou all need to take a lesson from Remy, a fictional rat-chef living in Paris- he obviously knows more about food than most humans! Go out and rent Ratatouille!!\n\nOk, so I did find a bad thing to say but it's about the people who bad mouthed this place!", "author": "K K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-04", "description": "My co-workers decided to order take-out for lunch today and treated St. Gladys since it was her birthday week.  Patpong will deliver for free with a minimum order of $15 and they accept credit cards with a minimum $10 charge, no checks.   I tried the mild Gang Keo Warn Gai, $8.50, (Green curry with chicken, eggplant, bell peppers, zucchini, green beans and basil).  By my estimate, there was a good amt of chicken but not enough vegts.  The rice ($1) was ala carte.  The flavor was good, not fantastic.  \nSt. Gladys ordered the Prawns with Chili-Ginger Paste (Pad Prik King) $9.95.  I tried one of her mushrooms which was tasty but she said she wouldn't order it again.  The other co-worker ordered the Garlic pepper Beef ($7.95) and indicated that she really liked her dish.   There are 4 selections of rice with steamed at $1, and garlic rice, sticky rice and brown rice for $2/order.  \nOther items on the menu include appetizers, salad, soups, fried rice, stir-fried noodles, curries, pork/beef dishes, chicken/duck dishes, seafood dishes and vegetarian/vegt stir-fried noodles.  I'd consider re-trying the food again even if it's not the best Thai food I've ever had, it' certainly wasn't the worse.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-13", "description": "Yum yum yum.  Husband, 2 kids and I randomly stopped here for dinner the other night.  When we first arrived, the place was empty (not a good sign), but it smelled so good, the prices were great, and we were starved, so we stayed.  Glad we did!\n\n+ nice, simple, classy decor; comfortable\n+ spicy basil chicken was SOOOO good\n+ ditto green curry\n+ service was extremely attentive - but, you know, we were practically alone... others did arrive later.\n\n+/- pad thai was your basic pad thai.  my daughter liked it.\n- papaya salad was okay but not terribly authentic. I like the little shrimp. there were no little shrimp :(\n\nOverall, we were happy to have found the place and would definitely go there again the next time we're in SF and craving Thai...", "author": "Deborah K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-01", "description": "The food is pretty basic but good.  The service is terrible.  I've ordered from here twice.  The first time they were late I chalked it up to a bad night.  Ordered from here again and this time they took 1.5 hours to deliver our dinner.  I called to express my displeasure and kindly told the person that I wouldn't be ordering from them any longer... his response, \"that's ok\"  really??  I told him I was going to post that on Yelp, his response... hung up on me...", "author": "Geoff H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "I ordered papaya salad, asked to make it spicy, received very mild. \n\nThe spicy basil chicken and red curry had enough spice to make up for the bland papaya salad. It would be nice if they served it with rice instead of having to order them as sides. \n\nOverall, good. I would go back. Not sure I would order the papaya salad again.", "author": "Cassandra T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-05", "description": "We ordered Pad-See-Ew and Thai Fried Rice for take-out. From the looks of it, the restaurant itself looked classy and elegant. I wouldn't mind eating inside in the future. The staff was courteous and brought over some tea for us to drink while we waited. The food was pretty good, except for the fact that the rice tasted a bit bland, and the pad-see-ew was a bit salty. However, combining both together hit the spot!", "author": "Andy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-25", "description": "This is my new thai restaurant for now.  I always get the garlic pepper prawns, very, very good!  I also tried one chicken dish which also tasted good, the quality of the chicken was good, no suprises!", "author": "Paul M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-19", "description": "Pat Pong is a great thai place. The restaurant is softly lit and enjoyable to sit in. A little drafty because of the glass windows so we generally ask for a table towards the back. Delivery service is GREAT - and well prepared.", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-09", "description": "I really love this place. We have a baby, so we often get delivery. The food is always hot and delicious! The staff is always professional and  sweet. Love it! 5 stars for best Thai in the Richmond/Outer Richmond area. 4 stars because I am not sure what it compares to in other neighborhoods. :o) Oh their fresh rolls are much different than your usual, BUT they are sooooo good! The sauce is amazing!!!", "author": "Keely G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-06", "description": "the worst service ever!!!!  they delivered the wrong order two times in one week and did nothing to make it right.  they promised free beverage instead of comping the 2nd half of the order we had to wait for them to bring back.  too bad they not only didn't come with beverage, they made us pay and tip again.  the people that take orders do not speak english and will f**k up your order.\n\nhorrible!!! business ethics.  i was a loyal patron, ate there at least once a week and they have now lost my business and all of my friends and family's business", "author": "J L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-01", "description": "Maybe this place does more delivery and take-out cause every time I walk by the restaurant is empty. (Probably should have taken that fact into more consideration.) On one occasion I ordered takeout and was not impressed. Considering their prices I figured I would have gotten a larger portion, I was wrong! Since they put a flyer on my door and its somewhat convenient on Clement I figured i would give it a try. Now that I have experienced it, I most likely will not be back.", "author": "Trev D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-07", "description": "Patpong, you guys suck. \n\nI'm sick today, so I decide I want some warm, spicy soup to clear my head. I walk by. I notice your menu. Taking a look at it, a hot and sour soup sounds delicious!! The price, $4.95 for one person. Sounds decent!\n\nI go in, service is quick, I order, I wait. The bill comes in less than one minute and whoa whoa, it's $10!!! I don't mean to argue, so I apologize before I start, but I say your menu outside did not list this price. He goes, \"well it's dinner time\". I go outside and look, the menu says \"dinner menu\". I stand there for awhile thinking, should I ditch the soup? Should I just pay for it? I go back in and I talk to another server who says, \"the portion is bigger\" and \"you got take out so it costs more, the price outside is for dine-in\".\n\nREALLY?!?! Why don't you say all that on the menu outside instead of tricking people thinking it's one price, and then it's not. \n\nSorry Patpong, I'm not paying $10 for a small soup.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-18", "description": "Not bad. Ordered take out and had Poh rah seafood dish. Very tangy and very yummy especially with white rice. Cannot comment on other dishes, the seafood was ok, mixture of shrimps, scallop, fish, mussells. It could have afforded a bit more seafood for $12.95. Not too salty. I also ordered the mango and sticky rice for $4.95 and that was tasty! Not bad  for a neighborhood joint but not cheap as king of thai. bv", "author": "Petri Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-09", "description": "hmm still good and cheaper than other Thai places BUT the last 2 times I ordered here the portions that came looked WAY smaller AND the dishes were very spicy instead of mild AND I think they are using different shrimp roll wrappers\n.... not quite a 3-star but getting there... watch it Patpong... I am not afraid to cheat on you...", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-01", "description": "Another one of my hoodie spots.  The best home-cooking thai food for the price and all the servers and drivers are flat-out NICE.  Yeah, i said it.  Sure-shot culinary pleasure if you order the Pad Kee Mao, Pineapple Fried Rice, and Spicy Crispy Chicken.  Yatta!", "author": "omar b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-15", "description": "My friend suggested this place to me and I met him here to check it out. The first thing that was a huge pain was that there was NO parking anywhere, I drove around for 20 minutes, finally parking about 10 blocks away and walked over. The staff was friendly, there wasn't many people in there and the service was decent, however it could have been better, especially since there was only one other table besides ours. The food was pretty good Thai food, not the best I had ever had but nothing stuck out in my mind as being terrible. I will probably go back to check out more of the dishes and see how the service is on another night.", "author": "Bobby B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-02", "description": "one of my favorite thai restaurants. i LOVE their chicken wings! i always order them everytime i come here. \n\ni ordered take-out today since i had a menu in my car. [ i like to keep take-out menus in my car just in case i'm around the area.] anyway, i ordered 3 items: chicken wings, pad thai, and this fried chicken  with garlic rice entree. the total came up to almost $25. i was wondering why it cost so much. once i picked up my food, i took another take-out menu and compared it to the one i had in  my car. i noticed all the prices went up! the chicken wings that were once  $5.95 (for 10 pieces) are now $6.95!! BoOoOo!  o-well......what can you do...\n\ni still like this place tho. their food is very flavoful.", "author": "B B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-19", "description": "Good option for Thai delivery...  My one complaint is that nearly every dish has bell peppers, and I frickin' hate those things!  Why do bell peppers have to go and ruin perfectly good food?  Also, the green papaya salad is a little too lemon/limey -- almost like a fake flavoring, but otherwise everything else is good...", "author": "robyn s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-16", "description": "Came here on a Saturday around ~3. Our waitress was nice and we had the place to ourselves. I ordered a lunch special of red curry and my friend ordered some soup. Both lacked flavor, with so many Thai restaurants around I would pick a different place.", "author": "Jacquie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-20", "description": "The prices are cheap. The portions are not enormous but they're enough. I don't understand people stating \"for the price I didn't get enough food.\" On top of that, the vast majority of what I use to get here (moved to other side of city) was really good. To be honest I've not had better pad se ew in san francisco. I'm to the point where I don't get thai food (in nob/russian hill) because I'm always disappointed and it always pales in comparrison to pat pong. \n\nalso, the vast majority of times i ordered delivery the food would get there in under 20 minutes. i've never actually eaten at the restaurant", "author": "erik l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-08", "description": "I love this restaurant!  Usually I get take-out and they give me tea while I wait, which is never a long wait.  Last night I ate there for dinner.  Started with the garlic calamari on special--it was amazing.  The pieces of calamari were big and the seasoning was done just right.  Then, had yellow curry w/ beef for entree, also very good.  The portion was a little small, but the prices are pretty good, so I can't complain much.  The server was very nice, a little slow to collect the bill, though.  I will definitely go back and bring more friends.  It's never busy, which is good for me, but I hope they're doing okay, b/c I'd hate to see them go.  So, go eat there & keep them in business!!", "author": "Caressa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-04", "description": "We went here for our 1 year anniversary from our wedding day. The food was good, we had the Beef Salad. Nice and flavorful the only problem is the dish had two plates the regular porcelain and the lazy susan lettuce action that spun our beef around making it hard to pick the food up. I felt like imitating Chris Rock \"They spinnnin' ni--a they spinnin\" advice chop the lettuce please. Then we had the fried calamari, lets just say i had to chew it up for a long time to keep it from scraping my passage. it was good though just left in the fryer a little too long. The Basil Spicy beef fried rice was good and moist and combo'd well with the Chicken Panang Curry. The food was good it just took a little while to get it. One take out customer came back with her order complaining about it when we first got there, then i ordered a diet coke and could hear the waitress scoop ice into the goblet and all of a sudden clang and crack. I thought to myself and said damn that's not a good start and do i really want to eat here now? In reality, It's not bad and the price is good. The place is sentimental to me so i'm sure we'll be back", "author": "graham c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-26", "description": "I love this restaurant! Patpong offers yummy Thai food at a great price in a  quiet, mellow atmosphere. My boyfriend and I are in love with the Pad See-Ew and the Thai toast appetizer. Portions are also pretty big, too (good for the boyfriend). \n\nPatpong is our fall-back restaurant whenever we want a good, cheap meal that hasn't failed us yet! Our stomachs have always left happy and very full.", "author": "Clare K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-04", "description": "First of all, I've been to the real Patpong in Bangkok.  Thankfully this place is nothing like that.  Food was good, dining area was nice, chairs were a little uncomfortable, service was really nice.  Three of us did our orders family-style and everything i tried was good.  The fried taro appetizer was amazing.  definitely will come back.", "author": "Nessie V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-09", "description": "Best Thai Food I have ever tasted. 2 years in a row - they have given us \"awesome\" service in delivery, food preparation and timeliness. Thanks Patpong staff. You ARE THE \"BEST\" IN SAN FRANCISCO, CA.", "author": "Debbie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "Very good food, very reasonably priced, nice decor and new inside", "author": "P B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-26", "description": "What would otherwise be a 3-star restaurant gets a whole extra star just because of the Thai toast appetizer.  Sooooo good.\n\nOther than that, the food is decent, good portions, fair price, done quickly, etc.  I almost always get it as takeout rather than eat there, so I can't say too much about the service, but the few times I've eaten there I had no complaints.  Basically your average Thai place, I'd say.\n\nBut the Thai toast!", "author": "Morgan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-18", "description": "Yummy!!! My favorite Thai food in all of San Francisco!! It may be a tad expensive but to me, it's worth the price... It's also a little hole in the wall out in the Richmond, so don't go during busy hours... But I highly highly recommend them... Their food is soooo good... And they have GREAT daily specials!", "author": "Lindsey S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-07", "description": "my favorite thai restaurant in the bay area.  granted i've only eaten here once, but i've found they have very unique dishes.  i had some fish dish that was a special and it was very tasty.  my husband ordered the pad see eu, it was the best i've ever eaten.  the service was also very excellent, and the restaurant is nicely decorated.  parking is a little difficult to find, but definitely worth it.\n\nUPDATE:\nsince we liked this place so much the first time, we revisited it on 3/2.  man, what a disappointment.  Did they change the chef?  We ordered the Pad See Eu again, and it wasn't the same.  The service this time was spotty, they seemed to have forgotten what we ordered (though they were nice about bringing us the right stuff).  We also got the garlic prawns and ginger chicken.  Both were OK, but nothing outstanding.  Man, I swear we were in a different restaurant last time.", "author": "Waynele Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-23", "description": "I always enjoy eating here.  Everything seems freshly prepared and very tasty.  Plus, the portions seem a bit larger than most so points for value-for-money here.  I'm not a big fan of the cruel-chairs, though.  Now I just do take-out.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-17", "description": "I like their appetizers more than anything else-thai toast is the best, i think.  other than that, everything about this place is OK-food, prices, portion sizes, staff... just OK.  the flavor doesn't pop as much as thai food should.  this is the kinda place i'd go to if someone else wanted it, but I wouldn't eat here on my own.  I do like that they deliver, and usually fairly quickly.", "author": "asia c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-21", "description": "They have Tofu Satay which is amazing.  Great delivery - even though I do feel slightly embarrassed that all the food is for me (need to meet their $15 delivery min. so I order dinner & lunch).", "author": "Anna L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-13", "description": "pretty decent thai. food is good but portions are kinda small...I'm an \"enough for leftovers\" kinda gal. \npoints dinged cause the horrible radio stations they blast and also this one time it smelled like really toxic cleaning products. cancer with your pad seew anyone?", "author": "Lauren T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-07", "description": "4.5 stars\n\nAh, Patpong.  Rescuer of late afternoon hunger and bestower of fiery bowels.  These, both good things, because when I say I want it spicy, I really, really MEAN it.  The sadist in me loves the total numbness of tongue, or TNT, if I may.  Patpong does not pussyfoot on the spice.  They elephantfoot or whatever the equivalent is.  When I tell them how spicy I want it, they wink a little, like, \"We're going to hurt you, you know this yes?\" and off they go to the chef-lair to plot my demise with the most bad-ass, tattoed ruffians of the nightshade family. I honestly believe they cultivate a magical pepper there yet undiscovered by anyone else and they save it for MY food!  \n\nLunch is great, very inexpensive, good value, and quick.  The chairs look like they may have once had padding but it was torn off and then the frame was soaked to get all the possible butt-comforting nuggets of padd off.  What remains is what you find yourself sitting on when you dine in at Patpong, which is why I'd recommend delivery-\n\nGotta say, it's always packaged well, comes with my requested extra peanut sauce, and offers great little gems of tastiness for next-day fridge diggins.  \n\nWho are all these folks on here leaving hungry?  I often feel explosively full after a good frolic with Patpong's danger team, that being Tofu Satay and Pad Kee Mao.  I occasionally add the Hot and Sour Soup when I'm not being rational with myself, which always results in ye olde, \"It's time for pants with a stretchy waistband\" feeling.  I have shared this same meal (well, not the Mao cause my BF can't take it) with my partner in crime, and there were STILL leftovers!   The Pad Thai or noodle dishes are not good reheated, but they historically never have been and noodles are best when they're freshly cooked anyways.  No fault of Patpong's of course; when I solve this world mystery about noodle-to-Fridgidaire hardening ratios, I will build a museum around my house and charge admission.  Til' then, it's the dish you should just try to finish so you don't have to get all verklempt about throwing it away.\n\nYou could always give it to a Freegan.", "author": "Lea N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-01-26", "description": "Food is good, but a bit pricey. would be great if you have friends live in the neighbourhood who will get coupons in the mail.", "author": "cynthia l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-10", "description": "Patpong, you dun me wrong. My friend's favorite thai place was closed, but things were looking up when you came along offering free delivery on a chilly night. I ordered my standards: tom ka gai and panang curry with chicken and tofu plus thai iced tea and pad thai.  The iced tea was absolutely perfect, the soup was acceptable until I realized how much of the container was filled with the inedible galang stalks and kaffir leaves. The chicken was way tough. But where you truly dropped the ball was with the curry- because you didn't send along any rice. The chicken here was much better but the dish overall was mediocre with green pepper. Pad thai was totally greasy and uninspired. Pass.", "author": "Greycella L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-17", "description": "Great to have choices, especially when there is three good Thai restaurants all within a few blocks of each other. Patpong stands out!\n\nFriendly staff especially the young woman who works there week nights, politely took my order over the phone and even confirmed it with me before hanging up. And even dealt with my crazy antics when I changed the order twice more within 5 minutes. Everything was bagged, tagged and ready to go when I went to pickup, even when I added additional items. \n\nNot anymore expensive than other places, got 5 dishes and rice for around $44 and even had leftovers for lunch. If you like Spicy Thai make sure to convey that over the phone or when ordering. The Brown and Green Curry were mildly spicy at best, but I am whimp. \n\nPapaya salad, brown curry and shrimp and cashew dish are the best. Although as a true American I am going with some fried dishes next time. Ordering rice for about 4 is the equivalent for 6, so cut down on the rice order, unless you like starch.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-06", "description": "wish i could give it 4 & 1/2 stars!! sooo yummy!! very fast delivery!\n\nwould reccommend the spicy chicken wings for appetizer\nspicy basil fried rice with beef entree\nsweet sticky rice w/ mango for dessert\n\nsooooooooo yummy!!!\n\n:::::::finally went to the actual restaurant::::::::\n\nand i HAVE to report!! very clean!! cute & modest decor. very authentic thai! Music was thai top 40 & our bill was written in thai characters... \n\ngarlic calamari was yummm-o & I couldnt resist ordering the spicy thai basil rice with beef & cashews.... AGAIN!!", "author": "c e."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-17", "description": "It's good food, in fact i think it's received best of SF for Thai food this past year.  I wouldn't say it's the most amazing Thai i've ever eaten, but it's good.  Prices are average and service is quick.", "author": "Heather S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "I was really impressed with the food. Tried their grilled eggplant salad which just had an amazing harmony of flavors and the eggplant was just grilled to perfection. One of the best Thai places I have eaten at, especially for the price.\nThe service is a bit questionable and the portions are rather small but the overall experience can be a pleasure depending on how you get treated. I left happy but can imagine your displeasure if they overcharged you or just seemed shady.\nDefinitely give it a shot. It's worth it and it's delicious and that's what really matters, right? and if you don't like the service, order in.", "author": "Ankur S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-07", "description": "Great  pad see eu!  The other dishes I've had here are all run of the mill.  I think the place is a bit over priced.  There are cheaper spots close by that are just as yummy!  Some pluses: delivery available; coupons in valupack.", "author": "Cara C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-29", "description": "Cute, small and in the calmer dining area of Clement. Portions here are smaller than elsewhere, but it is cheap. The Tom Yum is amazing and the ginger tofu is awesome too.  The dining area is small so I wouldn't suggest this for a party of more than 4.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-04", "description": "This has got to be one of the best kept secrets. The food is excellent.\n\nTrue, I live in the neighborhood and walk there.  You folks that come with your car, well...., good luck with the parking.", "author": "A S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-13", "description": "Personally, I absolutely love this place. I am very fortunate to live in the vicinity of many great restaurants but this Thai place is a wonderful gem. The food is absolutely delicious. I am not a huge fan of soup but not this restaurant's in particular, just not a huge soup fan but the noodle dishes here are to die for. I've had pad thai, both vegetarian and meat, and I've had other noodle dishes whose name I don't remember, but every single time I have noodles here, I literally will eat every drop and lick my fingers. And oh yeah, Thai Iced Tea? Freaking delish.", "author": "Eugenia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-10", "description": "One of the best Thai restaurants and being in the Richmond district, there's no shortage!  Their Panang curry w/ Chicken and their version of Ground Chicken with the spicy basil is the best I've ever had.  One of my other must haves is  their chicken wings with the spicy glaze!  Their Tom Yum soup is good too and they make a good pad thai.   Great cucumber salad too.   I usually get delivery; service can be a bit slow when you dine in (hence four stars not five) but the food is worth it.  If you have a Thai craving, this is the place to go!", "author": "Sandria W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-15", "description": "We had a large group so we had a good variety of different dishes.  I felt all the dishes were very tasty and well flavored.  Definitely recommend the pad-se-ew, we ended up adding dishes of that to our order since everyone wanted more.  Dishes are a little on the small side, I think we had 12 dishes for 9 people.  Overall I think the food quality was very good and tasty.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-03", "description": "Service is very slow. Even on a Thursday night with maybe 3 tables used, I had to wait a long time for he food, water refills and the check, even after asking twice. Another patron complained to the waitresses that he'd been sitting there for a while but hadn't been given a menu since he got there. \nThe food is decent. the stuffed chicken appetizer was tasty, even though my utensil-challenged brother complain about not being able to cut it. I also had the duck, which only came with maybe 6 small slices on a bed of veggies for $10. My brother had the crab meat pad thai which looked tasty, but I didn't get any. My mom had the \"huge salad\" which has a weird name but was rather large. I didn't care for the dressing on it, but I'm not really into dressing all that much. \nI think the wait kind of ruined the whole experience for me. The food is fine if you have it delivered, but if you eat there or pick it up, be prepared to wait a while.", "author": "AJ M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-11", "description": "I have been here twice and left very happy both times. The food was very cheap and the portions were just right. We had the fat noodles (can't remember the name but they are under the vegetarian section) and the panang curry. Both dishes were excellent. I just can't believe people say this place is expensive!!", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-26", "description": "There a ton of Thai restaurants in the Richmond, but we love this one.  Delivery is free if you spend $15 and it's usually pretty fast.  Lots of tofu dishes if you're into that and the chicken is decent quality - much better than a lot out there.  There might be cheaper options, but I think you get what you pay for.", "author": "Meghan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-12", "description": "The food was o.k. but the experience wasn't.  I went with some friends and we all had something different and all of the dishes were tasty but nothing stood out.  A nice lemon-grass dish was the best.  \n\nBut we had a coupon for a free desert and also a parking ticket that needed validation (they have a deal with a parking lot down the street).  They wouldn't do both things--it was either the desert or the parking.  It clearly said on the coupon and the parking ticket that there were no strings attached etc.  Anyway, we took the desert--a weird fried thing--and paid the parking.\n\nWhat could have been an o.k. experience went south.  Why, if you're a Thai restaurant competing with many in the same area and hundreds in SF, would you go petty on customers like this?  You can bet that I'll never eat at Patpong again.", "author": "Murray S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-25", "description": "Ehh... Foods fine, portions are small-er. \n\nI guess I have been spoiled. My lady friend is Thai herself and after spending a month in Thailand I have been accustomed to Spic-ier Thai food.\n\nOh well. Generally foreigners don't enjoy gargling Thai spices for 2 hours.. it's not that bad.\n\nWith this said. If any of you ever make it to Thailand... make sure to visit the Patpong district... you might enter this restaurant with different eyes..", "author": "Mic F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-10", "description": "Because we had a coupon, we decided to try this place out since I love Thai food.  We started off with the green onion pancakes which was  nice and flaky and very tasty.  It came with a dip consisting of chili oil with cucumber slices. We ordered Pad Kee Mao which was rice noodles with pork and red peppers.  We also had their spicy chicken fried rice with basil, red peppers, onions and green beans.  The chicken were in chunks and not your normal diced chicken.   Although the food was great, the portions were small.  I've gone to other Thai restaurants and their portions are twice the size of what we got.   We were the only two customers in the restaurant and I felt the service could've been better.   We had to flag the waitress down to fill up our water glasses.  Plus, on the website, it indicated that there was a Special Offer -- Receive a FREE dessert with your dinner order.  I asked about it and the waitress said they no longer offer the free deseert.  I told her it should  be removed from the website as it is deceiving.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-30", "description": "i like their curry, pad thai and their stuffed chicken wings, service is alright, parking sucks and price a little high", "author": "Wan Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-06", "description": "One of my favorite Thai restaurants, and i've been to about 15 in the city.  Very well priced, lovely atmosphere, and good to great food.", "author": "Kristi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-16", "description": "Pretty good Thai food. One of the better places I've visited. Portions are a bit smaller than I'd like for the price, but the taste more than makes up for it. I would recommend.", "author": "Gordon L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-09", "description": "We only ate here because it's a couple blocks from our house and we had one of those ValuPac coupons you get in the mail. I love Thai food and am not very picky about it, but the food here was...I wouldn't say horrifying, but really sub-par. Every dish we ordered (and these were standard Thai dishes, nothing fancy) was overcooked and not tasty at all. I would never eat here again. Bai Som a few blocks down is a lot better, though it's a shame Narai closed down because that used to be my favorite in this area.", "author": "Sasquatch M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-10", "description": "Being of the vegetarian persuasion, I can't comment on their meat items but the vegetarian stuff I've had has been excellent. I highly recommend the tofu/vegetable dish in ginger black bean sauce (I think it's #73 or #74 in the vegetarian section). It reminds me of the food I had in a chef-school restaurant in Bangkok.", "author": "Bobby Z."}
