{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-11", "description": "Nice change up from the norm of Starbucks and or Philz. Staff is always cool and pleasant with drinks coming out faster than most locations. \n\nWould've given a 5 star rating if wasn't for the almost impossible parking situation. If you know the inner Richmond district you already know parking is good as GOLD and it's all metered parking as well.", "author": "Benny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "Order -- iced tea fog (green tea tropical)\nLoved my drink. It's a mix between the sweetness of honey and the sour of the lemonade. \nLocation -- very convenient since it's right on Geary\nSpace -- a lot of group and single seatings. The downside is that there aren't a lot of outlets AT ALL. There are also seating outside. \nBathroom -- semi-clean. Depending on who have been using it, I guess.", "author": "Yuan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "I love going to this coffeehouse. The staff is always friendly, knowledgeable, and have smiles on their faces! There's a fantastic selection of tea and coffee, and everything I've tried so far tastes wonderful! Kudos to the location manager for a clean, friendly, relaxing place to hang out and caffeine-up!", "author": "Jessica Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "This is my go to coffee place! There have good variety of beverages!\nI love their javiva blend and during my last visit I got Mango Sunrise and it is delicious, perfectly sweet and tangy. Great for any summer day!", "author": "Megha S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-31", "description": "I order the same thing five days a week for at least the past year...  At Peets, at various Starbucks, at House of Coffee...everywhere... One large drip coffee, 2/3 hot coffee and 1/3 iced coffee, no ice.  I drink it before going to the gym and need to drink it quickly.  \n\nAlways the cost is the price of a large coffee.  Today, what might have been the \"manager\", intervened and insisted I pay for a cold brew which is a buck more.  Screw that.  Now i won't be spending by money there even though it is really my favorite drip coffee.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-01", "description": "Beats Starbucks  by far. This is a real coffee drinker place. Philz's Coffee is so hipster and overrated. Bluebottle is overall the best of all. The slow drip is the way to go if you really want a r as i cupnod coffee. Peets is second.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "I would say stunning coffee. I will not say that the best, but nevertheless deserved 5 stars. I really liked the atmosphere inside. The staff is very friendly !!!", "author": "Roman G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "Found a great coffee place.\nI have tried Peet's before but never felt like moving from Starbucks to Peet's coffee full time. Bu this place changed my mind and here is why.\nI am a huge fan on Starbucks caramel macchiato or pumpkin spice latte seasonally so I never used to try Peet's except their ground coffee.\nBut I had a gift card from last Christmas so I moved the balance to app and threw the weight off my pocket.\nSo the lady at the counter was really nice she suggested me the Havana cappuccino but as I like latte she said they can make is Havana Latte.\nWoooow, the coffee blew my mind. It was freaking amazing. It tasted so much better than Starbucks. The barista gave me a 2nd visit complementary drink card with my drink.\nAs I said I will be back for sure, he replied with a little bit of sass \"I know you will\". I heard that dude.\nThanks for the great coffee.\nNew favorite \"Havana Latte\" at Peet's.", "author": "Urvish -."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "I go to Peet's for the taste of their coffee. Never burnt flavored and very consistent from Franchise to Franchise.", "author": "Gary H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-13", "description": "After the remodel this peets has a better vibe. its generally cleaner and feels more comfortable. Layout also changed. Theres more room to line up now.  Internet speeds is about 7mbps with about 5 or 6 people around on laptops. so not to fast, but enough ifyou need to do some light work. if 1 or 2 people starts watching youtube, then the speeds will probably slow to a crawl.\n\nstaff is excellent. when my coffee took longer than expected, i didnt have to ask them, they apologized to me while i was standing there that it will take a few more mins.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-08", "description": "They keep very old beans on the floor. Love Peet's, but cannot get fresh beans here! My family has been drinking it since the 70's - since I can't get fresh beans here, I have to have them delivered to my house at a much higher expense. Sort of defeats the point of a local store. Hope they can improve!", "author": "Britt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "I highly recommend this location. \nShout out to Colin,  very friendly,  dedicated employee.  He also took time out to make sure creamers were at the right temperature.  His enthusiasm was contagious. \n\nPlenty of seating, good music.\n\nWill definitely return next time I'm in the neighborhood.", "author": "Eleanor L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "This is not just the greatest Peets. It is the greatest coffee shop of all time. Why? Because coffee shops at their best feel like coming home. They are warm when it's cold outside. They welcome you with smiles and no attitude. They have great coffee of course, but more important is they have great people. Every single person who works at this location is a gem of a human being. Every single one. I don't understand even how they do it, but they are genuinely in it for the highest good. It's almost like a secret thing. It's no big deal. It's just a Peets. But if you go there, you will feel better.", "author": "Lawrence C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "Ah the Peet's inside the Jeff's Jeans store!  I went into grab a mocha and some carrot bread for friends.  Barista was very nice about individually bagging the breads for me. Well they are for different people so why bag them into one bag right?\n\nOnce he was done, he offered to give me a bigger bag to carry it out the store so I won't drop one of the baggies.  I offered to give him a dime for the bag and he said it was ok.  That's good customer service (screw you, City of SF and your faux regressive tax)!\n\nMocha was made timely and tasted good too.", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "Consistently great service. Coffee never fails. Strong, hot and robust what more can you ask for?\nI sure am going to miss these holiday cups. They're jus so cute.", "author": "Liz N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "Best Peets in town. My drinks are always good & made correctly. The staff is very concerned with your happiness. It's always clean and comfortable. Other locations like California should take lessons from this one.", "author": "Venus S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-12", "description": "TLDR I'm only going to come here for the coffee. \n\nThe baristas are very attentive to incoming customers and ask what you want right when you near the register. They usually have medium and dark roast ready so if you want blonde coffee, you might need to wait a bit. I like their house coffee so it's nbd. \n\nOn another visit, I ordered the coconut javiva w/ whip (unlike Starbucks, whip is extra charge... which the barista didn't tell me until after I paid) and I wasn't very impressed w/ the drink. The barista who made my drink asked if I wanted the whip and I was confused b/c I paid for it already... Anyway he got out the can w the whip cream and it barely had anything left in it. He gave me about 1 spoonful of whip and said oh that's all we have and handed me my drink. Umm... What? But I was on a time crunch so I didn't bother to ask for more.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "It's my closest Peet's and I come here almost every day until I get sick of the freaks filling up their tables using their free internet while not buying anything except pizza and big gulps from the 7-11 across the street.\n\nLately the stinky loud-talkers have found somewhere else to invade, as it's been clean, quiet, relaxing, and no gross people clogging up the toilet (it happens).\n\nThere are a bunch of new baristas who seem to enjoy their jobs and it shows. I used to get the most watery nastiest drinks here but that hasn't happened in months. Whatever Peet's is doing to monitor quality, it's working.\n\nShoutout to Shane and every female here as they really go the extra step and can make some beautiful drinks. Lately, anyway.", "author": "Jill B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "Everything is good but can you please turn the music down? It's very loud, all the time. It's pounding on my ears. Reggae music every single day. It is not a cafe style genre. It needs to be calmer and more neutral.", "author": "Monkey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "Great service but they gave me caffeinated coffee beans when I asked for decaf beans - but they fixed it with no problem.\n\nThis is a really great place with great drinks.", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-10", "description": "If in the area, I would stop by this Peet's after dinner to satisfy my need for caffeine.  This Peet's has always been mellow in the evening with some customers at the tables chatting or online.  The workers are always friendly and efficient. \n\nSince I'm usually on foot in the area, I can see parking being a challenge in this busy Geary Blvd corridor.", "author": "Al L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "+ Ample space to sit and work\n+ Decent WiFi speeds\n+ Decent coffee\n+ Friendly staff\n+ Convenient location", "author": "Joseph L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "I love this Peet's location - they make my drinks consistently good.  Victoria is super friendly & nice and remembers my name.  Quality coffee & great customer service - what's not to love?!", "author": "Kim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-10", "description": "I broke my daily Starbucks habit 6 years ago, saving a lot of money once spent on mediocre coffee.\n\nOn a rare occasion when I come across a Peet's, I'll stop in for a cuppa; they make great coffee.\n\nPlus, my little boy likes Peet's  citrus bread.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "5 stars because of Ben. He gave my wife a free drink over a screw up on an order and that's saying something because customer service could improve a bit with other employees. I will say this Peet's has improved. Less homeless folks and better service than before. If everyone was like Ben we'd go there more often!", "author": "Charlie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "Love their coffees and the various selections that Sbux doesn't have.", "author": "R C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-22", "description": "Solid coffee with a very friendly staff. One of the better Peet's in SF. Definitely the best coffee in the area.", "author": "Chimichanga C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "Great, friendly service with adequate study space. My fave definitely is the iced black tie! The Havana dulce cappuccino is also yummy.", "author": "Breanna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "Staff are terrific. Really friendly and make the drinks how I like it. Fresh coffee throughout the day.", "author": "Lara H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "Great service! Ordered a drink, waited a while, and saw that no one else but me was waiting for a drink therefore I went to ask if they were making my order, drink maker apologized and said that my drink was not shown on his to-make list, so he made my drink in less than a minute and right away brought a coupon for a free drink my next visit alongside my drink. Knows how to keep their customers coming back!(:", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-26", "description": "First experience - 1 star\nWorst experience ever - bad drinks & poor service. Got 3 drinks prior to closing and everything was diluted. Peet's has always been an all time favorite of mine. The strength and quality of the drinks made Peet's a go to for my family and I. We figured a quick stop would be a nice way to stay awake for our 1 hour drive home. The employee was rude and by the time we left and tried our drinks, they were awful.\n\nOrder: Americano, Latte, White Mocha \n\nUpdate: 2 star\nFollowed up with the store the next day and they were very apologetic for the experience and had us come back in. The management is fantastic and they were happy to be aware of what issues we had. It was nice to know that despite the poor experience we had, the management was on par with providing Peet's quality of service.", "author": "Hannah Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "Like it way better than starbucks, it was not crowded my drink was made quickly wish the iced coffee was a bit stronger but was far more palatable than other places. My problem is the area to prepare your coffee is a mess stickiness everywhere and low on the half and half, stroller mom spills half her beverage on top of area and makes no attempt to move or clean up her doing. Ugh slob\nstaff is nice and efficient they have a familiarity with clients who chat briefly about plans to do the weekend.", "author": "Keria B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "I was craving for chai but at the same time hot chocolate, so this really cool guy, Josh, suggested for me to get a Mayan cocoa with a hint of chai. Omg! He nailed my craving and made my day! Love it! Thanks Peet's coffee for people like Josh", "author": "Glenna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-31", "description": "Seating: I don't stick around this Peet's after I've ordered. The tables are usually full by late morning. \n\nFavorites: Freddos. I love 'em. The barristas are always happy to customize them for me. Oh and their hot teas. \n\nBarristas: I feel like I'm having a real conversation with a real human being! Woot. That's a step up from a Starbucks any day. Plus the wait time is nowhere near as long.\n\nWait time? I'll clock it for you next time!", "author": "Ali B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-04", "description": "i had some time to kill in between appointments so i stopped by here in search of a quiet place to sit and access to wifi.  i bought a small snack at the counter, then inquired about their wifi, which i was told did not require a password.  score!   there was a seat in the corner, next to an outlet, so i plugged in my laptop and surfed away until it was time to head to my next appt.  it was pretty quiet during the late afternoon hours, with only a handful of customers inside.  location is pretty good, at the corner of geary blvd & 16th ave in the inner richmond district.  parking wasn't too bad, as i scored a space on clement street just a couple of blocks away.", "author": "Ellen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "Matcha Green Tea (Blended) Tastes good. Not watery like other places. Friendly staff, clean bathroom with paper towels", "author": "Garren .."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-21", "description": "It seems there is a small group of regulars who like to sit and smoke outside of the 16th and Geary Peet's. I politely asked them to extinguish their cigarettes after hearing another set of customers complain that the smoke was bothering them too. The smoking folks promptly refused, informing me that if i did not like it i should go inside. I also alerted shift supervisors on duty who in turn informed these folks that they were not welcome to smoke at the Peet's seating. I have to note here that I feel for the shift supervisor who seemed annoyed/exasperated at having to deal with the situation. As a former Peet's employee who worked my way up from barista to mamager, I know what it's like to just want to serve coffee. \n\nAs a customer, however, I was quite disappointed with how the situation was handled. These folks continued to smoke despite this warning b/c the \"warning\" was barely that. It was not given in a way that was conducive to being taken seriously. I would very much appreciate some follow-up!", "author": "Danielle W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-18", "description": "I have nothing particularly bad or good to say about the quality of the food and coffee here.  Pete's is Pete's.  However, I had some of the worst customer service here today.  My girlfriend and I were both appalled by how rude our cashier, Victoria was.  \n\nWe were waiting in line behind a woman who was helped at the register on the left hand side.  That cashier stepped away, and Victoria helped the man behind us in line on the right side register.  She then realized we were waiting, and did everything she could to ensure that we felt stupid for standing in the \"wrong\" place.  She repeatedly told us the line started on the other side.  Meanwhile, we HAD entered the line in the correct place, but were simply moving forward as other customers were helped.  \n\nWe tried to explain this to her several times, and she kept failing to acknowledge the legitimacy of our thought process, and instead made us feel like we'd done cut the line, or done something else terribly wrong by standing two feet in front of where we were \"supposed\" to be standing.  \n\nNeedless to say, it left a vey sour taste in or mouths and we won't be coming back to this Pete's for a while.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-05", "description": "With Victoria as the exception, I don't feel particularly welcome and often times judged at this very-local Pete's. Is my coffee order too obnoxious or do more people feel this?", "author": "Sean H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-08", "description": "This is a great peets! Oh yes they are cookie cutter: they all look alike, taste alike, smell alike, etc. \n\nBut the vibe...the vibe here is really good....really chill. We are talking north of lake moms, cyclists ready for there marin sojurn, pet owners (with their pooches out side), people ready to go into gg park....I think you get the picture.\n\nFor that I give you guys 4 stars...plus you always give me extra in my double espresso...muchas gracias", "author": "David G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-06", "description": "The customer service here sucks so bad! Jonathan (our barista) was a complete jerk! I thought maybe his redeeming quality would be the drinks he served up, but I was completely wrong.  I used to work at Peets (maybe 10 years ago) and often times filled in at this particular one. The staff used to be pretty easy going and chill, and quality was usually a priority. Obviously the staff changes in recent years have really made this spot a poor destination to get your you cup of Joe. I recommend taking your business to anyplace other then this Peets. It kills me to say that because I really like Peets coffee, but the service is way flat and the results end up lacking in a major way because of the miserable energy in the air. I hate Starbucks, but by all means, hit up the Starbucks down the street and you'll at least walkout with some integrity.", "author": "Devin E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "I'm here multiple times a week, and I've never had anyone be rude to me, or have I considered it super slow.  I was just in there this morning for their rush hour, and they made my latte really quickly.  Love this place.", "author": "Geri C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-10", "description": "Whoever manages this location needs to step up their game and put together a sign that designates where the line starts when placing ones order. I guess that's asking to much ha? I do NOT like people all up in my shit, as in violating my personal space !!! Where exactly does the line start & end in this free for all ??? Idiots, also known as \"the masses\" simply need the most basic of prompting to somehow, someway shine that light on the order they inherently want. Does this make sense?", "author": "Henry K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-18", "description": "I love Peets but they screwed up a vanilla latte...I'm not sure how but it wasn't good! Very disappointing as I traveled a bit just to go there. Wouldn't go to this one again.", "author": "Kray P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-20", "description": "I don't get why people have beef with this place.  3 1/2 stars?  It's peets coffee people!    You get a great cup of coffee for $2. It's not some $4 artisanal coffee reeking of hipster body odor.  Speaking of body ordor, I need to go take a shower.", "author": "The Chubby Asian .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-24", "description": "5 Stars for the baristas!  Hip Hip Hurray and a big salute to you all for your patience to answer questions and for being the nicest Baristas!  Okay, the coffee and the baked goods aren't bad either.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-30", "description": "Although, I do enjoy Peet's coffee and the service here is nice, it's an awfully small location and while sitting there I constantly felt cold as if there was AC blasting from up above. I do appreciate how quiet it is most of the time and it's a great place to meet a friend or have a buisness meeting. I always go for the Matcha latte or Freddo's-can't go wrong with them or the tea selection! :)", "author": "Petra S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "I look forward to a great cup of coffee and a slice of banana chocolate cherry bread and a smily face every time I stop at this place! They also remember my name.", "author": "Svetlana K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "Awesome coffee! The baristas were really nice and helpful and even offered me an additional hour of wifi", "author": "Matthias C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-25", "description": "Coffee is ok. But the barista is super rude. Same girl, yelling at other customers & making the wrong drink. Twice for me. Not returning for sure.", "author": "Aj P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-10", "description": "Same ol menu. No  adequate amount outlets for tech users. Unless you get lucky to be sitting next to the compost and trash can by the sugar and cream (window side)\nUnless your a fan of cross words, i wouldn't stay too long in here.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-14", "description": "Coffee is legit and staff is super friendly. What more can you want?", "author": "Caye Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-27", "description": "Located on a wonderful corner location for one reason, and another reason cuz it's in my old neighborhood where I grew up. You can get a window seat and people watch.  Plenty of tables for two, but you can butt up tables if you need more seats. Several tables on the sidewalk too.\n\nClean roomy unisex accessible bathroom, and oh, the coffee is good too. Love Peet's for the strong taste and the caffeine kick. We ordered drip coffees and a slice of marble pound cake.  Great thick heavy generous slice.  \n\nSide note - I request a knife to cut our pound cake slice into convenient mouth size pieces.  I'm thinking of a plastic knife.  The barista pulls out a real serrated knife.  It was like a steak knife.  Used it and returned it.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "A great coffee shop anywhere you go. Chai Latte is to die for. They've got everything.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-02", "description": "Poor customer service, enough said!", "author": "Shaun E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-05", "description": "Friendly service, more spacious than the Laurel Heights location, and very clean. Love this central location, it's just too bad there isn't more free parking around here!", "author": "Jess C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-07", "description": "This place is usually the best and on top of everything. But today, what the heck happened? I came here, and there wasn't a line (yay). So i ordered \"could i have a tall black\" and the lady asked me something but i couldn't hear her so i kept repeating my order. The whole time she was staring at me like i was crazy. I then said \"a plain tall black coffee\" and then she asked me the craziest question, \"what type of milk!?\" where the heck did you get milk? I just wanted a plain black coffee...", "author": "Ally G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-02", "description": "I don't know why this Pete's is always so slow...  It's like its the training Pete's coffee for the rest of them or something.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "Peet's is an old tradition in the bay area (and now beyond) a cut above starbucks but still a bit cookie cutter, though; for the price (1 pound of house roast is only $12) it's hard to beat. I'm an ex-employee and I'm still not sick of the flavor or company! Good peeps work at Peet's.", "author": "Hunter S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-23", "description": "Normally I love this Peets and I come here often but today I was in a rush and really needed the caffeine and my order was messed up (which I know we are all human and it happens nbd) I paid for an extra shot and there wasn't one in my drink and they gave me a mocha which was not even close to what I ordered. They didn't even offer to remake it which I thought was odd because they normally do!", "author": "Page F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "My favorite coffee and this is my favorite Peet's. The morning crew is always upbeat and friendly.", "author": "Rebecca M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "This is a frequent stop, to do midday work in a calm atmosphere.  I used to visit the place the next block down, which I still respect, but I find Peets more aligned in terms of its design with my creeping old-age conservatism (at least aesthetically).  Four stars for it's sometimes \"lived in\" look, but five stars for its people.  I love that it has a kind of Cheers vibe for the regulars, such that as I hit the counter they've already gotten me my habitual caffeine injection source (green tea) and are friendly and playful.  Well done.", "author": "Lynn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-26", "description": "I love Peet's. \n\nI'd walk the extra blocks it takes me to get here. Any day. \nI don't (and I mean DO NOT) drink Starbucks, but oh I do love my Peet's. \n\nI'd get a Peet's infusion if I could.", "author": "Helen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "So long story short, I used to work at this very Peet's Coffee years ago..... though it was still a good place the employees needed some sprucing up..especially the cleanliness factor. BUT with that being said, this is now probably my favorite Peet's Coffee to go to. They somewhat recently remodeled the interior and added a lot more seating for the lurkers (like myself) who like to order a tiny coffee and sit there for 3 hours working on their laptops. Not to mention the new team is on it!!! Which is fantastic. In the morning rush when they have a line out the door you still only have to wait a few minutes to order and another couple until your drink is ready to go. It's surprisingly fast, considering that the Starbucks a few blocks down takes 30+ minutes from line to drink... basically an eternity when you just need a friggin coffee to start your already late to work kind of day. Any who, great team, great environment, cruddy parking after 9am but EXCELLENT speed and accuracy at the espresso bar. I try to swing by this Peet's every time I need a fix! : )", "author": "Brandi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "Most lattes these days are thin and milky; Peet's consistently provide rich, flavorful lattes - and pretty quickly (about 90 seconds if there's no line). Given the quality, Peet's is also a very good value - with baristas who are courteous and always ask your name. In other words, this is a smartly managed store.", "author": "Thirsty C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-15", "description": "Another 5 on top of the existing 5 star review.\n\nAfter a day of shooting and an excellent burger lunch at the local golf course with a good friend, I was in the outer Richmond and stopped by Peet's with the fellow for my usual caffeine fix.  The barista here is extremely friendly and she asked me if I wanted my usual Breve Latte.\n\nDAMN.  Talk about awesome customer service.  I've only started coming to this location for the past two months or so on a sporadic level and she already knew exactly what I wanted.  Extra hot too.  I'm hooked.", "author": "Miika M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-23", "description": "If you like your coffee bitter & strong, this is your place. As much as I want to like Peet's, I just can't do it. I've tried a couple of their locations now, and despite the attractive calming brown decor and friendly staff here, it's the consistently bitter coffee that will dissuade me from future visits. Sigh.\n\nOne more thing.. This branch of Peet's is located on the south side of Geary, so unless you sit outside, you'll never enjoy the sun with your coffee here.", "author": "Harry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-26", "description": "My favorite coffee shop in the whole world!! Besides the fact that Peets coffee is the best cup of joe - EVER! the people who work at this location are fabulous.  Unlike some baristas who seem like they hate their job, these guys are upbeat and really take care of their customers.  I work close by and stop by a couple times a day just to see my peeps!! and of course to get a medium dark roast cup of deliciousness!", "author": "Maisha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-28", "description": "Love this Peet's. There is a woman, Mary, who always helps us and can always make my little girl laugh. I think she's a manager/supervisor type person. If not, she should be. Mary has the unique ability to help customers efficiently, hold a conversation with them and still know what the team around her is doing.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-30", "description": "First, I want to apologize for walking straight to the order counter because I thought those 8 people in line were for the pick up line. \nSecond, I like your latte macchiato - good balance of milk and coffee!\nThird, your dark chocolate mocha freddo was overflowing. I made a mess when I try to put the lid on :( Also, it's way too sweet. \nEric (?) was really nice!", "author": "Shirley F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-10", "description": "Forgive me Peet's, for I have sinned. \n\nYou asked me what I would like to drink and Starbucks lingo slipped out of my mouth. With a slight look of disgust, you tell me that you do not know what size grande is. We both know that this is not true. I walked past Starbucks to get to you, so you'll have to excuse a bad habit. \n\nI like stopping in on my way out of the hood because your quick and you can make a damn good latte. Just cut me some slack on the occasional slip, okay?", "author": "Chrissy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-10", "description": "excellent cup of coffee, better than Starbucks, clean restrooms, nice location\n\n I like my coffee strong\n\nfast service", "author": "Mr Bolo B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-27", "description": "Generally the busiest, most cheerful Peet's location.  Don't be daunted by the long line when you hit the entrance, it moves fast.  And because the staff is so pleasant, it's painless.", "author": "Ellen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-30", "description": "Totally love to get our freedos here. It's usually not too crowded and there's always an open parking spot right out front. \n\nThe only problem is the taste of the freedos vary from time to time. Sometimes it's good, somethings it's too overly sweet (like today). I can't help it, I know my drink.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-15", "description": "This is my neighborhood Peet's, the \"other\" chain, the one that caters more to actual coffee drinkers. The drip coffee here is strong. Real strong. So if you need a little kick, Peet's fits the bill. That said, Peet's also stocks a variety of freshly roasted beans for your home drip coffee or espresso machine.\n\nSome of the beans that I usually pick up are the Arabica-Mocha Java, Espresso Forte, and Sumatra--I'm more into the full-bodied, slightly sweeter varieties for my espresso over the lighter-bodied, more acidic blends. And when you pick up the beans, you also get a free cup of strong coffee. Real strong. Guess everything comes full circle.\n\nOutdoor seating is also a real plus.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-28", "description": "So I have been living in the Inner Richmond for a little over a year now & I really do out of my way just to go this location because I backtrack for Peet's Coffee before I head to work. The workers finally have started to remember my name, they know what I get every time I'm there & I like that very much. They make a good single espresso & iced coffee with two shots too.", "author": "Rodney R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-05", "description": "This location is just not up to par. I love Peets in general, but this place often disappoints.", "author": "Elaine k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-13", "description": "I hate to sound like a parody of coffee culture in San Francisco, but you're pretty good for a chain, Peet's.  Your lattes at this location lately are scalding hot and make me feel like your baristas are more concerned with looking mysterious and interesting than making $4 espresso drinks well.  \n\nWhen I'm in the Outer Richmond, I'll go to the Art Bistro, Emma's or even Royal Ground.  They clearly need me more than you do.", "author": "Daniel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-26", "description": "I love their sugar free mocha, the best among other brands like Starbucks, etc.", "author": "Sid R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-02", "description": "I'd like to think i've had a million different kinds of coffee now to know good vs bad.\n\nand peet's = BAD COFFEE. \n\ni like to drink my coffee black and peet's is easiest the strongest coffee i've ever had. usually, i like my strong but I also like it to taste good and to be able to go down smooth. Peet's coffee is strong, bitter, and without much of a taste.\n\nIf you want good coffee around that area, I think Starbucks might be a better choice for you. \nBut if you just want to be awake and for a REALLY strong coffee, hello Peet's.", "author": "Funglin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-28", "description": "In order of best coffee chain I go to\n\n1. Peets\n2. The Coffee Bean\n3. Starbucks\n\nthat's all I have to say...", "author": "Michelle R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-19", "description": "Out of maple latte? Really? At 10:00 o'clock on a Saturday morning? With all the advertising and publicity that got us there in the first place? Wow. And noticed a totally broken outside chair as we left. Lawsuit waiting to happen. Get it together!", "author": "Darrell H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-17", "description": "Jennifer,  you're so zesty! :-) I'd love to chat more with you at Starbucks - oops I mean another coffee shop - over a cup of something. Max", "author": "Sergey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-08", "description": "This Peet's coffee location is the reason why I switched from a Starbucks girl of 10 years to a Peet's Coffee lover! Besides\nthe fact that they are only a block and a half from my house, they allow me to bring my dog in while I order my coffee and wait for it. As long as my dog is on the ground and away from food/drinks. The staff here is really nice. And they are fast! Even tho they're always busy, I never have to wait for more than 5 minute for my non-fat cappuccino. I once tried to order a non-fat cap at Starbucks, it was gross and water down. Taste nothing like the ones Peet's make! I walk my dog pretty often, so you can imagine the number of times I'm in there every week.", "author": "Kim D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-19", "description": "This is my neighborhood Peets. I forgive it for being less well managed than, say, Laurel Village. And definitely dirtier than many other Peets--wash the tables and floors every once in a while, please. But when I show up at 8pm on the nose and they won't sell me a bag of beans, well, that's just uncivilized. I would have paid cash and left them the change. Instead they blow me off from across the room. Guess it's time to take my business elsewhere.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-30", "description": "If only there was a Peets In LA I would definitely come here all the time instead of sucky Starbucks!\n\nI been wanting to try peets as soon as I landed so I finally did! Everyone there was soo cool and nice, I was talking to the guy for a while on his suggestion of coffee.  He even gave me samples.  I just ended up getting the Brew of the day, I forgot the name of the coffee but it was pretty damn good! \n\nNow I have to wait until I go back To SF to have peets ;-(", "author": "Freddy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-16", "description": "I've been drinking decaf for a few months now, mostly because a doctor told me to take a break from caffeine. I come here in the morning and I'm not even joking when I say that at least 3 days a week, they have to brew a new pot of decaf for my cup. Am I the first person who orders decaf, or do I just have the most unfortunate luck?\n\nAnyway, they brew it faster than the Starbucks a few blocks away and it tastes MUCH better. Their decaf tastes just as tasty as the regular one. And the people are always friendly and the coffee is ALWAYS hot. \n\nOther places? Not so much.", "author": "Jared S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-01", "description": "Another nice Peets spot with very friendly staff.  \n\nThis is a corner-spot location with big big windows to stare out of.\n\nThe coffee is the usual Peets' terrific java.\n\nThe last time I was there, the occupants of a table behind me was interviewing a person for a franchise opportunity.  I hope the guy got it, as it was very very lengthy.  I tried not to listen, but that's all you heard.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-17", "description": "Bitter, nasty coffee.\n\nI like strong coffee, but only if it has good coffee flavor.  I've tried Peet's several times, either due to convenience or free or cheap promotions.  I've tried a few different types of their regular coffee, and tried mochas, etc.  All have been bitter and nasty.  Not even a good amount of chocolate can save this stuff.  The only \"flavor\" that comes through is charcoal.  Maybe it's one of those genetic taste things, where only some people can taste the nastiness?  That's the only explanation I can come up with as to why some people like this stuff.  I got a free cup today, got a mocha with extra chocolate, and still threw half of it away.  It's not even worth it for free.  AM/PM coffee is better (not good, but better).", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-02", "description": "Dude's Mobile Phone: *Intro to a Metallica song*\n\nDude: \"Hello? Yeah..uh...I'm in line for my fix. Yeah. Yeah. Bye.\"\n\nSomebody's Grandma: \"How did you get your cell phone to ring like that? What tune is that?\"\n\nDude: \"Huh? Oh, yeah. I downloaded it from online. It's uh like by uh Metallica.\"\n\nSombody's Grandma: \"Can you do that with any song? I like old country music. Do you think I can get my grandson to find George Strait and Barbara Mandrell online?\"\n\nDude: \"Uh, yeah? Like I guess, yeah.\"\n\nSomebody's Grandma:  *digs into her HUGE purse* \n\"Can you write down the website and I'll have my grandson download for me. He's a computer genius.\" *hands dude a pen and paper*\n\nDude: \"Uh, Yeah, sure.\" *scribbles on paper*\n\nOverall: If you like Peet's coffee, then this is a cool place to get your caffeine fix. The baristas are friendly, tables inside, and a couple of tables for outdoor seating. The crowd is diverse. \nIf you are lucky, you may chance upon a conversation where one generation is reaching out to close the gap with another generation. \n*Precious*", "author": "Liz K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-25", "description": "I LOVE coffee and like this Peets and usually happy to visit :) The crew here is really laid-back, so much so it's hit or miss...", "author": "Lana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-08", "description": "Really. Strong. Coffee.\n\nWhat else can I say? When I'm in the mood for a drink that can shoot me to the moon for less than $2 I order a large house coffee. The good thing is that the \"coffee of the day\" is always rotating so I get to try a new flavor each time I go in here. This location is just 2 blocks from my house and although I'm not a huge coffee drinker I will visit this coffee shop anytime I get the \"jones\".\n\nNice staff, good location (for me), always reliable and good service, and a cup of coffee that does the trick everytime - nuff said.", "author": "Gabriel R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-28", "description": "Maybe I just have unrealistic expectations of what my coffee experience should be. I think it's because I'm a bit of a coffee snob. For two years, I did my time behind an espresso bar and was known for such stints as scaring my customers by popping out from behind the bar or establishing \"9:00 pm Michael Jackson hour\" during our closes. I KNEW my customers; I adored them. Shit, they gave me hugs when they saw me outside of the shop. My tips rocked and my co-workers loved me even more (well...it could have been because I made out with my manager once in the walk in fridge).\n\nAnyway, each morning, for the past six, SIX months I have walked into Peet's in the metropolitan tundra of the Outer Richmond on 16th and Geary. The faces started to be familiar behind the counter, much as I assumed my gorgeous face and striking fashion sense would be noted as well. One would think, yes? \n\nNot a single bit of small talk. Nothing. I stare longingly at the \"Customer of the Week\" polaroid on the counter and wonder what that person possesses that I don't. The \"Customer of the Week\" this week had a nickname on his polaroid for Christ's sake! I've started giving myself challenges to see what kind of reaction I get. I've said hi, I've smiled, I've waved to little kids and tried to make a joke about the irony of muffins being called \"low fat\". \n\nSo today, I reached for it. I attempted for a full lenght conversation on a topic that we all can relate to: how friggin poor we all are (I know those bitches only make $8.00 an hour). I notice my coffee went up 5 cents: \nMe: \"Wow! 5 cents! When did that happen!?\"\nBarista: \"umm, today....I guess...\"\nMe: \"Why is that? Do you think it has anything to do with the recession? That would be crazy huh?\"\nBarista: \"Um, yeah, I don't really know\"\nMe: \"Wow so you had to change all the signs and everything?\"\nBarista looks at menu. Pauses. Turns to me: \"Yeah. Guess we should change that.\"\n\nAnd that's it. 6 months. Endless $1.65 small coffees with room for cream and that is the longest and most in depth conversation I've had.\n\nSUCK IT PEETS. Your customer service blows. And I noticed that you haven't changed your inventory over the past half of year--those BS goldfish glass pitchers in the front of the store were cute the first time but not the 569th time. \n\nThe end.I'm going to Starbucks.", "author": "Lexi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-24", "description": "Dear Mr. Person-who-works-at-Peets (sorry I don't know your name),\n\nYou are my savior on this Monday morning. Thank you for allowing me to to buy a cup of coffee with the change in my purse. Thank you.\n\n-Grateful Peet's (now loyal) Customer\n\n\nSo today it was a miracle that I woke up. After making it to SLO and back in a day, I am quite beat this morning. So I wake up, get ready and yay \"I'm leaving a few minutes early, I can make it to Peets for some legal speed!\" I'm out the door and \"wait, I forgot my thermos!\" (I'm trying to save the world here people! One coffee cup at a time)\n\n Alright, so I'm driving to Peets, desperately trying to make it there eventhough I can barely see out my window from the fog, try to park and \"sh*t, streetcleaning!\" So trying to avoid a 40$ ticket, I circle the block, then make a highly illegal 3 point turn in the intersection, almost getting hit by an old lady in a volvo (fyi I drive an oldsmobile), then park about three feet away from the curb \"f*ck it man, it's monday\"\n\nI go in, empty cup in hand, and then I realize I forgot my friggin credit card in my pants! With not even a dollar in my wallet I'm desperately scrounging around for change while to the guy calls \"next\" and I walk up, ashamed. \n\n\"I don't have enough money.\" as I hold out my 86cents in change\n\"It's ok, don't worry about it\" says the Peets guy.\n\"What?! Thank you, thank you!\"\n\"No problem.\"\n\nLike I said, savior! Now I'm at my desk, all jittery and lovin it! So I had to write this to show my appreciation.\n\n*This caffeinated rambling made possible by the wonderful Peet's coffee*", "author": "Marie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-07", "description": "OH MY GOD!!!!!!!!!!!!!!!!!!\nI thought I was seeing things and literally went across 3 lanes of traffic to score a parking space in front. Fortunately, I had the remains of my mug of coffee from the Peet's in Laurel Village and just  \"filled 'er up\".\nThis is my new pit-stop before school pickup.\nDid I mention they open at 5:30 in the morning???????????", "author": "Ivy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-16", "description": "8 Peet's down and falling fast...\n\nHere's a little insider tip on this Peet's: they have several tables on the sidewalk (at least on nice days).  Which, in the park- and bench-starved Outer Richmond, can be a lifesaver.  Say you just ordered some hot scones or breakfast sandwiches at John Campbell's, and need a place to sit down and eat them.  Run over to Peet's, order a latte, and devour your goodies outside, away from the prying eyes of the baristas (although, maybe they'd be cool if you sat inside--this is laid-back California, after all (and trust me, it makes a difference)).  Coffee quality and ambience is just like the rest of 'em (although man, the steamed milk is as light as air here--is that a good thing or a bad thing?).", "author": "Wes M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-04", "description": "I work at Peet's Coffee and Tea, so perhaps I'm more critical than the next person, but I was incredibly unhappy with my experience at this store when I was visiting SF.\n\nFirst of all, the girl at the register was not friendly at all.  We were not even greeted prior to giving our order, and she looked annoyed the entire time we were standing in front of her.\n\nThe barista wasn't particularly friendly either, but he did at least have a smile on his face.  Unfortunately, his drink-making skills were not up-to-par, as my latte macchiato did not taste as it should have.  Not only were the shots NOT short-pulled, but they actually tasted a bit over-extracted and burnt.\n\nTheir condo cart was a mess, and not stocked as it should have been, but that's more of a nit-picky thing from someone who knows Peet's standards like the back of her hand than a serious concern.\n\nOverall, I was much happier with my experience at the Van Ness store.", "author": "Chelsea S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-24", "description": "love the wheat free snacks - coconut almond bar, YUM, espresso was smooth and staff was friendly, service promt. relatively spacious location for sf.", "author": "Coco J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-18", "description": "Been coming here for a few months now since I moved out into the outer Richmond. The coffee is great and the staff is friendly, but there is a reason for my 3 star review. The staff takes their sweet time onto helping the people and making sure that the line moves quickly. I literally stood in line for about 5 minutes today with only 1 person in front of me at the register.", "author": "Vlad M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-11", "description": "I think Peet's reputation stands on its own, but for any Neophites out there, why go to Starbuck's when you can have Peet's?  Nothing like a good cup of coffee from a locally (Berkeley) based company!  \n\nAnd yes, I'm thrilled to have them in our neighborhood, too!  Royal Ground is a chain, too.  Nothing wrong with a Peet's in the 'hood.  They are good neighbors and a conscience-driven company.  But I love the little local Bazaar Cafe, too!\n\nI don't think Peet's will drive out Royal Ground.  Many people drive to Peet's, then leave.  Royal Ground will probably have its staying power for the fact that it is so spacious and so many people do go there to hang out and do their stuff!  It doesn't have to be an 'either or\" world and there are plenty more coffee shops within blocks of Royal Ground-even Starbucks which came in after them and haven't closed them down.", "author": "Leslie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "I like this location because its really close to the house and on my way. I haven't gone here where the line is crazy long like the one near Drumm and Market or the one inside the Embarcadero. Maybe its because I'm only here after 5pm? but who cares its convenient for me and thats all that matters. lol", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-22", "description": "So I'm happy to finally have a Peet's in the neighborhood. Really, I don't like the Starbucks so much that's over on 18th, there's always too many creepos and weirdos around.. well, I guess that's a given cuz its inside the Wells Fargo building.\n\nOKAY.. so Peet's..\n\nit was clean, the baristas were nice and my friend and I were able to sit outside in the sun and not be harassed by homeless or weirdos.\n\nMy drink was fantastic.. why? SUGAR FREE VANILLA LATTE.\n\nSeriously.. anyplace that offers my diabetic pancreas an option to go without the sugar and still get a sugar sweet sorta flavor is a good place to go. \n\nOh and I love strong coffee and peet's definitely delivers. PLUS my drink didn't have that sour milky aftertaste like I always have at starbucks... =D", "author": "Diana R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-05", "description": "I like PEET'S. \n\nI don't care if it's a chain (because this chain began in SF and started as a local - and I supported them since I was in High School).\n\n...and I HATE starbucks.", "author": "Ted P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-29", "description": "\"If you build it, they will come\"\n This location of Peets has surprised us all. OMG. I can see it from my window. WOW. There's life on that corner after all! (who knew?) Next time you're shopping at Ross across the street, there'll be somewhere to go afterwards to spend the money you just saved. AND, if you brave that laundrette (almost next door,) there's now somewhere to go close by that's  civilized. \nWe'll see how they handle all the homeless in the neighborhood.", "author": "Roanna Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-21", "description": "I was really surprised to learn that there was one popping up out here in the cuts. Only a matter of time, really. The only reason I don't rate Peet's 5 stars is that I don't like their mochas. But the hot chocolates, iced drinks and teas are all very good. I'm a big fan of their Genmai Cha, green tea with toasted rice and little itty bitty pieces of popped kernels. The inside is comfortable if edging just a little bit on the cramped side. \n\nLike with any new business, I always wait a few months before really having an opinion on what the staff is like. Sometimes they get better and other times not so much. Right now everyone is very green and new to the process.", "author": "cyndi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-08", "description": "What can you add to Peet's Coffee that hasn't already been said?\n\nExcellent quality, strong coffee and a staff that is independent minded yet actually wants to take your order.\n\nTheir baked goods are meh,  House of Bagels is just down the street so I would recommend them for food type items.\n\nThis particular location does seem to be WAY too crowded past 10 a.m. so if you are a late riser prepare to compete for a chair.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-30", "description": "My favorite Peet's so far-I've frequented several. I love the consistent quality of the latte macchiato, just superb with a sprinkle of fresh nutmeg using the grinder that is usually at the bar.  The crew is the best, friendly and efficient.  I keep my Peet's card close at hand; when I add $25 I get a free medium drink so that covers my latte macchiato. I am Peet's all the way. I love that they usually play classical or jazz at a decent decibel level so you can actually enjoy the music as part of the ambiance rather than having to shout over it. \nWish they had a tasty breakfast sandwich like Starbucks, but then they'd have to profane the sacrosanct environment with a microwave. I've been known to pick up the breakfast sandwich at Starbuck's then go to Peet's for the latte macchiato. Some of the crew address me by my name, which is amazing at 6:30 a.m. since I barely can recite it myself at that hour.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-11", "description": "My goodness...... such great coffee. If you like your coffee dark roasted and strong, this peet's coffee will do you justice. I find myself here almost every day and at all times, morning, afternoon, evening, all the time. This is a great establishment, and I am so grateful that it's so close to my house! On days where it's just hard to move, or when deadlines need to be met, I am always visiting my favorite spot on Geary, Peet's Coffee and Tea. Though they have some of the best coffees in town, the lines are not bad at all because of friendly and efficient service by the baristas. The only criticism that I have comes from the one time I spotted a couple of fruit flies by the pastries... since fruit flies are usually employed by aging carbs and birthed by neighborhood flies within the vicinity... that was terrifying. HOWEVER, despite my graphic description, it is an exception and not the rule. I am bold enough to continue frequenting this business. yes. more coffee for me.", "author": "simon k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-26", "description": "i choose this coffee place cuz there was parking in front. (funny how that works!) i notice tables outside for leisurely sipping and reading.\n\ninside, there were at least 5 people in line for one window. and only one at the first window. after waiting a few minutes for the lady to get her  choosen coffee grinded,  it dawned on me that that i had inadvertantly cut in front on the others  in the main line. it didn't seem to bother anyone since the main line was moving fast and my line wasn't moving. my bad. this lapse in observation reinforced my need for coffee to reinvigorate me. \n\ngood friendly service for med coffee of the day (1.80) pretty strong and a little bitter. with some half and half and sweetener, it was drinkable.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-25", "description": "I miss this place; the baristas would always know enough about the different coffee beans when I wanted to try a new bean; they'd grind it up quickly and always stamped the name on the bag perfectly. I think i might have been introduced to Major Dickason's here. Talk about addiction.\nThis site has outside seating which is fab for those warm days. There are a bit more than a handful of tables for indoor seating.\nI love Peet's a thousand times over Starbuck's. Why spend green on a cup of milk and sugar when you can enjoy the actual flavor of the bean or espresso in every cup! Helloooooo!!!!", "author": "Quan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-18", "description": "Espresso drinks:  okay. ...I've had better. Strong espresso flavoring doesn't always add up to a good, balanced blend in the drink.\n\nPastries:  Bit on the hard side. Don't get the cookies if you need Denture-grip. My Auntie wouldn't eat it. The pound cake was dry. You NEED a drink with it.\n\nAmbiance:  crowded....nobody moves. Maybe its just me, but I can't do my homework in a place with music going on, the espresso maker steaming its brains out every 5 minutes,  kids whining, they guy with borderline rank B.O. and some asshole talking about his real estate ventures.", "author": "Barb B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-05", "description": "This location takes the reins from the Berkeley/Shattuck location as my new favorite Peet's. Super consistent, really friendly staff, ample seating inside. I am so down for this place.\n\nOh, and now that I don't have to go to Laurel Village for my local Peet's fix, I'm spared the agony of being in the midst of idle, 30-something housewives dragging their bratty children around and carrying their dogs around in vented handbags. That's definitely a perk.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-09", "description": "I'm a pete's fan for a long time, but today I'm not talking about the coffee, which is always great- nor am I talking about the great service ie: when i walk into my Petes the barista just looks at me and has my drink made b/4 I finish at the register! Today I'm talking about their marble pound cake. I am totally hooked on it. Yes I've been to many top bakeries in town, even Tartine in the Mission, which is 2x the price and not as good!! Marble pound cake, yep/makes my day!", "author": "E S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-28", "description": "Went today.  11-4 was the Friends and Family promotional event (everyone counts as friends and family at Peets, unlike at The Gap...)  -free drinks and free pastries!!!  I had a tasty large, unsweetened iced tea.  I brought home a yummy piece of carrot cake, which I had for dessert after dinner.  Thanks, Peets.\n\nUpdate -- it gets better and better.  Peets emailed me a coupon for a free drink and I chose a big, rich, delicious chocolate and carmel Fredo.  Very fattening, but what a treat!!", "author": "Cara C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-22", "description": "i love this peets!  as other reviewers have said, the servers are great.\none thing, though, no matter how many people are working there, no matter if i am the only customer at 530 in the morning, the espresso and coffee drinks take enough time that you can relax and read a magazine while you wait and forget what you even ordered.  i feel shallow and ridiculous griping about this. oh well, i said it.\nthey are open super early which has saved my sleepy buns.\nand thats what i have to say about that.", "author": "yayoi s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-20", "description": "Super nice baristas, super strong coffee.  They keep their milk station pretty clean too.", "author": "k h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-27", "description": "This is the closest Peet's to my house and it isn't even that close. But when I'm in the neighborhood, I always stop off here for a medium vanilla latte. YUM!!", "author": "Jen D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-12", "description": "I had some time to kill before taking care of some business in the neighborhood, so I pulled out my iPhone and had Yelp find me a coffee shop.  I should have run the other way when I saw Peet's come up, but I ignored my gut and went in anyways.  I ordered a small americano with two inches of room, but I got a medium americano with no room.  The coffee also tasted horrible, it was both charred and watered down at the same time.\nPeet's can't get a simple order right and serves coffee I wouldn't wish on my worse enemy.  Never again.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-22", "description": "I always try and give business to local mom and pop coffee shops, and for the year and a half i've lived in the Inner Richmond I've tried all of them.  But I've got to say,  this Peet's beats them all.  The coffee is just better.  I don't know what they're doing different, but you can taste the difference instantly.  And I'm talking about regular, drip coffee, not lattes.. although the lattes are far superior to those I've had at other establishments.   oh, and did I mention the customer service?  You get your coffee with smile here.  Everyone is so friendly.", "author": "kimberly k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-11", "description": "I'll take Peets over SBs any day of the week. And now that this location is only 2 blocks away, I'm here at least once a week to get a gourmet coffee instead of the crap I brew at home and sit with my bf and talk over croissants...love their philosophy...r.i.p. Mr. Peet...you did good...", "author": "Kira B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-13", "description": "love Peet's but the pumpkin spiced latte is not good.....", "author": "Karen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-23", "description": "I know, I know- you're supposed to support the smaller mom & pop coffee shops...and there are plenty of them in the Richmond.  But where else can I get coffee brewed to a perfect 10 every morning on demand?!?  This is the perfect re-start to my hectic mornings!  (I say \"re-start\" because this is where I stop after shipping the monkeys off to school.)  Try to get there early because they never seem to have enough of those perfect lemon scones.", "author": "Judy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-15", "description": "Close to home.\nAlways made no more than 30 minutes ago. FRESH!\nFriendly baristas.\nLots of tables to sit and read the news. Cool.", "author": "Jimmy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-21", "description": "I am all for Peet's. Opening should be 1/29/07. Don't worry, you can study for hours. PS: There chocolate covered Cherries, blueberries and toffee nut crunch is to die for and they have an amazing variety of the finest tea and Peeties love talking about it at the bean/tea counter.", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-23", "description": "I LOVE this place..lattes are consistently awesome and a few of the staff remember my name when I walk in....Peter is a delight...friendly staff, clean place, consistent good coffee, not too crowded and parking when needed. HIGHLY RECOMMEND!", "author": "Bing B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-20", "description": "Peet's is my favorite chain coffee place. Think I've been to all of them several times by now. I was so happy to see a Peet's near my work until I experienced the customer service. Horrible, horrible, horrible!! Long waits, inconsistent coffee, containers were always out of milk... This crew will give Peet's a bad name. Please get better. I still love you", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-14", "description": "big fan.  \n\nmargaret might be kinda cute in a julie andrews sort of way?\n\nbig fan.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-29", "description": "Love this place.  They are so knowledgeable, helpful, and I love that they believe in their product.  I drink their teas and their coffee, and found whenever I \"stray\" I am disappointed and keep returning to Peet's.", "author": "caroline B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-25", "description": "sorry. i guess i'm one of those elitist snobs who thinks if there is a local business of the same or better quality on the same block you should go there. how many local (and good) coffee shops are within a 3 block radius?   PS why did you drive there?", "author": "Pflip W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-18", "description": "I love the coffee and service. I miss this place where I used to have my breakfasts.", "author": "CAPM R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-05", "description": "now Peets crawled into Jeffs Jeans....ol timers knew Jeff very well...never got over the GAP", "author": "miriam b."}
