{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-19", "description": "When I was younger, I'd always go to Starbucks because I was, like any other middle schooler, obsessed with frappuccinos. Now that I'm older, I definitely prefer a caffeine kick rather than a sugar rush. Between Peets and Starbucks, I don't really have a personal opinion on the quality of their beans but I would say that since I prefer drinking matcha lattes that I like Peets far better. The matcha powder they use is pure and without any added sugars unlike Starbucks because I don't really like to get my extra calories through drinks anyways. Not sure if this is a seasonal drink as well, but I've also enjoyed the Golden milk lattes although those are mostly syrup aside from the turmeric powder haha. I guess what I like about Peets is that they certainly put in a lot of thought with experimenting with their drink options from the different spices used in their lattes to their fog drinks. They get creative but not outrageous the way that Starbucks can get sometimes..\n\nThis particular location is in the ferry building so it can have busy hours and so service can feel rushed and pressed for time but I've always had a good experience here! The employees are very pleasant and they work fast. Today I ordered a matcha and thet even asked if I wanted to have the remaining drink poured in a sample cup since it was more than they expected. Small gesture but totally appreciated :)\n\nI also prefer the rewards system at Peets since it's based on check ins rather than how much money you spend. If you have down time this is a great place to come by and just hang out while enjoying a beverage!", "author": "Samantha C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-16", "description": "Always busy with looooooong lines.  Coffee is ok.  \n\nDon't expect service or peace of mind here.  \n\nI just happened to get seated with my coffee , and getting situated when this lady (Peet's employee) came and started sweeping really obnoxiously loud around the table section.  (Tables were all full). \n\nShe asked each customer to move their feet or stand up so she can sweep.  I asked her if she has to do it now, or if it can wait until later.  She kept on proceeding saying \"sorry sorry\" like 20 times but continued sweeping.  Obviously not sorry at all...‍‍\n\nAs a long time Patron of Peet's, I am disappointed.\n\nClean later when there is downtime (e.g. afternoon) or before closing", "author": "Sunny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "We checked in at Peet's Coffee on our way to Napa Valley in May of 2017.  I prefer Peet's Coffee over Starbucks any day.", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-15", "description": "Great location & great service for the crowds & the line on lunch hour moving fast.\nOrdered matcha green tea latte with almond milk but the taste was just ok, not my fave. Maybe next time I try something else.", "author": "Rene Ray L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-12", "description": "it's been cold and raining in San Francisco the past week or so. I recently tried Philz hot chocolate so I wanted to try Peet's since I'm a fan of hot chocolate but not coffee (yes I know it's weird I'm like 1% of the population that doesn't like coffee).  \n\nI enjoyed my hot chocolate here but would have to say it's a smidge below Philz's but still definitely better than Starbucks version. \n\nHot chocolate rankings (major chains) :\n1) Philz\n2) Peet's\n3) Starbucks", "author": "Rod M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-07", "description": "The barista who took my order was really friendly and answered all my questions about the new drinks but the guy handing out drinks seemed a little rude. I guess there are prob a lot of tourist here during the summer but he kept yelling over and over again when someone didn't pick up their drink. Guess I'm not a big fan of yelling, was just trying to enjoy my drink in the tiny bar area. There's not a lot of seating here... And I was exhausted from hours of wandering around in the sun. I started to go outside of peets near the bookstore but there was a sign warning people about purse snatchers !! lol so I went back in by the yelling coffee guy. Overall I love peets but I wasn't too fond of the setup here... It was a big store but the seating seemed cramped. Hardly any outlets and I didn't really like my drink at all but it was something new I tried and I didn't want to deal with talking to the yelling guy about fixing it lol oh well", "author": "Coco J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "Out of all the coffee shops located inside the Ferry Building shopping plaza, without a doubt Blue Bottle definitely dominate and draw a HUGE crowd. It is definitely my choice too, as some of you have witnessed from my Review of the day back in 2009, which seems like a long time ago. \n\nBut on February 7th, this day belongs to Peet's. Because the Berkeley franchise is having the Golden State Warrior's blend. And by promoting the limited edition blend, this Peet's location invited Javale McGee and Kelenna Azabuike from the Warriors in making an appearance by working there and signing autographs. \n\nIn addition to meeting the two Warriors, I also bought a bag of the Warrior's ground. For $16.95, the blend has a bold and smooth Kenyan and Guinea flavor. Both countries produced some of the better tasting coffee in the world. Surely the Warriors picked a pair of great blends and combination. \n\nAlso with my coffee bean purchase, I also got a green tea latte for a discounted cost. Peet's is best known for the coffee, they also make some outstanding teas too. And the green tea latte is legit. I would never drink that blended drink from anywhere else. \n\nThe Warriors blend is only available until the end of February at all locations, though I am not so certain and they may carry longer than the initial ending.\n\nI hope Yelp do not remove my Review of Day from Blue Bottle from 2009. \"It is just one day, damn it!\"", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "The Peet's here has a shorter line than many other coffee shops in the area, the baristas are fast and there's lots of space!", "author": "Kulmeher D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "This place deserves 5 stars, great service, coffee was excellent, line was long but coffee was ready in no time. Very friendly people, i will go back again, also the location is so nice being inside Ferry Building it's so nice just to walk along the water with your coffee. Girl that took my order was so friendly you can tell they care about their customers and their jobs.", "author": "Nihad V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-27", "description": "I'm writing this review from the future date October 27, and staring at my recently purchased juice which expired on 9th.  Am I a time traveler? No, it's Peets selling well-expired juice.  I hope I don't get too sick.", "author": "Peter K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "Loved it. Very casual and friendly staff. Great start to the walk along the piers. Love their bear claws.", "author": "Jacky C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-03", "description": "Sally was a great cashier and remembered me and my drink,but they have bugs in pastry case ,totally gross,Sally gave me a bug free cookie .I told her thanks.I wondered why they have lots of pastries,no one wants extra protein.", "author": "Terance C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "The employees who work here are super nice and helpful. A great way to warm up when it gets super cold outside and need a drink to warm you up inside. Got hot chocolate with whipped cream and a late night treat of a chocolate chip cookie. You can't go wrong with that during the holiday season.", "author": "Magz K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Can't go wrong with this location. The staff is friendly and fast. Consistent product.", "author": "Jeannette M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-26", "description": "They do not cap your hot drinks for you and they ran out of the caps so you had to wait. The wait for the drinks was very long. 15 minutes plus. I could have burned my hands transporting the drinks. I had to wait for the lids which can cause the drinks to get cold.  Very disappointed. Understaffed.", "author": "Stacey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-01", "description": "I'm guessing they didn't order extra chocolate and soy milk for the holiday weekend. This location is okay, but they seem to get overwhelmed when they get a large crowd. I would think they would be used to it since they get the ferry commuter crowd five days a week.", "author": "Neni E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-15", "description": "I find that most coffee shops are ripoffs of Starbucks, but there was simply something special about this place. The interior in a way invited you in and asks you to sit for a while. I love the people that work there because they are nice and seem to like what they do. There is so much good about this place, but there wasn't a lot of good seating. 3 stars", "author": "Barry A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "I love Peet's Coffee  .....\n\nThe best coffee and very friendly staff ..\n\nThe coffee is better with a big smile...\n\nThanks so much...", "author": "Angel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "My first stop at Peet's! Wish I had checked in before I ordered because the discount was for my exact purchase! \n\nYou've got 3 locations within this one building at the pier to fuel your coffee addiction : Peet's, Blue Bottle, and Starbucks. I indulged in the pretentiousness that is Blue Bottle earlier this month, so decided to try the other local guy out. \n\nBusy location given its touristy housing at the pier, but well managed and the line went quickly. \n\nI ordered a small Mayan Mocha, a warm seasonal drink. It was nicely spiced with i-couldn't-tell-what .. maybe cinnamon and something hot, like chili? I almost tasted a hint of anise, and I hate anise, but anise or not, it was nice. I obliged with the whipped cream, because duh, and sprinkled more cinnamon on top, because Fall. \n\nMy boyfriend had their cold brew, and loved it way more than Blue Bottle's. Just because it's cold brew doesn't mean it has to be bitter rocket fuel, BB; Peet's is sweetly on point. \n\nI indulged in a Florentine cookie because 1- I love those things, and 2- they looked craftily done (not your average crumble of almond, but instead slivered almonds beautifully attached atop chocolate). See photo. It was the best Florentine I've ever had. \n\nPeet's has got himself a new fan. :)", "author": "Amanda W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Great friendly service...a great way to start my vacation. Jenny and Aidan went above and beyond to take care of us!!!", "author": "Misti R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "This is one of my favorite Peet's. You can't beat the location and sipping Peet's coffee by the Bay is one of the great ways to enjoy this beautiful city.", "author": "Jan Orhun A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "This is the place were I get my morning coffee on the weekends!\n\nWhat I like about it:\n- Love the iced mocha or iced latte taste! Flavorful, and very creamy! The way I like it!\n- The personal is very friendly, and really consistent in delivering the same great flavors and taste in the prepared drinks!\n- The coffee shop is located in the heart of the ferry building, next to a spacious seating indoor and outdoor area!\n\nWhat needs improvement\n- Many of the snacks they have (I.e bagel) taste less than average", "author": "Gilbert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "First experience with Peet's Coffee! So delicious!!! We had breakfast sandwiches too!", "author": "Whitney N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "I love Peet's,  Peet's loves me back. My almond matcha is always perfect and sometimes I get free size upgrades ;)  also I would recommend to try vegan scones, so so good, reminds me of the Russian ginger bread a little.", "author": "Liza B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-14", "description": "Service at counter-great! First time ordering \"undertow\" a concoction of espresso, half & half, and vanilla flavoring which is a few gulps of deliciousness. Only problem... Tepid warm :-/. Which unless I order an iced coffee I found to be disappointing. Now maybe because of the milk to coffee ratio, there's no way to serve this hot? Hmmmm....plus getting it in a paper cup really does this shot an injustice. It shows it layered on the menu board, which you'd need a clear shot glass/mug to achieve. I used to make layered lattes back in the day working at a cafe, they do look quite impressive. Oh well 5 stars for flavor, 2 stars for heat. 3 and stars for serving a lukewarm drink.", "author": "Susan D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-03", "description": "The barista screwed up all 3 of our orders in a row, then told me a small is actually a medium (I ordered a large) and then when I pointed out responded with \"do you NEED me to make you a new one?\" Well, geez. No. But I do need to write this poor review", "author": "Frank M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-07", "description": "Never had service this awful; ordered a regular coffee and I have never waited longer for even a full course meal. I asked multiple employees for my coffee and no one could figure it out... there were several people in line but it was not particularly busy. Was given attitude when I finally received my coffee. Not thrilled.", "author": "Kristin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "I don't drink coffee, but a free snickerdoodle cookie from Peet's really came to my rescue this past Friday night. \n\nI wouldn't consider myself a picky eater (I prefer \"cautious\"), but if you read my review of Cowgirl Creamery Sidekick - which surprise! you probably didn't/won't because why would you - I took stupid and unfounded issue with the way my grilled cheese sandwich was being prepared at the time. As my husband was enjoying every last bite of it, I needed to find something to eat fast so I figured I would duck into Peet's and see what they were offering around closing time.\n\nEnter the snickerdoodle cookie. It was really the blandest thing I could find, which is not a question of it's quality or taste but rather just the \"flavor profile\" I was looking for (really what I look for in general when dining out of town, which is super cool, I know). The gentleman behind the counter really didn't look like he wanted to make another drink so I think he was pleasantly surprised when all I asked for was the cookie. \n\nAs he was ringing me up, he realized he no longer had a till in either register so he gave it to me for free! Score! And while you may think I'm silly for appreciating such a triumph, we all need to realize that stuff can get expensive not only in the Ferry Building, but all around the City by the Bay - whatever coin I can save is precious indeed. I was on my way and you best believe I savored every morsel of that dang cookie.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-22", "description": "Friendly staff and good, strong coffee! Really, is there anything else you need?? I like their cold brew, its strong and robust. I like that you can get fresh beans here as well. They have a decent amount of seating at this location as well. I do like their Earl grey tea latte, it's simple and warming on these cold, rainy days! Go here if you need a quick pick me up and want to skip Starbucks lines!!", "author": "Megan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-30", "description": "Arriving from the across the bay in the morning and needing something to get you going for a day of walking through SF any place that serves caffeinated beverages will do. Enter Peet's Coffee at the Ferry Building. Open and airy, but be prepared for a line with the pedestrian traffic here. There is some seating in the stall where the business is located but more is down a ways to be shared with other food stalls. It was the beginning of the holiday drink season so I allowed myself an egg nog latte. I do appreciate that they used real egg nog and not a syrup. Good on them!", "author": "Desmond F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "It's busy here at Peet's Ferry Building but the barista's really hustle when there's a line.\nThe non-coffee drinks are terrific!\nTea, chai, tea-coolers, juices, water...so many choices!\nPair the beverages with food from Delica Japanese deli.\nTea + Japanese food - of course it's a fit!", "author": "Joanna T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-30", "description": "Called them before we go they said he will be signing suddenly in the last they changed their mind just like that. A lot people got disappointed the way they told people in line who just waited for nothings. So I guess the how they attract customers so lame and weak.", "author": "Juanito D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-31", "description": "I was once told by one of my friends that Peet's has a better tasting and stronger coffee than Starbucks.  Well, the only way to find out is...give Peet's a try.\n\nI like Starbucks' caramel frappuccino very much, and that's about the only thing I order from them.  But I wanted a change from that same-o, same-o usual beverage.  My last trip to a Starbucks was just okay - nothing to write home to mom about.  The caramel frappuccino no longer gave me that wow factor and I just wasn't feeling it.\n\nEarlier this month, and every time, my husband and I have ridden the ferry to SF, we have made it a habit of coming to this Peet's before we board the ferry to head back home to Alameda.  I order the medium pumpkin freddo and he orders the medium caramel latte.  Having the pumpkin freddo at least five times, I notice it has a stronger taste and is definitely better than Starbucks.  Alas, the pumpkin freddo is only a seasonal beverage.  The more we visited Peet's, the more it was an enjoyable experience.  \n\nYesterday I was a solo act (hubby did not come along) and stopped at this Peet's.  Instead of ordering the same beverage, I decided to try the chocolate caramel swirl freddo.  Which was better - Peet's chocolate caramel swirl freddo or Starbucks' caramel frappuccino?  Peet's beverage was stronger and more flavorful than Starbucks.  I am now convinced...lol.\n\nNo more visit to Starbucks.  This Peet's is my to go place when I'm in SF Embarcadero area, and my friend was right about the taste of their beverage.  Four stars all the way; and yay, I am a Peet's fan.\"", "author": "Carol C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Ordered a specialty latte and they nailed it. Truly a great job.  \n\nEmployees seemed a little on edge but I can imagine  what they had been dealing with on a busy Sunday morning. \n\nWe will be back.", "author": "Nicholas Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "DRINKS:\nYummy lattes here!! I am so in love with GREEN TEA LATTES!!! Try one if you like green tea!!! I love the view at this one since you can go outside :)\n\nSERVICE:\nEveryone is nice here.\n\nTIPS:\nCheck in on yelp you get a coupon for coffee!\n\nWOULD I RECOMMEND IT? Yes", "author": "Kelley Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "The coffee here is always perfect. The service is friendly and accommodating to my wife's special order.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "The hot chocolate wasn't too sweet and their caramel macciato wasn't too strong. Took a while to get my order because they were a bunch of people who ordered ahead of me waiting for their drink, so no complaints there. They were pretty organized with orders despite the huge crowd.", "author": "Tina R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-13", "description": "I love Peets coffee and atmosphere, however I think this particular one and maybe it's because the ferry is there and more tourism, but the service was not top notch. I waited for 15 minutes for my mocha to come out on top of that the baristas forgot another persons latte who was waiting before me. He brought his own cup and baristas did not see or distracted with their conversation. That person was not happy and I can see his frustration.  I don't think it is the worst Peets but I can tell baristas are taking their time and chatting while people are waiting ..", "author": "Galya T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-15", "description": "This Peets, with Blue Bottle Coffee, is one of two coffee shops in the Ferry\nBuilding. Stopped by here on a recent Monday holiday afternoon and had\nfortuitous timing - walked right up to the counter, no line! Ordered a\nPumpkin Chai Latte, it was perfectly made, and then wandered outside to\nenjoy my coffee while people watching and soaking up a view of the Bay -\nlife is good!\n\nSeating inside is somewhat limited, but there's a good-sized common area\noutside the doors with a number of tables, and you'll probably want to sit\noutside and soak up the views if the weather is at all decent.  Hard to deny\nthis Peets a top rating when it's blessed with such a location.", "author": "David F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "Really nice scenery and relaxing. You see the ferry take off. Enjoyed my coffee. Only one drawback- the baristas do not place lids on coffee. I am clumsy!!! Thank goodness I made it to the straws", "author": "Natasha L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-11", "description": "Basically, a poorer version of Starbucks. Watered down and bitter coffee - if you need something quick and dont necessarily care about good coffee - this'll do.", "author": "Roman G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-26", "description": "I love Peet's Coffee, but today an employee gave me a bad experience. I waited in line as usual, was attended to. Mid-through my order I was shoved aside by another customer. The Barista decided to cash out a customer while I was being attended. Mind you I have yet to relieve the product that I purchased. I was upset when I finally received my coffee that I walked away. The cashier did try to apologize, giving my change. By this point I was going to accept her apology. This happens way to often. So screw this location. \n\nIn my attempts to talk to the manager, I was belittled by the shift lead. I am not even sure he heard me, as he tried to push some $1.00 off coupons in my direction. I did not accept them. He stated \" It's pretty hectic\" my response \"really?\" How about some communication? Nope just shove customers aside. I don't appreciate being treated as \"number\"", "author": "Johny M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "Pete's coffee is AWESOME !!! The location on J Street staff are the best in customer service,helped me choose the best sugar free option ever! Will always come here....like family", "author": "Saundra L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-12", "description": "Our family stopped here on our trip by ferry yesterday. I asked my wife to order me a dry cappuccino. When it was done, I looked at it and there was maybe 1/4 inch of foam on the top the rest was just milk and two shots of espresso (so maybe 11oz of hot milk and an ounce of coffee.)  That's not a traditional cappuccino- not even close- let alone \"dry\". \n\nI took a sip to make sure that I wasn't somehow wrong and said no thanks and put it back on the counter and walked off. I really hate to be confrontational but an expensive coffee drink this bad was a real embarrassment. \n\nYuck! I'd think that Peet's would train their staff better. I expect some variation from cafe to cafe, but this wasn't close to what I ordered.\n\nFurthermore, my wife and daughter both ordered scones and I tried them both and they were barely edible. Both were dry and bland with a poor texture.\n\nPeet's is (or was) a slightly upscale chain, and this is something of a flagship cafe in a town that is known for its gastronomy and coffee culture. I'm not sure what happened to this Peet's but I don't plan on going here again.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-11", "description": "I sometimes get a coffee here if I arrive unusually early for my ferry, but the espresso drinks take a REALLY long time, even when no one is in line--once I actually had to leave without my coffee.  Even the experienced baristas are slow and they seem to make only one drink at a time.  I'm used to cafés that can serve a line of a dozen or more people in about 5 min., especially during commute hours. \nTo their credit they are very friendly here and the coffee is good.", "author": "Chuck Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-15", "description": "In my opinion, Peet's beats the pants off most corporate coffee companies like Starbucks. I am a fan of the different flavors of coffee beans and love to huff the bag of beans when I take some home. \n\nIt's not for everyone, but first thing in the morning or after lunch - it seems like it, as the lines trail out the door. It's really hard for me to justify wanting to wait for anything, but substitute your cuppa Peets with anything else and you come up short. \n\nI'm a pretty simple coffee drinker. I'm not into the sweet lattes and mochas. I like cappuccinos and regular coffee, served cold or hot. I like the flavor of coffee and not looking for a dessert drink.  \n\nI need balance - the sweet and the strong, since I pounded my cappuccino with an incredibly sinful dessert from Miette. Hehe....", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-08", "description": "3.5 - This was a welcomed sight when my husband I were touring all around the Embarcadero on a very warm day in the city.  There was a long line but somehow the cashiers and the baristas were moving everything right along. We were in front in the line in no time at all and had our coffee within minutes of stepping foot in the store. \n\nMy Iced non-fat latte was fantastic and the service was not only efficient, each member we came into contact with was very friendly. The only reason why I had to dock 1/2 a star is because we were rung up at the cash register to the far left of the store and a distance away from the desserts they had displayed. Without looking, we ordered a chocolate chip cookie that was given to us right after we completed the transaction.\n\nWhen we were waiting for our drinks by the dessert counter, we noticed about a dozen flies all over the food. All over the stack of cookies that the cashier just pulled our cookie from. We both looked at each other and knew we would NOT eat that cookie we just paid for after seeing that. It was disgusting. While we got through the line quickly, a line continued to build behind us and neither of us felt like jumping back in line asking for a refund. So...we threw the cookie away without even taking one bite. What a waste of money! \n\nI think Peet's should consider getting glass domes to cover the food they serve. Why leave it open to the elements and pests?  I find it hard to believe this was the first time they've ever had problems with flies but hopefully they care enough to really do something about it. I'll be sure to look much closer next time before ordering.", "author": "Sharon V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-05", "description": "Didn't actually order anything, but great place to hang out and people watch in the Ferry Building.", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "Good, standard coffees. What sets this location apart from the others is the view. Located right on the water with a view from every seat, you really can't beat it. Plus free wifi! What a great place to \"work\" from in the afternoon. ;-)", "author": "Jaching H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "Peet's is the best coffee ever and the people who work there are hella dope. Everything on the menu is delicious but you really should get the Black Tie.", "author": "Moni E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-03", "description": "I usually get Matcha Green Tea Freddos at Peet's.\n\nFor some reason, the drink they made here tasted a little off....not enough matcha, too much sugar, and slightly too creamy for my liking.", "author": "Bonnie Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-13", "description": "Nothing makes you want to throw your Madagascar Vanilla Steamer like snark from not one but two employees. It ended up in my digestive system and not on the floor which was good because it was delicious.  \nI should have went to the Peets near the Embarcadero BART station because the attitudes of those who work at this location are potty!", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-04", "description": "They now can substitute almond milk as of Nov 2013. Thumbs up for staying with the trends! It makes the drinks taste a bit funky, but at least you can rest easy knowing you're being healthy. I had originally ordered my drink regular, but when I saw the almond milk later on, I asked them to sub the almond milk, and they happily honored my request. Hooray for awesome customer service! \n\nI love this location as there's ample seating outside, facing the wonderful view of the Bay Bridge. It's great watching the sky change colors around sunset too. I wish I had remembered this location earlier all those times when I needed to work or study. There aren't any outlets outside the Peet's, but there is one outlet inside in the corner. I also like how they open pretty late for the area (8pm). Will definitely be back!", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "I wouldn't normally be inclined to rate any Peet's, let alone anything above a 3 star (not that Peet's is terrible, it's just usually average).\nBut man, when we all get off of the ferry in the morning and there's a huge line, the employees hustle!\n\nThere are a lot of employees that I see every day who are awesome and have great customer service. And then there are some employees who are clearly annoyed that they are there that early in the morning. You and me both, man.", "author": "Brituhknee S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "Nice Peets location. It can get a bit crowded and chaotic on the weekends. It is sometimes not clear which line you should stand in if you want to order a drink vs pick up or your drink. \n\nThe coffee is the same as every other Peets: dark and overroasted. \n\nThere is no seating and the condiment stand is very dirty. I wouldn't use the milk or honey since it comes from common containers. The sugar is in individual packets so it is safe. You can use it if your coffee turns out to be overroasted.", "author": "Eric P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-27", "description": "Worst service. Worst attitude. Worst hot chocolate we've ever had. Wasted money. They were busy but no excuses the hot chocolate was Luke warm. Asked if I can get it warmer, barista responded it's the temperature it was supposed to be and simply pour more milk in it. I'll just stick with good old Starbucks", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "This is a good Peet's.  Sure it's mostly a touristy location so it's not like going to my local Peet's, but it has the same great coffee, friendly service, and the location is pretty sweet.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-26", "description": "I am not so sure anyone can mess up great tea :) \nI did not care much for the wait, over 10 minutes for green tea?", "author": "Shale O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-26", "description": "The sort of coffee shop I'd expect to find in the middle of a busy metropolis, and that's not necessarily a good thing. I've visited this Peet's a handful of times while on business trips to the city and each visit has been like visiting the coffee shop version of Dr. Jekyll and Mr. Hyde. On one occasion it took me twenty minutes to get a coffee that actually wasn't what I ordered followed by a shrug from the indifferent barista, who I resisted the strong urge to bark at. On another, I was greeted with nothing but smiles and asked how my day was before even getting to the counter, followed by prompt service and a \"come back soon.\" Other visits have been somewhere in between. If this Peet's were a little more consistent in making me feel welcome, I'd be stopping in more often.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-16", "description": "We went here to get some hot cocoa to keep us warm on a raining cold Saturday morning. This place was hopping even more than Blue Bottle surprisingly. I can't complain since the lines moved quickly. The service was excellent. The employees were super busy but seemed to be having fun which was nice to see.\n\nI left a little warmer from the cocoa and happier because of the friendly service.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "Friendly staff!   Don't let the line scare you- moves super quick. Inside ferry building.\n\nThey make a mean matcha latte .", "author": "Ashley J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-24", "description": "If this was the last coffee house open in rubble and ash post zombie apocalypse; I would go thirsty.  Chick gave me cocking head attitude about buying something to get quarters for the meter.  I need to feed the meter before patronizing and enjoying your \"oh hell no\" attitude, girlfriend.   Lecturing me about meter time.   Then I finally return with my friend,  walk through the doors only to be greeted with, \"we just dumped our coffee-we closed.\"  Why are the doors freely open??  \n\n\nStarbucks was a friendlier and open alternative.", "author": "Freddy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-28", "description": "Went to the Peet's Coffee & Tea in the Ferry Building.  It's a great location w/ a nice view of the Bay Bridge right outside their shop.  Line to order coffee is in the Center.\n\nI got TWO small non-fat latte for $2.85 since I got a Pharoah's Gold Card - BOGO card good until March 28, 2010.  Sweet deal.  Credit cards taken.\n\nAlso, got a cup full of ice and they have filtered water that you can fill up yourself near the Pick-Up area.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "Another staple to try while in the city! I feel like it tastes better being on the west coast, but who am I to say. I think this and Blue Bottle blow *bucks out of the water!! I had a latte with extra whipped (I was on vacation!) and it was perfect!", "author": "Vanessa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "This place was such a great decision! I was having a rough day but I came here and was greeted by Anthony (such a sweetheart) he was very patient and attentive even thought they were packed. He asked about my day and showed interest in connecting with me. I am so happy I chose this Peet's! On and that Black Tie was delicious! 10/10 would come back again.", "author": "Braulio A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-25", "description": "The beans are good, but like most other Peet's, this place employs a bunch of slobs who will be replaced within 6 weeks.  You will never see the same barista here and you will have to tell the barista where things are stored.  The employees don't even know their own companies policies, so if you show up to buy beans, you're likely to be ignored.  Apparently, Peet's cannot pay their employees enough to entice them to stay with the company long enough to learn policy, make a decent latte or give a damn about the customers they serve.  Too bad, because the roasters are doing some fine work.", "author": "Lester B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-16", "description": "NO star if Yelp would let me post w/o a star! Terrible customer service! Waited for 10 minutes and asked them 3 times where my drink was. First answer was \"someone took your drink\" and the barista returned to her coffee making for other customers. Then got her attention the second time to make my drink. Nothing was done for the next 5 minutes then I had to ask them the THIRD time to make my drink. Unacceptable customer service. Starbucks gets it right the first time or they'd fix it the second attempt. Do NOT do business with this Peet's location unless they are the last coffee company standing.", "author": "Elsie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-26", "description": "long line\ni don't like peet's\nwhy did i go?  \n\nthey got a few orders wrong (not mine, but people before me.)", "author": "Vanessa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-19", "description": "Well they make a great chai latte made with actual tea, not some mix! So that's a win and although it's a decent sized chain, I'd say we had one of the best welcomes of all the coffee shops we frequented over a week. \n\nIt seems as though the chains train their staff to be happy and welcoming, and maybe the small biz folk just don't do that? Oh, and free wi-fi, amazingly lacking in so many San Fran cafes.", "author": "Rickie J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-01", "description": "I have to start off by saying, I hate to give any establishment 2 stars, but after 4 visits...it must be done. I just hope this review helps this location to see that there are a few issues, BUT everything can be fixed. I also want to say that I'm a Peet's fan, not a super fan, but I do frequent their locations throughout SF. \n\nIssues -\n*Wait time is way too long (10 minutes for a latte) - Ok, I completely understand that during the weekend it gets slammed, but  this has happened to me during the week, as well. \n*Quality - I have ordered 4 lattes here in the past and 3 of them have basically been coffee and milk...no foam at all. 2 times they have forgotten to add vanilla to my beverage, as well. Also when I'm given my cup, it's usually sticky and/or wet. \n*Service - employee at the register is always nice, but the barista has been rude a few times. Not a fan, especially after I just paid $5 for a cup of coffee. \n\nOverall...please do not take this review as a reason for you not to give this Peet's a try. This is just my opinion and again...I hope next time I go, my experience is better.", "author": "Dru M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-27", "description": "Meh!  Got my usual small americano with light soy.  The guy handed me the coffee then set a soy mil box next to it without even looking at me.  So I asked if I need to pour my own soy.  He gave me this \"are you stupid look\" and said \"yeah.\" Wow!", "author": "Susan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-27", "description": "Great location in the SF version of Seattle's Pike Place Market, the Ferry Building Marketplace.  I prefer Peet's to Starbuck's any day of the week. In addition to the wonderful coffees and teas, the staff here seems more relaxed and willing to engage in conversation about coffee and tea. Honey offered to brew a sample of several teas that we spoke of this day to make sure that I understood the nuances and characteristics of the different offerings. I would say that this is above and beyond any customer service that I have ever received at a Starbuck's anywhere.\nthe pastries served at Peet's are fresher and tastier than SB too. \nnext time you are in the Ferry Building picking up some fresh caviar or mushrooms, stop by the Peet's Coffee & Tea for locally roasted coffee beans from Berkeley and pleasant service.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-11", "description": "Growing up in San Francisco, Peet's was your coffee not that Starbucks stuff. So I've always been a fan of Peet's. Surprisingly, there was no line at the Ferry Building location when we visited. Score! Staff was super friendly and fast. Double score!", "author": "Claudine D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-07", "description": "I wanted to enjoy it, but both the drinks I got were just awful in this indescribable way. Despite my frugal don't-throw-anything-away philosophy, I tossed both drinks into the bin shortly after. Large Chai latte--it tasted grassy and leafy in a very undesirable way. I thought maybe my cup was off, so I asked for another, but it tasted exactly the same. Like there was hay or grass mixed into it. Perhaps some people like the flavor, but it was not for me.\n\nThe soy blended latte also tasted like sad imitation coffee. tbf, it was made with soy, which is gross (not my drink), but i can't see why anyone would want to keep drinking that. The service was great, they were nice; but the drinks tasted terrible, and it might just be the way Peet's makes their drinks. blech.", "author": "Jade L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-24", "description": "Peet's in the Ferry Building is pretty solid.  I prefer the Blue Bottle coffees, however Peet's is more efficient and the shorter line is why I usually wind up here vs Blue Bottle.  I drink mostly espressos and the difference (weighed vs the much longer wait) is not that substantial for me, although Blue Bottle is better for sure.  Nice $1 off coupon for checking in at Peets is also a bonus.  Wasn't a big fan of the Green Tea Latte, however, I'll pass on that next time (I do enjoy the chai lattes...).", "author": "Andy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-01", "description": "This Peet's is in a tough spot just down the hall from Blue Bottle, which offers significantly better coffee for roughly the same price.  But, if you're in a rush, Peet's is consistently good (and always better than Starbucks).", "author": "Greg B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-11", "description": "I have been getting the NITRO coffee, which is pretty expensive but it's pretty nice.  But, the size of the cup is not very large and lately, they don;t even give me a cup of coffee; half of the cup is JUST FOAM !! It pisses me off . I am not paying for a cup of FOAM ! I am paying for the coffee. They would not serve you a glass of beer that is half FOAM. So , please get it together and serve the customers the coffee that they are paying dearly for !!", "author": "Marc D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-15", "description": "With as much space as there is in this shop, I'd like to see them add more tables.\n\nThis location is GREAT for people watching if you're waiting for a ferry or just passing the time.  Lots of energy (and caffeine) and in an excellent location!", "author": "Stephanie V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-04", "description": "I ordered a large iced Americano with an extra shot of espresso and handed the young lady a ten. She immediately holds it up to the light and then asks the guy at the register next to her to see if it's counterfeit. Nice way to kick off the experience. Then they almost forget the extra shot, asking me how many shots, three or four. After that, I waited ten minutes for the drink as six people who came after me were served first. They apologized, but with a thin veil of sincerity covering a lot of bad attitude.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-11", "description": "It's so nice to see that California is rebuking and expelling Starbucks.  But this chain is also getting very large.   Way better selection than Starbucks and this location at the Ferry Building Marketplace has a nice waterside view.", "author": "Greg D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-02", "description": "Great baristas and LOVE THE VIEW!\nBy far one of the Peet's locations out there.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "Pretty good soy latte and the staff are SUPER nice. The awesome service is greatly appreciated! The location is perfect for a post-cowgirl creamery drink and you can walk out the back door of the ferry building and you're right on the water.", "author": "Emma W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-12", "description": "This is the only peets where I have received a lukewarm cup of coffee, which ended up being cold after pouring in some milk. After taking it back to the counter they made the same mistake TWICE. Most of the time the coffee is pretty good and hot. But this day it was different and something, with all of their fancy equipment and healthy prices for coffee, that should not happen.", "author": "Roman W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-08", "description": "yummmmm  love their lattes.  smooth, strong, deliciously consistent...hmmm kinda sounds like a hot fella.  \n\nespecially like to get a cup and walk out to the benches facing the bridge before sunrise.  promises of a perfect day...!", "author": "Li Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-06", "description": "Goodbye, Peet's, Ferry Building.  I'm just not that into you anymore.\n\nAfter 25 years of being a Peet's customer, today I ended my relationship with the vendor.   Back then, getting quality coffee, roasted by artisans who cared about their craft was difficult.  Peet's was different.  Today, it's easy, particularly in San Francisco, to find finely roasted beans served in an environment where you can tell people care about their customers.  Peet's in the Ferry Building is not that place.\n\nI've noticed each time I stopped by the Ferry Building location, there was something a bit off with the Peet's experience.  One time, they served coffee from the end of the urn, bitter and old tasting.  When I commented on it, they seemed to blame my taste buds for the flaw, rather than their old coffee.  Another time, the floor was filthy and when I brought it to to their attention, they seemed put out to clean their store.\n\nToday, thanks to \"Johnny\" and \"Jessica\" (10/6/11) in the Ferry Building, I say to Peet's:  I've had enough.  I've had enough of the hipper-than-thou attitude.  I've had enough of the mediocre coffee, prepared as a labor of labor, rather than a labor of love.  \n\nBy the way, if you are going there for the Wi-fi, prepare to be disappointed.  It only works about 50% of the time and the employees shrug it off, saying that there's nothing that can be done about it.\n\nThere's a Blue Bottle Coffee about 30 seconds' walk from this Peet's.  I recommend you go there instead.", "author": "Steve G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "This could be a review for the chain as a whole. They gave birth to Starbucks, so the originator of gourmet coffee in America. Never been to a location with bad service, unlike Starbucks.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "Always the best coffee...much better than blue bottle. I'm not going to write anything more even if yelp wants me to write more. So I just typing at this point.", "author": "Jeffrey G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-21", "description": "A popular chain coffee stores across SF. This one was located in the Ferry Market. Store was clean and organized. Service was great and staffs were very friendly.  The cappuccino was a little light to my taste. Found nothing to complaint about or stood out.", "author": "Liang Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-16", "description": "It's not my style to review chain restaurants, but this specific location gets a special shout-out for it's insanely fast service.\n\nAlthough there was a queue of over ten people out the door when I begrudgingly joined the throngs this past Saturday, I had my drink in my hand in approximately 3 minutes. It was nuts -- NUTS, I say!\n\nNot only did I have a beautiful view of the Bay and a delicious latte in my hand, I was able to enjoy it from the comfort of my seat -- not an impossibly long line. \n\nBravo, Peet's, bravo!", "author": "Liz M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-30", "description": "Well it's Peet's.  How is one really different from another.  Of course the coffee is delicious.  It was a weekday around lunchtime, and it wasn't terribly busy.  They also had a lot of retail goodies for sale besides coffee and the typical paraphernalia.\n\nBest thing they have probably is the large seating area facing the water.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-31", "description": "Great day watching the Giant's beat the Cardinal's and just in time for a large decaf non-fat latte w/ 1 RS. Perfect.  Ya know?  Peet's coffee is so good.  Much deeper and richer than other coffees.  That's the best part.  \n\nThis is an extremely busy location and they handle the volume well.  Where they need a tweak is in customer service.  Clean up more often and don't tell the customer to put the milk carafe back on the condiments bar so you can refill it later.  Ew.  \n\n(Have other carafes filled and in the fridge to exchange with the nice customer who brought this empty one to your attention.)", "author": "Jane R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-14", "description": "Great spot in the Ferry building if you want to grab some good coffee. Staff is friendly, there are plenty of places to sit down and enjoy your coffee or take it to go. There are many tables and chairs inside the Ferry building and right next to Peets. Enjoy the beautiful view over your cup of coffee! :)", "author": "Akvile D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-01", "description": "3.5/5. This Peet's is spacious and ideally situated in the Ferry Building. It's right across from Delica and a 30 second walk to Hog Island Oyster Co. There's a terrific view of the bay and Bay Bridge. There isn't much seating in the store proper, but there are plenty of tables right outside. The main downside with this location is that there perpetually seems to be a line (though it's length keeps fluctuating). And I would know, since I've been sitting here on my laptop for the past hour.", "author": "Pierre B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-24", "description": "Solid as almost always, Pete's is the standby for coffee that I wish Starbucks was. I can almost always count on Pete's for giving me a solid cup of coffee, good service, and a clean place I can relax if I want to.\n\nSometimes certain locations are more crowded than others. This spot seems to suffer a bit of overcrowding due to owning a prime location, but I fiend for the bean so what else can I do?\n\nService was still quick even with the line which is a reflection of efficient staff. Great mocha too!", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "Today I was there and it was soooo busy, but they managed to make that long, long line move fast and they also managed to have a smile, make a perfectly blended coffee drink and have delicious currant scones. I was HAPPY !", "author": "Dennisse B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "I have to give a shout-out to Rich who always remembers my name, and always makes my drink delicious. Thank you for your excellent customer service! It's employees like Rich who keep me coming back. This location is quick, clean and reliable, a well-managed store for sure.", "author": "Danielle W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-26", "description": "Our Dark Choco Mocha taste.. bland. Maybe they/we didn't stir it enough. Or maybe it's just an off day. I'm not sure.\n\nThe interior and everything looks very spacious. Windows with a great view of the bay.\n\nI might give it another try next time I'm there.", "author": "Yohann S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-28", "description": "I'm a total Peet's fan - but this particular Peet's is just so CRAZY!\n\nI don't know when I've been and there hasn't been a line out the door. Mom always did say the best things in life are worth waiting for, so this adage may just ring true for this particular Peet's. \n\nThe saving grace is that my coffee is always done right, piping hot and absolutely delicious. \n\nEven better when you can find a prime spot to park yourself and enjoy your brew and the view!", "author": "Christy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-31", "description": "Great location to get a coffee (you will most likely stand in line) to enjoy as you saunter through this food mecca.  If you come on Saturday morning, you can wander outdoors and look at all the farmer's stands and watch the ferries coming and going.  So much going on, so much to see, and how nice to have a warm cup of coffee (or tea) to enjoy with the whole experience.", "author": "Delaine Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-12", "description": "This Peet's has a really supreme location...you can sit inside and look over the bay, sit outside and enjoy the fresh air, or pick a table in the shop and people watch as people come in from the ferries.  On that note, it's best to coordinate your visit with the ferry schedule, so you don't get stuck in a rush from a recent arrival.  But even then, the line moves pretty quickly.\n\nThe coffee is good- a little bit pricey, but they have some drinks that are uniquely Peet's that may be worth it.  \n\nOverall, the environment is great for reading in the morning, and the drinks are your usual reliable Peet's.", "author": "Natalie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-04", "description": "You have to plan ahead for a visit to this Peet's. You have to schedule around the mobs of office workers in the morning. You have to avoid the long lunch lines. You have to stay away from the afternoon 4 o'clock rush. Oh, and the occasional tour bus of peeps all dying to get their latte on before the bus takes off. \n\nThe coffee drinks and tea drinks are awesome. Jeez, it's Peet's so you know it has to be tasty. Except for the sometimes the brewed coffee tastes like they threw the whole plantation into the hopper and it all ended in your cup. That is when I believe they doubled up on the fresh grounds put in the drip brewer. It just ain't very good no matter how much you cut it with milk.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-12", "description": "With its large windows overlooking the bay and providing some outdoor seating, this is a great location to buy some great local coffee. It seems no different than any other Peet's but the service here is spectacular.  They announced their Holiday Blend and were giving free samples of it.  Anytime you purchase a pound, they give you a free drink, but for the Holiday Blend, they also gave a band to ensure airtight freshness for your beans.  \n\nThe bean grinding is done at a side counter so you don't slow down their service lines.  They also sell coffee brewing products including the new individual coffee filter brewer for 1 cup.  My friend doesn't really drink coffee but always comes here for their tea.  The staff provided a large bag for my coffee and travel size french press so it was easy to carry my things.  Obviously, the coffee beans here are of high quality and they sell a good amount of Fair Trade as well.  My favorite coffee place just got better!", "author": "Jay N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-08", "description": "In all fairness, this review is just focusing on the past month or so.  \n\nNow, I love Peet's and it is my favorite of the corporate coffee chains.  \n\nThe main issue I have with Peet's located in the Ferry Building is two fold.\n\n1) It seems to be dirty lately.  Now, I know it is crazy busy but lets get the trash off the floor and wipe down the milk and sugar area.  But moreover, for the love of god, wipe off the steam wand on your machine.  The other day, it seemed to have an inch of dry crusty burnt milked caked on.  \n\n2)  Service can be hit or miss.  Some of my favorite baristi are here, but there are some cashiers that mumble under the breath at customers.  I really want to say, \"I am sorry if I forgot to say nonfat milk at the beginning of the order (verse at the end of the order) but I can still hear you\".\n\nI am not saying this Peet's is the worse ever.  Their drink are pretty well crafted and the location is nice.   It just seems to be going downhill a little.", "author": "Domo S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-02", "description": "What, Peet's? Really? Was it a bad day, or just a tourist trap? They had like 5 people working the cash registers and only one dude who was pouring the coffee. There was a line 5 deep waiting for our order which took over 10 minutes to get. The \"barista\" was so rushed and careless he kept spilling everyone's coffee. They ran out of pumpkin spice, they ran out of chocolate sauce, they pushed drinks out that weren't finished, they served the coffee cold. Pretty aweful! Never going back there again. Blue bottle's just around the corner anyways", "author": "Naomi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-23", "description": "I love Peet's at this location.  The baristas are the nicest people.  Even though, Blue Bottle is nearby, I rather come here.", "author": "GF S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-27", "description": "I came here this morning after accidentally getting locked out of my apartment. I had nowhere to go and it was 7 in the morning... I was still groggy and I wanted to sit somewhere warm with a nice cup of coffee.\n\nLet me just say that their chocolate croissants are fantastic! There was a substantial amount of chocolate in it, which I can always appreciate. I got my coffee in a ceramic mug and sat by the window, watching giant ships roll on by. I was even a little tempted to hop on the ferry to Sausalito (I've never been there before). It was too cold out though and I didn't have a thick enough jacket on, so I just sipped my coffee and watched all of the morning commuters waiting for their ferry. \nThis Peet's is a great place to people watch and get a nice view of the water and bay bridge. Très bien!", "author": "Felicity M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-23", "description": "Staff here is always helpful and pleasant but I was prompted to write this by April who went the extra mile to make this customer happy. Thanks for satisfying my Sumatra craving.", "author": "Florence C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "They were nothing short but polite!!! They were hip and nice! The gave free ice in a cup.... FREEEEEEEE!!!", "author": "Jaesu H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-03", "description": "Great place to pull up a heavy library style chair and wait for the ferry.  The lines for all kinds of coffee are long, but move quickly,  Too much traffic here for the staff to keep up with the self-service area for sugar etc. It's stocked, but impossible to keep clean.  Love the coffee, and love the aromas from the other coffees in the will call line.", "author": "Jamie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-04", "description": "good ol' fashioned american (gourmet) coffee. And now it's got to compete with blue bottle. Best of luck to you Peets.", "author": "Oleg H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-29", "description": "A couple of co-workers and I decided to take a break after a grueling and annoying meeting of report standardization. \n\nWe decided to get some fresh air and stroll to Peet's at the Ferry Building.\n\nIt appears everyone and their boss decided to do the same.\n\nWe quickly fall into line. I gave my order and then went to go wait for my vanilla soy latte to be made.\n\nI noticed one of my co-workers repeating his name over and over to the cashier.\n\n\"Samarjit. No, it's Samarjit. No, it's Samarjit. Sam...Ar....jit. No, it's Samarjit.\"\n\nThe line is getting longer. People are looking to see what the hold up is.\n\n\"Samarjit. Let me spell it. S as in Sam...A as in...\" \n\nImmediately, my other co-worker comes to the rescue and says, \"His name is SAM\" and pulls him away.\n\nSamarjit starts arguing in Hindi, while my other co-worker argues back to him in English.\n\nI immediately feign exaggerated interest in the display of mugs and gift sets.\n\nThe gift sets actually do look very cool for that Peet's coffee lover on your Holiday list.\n\nMy name is called and I pick up my latte. \n\nI take a sip. Awww...it's not the best coffee, but always consistent and good.\n\n\"Sam's\" name is called. I hear him grumble, \"That's not my name.\"\n\nI hear my other co-worker mumble back. \"It is now. Live with it.\"\n\nOVERALL: Peet's is always consistent, not stellar, but definitely good. After studying the gift selection, I concluded that a Peet's gift card is the best way to go. I think that would make any coffee lover who works in the Financial District a happy yuppie. My first gift card is to \"Samarjit\".", "author": "Liz K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-20", "description": "How sweet was the cashier? Wow! Just the nicest cashier I've encountered for a while. I love it when people go out of their way to ask me how I'm doing. Granted, it was probably because he was flirting with me, but if being attractive means that I'll receive excellent customer service from guys, then so be it.\n\nI ordered a small double-latte, and watching the girl make the latte upset me. Fucking DIRTY. Wipe up the milk you spill, girl! Rinse everything WELL before you pull my shot, because my picky self doesn't wanna taste badly-tamped espresso. Having spent a lot of time in the trenches of barista hell, I know how stressful and potentially messy a job like that can be. But to wipe as you go? Easy! The latte made me feel as if I had just been banged and made to sleep in the wet spot :(", "author": "Pamela D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-14", "description": "This morning while sitting on a bench outside Peet's I saw a father say to his 3-year-old daughter while pushing her in the stroller \"Honey, what do you think? You think we should get some Peet's?\"\n\nHe was walking really fast and slightly sweating. He also didn't wait for his daughter to respond as he pushed her quickly into the meth lab, I mean Peet's.\n\nThat's what we need, more caffeinated children. I bet his daughter is the same girl I keep hearing scream bloody murder from the after school program playground on Mission St. on my way to the bus station. Every time I hear it my rectum crawls into my throat, which is also what happens when I drink coffee.\n\nNext time I see him I'm going to offer to watch his child while he gets his Peet's fix. While he's pouring in all the accoutrement I'll quickly leash the kid and put a carrot stick in her mouth. Baby sitter of the year...right here.\n\n\nPeet's sugar free mocha is delicious and trumps Starbuck's skinny mocha, which tastes like melted cheap Easter chocolate, in a heartbeat. If only a cup of Joe didn't have the same effect on my digestive system as eating a bag of Olean potato chips. \n\nAlso the drag queens who work here always make me feel so comfortable about my stool issues. Thanks for the cheer guys! It really helps me out on my trot to the ladies room.", "author": "Sammy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-07", "description": "I love Major Dickason's Blend.  It's my poetry workshop's favorite Peet's coffee.  I know there are people who prefer Starbuck's, Tully's, or Martha and Bros.  My preference is Peet's probably since 1985 when I lived on the North Side of Berkeley, and Peet's was right around the corner.\n\nThere were only two baristas working at the branch in the Ferry Building -- it was raining. People were coming off the ferry.  Everyone wanted to be warmed up! \n\nThe line was long.  We were about to say, \"forget it.\"  Then, we saw that the line was moving pretty fast.  By the time we got up there, the barista said that the coffee would take a minute to brew.  That didn't take long either.\n\nI coffee was so good at around 5:00 pm that I had trouble sleeping at night.  That's strong coffee.  \n\nAs a whole, I think the people working at Peet's are friendlier and more knowledgeable than Starbuck's.  Actually, one of the people I was with suggested that we find a Starbuck's when the Peet's line was long.  My heart sunk.  Nooooooo... I want this coffee here.  It just gives me a good feeling like I've been nourished or something.", "author": "Priscilla L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-13", "description": "Well of *course* there's a Peet's in the Ferry Building (this would be #9 for me).  Although, it almost seems too ordinary compared to its hard-core gourmet neighbors.  Maybe they should have a Philz instead?\n\nThe thought of disembarking next to this Peet's every morning almost makes me wish I had a ferry commute.  Seating is actually harder to come by than usual because the tables are shared with anyone and everyone passing through.  But hey, you'll probably be getting that coffee for the walk to the office anyway, right?  \n\nI decided to shake things up a bit and try the Soy Latte this time...I couldn't even tell the difference.  Well done, Peet.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-20", "description": "The little troll of a barrista that works there (about 5'0\" with dreds) is an a*$^hole.\n\nI just had the most horrible customer service experience of my life. It's hot outside, so I went in for an iced latte. I saw that the liquid sugar was out, so I brought the container up to the barrista and kindly asked if he could refill it, to which he replied, \"can't you see I'm busy, go ask somebody else\" in this really rude tone. Ummm....what? In reply I said \"umm....can't you ask somebody else?\" At which point he basically told me to go f*#% myself. What a nice guy!!!\n\nIn general, I love Peet's AND their employees....let's hope it's just a fluke....", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-10", "description": "What better a place to grab the darkest, smoothest brew in the Bay Area and walk 12 feet to the Bay to take in that great view? \n\nPeet's has been my favorite for a long time (my second coffee love after the Santa Cruz Coffee Roasting Company)--I just wish there were more of them.\n\nLuckily, the FB location is within my daytime walking distance and I head on over whenever I'm jonesing for a quality Java experience.", "author": "Nivek M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-28", "description": "Competition with the neighboring Blue Bottle shop may be bad for this Peet's, but it's great for consumers. The line here is unfailingly shorter than the queue at other Peet's and the orders are served quickly. The service here is not particularly friendly, but the excellent coffee and pastries (on par with other Peet's) make up for the staff's begrudging half smiles and eye contact evasion.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-18", "description": "Peet's Peet's Peet's.. you've messed up my white chocolate mocha for the last time.  I loved that you gave me a cup with 1/10 of it filled with ice and pointed me to a sink that has coffee stains all over it and say that's the water for everyone.  I love that your Wi-Fi is complimentary but you must as for a code from busy workers that will ignore you until the 4th time you ask.  The seating is limited but the outside has a nice view, so +1 star?", "author": "Christopher N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-01", "description": "Perfect place to pick up a coffee when on your way to the office or a meeting. There's virtually no seating though why I can't give this place more than 3 stars.\n\nBut, it serves the purpose of being at the right place at the right time - ESPRESSO NOW!", "author": "Peter E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-26", "description": "The smell of Peet's in the Ferry Building is so comforting and aromatic...Especially in the morning, when you are still trying to shake off the sleepyheads.  I love to grab a cup of non-fat hot cocoa to drink with my fresh Acme baguette, nothing beats it!\n\nP.S. My Dad (the coffee junky) gives the coffee two enthusiastic thumbs up!  Says it's way better than Starbucks.", "author": "Burrito M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-16", "description": "I know there's tons of Peets in the city, but this one holds a special place in my heart. It must be rough having a boatload of tourists and obnoxious foodies around at all times... so I have respect for what they do. I get drinks from a certain barista named Jordan from time to time, and he always gets it right. And he's a charmer. Good coffee & eye candy.", "author": "Adelaide M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-06", "description": "spacious and nice view of the bay. service was fast and polite. delicious.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-15", "description": "Despite how busy this Peet's gets, its never chaotic and they continually make a damn good latte.  \n\nWhen I need a break from work on a nice day, I love to walk down here and get a coffee and peruse the selection at the Ferry Plaza Wine Merchant before returning to the office.  It seems to add some civility into my day.", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-13", "description": "Whenever I hop on a ferry, I make it a point to get a latte or one of their delicious frappuccinos. Well, not frappucions, but you know what I mean. The mocca one is especially good.\n\nMake sure to bring a few extra minutes, the line can be pretty dreadful sometimes.\n\nAlso a great place to people watch, get a drink and have a seat outside.", "author": "Roland A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-07", "description": "Great cup of coffee. I can taste the richness of the flavor even with the cold  Vanilla Iced Latte. If you are tired of same old Starbuck's over priced, and \"I ran out of having excuse to satisfy your sweet tooth\" mixed coffee drinks with mega calories, visit Peet's.", "author": "Aung W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-20", "description": "After waiting for the girl scout troupe from Walnut Creek to get their hot chocolate Shatangi was greeted by the very friendly staff. They served me in record time and  took the time to personalize the experience.\n\nShatangi told you", "author": "Njon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-10", "description": "Possibly the best Pete's, if not best coffee franchise location I have ever been!  GREAT, FRIENDLY service, great pricing and plenty of seating with a killer view.  Tried my first sugar-free mocha...  I'm a FAN!!!\n\nIt was just so nice for the cash register person being so friendly.  It makes such a difference!", "author": "R G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-08", "description": "I am a huge fan of Peets even though I also frequent the McDonald's of Coffee Roasters, travel through the Green Arches....my loyalty is always to good 'ol Alfred Peet. I've even met the old guy - it was a while back when I was working for Peets. \n\nI can say that as a company they are all about educating the staff on Coffee, Tea and everything in between. An employee or a Peetnik as they call them is heavily educated on the coffee industry, tasting, roasting, brewing - you name it they'll teach it to you. You'll learn to taste coffee like it's wine - you'll learn how to tell where in the world the beans were grown by the taste of the brew. It's one thing that I do not think Starbucks invests time into.\n\nThe funny thing is - Starbucks would not exist if it was not for Peet's - their business model was copied from the Peet's in Berkeley, they even sold Peet's coffee while they learned how to roast their own beans - from Peet's!! There was even a contract that kept the two companies from competing - that ended in 1993 or so, and that's when they started popping up on every street corner.....\n\nFunny thing, the now CEO of Peet's is one of the original founders of Starbucks, he didn't like the direction they were moving, jumped ship and bought Peet's.\n\nIt's a great company, they hire the best people and they are very knowledgeable when it comes to their business. The quality of their coffee is the best that you can find, their tea is excellent and if there is anything that you have a question about - just ask the person behind the counter - changes are they know the answer.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-19", "description": "Coffee is solid, while wifi is spotty. Network keeps disappearing on me.", "author": "Whitney B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-01", "description": "Great service; always willing to brew me a fresh pot of decaf, even 10 min before closing.", "author": "Julie H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-22", "description": "The 2nd worst customer experience after Chestnut Street PEETS!\n\nThe employees are usually grim, not friendly.  Lines are long and they are ALWAYS, ALWAYS out of Jasmine Lime Coolers.  Come on, PEETS, it's popular, make more!!! \n\nThere's a better PEET's experience other places in the city.  Let the tourists have this one.", "author": "skipper a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-11", "description": "It's a little too hectic for me most days (although I'm usually here on the weekends, so that is probably why!), and the line can be pretty long, but amazingly enough, the folks at this Peet's know how to work it!  They keep the line moving and don't act the least bit irritated at you when it takes you a few seconds to spit out your order (which if it were me, I don't know how patient I would be after that many customers).  \n\nMy only complaint is the lack of seating and that this Peet's doesn't have the same soothing atmosphere I love in other Peet's.  However, if you're entertaining friends from out of town, it's a perfect chance to grab a coffee and walk around the Ferry Building or look out at the Bay Bridge and Treasure Island.  And that is all the relaxation you need anyway, right?", "author": "Marissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-20", "description": "I should clarify this review is as much about Peets coffee as this particular location; though the Ferry building setting is quite lovely.\n\nI only discovered Peets in the course of my vacation in San Francisco last week.  It was a revelation.  What wonderful coffee!  I don't do Lattes, Expressos and the rest.  All I want is a cup of smooth, full bodied drip coffee and Peets delivers it.  The best coffee I have tasted in a long long time.\n\nOh that we had something close in London, England.  I am going in to withdrawal already and it may be 2012 before I am next in San Francisco.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-22", "description": "Same great Peets.\n\nMinus a big, bloated, pendulous star for the wait time in this very crowded location.", "author": "Holly F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-22", "description": "I was punchy with too much work and took a break with a friend. \n\nAt the cash register, the woman said: Chai, hot.  The hot button has been used too much.\n\nI said: Have you been overusing your hot button?\n\nShe gazed at me sternly over her glasses: Are you getting fresh with me, young lady?  Now don't get fresh with me.\n\nI: You said the hot button has been used too much.\n\nAh... enjoy the friendly banter at a Peets near you.", "author": "Sooj O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-30", "description": "Love their tea blends. Not like you get a paper baggy that's been sitting in the container God knows how long. They put loose tea in these special bags and. Make the tea fresh. Their bergamont and lavender blend ios awesome. The only thing io wish is that they didn't use that scorching hot water. It burns the tea and ruins the flavor a bit. It's nice to get a hot cue there and then go outside and hang by the bay. Great location!", "author": "Yelena K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-28", "description": "Despite the long lines, I LOVE this Peet's! I look forward to stopping in for a cuppa on my way to the ferry at the end of a long day at the office. The staff are always friendly (and have many times lifted my grumpy, growly mood) and the coffee is consistently good. When I ask for a roomy Americano, they actually leave me more than 1/8\" so I have room to add cream without having to sheepishly ask the barista to dump some out).\n\nThe long lines can be a bummer, especially at the height of tourist season when the tourists don't know what they want or which line to queue up in or they want to argue over the price of *ev.ery.THING*. But I can't blame the Peet's staff for that, they try to move them through as efficiently as they can.", "author": "Victoria K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-10", "description": "My theory is you can never go wrong at Peets. And although I love them wherever they are burried away, I must say this one stands out most certainly.  The staff here, particularly a special few are fabulous.  I love Peets for best coffee and equally the service.  Go Peets!!\n\nDid I mention the location!  Gosh you can't go wrong coming here, except of course if it's Saturday morning and it's your first cup of coffee for the day...I'd hate to be standing in front of you.", "author": "Tamz O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-30", "description": "I have worked in SF since June and been a Monday through Friday customer since, Richard and Max are both amazing baristas and on point. I almost never need to wait for my drink after ordered and it is always on point! I am glad that they are there every morning and look forward to that part of my day!!!!", "author": "Jeremy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-06", "description": "This location is ALWAYS crowded...except for sometimes when it's raining.\n\nThe staff is friendly and guy w/ thick dark hair & green eyes that makes the coffee does an EXCELLENT job!\n\nI recommend getting a lid and had protector before getting your coffee or you might burn your hand...the coffee is usually really hot!\n\nI'm not a big fan, tastes like it's burnt. I think I'm just an amateur coffee drinker!", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-14", "description": "How can you go wrong with Pete's? It's always crowded but they move pretty quick. I always buy a latte when I'm there. Excellent!", "author": "Diane M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-25", "description": "of the peet's coffee houses i've been to in san francisco, i think this one's the best overall... the staff has always been friendly whenever i've gone here.  \nand although it's unfortunate that i just don't find peet's coffee all that tasty, they've always at least made my beverage decent... temperature etc... but there's just something off about peet's coffee's flavor...\ni wish there was an independent coffee house in the ferry building", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-09", "description": "Still one star, but just a plug for Acme bread which makes me still come here on the weekend even though i have to stop at Starbucks and then walk 2 blocks to the Ferry Building.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-09", "description": "I guess I didn't get the memo on blue bottle coffee...so when I am at the ferry building peet's is where I am at. I know it is not very \"cool\" to walk around the ferry building w/ your peet's cup, but I am starting a new trend.", "author": "Kathleen E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-29", "description": "Peet's gets three stars on principle, because it's you know, Peet's but this was defenitely the weakest latte I've ever had. Maybe they water it down for the tourist folk but they HAD to have known I'm a local. Seriously, people, I had my ipod on, I looked like a truck had ran me over several times, I have messy black hair and I had a black hooded sweatshirt.  They had to have known I'm one of them. Jesus. Open before all the other stores in the ferry building which is nice when one finds oneself at the ferry building at 8:30 am on a Sunday morning and in desperate need of a Camel Light chaser.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-19", "description": "I've been going to peet's for almost 20 years, and this was the worst experience I have had.  Not terrible mind you, but since the lines at Peet's are slow to begin with,  you can imagine that the only thing that keeps me coming back is the customer service and the coffee, and one out of two isn't good enough.\n\nI stood in line there for 10 minutes today, a Saturday, in a very crowded Ferry Building (farmers' market day).  I was there to meet a friend who was coming from Danville.\n\nI ordered my coffee \"for here\" - a french press - paid for it, turned around, and there was my friend.  The person who had waited on me had turned her register over to someone else who was now serving someone.  I asked the original server - who looked all of 18 years old - if I could just add to my order and she said no, I would have to stand in line all over again.  I looked behind me and there were TWENTY people in line.  WTF?  30 seconds after I order I can't add to my order?\n\nI then decided to ignore her and waited for the new person at the register to finish with the people she was serving (the same people who had been behind me in line for those 10 minutes), explained that I would like to add to my order, and she took my order for my friend.  I asked for my friend's coffee \"for here\" but she put it into a paper cup.  We didn't say anything.\n\nSo, about five minutes have passed, and I look to the side and JUST NOW, my original server is grinding the coffee for my press pot.  What exactly had she been doing since I ordered it?  And press pots take something like 3-5 minutes to steep, so it was going to be another long wait.\n\nWhen she finally gave it to me, she said they were out of ceramic cups and would I take it in a paper cup?  I thought to myself \"as opposed to what, chugging it out of the press pot?\"  So I said paper would be fine.  Then I asked another server for a ceramic cup and he went and got one for me.  \n\nWe had difficulty finding a place to sit outside, there are big tables, which are very nice, that seat probably 10 people each, but they were very messy, covered in old coffee-stained newspapers, and with people sitting there eating Chinese food out of take-out containers, with their backpacks occupying most of  the empty seats, and no way to squeeze in to the seats that were vacant.  \n\nThe Ferry Building is a beautiful space, and Peet's is situated at the back near the bay, with full-length glass walls, and it would be a really great experience were it not for the long wait, poor service, dirty tables, and massive crowds.\n\nOh, there was a sign that they had free wifi, you could ask for a password for two hours free.", "author": "Alexandra D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-10", "description": "Two baristas, calm and relaxed, cranked out coffee faster than I would have expected.  The traffic flowed smoothly, and everyone was happy.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-30", "description": "This is where the ferry stops and there are some serious HOTTIES (read hedge fund manager types) getting their coffee here at rush hour (7-9 a.m.)", "author": "Poker B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-11", "description": "As coffee shops go, not one of my favorite.\n\nThe coffee is so strong it gave both of us an uncontrollable case of twitches.  I'm sure that's a benefit for some folks, but it just gave us an upset stomach and a headache.\n\nAlso, long lines......", "author": "Mel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-01", "description": "I haven't seen this many people waiting peacefully, transfixed on two golden men working magic behind a pulpit, um, I mean espresso machine since Easter  mass awaiting the host from the Priest.  These two men worked deftly, whipping out drinks like that was what they were ordained to do.  Impressive.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-24", "description": "It's not the coziest Peet's, and there's not really anywhere to sit inside the shop, but they are quick at moving folks through the coffee process.  The staff is always very friendly.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-02", "description": "Enjoyed the skim milk latte this morning. The staff was hopping too: it took only a minute to get and there wereseveral people already waiting on a tasty beverage ahead of me", "author": "Steve H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-15", "description": "This the best Peets in the city. Their coffee drinks are superior to the rest of the Peets, and their staff seem more the collegiate type, instead of the in a secret society with bike messengers. And it's just a different calming world down there. I work at Mission and Spear with a 2 starbucks within stones throw. But I walk that walk down there so I can drink my coffee among home boutiques, ferry riders, and senior citizens. It's definitely made me an addict. No that was my job. Okay, this is just the place that makes my left leg shake uncontrollable. To the point I think I might hurt myself if I had to pee, which I do. What am I supposed to do? Oh God, that's not too much information is it?", "author": "Jean W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-24", "description": "This is a large branch of Peet's Coffee & Tea, with a separate line for coffee bean purchases, a fair amount of seating for a Ferry Building establishment, and friendly counterpeople. Because it's at the Ferry Building, you can wind up in a line even at a non-rush hour because a literal boatload of people might decide to satisfy their latte fix.", "author": "Timothy O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-05", "description": "Convenient location, strong coffee.. but my gripe is that every time I come here and order a cold, blended drink, my order gets disregarded to fill all the hot drink orders and I end up waiting 10 minutes or so before I get mine. I am well aware that it is busy during morning rush hour, but shouldn't all drinks be of the same priority? Overall, OK coffee, disappointing service.", "author": "CHERiE Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-15", "description": "The farmer's market makes Saturday here a nightmare of people getting to the register and then asking what a cappuccino is.  Something you will be wearing if you don't jump on the clue-bus, lady!  Other times it's better but this is not my favorite Peet's--lacks the intimacy.  It could be in a train station lobby.  But at least it's Peet's.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2004-10-12", "description": "Although it is farther than the usual watering hole, it's got smarter staff, better snacks, more space, and views of the water.", "author": "Max L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-21", "description": "We had planned a fun day of walking around the city.  It was sunny and  gorgeous - a short reprieve from the rainy season.  My two friends and I (all coffee lovers) stopped into Peets for a quick, afternoon cup of coffee and within 15 minutes, all felt like puking and had to go home.  The nausea and stomach upset lasted well into the night and none of us could fall asleep until 3am.  One black drip, one capuccino and one soy latte = three people who will never drink Peets coffee again.", "author": "Michelina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-24", "description": "I gotta give these guys credit where its due. The store is always clean and they always crank out a smile regardless of the lines and obviously being short staffed. Smack dab in the middle of the ferry bldg... why not grab a coffee while you wait for your ferry?!", "author": "Eugene G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-11", "description": "Gotta have my Peet's when I'm running on empty.  Trick to bypassing the long line is order a regular cup of coffee from the coffee ground line.  Better yet, buy a bag of beans and get a complimentary cup of coffee.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-19", "description": "This place is pretty packed everytime I pass by it and today was no different.  The staff works fast and is pretty friendly.  My Mocha and my friend's white chocolate mocha was made superbly.  My friend said honey oat bran muffin was freaking awesome and full of goodness. Not too sweet nor grainy, just right.  Like every coffee place I go to I get a chocolate croissant. Well the one Peet's has isn't that great. Hence only 4 stars.  Lost of croissant, but not fluffy like another place.  Next time I'll tempt fate with something different.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-13", "description": "Same great coffee as the other locations but the line here sucks!  It doesn't matter what time of day this place is busy.  I do like that they have seating here to enjoy the coffee and view of the bay.  They also have an extensive selection of pastries, love the sugar cookies and banana nut bread.  Nice touch on the soy milk dispenser!", "author": "La C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-10", "description": "Grab a coffee, sit outside and enjoy the view of the bay in one of the best cities on Earth. 'Nuff said.", "author": "Johnny O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-15", "description": "Since my exile to Jack London Square this has become my location of choice for morning coffee.  It gets crowded when the boats let off but the staff here is very efficient and most of the people in line are from Marin so they know how to order what every bizarre milk and coffee combination that is popular this week. Here is my one problem with this place, what is up with the birds? Can't they do something to keep them out of the Ferry Building?", "author": "Seamus M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-06", "description": "Peet's is my favorite big chain coffee place because it just doesn't feel so much like a cheesy numb generic big chain place, even though it pretty much is.  But it's big and chain-y enough so i don't need to waste time talking about the coffee/tea, except i have to review this one because i love that it's there for saturday farmers' market days.  It's one of the 3 coffee/tea places that is a must-stop there (not all on one day, not so far at least).  And, service is surprisingly fast.", "author": "Today Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-15", "description": "Long line, but moves pretty quickly. They've got their system down. Peet's always churns out the best, strong coffee around.", "author": "Fern D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-13", "description": "GOOD COFFEE! ONE OF MY FAVORITE COFFEE HOTSPOTS!\nHave the greatest encounter ever! So my sister and I decided to stop by for some post-lunch coffee, and we were being environmental-friendly so she brought her own mug in. She ordered a cafe freddo, and handed the guy the mug. He came back with a volcano-filled mug with coffee eruption. He nicely apologized for the mess and insisted on having the coffee on him... so FREE COFFEE!  (of course, we tipped him)", "author": "Dianne I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-28", "description": "i'd choose peet's over starbucks anyday!  nuff said.", "author": "Dorothy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-09", "description": "Ok, no lie. I've been drinking coffee since I was 5 when I used to sit with my mom, aunts and grandma in the kitchen while they drank coffee, smoked cigs (except ma) and chatted. I don't use cream or sugar anymore, unless the coffee is really crappy or has booze in it. Peet's is my place. Love no coffee like it. Major Dickasons on the board? I'm having a great day. The ONLY problem is ..... and you all know it.....they are so freakin slow. And you can't even be mad about it. (Ok, I am). And every Peet's is this way. EVERY ONE OF 'EM. I think it's in their business plan. Take forF____cking ever to serve 'em and people will love it. Ok, I do. I love it in spite of the wait. And the problem is I really LIKE the workers! Good folks! I'm sure the only reason I have a problem with it is because it makes me late for work every morning (and no I won't get up earlier. I need my beauty sleep). That's it. Go to Peet's. You won't find better coffee.", "author": "John S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-03-20", "description": "i'm sorry, but i have a personal vendetta against peet's. it started back-in-the-day, sometime when i was in college...picture it: i put in my barista application and was pleasantly suprised when i rec'd a phone call asking me to come in for an interview. the woman then says she has to give me a preliminary phone interview, which i passed with flying colors. i go in for my in-person interview and hit it off with my interviewer. job is in the bag, i'm thinking...then this woman says i have to then come back for another interview with the co-manager. after three motherfuckin interviews for PEET'S COFFEE (of all places), i did NOT get hired. are they fucking serious??? 3 INTERVIEWS so i can make $9/hr. i waged an 8 yr war with this place and recently decided to let bygones be bygones. after all, i've grown as a person and maybe they've grown as an establishment...so i order my specialty \"fall\" latte (something with spices and such...) and it tasted like artificial shit. note, this is BEFORE i put my two packets of splenda in. oh, and one more thing - i remember a looong time ago, i asked for a raspberry vanilla latte and was snottily told by the peet's employee that they didn't use \"flavorings\" because they ruined the integrity of the coffee. what's up with all the bottles of flavorings they now carry?? s-e-l-l o-u-t. i would rather drink starsucks.", "author": "eve l."}
