{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Best coffee I've ever had. After drinking a few sips, I walked around mission district and within 10 mins I had to go to the Macy's to take a shit. That's when you know coffee is good. 5/5", "author": "Angela T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "So this is my situation right now: drank Philz at 2PM, currently 1:30 AM and I still can't sleep.\n\nBack story: Because I attended a concert on a Tuesday night, I was sleepy by noon on Wednesday so I made the wise decision to get coffee at 2PM. Also, I rarely drink coffee (maybe once every four months??). Decided to try the Philtered Soul (hazelnut, chocolate) but tbh I didn't think Philz was necessarily better than your standard coffee shops (again, I'm a coffee noob). My palette for distinguishing flavors in coffee obviously needs work. Aside from the flavor though, the caffeine kicked in. Ohhhh did it kick in at 3PM... 4PM... allllll the way until now. It's amazing how much sleep I'm losing. Truly.\n\n3 stars for the taste. 5 stars for the coffee doing its job. Well played Philz.... too....well........", "author": "Cathy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-25", "description": "As an east-coaster, I knew I had to try Philz Coffee, as all my friends have raved about it over and over. Unfortunately, I was really disappointed with the quality of coffee. \n\nAlthough the atmosphere is great and the staff is very friendly, my coffee tasted a little burnt and odd. I got the Philtered Soul, and couldn't taste any Hazelnut coffee at all. I could barely drink half of it before I gave up and threw it away. \n\nMy friends later told me to try the mint flavored coffees, so maybe it was just the one flavor. But I highly recommend against the Philtered Soul - save yourself the trouble and just grab something from Starbucks!", "author": "Will W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "Like all other Philz, this location has fast and friendly service. Because of its prime SoMA location, I imagine this is a very busy stop during the weekdays.\n\nEmily L. and I came for their classic mint mojito coffees (creamy, please!) on Pride and were pleasantly surprised by the overwhelming support for the LGBTQ community when we arrived. In addition to each barista having an assortment of pins proudly announcing their support for different genders and sexualities, this Philz also had a multitude of flags and a chalkboard explaining who each flag represented. My barista also asked if I'd like rainbow sprinkles on my drink in honor of Pride weekend -- um, absolutely! It was lovely.\n\nDecor aside, the drinks were as good as usual. The mint and cream really take away the bite of the strong coffee, and the large left me energized for many hours to come. Unlike the Embarcadero location, the baristas here did not overfill the cup with ice, so I got a well-sized portion for the amount I paid. It seemed that the line for mobile orders was longer than the line to order in person, so if you have to get a drink within crunch time, you may want to evaluate which is faster.\n\nI just really wish they'd ask for a name on the order and call out the name, rather than the drinks in the order. You know how many people order a large mint mojito? A lot. But I'll definitely keep coming back.", "author": "Gwen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "Nice location. They have both indoor and outdoor seating. \nGood customer service. \nI like Philz Coffee", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "Very close to the greyhound bus station in San Francisco, I walked in for a quick cup of coffee on a Wednesday afternoon. The place has a beautiful interior design and feels like a great place to just sit and chill. As I walked in, I saw many students and professionals just working away(much like you would see in a Starbucks).  \n\nThe servers were very friendly, and suggested coffee based on our needs. I ordered a vanilla based coffee and found it a little less sweet for my liking, however, the server corrected it immediately and kept checking if the flavor was fine by me.  \n\nOverall, it was a friendly experience and he service was awesome", "author": "Saarthak C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "My favorite coffee spot so far! Different blends. Very good flavors, it all tasted exactly as described. Baristas were very friendly. Location is awesome right here in downtown.  2 thumbs up for this spot.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-18", "description": "I live right around the corner and have been here a number of times over the years. I got the ecstatic iced coffee and it was not bitter, not too sweet, and went down pretty easy. Still lookin' for my dream coffee I guess. They add milk and sugar for you behind the counter instead of having a little bar you can do it at.\n\nLarge windows and lots of seating make it a nice place to sit and work on sunny and rainy days.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-11", "description": "Thanks Philz for a crappy start to my day!!! Luckily the cup of coffee is good. Guess they thought I wouldn't realize the charcoal bagel until I got to the office.\n\nToday, I was reminded why I stopped going to this particular Philz location. While the coffee is great and service behind the counter is generally good, the mobile orders can use a little help. Also, food service isn't consistent. How hard is it to properly heat something up, sometimes too hard apparently. Appears when this place is crowded and the lines are long, service is ticked down.", "author": "Michael N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "I cannot say enough about  he customer service here. I been during a rush they are so crazy nice. There was a minor oversight with h my order and I didn't mind and I had the extra time so I wasn't worried but the staff went above and beyond and even comped my order, unnecessary, but appreciated. So in a busy area and a busy time I think this will always be my stop. They go above and beyond. \nAlso, I like the coffee and the hipster-toast.", "author": "April W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-21", "description": "The one thing about being in San Francisco is that there's so many wifi networks that it doesn't show up on your list. That's a problem that I encountered while visiting. \n\nAnother thing to note, if you can get a seat inside... It's probably a lot better because the wifi doesn't reach outside that well. I came here to well check out the wifi and get a head start on all the reviews that have been collecting in my folder. Sadly though, I had to leave shortly because there wasn't any seats inside, and outside on the left side of the store there were seating but the wifi wasn't that great. \n\nPhilz was okay. It's a coffee shop. I did like the decor inside, and the baristas were all friendly. I would definitely come back if I lived here and I can see the draw to Philz as it would be a rival to the normal Starbucks. I'm not a big coffee drinker, but it's nice to get that caffeine every once in a while. I got my coffee, service was great. I'm not a connoisseur in coffee, so I can't really say much on that topic.", "author": "Bruce K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "This location is brighter (large windows to both Beale and Folsom streets; paint schemes; lighting) and therefore seemed nicer (cleaner) than many Philz locations. The spaciousness and outdoor seating is also a plus.\n\nOrder-taking is quick even when they're busy, and it does get quite busy at times. Some days getting your drink is quick and other days not so much. You can order ahead for pick-up through Caviar, and they will have their own app eventually/soon.\n\nThe closest Philz to my work so it gets an extra star.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "When I worked at the Waterfront Area back in the 1990's, there wasn't anything back then;  a sectional area that was just starting to develop. \n\nIn current time, there are new high rise commercial and residential buildings. Also the temporary bus terminal for Greyhound passengers is there too. \n\nAnd across the street from the bus terminal is a busy Philz's coffee shop. Just like the ongoing growth of the area, Philz's has added more locations including the Waterfront location.  \n\nThis is a sleek and spacious café with plenty of comfortable chairs and recliners to get really comfortable and take your mind to another level. \n\nMy latest visit, I had the popular Iced Mint Mojito. For $5.00, the iced coffee with a mint leaf topping is a refreshing beverage to relax your mind and satisfy your thirst. \n\nThere is free Wifi here. Out of all the Philz's locations and most café's, I liked this clean Philz's location.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "My favorite Philz location! Its super clean, new and bright! Plus, this Philz has the shortest line/fastest compared to other locations. I love the coffee here and I come here A LOT. I vary between the ice ecstatic or the philtered soul (iced or hot) and they always taste amazing. \n\nTo order, go up to one of the barista, pick your coffee and milk/sugar level (light, med, or sweet). They also have soy, almond milk, non fat, 2%, etc and all varies of sugar (default is brown sugar) so they your pick. Personally, it tastes the best sweet or med sweet (personally) cause they use brown sugar and it complements the coffee well. K, I'll see ya at Philz on Monday!!", "author": "Micaela I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "Clean and open environment with ample natural lighting. 1st time at a Philz so was a bit confused but the employee was nice enough to explain and made recommendations. Plus they have treats in the lobby area for your pups!", "author": "Jennifer U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "My favorite coffee shop in SF. Ayana has helped us frequently, she is so sweet and her coffees are the best. One time, I accidentally ordered a hot coffee (but meaning iced, not thinking & completely my own mistake) the employee noticed the look of sadness on my face and she made a iced coffee for me instead. Needless to say, Philz coffee and customer service is top notch!!", "author": "Brittany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "I came here yesterday, there wasn't a line but I had to wait just to order my drink. There was only one person on bar and one on register.  I wanted to sit and enjoy my drink, but this place is small and there is hardly any tables.  There was no place to sit besides next to the bathroom and I don't like sitting next to the bathroom.  I like that the location has floor to ceiling windows, so there is natural light.  There is a starbucks also joe and the juice a block away on howard street across from the temporary trans bay terminal that are both bigger than this philz location that has more seating and tables.  This location I feel that it is mostly come and leave with your coffee.", "author": "Alix J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-22", "description": "Updating this review because I don't like leaving businesses with bad reviews when I was provided with GREAT customer service from Darline, their Assistant Store Lead.  She contacted me and provided smooth communication and apologies for my previous order.  I haven't returned to this Philz location yet, however plan to if I'm in the area. Hope my Phil's Way Ecstatic Iced Coffee will be as amazing as expected.\n\nThank you Darline, you are awesome!", "author": "Tiffany Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-27", "description": "Terrible!! We went in while we were waiting for a bus to treasure island after being sent back and forth to different lines we waited over ten minutes for a hot chocolate- please note the place was empty and there were no less than 8 people behind the counter. When I made a comment that we needed to go to catch the bus the barista commented that buses come  regularly  in SF. Really?!? I think the correct response at that point would be to apologize for your lack of speed and customer service not to update me on bus schedules. I wish I could leave less than one star", "author": "jenean c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "Amazing coffee!! Plenty of different grinds to choose from, ground fresh in front of you and properly brewed (slowly over the top and not forced!). Every coffee is smooth and easily drinkable black because it's not acidic! Totally can get it iced, with cream and sugar, however you wish! Hot and cold drinks do come in the same hot cup for consideration. Always get a large, you find yourself sad at the bottom of every cup, wishing you had more!", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "Iced Mint Mojito is like a freakin relationship that you KNOW you need to just walk away but damn it's just...so...damn...good...you know the cup of heaven is just around the corner...how could it be bad for you? Right? I'm going cold turkey for awhile...I'll be back darlin.", "author": "Papa Dadoo B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "I haven't been to the other locations, but this place rocks! The service here is impeccable and the coffee is really all that.\n\nYou'll hear about Philz all the time in SF, but it really lives up to the hype. The mint mojito is to die for.", "author": "James D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-26", "description": "Slow service but very friendly baristas. \n\nThere is ample seating with floor-to-ceiling windows all around for fantastic people-watching. \n\nThey had a wide variety of pastries and toasts available - a lot of stuff I haven't seen at Philz before. Very cool!", "author": "Nic Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Philtered Soul is my jam! If you're looking for a well-balanced medium roast with nutty undertones, this is the blend for you. If you don't know what you want because you aren't that much of a coffee fanatic, this is the blend for you.\n\nPhilz is one of my go-to destinations whenever I'm in SF. This location of Philz happened to be right beside where I was staying while in town for work. Perfect! Saturday morning coffee runs: done. Ordering is quick, and staff are always polite and efficient. There isn't as much seating here as at some other locations, but it works since the turnover is pretty high--you don't have quite as many folks camping out with laptops.", "author": "Leela S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-16", "description": "My girlfriends C. and R. introduced me to Philz Coffee. One or two locations have opened up near my home in Orange County, CA. But I never tried Philz. Low and behold, I tried the famous Mint Mojito. As much as I consider myself a coffee snob, I wasn't sure what to expect. I tried the Mint Mojito- so delicious! I couldn't believe that I've never had anything like the coffee until now. I've been missing out on life. The Mint Mojito is one of my favorite coffees ever. Thanks Philz Coffee!", "author": "Deborah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-25", "description": "Location in FiDi has good amount of outdoor seating! Staff was very friendly and responsive to meeting my dietary restrictions lol. As a note, a Mint Mojito without sugar actually tastes really good!!", "author": "Vasiliy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "This Philz is the closest location to me. It's definitely meant for the folks who live in the Rincon area and not targeting those who work in FiDi.\n\nWe stopped by after lunch one day to get a Ecstatic iced coffee. I don't think I quite understand coffee or at least the cult following for Philz. I mean, it's good I guess. But Blue Bottle, Red Door, or even Starbucks *gasp* would do the same for me.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "This is a great location for Philz. The outdoor and indoor seating is comfortable to sit and people watch, read a book or get some work done. Great customer service where their employees are helping customers efficiently, in a friendly manner.", "author": "Parveen D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-28", "description": "2nd time I have went in for a coffee and food and they forgot or handed out my food order to another person.  Waited 20 mins for a refund.", "author": "Ian R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "I had heard about Philz Coffee from people and been wanting to try it out. Lucky for me as I was wandering around SF I came across this location. \n\nWhen I try new coffee shops I always get cold brew or nitro cold brew.\n\nAt the recommendation of the barista, I got the ecstatic iced coffee and it was really good. \n\nThey have a pretty wide variety of drinks. Lots of sweet drinks, which isn't for me but I can see them being pretty popular. \n\nI would recommend this place if you happen to pass by one of the many locations in SF.", "author": "James P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "One of the few coffeeshops in the SOMA area that's open on Sunday! It's fairly big space for SOMA, with several tables for seating. I also give props to Philz for the efficient ordering process. You get into a single line and go up to the next open barista. \n\nThis Philz has quick service, nice baristas, who get your order right and the same Philz consistency and quality you get across the board. I always get the Philtered Soul and it's a strong but flavorful and aromatic coffee that satisfies my nutty and chocolate cravings. Philz is expanding but I haven't been let down yet.", "author": "Truc N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "Come for a cup of the famous mint mojito iced coffee when you're in the mood to treat yourself, or just because :) I've been coming to Philz since college and Philz never failed to impress :) \n\nBut be careful! A cup can very much keep you wired for hours. So if you're sensitive to caffeine, you might want to just drink...half a cup. \n\nSoy, almond milk is free so just ask. \n\nMy recommendations: \n\nHot - philharmonic, philtered soul, soooo good, hot chocolate \nCold - mint mojito!", "author": "Dana Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "Good Philz location - great baristas, well designed interior, and a few tables outside if you want to hang out with a friend or two. It's also close to the bay if you want to grab a coffee and go for a walk alongside the water. We ordered the mocha tesora and mint mojito - they were both made well and we left happy :) We'll be back!", "author": "Saachi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "One of my favorite Philz locations in the city! Love the interior and the staff. Everyone is so welcoming and friendly! \n\nThe OrderAhead app is probably the easiest way to get your drink quickly without waiting in the huge line. There is even a special barista dedicated to making the online orders! The wait times for this location on the app are also much shorter than the wait times for other locations in the Financial District. \n\nBut if you do have the time to wait, it's definitely a fun experience to walk up to the counter to order from the counter and watch one of the baristas make your drink fresh. My favorites are the Mint Mojito (for an iced beverage) and the Philtered Soul (for a hot cup of coffee). I'm hesitant to try anything other than those two drinks because they're both soo good! In my opinion, Philz is way better than Starbucks or Peet's. Love that you can customize the milk, sweetness, and creaminess of the drinks as well. \n\nPhilz Coffee is amazing, especially this one! :)", "author": "Kathy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "This place ALWAYS has people in it, no matter what hour it is. IMO, that's a sign that whatever is going on here, works. I've never been a huge Philz fan, mostly because I like making my own coffee. But the few times I've needed some help, this Philz is the first place I come to. Lines move fairly fast, and I've never had a rude or surly barista experience here. My Philtered Soul is consistently good here, and definitely worth stopping in for.", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-16", "description": "Like any other Philz coffee, this one is very clean, very hipster, and is always a great place to study. The best item on the menu is the Mint mohito! This place also gives free dog treats for dogs and also places a dog bowl outside for thirsty dogs. \n\nI came to this location at 9am In the morning and required a 15 minute wait. I came back around 4pm and there was no wait needed at all.", "author": "Gabe F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "This is a good location to frequent when you are in need of a midday pick me up. I like that the staff always have a smile on and makes me feel welcomed :). Thankfully, It is not chaotic as the other Philz locations around the area. \n\nLast Wednesday, I was super stressed out and my coworker suggested we come here for coffee. I usually order mint mojito from Philz, but I was craving something different. I tried the Iced Mocha Tesora and wow- what a game changer. I would describe it was an adult version of chocolate milk. ^___^\n\nI really appreciate how each coffee is carefully made and they make sure to ask me to try my drink before I leave. It's the little things that Philz does that makes me choose them over Starbucks.", "author": "Eva L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "My friend and I have been getting coffee every morning from Philz, which is a 5 minute walk from the place we are staying at. I've had the Mint Mojito and Jacob's Wonderbar. It's so amazing! I recommend this coffee shop if you are in the area!", "author": "Yun Chi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "Unlike the commercial blight that has become Starbucks, the emergence of a new Philz in a neighborhood that hasn't seen one brings unfettered joy, especially to those who live nearby and thought the comforting taste of a Silken Splendor could only come in the FiDi between meetings near the office or on a special excursion to more established, hipster-centric areas like the Mission or the Castro. Clearly, Rincon Hill must be coming into its own as a true residential enclave in order to warrant the spanking new Philz that suddenly appeared at Folsom and Beale, as unlikely a location as one could expect in these parts (photo: http://bit.ly/1Pw2JL7).\n\nGiven that this is my seventh Philz review on Yelp, there is little in the way of revelation I can provide in terms of the quality of their brews. They're impeccable as usual, and the $4 Large Philtered Soul I had offered just the right amount of chocolate hazelnut sweetness to satisfy a late afternoon craving (photo: http://bit.ly/1PKwqGa). Based on their extensive baked goods collection, Jamie W. and I decided to share a $3.95 Cinnamon Twist which was just the decadent, oversized donut we wanted to have to spoil our dinner (photo: http://bit.ly/1QeMSOh). The modern industrial-chic space is pleasing although I wish they had a better configuration to add more conversational areas. Best of all is that it's open on weekends.\n\nCOFFEE - 5 stars...Philz again\nAMBIANCE - 4 stars...fitting for this part of SoMa but extra chairs would be nice\nSERVICE - 4 stars...friendly and well-trained in their brewing\nTOTAL - 5 stars...Rincon Hill deserves the next link in the Philz chain", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "This is probably one of the more popular Philz locations in the city, and I can tell why! The staff is super friendly and even though its usually packed, the service is quick. My go-to is the Mint Mojito but we also tried the iced Canopy of Heaven which I'd recommend if you like something light with a fruitier profile!", "author": "Divleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-12", "description": "What a delight it is to have This coffee shop near the Transbay Bus terminal! This establishment alone fires up my desire to be early to the bus stop. \n\nEach cup is individually made, so the length of time it takes to get a cup is a bit more than your average coffee shop. Notice on the menu that there are MANY offerings ranging from light to full-bodied coffee. Also, many types come with a fresh mint garnish. \n\nI thoroughly enjoyed my small cup of Philharmonic. This flavor/type came with fresh mint, which I felt was a great accompaniment to the skim milk I requested inside my coffee. \n\nI opted to grab a seasonal fruit Danish for breakfast. The flaky apple tart was worth every calorie--320 to be exact, which was specified on the little sign in the pastry display case.\n\nI will certainly be back as I'm curious about all the different types of coffee on the menu. I'm motivated to try them all!", "author": "Andrea H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "Love this location! Other than the San Mateo location, this is my favorite, they have everything. Its big, roomy and clean. I work a bit far from this location (closer one on Front) but I decided to wake up earlier on a rainy Friday morning to get what I been craving for since this location started. Their **Cinnamon Twist! It totally did not disappoint. They did warm it up for me, so flaky and not too sweet. Like a churro but less dough with a mix of the top layer of a croissant. So freaken DELICIOUS! A good workout before diving in this amazing pastry. haha\n\nI normally get the ice mint mojito (the best) but I needed more caffeine. I got to tried their Philtered Soul, a hint of Hazelnut. Pretty good. I got it with light cream and light sugar. I think I can do without the cream next time. The barista that was helping me, she was very helpful. I really wish they have something like this location in the MARINA or higher up in the FIDI.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "If you read a previous review, you would know that my first cup of mint mojito was actually in Downtown Los Angeles, and NOT San Francisco. However, my friend informed me that one opened up near his place, I was excited that I'm able to get a cup of Philz without walking too far.\n\nI do appreciate that this location takes into consideration that they expect a line going out of the door and have set up this branch to cater to that. And like any other Philz, you walk up and order your drink, then walk to the cashier, using the honor's system, tell them what drink you order, purchase any pastries, pay and wait for your drink to be made.\n\nMy only beef was that the barista doesn't take your name when you place the order. Maybe I'm too spoiled at other coffeehouses that do take your name (both independent and franchised). The reason why I bring this up is because someone took my drink and I had to wait an extra five minutes, which was not cool at all. The barista was nice enough to speed up my drink and did apologize, but people know better not to get between me and coffee.\n\nHowever, the second time around, a different barista presented my drink and mentioned it was Instagram-worthy, and she was wrong; it's Instagram and Yelp worthy.", "author": "Tom T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "My friend and I enjoyed this spot. The pour over coffee with many different offerings of coffee beans are fantastic and delicious! So is their pastries and avocado toast.", "author": "Jeff A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "Your typical Philz - friendly service and good coffee. Even on a crazy rainy day, this place was busy. \n\nI usually get the iced gingersnap coffee, sweet and creamy. It kind of reminds me of a chai latte but a little more subtle. It's not the quickest place and you may have to wait a few minutes for your order. They check to make sure your drink is to your liking before you walk away, which is nice. \n\nThis location has a good amount of indoor seating. There were a lot of people alone working on their laptops as well as groups of friends just hanging out yet it didn't feel super crowded or cramped. Definitely a good place to spend a lazy Sunday!", "author": "Alyson A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-25", "description": "I got an Ecstatic iced coffee and it was not good. It didn't taste right at all. The barista asked me how sweet or creamy I wanted it. I said \"50-50.\" Alas, it turned out horrible. It's a big space, but there could be more seating. It's not cozy inside like good old Starbuck's. Philz is a big name for indie coffee in SF and it's always growing. That's great, but I hope they don't sacrifice quality.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "Not only is the coffee superb, the customer service is amazing! I love how this company is customer centric. To making recommendations, friendly staff no matter how long the line is. If your coffee doesn't taste right, they'll make it again till you're happy.", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-26", "description": "I tried Decaf Mint Mojito Iced Coffee for the first time here the day after Christmas. True drip coffee freshly made with plenty of fresh mint on top. Amazing! I have yet to find something like this in Manhattan. Incredibly smooth and not acidic at all plus just enough of natural mint flavor. \n\nThere are many different options for each type of coffee roast choices. I haven't tried their pastries and other light fare items such as avocado toast w/ sliced hard boiled eggs, etc. Looking forward to trying some of these when I come back for breakfast/brunch later this week!\n\nI love their spacious open area with local art works & plenty of windows for natural light. Some folks are doing some light reading and working on laptops. Plenty of customers simply grab & go.\n\nAll of their barista/staff seem naturally friendly -- or is this San Francisco culture? (relatively speaking compared to Manhattanites) Makes me want to consider moving to SF. And 52deg F sunny winter weather definitely helps! But I would highly recommend this spot to anyone who's visiting this area of SF.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "Philz definitely does not feel like a conventional coffee shop.  Their offering is very different from a regular coffee shop.  Mint mojito Coffee is my favorite.  Once I thought of trying chai latte.  It didn't turn out anywhere close to my taste.  Recognizing this, the staff immediately offered an alternative.  What a great customer service!\n\nI visit this outlet once in a while, as it is close to my work place.  One can expect long line here and I guess this is very typical at any Philz Coffee locations.\n\nIf you haven't tried Philz yet, it is worth trying!", "author": "Srinath S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-23", "description": "The avo toast was horrible.  So........don't get that.  But the coffee/tea is always on point so do stick to those.  Back to the avo toast....I would suggest using fresh avocados because you can definitely tell the difference.  AND I taste the lime juice that you guys squeeze on their to make it seem fresh.  Yucky....", "author": "Judy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "Calling all coffee lovers in the area!\n\nIf you have yet to try Philz Coffee, then you are missing out on a whole lot of goodies! Not only is the coffee delicious, but the workers here have a \"can-do\" attitude which wakes me up even before my coffee! \n\nI wanna say that everything on the menu is great! Personally I enjoy the Mint Mojito and Ginger Snap Ice Coffee, because I can enjoy it in the morning before work or school and in the afternoon after a busy and long day. \n\nSo, If you have yet to try it out then what are you waiting for?! Even if it is just a sip, you NEED to try it!", "author": "Benson M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-09", "description": "Close to greyhound, like literally across the street which makes my life so much easier for some good coffee! \n\nInside is very spacious and limited on seating which is a con. Most seats were taken so i had to stand near any counter i can fit in. Lol. \n\nLines are short on a saturday i think due to location, when its non working days equal no office workers. My drink was served quick, which is a plus for on the go. \n\nBathroom, 2 of them are unisex, roomy, clean, and perfect for small or big business lol. \n\nOverall this is bookmarked and my go to spot whenever i get off greyhound, thanks for providing one cup at a time for us to enjoy. Thanks for reading and keep on mojito it up!", "author": "Alex T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-22", "description": "I can't describe how superb the service is here. After tasting my decaf coffee and telling the barista that it was way too acidic, she immediately said not to worry and that she would make a whole new one for me. She even reassured me that she wouldn't let me leave without a coffee to my liking.\n\nI ended up with the Swiss pure water. Note that the darker the roast the less acidic (a tip the employee told me haha). I had to add some water after but after that, it tasted pretty good! I can see why this place is flourished and also expanded to LA.", "author": "Carlin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "Wow! New discovery for me.\nI've visited now 4 times and must say this place has the best customer service. I'm not sure how management handles its selection but I'm impressed.\nI wanted a coffee w/heavy cream.\n\nThe barista suggested a sol/ w cream and I don't know. Whatever it is, soooo good. On top of the kindness, \"have a nice day.\"\nLeft me to start my morning off in a great way!", "author": "Natasha L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-13", "description": "Love this place!  Great coffee but there can be a long line.  My favorite is a lg Red-Haze sweet and creamy with almond milk and honey.", "author": "Armando P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "I go to this Philz location multiple times a week. Most of the time I will use the OrderAhead app to avoid the lines in the morning and just pick up my coffee and go. If I'm not in too much of a rush, a huge part about Philz is the experience of ordering from your barista and then having a sip to make sure that it's just right. \n\nHighly recommend the Iced Mint Mojito. I tend to have the Iced Mint Mojito as a treat and go with a dark roast black coffee like Julie's Ultimate as well as Philharmonic (with mint) on a more regular basis.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Philz, welcome to the neighborhood!!! :) we definitely needed a coffee shop like this one!\n\nA large selection of freshly drip coffee, that the friendly and super nice personal can customize further upon customer requests!\n\nGreat seating area, and ambiance!", "author": "Gilbert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "It's a clean chill vibe. Their black coffee is good and they're super nice!\n\nI ordered a regular iced coffee with soy milk and it was Yums. It's a blend of different coffees which turns out pretty good. They like to make your coffee for you to the very end though, which at first I didn't like until I tried my coffee.", "author": "My N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "This is the newest of the Philz coffee's (or at least one of the newer ones as of 1/16) in San Francisco, and it's great. The baristas are friendly and knowledgable, the WiFi is free and fast, and there's ample seating if you want to stay and work for a little bit. There's one longer wood, communal table, 2 more comfy chairs on a corner, and a smattering of 2-seater wood tables. The space is filled with natural sunlight, lots of windows, and the communal table is nicely separated from the hustle & bustle of people ordering and paying for their drinks.\n\nOrder your drink with one of the baristas (pick light, medium or heavy on the cream and/or sugar) and then go to the counter to pay for your drink (even if it's not ready yet). My favorite is the Philtered Soul, but the descriptions listed under each blend should help steer you in the right direction. I got the Chai tea with some almond milk, and it was delicious. It's not your typical latte like most places where the tea is just boiling water and a tea bag, too much sugar, and some milk. These teas are delicious and my be my new obsession since I've pretty much cut coffee out of my diet. The chai is pretty spicy, strong, and will keep you well caffeinated.\n\nThe music they were playing was similar to Spotify's \"Tropical Morning\" or light EDM - think Kygo, etc. I found the music to be quite enjoyable, but it probably rotates and your taste in music is probably not the same as mine. But the coffee and tea is delicious, they have Pepple's donuts, pastries (croissants, muffins), breakfast burritos, if you want to complement your drink with breakfast or a bite to eat. I'll definitely be back here - it's nice to have a free WiFi coffee shop to go to that is not Starbucks or Peet's. \n\nThey take credit cards & Apple Pay (NFC) - if you pay with that, it's much faster than a normal credit card!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "Through word of mouth, we came here for their soft opening where Phil himself wanted to give everyone a gift which meant free beverages and food for a few hours.  I'm Asian so I like free things and I don't mind waiting in long lines to get them.  \n\nMy go to is usually the mint mojito but I decided to try something different.  Honestly, all coffee tastes the same to me.  My rating scale is very simple; good coffee, bad coffee.  I got the Silken Splender which is a medium blend with hints of dark cocoa, nuts, and butter. Good coffee. \n\nIf I were to compare Philz with the other competitors, I would say their coffee is the best but also the most expensive.  Since my standards are very low for coffee, I'll take cheap crap over expensive taste any day.  Sorry Philz, you're good but I just can't afford you.\n\nExcellent service. Will come back everyday when I win the lottery.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "I left San Francisco in 2012 and didn't return for a visit until 2017. I landed at SFO, took the BART into the city, and made a beeline for Philz for the best cup of coffee (Ecstatic iced) I'd had in five years. Plus, the baristas are always so friendly! Oh PLEASE open up a Philz in Vegas.", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-29", "description": "My least favorite Philz location. \n\nMy tea (black tea with 2%) is always consistent at any location, except here. It just doesn't taste as good. Lukewarm. And... Almost flavorless? And the mint has been forgotten. That part doesn't bother me so much as the tea just tastes different.\n\nThat aside, there could be a little more seating indoors. It is very spacious but seating isn't plentiful. \n\nThere is a small area to sit out front, too, but it can be shady (meaning a wee bit chilly).", "author": "Kristin Leigh M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "Coffee was amazing! All the baristas took their job serious and actually cared if you liked the coffee or not.  Otherwise they would remake it on the spot.", "author": "J T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "This brand new Philz location simply rocks! Spacious and with lots of natural light, located on the busy intersection of Folsom and Beale. This neighborhood definitely needs an addition to Starbucks and Peets, especially on the weekend.\n\nI enjoy the friendly service here, and of course my favorite drink, the Tantalizing Turkish. Also make sure to try their crowd pleaser, the MINT MOJITO.\n\nBrand new and just awesome. Philz', the San Francisco-bred coffee shop, is growing!", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-18", "description": "Philz should be the \"chain\" that sets the standards for a good cup of coffee. Each cup is individually made and delicious - if you don't love it, they will remake it. How's that for a guarantee?\n\nEverybody pops their Philz cherry on the Mint Mojito - but when you've graduated from that, try a Philtered Soul. You've got a huge menu of options - try them all!\n\nI might be poo-poo'd by coffee snobs, but I think Philz beats a lot of the independent coffee shops out in the City. If Starbucks is a 2, Peet's is a 3, Philz is probably 4, and my favored coffee shops like Sightglass or Blue Bottle are clear 5s. Obviously Philz and Blue Bottle are totally different styles of coffee and appealing to different palates - but I really don't think you've \"lived\" until you had a gibraltar from Blue Bottle. I just also can't get enough of that New Orleans ice coffee either - whatever is in that milk or the coffee has a natural sweetness that is divine.\n\nThat said Philz is about that single serve coffee, and they do it right.\n\nWhy not get a cup today?", "author": "Doug R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "Amazing decaf. I also get the Colombia with a little cream and no sugar. I love Philz, only place with decaf done right.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-26", "description": "Thank you Phil for opening this location on Folsom!  Less corporate workers equals less lines meaning I don't have to endure a long queue of people to order my Jacob's Wonderbar.\n\nI was going to the Embarcadero location near the Hyatt Regency but this one is now my #1 Philz.  \n\nMEMO to FiDi workers: stay on your side of Market and us SOMA workers will stay on ours.  Thank you.", "author": "Ben H L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "I pretty much love all of the Philz Coffee locations.  I love the coffee so much that I even bought a branded re-useable tumblr.  Outside of amazingly/ crazy coffee concoctions; it's the employees that really make it such a great place.  I came here on opening day and it basically was a huge party: free coffee, free pastries and the employees are so friendly they feel like your own friends.  My neighborhood spot I normally go to is in Westborough but I am so thrilled that 3 have recently opened near my job in SOMA and the FIDI.  \n\nMust Try Coffees:\n1) Philtered Soul\n2) Gingersnap (hot or cold)\n3) Mint Mojito\n\n*Quick Review:  If you see a Philz...GO!  You might even catch the owner Phil himself!", "author": "Brittany S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "I didn't realize how much of a gem this place is until a Yelp search told me all the coffee shops in the 5-block radius were closed on weekends, except this Philz at 300 Folsom! They close at 3 pm on Sat/Sun.\n\nDon't want to wait in line? Order ahead with the \"order ahead\" app, allow 15 minutes in the mornings or 10 minutes when the rush dies down. Great time savings!", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "Cute clean place and warm welcoming staff. Mint Mojito is a must and they did not disappoint. Would definitely come back.", "author": "Erica D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-01", "description": "Solid coffee option, this location is new. They do a ton of types of coffee you can mix and match or blend. Everything here is drip coffee, and it's reasonably priced for the quality of the product. I forget what I had exactly, but one of the light roasts and it was quite good. I probably would do a medium roast next time. \n\nThe staff was very friendly and prompt, helping me make my choice!", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "While visiting the Google SF office, I swung by here to grab some coffee and pastries. Ordered the Jacob per recommendation from the barista(male) and almond croissant + cookie. Their staff is friendly and service is quick. Exciting to see so many Philz in SF now.", "author": "Yonnie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "I'm worried Philz is going to pull a Krispy Cream and grow way to fast. Please don't let that happen Philz. There couldn't be a company that I'm more happy to see growing so I do hope they can handle the growing pains and become available everywhere. \n\nI've been here three times and so far there has always been people here drinking their coffee. This is a great way to start things. \n\nThe staff is very friendly and their politeness is what will insure their success. I guess the best cup of coffee in San Francisco might have some something to do with it to. Every cup that comes out of here is perfect.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "Delicious croissants and coffee. Light roast was great, not over roasted like so many other places!", "author": "Rebecca P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-25", "description": "I visited & walked over half a mile to get a mint mojito.. my $11-- WASTED. The coffee was SO BITTER and NOT even sweet. I go to philz all the time in every other location but this one really disappointed me. I always get the usual mint mojito & it tasted NOTHING like it. The barista really messed up. Will not ever come back to this location.", "author": "Gabby L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-15", "description": "This store is great. It is location in a great area. I love Philz Coffee. They rock. They know how to make my hot chocolate right the first time. I will come back to this store when in the area. I love Philz Coffee.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "One of my favorite Philz to do work! The wifi is stable and has a decent speed for your typical web surfing (8-9mbps). Their music selection is great and could range from Top 40s to old school music. The volume varies too. I'd say it's 50/50 split on a little too loud and just right. Really depends on your mood. I bring noise-canceling headphones and it works out. The staff are friendly! There are ample seats", "author": "Rosita W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "What may just beat how good and smooth their coffee taste is how friendly and patient their baristas are! \n\nI can't tell you how refreshing it is to get a warm smile and walk into a chill pace early in the morning. Sometimes the hustle and bustle and rushed atmosphere of Starbucks just revs you up even more in the morning. But when I've started my day here, no matter how much of a rush I'm in, I feel like my day is going to turn out just fine.\n\nAs for the coffee, I've experimented with a few and realize that in the end, it really is that whole cream that makes the best cup. I went with skim with a variety of combos and just found that it's that creaminess of the cream that mellows out the whole drink and allows the smooth taste to come out.  \n\nJust let go and be one with the calories.  Then go for a brisk walk back to the office and you'll still feel better about having gone here than the local Starbucks.\n\nI'd recommend some outdoor seating once it warms up in the spring.", "author": "Angela K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "My favorite coffee in the city--so many coffee choices, which you almost never see elsewhere. The food, ambience and decor fit the SF feel very appropriately. The specific Folsom location is convenient for Transbay bus commuters and nearby tech workers. There's some space for seating although not as much as some other locations.", "author": "Arvindh K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Coffee is Craft. Philz knocks it out of the ballpark w/ the dozens of fine combos of coffee. If you can taste it and name it, they have it. \nI had the (un)Fortunate pleasure of taking my Sbux addicted parentals to this coffee gem and boy were they in for a surprise! Luckily, we had \"Siby\" (coffee master) to help navigate us through their world of whole beans. The customer service was fantastic and was second only to the drinks she made us. \nWarning: flavor are bold so this isn't really a place for amateur coffee people. It does however, provide a platform for the coffee novice willing to treat their palate well and show them the way of the grind. I was also please to hear they will be opening a location off Ocean within the next month. The place is clean, open, fun, and has by far some of the best coffee we've ever had. Will def add this to our list of places to stop when we're in the City.", "author": "Isaac L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "I can't contain the excitement that I felt stepping into the Philz that just opened up two blocks from my place!! Now I don't have to walk miles to get a good cup of coffee.\n\nI've been to Philz Coffee (this and other locations combined) only about 5 times over the past few years, but it's slowly growing on me. I've began to notice during each visit that their service is great and baristas are super friendly. Larger coffee chains like Starbucks or Peets really can't compare in that sense.\n\nMy current favorite is the New Manhattan (light roast) with cream. I still need to go through a big chunk of their menu to really find my go-to drink, but that shouldn't be too hard now that the opportunity is in such close proximity...\n\nOther cool thing about this Philz: It's open 7 days a week, and doesn't close till 7pm on weekdays (which makes for a good study/work spot).", "author": "Vivian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "I absolutely love Philz and the one thing I can say about every Philz is that the consistency of a brilliant cup of coffee blows my mind. I went to the Philz truck the other day up on Sansome and the coffee was just as amazing! \n\nSo if this is your first time at Philz, I'm sorry, they don't do lattes or cappuccinos, but believe me once you are converted you'll forget all about your past loves. \n\nSince discovering Philz I cannot imagine not having it in my life. \n\nThe baristas are awesome and always ask you to try the coffee to make sure you are happy with it before you walk away. \n\nMy only gripe not just for here but for all coffee shops, they are no longer a place for you to hang out with your friends, they are made for quick stops ... That makes me sad :(", "author": "Susana P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-22", "description": "Beautiful space and has a very modern and industrial feel (it really suits the neighborhood it's in, surrounded by new buildings like Jasper and Lumina).\n\nNot a ton of indoor seating (1 large table, fits 8-10 with computer outlets) and a few seats by the windows. However, lots of outdoor seating so it's great during the summer times for grabbing coffee with friends and unwinding. \n\n-1 star because prices have gone up $0.50 for all the specialty coffees (as of a few months ago)...as if $4 for a mint mojito didn't hurt my wallet enough!", "author": "Jennifer J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "The best Philz in terms of interior in my opinion. Maybe because of the location, it doesn't feel as crowded as the other locations. The outdoor seating area is inviting on a nice sunny day.", "author": "Yad L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "5+++++STARS!!!!!! \nI am a huge coffee addict! I've tried so many different coffee places! Man Philz's Coffee takes the cake, tea, and coffee! I love this place their coffee is amazing! And on top of that their service is top of the line! All the Barista's are really sweet and helpful! Plus their menu is super neat, it has the coffee name and what the flavor is. It's amazing i love Philz! Thanks guys!", "author": "Kris G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Place a cool urban vibe! Smells awesome and staff is really helpful in helping choosing a new brew. Got me the tantalizing Turkish and  Tesora.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "I am a fan of Phil's, but less due to their fancy drinks and more for their solid drip options. \n\nOne deterrent for me is the chaos from where to stand in line, which barista to order from, where to wait, etc. The setup isn't ideal and it can be a bit overwhelming. Because of this, it's not a location I would settle down in to get any work done, or even catch up with a friend. Just too noisy and frantic inside and it's hard to really know when your drink is ready. \n\nRegardless, Philz brews tasty coffee and I've never had any issues with the staff.", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "Best coffee that I have ever had...period. Staff is always friendly and only care to make you the perfect cup of coffee.\n\nEvery time I have a nice cup elsewhere I always compare to Philz - I've yet to find a match!", "author": "Mark F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-23", "description": "Morning following a night in the city, Philz is cool, and cost is par for the course as far as prices in the city goes. However the barista and cashier were hella rude...mad because some people suck. The coffee was very delicious but Sight Glass is better. Toast for $5?!", "author": "Ish A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "I would totally go back for the mojito iced coffee! The staff was so friendly and the service was quick. I wish there was a business like this in Milwaukee! The store was very clean and the staff was smiling the entire time we were there.", "author": "Robby M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "Ahhh great service,amazing coffee,must come here,can even get a dog snack for your pup", "author": "Kat S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "I splurge on the mint moquito when I find a Philz. Mint, ice, coffee... Great cool combination for a summer chill treat. The staff was friendly and patient.", "author": "Julie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "Mint mojito iced coffee all day! Perfect blend of sweet and creamy with a refreshing hint of mint. I love how personalized the coffees are. I dig this location bc it's less busy (no line around 1pm on a weekday) and they play top 40 songs like Ri's \"work\" song. And the baristas here are very friendly n can get down with the music while making great coffee!", "author": "Joy-Alonica B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-03", "description": "Philz coffee was ok.  I didn't find it comfortable or the tea very good. I found it difficult to order and difficult to pay.  The staff was very busy and not friendly for a newby.  It is the only coffee house in the area and I probably will give it another try.  It was clean and I give it 3 stars for that.  It's not my favorite place for coffee.  It get one star for being open and quiet from a noisy street.", "author": "Veda F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-27", "description": "I'm not a coffee drinker (blasphemy I know) but the workers in here are very nice as I sometimes pick up non coffee related items.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "Love this place.  Went once and I'm hooked. They have great service.  There are so many options. Plus, you can change the drink if you don't like it.  They ask you to taste it in front of them to make sure you are satisfied before you go. I hadn't seen anyone dissatisfied. Every Flavor is unique.  They are quick to get things done,  but have an art in how the drinks are  made. Fresh coffee! Check it out,  if you haven't already.", "author": "Aycell J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "Location location location! This philz is perfectly located on my way to market street.\n\nPicked up some seasonal fruit Danish warmed up so quickly.Fast and courteous service.", "author": "Priyanka L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "If you are a coffee fanatic, there's no denying the two best parts of coffee are: the flavor and the environment. Philz Coffee offers both of these effortlessly. The unique friendly layout beginning the line with a sign \"You're Up Next! Hang Tight\" to the personal communication with your barista asking specific questions about your taste preferences, offering recommendations and even samples. As I went to pick up my order they even had me try it to insure I was satisfied with my cup of coffee. I tried the Silken Splendor with Almond Milk sweetened with Honey. This was my first time at Philz Coffee while being out of town for work, but can't wait to come back to their Huntington Beach location as well! Philz Coffee may become your next morning habit!", "author": "Brooke B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Nice! Now we have a Philz only a block from our office. There seems to be a new Philz popping up everyday in the city. Which is a good thing. \n\nLet's first get one thing straight - every single Philz location is five stars. Period.\n\nI've been on a quest to try every flavor of coffee available at Philz TWICE. Once with cream only (which is how I normally take my coffee), and then a second time \"Philz way\" - which is supposedly medium sugar and medium cream. I'd figure when something is named after the restaurant/bar/deli/chef/owner/etc, there's a reason for it and I want to experience it they way it was meant to be experienced by the visionary who created it. No one wants to view the Mona Lisa with the salad dressing on the side. Experience it for how it was meant to be experienced!\n\nThey have a nice selection of light, medium, and dark roast coffees. So far they've been all good, and I can't quite pick my favorite.\n\nDo yourself a favor and go to Philz. Now!", "author": "Richard S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "Philz is a fun hip coffee spot. If you are a coffee fanatic, then you should check this place out. They sort their coffee by Roasts. Every single cup is specially made to order. None of that drip coffee nonsense. My favorite thing at Philz is the avocado breakfast toast. I also tried one of their breakfast wraps and it was eggcelent.", "author": "Hanan Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Pokemon stop nearby!\n\nHighly recommend Anesthesia to the upside, which has stone fruit aroma perfectly blended into. Everybody loves their mint mojito, but it probably won't get you enough caffeine if you order the small size.\n\nA lot of financial district office people come here in the morning. If you can, I recommend you come here after 9:50am, the long line miraculously disappears since all the white collar have to go to work by 10 (how sad:P)\n\nWith many outlets, free wifi, and clean restroom, this is also a good working place if you don't mind billboard type music.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "There is no excuse for the bad customer service at this place. The coffee is good but doesn't make up for the attitude", "author": "John R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "I had a mint mojito iced coffee and loved it.\n\nI'm not crazy about the layout of this place. It's on my way to the pharmacy across the street so I'll only  go when I have to renew a prescription\n\nAfter  you order you have to walk to left (thru people waiting)  to pay, then walk back to right, thru all the same  people waiting for their coffee, to sit and wait.    Then to leave after picking up your coffee you go thru the same crowd of people to get to the door.\n\nAnd since they don't take your name, and barely talk above a whisper when the coffee is ready, it's very confusing when to go get your coffee.  I was trying to pay attention to who was ahead of me in line, and who was behind me.  But then my order was ready before people ahead of me, and then We were all wondering whose order it was.", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "The staff are super friendly and efficient! They are great problem solvers as well since I had a problem paying the other day and they helped me work through my problem and we all laughed about it later! Great team!", "author": "Alex D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "I'm delighted that Philz opened in this location. Its super close to my work place so my co-workers and I frequently come here. This is one of the smaller Philz coffee shops though, so its more a grab and go place rather than a place to go and sit down to do some work/catch up with someone. But the service is always friendly and the coffee at this chain is consistently good and the location, very convenient which calls for a lot of return trips.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "So great to see this new business at Folsom and Beale; especially happy it's a Philz! Jessica, Josh and rest of staff super friendly and helpful. Come out and support our local retail!", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Loved my experience here. Friendly baristas, amazing flavors in their coffee (and a wide selection for any taste) and a flavorful avocado toast that was simple, hearty and tasty for a breakfast option. Will definitely recommend to friends visiting San Francisco.", "author": "Kate W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "This is a HUGE step forward for a more complete Rincon Hill neighborhood - and a fantastic location for Philz Coffee!  While the weekdays will easily be the busiest with the extra 100,000 or so commuters in the SoMa office buildings doing their work thang, the weekends will likely prove that there is A LOT of pent up demand in Rincon HIll for neighborhood businesses like Philz that can provide a spot where faces become more familiar and frienships form.  2016 is going to be a very exciting year for Rincon Hill - and I think Philz Coffee at Beale and Folsom Streets has kicked it off with its opening on December 14, 2015!\n\nFirst, I gotta admit that I do not consider myself a coffee drinker.  Second, I've been to Philz twice - both the Saturday and Sunday of their first week of operations.  I had the Tesora with medium cream and sugar on Saturday, and it was delightful! I like that the barista had me try it out after she prepared it and called my name \"to make sure its perfect.\"  On Sunday, I had the Dancing Water, and it was very good too - though I think I personally enjoyed Tesora more. \n\nThe baked goods I've tried were high-quality treats - a persimmon danish on one visit and a chocolate croissant on another.\n\nI'm so excited to have this business join Rincon Hill's other neighborhood joints like Local Kitchen, Cocoon Urban Day Spa, and Spice Kit.  The coffee is great - and that comes from someone who has very rarely drank coffee in his life.", "author": "Jamie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "Ok- It took several tries, but I'm a fan!  I'm was a Peet's faithful.  I like my coffee strooooooooooong!  And Peet's delivers that stroooooooooong flavor that I yearn for. I was peer- pressured into trying Philz.  Philz opened a location near my office and became the hot spot for meetings and the necessary 3PM fix.  I admit, it took several tries before I found my coffee heaven. Again, I like my coffee strooooooooooong - no cream, no sugar-  at the recommendation of others I tried Jacbob's Wonder Bar (hated it), Ambrosa (hated it), Philtered Soul (not so bad, but not great)  before I found my heaven with Ether.  Ether is literally the best coffee ever! I've become an addict.  I also absolutely love the Isantbul tea (a mixature of black and green tea).  \n\nAlso, kudos to the great staff!  The staff ensures that your coffee or tea is made to your liking.  \n\nI mostly frequent the Philz Coffee on Folsom because it's close to my office, but I also want to send a shout out to Philz Cofee in Berkeley (@Shattuck), where I frequent to get my weekend fix.  Again, always a great cup of coffee or tea and great service.  \n\nThe only negatives are -  the cost, but the good stuff is rarely cheap!  And locations - can we please get a location in Oakland?! Even Alameda?!", "author": "Tina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "1) the employees are SUPER nice\n2) the place is always clean and in very good (cozy) shape\n3) the food is fantastic\n4) the coffees are all the delicious and I swear they hug you from the inside out. \n\nI love loving you, Philz coffee!", "author": "Grecia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-29", "description": "I love philz coffee, especially the first few ones. I love the coffee. But in the location the staff are not very friendly.", "author": "Aram S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-03", "description": "Nothing gets your ears tingling and your head buzzin better than Philz \"Greater Alarm\".  I believe this light roast is Philz highest caffeinated coffee.\n\nEach cup of coffee is brewed one cup at a time and taste great!", "author": "Steve D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "Cheerful, friendly, relaxed and above all an awesome coffee house! I had the Philtered Soul and loved the nutty toasty notes.", "author": "Tiago M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Quality over quantity. Great made-to-order drip coffee. Yummy cinnamon toast. Wonderful staff. Pet friendly, too.", "author": "Peter R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "People here are really nice and friendly. They always ask if you like the coffee or they can remake another one for you! I like the wonderbar!!! so tasty! Would be my daily visit!!", "author": "Yan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "Visiting from Long Beach California and I arrived in SF at 530 am! They were welcoming and so happy at such an early time! ALSO good music choice I knew every song ! It's nice and comfy and I will definitely be back when I come back to visit!", "author": "Lauren T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-19", "description": "consistency is based on who makes your coffee.. :(\ni ordered the same drink two days straight. One of them is perfect... the other, I need to request for a lot of adjustments :( and it still wasn't as good as the one I had the day before.", "author": "Katrina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Five stars for everything but price.  I just can't get around paying four dollars for a cup of morning coffee no matter how good it is especially when Peet's, which is a very good coffee as well, is half the price and wait.  Alas, though, it's really good stuff.", "author": "Nathan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "Coffee or covfefe however you like it you'll love it here! Don't expect to grab and go but if you want a GREAT cup of coffee then this is the place. The other coffee place (S#$?Bucks) doesn't even compare. Do yourself a favor and go to Philz well worth it!", "author": "Sean D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "I an a recent convert from tea to a coffee drinker. Philz coffee is definitely my favorite coffee place. Their individually prepared coffee is what i value the most about this chain. People are friedly too. I love their mint mohito. I dont love their pastry though, they were not fresh the two times i bought them.", "author": "Joe W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-04", "description": "Better value than Starbuck. Decent coffee.\nBut this place could put in more seating, why the big empty space?\nBackground music annoying, too loud.", "author": "Ken V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "I love pour overs!!  I had filtered soul (hint of hazelnut but not like usual flavour coffee) The flavour is so well balanced that I couldn't help but want to go back each day! \n\nBe prepared to wait 5-7 minutes after you order so they can prepare your drink.  So make sure you leave time for lines!  But well worth it!", "author": "Melissa Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-05", "description": "I hit Philz 2-3 times per week and typically have a 5 Star experience--the avocado toast is fantastic and the coffee is delicious. I'm writing this poor review, because I went to Philz today and ordered the coffee I order every time--Silken Splendor, low-fat version, no sugar. When the coffee was ready it had sugar and I told the woman that it had sugar and she was defensive, telling me that no, it was only the low-fat version...it was super sweet and I order this coffee all the time. Finally, she said she would remake the coffee. When the coffee was ready for a second time it was awful--it tasted watered down and flavorless, I threw it out. I was so disappointed! 95% of the time I am SO happy with Philz, but this experience really bummed me out. I will ask to have someone other than this woman make  my coffee in the future.", "author": "Shelly K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "Honestly i have been a big fan of mint mojitos, but never expect this place brewed better mint mojitos than the others, i loved it !", "author": "Y J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-07", "description": "One cup at a time is their mantra.  As a business thing, it takes much too long waiting for a cup of Joe.  Too pricey as well.  I went broke during my office break.  Sorry, I wish I can deliver a more worthy critique.  If I was on a vacation I can wait forever.", "author": "BanBan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-18", "description": "Friendly staff, quick turn around for coffee and gorgeous new amenities. Recommend this coffee shop and will definitely come back!", "author": "Alex G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "I love this Philz Coffee. Come in on occasion and there is usually a small wait but no problem. One weekend the wait was a bit longer than usual but the baristas acknowledged us continuously thanking us for being patient. After about 8 minutes in line we were off in drinking that delicious coffee they make for me sweet and creamy. Drinks are always made delicious and service is always great!", "author": "Elizabeth A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "Best brewed coffee. They can bring out the best flavors of each beans.", "author": "Wei W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "quick friendly baristas on a Sunday morning!  I had the Tantalizing Turkish which is a dark roast coffee with fresh mint leaves! This philz is bright with a lot of space so if you are looking for a cozy coffee shop, this probably isn't it.", "author": "Meredith M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "Let's be honest, Philz is unbeatable. I have yet to find a comparable taste. Sure, there are great small batch coffee shops, but Philz has the system down.", "author": "Adam P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "Just Great!!!!!! The Mojito is crazy good. This is a totally unique cool spot. Loved it!!!! Perfect for me .", "author": "Gwen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Excellent service and coffee. Came on our day in the city to enjoy the Super Bowl City. Eric treated us with excitement and speed which encouraged us to try more of the products. A pumpkin bread fruit danish later, we are quite satisfied customers.", "author": "Anthony F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "To be honest, I'm a little bummed that this location opened up. I thought I was free from my addiction but they decided to follow me to my new job. Philz is amazing and this location is less crowded than the others (don't come here). Coffee is on point and the staff seems less stressed.", "author": "Eddie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "Happy to see a Philz in this area.  Nice and bright, and open on the weekends.  Not a big deal, but would be good to have a little more seating, and perhaps open a little later on the weekends.", "author": "Alvin Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-07", "description": "I used to have Philz almost every day when I lived off 24th........so I was totally ready for a good cup of Jo...........the Coffee was good, but I couldnt believe the price. I think they are the most expense coffee place.......like ever........and $18.00 for a lbs of coffee......PLEASE. I think they've gotten a little to big for my taste.....or at least their prices.", "author": "Troy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-07", "description": "Love the location and love the attitudes of the people that work here!\nThis is an amazing place to open a Phillz because the one downtown is always over-the-top super-crowded, and who has that kind of time to wait for A COFFEE?!\n\nThis place is such a treat on my buy-my-coffee-Friday-mornings! Love me some Tantalizing Turkish!", "author": "Aggie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "Great coffee, but long lines and sometimes rude staff. Up to you if you'd like to take the gamble on the wait, but the Moroccan Mint Coffee is the stuff of legends.", "author": "Ali M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "This is delicious coffee. Prices are right, coffee is good, they have wifi. I love regular filter-made coffee and this cup is as good as any. Lots of different blends to try and you're going to find a favorite.\n\nI make the beans at home and it's never as tasty as in-store. Nice folks at the counter too.", "author": "Al M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-16", "description": "A swanky place for fresh-brewed, on-demand coffee available in at least a half dozen or more varieties. The bakery items were OK, not awesome, but the service all smiles and friendly.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "Baristas are always friendly, lines are not crazy and coffee is brewed pretty fast what more can one ask for. Oh and to top it off the employees will tell you about delicious off menu secret blends.", "author": "Dennis K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Great coffee. I like the Jacobs Wonderbar. Much needed business for this neighborhood.", "author": "John W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "Wow this is exciting news, I have only frequented Philz in Palo Alto because I live near there, I also live in S.F.'s SOMA neighborhood and I would have to go towards 3rd / Mission for coffee and mostly walked there (don't even have a dog to walk to make the walk fun) on the WEEKENDS!  Or make plans with friends for weekend brunch (any neighborhood) to get coffee here in SF in the morning.  I ended up weaning myself off coffee though and became a tea drinker so only drink coffee on occasion,  I am looking forward to coming to this new location on the weekends.  I do have a Peet's & Starbuck's on 1st and Harrison on weekdays but they close when the businesses shut down for the day.", "author": "Stephanie I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-24", "description": "Great coffee/tea, great service, and clean! This Philz location is stellar, and they do a fantastic job handling a very high volume of customers in an efficient fashion. I often use Order Ahead at this location as well, and they are always on time. Thank you!!", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "What can I say about Philz besides THANK YOU! They get me up and going almost every morning as I head to work. I don't think I could live one week without their delicious coffee. The cashier always knows my drink when I come in and never misses a beat with getting my order ready and perfect. I love getting jacked up on Philz coffee. And this is the best location by far.", "author": "Doris G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "These guys know coffee!!! Their blends and brewing method are the only thing I'll trust outside of making my own brew at home. Seriously amazing, do yourself a favor and try them out!", "author": "Katie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Coffee smells so good, and service are great.  This is the coffee I miss most after move out SF.  The only downside is the restroom was kind of dirty, and no tissue in one of the room, and the line was long.", "author": "Ana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "I absolutely love my new neighbors! I cannot imagine a better business to have moved in. The only thing more amazing than the coffee is the incredible staff. If you have not tried Philz yet, please do so. You will be very glad that you did!", "author": "Doug B."}
