{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "Honestly I just come here for the mint mojito iced coffee. I haven't ever tried anything else and I probably never will. I don't want to hype it up too much, but it's bomb. Just try it.", "author": "Megan Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "Best Chai Tea I've ever had!\nThis coffee truck was just waiting for us at the Marina District Marina Park. We stopped and got a Tesora coffee and a Chai Tea. \n\nThe Tesora was much too bitter for me, which I found surprising as it's a medium roast and I'm used to drinking darks. But everyone has differing tastebuds so don't take my opinion as gospel. I had the Chai Tea and it was AMAZING! So smooth, buttery, and spicy and deliciously garnished with a mint leaf. \n\nWould love to grab another CT the next time we're in San Francisco!", "author": "Mikkel J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "Prefer the place on Ocean for studying but in terms of outdoors adventure this is perfect! I recommend/love the mint mojito and the ecstatic. Philz is the go-to for iced coffee!", "author": "Theresa Thao N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Love these guys! Great coffee! That's a given but more important is the friendly staff.  Everyone I worked with is always so nice though...... I wish maybe they would have name tags or something so I know their names.   I would ask one of them out on a date I knew his name. Philz Coffee Truck- San Francisco", "author": "luke b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "Philz on wheels seems like such a good idea, doesn't it? The irony of its frequent placement on Sansome between Pine and Bush is that there are other Philz within spitting distance, and if you don't spit, walking distance of each other. Ah, but there's also a big Blue Bottle just up the block, so the war to lure overcaffeinated office workers in the FiDi is in full assault. Game on, Blue Bottle. All they need is a truck, and we could have a Mad Max-meets-Fast & the Furious showdown race after midnight. Only Starbucks would probably sponsor the event and dilute all the coffee to maximize their profits. What an ugly coffee lover nightmare. The reality is that the one-cup preparation at Philz doesn't really lend itself to a mobile truck setting.\n\nDespite the friendly instructions on the mini-chalkboard, the routine was a bit awkward for me to order and then step back and wait on as busy a block as Sansome is during the work day. Dodging youthful spitfires at full speed on the sidewalk, especially when they head to and from the Equinox with their headphones on completely focused on their smartphones... well, it became sport much like being the goalie on the Real Madrid team. But the payoff is that my $4.50 Mint Mojito is truly as satisfying as any I get at one of their brick-and-mortar locations (photo: http://bit.ly/2vNTPGF). Try not letting your phobia about food trucks get in the way of your Philz fix.\n\nCOFFEE - 4.5 stars...the mint mojito is still a tantalizing treat even from a truck\nAMBIANCE - 3 stars...uh, it's a truck\nSERVICE - 3.5 stars...same artistry except they shout here because of the noise\nTOTAL - 4 stars...Philz on wheels...weee!", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "Mint Mojito Coffee!\nMint Mojito Coffee!\nMint Mojito Coffee!\nMint Mojito Coffee!\nMint Mojito Coffee!\nMint Mojito Coffee!\nMint Mojito Coffee!\n\nSeriously the best coffee I had in all of SF- actually in all my life and at all the coffee shops I have gone to! \nThis was so incredible I need to find the one in LA to come there on a monthly basis. Do yourself a favor and make sure to come here if you are in Sf", "author": "Arica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "This truck was sitting outside near a park near the Golden Gate Bridge and my friends and I decided to get some coffee. I ended up getting the Iced Coffee Mojito in recommendation from a friend and it was surprisingly good!\n\nThe iced coffee had a creamier texture to it but at the same time, the combination with the mint leaves made it taste super refreshing and cooling. It was extra nice because it was a hot day and it was extra refreshing.\n\nAt about $5 a coffee cup it's a nice treat to have on a day out!", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-28", "description": "Blonde coffee guy with the nose ring was a COMPLETE JERK for no reason. Used to buy from this truck regularly. Looks like its back to Blue Bottle on Cal and Kearny- they are nice people.", "author": "James P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "Best iced coffee I've ever had. Definitely hit the spot on a hot summer day by the water. Highly recommended.", "author": "Matt J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "Greatest barista and he serves the early morning workers. Blessings. See you tomorrow", "author": "Oliver W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "Just a tourist passing by... asked the barista what I can't miss out on before I catch my plane home to Chicago. I was given a great Turkish coffee. So much flavor. Great service, friendly smiles, and lots of care/quality in my cup. Thanks for adding to my vacation Philz Coffee Truck! I'll be back again (one day).", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "I like this location and the customer service i get here every workday morning. Greg, is excellent with remembering  peoples names and what they order.", "author": "Darien L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-07", "description": "I do not know if the people that work there are deaf, can't hear anything because of the noise of their trucks' engine running but I had a very difficult time to place my order. \n\nThey are disorganized when there are some people in line and the coffee is just ok and yet overpriced.  Either the crew working there was slow or it was the weekend.", "author": "Hugo H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "Review for the truck at Winter Walk.  Same wonderful iced mint mojito that I know and love.  So so wait time, but at times seems to move a little quicker than their coffee shops.  Seems a little confusing with the format at first, but makes sense.  Same prices too, just smaller selection with pastries and food, but that's okay since I always just get the coffees.\n\n- 1 star for the dude who told me that the Mocha Tesora drink has less caffeine than my usual mint mojito..Lies!  I was hella wired and not feeling good for half the day!", "author": "Cat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "Thank god I stumbled upon the Philz Coffee Truck.  I was used to waiting in a line for 30 minutes at their location on 1st and Market.  Now, only a couple of blocks away (which is actually closer to my work) I can order with no line and wait no more than 5 minutes for my drink.  \n\nThe truck is actually quite big.  They fit 3 baristas with a cash register.  You are not compromising any taste by going to the truck.  I'm able to get my Mocha Tesora and be on my way in no time.", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-08", "description": "I had high expectations that were far below met. \n\nOrdered a large gingersnap coffee and received a watered down, unmixed, patchy drink. \n\nStaff wasn't very friendly or helpful either. At $5.5 a cup, there is much left to be desired. \n\nMojitos coffee seemed to be popular but I won't be returning anytime soon.", "author": "Paola M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "Mint Mojitos will literally be the death of me *_* \n\nI tried my first cup of Philz during my SF trip a few weeks ago...and I'm not really a coffee drinker but this drink flipped my world upside down. At first I thought minty coffee would be a weird combination but the mint blends in with the coffee seamlessly :o It even looks beautiful with the mint twig on top!! \n\nThe drink itself is the perfect temperature...there's ice cubes in it but it doesn't get cold enough to give you a brain freeze. \n\nThe folks at the truck were super nice as well which makes me very happy, and I got my order really fast even though there was a line. So happy I spotted this coffee truck!!", "author": "Bells W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "This truck was parked near crissy field, SF. Our friend who was visiting from Australia has been asking everyone he'd met in the US to take him to a good coffee place. He has been disappointed most places however based upon the description he had provided to the helper, she had suggest Ether. Yippee! He had found something he had liked. I had tried their hot cocoa and was not a bad choice either", "author": "Say D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "This place is reliable AF! Always there when needed !!!! Their coffee comes out crisp and strong. Just what I need to get my day going ...", "author": "Mariangeles C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "Rush hours:  8:15 AM - 9:15 AM and 11:00 AM - 3:00 PM\n\"Down\" time hours:  5:30 AM - 8:00 AM\n\nIf you don't want to stand in line, I highly suggest you come during the \"down\" time hours.  At least it's a reason to show up early right?  =)\n\nI was a little skeptical at first thinking that the quality of Philz would be compromised by the truck, but safe to say that everything's on point like at the actual store locations.  There's a heavy amount of foot traffic after you place your order, but they make your drinks pretty quickly and you're well on your way.\n\nThe truck leaves pretty much at 3 PM sharp so last call is usually around 2:55 PM, so if you're looking to get your afternoon fix, plan accordingly!  \n\nGlad to finally have a Philz near my work (instead of venturing out to Golden Gate Ave).", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-18", "description": "Philz had there coffee truck at Marina Blvd in San Francisco today\nThey seemed very confused workers and customers what\nLine to be in where to pay or workers confused who ordered \nWhat. Need to do the number ordering system or retraining on pos\nSystem. Otherwise coffee was good but expensive will stick\nTo making it other brands at home. Seen taco trucks organized\nBetter", "author": "Sergei Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-28", "description": "I love Philz Almond Milk Mint Mojito Iced Coffee because it's really refreshing tasting!  It's best consumed on a hot summer day.\n\nI've also tried their mocha tesora with soy milk and I thought it was too heavy tasting for me. Definitely not my favorite! \n\nThis truck is located in a really busy area of SF FiDi. The line at this Philz is never-ending!  Good for Philz but bad for customers! During peak hours, the morning rush, it takes about 20-30 minutes to get your drink.", "author": "Alice X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "I love the mint Mojito iced coffee but also ask them to go easy on the mint! If not, there's way too many leaves! It tastes like a garden in your mouth. With light leaves, it's absolutely delicious! \n\nEverything you get to drink is awesome! You can't go wrong. A little pricey but worth it. Also, lines can get long but everything is made fresh so be patient.", "author": "Courtney O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "I came here earlier in the week while traveling for work. I had the mint iced coffee and it was to die for. Super refreshing and unique!", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "Love that there is finally a location in fidi for some philz. But this is no normal location.  It's actually mobile.  It's a food truck. It has a limited menu with all the favorites.  my go to in each roast are light- Turkish, medium -philharmonic, dark - soo good.\n\nThe standard favorites for iced drinks are mint mojito and ecstatic. \n\nBut I truly appreciate them being here. I know they were experimenting with some locations and this in the heart of fidi just works. There is always a line. And ofcourse the people that work there are always welcoming and nice.", "author": "Anuj C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-23", "description": "Early bird gets philz coffee with no line! That's right folks! For two days in a row, I woke up early and got to the truck at 8:30am on the dot. Normally I take the later bus and don't get to the truck until about 8:40am. You would be surprised how big of a difference 10 minutes are in terms of how long this line is. Around 8:40, there's usually a line between 8-10 people. But for the two days I was just 10 min earlier, there was no one in front of me today and only 3 people in front of me yesterday. Coincidence? I think not. Will definitely try to keep waking up early to avoid the longer lines. \n\nOrdered a large mint mojito. Definitely a go to drink for when the weather starts to get a little warmer. Delicious! Sweet and creamy, just how I like it. Service was so friendly. Got my drink in 10 minutes and was on my way to work.", "author": "Cynthia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "I love philz.  Same great taste and same great service, just right around the corner from my FiDi office.\n\nI love their Iced Mocha Tesora.  They have a unique way of doing an espresso mocha that tastes great, my favorite version in this city of coffeeshops.", "author": "Scott F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "Love this truck! Super convenient and on my way to work. The baristas are very friendly and service is quick!", "author": "Gianna A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-30", "description": "Experience today, in the Marina...\nLine was a few people deep, but going fast enough. Lots of folks with dogs (just setting the scene). One customer had a dog that one of the workers went crazy over, said worker puts her hand out to pet and caress dog, customer brings dog up close to window, dog is given some love (read: physical contact/rubbing/petting), then said worker continues working manhandling coffee filters and the like! EEW.\n\nFine, pet the dog, but wash your damn hands! \n\nThis may or may not happen often, who knows.  But I found it rather disgusting.", "author": "N S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "When the Philz shop opened on Front St, I questioned the usefulness of the Philz Truck, which has occupied the nearby corner of Sansome and Bush for a number of months now. \n\nNow I know. \n\nWhen Front St. Philz has a line outside the door, you can bet that the Philz Truck will be available to get you your fix in a timely manner. Same price, same drinks, same service. \n\nI don't know if they will be at that corner every week day, but when they're there and I'm needing a Greater Alarm to help get me through the day, I will be there.", "author": "Viet N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "Hooray, now that the holidays are over, the Philz truck has returned to its home at Sansome St and Pine St! I usually head over here for an afternoon pick-me-up after grabbing a salad at Mixt Greens across the street. Their mocha tesora is my go-to drink and is currently my favorite mocha. (The mocha from Beanstalk Cafe is a close second.)\n\nI appreciate that the staff is always eager to make a drink tailored precisely to my tastes. I also love that my drink is made at just the right temperature. I think it may be due in part to their cup design, but I never face any issues with my cup being too hot.\n\nThe one thing I would note, however, is that the wait time, especially during peak times, can be somewhat longer than at other coffee shops. This has been less of an issue in recent months, possibly due to the opening of another Philz location and a Blue Bottle Coffee location nearby, but, if I'm in a rush, I still may settle for a drink from somewhere else.", "author": "Rodney G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-22", "description": "Much quicker than the actual store! \n\nThis truck is only down the street from my work building which makes me very happy. The closest storefront usually has a line out the door. /: The truck has a line too, but it goes by a lot quicker and smoother. \n\nOur office actually brews Philz coffee beans, but lately it just hasn't tasted as good. So every now and then I treat myself to Philz or the Blue Bottle that's also just across the street. \n\nThere are so many coffee shows around the FiDi area, but Philz is definitely one of my favorite! \n\nMint mojito always. Mocha Tesora 1 out of 30 times lol. Sometimes you just crave something a little chocolatey. I get all my drinks light sweet and light ice. That way your drinks are never watered down!  & if you're someone like me who doesn't like super sugary things it's perf.", "author": "Dianna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "Great cup of coffee (got the tesora) and convenient while shopping in the area.  The one cup at a time thing produces a better cup than your average Dunkin Donuts (and I am no coffee snob, I like dunks!). That said, especially if there are a number of people in front of you, prepare to wait. The wait is worth it if you like coffee. Also, the barista was super pleasant and asked us to check if there was enough cream and sugar before we left so she could adjust. First experience with Philz was a good one.", "author": "Melanie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "NATIONAL COFFEE DAY: \"HIPSTERS LOOKING FORWARD\"\n\nI didn't know today was National Coffee Day when I bought coffee. It's fitting then that I write a review of this truck. There's so many different types of food trucks such as taco trucks and Asian fusion. You can add coffee as another type of truck. The term hipster can have a negative connotation. I know because I use that term in that manner because there are certain things I like to keep nostalgic such as a dive bar or a hole in the wall eatery. However history has shown that the youth movement has made significant contributions because it's not set in its ways as the older generation. Whether it was the \"British Wave\" in the 1960s that changed rock n' roll music, or a young Harvard dropout named Bill Gates that founded Microsoft, or a young Steve Jobs who created Apple Computers in his garage the youth movement has helped things move forward instead of back.\n\nMarketing plays a key in a vision. \"One cup at a time\" is a great advertising tool for Philz Coffee to promote its own brand of coffee. You can see the process at this truck when you order your coffee. This process of using freshly ground coffee for each cup seems painstakingly expensive, but from what I heard the cost of making coffee is about 5 cents a cup. In terms of flavor you can tell the coffee isn't diluted because of  new freshly ground coffee that is used for each cup of coffee. The taste of Philz Coffee has an earthy texture. The brand of coffee is unique. You can't find this at Starbucks or Peet's Coffee. The type of coffee I like to order is anything with mint in it such as Tantalizing Turk, Philharmonic, and Iced Mint Mojito. The mint offsets the earthy taste of the coffee, but exhibits a tea texture because the mint leaves are brewing in the coffee. In a sense the mint leaves make the coffee taste refreshing. \n\nThe \"one cup at a time\" motto by Philz Coffee is a great \"hip\" idea.", "author": "Gerald R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "I was cycling to the golden gate bridge from pier 39  and i smelled the incredible  coffee aroma from the park. I stopped by on my return. This the best coffee I ever had outside of Chennai in India.   Every cup of coffee is poured individually. The hand foam your coffee with creamer like in India.", "author": "Srini K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-22", "description": "No complaints here. There's a Philz everywhere now, it seems, but this truck is convenient if you are near Union Square. When I was in SF before Christmas, it was parked on the astroturf right outside Macy's Men's. On a rainy day there was still a bit of a line but not as bad. Transaction was quick and receipt was emailed without even asking. \n\ntl;dr: Small mint mojito iced coffee.", "author": "Phoebe C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-07", "description": "Spotted this Philz Coffee truck as my boyfriend and I were looking for a place to take a picture of the Golden Gate Bridge. Immediately told him to pull aside so he can try the mojito iced coffee that I kept raving about since we got to NorCal. I was slightly disappointed in my mojito iced coffee since it wasn't as creamy as I remembered. The last place I tried it was in Castro district, so my expectations for the truck was kind of disappointed. My boyfriend got the New Manhattan, creamy with some sugar-- it was quite good! Light roast and perfect for the breezy San Francisco weather!", "author": "Mary T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "Philz coffee truck in the FiDi!  Yay!  \n\nSuch a high demand for their coffee and you can tell with such a long line!\n\nOf course the mint mojito is their signature classic!  Do get their gingersnap iced coffee if you are looking for something more on the bitter side of coffee!\n\nI'm glad that Philz Coffee is finally expanding to commercial domains!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-07", "description": "5 stars for convenience, 4 stars for the wait-time, 4 stars for options available.\n\nUsually I get my fix at the Philz on 24th on my way in to the office, but this morning I opted to pick up a cup of joe at the coffee truck.  Wanting to avoid the lines at the newest location in FiDi, I was pleasantly surprised to find that the line was short and wait was short at this location - even though I stopped by during peak rush-hour.  I think the wait time is less now that there's another location close by in FiDi (I stopped in there last week, and the wait was quite substantial - 20-30 minutes...and that was at 10:30 or 11AM (outside of what I thought would be peak hours mid-week).\n\nThe truck offers prime quality coffee (that is no less quality than any of their stand-alone stores) with shorter than expected wait-time; what a great option in Fi-Di.  Being a huge fan of Philz, I'm so happy to see them expanding into FiDi so there's the option to have one of my favorite coffees at any time during the work week.\n\nJust a note, being a food truck, they are unable to offer the long list of various coffee options they offer elsewhere.  But the most popular of each type (light/medium/dark/specialty/teas/etc.), are available, which thankfully includes all of my personal favorites (Tesora, Silken Splendor, Philharmonic, Philtered Soul, and Soo Good).", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-01", "description": "I've heard all the rage, all the glory and fame: the mint mojito.\n\nLet's keep this simple...\n\nI find it weird that they had a small and large option but no medium...a medium would have been perfect! Anyway, I'd of course pay a little extra for the bigger option and got myself a $5 coffee ;)...a large was unfortunately a little too large for me!\n\nI got it sweet and creamy. They have a minty option too. Once you get past all the froth, you get a delicious minty and iced coffee. Is it even possible that once the ice melts and dilutes the coffee, it became even stronger and more delicious?? Well it did :-)\n\nEnd of story.", "author": "Gillian M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-09", "description": "The best cup of coffee in San Francisco. Get the ether. \nSome of the friendliest baristas in miles. \nA generator so loud you can hear it a block away at 12 noon.\n\nUnfortunately for my pretentious ass I hate yelling at 6AM.\n\nNote to Phil: You easily spent over $100k on this truck please buy a muffler for for this loud as hell generator.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-14", "description": "We were just in town for Mother's Day weekend and stayed until Monday evening. My boyfriend and I went to the FiDi for lunch to see our friends and after we ate, I wanted some Philz. We visited the Philz truck on Sansome and Pine and indulged in their mint mojito iced mochas. It was worth the wait. \n\nThe closest Philz to us is in Santa Monica but honestly, it's a treat to be back in the City to have their coffees. Next time, I'll try their Gingersnap!", "author": "Mika D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "Yes, the line is ridiculously long by 8AM, however they go pretty quick considering they only have 3 baristas working. I think Philz is already well known enough so I don't have to go into too much detail.\n\nGet:\nMint Mojito\nAmbrosia\nSilken Splendor\n\nThat is all. =] See you soon, Phil!", "author": "Judy W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-12", "description": "Can I preface that I LOVE Philz Coffee? \n\nSo why am I giving it 2 stars? Let's see.\n\nI found the truck and it wasn't too far from my work. I absolutely love Philz so I had to venture out here to get some, especially when it's so close. The line was a bit long, but it moved well. \n\nI ordered a mint mojito iced coffee, and then stepped over to pay. \n\nEverything was for the most part the same as being in an actual Philz... except...\n\n1. It was hard to order because it was hard for him to hear with all the noise in the neighborhood.\n2. The coffee was extremely watered down. It did not taste good at all.\n3. They seemed a bit more rushed, so there was no, \"Try it at let me know if you need me to add anything\".\n4. It's impersonal. This is a thing because all Philz I've been to there has been that sense that I've been best friends with these baristas for a long time. \n\nThis experience is hugely lacking and the coffee was extremely subpar with no recourse.\n\nI'll consider giving this truck another try only because I love Philz so much, but fool me twice, shame on me.", "author": "Kaje Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "I've had Philz once before while I was a college student and happened to be in Berkeley for a day. My friend was raving about Philz then but I wasn't much of a coffee drinker back then and got an iced coffee. I always walk past this \"food\" truck on my way to work and always thought that I should stop one day or the other. Anyway, enough of my back story. \n\nSo I'm usually a morning person and came here because I was feeling super exhausted. Because I was so out of it, I could barely hear the people working there (this is typical in noisy environments) and paid with credit card. I heard something like \"cash\" so I thought she didn't accept card and took out cash. The lady was very sweet and told me I already paid. \n\nI got a large Philharmonic with medium cream and sugar. It's a bit bitter for my taste; I wish I asked for sweet. I let it sit for about 15 minutes and once the mint kind of mixed in it tastes way better! Anyway, everyone was super nice especially since it was my first time and I was kind of confused (mostly because I was tired)!", "author": "Deepti N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "I was super happy to see this truck when I was walking to work. They're fast and just as tasty as their brick and mortar shops. I'm a die hard mint mojito fan. The only con would be that the line gets long so if you're on your way to work get there early.", "author": "Keizzel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-10", "description": "This Philz truck is located between Pine and Sansome. Since I have always thought that the nearest Philz to me is the one by AT&T Park, I was so happy to have come across them in this location. They may be a truck but they offer the same cheerful service and fantastic coffee that I have come to expect from Philz.\n\nThe same mint mojito iced coffee I cannot not get whenever I am at Philz is just as refreshing and delicious. They even sell their coffee beans and grind it while you wait, which is really awesome as Philz has finally made me into a morning coffee drinker. \n\nThe line can get quite long, but the wait is totally worth it. Great coffee, friendly baristas...Come find this truck if you are needing caffeine!", "author": "Clarice O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-08", "description": "If I could give this Philz a negative star I would! So, I ordered a Greater Alarm, not the usual Mint Mojito or Tesora that most order. I clearly told the Barista how I wanted it taken and she says ok. I specifically said, medium sugar, creamy. Well, then a family of European customers lined behind me and ordered 2 coffees and 3 hot chocolates from the same barista.. I walked away, stood near the barista and waited patiently like I normally do at Philz.  After about 7-8 minutes, I heard the Barista (white brunette- you will get why I mentioned that in a minute) call out Tesora and the European girl behind me came and got her drink. I kind of raised my eyebrow but figured my drink was next. Well, she called out for another drink, and another European girl got her drink. By this time, I moved closer and stood directly in front of the barista. She then carried 3 hot chocolates and called it out. So, by now, I thought, umm what happened to my drink? I looked at the barista and asked her what happened to my drink, and she was like, \"are you sure you ordered from me or someone else may have taken your drink.\" My response, \"umm, no, I ordered from you right before the European family.\" She then says, sorry I must've forgot. Forgot?!?? Seriously, but you remembered all 5 of their drinks? Well, thanks for wasting 20-25 mins of my time to tell me you forgot! I like Philz coffee, but if I'm going to be subjected to this type of subconscious racism, never again! As a barista how about making sure you start the first customer's order before distracting yourself with others. In this case, I definitely felt the white customers behind me received priority! Well, she even forgot that I ordered from her completely, what the hell is that? I asked for a refund and made sure they knew I was not happy with this crap! I told the cashier how I felt, and his response was sorry, we aren't robots, we forget. Well, but the barista didn't forget the 5 orders behind me did she? I never thought I'd say this, but today, I felt even in San Francisco, you get better service for being white. Smh!", "author": "Mark N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-22", "description": "Why Philz, do you follow me to every place I work?!? I love and hate you at the same time. But...gimme my coffee!\n\nI finally ventured to the coffee truck, after being taunted by a friend who seemed to go daily for his fix. You win, friend...you win. I knew it would be terrible (line-wise). I mean. 1 truck can only have 3 people doing the coffee...given they make each cup special, and the propensity of people to order for the whole office, I was conservatively guessing a 30 minute wait. It was pretty accurate. \n\nThe line typically curves to the intersection...to which I ask...why don't people curve around? I was damn near in the crosswalk when I first approached! Overall is a good coffee, and they make 'Philz Way' less sweet than the other Philz locations. However...star off for not accepting gift cards yet. Boo to you! It took me way too long to find my darn cash.\n\nOh, and this might not be a good place for the vertically challenged. The bar to pick up your coffee is about 6 feet above ground level, and they do NOT provide a step stool for you. I wonder if the baristas get a god complex, looking down at the caffeine junkies, knowing that a simple delay or refusal of the order will ruin their life.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-26", "description": "Philz on the go? Genius. \n\nTHE BEST! If you've never had a chance to try Philz at one of their locations, this is your chance to try it.\n\nThank you to the peeps at Philz for thinking of this idea. :)", "author": "Melissa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "Not bad! First time coming here the other day because everyone at work always raves about it. I was walking by today and I noticed there wasn't a huge line, so I decided to try a small Wonderbar. The barista was very nice and the guy who took my money was pleasant too. There was about a 5 minute wait to get the coffee (it's a drip system). The coffee was good! Nothing crazy special, but I will say it definitely got me on a good caffeine buzz! I will definitely give it another try soon my girlfriend really enjoys their mint mojito. Overall, not as magical as people were saying, but a pretty good cup of coffee!", "author": "James R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-12", "description": "Good coffee but they really need to fix their ordering process because people keep taking the wrong drinks. It's simple just to number the orders; don't even need to write it down just let the customers remember. It's lawlessness! Anarchy!", "author": "Matthew v."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-21", "description": "Meh. I've had Philz a number of times now, and no matter where they are, what time it is, or whether they're in a truck or not, the lines are always long and my reaction to the coffee is always the same: meh.  I always get the Tesora, and while the coffee is definitely on the strong side (necessary for Monday morning drags), I'm usually left feeling like my coffee preferences are more towards the Coffee Cultures and Paramos of the neighborhood.  At the same time, I'm definitely glad I got around to seeing their truck; it's been on my to-do list ever since it came out!  So, while I'll probably stick to my smaller and independent shops, I do think that if you aren't able to make it to any one of the Philz locations, that the truck is a nice option if you're truly curious.", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-01", "description": "I'm saddened to have to give the Philz truck a 3 star review. \n\nI really, really like Philz Philharmonic coffee and I think the Berry Street location is always on point with making my cup of Philz delish. \n\nThe problem with the Philz truck coffee is the inconsistency. I always order the same thing - Philharmonic - medium/medium. \n\nOne day, I'll get an overly sweetened cup of coffee, the next, I'll get a cup that tastes like it has no sugar. Today my coffee was lukewarm, yesterday it was hot. \n\nCome on guys, step it up just a bit! Everyone in the truck hustles really hard (the line is around the corner!) and I think that is impressive. However, if there could be consistency, the truck would be killer.", "author": "Irina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "found them at the marina along the waterfront.  great stop for all the runners and bikers.  mocha tesora vs. mint mojito, can't go wrong.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "Gosh PHilz is so grweat, then you reduce the line and increase the convienecne? YAy!", "author": "Greg F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "First, let me call out my Coffee Hero: Julie, you rule the free world! \n\nIt's true. Julie remembered my drink on my second visit! She knows I need the jumbo Jacobs, straight up. She always has a smile, she's truly a beam of sunshine in the morning!\n\nThe other folks at the truck are also pretty darn cool. I have to give the manager credit for creating such a great culture, even in such cramped space! \n\nIf you're waiting in line, someone always greets you to let you know you're a valued customer. I don't order food there, but it looks like they have plenty of options for those on the go. These cats cannot be beat. Rock on Philz Truck!", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "Being new to the city I was looking for a go-to coffee place - when I tried Philz for the first time I knew this was the one ! They have multiple locations throughout the city so you can rest assured that you can will get your favorite cup of joe, just the way you want it, every single time. Every cup always tastes the same no matter what location you go to. The baristas take their time to make you a perfect cup each time, and make sure you are entirely happy with your drink before you leave. The truck on sansome is my go-to since it's very close to where I work - I have to mention i LOVE the people who work mornings on this truck. They are very friendly people who strive to give you a good experience every time you walk in. I am a fan of all their drinks, the philtered soul and tesora being my favorites!", "author": "Reema B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "The first time getting Philz at a truck. It's a good idea for the busy financial district. Even on a Monday morning the line wasn't too long.\nFood: I've had the famous mojito coffee and their regular coffee. The regular coffee was well made, not acidic. The mojito was unique and the mint worked surprisingly well in the latte.\nService: The servers are really friendly and made our coffees efficiently.", "author": "Candy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "I will walk miles for Philz Coffee!! I love the unique taste of mint, who would thought it would be so yummy!! I like the Mint Mojito which is what they are famous for, but my go-to heavenly cup of goodness is the \"Iced Mocha Tesora, medium sweet\" topped off with some mint leaves. This blend of coffee is so good, the baristas always ask each customer to try their drink first but I never have to. It is always, and I mean always made PERFECTLY. There might be a long line at this location since it is in SF FiDi... but it's worth the wait. The pastries are a delish as well! This is one of the few places one can find the rare Spinach Feta Croissant. \n\nPhilz Coffee lives up to the hype. I go whenever I can and you will too!!", "author": "Jules C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-15", "description": "Terrible quality. My 1st visit: I ordered a mint mojito iced coffee expecting to have a nice, refreshing drink. Instead, I was greeted with a lukewarm beverage with some ice cubes and a mint twig on top. While the coffee itself didn't taste bad, it was quite disappointing. It was a hot day and i wanted something REFRESHING, not lukewarm. To top it off, the mint twig was not fresh; it appeared noticeably wilted. For the price, i expected to at least deserve fresh, quality ingredients. I believe $5.50 is a pretty steep price for a sub-par, mediocre drink. \n\nMy 2nd visit: I decided to give the place another chance and got an iced chai. Well, i couldn't believe it but i actually would've preferred that 1st drink i originated got! This \"chai\" tasted as if they just poured plain almond milk into a cup (all i could taste was a nutty-tasting milk), placed a mint twig on top and called it a day. Wow, seriously? I think they're trying to impressive me with a mint twig so maybe I'll ignore the fact that the drink tasted nothing like what I ordered. \n\nI've already paid enough for these mediocre drinks at Philz. I seriously would've preferred just getting coffee at McDonald's; at least McDonald's coffee is fairly priced and actually tastes much better. It's safee to say I'm never giving Philz Coffee another penny! I've notified all my friends and now they refuse to give Philz Coffee any money either. So many better options out there. People, stop paying so much for milk and a mint twig!", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "I stopped by right before Xmas.  Long line but still not too bad for a wait.  The coffee is, as usual, great!", "author": "Franklin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-15", "description": "On Monday mornings it's quite difficult to get out of bed. Luckily, working near the Financial District allows me to conveniently be near this philz truck. I justify that paying $4 for a cup of mint mojito is worth it because I'm paying to be more productive at work. I also get their ham and cheese croissant. Super yummy. \n\nIt's not completely 5 stars because wtheck is with so many mint leaves? like, I'm paying to drink 12 oz of coffee, not 4 oz of coffee with a pile of mint leaves. Regardless, it hits the spot for those Monday mornings so I give this philz truck 4 stars. See you on Monday! :)", "author": "Kayla O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "Best.coffee.ever.\n\nI enjoy the full service coffee bar always. Get it with light cream and sugar to your preference.\n\nMy favs include silken splendor and ambrosia!", "author": "Akshaya M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "Wow ! Time to wake up . I decided to see what all the hype was about ! Well it's true . After walking from union street to sansome and pine I thought  I'm crazy ! \n\nCall me crazy ! So worth the wait and walk .i had the  mint mojito iced coffee and my sis had the Tesora  . They were amazing ! \n\nmint mojito iced coffee  : first sip delicious , then I used a straw and it mixed all the bottom flavors up and who would have thought coffee and mojito mixed so well together ! You have to try this . Not to mention the kick ! I walked back to union square in 1/2 the time and was ready to run a marathon . \n\nGregg and the baristas were professional , efficient and sweet ! ( you know it's good when you request their names to review ) \n\nCan't wait to try this again", "author": "S R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-01", "description": "Probably one of the best business ideas ever! I'm going to break down my review into 2 parts: 1 part for those who've had Philz before and 1 part for the newbies (you won't be for long).\n\nFor the experienced visitor:\n- Long lines but it goes about as fast as a visit to one of Philz storefronts\n- Located at the very convenient corner of Pine and Sansome\n- Same pricing as regular locations\n- Well staffed!! \n- Best to go during off hours to reduce wait (around 10:30am and 1:00pm have been lucky times for me).\n\nFor the newbies:\n- Serves very well crafted espresso beverages.\n- Always great service\n- Accepts credit cards\n- Offers a large variety of coffee beans for whatever fix you need\n- The experience can be overwhelming so I listed a How To Order below:\n\n1)  Wait in line and decide what you want. The menu is quite big but the line is     usually long so you have time.\n2)  Once you get to the front of the line, a barista will welcome you to his or her window and ask what you want. These baristas are very cool and know how to make drinks. Trust me, I watch drinks / cocktails get made often.\n3)  Once you've ordered your Iced Mint Mojito, medium sweet with almond milk, extra mint, light ice and a nice smile, go down to the nice cashier at the far window and pay for your beverage (CASH AND CREDIT).\n4)  Patiently wait for your drink. Taste it before you walk away because they'll remake it if you're not satisfied. \n5)  Come back tomorrow and repeat.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-17", "description": "I love Philz. \n\nI love the Turkish Delight. \n\nErrybody loves the Mint Mojito.\n\nBlue bottle is overrated, I'm a Philz girl.", "author": "Angela K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "I'VE BEEN SEARCHING FOR THE TRUCK FOR TWO WEEKS - nobody on yelp could tell me where it would be in the early morning..until a coworker casually brought up, \" what do you mean, you can't find it? you just walk a block past Blue Bottle.\"\n\nSo there you have it - walk a block past blue bottle in the early weekday mornings and it should be there.\n\nService is decently fast, they have about 3-4 people at a time making coffee and the line doesn't ever seem too long.", "author": "Zoe H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "So 2 out of the 3 times I come here I get hit on by creepy dudes who have big boy jobs in the FiDi thinkin they own the place.\n\nWHY??? I DONT KNOW I literally am just standing there on my phone ignoring the world wearing sunglasses just wanting some god damn coffee and these creepers just find me.  Its bizarre. \n\nANYWAYS\n\nWe all know that Philz coffee is ridiculously good ( I love the iced Mint Mojito and the Tesora Blend)  BUT my friends, I am giving 5 stars because while I was handed my coffee and trying to escape the creeper FiDi bro, the barista says, \"Don't do that man, she just needs her coffee.\"  Then looks at me and says, \"Make sure that tastes alright!\" \n\nYAY! Barista saved the day! I sipped my perfectly made Tesora, gave the barista the thumbs up and ran back to my office.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-27", "description": "First of all, I love Philz. However, I don't think it works in a truck format...\n\nThe concept is the same, walk up, order coffee, and move to the next window to pay. Unfortunately, with the cart, there is only one window to order coffee and one to pay. really clogs down the line (which was fairly long). And then, at the end, my coffee was pretty watered down and didn't really meet the Philz coffee quality that i usually get. \n\nIt looks from the reviews that my experience was an outlier, so perhaps I'll give it another shot.", "author": "Nivita T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "Is it possible to give Philz less than 5 stars ever? The coffee is amazing as always and the employees are awesome. The manager, G, is super friendly and usually remembers my face enough to say hello and make a little more conversation than the typical small talk. The truck is convenient during the week for people who work in the Financial District and I've stumbled upon it in the Marina on the weekends. Needless to say Philz is making sure my addiction stays strong!", "author": "Madeleine M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-08", "description": "Well, Yelp removed this review on the ground that \"it lacks firsthand customer experience.\"  No, it doesn't. It is clearly first hand. Here it is again:\n\nI walk by this truck every day on my way to work. It is almost impossible to pass, as people who have already ordered and are waiting block enough of the sidewalk that there is barely room for one person to go through at a time. Everyone is chatting, so nobody pays attention to the people walking past. I regularly have to literally push people out of the way to get through. Given the trouble this truck causes during the morning commute, I doubt it will be allowed to remain at this location.", "author": "Noah R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-05", "description": "If you don't know Philz Coffee by now, then you're probably not a coffee drinker in the Bay Area. So if you haven't tried it, go for it. This Philz Coffee Truck in the FiDi can be a bit crazy during rush hours when people are heading into work.  I've waited for about 15 minutes sometimes from waiting in line to actually getting my coffee.  Actually, not too too bad, but when you're in a rush, this is NOT the place to be.  \n\nEnjoy otherwise.", "author": "Meshell C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "I didn't know that this was a food truck. Nevertheless, they had a good system for serving the line of people on the sidewalk, and the service was very friendly.  I tried he mint mojito iced coffee and was pretty delighted by it.  I loved the fresh mint flavor and the fact that the drink wasn't too sweet.  Wish I had a Philz near my house!", "author": "Amelia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Being an extremely picky person with very limited amounts of things that impress me I have this to say: \"BEST COFFEE I've ever had, hands down!\"  nothing follows......", "author": "Kyle E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "Found them parked on the Marina Green and I just had to try another one of their delicious drinks! Since I tried the mint mojito iced coffee last time, I tried the Tesora with cream and sugar. My friend tried the Tesora Mocha. They were both super tasty! Tesora has a smooth and buttery taste that we couldn't get enough of. You can't go wrong with any of the drinks here and like last time, the service here is top-notch. Keep up the good work Philz!", "author": "Hana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "Do I really need to write a review?! Everyone knows Philz has great coffee, and now they have a truck?! Luckily for me they're usually on Pine&Sansome which is relatively close to where I work. Before the truck, I've only had mint mojitos. Now that I go so often, I've decided to get a different drink each time I go until I've tried the entire truck menu! I'm not a big coffee expert, I only know what I like, so it's just what I think about these coffees I'm about to mention. (Plus, I'm writing this review for my future reference.) \n\nTesora: too strong for me, even though it was only a medium blend. \nSOOOO GOOD: is exactly what the name is. It is SOOOO GOOD! I like my coffee sweet and creamy, so this was perfect for me! \nNew Manhattan: This had a hint of sourness to it, probably because of some citrus flavors in it. I did not like. \nAmbrosia: DELICIOUS, almost as good as soooo good. I would probably flip flop between those two. \nMint Mojito: do I even have to say anything? Of course it's delicious!\nPhilz Fresh Chai: I think the mint leaves in it made it taste a little strange. And if this came iced, I think it would be better. \nGreater Alarm: a little strong tasting for a light. Not my favorite, but it's not bad.", "author": "Lina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "Great coffee and awesome customer service. The staff is super friendly. My mom's coffee got cold and they gladly made her a new one! Def a good spot to check out if you need some caffeine and are in the Financial District.", "author": "Amit B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "I left the financial district in November to go on leave and came back last week. To my surprise walking to work from Bart I find a Philz Coffee truck! The whole week I debated weather I should wait in line and be late or just wait until the line is short. Well finally the day came where there was NO line! I ordered my mint mojito and it was delicious! So the only thing i'm not sure about is the price, the 16oz cost me $5, I don't recall it costing so much at the coffee shop. But well maybe I'll treat myself every now and then.", "author": "Irma R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "One of the few perks of my new work schedule (7 am-4 pm) is that there's never a line at the Philz truck in the FiDi!\n\n\"Sooo Good\" done \"Low Fat\" (which from what I understand is mostly non fat milk with a splash of cream) is a surefire way to hit the ground running work-wise. Great addition to the area, and super convenient as a 30x rider.", "author": "Laura H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-04", "description": "Who doesn't love Philz Coffee!? My personal favorite is the iced mint mojito. I love cold drinks and this is one of my favorites.\n\n4 stars only for the wait/line. I've only gotten coffee from here twice despite me working only a couple of blocks away. It's usually a huge line in the mornings, and I've only gone at odd times. I got lucky earlier this week when I was getting into work around 10:30AM. There was no line (GASP) and I got my drink in less than 5 minutes! Unreal.\n\nAll in all, great coffee and iced drinks. Worth the wait if you can afford to wait in a line for 15-20 mins! If not, I'd wait for an odd hour in the day.", "author": "Greg J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-15", "description": "These divas. Good coffee but I really don't need the attitude. Tried to order off the menu and the waitress said (verbatim) \"let me guess - this your first time here.\" Me: uh, no... Her: well we do things a little differently here *insert painfully fake smile* Definitely wasn't my first time but it will probably be my last. #bluebotttlenextdoor", "author": "Danielle E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-23", "description": "What's not to love? It's Philz Coffee and it's in a truck! If you don't know why that's a good thing, you need some Philz Coffee. There are no lattes or drinks with fancy names. The sizes are small and large. That's it. You can pronounce those, right? There are two specialty drinks: the Mint Mojito and the Ginger Snap. Try them both. At the same time if you want, but try them. Whatever coffee you do choose, it will be made to order. That means there are no giant vats of coffee in the back. You order, a person makes it. You drink it. You enjoy it. It's that simple.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-30", "description": "The mint mojito iced coffee is the best !!\nGive it a try & you won't be disappointed .", "author": "Marie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-12", "description": "I've visited the Sansome Street truck three times, and twice the order was wrong. And this even after the server double-checked my order. In over twenty years of going to Peets, this has happened once. \n\nToo inconsistent for the price and the hype IMO. As for the lines, they are consistent. Sorry, I wanted to really like it.", "author": "Andrzej G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "I love Philz but this truck is not made for the vertically challenged. Regardless, I still love it nonetheless. \n\nYou stand in line and wait for your order to be taken. I don't get in this line unless it's four or less people, otherwise the wait will be longer than ten minutes for sure. There are three baristas making drinks per person and one person taking payments. \n\nI always get the Mint Mojito or the Philtered Soul. \n\nThe only issue I have is that I'm short. The truck is super high up. Grabbing my drink from the stand requires tip toe-ing. Once my drink was so full, I practically spilled a third of it from trying to get it down. (Short people problems). \n\nYet, I'll still come back.", "author": "Jeannie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "A truck full of Philz' most popular blends coming to you? What's not to like? \n\nIf it's your first time, get any blend \"Philz way\". \n\nI personally love any medium blends \"light light\". Tesora and Philtered Soul are my absolute favorites. \n\nTell a friend.", "author": "Lynn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "Oh hai, Philz!  Thanks for coming into the FiDi so I can satiate my Philz cravings.  \n\nSuper convenient with its location on Sansome and Pine.", "author": "Vicky T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "My husband and I are coffee fanatics and when in a new city always like to try new places.  Upon arriving at Philz, we were first confused but the helpful staff explained the process and invited us to our first drinks on the house!  The coffee was so delicious and bold.  We liked it so much, we went back the next day and will definitely come back next time we are in SF.  Hopefully they will come to Phoenix soon.", "author": "Chela S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "The mint mojito was AMAZING! So unique and refreshing! Really cool location and convenient. Usually always a line but for sure worth the wait.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "Always great! Best coffee, best service! The guy who regularly runs the truck operation totally rocks! I hope he's well compensated, he has created an experience that has me coming back to the truck and the store front locations.", "author": "Richard V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "Soooo Goood.  But why is the truck on Sansome St. soooo much better at crafting a gooood cup of joe than the staff at Front?", "author": "DR T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "If you have the time in the morning, it's worth the wait! I've passed the Philz Coffee truck multiple times but am always booking it to work and can't wait in the line. I had some time a few Fridays ago after a workout class to wait and was so glad I did. You can't go wrong with any of the coffee options, I got the tesora with a splash of cream and it was delicious. I seriously feel like it's so much more caffeinated than normal coffee, I was wired all day! The line also moves quicker than I anticipated, probably only waited for about 10 minutes.", "author": "Lizzy U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-06", "description": "Upon the referral from a very enthusiastic co-worker I gave in and decided to give the Philz Coffee Truck a try. It would be a good change of pace since a tall Blonde Roast is my religion and the Starbucks across the St. from my office is my church. So there I am in a 20 minute line to get my coffee, trying to decide what I should order. All around me people are excited and buzzing like they were waiting for Prince to show up and give everyone autographed pictures of himself....which are all good signs. I see a guy spilling some of his prized coffee onto the floor and he stands there staring at it. For a minute I wonder if he is going to get on his hands and knees and start to lick up this amazing coffee that he just spent 30 minutes aquiring on his 15 minute break. He stares at the ground sadly and moves on. At this point I KNOW I'm in store for somethign amazing. Not just amazing, but life changing. I expect that with my first sip I am going to discover the meaning of my life, quit my job, and join an Ashram in India, never ever being the same person ever again. Again upon the recommendation of my co-worker, I order the Hot-ito, which is the hot version of the iced coffee mojito. the line is starting to swell, and the crowd is starting to swarm, like killer bees all starting to go crazy for the sweet  promise of nectar from Philz Coffee Truck, parked in the middle of SF's financial district. Everything is building up to a mass crescendo of excitement, and a little fear. My brow glistens and my tastebuds are screaming in anticipation. Then out of nowhere, I hear the man with the giant moustache call out my order. My legs are barely working, I don't even remember walking forward and raching up to grasp the cup. I look down and dont just see a sprig of mint in a cup of coffee. I see the past, present, and future. I know who shot JFK, and what the government keeps at area 51. I am literally having an out of body experience. I close my eyes....place the cup to my mouth, and take a sip. My eyes open, and I blurt out....THIS TASTES LIKE SHI*! My co-workers are taking sips of their own coffees and looking lost. Their minds are trying to convince their mouths that the coffee has to be good. Why else would there be such long lines to get it? How is this possible? Is there really a GOD?  So in closing, I wanted to love this coffee. I wanted it to be everything the Starbucks and Peets could never be. What I got was something that tasted like cemetery dirt. It's gross. The End.\n\n---------------------­UPDATE----WENT AGAIN THE NEXT DAY--------------------\n\nLet me start off by saying I think everyone deserves a second chance. Sometimes things go horribly worng due to a combination of things which can include: planetary mis-alignment, witch curses, and general bad luck. Therefore I started the day pumped up to give Philz Coffee Truck another chance. As my trusty co-worker and I started off on our expedition 3 blocks deep into the heart of SF's financial district, the wind was howling and the sun was hidden by skyscrapers. On any other regular day we would have took these thing as ominous omens, foretelling of bad things to come. However thins was no ordinary day. Our cause was a noble one, to fight our way through throngs of SF natives and procure what other consider the holy grail of coffee. We took our place in at the end of the line, some 15 people deep, and began to think once again what we would order, all the while pushing aside the memories of the horrors we had endured the previous day. This was it, the most important decision, of perhaps our lives that we would make and we needed full mental clarity. My co-worker had placed her order and there was now nothing between me and the lady wearing the Technics t-shirt taking orders. The distance appeared impossibly huge. For 5 minutes I stood in line wondering what was next. The lady taking orders was shuffling paper bags and starring off into the distance. After 5 uncomfortable minutes I  moved over to the her window, wondering if wherever she had gone in her mind it was warm and sunny and she was enjoying herself. I had everything that I was going to say, prepared in my mind. When I got to the counter, everything went horribly wrong. My mind sent signals to my mouth to say, Hi, I'lll have an iced Mint Mojito please, however what came out sounded like a zombie trying to take an order at an Italian restaurant. I uhhh..rrrrra...mmmuu. That lady in the gray Tecnics tshirt snapped my out of my stupor and said, WE ONLY HAVE SMALL AND LARGE! I managed to say, \"small\" and I handed over my credit card which she snatched away with a look of annoyance. I took my card back and stood along the sidewalk, waiting for my drink. My co-worker got her drink in about 7 minutes. Then we waited....and waited....in fact we waited so long that a baby had been born at a nearby hospital, taken home, and had learned to walk. They forgot my order, took more time to make it, and it was OK.", "author": "N C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "I was just walking around San Francisco and I spotted this truck.  There was a lot of hype about their mint mojito iced coffee.  I know there's a Philz in Los Angeles but I'm glad I was able to try it in San Francisco.  It was DELICIOUS and REFRESHING!  Santa Monica is some what of a drive and I might just have to do it to get my fix.", "author": "Steven U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "I walk by the Philz Coffee Truck on my daily walk to work from BART daily. The smell of coffee always brightens my mornings. When I stop by, I always get the Philharmonic, and it never disappoints. They have an uncanny knack for knowing what \"just a little cream\" means, and they always hit the mark! The only downside is the line...which is always long. That keeps me away from the truck on my walk to work most of the time. Despite the line, they get your coffee to you pretty quickly which is impressive.", "author": "Grace M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "I went to San Fran for a vday weekend trip and my guy and another couple rented bikes to go across the bridge. My friends guy suggested philz for what he said \"amazing\" coffee. I'm not a huge coffee fan but said why not. Holy delicious mint Mojito. It was delicious refreshing and tasty. If it wasn't for the coffee we would have never made the trip to oak mills park. (15 miles ). Can they please open philz in Chicago bc I freakin loved it!!!!", "author": "Sandra E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-14", "description": "Oh how I can't wait for the tech bust 2 to finally land soon. People lined up 13 deep on a sidewalk for a cup of expensive coffee? This will be the first thing to go. How about ditch the hipster phase already and go to a place like Happy Donut 2...no lines...no attitude and great cup of coffee for less.", "author": "Legal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "I was so excited when I came across the Philz coffee truck. It was a rainy day in SF, but there were still people waiting in line with their hoods and umbrellas. The coffee was great. I had a Tesora (one of their most popular drinks). In my experience, the service was excellent, as it is in every Philz location I've been to. Everyone was smiling and very friendly, even though they were really busy.  Once I got my drink, they had me give it a taste to make sure I didn't want to add anything. I hope I come across their truck again next time I'm in San Francisco! It was super convenient and put me in a great mood, despite the weather!", "author": "Raizel G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-01", "description": "$4 coffee that tasted burnt. Philz quality has been on a decline for a long time this truck proves it. I've been going to Philz for 5 years they good days are behind them.", "author": "Dennis K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-08", "description": "The amount of options can be overwhelming sometimes but I have never been disappointed at my choices and I try different ones every time. Way better than Starbucks.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-28", "description": "Ordered a Jacob's Wonderbar (black, no sugar, no cream) about 20 minutes ago. Employee was young Asian woman. She takes my order. I wait 10 minutes during which time everyone else who ordered got their drinks. 5 more minutes roll by and I notice that she is taking additional orders. I ask her if mine has been made. She says no, then says yes (pointing to one of the urns). I wait 5 more minutes and those customers who ordered long after I did get their drinks (btw, the urn she pointed at was for another customer). I had already paid for my drink, but I could not afford to wait for another 5 minutes and left (and she saw me leave and said nothing). This is the second time I have had a bad Philz experience (the first being the old Castro location about 2 months ago) and for the same reasons I have described here. I think my relationship with Philz is done. There are plenty of other coffee places in SF that have better customer service.", "author": "John R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "SOOOO PERFECT!!! spotted this bad boy on my walk to work. I must admit I'm hooked. The line wasn't that bad and the workers were super sweet. Got some really awesome recommendations, I had a philletered sour and it was everything!! I usually only see this bad boy sat morning and wonder where it will go when construction starts up again. But anyway. Thanks philz!", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-29", "description": "The coffee was not bad.  I saw the long lines, and I think my expectations were high.  I thought the taste would be similar to Blue Bottle...it was NOT.  The coffee was ok.  Would I go again?  No.  The prices are similar to Blue Bottle.  So if I had a choice, I would definitely, no hesitation, seek out Blue Bottle.", "author": "Aileen K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-10", "description": "I love Philz Coffee and never try to miss an opportunity to try it... but for some reason, my recent experience buying from this place have not been very positive. The coffee just does not taste the same. They might have a consistency issue. I buy the same cup and every time it tastes a bit different. Either it has less cream or sugar... depends on who is preparing it... Please please please work on consistency... I was craving for one and am so disappointed with what I got... :(", "author": "Farhan Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-12", "description": "You can't go wrong with mint mojito! But the line is extremely long. Best time to go is actually lunch time at 1145-1245. Usually only 5 mins to get your coffee fix at that time. Any other time, be prepared to wait 20-30mins", "author": "Allen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-13", "description": "I guess I'll have to try Philz for a 3rd time, because honestly I just don't get it... I've been to their 24th St. location and I admire the devotion and great attitude their baristas bring to the counter, but overall I don't find their coffee to be better than many of the other \"take coffee seriously\" types of places here in the FiDi.  I've learned to appreciate black coffee, and though I admit Philz's is better than the bicycle trade coffee that's available at so many places around the city, to me it doesn't taste better than Illy, or the clove coffee from Starbucks (where available).  Still a bit too bitter whereas other places tend to have a smoother black coffee experience; just my two cents.  Furthermore, the devotion of many other Philz's fan is a bit of a detractor for me because I don't want to wait in a long line for something I'm not all that jazzed about. Yet, the allegiance of so many of my work neighbors perplexes me, so I'm sure I'll give it another go and update.", "author": "Jesse G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "I love Philz coffee (especially Filtered Sould and Ambrosia). I only drink black coffee and unless you want to indulge in getting the cream, any of their coffees is delicious. However, their cups are the worst. No matter what location you go to, they overload their cups with coffee and you can't put the lid on it. More often than not, the coffee starts spilling. If I go, I have to bring my own cup.", "author": "Purple P."}
