{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "5 stars for stellar location and early hours. Well, I think they all open around the same time, but love that they are right in FiDi for those early morning FiDi workers if you ever are trying to go to work extra early. \n\nLocation is a little bit small, so I find it super difficult to find a spot to sit at if I ever come in the afternoon, but if you wait around for 5-10 minutes stuff always opens up. I also love love love the pastries (they get their kouign amanns and croissants from oakland!). \n\nI really wish they sold oat milk though. I love oat milk.", "author": "Jeanette S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-17", "description": "My go-to Philz before I head over to work! Right between the Embarcadero and Montgomery stations, this is a popular Philz location. There always seems to be a line out the door, but it does move at a decent pace. They also accept mobile order, which has been super convenient for me. I'd make my order, get off at Embarcadero, walk over, pick up my drink, head over toward Montgomery. \n\nThough with the convenience of mobile order, I feel that it's a bit rushed based on the taste of the coffee compared to ordering in person and waiting to mobile order and pick up. The mobile order at this location tends to be very popular if you compare the times of pick up at other Philz. I try to place an order before 8:20AM, and the pick-up time is 9AM, whereas other Philz is 8:30AM. Learned my lesson - order it before I hit that tunnel after West Oakland. \n\nI love getting the mint mojito (creamy cream, medium/light sugar) on hot days as it really cools you down. When I'm too cheap to spend that extra $1 on the mint mojito drink, I'll either get the ecstatic iced coffee (such a wonderful blend) or their Julie's Ultimate (hints of vanilla, berry, toast). Their dark roasts are all wonderful - a standard Jacob's Wonderbar for a more traditional dark roast, Tantalizing Turkish if you want that herby/cardamom flavor, Aromatic Arabic if you want that dark dark dark flavor. Yumness! You can customize your coffee by the creams (creamer, soy, vanilla soy, whole, 2%, etc) and sweetness (sugar, honey, artificial sweeteners, etc). \n\nThe baristas here are super nice, and I'd order in person every morning if I was willing to get up just a bit earlier allotting some time just for the Philz coffee, but unfortunately, I rather sleep in an extra 15-20 mins so I mostly mobile order.", "author": "Rita W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Philz Coffee is a chain coffee house based in SF. Despite it being a chain coffeehouse, everyone I know who's been to SF tells me that if I'm into coffee, I need to visit Philz.\n\nI made my way to this location one morning before work started - just to try it! The lines were out the door, but yet people were still lining up. This was a good sign. They specialize in drip coffee, meaning they make your drink on the spot when you order. You order with the barista and then slide down the counter to pay. They'll call out your order when it's ready.\n\nDespite the fact that I prefer my coffee with no sugar and just a splash of cream, I opted for the traditional light and sweet Mint Mojito. It was so good. The coffee was so smooth and the subtle hint of mint really made the drink pop.\n\nI liked it so much that I found another Philz close to my friend's house where we were staying and made us stop there before our road trip to Monterey.\n\nThe baristas were super nice and I thoroughly enjoyed my first Philz Coffee experience.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-14", "description": "The mint mojito iced coffee is where it's at. I downloaded the Philz coffee app and ordered my drink with ease. The app lets you order your drink, pay, and choose what time you want to pick it up. I only had to walk up to find my name on the cup and go. The mint mojito iced coffee is literally what it sounds like. It was refreshing with a slight hint of coffee. This location is on the bottom level outside of an office building. Have a seat outside and people watch as you sip on your drink.", "author": "Lanha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "This is the market street edition of Philz known for it's great coffee outside seating and long lines.\n\nParking? On market street in the financial district? Nope. Not gonna happen. The embarcadero garage is the closest mass parking option, and baby it ain't cheap. Like a lot of things in SF you are best served getting here some way that does not involve driving. Luckily there are literally dozens of other options including the cheap effective and popular trolley line.\n\nThere is not a lot of inside space-this thing is almost a walk up kiosk. There are some window counter seating, and a few loungy chairs with tables just to the left as you get in the front door. There are however a dozen or so table/chair combos outside, which only really works if the weather co operates. When it's sunny (pro tip-don't count on that before noon at the earliest) that makes a good choice, otherwise......well, there is another Philz about two-three blocks away (the thirst for coffee is real in the city yo) which will while still having a line, it's typically less of one.\n\nIt's not uncommon for the peak morning office coffee rush to be ten to twenty people deep. Yes, the coffee is that good. They don't do specialty coffees-non latte's, espresso etc (I could swear that they used to-both myself and my partner-who normally doesn't drink coffee-distinctly remember a exceptionally good philz mocha, so either that was a seasonal item/short term thing only, or we are both wrong which is possible) yet the pourover blends on offer are sheer caffeine delight. You've more then twenty choices grouped into light, medium, dark and tea blends and it's hard to go wrong. \n\nDo note that you've got to stand in line (the longer one) to order a coffee direct from the barista, then stand in line again to pay (this line will be by the pastry display case). The second line will be where you place any food orders as well. Philz typically has the best avocado toast in town, and the sweet options are solid as well.  Also know that the barista will be adding any cream or sweetener you may be wanting so if you desire those speak up when ordering. While there is always a line, it isn't always long, and it does tend to move fast. Philz is optimized for volume sales.\n\nSo the four stars are for the perfect pour overs, supreme baristas and delicious toasts not for anything else about this spot.", "author": "Steven W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "First time trying Philz during my visit to SF. I love all things mint, coffee, chocolate....so definitely knew I wanted the mint mojito coffee. I ordered that one half sweetened. It was still absolutely delicious! I drank it faster than I would have liked since I was doing some work there for a couple of hours.\nIt is a bit pricey for what it is though. +$1 for this and I got the smallest size, but still came out to just about $5.\n\nThe line was pretty crazy. I'm not surprised since this location is in FiDi. It definitely gave me time to figure out what I want since there were so many options and to kind of figure out what the ordering and paying system is. \nIt's different and unique compared to what I'm used to.\n\nFOR THE FIRST TIMERS, a step-by-step guide and narrative by yours truly:\n\n- Wait in line and figure out what you want. \nGood luck if you don't like mint and defaulted like be because there are so many interesting names and ones that sound delicious. \nIt's so hectic and loud that you almost feel bad asking too many questions.\n\n- If you make eye contact with one of the baristas and she's free, walk up to her (or him) and basically shout your order cause it's that loud. \n\n- Then walk to the right to the cash register and wait in line to pay. You tell them what you got. \nIt's a system of trust.\n\n- Then wait around and watch the hustle and bustle of making your drink. Good luck getting a seat.\n\n- Wait till either your name and/or order is called and you'll see the barista looking around and yelling while still trying to swiftly make the other orders.\n\n- Pick up your order, flash a smile and thank you, and bustle on out. Enjoy~\n\nRANDOM:\nI did notice something. The creatives are all about sitting at the window, opening a notebook, and then just people watching for hours. No writing, nothing. Then packing up and leaving. Interesting -sips coffee- Next time, I'm joining in. :)", "author": "Sarah N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "I probably am the last person on the planet to come here, but I'm so happy to say Philz definitely lived up to the hype! Decided to take ol' Philz for a spin today and am seriously impressed by my experience! Located in the heart of SF's FiDi ( the millennial term for Financial District) - it's a happening little joint with food options as well including my fave Avocado Toast. Yum!\n\nI asked the friendly hipster at the counter what her recommendation was between the Chai & another tea called Istanbul Treat, she said the latter was her favorite. Be prepared to also get asked what level of sweetness and how much cream you like. They definitely cater to everyone's personal preferences, so you can be assured you get exactly what you order! \n\nLiked the playful candor between the hard working employees as well. You can see the teamwork and service with a smile which is clearly very important here! \n\nBack to our orders. My friend ordered the iced Mocha Tesora which was to DIE for ... perfect balance of chocolate with the quality coffee beans they use. Quite delicious, think I'll order that next time! Don't you just hate it when your friend's order ends up being better than yours? \n\nNot to take away from my Istanbul Treat tea. It was such a smooth, delicate blend of spice and cream and the honey paired nicely! \n\nOutdoor seating is also available, so you can observe her business men & women clad in work attire and a pair of sneaks as they hurriedly rush from A to B. \n\nLadies & Gents, you're looking at a Philz convert!", "author": "Jeanie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-31", "description": "Ashlee, the store lead, reached out after my initial review.  We messaged and I asked for a recommendation on straight coffee and told her I would update review.  \n\nShe recommended both the Philtered Soul and Jacobs Wonderbar. \n\nI tried Philtered Soul; a medium roast with flavor profiles of hazelnut with chocolate undertones. \n\nDefinitely get the hazelnut aroma right away and very pervasive with each sip.  \n\nMy colleagues tried Jacob's Wonderbar and also sipped my coffee. They enjoyed their cup but came to the same conclusion about mine; the hazelnut was very overpowering. \n\nI didn't finish the cup (as you can tell in the picture).  The coffee was oily and the hazelnut taste dominated any chocolate undertones and actual coffee taste.  It was like drinking artificially flavored coffee and not for me. \n\nI like that they serve one cup at a time and love that the store leaders are concerned about the customer experience and delivering a quality product.  It was very cool of Ashlee to reach out!\n\nI guess I just haven't found the one cup for me yet.", "author": "Cindy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "I came to Philz Coffee at the recommendation of a friend who's lived in San Francisco for years now.  He told me that I had to try the Mint Mojito Iced Coffee.  Alrighty.\n\nPhilz Coffee happened to be on my way to the Ferry Building, so I made a quick stop.  I entered the coffee shop and it was surprisingly spacious and very clean.  Best part, there was no line unlike the other Philz Coffee shop just down the street (that one's closer to the Ferry Building and the line was crazy!).  The girl at the counter was very nice and friendly.  She quickly took my order and in a matter of minutes my drink was ready.  During that time I was able to browse their food options and they had some avocado toast, pastries, & some other goodies, but I decided to save my appetite for the Ferry Building.\n\nNow, I'm not normally an iced coffee kinda girl.  I usually get a frappuccino or a hot coffee, but I figured I'll expand my horizons and my friend was really adamant that I try it.  Thank goodness I listened because the Mint Mojito was delicious!  Definitely different than your usual iced coffee and it was pretty refreshing I must say.  I would get it again and I highly recommend it!  Yummmm.", "author": "Maria P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Came in last week not knowing wtf to order and fortunately I landed in line with the nicest baristas/coffee makers/employees (idk what their official title is). One seemed to be a trainee and the other a possible supervisor/coworker helping out with my big order. They quickly school me on how they didn't have an expresso machine and anything latte was not possible. BUT they offered alternatives that sufficed (in my opinion) which was very considerate of her to suggest. \n\nOn the other hand, when I went to pay I didn't know the names of those \"substitutes\" and the cashier seemed to be irked about it. She proceeded to coffeesplain to me, \"I feel people should do research before coming here.\" Didn't now how to react at that moment but in retrospect I don't feel as a 1st time customer or even a regular customer has to be an expert on a company's product. I should be able to go to an establishment and not know everything about your company. Just sayin!\n\nRegardless, of that past experience; my overall experience was excellent and so was my experience today. Again, the person helping me was super nice and when she asked me if I wanted my mint mojito \"sweet and creamy\", I wasn't sure so she said she would remake it if I didn't like how it tasted. That was really nice of her to offer and she didn't have to remake it because it was deliciouso!", "author": "Glenn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "Really enjoyed my drink! The mint keeps coming into your mouth which is a bit annoying but I loved the refreshing taste. Also I think the caffeine content was extra high Bc I couldn't sleep that night", "author": "Komal S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "I love Philz! This one gets pretty busy on weekdays because it's near FiDi, but the wait is never painfully long. This location feels a little smaller than the one further north on Market. There's a lot of outdoor seating and maybe 3-4 small tables inside for working/meeting. Music is on the louder side. Despite that, wifi is fast and coffee is great.", "author": "Thu P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-16", "description": "Mint Mojito!\n\nIt is beautiful and good! Coffee is fresh and cool with mint! Worth trying!", "author": "Zhijian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "Favorites drinks are Philtered Soul and Mint Mojito iced coffee.\n\nThis location almost always has a long line but the wait isn't so bad when grabbing a coffee with a friend or coworker. I come to this location regularly around 2 pm\n\nOnce you learn to get used to the chaos that ensues at Philz you'll always get a good cup of coffee with a friendly experience.\n\nThe Baristas are very accommodating and always ask you to taste your coffee before you go. I almost never ask for adjustments, but I'm not that picky and I usually get drinks without sugar and light on the cream.", "author": "Danny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-13", "description": "Mint mojito! Wow! If you like mint, get this! So refreshing and drinkable. I asked for mine light on the sugar because I don't like things too sweet, and it was just right. Really wish they would open one of these in NYC!", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Everyone loves Philz - seriously. If you don't love the classic mint mojito, there are so many other options and one is bound to appease your tastebuds.\n\nI usually go with the mint mojito but I was feeling wild so I ordered the ecstatic. I think I actually liked it more than my usual!\n\nCustomer service here is always great. My friend ordered a dairy substitute with his drink and the barista forgot - she ended up giving the first drink to him on the house as an apology for the inconvenience.\n\nAny time I'm back in SF, Philz is an easy place to drop by and cross off the list!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-11", "description": "The pride of SF (for coffee) is Philz Coffee? \nA must try if you're a coffee buff. There's several locations, even a food/coffee truck. I found this one on Market. \n\nA lot of people talked about the Mint Mojito and it didn't disappoint. The food and pastries were just okay. Service is friendly, but no where to sit. All the seats are taken by people on their laptops all day. Washrooms are locked. You have to ask for the passcode.", "author": "Vincent H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "This is one of my go-to places in Fi-Di when I decide to go out for coffee rather than drinking coffee at the office. This location is super convenient since it's on Market St - really easy to get to on foot or by BART/MUNI. It certainly gets busy at times with long lines out the door, but I don't feel like I've ever had to wait for an unreasonable amount of time. \n\nDespite the busy-ness, most of the staff I've talked to are friendly and take some time to chat and/or offer suggestions, which is nice. I don't usually drink sweet coffee but I'm partial to the iced gingersnap coffee here, as well as the mocha tesora (medium blend).", "author": "Bianca C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-06", "description": "My fifteen minute coffee run somehow turned into like an hour long wait... But otherwise their minto mojito iced coffee was delicious.", "author": "Justine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "I don't want Philz to lose their soul unlike the other huge mega chain evil empire coffee store that I'm not going to mention ***STARBUCKS*** as they continue to expand their brand from the small and humble beginnings in the Mission.\n\nPhil Jaber has built this brand organically from the ground up (pun intended) since 2002 and has been consistent throughout the whole process. He's got over 30 stores in the Bay Area and as far south as LA and San Diego that he has got a cult-like following. Having met Phil, a local celebrity, he gives an aura of a cool grandpa with a Midas Touch and a twinkle in their eye. \n\nFor the longest time (it seems that way) the closest location from my work was the one near AT&T Park. I didn't mind stopping there before going to work, but traffic before and during a game made it quite a challenge. \n\nWhen I discovered he finally opened one location in the Financial District, I got giddy and my inner caffeine addict in me couldn't wait to strut the 10 minute walk into arabica nirvana. Even though Philz is known locally, not all locals have tried their coffee and it brings me great pleasure to introduce them to their Iced Mint Mojito. \n\nSh*t, I consider myself a pusher of Philz to my family and co-workers who have not yet tasted Phil's wonderful blends that are masterpieces in the coffee business. And staying with the local theme, he uses a lot of local artists with local subjects to display their artworks and creations in every store. \n\nAs you expand and grow, keep to your roots and don't ever change, Phil. Don't ever change. You're a one cool cat with a twinkle in their eye.", "author": "John G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-24", "description": "My experience here was better than another one, the staff was approachable and friendly for the most part. \n\nI ordered a philharmonic coffee and a cinnamon roll. Both are okay, the roll is quite good when warmed. For some reason I find the coffee to be lacking, maybe it's the type of mixture you get, and it doesn't seem to be the most flavorful.", "author": "Spencer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "It's Philz. Who are we kidding...  This place rocks. Great seating outside. Small inside but who cares. This place never misses.", "author": "Scot M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-07", "description": "I love Philz coffee and I've been to many locations. I've always received friendly service. I will usually give 5 stars, but this location's customer service is dismal. I went here with my wife on a pleasant Sunday morning.  There was no one in line so we went up to the counter. The barista said, \"I'll call you when I'm ready. \" in an annoyed tone. We apologized and she didn't acknowledge us after that.  We waited until a different worker called us and she was about as charming as a wet sock on a cold day. No smiles, just monotone questions and answers. We asked for a bag of coffee to be ground and the cashier snobbishly asked what grind level we wanted. I understand it's cool to be a brooding artist working at a coffee shop, but is a little common courtesy too much to ask??", "author": "Jason J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "Has an infectious morning energy. Think of your elementary school homeroom period before classes with friends milling about. Now picture the adult version, where young professionals catch up before heading off to work. \n\nThere's a certain buzz in the air, probably induced by the millions of mg of caffeine flowing constantly. At this particular location, order in advance or be prepared to wait. However just like other Philz, they take time and care for your drink. Worth it!", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "All the coffee drinkers rave about Philz and they are always busy. I used to go here quite often when I worked in the area. I like their food and hot chocolate.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-25", "description": "Nice location, Philz has good coffee, clean and good lighting. But please get all-gender bathrooms, and some gluten free pastries. Thanks!", "author": "Kate H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-03", "description": "First time at this location, but finding out Philz now has a mobile app? Amazing!\n\nPros (mobile ordering):\n-Quick to set up an account and order on the go (I ordered while I was towards the end of the massive order line. Placed my order in the app and stepped to the mobile pick up area\n-Mobile pick up area: on the far left of the shop (next to the hallway before the restrooms). Drinks are placed alphabetically (first name)\n-App gives you an assigned pick up time for your drink before you finalize paying \n-App tells you which barista is making your drink, has a countdown for when your drink should be ready, and when it should be ready for pick up \n\nCons (mobile ordering):\n-Countdown of your drink order is the expected time it should be ready (based on the time you were assigned). Not based on whether or not the barista is making it (or saw/remembered the order )\n-Baristas were only announcing drinks for large orders (3 cups or more), or for people who inquired if their drink was ready. Otherwise you had to be vigilant about seeing your name/cup\n-Overheard people say their wait time was about 10-25 minutes long (a con for those needing to get to work or with time constraints)\n\nNot so amazing was that my order was forgotten about. I didn't realize until I asked the barista, 2 minutes after my scheduled pickup time, and she told me as much. \n\nNo apology for the oversight was given, but to her credit she was quick to brew my drink once they realized the error. \n\nI'm not sure how long the app has been live, but I'd recommend not putting expected times drinks are to be finished (to limit any potentially annoyed customers and to take off stress on the employees about time restrictions). \n\nMinus one star for the forgotten drink and another star since I ended up late for the oversight. BUT otherwise this Philz was similar to their other locations: large, well staffed, and the occasional confused first timer not knowing how the order/pay process goes \n\nI'd still go back, but maybe give myself a 20 minute buffer.", "author": "Caroline T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "One of the very few places open on Sunday I the financial district.\nI really like the medium blend coffee options they have. Try philarmonic if you like some spice in your coffee.\n\nNot many vegan food options (they only have donuts for vegans)", "author": "Sevda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Hands down my favorite coffee location in San Francisco. You have to try the Mint Mojito ice coffee. It's a particular treat for myself. The handcrafted one coffee cup at a time. It's elixir of the gods. I got Philz Bagel. It's everything bagels with cream cheese, tomato, and  English cucumber.", "author": "Diem N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "Pun alert, I am buzzed to write this review.  Yes, I am that psyched about it.  I love the concept, all pour over all day.  I had an iced-ecstatic and drank every last drop.  Though the line was about 50-people long when I showed up, things moved along well enough (about 10 minutes) and I was able to get up and order.  Like the vibe, great cup straight-up no sweetener or ice, and fast service.  Worth the price, get it!", "author": "Charlie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "I have only tried their mojito coffee but that alone made the trip worth it. The staff were friendly and the coffee came out pretty quickly. But this location does close early on sundays!", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-15", "description": "The BEST pour over coffee ever! Service is ehhh and the employees aren't the first but it's great coffee and there is a reason why there is a line out the door all the time. This location has great tables that allow you to enjoy your coffee outside and people watch. Go here and enjoy it!", "author": "Bethany M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "The go to is the mint mojito coffee. Love the sweet and creamy coffee here. Extra creamy and extra mints alsoooo", "author": "Joey N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-13", "description": "So centrally located, so thank you to this Philz being right on Market. \n\nDRINK: My go to is probably that Mint Mojito (I know, so basic, right?), but honestly, it's best with half cream and half sugar to still get that full experience, but not be so intense. I would highly recommend speaking to your barista as they can definitely guide you through the menu to ensure you have a coffee of your liking. \n\nSERVICE: Top notch as always with Philz with an attentive barista who will make sure your drink is to your liking. \n\nAgain, Philz smashes it home and makes it great for all customers!", "author": "Albert H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "The line in the morning is loooong but yo! don't be dissuaded because other reviewers are right and it moves real fast. Staff here was efficient and friendly. Review is more about this location because duh the drinks were great.", "author": "Daisy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "Pretty decent sized Philz located in the fidi area right before the Ferry Building. Some bar seating and plenty of outdoor seating. Same as all the other Philz as you stand in line for your made to order coffee/tea and then you pay. They offer food items here too. I saw an avocado toast and what not. They have free water here which is a plus! Two unisex bathrooms with a totally must needed passcode as even with the passcode we noted some sketchy business. The outdoor seating is a plenty with an open space for you to people watch. Since its in SF and fidi/downtown location there will be some homeless friends wondering around. Overall, it was a nice break from the hectic downtown area but yea it can be a bit a sketch.\n\nWe've only been here on the weekend. It is not too crazy. We never had to wait too long. Not sure what its like during the weekday.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "Absolutely perfect!! And the protein bowl is amaaaazing!! Irie vibe, jammin to slightly stoopid and rebelution! Perfect start.", "author": "Alie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "Typically what gets me through the day and is much needed all the time. Delicious and yummy and I always come back for more. My order is an iced mint mojito w/ almond milk and lightly sweetened.", "author": "Cecile .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-22", "description": "~ YAYYYYY ITS MY 450TH YELP REVIEW PHILZ COFFEE AT THE SAN FRANCISCO DOWNTOWN AREA ~\n\nOn my very last time I drank Coffee from Philz Coffee was a year ago when I took a ride at Cal Trans and headed down to the City Of Sunnyvale on my day off from work!!! And now on February 21ST 2017 which was 1 day ago... I finally got another chance by trying this Philz Coffee at the San Francisco Downtown Area and of course it was my day off from work as well!!! When I first found this Philz Coffee at the Downtown Area Of San Francisco!!! While walking inside for my very 1st time at this Philz Coffee Shop just like the one at Downtown Sunnyvale it was crowded!!! \n\nBut the one at the San Francisco Downtown Area was a lot more crowded than the one went to a year ago at the Downtown Sunnyvale Area!!! The Philz Coffee that I drank at that Downtown Sunnyvale area was a Small Iced Coffee... And now a year later while I found this Philz Coffee of the San Francisco Downtown Area!!! And the Philz Coffee that I decided to drink this time was the New Matthattan Style Coffee and finishing it all it tasted really good and kept me awake through out the whole day!!! If I get another chance I definitely would wanna go back to Philz Coffee and try another Coffee style at Philz Coffee!!!", "author": "William B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "I haven't met anyone who doesn't like Philz Coffee. Since opening in the early 2000s, this small coffee chain has become quite popular and synonymous with the San Francisco Bay Area. With over a dozen locations in the city, my first experience with Philz was several years ago in the Castro. Not long ago, we stopped by this location in the Financial District and the coffee we got hit the spot.\n\nThis location is busy with both tourists and workers. The cafe is centrally located to the Ferry Building and the Embarcadero, South of Market, Union Square, Chinatown, and the FiDi.\n\nThe cafe is located on ground level, at the bottom of a First Republic Bank office building. The storefront facade is all glass and both the inside and outside look nice and modern. Indoor and outdoor seating are available. Sitting outside is pleasant as there are many tables and chairs spread out across a spacious brick courtyard, away from the streets. Inside, the cafe feels warm, comfortable, and inviting. Access to the restrooms is restricted by a passcode.\n\nPhilz specializes in individually drip-brewed cups of coffee. During our visit, the coffee menu had over 20 blends to choose from including dark, medium, and light roasts as well as multiple decaf options. A small cup cost $3.50, large $4.50, and by the pound, $18 per pound. In addition, they offered other drinks like iced coffee, hot chocolate, and nearly 10 kinds of tea at similar pricing per cup.\n\nOne thing I like about Philz menu is even though there are a lot of options, they keep it simple. You don't have to be a coffee hipster to enjoy this place. Each coffee (or tea) on the menu is described in three helpful, aromatic words or less. For example, the medium roast Philtered Soul is described with the words hazelnut, cocoa, and syrup. The dark roast decaf Swiss Water Peru: cedar, earthy, smokey.\n\nI tried the dark roast, full body, Jacob's Wonderbar prepared \"Philz Way,\" medium sweet with cream. The drink was ready in a few minutes and its description (chocolate, nuts, clove) was spot-on. One of the baristas told us Jacob's Wonderbar is one of the company's most popular dark blends and I can see why. It's a very good, quality cup of coffee.\n\nGood service. I'd definitely come back.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-19", "description": "Always on point! Ambrosia is excellent! Atmosphere is upbeat. Line was quick this morning.", "author": "Kayli T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "I was in our San Francisco office for a meeting and a colleague of mine suggested that we go grab coffee at the super popular Philz.  I am a pretty picky coffee drinker and I rarely go to a coffee chain, such as Starbucks, to get coffee unless I am traveling.  It was hard to decline her invitation since she was so enthused about it; so I skeptically obliged.\n\nI must say, I did enjoy the coffee at Philz.  Unlike most of the dominant chains, you can always pick the flavor you like at Philz.  That was my biggest pet peeve with Starbucks - you never know what blends they are serving when you walk in. \n\nThe hand pouring of the hot water to brew the coffee seemed more for showmanship than any real practical purpose.  The blends of coffee are quite excellent with distinctive flavors that would probably meet the preferences of most savvy coffee connoisseurs.\n\nI tried Julie's Ultimate for my first visit since I prefer darker blends.  It had a nice toasty vanilla flavor on top of slight hint of roasted nuts.  This is a blend that may be habit forming for me.  I can see why Philz is so popular.", "author": "Louis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Philz is the best! \n\nMy go to: Sooo Good Warm with medium cream and sugar. \n\nDelicious! \n\nIf there is a blend you'd like, they can do custom cups of all beans they offer. \n\nIf you see Hazelnut, it's worth trying but hard to find! \n\nRemember to order ahead if you're in a hurry via the OrderAhead app.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "As someone with gold status at Starbucks (does that REALLY MATTER anymore though?) and really likes the consistency (generally) found at a Starbucks, going to Philz required a bit of a learning curve. Luckily I was there shockingly early and my fumbling at ordering didn't cause a hassle (I hope!).\n\nSince I've only ever ordered Philz from their truck I didn't know how they distinguish themselves from other coffee shops from a service perspective (it's easy to tell how distinctive Philz is from a quality of product perspective). At least the location I walked into, which I assume is similar and generally  consistent across the brand, there is a big counter with a few baristas. You order your drink from them and then shuffle over to the register to pay. This seems intuitive but for some reason I definitely hit the struggle bus a little by going straight to the register (probably because that's where the food was and I wanted food as well).\n\nSo, my first faux pas was not ordering from a barista. Then, I didn't realize the extreme care Philz baristas take with drinks means you basically have your own barista for your time and experience. You watch your barista make your drink and they had it over to you. If two people order the exact same drink and one comes out first- make sure it was your original barista. That was my second blunder here. My third mistake was not tasting my coffee before putting a lid on it. Apparently you're supposed to do a taste test and let the barista know how you feel about your drink. Whoops. Luckily I got a black coffee so it wasn't a big deal.\n\nI also got super confused about my food order. I didn't know when to expect it or where to pick it up. Eventually I figured I would trust Philz to guide me... and it came through! Somehow the person making my food knew my full name and called it out when it was ready. I have to assume it was from my credit card or a previous visit (again, to the truck) somehow?\n\nAnyway, my own incompetencies aside here... the coffee was/is fantastic. Hands down, fantastic. The avocado egg toast was wonderfully delightful and absolutely made me understand why other millennials have such a hard time deciding between it and buying a house. I'd likely go with the toast more often than not personally.\n\nNext time I go to a store location I'll know better. But, there will definitely be a next time, or basically and every time when I see Philz.", "author": "John T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Philz is delicious. I really like the chai latte that they make special. Just make sure to explicitly say you want a latte.", "author": "Caroline M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "New morning routine: Philz across the street from my new office. Like all Philz, super friendly staff. Line moves quickly. Excellent pastries to compliment their wide range of coffees available. Large Tesora, please!", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "The kind service set this apart as a 4 star review for me. The barista who helped us was kind and patient despite the long line and my inexperience with their menu. She suggested the mint mojito coffee and explained how it was prepared. She listened to my questions and gave friendly answers.\n\nI wasn't particularly impressed with the mint mojito coffee. It was certainly different. Maybe I expected something spectacular from what I thought was one of their most popular items. I liked it overall and I will try again I am sure. Maybe I should have just stuck to a coffee for my first visit. That would have been easier to compare against the many many other coffee shops in San Francisco.", "author": "John W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-27", "description": "I've been trying to learn from others' experiences and branch out of my comfort zone at work, so networking sesh #2!\n\nI got the iced mint mojito that everyone raves about. Ugh, I can't do this afternoon coffee thing anymore-- I feel suuuuuper jittery right now, but for everyone who has regular coffee tolerance, I think the caffeine level is probably normal. I got extra cream in my drink and I think it may have diluted out the taste of mint-- I'd have loved for it to be a bit more minty! My coffee definitely tastes more like cream with a hint of mint than coffee. I did appreciate the fresh sprig of mint on the drink though. Also gotta drink it fast before the ice dilutes your drink!\n\nAdequate amount of seating on the inside, outdoor seating for when it's warm. The ordering is a bit confusing as you order at one spot (spot A), pay in another spot across the store (spot B, have to tell them what you got again), and then go back to spot A to pay.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "Pro tip: this philz is usually pretty crowded (no seats inside) during business hours in the work week, but is amazingly low key during weekends when tourists all flock to the ferry building philz instead. \n\nI've noticed that the baristas are not as consistent as the other philz I've been to but they're 11/10 friendly and awesome. 4 stars because I might get a really mediocre, underdeveloped cup of coffee but still feel good about it.\n\nOh philz you sly fox you", "author": "Robin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "Highly efficient coffee makers here, and apparently the best time to get a coffee is just before noon.  The quality is comparable to other philz, and the beans are as always excellent.\n\nTryCaviar (who bought Order Ahead) runs the pickup coffee bar, and they seem to be frequently idle.  Thankfully they've optimized the workers here to pick up the normal walk-in line as well", "author": "Matt U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "From their mint mojito to their Philtered Soul to their Tesora to their Tantalizing Turkish...everything is amazing. I usually rotate between these 4, lately been feeling the Turkish more often.\n\nMy local Philz is in San Jose, so I'm used to drinks from them, but I would say the baristas at this Philz made my drink just as creamy and good.", "author": "Nishi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-25", "description": "I normally don't drink coffee or particularly like the taste of coffee, but my best friend has been raving about how amazing this place is and how their drinks are the best, so I shared some of her drink today. I have to say, it was probably the best coffee drink I have ever tasted. She ordered the mint mojito ($4.50 for a small, $5.50 for a large), which is an iced coffee that is sweet, creamy, and deliciously minty. They add in ample mint leaves to the foam on top which give a really nice refreshing flavor to the flavor of the coffee. Even for someone who doesn't normally drink coffee, I liked the taste of this drink!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-04", "description": "Philz Coffee is brewed \"one cup at a time.\" The staff is very friendly and will wait for you to try your coffee to make sure you are pleased, even though lines are out the door. Now that's customer service! I got the Gingersnap hot and wanted it extra hot, but they can't do that, but it's understandable since it is literally is like a French press style with water going over the coffee grains. I thought the gingersnap was really good! They are famous for their Mint Mojito and that is very tasty and unique, too. A small is $4.50 and was a very good cup and well worth it! I also got a twice baked Almond Croissant and it was delicious and fresh. Would highly recommend this Philz if you want something special in the morning...or really, anytime of day!", "author": "Jessica G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "I came here with a group of friends who had been before.  I actually only drink decaf, but it was incredible.   I will have to go back.", "author": "William R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-08", "description": "Came on a Sunday morning. Out of meat breakfast burritos, all toasts, and all bagels but cinnamon raisin. Asked for iced coffee got a hot coffee. Gave it an extra star because the pastries we did order were good (but small for the price we paid).", "author": "Jordan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "Came with a friend here. Good coffee. Service is ok.\n\nThe cold coffees are really nice!", "author": "Vipul S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-20", "description": "Their specialty is the coffee drinks, not the beans. Get the iced coffee mojito. For gourmet coffee, there are better options out there.", "author": "Ivan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-19", "description": "Got the mint mojito iced coffee on the recommendation of a friend. Was it good? Yes, but I believe it is overly hyped. The mint surprisingly works with the coffee - it gives it a refreshing taste. Would I get it again? Sure, but wasn't blown away.", "author": "Jeanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "An unique coffee experience, with custom brews. The person behind the counter was so helpful since it was my first visit. She made recommendations off of flavors I tend to like. The coffee was really good and you can't beat customer centered service. Will be back next time I am in the bay.", "author": "Mary N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "Worth the wait! Made one cup at a time. It's super tasty and unique. There are so many varieties of coffee that it can be hard to decide. \n\nIf you're in a hurry they do have order ahead so you can skip the wait.", "author": "Kaley K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-15", "description": "If you want healthy and natural coffee go to Philz coffee! This place is very good and well located in the center of San Francisco. The room is not very large, but you can find a comfortable place for yourself. Stunning views of downtown!!! Lots of fresh food and drinks. Here you can have a great time with friends.l very like this Philz Coffee:)", "author": "Sofya K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "Every time we come to the bay we always stop in here I really wish that down on the Central Coast we had this coffee shop typically we get the Jamaican blue but this time we tried the mint mojito  it is iced and a must if you're stopping here. All of the options are non-espresso-based blends of different types of coffee to offer a well rounded flavor to your palette the flavors are all natural and you're not even needed to be accompanied by syrups.", "author": "Shannon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Whenever I come up to San Francisco I make sure  to have my morning cup of Coffee at Philz. LOVE Love the Iced Mint Mojito beverage. I live In Orange County, California so there are a few locations here in so cal. But its still about an hour away from me. So unfortunately I don't get Phil often.", "author": "Crystal N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-19", "description": "This Philz is larger than the one in Folsom, I believe they have 1 maybe 2 more baristas here. Don't be fooled, the larger the coffee shop the more coffee drinkers. I get here at around 8:15 and can't receive my order until about 8:30. \n\nNonetheless what is life without a nice philtered soul to wake you up for work :)", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Calling all coffee lovers in the area!\n\nIf you have yet to try Philz Coffee, then you are missing out on a whole lot of goodies! Not only is the coffee delicious, but the workers here have a \"can-do\" attitude which wakes me up even before my coffee! \n\nI wanna say that everything on the menu is great! Personally I enjoy the Mint Mojito and Ginger Snap Ice Coffee, because I can enjoy it in the before, during and even after work, especially after a busy and long day. \n\nSo, If you have yet to try it out then what are you waiting for?! Even if it is just a sip, you NEED to try it!", "author": "Benson M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "Pretty much can't compare with this location Philz got everything you need to enjoy a high-energy day. \nMusic\nCustomer service \nAmbiance \nOutlets to stay charged up\nAll around up beat which helps me personally in staying focused​ and it's somehow a bit inspiring. Big thumbs up y'all!", "author": "Curtis F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "Two words: mint mojito! Having just moved to the city, I heard a lot about Philz and so I was excited to try it, specifically for the Mint Mojito. Thankfully, they have almond milk so I subbed the regular milk with that. It's delicious - just lightly sweet unlike the overly sugary Starbucks drinks. I also taste the Ginger Snap which was good, too. Oddly, they don't do lattes at all but who needs 'em when you've got so many other delicious options? I also split a cinnamon bun with my mom which was delicious, as well. Highly recommended!", "author": "Pooja C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "My wife and I were in town for a weekend getaway. We were told this is a  must-go in the City. It is. \n\nWalked in and were greeted right away and a friendly face. The barista was quick to offer suggestions (get the Mint Mojito if you've never been before) and took our order directly. After ringing up at the cashier, we waiting inside... nice location, very comfortable. \n\nOnce we got our food, we went outside and picked a spot in the immediate courtyard area of the building and enjoyed our food while watching downtown life go by around us. \n\nSO MUCH COOLER than Starbucks or Peets!", "author": "B D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "Never had Philz Coffee before this visit and boy was I missing out! The ordering process was so confusing at first (order at the counter with one person then get into another line to pay), but the coffee is soooo good! I usually hate coffee and mainly drink it for the caffeine but the iced mint mojito totally changed the game. It is sweet and creamy and has a prominent mint flavor that I love. Will definitely be going to Philz when I get back home to SoCal. I was wondering what all the hype was about but now I know.", "author": "Lina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Mint Mojito Iced Coffee!\n\nFinally tried this place and am so happy I did. The staff was really helpful and were happy to adjust their drinks to accommodate. There was no line, plenty of seating available when I went and loved my drink.", "author": "Shelley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Hmm, I think I have an addiction.  Tesora, black...thats my fix.  I always come here for the hot coffee, although their iced varieties are pretty delicious.  \n\nThe line can be long, the staff is very efficient and moves it pretty quickly.  10 am, 3 pm, those are the worst times to go.   Between lunch and 3 it is pretty slow.", "author": "Veasna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "Iced mint mojito & Iced Mocha Tesoro is the way to go for all you folks who enjoy coffee without the black coffee taste. Also opt for sweet & creamy if you're really looking for a really easy to drink concoction that hits you with caffeine soon after sipped.", "author": "Carissa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Philz Coffee definitely lives up to the hype. All the baristas were super friendly and knowledgeable (especially when they could tell I had ZERO idea on what to order). Me and two friends each ordered something different and it was all equally delicious! If you're a big tea drinker like I am, try the Yerb Mate iced tea! It was delicious!", "author": "jessica r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "Why 5 stars? Because my one true love is more convenient than ever.\n\n   ---   ---   ---\n\nI think I would officially call Philz my favorite coffee shop of all-time. Every time I'm in the Bay Area, I try to go out of my way to make an appearance at one of their locations. I've written reviews for a few different locations at this point, so normally I'd probably skip writing this one, but this one has a special meaning for me. I no longer have to go (as far) out of my way! \n\nWorking a few times a year at nearby Yelp HQ meant that nearest Philz was an Uber ride away... but no more! This is only a few blocks from where we normally stay, and ensures that Philz will always be a part of my mornings on my trips to the mothership.\n\nAs is the case with all other locations - the coffee is phenomenal, the people are friendly and the bagels are delicious. Philz, if you want to expand outside of the Bay Area, I'd offer you my first born.", "author": "Brett N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "As all the other philz locations, they are great, friendly staff, cool people and nice environment.", "author": "Jay G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Across from Bank of America & Starbucks.\nCome here for excellence coffee but be aware the long line out the door never ends. It can get pretty intimidating. One recommendation, download Cavair, you can order you coffee ahead of time and pick up, or just order from your phone while you wait! No need to stand in that line. Lots of seating outside and inside, but they do go fash during the rush- 3pm particularly.", "author": "Azizi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Like most people, I come here because not only is the coffee great, but the experience is always positive. My primary reason for heading into Philz is caffeine, but the reason I would travel further to get to Philz than to another spot is definitely THE PEOPLE. Everyone who I've been served by here has been super friendly, happy, positive, and makes me feel like I'm a friend who's dropped by to visit. \nMaking every cup just for you, this location handles a LOT of traffic every day, but manages to do it without feeling hectic or bustling. It's like a Bay Area time warp - the way it used to be all over the greater Bay Area, with people just being laid back and friendly, not worried about everyone else's business, non-judgmental, and chill.\nI'll be coming back to this location whenever I'm in San Francisco because the experience is consistently pleasant. Hopefully you'll agree!", "author": "Erik K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "So, I finally tried Philz and the famous Mint Mojito that everyone is talking about and here's my verdict: it ain't for me! I was really excited and when I tried it, I was like, \"meh, it's alright!\" Anyway, I've been coming here everyday of the work week since the COO of our company likes his Dancing Water fix so I've been trying different drinks each time I come. So far, I like their Mocha Tesora (both hot & iced) with almond milk and today, I just tried their Philtered Soul w/ almond milk and that shit was delicious! Every staff here I probably already encountered and each of them are very friendly. Everyone moves at a fast pace and they surely keep the line moving but thankfully I haven't been there to the point that it's that long. I'm gonna keep working through the entire menu until I decide which one would be my go-to drink.", "author": "Candice J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Awesome coffee. Awesome vibe. The barista was dope, really knows his coffee, but the cashier was a little short with us. Like thanks for the pronounciation correction, Mojito is apparently prounounced \"moe-juy-toe\". Couldn't tell if she was kidding. Coffee was awesome tho.", "author": "Anna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "As a coffee lover, Philz has been on the top of my list but it wasn't until I was on my way to Super Bowl City that I finally got to try this place. I saw their big bright sign and it was definitely a sign for me to try it. There was no line at all which was surprising to me considering others have said this place gets packed. Probably because everybody was more concerned about getting into Super Bowl City. \n\nI knew I wanted to try their mint mojito iced coffee but I glanced at the menu and they have such a wide selection. I like that they separate the different roasts they have. I was tempted to try one of their blondes but opted for what seemed safe. \n\nThe whole process of ordering, paying, and receiving my drink was kind of unorganized. You go to one of the baristas on bar and tell them what you want, then go to the side and pay, and just kinda hover around the bar and wait. They don't ask for your name or give you a number so it seems that anybody can just come and snatch your drink thinking it's theirs. Also they speak so low when they're calling out drinks. \n\nNonetheless, I enjoyed my nearly $6 iced coffee (kinda hurt me because of the price but oh well). The mint mojito wasn't too sweet but nice and creamy and the mint flavor was subtle enough to taste but not too overwhelming. I was instantly energized and downed that coffee so fast. \n\nPhilz was all I expected it to be except for that weird ordering process. I'll be back soon Philz!!!", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-13", "description": "Perfect.\n\nNot really much else to say.\n\nWhen I see a tourist looking at the crazy long afternoon lines I know there is no way they can fathom the exceptional perfection that is The Philz! You've never had anything like this.\n\nI'm very worried this coffee chain is growing way too fast. Please don't mess this up. Every cup is always perfect. I really hope it stays that way.\n\nI find it very refreshing that the baristas get to play their own music. Thanks Phil!", "author": "Justin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-22", "description": "Great Philz. Location is small and doesn't have a lot of seating. Not ideal for doing work, but perfectly fine for grabbing a quick one to go.", "author": "Billy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "Use \"ORDER AHEAD\" app to place your order and skip the lines. \n\nThis Philz is in the financial district, so expect lots of dressed up people waiting in line to get their caffeine fix. I was under strict time pressure to hit as many places as I could in SF in 10 hours -- I didn't want to wait in line so my sister used the \"Order Ahead\" app to place our order 15 minutes before we arrived and our drinks were ready and waiting for us when we got there.\n\nThe reason the line is so long is because some people don't know the answers to the dozen or so questions they ask. You need to know all the basics before you get to the front of the line! Hot or cold? Size. Milk? What kind of milk? Sweet? What kind of sweet? Real or fake? Which fake sweet? Once you've passed that test, you need to pay. Then you need to wait for your made to order drink. \n\nIf you're waiting in a long line reading this, go open that \"Order Ahead\" app and order your drink now. You'll probably save some time. While you're at it, you can also order your dinner and have it delivered for tonight. #lifeHack", "author": "Lori I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Never been to a bad Philz. Service was great and fast.  Order was accurate. Some food takes a long time however.", "author": "George T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Philz Coffee! great spot on market street and with friendly staff! I came here twice already, with two different female staff's recommendation on coffee and it was DELICIOUS! I usually get the mint mojito (ice coffee) but in the morning, I'd like to start with something \"hot.\" I've been recommended the Jacob's, first on the list of \"dark coffee\" and it was really really good, even though the coffee is $4.50, it's definitely delicious. The 2nd visit consisted of Julie's Ultimate, also a good choice, but my top pick is still Jacobs for now.\nThe staff is really polite and friendly, so if you're new, ask them for recommendation and if you don't entirely enjoy it on the first sip, let them know and they'll offer to make a new one for you.", "author": "Hao B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "My total favorite coffee chain in the bay areas. My go to is the mint mojito. I think i got 3 within a one week visit. Great for anytime of the day.", "author": "David Dat T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-26", "description": "This place has a line 30+ deep every weekday morning.  Philz has found a way to make pour over assembly line style and can really move some customers through the place.  As long as you don't get behind a few people ordering for their whole office the line moves pretty good.\n\nThe coffee varieties offered is really exceptional.  There are only a handful of places that I can think of offering that many options.  It did take me a few tries to find a favorite but all of those I did try were very good.  \n\nEven though the line moves fast it may be the longest line for coffee in town and it does deter me form going at times.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "This Philz location is one of the newer franchises around. At first I stayed away because I knew how popular and crowded it would be, being in a hot part of the Financial District. Then my friend suggested that we meet up here. I fell in love instantly, and this is by far one of my favorite Philz locations in the Bay Area. \n\nI love that there's plenty of outdoor patio seating and some indoor seating areas for all types of weather. The atmosphere promotes casual conversation with an old friend or work colleague. Everything about this store is super organized and clean and contributes greatly to the Financial District community. I'll be back many more times! The store manager is pretty cool too.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "My daughter recommended the mint mojito and I was not disappointed. I also chose a bakery item, it was a cinnamon twisted stick but I'm not sure of the official name; it was delicious! The service was friendly and efficient. There were seats available during our visit and it was a clean and inviting environment. I recommend with enthusiasm!", "author": "Cheryl K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "Super fun, quirky place. I love that they individually brew every coffee- makes such a difference! They have really fun blends and names, and both hot and cold options. The service was great. You order your coffee on the left, go and pay, and then they call you when your freshly brewed delicious beverage is ready. I'm so glad I finally tried this place!", "author": "Mari K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "I'm so sad I only really discovered Philz Coffee in my last week of being in San Francisco. Even so, I went out of my way to go back! The first time I went in with colleagues, I mistakenly ordered a latte assuming it's like Starbucks or even Peet's. I was delighted to hear that they don't even serve latte's and instead serve their own variety of speciality coffees!\n\nI normally dislike speciality coffees at Starbucks and other chain coffee shops as they are often just crammed with sugar. The baristas at Philz are great though and made an effort to make the best coffee for me - cream but no sugar. I definitely recommend Ginger iced coffee and also the Ecstatic iced coffee (both incredible!).", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-09", "description": "This location is a huge spot. Rent must be expensive.\n\nThis spot is a very convenient location serving FiDi and SoMa. \nLines can get pretty long.\nPrices are the same as all the other philz.\n\nI stick with the estatic or the mint mojito...\nHere's a little off the menu tip for caffeine fiends: They have an XL size that isn't advertised. The XL size uses the black lids.\n\nAnyway, this location has a pick up counter specifically for OrderAhead if you order through your app / the website for pickup. Skip the line and pick up your coffee. \n\nI'm glad this location opened. I'll be frequenting quite often!", "author": "Kaje Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-17", "description": "Came back today and had a much better experience. Vicky made my coffee and was very nice and adjusted my drink to my liking.", "author": "Stephanie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "I would have given five star to this coffee shop but due to inching up of prices I won't  u see the best different flavours here. Coffee I tasted are terrific n impressed coffees are Tesoro and mint hot coffee and cappuccino all are good  and rich in aroma and soft.\n\nRecently Ethiopia decade which is also fine to taste. In this fidi center it's always crowded at afternoons also .\n\nStarbucks : for the ones who want light roasted coffe Starbucks suits\n\nPeets : fro the ones who loves to have bold n roasted coffee Peets suits\n\nThe coffe bean : for the one who loves to have perfect taste of coffee coffee bean suits\n\n Blue bottle :  for the one who loves to have perfect blend of beans blue bottle is best but pricy .\n\nPhilz: for a medium roast n creamy kind of flavour phill is always best", "author": "Sandeep R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-29", "description": "This new Philz location is about a block from the building I work in, and every time I've passed it since it opened the line was out the door and down said block. However, midweek at around 5 PM I managed to walk in and there was no line whatsoever, so keep that in mind if you're in the area when everyone else is going home and Philz is an hour from closing.\n\nThe interior is really nice, very airy with high ceilings and modern lighting, loud music, and nice people behind the counter. This was my first time at any Philz, ever, so I went with the drink I hear about the most: the mint mojito. \n\nI ordered it without any alterations or specifications made, just the way they make it, and like it a lot. The fresh mint really makes a difference, and I thought it was the perfect amount of sweetness, especially for me, who doesn't put sugar in her coffee or tea. \n\nWould I make a return trip? Yes, more than likely at the same time I did the first time because this wasn't worth the hour wait everyone else is waiting. Would I come back every day? No, because it was good, but not four dollars a day for a small, good. Solid first time experience with Philz.", "author": "Angela M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "Ever since coming back from Dollywood in April, I have decided to pursue my new dream of becoming a Southern gospel singer with my back-up trio, the Coffeemates, and my own theater in Branson, Missouri. That way, my wax likeness could be preserved as an animatronic mannequin just like they have in Dollywood's Southern Gospel Hall of Fame. I would have my plasticine doppelganger sing this Cristy Lane classic on a constant loop...\n\nOne cup at a time, sweet Jesus\nThat's all I'm asking from Philz. \nJust give me Silken Splendor \nTo sip every day what I want to drink. \nPrima Cosa's gone, sweet Jesus \nAnd Blue Bottle may never be mine. \nPhil, help me today, pour one my way \nOne cup at a time\n\nBlasphemer you dare call me, do you? Well, Philz is like my church, The Church of the Overcaffeinated Saints, you decaffeinated heathen, and I've had the hedonistic pleasure of patronizing most of their locations in the city. That's why I got down on my knees and thanked the Big P for opening up a new branch just steps away from my office building (photo: http://bit.ly/1C0fEfD). Philzaphiles like me have been waiting for weeks wondering why the barista training was taking so long before opening to the panting public. Because of the free giveaway on their opening day, I stayed away, but the queue was barely out the front door yesterday.\n\nDespite the cloudburst of rain, it was a tolerable level of moisture for me to fulfill my personal obsession with the Silken Splendor blend. It was pretty well organized once inside with a very cheerful woman directing us to the next available barista. A large Silken Splendor, please, no sugar, light on the cream (photo: http://bit.ly/1FUdjn5). There is a bench for the endless wait (photo: http://bit.ly/1L2V46t) and a small sitting area toward the left as you walk in (photo: http://bit.ly/1GgMQ6q). It is a smaller space than most Philz outlets, but I don't care since I am more likely to bring it back to the office to enjoy anyway. Philz has landed in the FiDi finally. That would be one small coffee bean for man, one giant Tesora for mankind.\n \nOne cup at a time, sweet Jesus\nThat's all I'm asking from Philz. \nJust give me Silken Splendor \nTo sip every day what I want to drink. \nPrima Cosa's gone, sweet Jesus \nAnd Blue Bottle may never be mine. \nPhil, help me today, pour one my way \nOne cup at a time\n\nOh..here's Cristy's far less caffeinated version: http://bit.ly/1B4zHP7\n\nCOFFEE - 5 stars...smooth richness or rich smoothness second to none\nAMBIANCE - 4 stars...not as comfy-cozy as other Philz outlets but it is the FiDi after all\nSERVICE - 4 stars...almost as smooth as the Silken Splendor\nTOTAL - 5 stars....Philz is in da house", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-08", "description": "When in sf, drink your coffee like the locals. Or the tourists that try to be local. So many flavors to choose from! I went with \"whatever is the most popular medium roast\" aka the Tesora. It was very flavorful and still pretty bold. I could've gone with something lighter, but it tasted fine just the same. I loved how it's brewed right in front of you too. They did mess up my order (medium instead of the large I got) oh well.", "author": "Clara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "Coffee is very good, however it is great quality. Customer service is great and the baked goods are yummy. I thought the breakfast burritos were just ok. I will go back for coffee and vegan doughnuts! Try the doughnuts with the Philz coffee added they are sooo yummy!", "author": "Raina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "I've been to this Philz location more than any other, mostly because it's in downtown, and just a block from the embarcadero bart station.\n\nEverytime I'm here, there is usually a short wait. In the late morning the line gets long, and will be out the door. \n\nOne time, I was working there and an angry, psychotic, homeless man walked in, started causing a scene. He was yelling at customers and cussing at the employees. At most places, any employer would be tempted to call security to kick a guy like that out. Instead, I saw two of the baristas stop working to de-escalate the situation. I was impressed with their patience, as they sat down with him and let him vent out his frustrations. Apparently he was just fed up with the lack of SF public bathrooms. They were polite, and even offered him some coffee. \n\nMost recently, I went in there wearing a warriors shirt and they hooked it up with a free drink.\n\nThis place is legit!", "author": "Juan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "What can I say, I love Philz Coffee. I can never complain about the mint mojito, the aesthetic inside, and the super duper nice baristas. I don't even mind the long lines during rush hour because I know that the coffee is going to be that good.", "author": "Bidisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-17", "description": "Struggling being 4 and 5 stars. Philz used to be more consistent in quality.  The front street location---where I now go most often--- is very good, but not as consistent as I remember from Berry St, my former regular Philz spot. But, really, they are all very good. Try the Aromatic Arabic if you like dark roast, no cream, no sugar. \n\nBring your own travel mug, not just because it's more environmentally friendly, but also because the lids on the Philz to-go cups just don't fit well, causing spillage.", "author": "Ron S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "I LOVE Philz--they truly converted me from a regular latte drinker to loving a solid sweet and creamy drip coffee. Ask for a Velvet Lady (Silken Splendor + Julie's Ultimate + Chai Spices, Sweet and Creamy) and you won't be disappointed.\n\nOnly critique is I wish they'd allow tipping on credit cards--bring cash for tips!", "author": "Tricia R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-24", "description": "This is a great new location.  Congrats, Philz!  I love your iced coffee.  We went in for their extra soft opening for which it was incorrectly advertised that they were serving free coffee.  We saw it advertised and they did not know what we were talking about when we asked about it.  They wanted proof.  Initial management was rather rude and so were the servers, so that impression is sort of stuck in my head.  \n\nWe talked to management further, got our free coffee that day and came back for more free coffee the next day, which was their official soft opening on which they were actually giving out free coffee until a designated time.  \n\nMy first customer service experience is sort of marred from the initial rudeness, but I can get over that with a few more free coffees.  Please feel free to contact me in all seriousness.", "author": "Maile N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "This location is great. It is somewhat small. I love all Philz Coffee locations just the same. Came here for my hot chocolate. I enjoyed it. My people come here that are dress up. That's because this location is in the financial district. This is the financial district location. This place is much better than the Bluebottle coffee shop that is nearby Philz Coffee rocks.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Had to try philz on my first trip to SF, and this place was packed. The venue was medium sized, but the line was out the door. However, it moved relatively fast. I tried the mint mojito based on a friend's recommendation. It was light and refreshing. Would come again if only it was available on the east coast ;).", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-30", "description": "This is the worst location for their signature coffee-Mint Mojito. I feel like because of the amount of customers which makes the barista rushing for every coffee they make. it's either so bland, so bitter or so something something. I only have 2 out of 20 perfect mint mojitos here. The reason I keep coming back because it's right next to my office and I am addicted to Mint Mojito.", "author": "Chloe N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-08", "description": "Rejoice for another Philz location even closer to where I work! \n\nRejoice for friendly baristas at 8am in the morning! \n\nRejoice for coffee (and you really can't go wrong with any of them, although my preferences are the mojito, Turkish, Greater Alarm, and the drink I just imbibed this morning, Sooo Good) that kicks the ass of a Frappucino every minute of every hour of every day of every week of every month, every year. \n\nAnd most importantly, rejoice for this huge caffeine rush that's fueling me this morning. \n\nWelcome to FiDi! Although does this mean that the Philz truck on Pine and Sansome will go away? :(...", "author": "Viet N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "I make no bones 'bout loving this place. \n#PhilzCoffee is hands-down the best coffee on the west coast. \nThis particular location is set to open soon (I had the opportunity to meet members of the new team and \"test-drive\" their coffee-making skills). \n\nAs expected - it was an #amazing ride! \n\nThis particular location is a stones throw from my office (set to open in a few days) and I'm loving it! \n\nMy suggestion: on a cool SF morning, when you're strolling past the location that was once a \"University of Phoenix\" - stop, and treat yourself to a #PhilteredSoul #PhilzWay you'll love you for doing it and you'll thank me for suggesting it!", "author": "Nick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "Favorites drinks are Philtered Soul and Mint Mojito iced coffee.\n\nThis location almost always has a long line but the wait isn't so bad when grabbing a coffee with a friend or coworker. I come to this location regularly around 2 pm\n\nOnce you learn to get used to the chaos that ensues at Philz you'll always get a good cup of coffee with a friendly experience.\n\nThe Baristas are very accommodating and always ask you to taste your coffee before you go. I almost never ask for adjustments, but I'm not that picky and I usually get drinks without sugar and light on the cream.", "author": "Candice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "Philz is really popular in SF.  I can see why.  They have good quality coffee and a good system for ordering coffee.  \n\nThey have a lot of different blends/roasts and they are well described on their menu.  \n\nIt's an alternative to Starbucks and offers something a little different.  I'm not a huge coffee drinker but I tried it out and could imagine it being people's preferred chain coffee store in the SF area.", "author": "Matt K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "All right, I guess I'm finally a convert now.\n\nI had some time to kill so I stopped by Philz Coffee in the Financial District. Their menu is pretty much entirely black coffee, no mochas or cappucinos for you! \n\nAs a mostly decaf drinker, I was pleased to see that they had more than one decaf coffee for your choosing here. A lot of other coffee shops have 0-1 decaf coffees. \n\nI opted for the Ethiopian (decaf) coffee, with a small hint of cream and sugar. The resulting drink was actually really great. The barista got some foam at the top of the coffee, which is pretty unusual for black coffee. The chocolate-ness and the slight sweetness made it taste really good. Look Ma, very little milk and the drink still tasted great!\n\nI'd come back again, sure. I don't really drink that much coffee but when I do, I'll fondly think of Philz.", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-09", "description": "Lines are way too long and service is way too slow. I just wanted coffee and ended up standing in line for 30 minutes. \n\nSomehow people who ordered after me for their orders before me. Good job Philz. Earned yourself a 1 star review", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-01", "description": "The coffee is fine, but the ordering experience gets me so confused and flustered. Why on earth did they think it was a good idea to set up a cafe like this?", "author": "Sonya M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "We don't have this chain in our area and were up for trying something new.\n\nThey have a different approach, refreshing, from the Starbucks experience. The service felt more personal and that they were truly making a cup of coffee for you.\nThe flavor was great and the store's atmosphere was inviting and spacious.\n\nTry it out if you're in the area.", "author": "Tony H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "So what does a diehard Starbucks coffee junkie think about Philz Coffee?  First, let's start with the eye-popper -- the price.  A large coffee at Philz is $4.50 where it's \"only\" $2.65 at Starbucks.  If you're into coffee volume, a large-size Philz cup is equivalent to a \"grande\" size (medium) cup at Starbucks.  OK. So the price puts you in the first class cabin.  Is it really worth the price?  So, second, how's the taste?  It's not as bitter as Starbucks.  Philz adds sugar and creamer as part of their service.  Nice!  Lastly, what's the final word on Philz?  My mind is not ready to cough up $4.50 for a cup of coffee.  Yeah, it's a great cup of brew.  But, on a daily basis, $4.50 is close to the cost for a meal. Unless one cup of Philz coffee gives me all of my daily vitamin requirements and a hug each morning, it's back to Starbucks.", "author": "Anthony K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "Finally made my way to the new Philz in FiDi! Long lines in the mornings were off-putting to me, but when I decided to swing by with a couple coworkers for a late afternoon pick-me-up. Even though we arrived around 4PM on a Tuesday, there was still a line! However, it was only to the door and moved very quickly. The service was speedy and friendly--thanks Devin for explaining what the \"house way\" (more creamy and sweet) and \"Phil's way\" (medium creamy and sweet) was.\n\nI got my usual mint mojito coffee which was the perfect cool drink during this SF heat wave. I notice they have lots of pastries from local bakeries, bagels, and even breakfast burritos as food offerings! If I see that the line is short, I'll try to swing by and grab a coffee and food together. Sometimes I'll just walk to the truck on Pine/Sansome since it's a teeny bit faster.\n\nTil next time, Philz! :)", "author": "Bonnie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "Always a fan of Philz! I normally get the Ice Mint Mojito or a lightly sweetened green tea with mint. I tried the avocado toast recently which was good.\n\nThis location is cute with ample seating outdoors and indoors. It's always busy so expect a line no matter what, it's just that lunch or 2/3pm are super busy as far as I've noticed. \n \nSome key favorite things about this place: sweet staff, lots of seating, plenty of outlets for users, and amazing drinks.", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-14", "description": "TIPS\nIf you want it hot, then tell them \"do not air-rate.\" When they pour the water from high up its not for show. They call it air-rate and it cools down the water. \n\nThe ordering process is different at Philz. You order first, pay second, then wait for your order to be called by the person helping you. \n\nBring your own person mug. I bring a 16oz hydroflask and ask them to fill it up. Philz will only share you for a small when you use a personal mug even if it's oversized.", "author": "Eric E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Silken splendor extra creamy, extra sweet is my go to order when I need to wake up. Great coffee, even better service!", "author": "Brian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "Wow, just wow. This was an amazing first experience at Philz. The barista was SO nice, and talked with me to make sure I ordered exactly what I wanted! Had the philharmonic with no mint and sub a bit of almond milk (vegan), and it was iced. SO GOOD!!!!!! Cannot wait to go back and try more things from Philz. There was a line, but it's totally worth the short wait.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "Philz is multiplying around the city faster than rabbits these days, but I couldn't be more excited since we usually stay in FiDi when we visit. \n\nThis location is expectedly super busy in the mornings, but all things considered the staff here moves pretty quick. If I lived here, I'd definitely use the Order Ahead app to save some time but then again my barista was really sweet, which made up for the wait. \n\nCall me a heathen, but I'm not a fan of the mint mojito. I always stick to the iced ginger snap, which is pretty much my heaven in a cup. If you're a first timer, don't be pressured into the mojito unless you really like mint. Their ecstatic coffee is really superb, too.", "author": "Kate K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "First time trying this place  and I love the concept and the flavor of the Mint Mojito Ice Coffee and the Ginger Snap Iced Coffee. The barista used fresh mint leaves in my coffee and the flavor really came through. Each cup is fresh brewed hot and then poured over ice. Usually iced coffee done this way would dilute too much when ice is added but they have mastered the art of brewing hot coffee strong enough to not be too dilute when poured over ice. I will definitely be back if I'm in the area. There is nothing quite like this in Seattle.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "Excellent coffee with great variety. Don't go in asking for an American, as I did. They do drip coffee  but it's awesome. I had the Tesora. They are short on the healthy food variety, so i had a bagel which was standard. Table to sit in and out and not too crowded", "author": "Yoram Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "Yum! Love me that Philz Coffee Mint Mojito. Although I really don't like coffee, I will forever and always drink this coffee. Just so good with the perfect balance of everything. Even though this place may have a line literally out its door, the coffeemakers are patient and super friendly. Yum Philz! So Yum!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "What else can I say that you don't know. \nPhilz makes it your coffee how you want it. \nI'm glad to be able to take advantage of their training sessions and get free drinks for couple days now. \nHappy that there will be this location as the lines at truck gets pretty long.", "author": "Margaret W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Great coffee and atmosphere! Absolute go to since I moved to SF. Personal favorite is a medium medium mint mojito", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-30", "description": "We found this Philz Coffee as we were in the Financial District of SF.  The line was long on a Friday morning around 10:30 am.  I ordered an iced mint mojito coffee.  I forget what he had but it was also an iced coffee of some sort.  After ordering with the barista, you pay at the register.  After they make your coffee to order, they call your name.  My iced mint mojito was nicely garnished with mint.  But not only that it had a bunch of mint in the drink under the ice too.  It had a pleasant flavor but I don't get what the hype is all about.  It's just okay.  This place may be popular but I guess it's not my cup of coffee. Apparently they have an order ahead app.  If you want to skip the lines, try that instead.", "author": "Trina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "Love Philz coffee. This is the best coffee especially the Mint Mojito. Can't get enough of it.  I have tried many locations and I get the same consistent quality, friendly staff and great menu. Great place to chat and relax.", "author": "Shivaji D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "Solid coffee that's not overpriced. Slightly sour, which I tend to like less than most coffee drinkers. Still pretty great. The lines are super long in the morning but aren't that bad. I was about 25 people back and got to the front in about 10 minutes or so.", "author": "L S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-04", "description": "The coffee is fine. Could be stronger. The service can be rude! Servers and cashiers impatient for customers who are unfamiliar. The ambiance is overwhelming. I do not need to hear any music blaring at 9:00 in the morning.", "author": "Lena R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "I'm not really a coffee person but wanted to try this hip place to see what the fuss is all about. It's a sunny day in SF, so I opt for the iced coffee. It's minty with very smooth blended coffee taste. It's not as sweet as I would expect from a sweet drink which is a big plus. \n\nInstead of use pre-prepped coffee, the brista makes it fresh so I can still taste the warm coffee. Since they do make a cup at a time, there is a little wait for the coffee. I'm sure it's fine for people who really enjoy their coffee. I wish I'm more of a coffee person so I can appreciate all the other specialty coffee that they offer.", "author": "Xing M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "First time visiting Philz.  I usually get my beans from Graffeo, but wanted to try out Philz based on a birthday gift of Philz beans from a co-worker.  I purchased a bag of Silken Splendor as well as a small cup of the same.  I really enjoyed the cup and I'm glad I made a good decision on the purchase.\n\nI look forward to customizing future blends of Silken Splendor with the dark roast beans I get from Graffeo for very special coffee experiences.", "author": "Bernie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-29", "description": "ORDER AHEAD AND SKIP THE LINE!!!\n\nI repeat. Order ahead. There is a Philz Coffee, on Market Street, in Fi-Di.... what else do you expect? The lines are always out the door and you can easily spend half an hour here ( good excuse to take that extra long coffee break?) \n\nThe line moves pretty quickly. It's just your typical Philz Coffee shop. For those who haven't been here before, I recommend the Mint Mojito ( Sweet & Creamy)! If you're feeling a little less basic then get the Ecstatic (Sweet & Creamy), Tesora and Philtered Soul!", "author": "Tram N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "The mint mojito coffee is amazing, so refreshing, can't even taste the coffee but definitely feel the caffeine. Great for a warm day in SF!", "author": "Ranita G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "Finally tried Philz for the first time after hearing so much about them! I had a mint mojito iced coffee and it was AMAZING!!! The only downside is that I don't work or live near a Philz and it will probably be awhile before I will have a cup again. :(\n\nI really like that there were \"instructions\" for first timers on their chalkboard. Super helpful! =)\n\nAlso, the staff were all really friendly!", "author": "Sylvia V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-16", "description": "This is between 3 and 4 stars. Philz is good, but it's still overrated. Bay Areans worship it like it's the second coming. If it wasn't for its frou-frou hipster pretensions, we wouldn't love it so much. \n\nAnyway, it was nice the last time I came here because an employee passed out free pastries for everybody. All businesses should do this instead of throwing out pastries at the end of the day.", "author": "Alecia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-12", "description": "Good and unique variety of flavors. \"So Good\" and \"Philtered Soul\" are must try for a fan of light/medium roast coffee. Like the fact that they brew fresh and one cup at a time as per your preference of sugar & cream.", "author": "Avinash B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-11", "description": "Everything is always over hyped in the US and Philz Coffee is another example.\n\nIt's really over priced for what it is and seriously nothing special. The ordering process is a bit odd - you place your order with the barista then go into another line to pay then you wait again to collect your coffee. The last step was noticeably long - especially as the place wasn't at its peak busy period. \n\nI have no idea why everyone is so excited about Philz. The quality isn't that good and coffee didn't taste that original. Too much hype not enough delivery. Won't be going again.", "author": "Darryl I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-29", "description": "I'm a newb when it comes to Philz but let me just say, it's seems very overwhelming when you walk in and there is a huge listing of all the different coffees and roasts they have. I was so confused on how to order and was thankful I had an experienced Philz drinker next to me to help me order. I ended up with a ginger snap soy latte (i think that is what it was) but it was iced.  I didn't know if I could ask for it warm or not so I just didn't ask. The baristas work pretty fast and you don't pay them directly, you have to go all the way to the right to pay quickly and then wait for your coffee. After I paid, I realized that they also sold food but it was past the cashier so I didn't see it until after. I think the layout should be flipped so you can choose your food and pay prior to waiting for your coffee, it just makes more sense to my brain that way. \n\nThe coffee was okay but I don't think I'll brave the lines again to grab a brew, I'd rather head to Coffee Cultures.", "author": "Constance D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "Love the handmade style.  Got my Blue Mountain mocha and rescued my morning.  Friendly service and great coffee.", "author": "Troy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-18", "description": "This review is solely based off of the awful customer service.\nI LOVE philz coffee but the barista was the rudest person ever.\nThere was nobody in line and no drinks being made so I walked up to the counter and she said I have to wait at ropes until I was called. Total bitch just wanted to act like she had some authority.", "author": "Kathleen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "So we all KNOW Philz is the best in the Bay. But did you know that the staff down on Front st. are the best baristas in the Bay? I come here every morning before work to prep and enjoy some Dancing Water. Yes, I originally came for the coffee, but these days I 100% come from the staff. EVERYONE at this location is made of glitters and gold. They are so fast and work so hard, the line is almost always out the door and they manage to crush through it in a matter of minutes. I never have to wait more than 5 for my coffee. They move so fast that most times I don't even have time to unplug my headphones and I miss them calling my order. (sorry guys!) \n\nI am literally obsessed with this location and all the people here that make it the absolute best way to start my day. I am loyal to Philz because of the experience of this store. SHOUT OUT to all the homies (there are too many of you to name, but you know who you are!) that put on the best pandora stations, make the perfect cup of coffee and helped me clean up that one time I spilled an entire Ether in my lap. Ya'll are the BEST. Brandon, your store is straight fire and I commend you for managing the sweetest and hardest working barista team in town. \n\nI do have one complaint, YO PHILZ, LET ME TIP ON MY CARD because these cats deserve it and should be rewarded for their epic customer services. That is all. Cheers!", "author": "Jenna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "First Philz coffee shop in FiDi!\n\nI'm glad that they are growing and making their coffee readily available where it needs to be.\n\nColorful and contemporary furniture here.  \n\nThey have online ordering so you can pick up your coffee instead of waiting in a long line.\n\nClassic mint Mojito is in my books. Do order up their strong coffee if you need a waker upper!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "Wooo-hoo-hooooooo.... finally, a full store front Philz in FiDi.\n\nWelp, you can't miss it. There's *always* a line, out the door. Expect to wait 15-20 minutes. It's not so bad when you have a co-worker to chat with while you wait. They offer the OrderAhead app, but I just don't think it's the same as having it fresh and *earning* it with a 15-20 minute wait - hah! I will say that the baristas here have made my drink 100% perfect everytime. Can't say that about every store...\n\nDefinitely visit this location when you're not in a rush.\n\nOh! And for those who have never tried Philz and coffee inexperienced...I highly recommended:\nHot drink - tesora, philz way\nCold drink - mint mojito, philz way", "author": "Stephanie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-03", "description": "Excellent hand crafted coffee made to order. I like the breakdown of selections categorized by dark, medium, light roast or decaf. The descriptions of the flavors in each coffee listed is very helpful.  Coming here makes me feel adventurous, trying new coffees. There is often a line but it moves pretty fast. You order, pay at the cashier and wait for the Barista to call out your order when it's done. They put the sugar and cream in for you which is tricky because I've had my coffee re-made before when there was too much cream. And sometimes it's so noisy that it's hard to hear your drink being called out when it's ready. Otherwise it's good gourmet coffee. $3 for a small and $4 for a large.", "author": "Lucy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "Philz mint mojito iced coffee: the hype is real! I was looking for a Philz coffee during our walk from Chinatown to Union Square. My GPS steered me wrong so we settled for a nice café nearby. It wasn't until we continued our walk a block down that Philz fell into our laps. I didn't care if I already got my coffee fix. There was only a couple of people ahead of me Saturday afternoon, but my order took a bit to make, but I could tell they were doing what they needed to do. Staff were all friendly and efficient. I actually am a tea drinker and don't like alcoholic mint mojitos but their mint mojito iced coffee was very good. Def a must try!", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Philz Coffee on Front St. It's lit. \n\nI enjoyed a mint mojito today, then spent the later afternoon doing work here. 4PM-6PM the music was LIT. Kudos to whoever is in charge of the music selection. Financial district just got a lot more lively :D Drake, Khelani, etc. :)", "author": "Lillian N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "As a coffee enthusiast this is one of my favorite places. The philtered soul is my go to roast. \n\nAt all the locations all the workers are extremely friendly. They always let me taste out my drink to make Sure it's roasted to perfection.", "author": "Nishat K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "I love Philz Coffee!\n\nThe Iced Mint Mojito and the Jamaican Blue Mountain Hot/Iced are my favorite!\n\nThe service is excellent despite the long-ass lines.  I usually get a Health Cookie  to go with my coffee .  This is the coffee I crave for casual friend meet ups AND Sunday afternoons with boyfriend(s).", "author": "Fawn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "I'm not a big fan of coffee and I'm not a big fan of mint, so it took a lot to finally convince me to try the Mint Mojito. But I finally gave in. And it was delicious!! Definitely not super minty like I was expecting. It's a subtle yet refreshing hint of mint flavor, and it goes surprisingly well with the coffee. They add in ice so initially, it's cold at the top and hot at the bottom--a very interesting mix of both temperatures and flavors. I love how they get the texture so creamy, and thanks to that subtle hint of mint, it doesn't feel heavy! Level of sweetness can of course be adjusted but mine came out perfectly! Super happy I decided to finally give it a try. Definitely lives up to the hype.", "author": "Ashley Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "this may very well be my favourite downtown location of Philz - i mean sure, it helps that there's a tragically handsome barista that works here every morning i come in, and his smile may or may not make my head want to melt, but that aside ... the coffee is excellent and the service is lightning fast.\n\ndon't be put off if the line is extending outside of the building (as it so often is in the early morning!) as it is quickly worked through by the staff. i keep telling myself i'll work my way down all of their coffees, but i can't quit that philharmonic maaannng. and the coffees with the mint? all ABOUT that life.", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-15", "description": "The line to order is more evident than at other Philz locations. You must walk the length of the entire counter to get to the pay register which is located at the far end on the right. There's little chance of mistakenly going directly there to order for first-timers.\n\nThey ran out of ice when I got there so I got the Philtered Soul instead. While waiting my barista was apologetic and just as my drink was ready they got new ice. She nicely offered to add ice or make my original drink order. If had more time I'd have stayed but was already there for 15-20 mins...next time I will just order ahead and go there and pick up!\n\nReally my second visit as the first visit during early lunch hour had a line out the door, almost passing their outdoor seating section. Even at after 2:30pm expect a wait - this location just opened!\n\nNote the Mechanics Monument (http://www.yelp.com/biz/donahue-labor-statue-mechanics-monument-san-francisco) is right in front. Good spot to stop by.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-14", "description": "They have a mint mojito coffee here which is one of a kind. Its a delicious beverage, though I don't taste as much coffee in it. They have multiple locations, but protip, if you order your drink in advance, you don't have to wait in line with the masses.", "author": "Leon K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-22", "description": "I am a Philz Phanatic. \n\nThis location has saved me from falling asleep during the day. (2:30 feeling). You can use Order Ahead to place your order in advance and bypass the line to grab your cup of deliciousness. It's like having a Fast Pass at Disneyland.\n\nIf you haven't tried Philz Coffee before, just let your barista know and they will hook you up.", "author": "Melissa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-16", "description": "Third time trying Philz Coffee and got the mint mojito iced coffee. I opted for skim milk this time and the coffee was definitely not as creamy as it was before when I stayed true to their recipe. The large coffee was $5.50, which is kind of expensive. Even the line was kind of long, I still think the coffee was worth the hype.  If this is your first time in SF, you should definitely check it out!", "author": "Ariel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "Similar to the 4th and King Philz location, this one is bigger, has a longer line to order, and more room inside to wait for your drink.  Sometimes it gets so backed up, there's even a line to pay for your drink too.  \n\nIf possible, make sure to bring your own cup as you pay the price of a small if it's a large sized cup.  What a deal right?  I found out by accident the other day.  \n\nThey still don't have a way to identify what coffee they are sold out of.  I've always wanted to try the Jamaican Blue Mountain but they never have any when I go.  How hard is it to just remove those selections or even put a sign in the ordering area?  \n\nOtherwise, it's convenient for BART and MUNI riders going to work both north and south of Market.", "author": "Ben H L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-20", "description": "I'm an espresso drinker, but I'd heard a lot about Philz coffee and was eager to try out the new spot that opened on Front and Market in the Financial District.\n\nI expected it be be similar to Peet's or Blue Bottle, but it's not! They only serve drop coffee. If you're a drip coffee fan you'll love this place as you can select the bean that will be individually brewed for you. If you're an espresso drinker you'll most likely be disappointed as its drip coffee!!\n\nThe first time I went I had a decent cup of coffee, the next two times were disappointing so I won't be back. The lines are crazy long and I wouldn't stand in one for drip coffee!", "author": "Emily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "Their mint mojito ice coffee is great, I would definitely recommend ! Staff are really friendly and service is quick! A huge selection of coffees!", "author": "Anne-Marie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "This doesn't really change how I feel about Philz, but I love the big space and the large amount of seating that's available.  They sell Proper Food salads, and have a great assortment of pastries.  It gets REALLY loud here when there's a ton of people, so hearing your order may definitely be challenging.  I still am mediocre on Philz, but this was encouraging to see in the FiDi.", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "Can not resist the mocha tesora.  This is a particularly chic Philz...the polar opposite of the 24th st. Philz that I usually frequent.  Lots of seating outside..Quite pleasant on a sunny Saturday morning on the way to the Ferry Building farmer's market.", "author": "Bleep S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "Your good old Philz. What more could be said? Great new large FiDi location, but come at any sane hour and you'll have to battle the yuppies for a spot in line and wait for your Cup of Joe here.\n\nSure I'd say it is worth it. It's good. It's a cup. We're all addicted, but really if there aren't a lot of baristas and there is no line ... beware. A double edged sword really, but if they're quiet I just don't think the product ends up being made in a manner that's Philz worthy. \n\nCase in point, I had to fulfill my craving near closing time and the roast was great for that first sip (isn't it always?) because of the rich crema on top, but then after that the true character came out. Burnt, over cooked, no attention paid to because they were roasting me a cup and closing + cleaning at the same time. Just don't do it. Don't serve me a cup of average Joe. Give me a cup of Philz Joe every time please.\n\nI'll make sure not to come at any abnormal and / or less attentaive hour. Thanks for the new location and bright new sign in the new coffee war grounds territory!", "author": "Joseph L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "At first I thought it was gimmick. But I got instantly hooked. Each one of your orders get individually brewed for your liking is pretty awesome. Yeah get the feeling of being spoiled but that's the idea.\n\nThe price is on the expensive side but Starbucks and Peets are similar in price and they don't offer the same type of personal service.\n\nAfter drinking all the coffee flavors, my favorite is Philtered Soul, extra cream, extra sweet. The hazelnut flavor is a nice soft touch to the palette. \n\nI'm a fan.", "author": "Aaron P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "Five stars all the way ... If you are from out of town, go there every day you are in SFO!\n\nThey brew each cup of coffee fresh for you, and there are so many varieties to choose from. I selected a mint mojito iced coffee , half sweet, vanilla soymilk. You get your own individual barista, and when she handed me the drink, she encouraged me to try and make sure I liked it. I did try it and said I would like it a little bit more sweet, and she immediately accommodated me. They even put a sprig of mint in each coffee.  It is probably the most unique and delicious cup of coffee I have ever had.\n\nMy partner had a light roast strong coffee with soymilk. When he got up to the bar, he heard another person order almond milk, and said out loud that he wished he would've known they had it. Immediately, the barista offered to make his drink again from scratch with almond milk. I can't say that's ever happened to me in a coffee shop before!  And she once again made sure he tasted it and liked it before letting us go.\n\nEveryone was all smiles, and the cashier also asked if we were satisfied with our coffees.\n\nUsually, independent, high-end coffee shops have snooty people working, and some people feel that Starbucks, although their help is friendly, is a too much of a machine. You don't often find outstanding coffee and outstanding service in one place.  Bravo, Philz!!", "author": "Brian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "I like my coffee as black as my soul. \n\nI stop by at Philz probably 5x a week before heading to the office in the morning - I'll admit, I have a coffee addiction, okay!  My go to cup is Philtered Soul sometimes black, sometimes sweet and creamy. Most of the baristas know how to make my drink fucking delicious and I love the chill vibes they have going on. Everyone that I've chatted there are super chill and friendly, and that's why I keep coming back. Despite the long lines in the morning, it's totally worth it. \n\nJust don't be that douchebag that complains that you're running late and have a meeting to catch and that the long line is holding you back. No one gives a fuck, so calm your shit.", "author": "Robin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "Great store. Nice management. It would get 5 stars from me if the ordered ahead drinks were made in order. It sucks coming to pickup my drink that's not ready at the one but others that have a pickup time later than mine are done. What's the point of me ordering ahead when I can just wait in line and get a drink faster.", "author": "Sierra R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-26", "description": "Let me begin--I realize everyone has an idea of what makes their coffee perfect. For me, with a hot drink, I imagine milk that is frothy all the way to the bottom, married with a perfectly pulled espresso, with some sweetness of chocolate or hazelnut or what have you. In an iced drink, I picture a chilled drink that sweats around the clear cup and keeps your hands cool while I sip for hours. \n\nNow, this is my description of Philz Signature Iced Coffee mocha drink:\n\nHot. It's as if they imagined the pour-over to be the perfect vehicle for making coffee and just went overboard. Basically, what I have here is a hot pour over with chocolate. Ok, it's luke-warm now that the ice melted. I'm not sure why they asked what kind of milk I wanted in there because the drink is so overwhelmingly COFFEE that the only reason I know chocolate is in there is because it's gritty in my mouth. Speaking of what's in my mouth, there are also coffee beans in the drink. \n\nThe barista was completely nice about my order--I began my experience with a Gingersnap iced coffee, which is basically a hot apple cider coffee. Really, it's gross stuff and I'll never go back. Since there are hardly any pictures of the coffee available on here, this is my coffee: \n\nI'm calling it the RoomTemp Mouth Exfoliant.", "author": "S R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-01", "description": "I think Philz is my go-to for coffee when I visit the Bay Area... because Mint Mojito.  This location seemed especially optimized for the business rush. And while the store itself was fairly roomy, there were only a few seating options indoors (but there were some tables and chairs directly outside as an option).", "author": "Eunice G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "Thankful that they opened a Philz in FiDi. When I go to Philz, I usually get there around 8am. The line can vary depending on the day, but I would say the wait is anywhere from 12-20 minutes. Sometimes it can be a bit long, but who can blame them. \n\nThis location does have a pre-order station where you can order ahead from your phone. I looked at it once and the estimated time is about 45 minutes in the morning. If I worked in the area this would be perfect, but since I normally sleep on the Bart I'm never able to get my pre order in :(\n\nI did buy some ground beans there and noticed that this location didn't have their monthly special on lb bags. At their other location they have one type for $14 each month. This gives me an incentive to try their other flavors.", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "I've been to 9 Philz locations in the Bay Area over a 3 week visit. All the locations are fabulous and some of the best coffee, especially Jacob's Wonderbar. \n\nService is top notch and had the great pleasure of being hosted by Mike and Kelly.", "author": "Kison P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "Best coffee hands down! I typically get the silken soul with heavy cream or the Tesora straight up. The barista's are the best and they always make you feel welcome. Not only do they make me the best cup of coffee, they also send me off with their bright smile thank you for being consistent Phil's financial district!", "author": "Rommel Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "Mint Mojito. Every time. breakfast burritos look really good (and were sold out, which I guess is a good sign). Added to the list. Long line but moves really quickly.", "author": "Thielson D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "What a place. I used to frequent this spot with my coworkers when sitting in the office seemed utterly uninspiring. Though I don't go as often anymore, this place has cemented itself into my heart forever. \n\nWhen going on a Philz outing, I suggest you:\n\n* Order whatever drink sounds the most intriguing \n* Sit outside in the Mechanics Monument Plaza\n* Postmates assorted pastries from Mr. Holmes Bakeshop\n* Sample all of said pastries\n* Talk about funny episodes of Broad City\n* Bring a coworker who declines food and drink \n* Contemplate philosophy and what a chair really is\n* Absorb as much Vitamin D as humanly possible \n* Find serenity in the ambient sounds of Market Street\n* Look up to inspire awe and admire the buildings\n\nSavor each sip, one cup at a time, and tell a friend!", "author": "Cecelia Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-31", "description": "The short of it:\n- good coffee\n- nice alternative to mainstream coffee shops\n- order first at the barista then pay at cashier\n- open on Memorial Day!\n- Favs: mint mojito\n\nThe long of it:\nI'm late to the Philz Coffee train, I've been visiting SF and it's never been on my radar until recently. So finally I got to try it out! It feels weird ordering a mint mojito at a coffee shop, but this one is not the alcoholic kind...this is a mint mojito coffee. I was very hesitant to order this, I like mint but I'm always worried that the mint flavor will be overpowering. Upon first sip I was amazed. I loved the flavor! The coffee and mint blended so well...it wasn't like anything I've ever had before and I thought it was very refreshing and addicting. We came on Memorial Day and I was worried it wouldn't be open, but luckily it was and there was no line either. Lots of places to sit as well. Overall, wish I had more time to try more items on the menu, but since it looks like they are expanded more in Socal and especially in the OC I may have the opportunity to try it sooner than later.", "author": "Kristin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "By far the best coffee in San Francisco, and dare I say, the world? I'm not sure where philz gets their coffee, but it tastes much much stronger than your average drip coffee from your home pot or even a chain like Starbucks. \n\nThe Mint Mojito Iced Coffee is unlike anything I've ever tasted--the perfect combination of sweet, creamy, and minty! I get this every time! \n\nThe Ginger Snap iced coffee is similar to a pumpkin spice latte, but the best part is, it's served year-round. --Definitely a must try. \n\nThe normal coffee at Philz is good, and stronger than your average, but in my mind you go to Philz for the Mint Mojito or Gingersnap Coffee... Unlike anything I've ever tasted from a coffee shop, in the very best of ways.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "Yes, there is going to be a long line. \nNo, you won't regret it. \nYes, get the Mint Mojito if you don't know what else to get. \nNo, you won't regret it. \nYes, it is expensive. \nNo, you won't regret it. \nYes, you can order ahead. \nNo, you won't regret it.", "author": "Mayra E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "Finally a Philz in the financial district! This one is just as good as the other locations and even better for now because surprisingly there were no lines when I went in the morning. I'm sure that will change though as soon as more people find out about them opening. (UPDATE: yup lines were out the door the next day)\n\nThey have tables to sit at both inside and outside. The interior is very spacious and nicely decorated. You order from one of the baristas and then pay at the counter and wait for your drink to be called. The service was really friendly and I could tell they were trying to make sure everyone was happy.\n\nI ordered a small mint mojito iced coffee ($4.50). Very sweet and refreshing. It's my favorite drink of all time and definitely lives up to the hype! I highly recommend getting this if you haven't already.", "author": "Linda X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Love this place - it's a destination whenever a location is near. The mint mojito iced coffee is a dream.", "author": "Eileen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "I have gone here the past two mornings, and I must say I AM HAPPY PHILZ IS HERE! I work in the building across the street, and was hesitant to brave the line the first time I came, however this is now my GO TO SPOT. I usually get a jacob's wonderbar, and I was curious about switching it up. The friendly and upbeat barista (i believe her name is Ana)suggested I try the Tesora, as it is their most popular blend. Simply DIVINE! I can't wait to go through the entire menu, and try them all! Welcome Philz! We are stoked you have arrived! Your coffee makes my day THAT much better.\n\nOh yeah-the pastrys are delicious.", "author": "Alicia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-17", "description": "FINALLY!!! :D\n\nI've been here about 5 times in the past week. The fact that it's a 5 minute walk from my office is so, so dangerous. But it makes me so happy. My favorite drinks: ginger snap iced coffee, ecstatic iced coffee, tesora, and the ever-popular mint mojito.\n\nThere's not much seating space in the Philz; it's very much a grab and go type of place for all the office folks nearby. I wish the flow between ordering and paying was a little smoother, since it gets pretty crowded and confusing at the cashier area when you don't know who has paid and who's waiting. Also, note they're only open weekdays.\n\nSide note, they've played some awesome music the few times I've visited, so shoutout to whoever makes those playlists!\n\nI'm soo happy they finally have a location in FiDi now!", "author": "Alyssa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "I love Philz Almond Milk Mint Mojito Iced Coffee because it's really refreshing tasting!  It's best consumed on a hot summer day.", "author": "Alice X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-25", "description": "First time at this location, but since Philz is never in my area I had to get some. At 9am on a Tuesday you can imagine the hustle and bustle in the SF Financial District, Philz was no different. The location is small with limited seating and the line was out the door with anywhere from 15-20 people in line at a time. From this line I knew it must be worth the wait as no other coffee shop had a line this long! However, the baristas worked quickly and all had a smile on their faces even with the huge crowd. For a coffee lover, must say it was def worth the wait!", "author": "Amanda Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-14", "description": "This place is okay. \n\nI only went here because of the hype that was going around. My expectations after trying this place was disappointing. However, I like how the coffee is brewed to each one. I ordered the mint mojito with sweet and creamy in it. It was just okay to me. I felt like my coffee was bit water down though.\n\nOverall the staff was extremely friendly & I really enjoyed the atmosphere.", "author": "Helen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "My friend and I both ordered mint mojito iced coffees for our first times and we really enjoyed it!! I liked how you could taste the mint, sweet, and creamy flavors. The line was out the door and the baristas were extremely busy, but this place is the place to be if you want a different kind of iced coffee! Will definitely be back within the next few days!!", "author": "Juliana P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "I'm a big fan of Philz Coffee, so I was happy to see them expand to the Financial District. The coffee tends to be more dessert-y (kind of like a higher-end Dunkin Donuts), but you can definitely ask for unsweetened or less creamy depending on what you like. It is on the expensive side compared to Starbucks, but they don't charge for extras like almond milk like a lot of other SF coffee shops.\n\nThis is a newer location so it doesn't have the \"hole in the wall\" vibe like the original locations. I recommend using the OrderAhead app to order during the morning rush to skip the wait. Unfortunately this location is weekdays only, but it is open early for those of us who work East Coast hours!", "author": "Connie Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "An amazing selection of coffee choices, great staff (who clearly love their job), and KILLER coffee mojitos. What more could anyone ask for?  We will be back for sure!", "author": "Kaleena G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "It was a rainy Sunday afternoon and I had just had a sandwich at the Ferry Building. I was going to walk back to Union Square, so I figured why not give Philz a try. It was rated so well, after all. While I thought $4.50 for a large coffee was pretty pricey, I was like a kid in a candy store with so many bean choices to choose from. The barista helped me pick a bold roast, and it was really, really good. I had him put a bit of soy milk in it, and with a splenda as well, it was latte-esque. Very good stuff, and will battle with Blue Bottle for my favorite SF based coffee now.", "author": "Rob P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-12", "description": "Philz never fails to get the job done. Their drinks are deeeeeeelicious! My usual is a TESORA or a CHAI but today I thought I'd try something new... An ICED MOCHA TESORA. HOLY CRAP!!! It was YUMMMMAZING!! This is my new favorite drink!! Oh hipster coffee, you are so good.", "author": "Bel W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "Totally fine coffee. Coming from the specialty coffee industry myself, it's just a little odd. It's MUCH better coffee and the processes are better than a Starbucks type, but it's really not truly specialty coffee. The single cup \"pour over\" method they use isn't precise which kind of defeats the reason to do it in the first place. Plus the use of only blends (rather than single origin) isn't the way to bring out the true flavors of coffee. It's a way to make coffee more marketable to more people. Philz does this really well!\n\nAll this to say, go here. Get some good coffee. I bet almost everyone will love this place. Just beware if you're looking for a truly exceptional cup of black coffee.", "author": "Nathan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "Awesome how they opened a place where there's a high population of coffee drinkers.\n\nJust came back from their opening. I got to take a picture with Phil!! Line was super long, almost out to the curb. Got in line and ladies were coming around with free pastries. OMG pastries are so good. Waited about 20 minutes in line. Ordered a Philtered Soul which took about 5-10 minutes. Wanted it iced but I think the guy didn't hear me, sad.\n\nDefinitely will be here for my coffee and pastry fix.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "So excited Philz has finally opened a location in the FiDi. The people here are amazing, the store looks fantastic, and the coffee is amazing as always. I'm sure this store will be great!", "author": "Makenzi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-08", "description": "Nice having a Philz super close to the office now! This new spot had a soft opening today and is about a 5 minute walk from my office to the front door. I still haven't quite found a flavor that I've called in love with, but I tried the New Manhattan today with a small baklava on the side. The baklava was delicious and the coffee was great too although still a bit strong for my particular taste. I know the place isn't officially opened yet, but it was well run and moving the line fairly quickly. I will mention there was a bit of confusion for the waiting part. It might be good if they designated a place for people to wait because after awhile it was turning into a mad house. I will definitely check this place out again especially after they start selling some food items too!", "author": "James R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-03", "description": "I've been to many Philz locations and while Front St. may not be my go-to, just wanted to take the time to give a shout out to Destiny. Super chill barista that is a proud Philadelphia Flyers fan. Rep your your hood girl and keep up the good work in bettering people's days", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "Soft opening to train the baristas today. Service is spectacular and each cup is made just for you!", "author": "Ameera D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-11", "description": "Inconsistently good (and not so good).\n\nI've had, by far, my favorite coffee experience at Philz twice. The coffee tasted like something new and delicious to me:) Not coffee so much as creamy divinity. Totally exceeding my high expectations.\n\nUnfortunately, there is no consistency with that deliciousness. I order the exact same thing (Iced Ecstatic, extra cream no sugar), and another barista will pour the hot water so fast, it floats all the coffee grounds and the coffee comes out tasting more like lightly coffee flavored water. Very disappointing. I'm not too concerned about the $4.50 + tip as I am that I walked over to this place and had something delicious in mind.\n\nI am lucky that my first experience was good. More often than not, I am getting a low end coffee experience, and it seems to be happening more frequently with time. I wonder if their rapid growth and/or general busyness has something to do with their diminishing quality assurance.\n\nI finally gave up on Philz. It's too sad knowing what they are capable of serving only to get served something significantly worse (either because a barista is not properly trained or in a rush).\n\nThank you for those 2 exquisite cups of coffee, Philz :D\n\n\n\n\nP.S. I realize I'm a bit of a coward, as I could probably ask the barista to prep the grounds by lightly wetting them first, letting them sit for a moment, and then pouring the water slowly and evenly over all the grounds, to extract more flavor. They are friendly and nice and would probably try it the way I ask.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "Love this location of Philz. Literally outside the door of the office.\n\nHonestly, I usually dread going to any Philz location because of the long lines. But the lines are there for good reason, the coffee is sooo good!\n\nI've recently learned about OrderAhead, where I can place my order and just pick up my coffee. It's definitely worth it so I don't have to wait in line, typically in the breezy weather since the line stretches out that long. \n\nEveryone is always friendly and there are plenty of tables outside in case you want to enjoy your coffee while people watching!", "author": "Jiki B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-23", "description": "I am no hipster and long lines always intimidated me. However, the proximity to my office had led me here sometimes (and a coworker who will not drink starbucks - what's his problem?).\n\nIf you want to be hip, this is the place to be around 8-10 am and then again around 3-4 pm. Long lines out the door. Perfect to show off your sunglasses, outfits, etc. Of course, catch up with your friends during the long wait is another bonus. We all needed a break!\n\nSeriously, yes, coffee is good here. Very smooth and no bitter after taste like you get with the common brew that makes you want to brush your teeth right after. That's why they invented after-coffee mints, just fyi.\n\nHowever, being the common people that I am a part of, I will continue to go to my usual starbucks (need to earn my stars). Will come here as needed, but so far not a convert yet.\n\nNote to self: Have to try blue bottle just a couple block away...", "author": "July N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "Serioysly the coffee here is worth the wait...Don't come if you don't have the time to drink coffee right. Special thanks to the barista with red hair and fierce makeup who fixed us up!!", "author": "d v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "Philz is a great cheap no frills coffee spot with a ton of coffee selections to pick from. They do everything to order including grinding the beans and doing the drip. You cannot beat fresh coffee, and Philz delivers. The baristas are very friendly, helpful, and happy. Don't come here expecting bar drinks, coffee is all you get. They also have some decent munchies, I really liked the Clover yoghurt!", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-13", "description": "Surprisingly, this Philz Coffee wasn't crowded at all during lunch time! There was literally no like when I entered which was super convenient. Ordered a coffee to keep me up for work. Waited about a minute until they called my name and took my coffee. Customer service was average. I expected them to do why they needed to do.\n\nWould I come back here? Maybe, just because there are other places to get your coffee.", "author": "Aj C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "Came in at 5am in the morning for a dark roast, which was as advertised. Friendly, helpful service, but ordering process is kinda confusing. Seats aren't too comfortable for lingering around, so it loses a star.", "author": "Tian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-11", "description": "I must say I walked into to Philz thinking I was going to be let down by another hyped up place. First, you order from your Baristas who are frantically working with coffee beans trying to start the order of the person before you. Their slogan is \"one cup at a time\" so you would think brewing one cup of coffee at a time would take some time....before I even paid for my drink my my \"ecstatic iced coffee medium medium\" was ready! I let the taste of fresh coffee bit my lips and was instantly hooked to this place. \n\nIt isn't only their coffee that makes this place one of a kind, it is the staff who is very knowledgeable about their coffee while at the same time not making you feel like it's a chore to take your order. \n\nSad to say it but I will probably be leaving Starbucks behind. I refuse to continue paying 4+ dollars on burnt tasting Starbucks coffee when I can pay 4 flat and get some great tasting coffee that gets the job done! Thanks for opening in the FiDi Philz!", "author": "Charles D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "Ugh, hate the wait... still the Coffee just is perfect.", "author": "Greg F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "I must say, I absolutely hate hype of all kinds! But Philz...   \n...\nwell... \nit just...\n...\nlives up to the hype. \n\nBeware of the bizarre combination of techies and hipsters (and i dislike them both) that philz up this place. The line is always out the door and around the corner, but the coffee??? the coffee??? Is wonderful!!! Who would have thunk' it... Drip coffee has been revived and remixed. They serve drip all sorts of ways. With flavors that consist of: mint, honey, brown sugar, cardamom, nuts, chocolate, blueberry, hazelnut, plum, maple, herbs, caramel, beets (ack!!!), lemon, citrus, cherry, raisin, grapefruit... and the list goes on. So don't let the menu overwhelm you. It overwhelmed me my first time. For me, i finally found my sweet spot with the Philtered Soul that has a hint of hazelnut, cocoa, and syrup. Add a little bit of brown sugar to it and those flavors come right out. \n\nYeah, yeah, yeah. I know it can seem a bit froufrou. And I wouldn't advise on spending $4 on a regular drip coffee. So if you're the plain ole coffee type of person, then I recommend that you stick with your Peet's, anti-corporation local spot, or (I dare not mention the devil's company that's taking over the world with their own brand of GMOs) coffee franchise that originated in Seattle, Washington.  \n\nIt you're too lazy to doctor your own drip coffee, and don't mind attempting some interesting flavors, and don't mind spending and extra buck or maybe two, then you should try Philz. \n\nNow... this Philz, in particular has a pretty amazing staff. They're friendly and efficient. I feel bad when they have to scream to get some techie noob with his/her earbuds jammed in their ears listening to some new age blah. So check out the menu and PAY ATTENTION to your baristas. It helps the nearly infinite line move a bit faster. \n\nThe ambiance is unique for a coffee shop. Especially a chain coffee shop. It has a feel of your local spot, with the exception of the lengthy lines and the 3 to 5 baristas making 3 to 5 cups at a time. From what I've read/heard, the sandwiches aren't that bad... as long as you don't mind the gentrified prices.\n\nAll and all from what I've seen in my once a week experience for the last few months, they get a nine on a scale from one to ten. 4 and a half stars, but I'll round up since the staff is so friendly. I find that amazing since they're dealing with grumpy faces all morning long. \n\nSummary:\n\nGreat coffee \nGreat staff\nGreat ambiance\nLong lines (order ahead)\nFast pace environment\nHipsters and hype feeders will love the place.", "author": "Stephen G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "This particular storefront is facing Market St. in a little plaza near front, so don't let the address fool you. It's a bit space for a Philz and very lively, especially during the week. Like mot Philz shops popping up, this one is fairly new and they really hustle here. \n\nIf you are visiting SF, staying or coming downtown and haven't had the Philz experience, I would highly recommend trying it out. Hopefully you like your coffee STRONG. If not, they have great teas and pastries, too.\n\nThe product is always really good. The service is generally pretty good, but I have noticed that the shine of the initial opening when everyone was bright, friendly and on top of everything has worn off a little. It can be harder to make eye contact with the baristas and they have forgotten a couple of my orders recently and I've had to remind someone about it. Could be the Market St.vibe is rubbing off on them.\n\nStill, I come here at least once every week, and I'll keep coming back.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "What can I say that hasn't been said already? This place is my go-to for when I need a pick-me-up or when I want to start my day off with a huge smile on my face or when I want my taste buds to have a happy dance in my mouth. I love PhilZ.\n\nI love their mint mojito - hot OR cold. \nI love the staff! They're always so helpful and friendly! \nI love everything about this place!", "author": "Stacy V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-01", "description": "The coffee is classic Philz. Philz coffee/beverages are great but I just wish there was more seating at this location.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "I am so so happy with this new location (my wallet is not). \n\nPros:\n+amazingly nice staff \n+a lot of seating inside and outside \n+coffee quality is still spectacular - 0 complaints \n\nCons:\n+THE LINES - I work right across the street and NO MATTER WHAT, I will wait 15 - 20 minutes to order, another 5-10 to pay and get my drink. Quite a time commitment to get my favorite cup of coffee, but I'm never sorry that I waited. Slump times usually around 12 and 4pm, according to the barista (not sure I believe it because I have never not seen a line trailing out the door). \n+Music is sometimes reallyyy loud so some baristas have to literally yell your name when your drink is ready (not the typical philz ambiance I feel). \n\nI will be back (tomorrow).", "author": "Anu P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "Much better than Starbucks and peets. Choosing a coffee can be daunting but I just picked anything and it's usually good and interesting.  A word of warning - a lot of drinks have minty taste because it comes with mint leaves ( or not sure what it is ) so if you don't like mint,ask first before ordering", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "It is hard not to relax at Philz. Comfortable environment, great service and superb location are among a host of strengths to local neighborhood.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-31", "description": "This downtown location was always packed, at least every time I walked by. However they can handle the crowd and in no time I had my favorite Mint Mojito. Great location since I usually stay in that area when in the city.\n\nCheers", "author": "Robert A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-01", "description": "I Love Philz coffee! \n\nTheir baristas are always so smiling and ready to get you the drink you need in the morning. They are very friendly, always smiling and takes the time to ask you how you are doing. Love the experience!\n\nTheir coffee is out of this world. Here are my few favorites:\n\n1. Mint Mojito iced coffee (it has a fresh mint on top. Very unique and refreshing)\n2. Ecstatic iced coffee (you can request it to be served luke warm instead of iced. They can't do hot)\n3. Silken Splendor hot coffee (love it!)\n4. Philharmonic (Love it! It comes with a mint on the top and the cardamom flavor is awesome. Served hot.)\n5. New Manhattan (I tried it for the first time recently and wasn't a big fan)\n\nThey usually ask you the amount of ice/sugar/creme so you can get it however you like it. \n\nI have tried their spinach croissant and it was delicious!", "author": "Hiral P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "So happy I can order ahead especially when you work in this area. I always get an iced ecstatic extra sweet, extra creamy.. or on some days I get the philtered soul, & the dancing waters!", "author": "Erika-Kelly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "I'm torn between a 3.5 and a 4 star rating. On one hand this was one of the best cups of coffee I've ever had (Jacob's Wonderbar), the barista was friendly and showed me how things worked as it was my first time, but the line moves incredibly slow and $4.50 is an awful lot to pay for coffee. I most likely will return, but not very often and not anytime soon.", "author": "Monique J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-14", "description": "I usually have a pleasant experience at this Philz as I come here every morning on a daily basis, but this morning was the worst. I ordered an ecstatic, the barista couldn't decipher what drinks were what on the bar so he took a straw stuck it in my drink pulled it out and took a taste. He then grimaced and asked me how could I drink my coffee that way, that's disgusting.  I was very upset at the fact that he tasted my drink then insulted me by how I ordered my drink. I was mortified and will likely stop coming to this Philz.", "author": "Cat L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "Amazing selection of drinks! Been dying to try it out, and when I finally did, it did not disappoint. I got the mint mojito iced coffee, and it tasted so good! The mint wasn't too overpowering, but it gave a little kick that made it that much better!", "author": "Shawlien K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-06", "description": "Had to try this place out to see if it lives up to all the hype I've heard...\n\nWhat did I think?... Eh. \n\nI am a big coffee drinker; have a cup every morning. I usually hit up one of the other chains in the area, but this place always has a line out the door in the mornings, so I thought, \"This place must be good!\" One morning when I got off of Bart, I noticed the line was short, so I took advantage and tried it out.\n\nFirstly, it was very confusing as to how you're supposed to order and receive your drink. It's not very intuitive to a new customer, but thankfully I got the gist. I ordered randomly from the list; I have no idea which coffee was good because everyone was only raving about the mojito drink on yelp. Since I'm not big on sugary drinks, I was forced to go out on a limb. \n\nThe coffee was honestly like mud. It was so thick and bitter. This is coming from someone who typically drinks coffee with a teeny bit of milk, almost black. I didn't even finish half of my small cup. Waste of $4. \n\nTheir pastries were very expensive too. The ginger scone was obnoxiously sweet and I didn't finish that either. \n\nOverall, for spending more than $7 on coffee and a scone, I felt genuinely ripped off. It wasn't the best coffee I've ever had, or even coffee that I would try again; the price is just too high for sludge.\n\nMeh. I've had better.", "author": "Kelly E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "What's good Philz its your boy Tony B. Thanks for being one of the few coffee places open early in the financial district. I'm in the area a few times a week super early to take care of a few things. So you need a good coffee to keep your day going. Some days its a wait but since i'm usually and early bird i walk right up and place my order. The staff here is always amazing very chipper in the am. Just like every philz you get the order and then pay and wait for your drink to be called. Simple rules to remember it helps make the lines run smooth. Once you hear them call your drink you taste it to see if it's perfect 99.9 times it is and you move on. I love coming here for the great Mint Mojito. Or i will mix it up and get the so good iced sweet and creamy. Oh yeah  get the coffee of the month for my office.I take back a bag of beans and grind them for my crew. So much easier then trying to bring back a bunch of coffee . If you never had Philz coffee i feel bad for you. Stop in for a treat you won't regret it.", "author": "Tony B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "Mint Mojito Coffee is a must! Worth every penny!\n\nPs. Have it creamed instead of sugar or cream with sugar.", "author": "Vousmevoyez -."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "Love love love Philz Coffee!!! During my stay in San Francisco I literally had it everyday. I got the Oatmeal Cookie (sweet and creamy), it's on their secret menu. A must try! The baristas were very nice and accommodating as well. Very much a San Francisco vibe. The cafe itself was very nicely decorated as well.", "author": "Brittany R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-16", "description": "I need to start this review but saying that I LOVE Philz coffee, and seriously seek it out often. Today's experience though made me reconsider returning to this location, even though it's BRAND new and super close to my office. Disclaimer: I have not had my morning coffee yet.\n\nI ordered my usual (Ambrosia, low fat, with light sugar), and took a sip, thinking hmm, this isn't what I usually get, I'll go double check with the barista. I confirmed that there was in fact milk in there, and then she said, \"I put in low fat/2% milk.\" I let her know (politely of course) that I was under the impression that low fat was the mix of cream and non-fat milk (picked up this pro tip from the Philz Truck on Sansome - 5 stars), and she said \"oh...you need to order low fat VERSION....not just low fat.\" Ok, I'm sorry...honest mistake. I was a barista once too, and I would always offer to remake the drink if the customer wasn't happy. Instead, she just added another splash of the same milk to the now overflowing (not to mention HOT) drink, which got all over my hands when I tried to pick it up.  \n\nThe coffee still didn't hit the spot, and I ended up tossing it. Which is sad!\n\nI'm over you, Front Street Philz.", "author": "Laura H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-24", "description": "My 1 star is for this location only. I'm usually a big fan of philz but this location really needs to work on a few things. \n\nThere used to be long lines at this location, and maybe other patrons feels the same way that I do--because it's definitely not as busy as it used to be. \n\nThe baristas are not as friendly as the other locations, but I still came here because I thought the orderahead app was convenient. They messed up my order numerous times and I still came back (is the mint mojito just a mojito coffee if it was missing the mint?) But after having to ditch my order because it still wasnt ready 15 minutes after the stated pick up time. I finally decided to say Byeee Felcia. Bye.", "author": "Carmen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "For this location, the line is always long but the service remains excellent with their personable, cheery, chill baristas. If I'm in a pinch I'll use the Order Ahead app and pick up my drink after lunch to crush the oncoming food coma. \n\nEcstatic Iced Coffee and pretty much every medium roast blend is epic. I am a Philz coffee addict and I don't even care if its trendy or whatever. It's loved for a reason. So damn good!\n\nFinal note, be ready to stay wide-eyed till 1AM - crazy, long-lasting caffeine kick.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-21", "description": "When I first came here, it was so good that I had to come back and try all the flavors. I didn't think the Tesoro was anything special, but the Ginger Snap and Mint Mojito are truly amazing. I prefer them hot, but they come Iced by default. I also enjoy the Ecstatic and the Hazelnut as well. \n\nHere's the catch, after coming here everyday for about 2 weeks, i had two bad ones in a row. No problem, I'll take a break, one week later I went back and it was still terrible. Even after adding another spoonful of sugar it was still very bitter (it was the mint mojito too). I'm not sure what happened but my last 3 visits have been misses. I'm hesitant to go back now for fear it won't be good for the 4th time in a row, but the times they got it right it was definitely a 5 star place.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-13", "description": "An hour before closing -- approached the barista-- she told me to step back in line and wait to be called -- waited 5 minutes with no one in front of me -- also note that on Sunday's they really start locking up and stop taking orders just before 2:30 -- so they could all be out by 3 -- bomb coffee though . Canopy of heaven with muddled mint -- large . So good", "author": "Alexander T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "Came here 3 days after their grand opening and of course the line was out the door. There has been a lot of hub bub in anticipation of their opening. I'm personally not a coffee drinker (blasphemy!) so I ordered the hot chocolate and just asked them to add some mint leaves in it and it was delicious. The chocolate wasn't syrupy or crappy tasting, it was obviously some quality stuff. \n\nAnd given how long the line is, the wait was actually  not half bad. The staff there were super efficient. They were friendly, fast, and got shit done. They even had a person at the beginning of the line guiding you to the next barista as soon as they are free. No time wasted here!\n\nOh and the best part, you can order ahead and pick it up. If you work around the area, download the EAT24 app and you can order and pay on your phone, just stroll on by, pick it up, and laugh at all the other people in line. done and done.", "author": "Krystal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "Great iced coffee (was fun playing compare & contrast with Blue Bottle) and the bacon and cheddar scones were amazing. Seriously, buy like three or four of those if you can.\n\nThe iced coffee has a bit of bitterness (which I kinda like) compared to the super smooth iced at BB. Wish I remembered the name of the iced I got, but it was one of their specialities.\n\nThere was a protest outside this location on one day we went by, hopefully they are treating construction workers fairly now (??). Not sure what that was all about.", "author": "Greg M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "love Philz in general, i have an affinity for their Mint Mojito coffee :) i treat myself to it (sweet & creamy) at the end of the week if i get the chance. i'm never able to get into this location during the work week, in the mornings, the line drags out the door and into the (smelly) square that the storefront faces. but, if i'm in SoMA during the weekend, i drop by and grab a cup. i just wish the mint were served with less ice and more of the actual drink.", "author": "Meryam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "Mint Mojito Coffee! Amazing and of my favorite coffees I've ever had the pleasure of trying! I wish this location was open later but I'm just glad I got exactly what I wanted. No espressos, cappucinos or lattes here. Just an array coffees from different regions around the world. The staff was also extremely helpful in helping the boyfriend decide on his afternoon kick as well. Can't wait to go back to san francisco just for this!", "author": "Linda N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-14", "description": "I love Philz really...my whole family does. But the entire organization needs a lesson in feng shui...does anyone ever really know where to order/buy the coffee?  Always a mess. This place is even worse. I walked 20min from my workplace at a brisk pace to arrive 10min before closing. I arrived and the door was locked! I looked in and a server mouthed \"we're closed\"...I looked at my watch, I looked at my phone...still 10min early! Wtf? \nThis place should be 5 stars based on the product, but jumps way down to 3 for multiple subpar experiences... Get on the stick! Yr now sitting just a half a star above the tenderloin Starbucks!!!", "author": "tim s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "The best coffee in the Bay Area hands down. Try the Mint Mojito or the Silken Splendor.", "author": "Margaret A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "They have the best freaking pastry ever!!!! Their plain Kouign is the best pastry I've ever tasted.  Have it slightly heated.\n\nRemember the first time you ever ate a warm Krispy Kreme donut fresh from their store...Remember how it melted in your mouth...Well this kicks it and it's mom's butt.  It's a perfect blend of sugar melted in butter held together by some pastry.\n\nTheir coffee is great too from what I can see and smell.  I only like Vietnamese Cafe Su Da, so until they make that, I can't rave about it.  For now, I'll stick with the pastries.\n\nTry the plain Kouign....you will love it.", "author": "Edward M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "Their mint mojito is the perfect beverage and now it is super close to work. I managed to get in the soft opening and got a free coffee. Yum. Their official opening date is June 9 2015.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "I'm not huge on drinking coffee or any type of barista! But I was recommend this place by a friend and was not disappointed. Everyone seem generally happy working there and was really nice. I got the mint mojito ice coffee as suggested by everyone on yelp. It was defiantly refreshing and creamy, I would go back to philz when I'm back in the bay!!", "author": "Hien N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "The customer service here is great! They're so nice. I usually get an ecstatic medium medium and I even came back for a second round after my audition. Nice place! They've got so much traffic in this one - so if you're bringing a laptop ... Be prepared to sit outside.", "author": "Marevie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "Was in SF visiting for a few days and this was a recommended place to visit! I tried their iced mojito coffee and it was a refreshing change from the regular flavored iced coffees one gets at any other coffee place!\n\nCustomer service is impeccable! I ordered a small iced mojito coffee, they gave me a large because I waited really long for it. And they gave me another one (plus a coupon for a next free drink) because halfway through my first one I discovered a strand of hair in mine! Thank you!!!\n\nThe I sat around and people watched. Could've done it all day in that wonderful ambience :)", "author": "Tammy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "They have the best coffee and if you like iced coffee you have to try the mint mojito ice coffee.", "author": "Latrina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "Great coffee. I go here every time I'm in San Francisco because of the atmosphere and the hand poured coffee. They have great flavored coffees and their iced coffee is my favorite.", "author": "chad w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "I had heard about Philz Coffee and their famous Mint Mojito Iced Coffee.  Happened to be in San Francisco for work and stopped by and boy it lived up to the expectations!  The service was also phenomenal!  Staff was super friendly.  I loved the minty, creamy flavor and will definitely be back for more next time I'm in town.  They're expanding and coming to DC as well - can't wait!", "author": "Cindy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "Easily the best coffee in the Bay Area! Every location has friendly, fun staff who make an amazing cup of coffee. Is there a wait, of course, but that just means you're not the only one wanting a cup of awesomeness that day. Chill out, wait in line, and get your coffee euphoria on with everyone else. If you want a shorter wait with a mediocre cup of coffee, then attend a Starbucks with the other corporate lemmings!", "author": "Bradley V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Philz has some of the best coffee I've ever tasted. I was surprised to see no espresso machine behind the counter. I will say I was a bit confused thinking it was all just drip coffee... but they apparently specialize in pour over coffees (which in general are great already, but mix pour overs with their amazing coffee bean blends... PERFECTION.) \n\nI highly recommend this place for all you coffee lovers out there. \n\nCame in this morning looking for a good cup of coffee & left overly satisfied. Well done Philz. Well done. \n\nPs. Code 33 is the way to go. It won't disappoint.", "author": "Madeline G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "Favorite coffee, hands down.  So glad they added a brick and mortar location in FiDi.  Hope they add more locations, as the line is always ridiculous, regardless of the time of day you go it seems.  Don't get me wrong - it's worth the wait...  But I'd probably stop in more often if I knew it was a shorter wait-time...particularly during the work week.", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "got to have Philz when your out here. always consistently good and wonderful workers.", "author": "Jay M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-10", "description": "Loved the coffee. Hate the process.  A long line to order then, Another long line to pay.\n\nHad the Ecastic iced coffe, the mint iced coffee and the Ether hot coffee.\n\nNext time I'll know to say small iced Ecastic medium cream no sweet, cause I wasn't sure when ordering what to do.\n\nToday at about 10 am on a Saturday, the line was only about ten deep.  I can't imagine what it's like on a week day when the line is around the corner.", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "My wife and I were on our way to union square when we found this gem. We're not from the city so we had never heard of Phil'z, but are we glad we walked in! This place is excellent. The atmosphere is warm and clean and the workers are extremely helpful and friendly. The hot chocolate is DELICIOUS and I'm sure all of the food there is superb!", "author": "Alex L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-10", "description": "Delicious coffee. Had the iced mint mojito and it did not disappoint, definitely a once in a while treat and not an everyday coffee. Wish we had Philz on the East Coast.", "author": "Cara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "The Mint Mojito was bomb!! The Barista was awesome, welcoming, and explained everything with a smile. I didn't feel rushed it felt relaxed and laid back.", "author": "Denette C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-21", "description": "Been going to Philz for years and this location is so inconsistent. Today alone I had my coffee made twice because each time it was warm water and they tried to explain to me it's because of using cream (I've been using creamer for years). If your coffee isn't burning your mouth then something is wrong and at $5 a cup I would expect a GOOD cup of coffee. When using order ahead it's even worse you never know if it will be on time. Sometimes they make it about 10-15 minute in advance which at that point it's cold or they make it 10 late. \n\nThe store manager is really nice, however this review was overdue.", "author": "Fara A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-24", "description": "No sense of urgency which is really disappointing of a business located in the financial district. The baristas continuously looked over at the building line without saying anything, no indication of when they'll be taking the orders. Very disappointing as this was my first time testing out this location. I'd always go to the one on Castro if I have the time. \nThe interior is bigger than the other Philz I've been to and a lot nicer. I just never sit and chill at a coffee shop so it's not really important to me. Perhaps because this location was designed for a longer stay that the staff don't feel the need to provide speedy service. Not exactly the place to be if you're in a hurry.", "author": "Julia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-12", "description": "Besides the always delicious coffee, my favorite thing about Philz is their use of individual pour-overs for each cup. This method does take some more time but it's well worth the commitment. The way they make their coffee is simple (just cream and sugar - with a few 'fancy' drinks if you want), and they have so many roasts to choose from; it's a great place to learn about how roasting can affect coffee. \n\nMy favorite is the Tantalizing Turkish with light sugar and cream, I love dark spicy roasts, and the mint sprig adds a lovely touch of flavor. Another go-to on a hot day is the Iced Mint Mojito (which they can make hot too!). I've always had a great experience with kind staff and will always come back - especially if I bring my Philz travel mug for a discount!", "author": "Elizabeth W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "So the line was a bit intimidating at first glance, but because our friend recommended it to us during our visit to SF, we knew we had to do it. Let me tell you, it was well worth the wait. We ordered two iced coffees with almond milk and the blend was just delicious. All of us absolutely loved our drinks and are still talking about how great the coffee is.", "author": "Abigail H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "This is my favorite coffee shop ever! Love Philz... You can't go wrong with the mint mojito but for a special treat try the Jamaican Blue Mountain. It's worth every penny! Highly recommend iced!", "author": "Laura B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Always a pleasure to grab a cup of joe from Philz. The Front street location is usually pretty busy; a good way to get around this is to use the Order Ahead app as there is a separate pick up area. My go-to is the dark blend,  Ether. I've picked up coffee here several times and I am yet to be disappointed.\n\nWhat probably makes the difference here is the aeration process they follow when they brew a coffee. Just guessing, but whatever it is, it makes my day every time.", "author": "Vijay K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "I was very happy when a Philz opened up in the financial district with expanded hours compared to the truck. I think the key is to use the app order ahead!! Skip the line, pay online, and come when the coffee is ready! The only problem is that it can take quite a while (30-45 min) 'til the pickup time, but as long as you know that possibility ahead of time, I think it's all right.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "A real San Francisco treat in the heart of the financial district.  An afternoon break with good friends at work in a blustery day to have a nice coffee blend made for you one cup at a time.\n\nI have moved from one coffee establishment to the next and this currently is my favorite.  Great tasting coffee that does not upset your stomach is grade A to me.\n\nSuggest though that you use order ahead app as lines can be long.", "author": "Fe R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-13", "description": "meh.  Its a good cup of coffee.  Unique blends, and WAY better than stuff like Starburnt and Peets.  With that said, I used to love going to Philz, especially with the order ahead feature (I hate standing in line for something as simple as coffee).  Baristas are nice, friendly, accommodating, etc.  Service is usually fairly quick.  But they can be inconsistent.\n\nAll that said...$4.50 for a large cup of coffee?? Really?  It was bad enough when it was $4.  But then, apparently overnight, they raised the price over 12%?  I'm sorry, aren't you expanding your brand aggressively after receiving a large influx of investment capital?  Where is the supposed economies of scale that should be coming with buying and producing more and more cups of coffee?  Did the prices of your beans really go up that much?\n\nPhilz was hyped like no other, and are now taking advantage of it.  What used to be a quick pick up while on the go or a nice outing a couple times a week with coworkers is now a once a month treat, max.  If you were to go to Philz 5 days a week and order a large coffee, that's $22.50 a week, before tip or any splurge on food.  \n\nSeriously Philz?? For Coffee??  No thanks.", "author": "T. G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-31", "description": "I got the mint mojito and It's definitely one of the most refreshing iced coffee drinks that I've ever had. It was 11 but the place was still busy. That being said, I think it took 5-10 mins max from the moment I lined up to when my coffee came out. I would definitely come here every week I lived in San Francisco.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "I love Philz coffee and this location is no different from the others, except for the ridiculous lines. \n\nI came here for their employee trainings and after they officially opened. It's always consistent, good service. Everyone is super friendly and nice. \n\nDrinks are always on point. They ask you to taste it before you go so you walk away happy. If you choose not to do so, and are unhappy, that's really your own fault. \n\nMint Mojitos have my heart forever, but even their other coffees are really good, like Philtered Soul. \n\nYum!", "author": "Jeannie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "I always thought Blu bottle is waaay overrated, but this coffee right here is justified!\nQuick tip always order ahead because the line is waaay too long, and I got things to do.\nThe price is a little steep but, I must admit once I went back to Starbucks I will pay the extra 75 scent for something delicious! \nJust me writing this review makes me crave my favorite code 33.\nCool vibe outside if you just want to chill and converse. The only con is that line... my lord that line can really set you back. Always order ahead or go around lunch hour.", "author": "Dwayne A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "Awesome. Love the mint mojito. \n\nOrder a 20oz. \n\nAlso it's probably time for philz to open more locations in the financial district.", "author": "Mack L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "I love Philz Coffee. I went here around 530am and there was no line, considering the sun hasn't come up yet. I order a mint mojito with soymilk. I LOVE how there is no extra charge for soymilk, considering other places do charge for it. The service was very friendly and welcoming. You can also use OrderAhead to avoid the long lines during rush hours especially when people are going to work, for lunch or when going home. I would definitely come back here. The artwork displayed on the walls are perfect too, very well done!", "author": "Loree T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "Philz on Market? Yes please! I am sooo happy to hear there is a Philz about two blocks away from my work. NGL, I can get philz almost everyday. They built this location fairly quickly and even when there is a long line.. it goes by pretty fast! I usually do OrderAhead and they have never failed on my drink and it's ALWAYS there when I go and pick it up. I've had it where my order wasn't even ready yet by the pick up time but this place is always on time! \n\nI think one con I would have to say is.. that in one of my drinks, there was a tinyyyy piece of plastic in it :( BUT either way.. going to give them 5 stars because I won't lie... that isn't going to stop me from coming here again.", "author": "Krystal O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-20", "description": "Overpriced and kind of meh... I did not appreciate the pretentious barista that took my order, I'm sorry that I don't know what \"light, medium, or sweet\" means regarding my mocha. I politely asked for her to explain and did not get a very polite response. In my opinion, that's like a Starbucks barista getting mad when you ask for a medium rather than a grande. This was my third poor Philz experience. First two times I had amazing service but I don't like hot coffee poured over ice...just turns into a lukewarm mess.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-12", "description": "Coffee is coffee, right?  Not when it's specialized gourmet coffee that you would spend some bucks on.  I already knew that our grandparents' day of coffee for 10 cents and a pot for 15 cents were gone when Starbucks began popping up its franchise around town, but now we have a specialized, gourmet style drip coffee business. \n\nSimilar to Blue Bottle but with stores, Philz has expensive coffee ($3 for a small one) and a variety of teas and drinks.  When I walked into the new Front Street store, a former First National Bank, I noticed the pictures and posters were very San Francisco, complete with colored benches and places to plug in your laptops and meet the lunchtime crowds.  \n\nThe barristers were friendly enough.  You wait in a very long line (it was lunchtime though) and get called over a long counter.  You give your order, which coffee has many different styles and flavors, and they'll even add cream and sugar!  The actual wait is short, but $3 a cup is a bit much. \n\nPros:\n\nGreat ambiance and service.  Coffee not bitter like Starbucks but not as smooth as Peets.   Great selections. \n\nCons:\n\nHigh priced coffee, and not even a coffee sleeve to protect your delicate fingers.\n\n***\n\nAlso the Front Street store has funky decor outside, complete with chairs and tables. \n\nIt's more hype than substance.  Good for a quick one but not if you are on a budget.", "author": "James M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "The service was good and the woman at the front was delightful and helpful. She explained me about their special style coffee making process and it was interesting.  The coffee itself  was decent but not amazing but still the whole experience was pleasent.", "author": "Ori M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Life just get so much better working here.\n\nThey are pretty fast. I was in and out in 5 mins this morning. You can also download an app called Order Ahead to order ahead then pick up later.\n\nMust try mint mojito and Jacob's wonderbar.", "author": "Vivi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-26", "description": "Oh my god.. This coffee is amazing. I even considered going there twice every day. My husband enjoyed the \"philz way\" and I happily ordered the favorite \"mint mojito\". The customer service is amazing and they were extremely helpful in explaining the way things work at philz. \n\nWish they had philz in Canada!!!", "author": "Courtney J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "Had a fantastic morning here with some friends on vacation. The customer service here was incredible, and Charles was AWESOME. Thanks Charles!", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-25", "description": "I have to add another star even though this spot fails to acknowledge their customers in this immediate area on the weekends which was why the initial review and rating.\n\nSo why the add a star?  \n\nTheir weekend closure enabled me to locate the Blue Bottle spot a couple of blocks away.  Thank you Phiz Coffee!", "author": "Terrence P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "Yum, so delicious. Was there a long line: yes. Was it worth it: definitely. \n\nPro tip: pre-order and pay, then just pick up your drink and skip the line!", "author": "Alison Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "Philz Coffee has got me addicted. Love the style they make your coffee, with cream and sugar. This Tesora coffee literally wakes you up. Five Stars from this coffee lover.", "author": "Sadath S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "Thank you Philz for opening in FiDi!\n\nI've had it before but never actually went to the shop to get it. My first experience with ordering was yesterday and The barista (and the menu/chalkboard) was super helpful in the sequence of things. I was also very impressed with being presented with my drink and told to try it before leaving in case it wasn't to my liking. I think that's awesome. I'm in trouble if I ever decide not to live in the bay area!\n\nWish Philz was on every corner instead of Starbucks!", "author": "Taryn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "Only downside is it makes it difficult to switch back to Starbucks during the week. Favorite is the ecstatic ice coffee with cream.", "author": "Phillip H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "For the folks at the order ahead counter this morning (5/11/16). I made a technical error, but you had my back in my time of need (before 8AM on a weekday, no coffee in hand).  Thanks for your help and kindness!", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-11", "description": "This specific philz coffee is not on par as the other ones I've tried. Seems to me that since they're opening up so many new locations they're losing their touch since the quality isn't top notch like the first time I've had it. Service was excellent though, but I'm giving this location two stars because of the quality of my iced mint mojito coffee. First time I received it the coffee was too bitter for my liking (definitely didn't taste like how it normally does), so I had them remake it with extra sweetener.. At first it was good for the first two sips but then I noticed for the rest of my duration drinking it, my favorite iced coffee was watered down :( and still not we sweet as I desired. By the time I realized it, it was too late :((", "author": "Kimberly P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "Best coffee I've ever had! The iced mojito was amazing. So glad its by my apartment, I'll definitely be here everyday.", "author": "Christine T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "Great pour over coffee. Line is permanent. But tends to move semi fast. Must try mojito coffee. :)", "author": "D P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "The mint mojito iced coffee. You either hate it or you love it, but I definitely love it. The only reason this is 4 stars is because it's a little on the pricey side, so I can only spoil myself a few times a week.", "author": "Corey H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-16", "description": "Coffee is good; service is really, really bad. It never helps to forget your customers.", "author": "Mark H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-28", "description": "There are few good times to play DMX, and at a coffee shop is not one.  Went there for the kouign amann.  Was disappointed.  It was about the size of a silver dollar, and so-so in taste. Lot's of variety of coffee, but the ordering system is inefficient so unnecessary waiting is involved.", "author": "Scott P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "I NEVER drink coffee in the middle of the day but decided to grab an iced mojito coffee yesterday...mind meltingly delicious. Good call. It made my day! Seriously! And all the women working there were very nice and helpful. Awesome place!", "author": "Monica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-04", "description": "While I love philz this was quite an unpleasant experience. I am typing as I am sitting here with my husband and 72 year old mom! After we purchase our 3 coffees they were about to close my mom asked to use the restroom which was blocked off. A woman in a grey bulls t shirt told my mom \"No we are closed\"! I could not believe it. It pains me to write a a bad review however I was appalled! We purchased coffee and were not coming off the street! The cute Asian barista and a handsome I believe Asian man helped us and made my moms first philz experience awesome! However the girl maybe Latin with curly hair and bulls shirt needs to learn the meaning of customer service!", "author": "Sabrina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-17", "description": "I have a love-hate relationship with Philz. One side of me enjoys the local charm and variety the company provides for the SF coffee scene. The other side of me realizes I'm just another techie dronebot waiting mindlessly in line for an overpriced cup of sugary joe. Who's right? Who's wrong? All I know is that the red haze (off-menu) is the way to go!", "author": "Erich G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "Maybe the friendliest baristas ever here. Bought a bag of the Tantalizing Turkish beans and they offered me some mint leaves for my brew! This is my new home store.", "author": "Karl K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "No less than 5 stars. I'd give them 10 if I could. The mint mojito is amazing!! Best coffee ever! My only wish is that they would open one in the east bay...in Livermore...with a drive thru. Wishful thinking. I love this place, I love the friendly amazing staff, and I love their mint mojito!!!", "author": "Bonnie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-15", "description": "I was trying to get a croissant and they told me to go to the snack area. When I went there the staff told me to go back to the ordering area. Then the ordering area people told me to go to the snack area. Bad service! If you want to relax and grab a coffee or snack, make sure you find a better place.", "author": "Feng G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "Love this place pricey ice coffee but very good there are usually long lines but I love using the App to pre order before I get here", "author": "Jim E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-18", "description": "Spare me your long lines. Spare me your prententious attitude. Spare me your prices. Spare me your massaging my coffee beans...or, whatever. C'mon it's coffee, get over yourselves.", "author": "A J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-22", "description": "so yummm! wish the wait was shorter. but so yumm!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "love this location! everyone so nice and frendly :)\nmojito coffee is a must try!!!", "author": "Miffy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "Someone from Philz contacted me and sent a gift card to make up for the ill prepared beverage! I've been back a few times and I've had delicious drinks ever since.", "author": "Taylor K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-09", "description": "Like how Philz respects the tradition of the bean. As a first time visitor, I was overwhelmed with how I was supposed to order and separate ordering station for food and then a separate location to pay. There is a whole lot of good happening at Philz but perhaps a little coffee clarity would even make it better.", "author": "Marnie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-13", "description": "Skip the line and head to the truck on Sansome Street if you can. There's always a long line at this store that moves very slowly. Kind of tells you about the inefficient baristas inside. They always mess up your pricey mint mojito and are cheap on their mint and sugar portions. This would be my last time in this store. Again go to the truck for the real flavor and drink. A little walk is even worth the quality of the drinks.", "author": "Rabab M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "I'm not one for coffee, generally, but my girlfriend wanted to try something new. We got the Mocha Tesora and the Mint Mojito coffee (hot and iced respectively). Both of these drinks were excellent, and I wouldn't hesitate to get them again.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "It's Philz coffee, what else am I supposed to say? Their mint mojito iced coffee is great, call me basic but that's really all I get there and it never fails. This new location right off market street is convenient and spacious. The nice entrance/plaza right outside is a great/ideal place to enjoy this Silicon Valley-hipster-cup-of-joe.", "author": "Bradley C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-24", "description": "I am not impressed. I will not wait 20 minutes for a drip coffee that is just ok. Spent most of that time standing in a line that didn't move. Then people who came in after me started picking up their drinks before me.  It's not like they had a more complicated drink...it's all drip coffee. I'm obviously not their target customer.", "author": "Kathy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "Philz really just makes the world go round. They only DO NOT do espresso drinks, rather the focus is on making simply the best drip coffee you'll ever taste. I used to work in coffee and know that even with the best beans and roast, your coffee can be ruined in the brewing process (if the water is too hot, the beans have been exposed to air/ light, wrong grind, uneven ratio etc etc etc). Philz baristas eliminate these potential problems, as all are trained in what it takes to make the freshest cup.", "author": "Vee S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "The coffee is legendary, no flaw to report whatsoever!  Staff is for the most part pretty nice, Brandon the manager especially kind.", "author": "Alee Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-12", "description": "Came in on Friday afternoon (today) and the barista broke my cup. Did not apologize. Did not offer to replace my broken glass bottle. Thanks, guy. Buyers, beware bringing your own cups!", "author": "Lia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-22", "description": "I love Philz. There's really nothing more to it. This location always seems to be popular though - so beware of lines. Thankfully the service is fantastic and totally makes up for having to wait in line :)", "author": "Teresa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "I've loved Philz for a long long time. We even get the beans to brew the coffee at home every morning. The coffee is pretty strong, so I usually get half caf - absolute favorites being Swiss Water with Philtered Soul, no sugar, unsweetened soy. They shake it up so well that it almost has the texture of a latte.", "author": "Grace W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Mint Mojito coffee. Every time amazing. Always excellent service. This is a must visit for locals and visitors alike.\n\nI miss this place the most of anywhere from my time in the Bay Area.", "author": "J W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "Another taste of coffee. More interesting and full. Highly recommended. Relax and drink. Happy Holidays!", "author": "Vadim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "I never fancied myself a \"coffee expert\" until I had Philz...now I know the difference between good and GREAT coffee. I will avoid nearby competitors whenever possible now. ONLY downfall is that their popularity means ridiculous lines out the door. If you download the OrderAhead app on your phone you can order your coffee and avoid the lines...but you're still talking waits of 30-60 mins at peak times.", "author": "Maria S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "I come here every morning at 5:30. No lines. Coffee is amazing - prefer dark roast - Jacobs black. Barista's are friendly and know how to make coffee. Once you go to Philz you will never go anywhere else!", "author": "Robert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "This place is a buhhhhh-lessss-ing!! Philz truck was just not cutting it. Now there's this huge af Philz off of Front with a line that goes nearly out the street. Use the OrderAhead app to get in and get out witcho coffee fo dat ass.", "author": "Jo L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-04", "description": "Coffee is very smooth and I love the mint mojito coffee!!! Only complain is that the seating is not great.", "author": "Kathy Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-16", "description": "You know the old joke about the mechanic who says, \"fast, good, cheap; pick two out of three\"?  Well at Philz you get 1 out of three....maybe.  Cup of coffee and a breakfast sandwich is 10 bucks. Coffee alone is 3 for a small.  You gotta be kidding. It's just not that good. \n\nGiven the lines it is also slow normally, but I was there a little after 6am and it was definitely slower than any Starbucks. \n\nFinally, while the quality is fine, the size of the sandwich is subpar, especially for the price. \n\nDefinitely not worth the price or the wait.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "So happy there is a Philz at this location, close to my office! The lines are normally very long but move (relatively) fast. Love the gingersnap iced coffee. There's a great outdoor space to sit and enjoy your coffee as well. Also, the staff is very, very friendly and helpful.", "author": "Ana D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "Went there for the first time, got the opportunity of getting Faith as my Barista. Told her im a fan of a chai, she perfected it to my capability n taste without having me to look at their extensive selection. Faith n her staff are a friendly bunch and create a good atmosphere!", "author": "Pritesh W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "I was skeptical. I saw the line extending put the door. Who is this fill and what is making these people stand in line 45mins for a cup of coffee. What kind of job lets you take that type of break. I had to experience. And to my avail, had an hour to put into the effort.  First, who knew there were 20 different types of coffee. Each detailed description of tastes such as nutty, fruity, hint of chocolate. I closed my eyes and picked one. Indeed, the taste of the coffee was very accurate. Coffee was very tasty. But the verdict is still out on the worth of 30-45 minute wait. 10 minute wait, then goodbye gold member Starbucks.", "author": "Victor B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-06", "description": "Line is a little long in the morning as it is with every other coffee shop in the neighborhood. However, the baristas are always cheerful and helpful. Coffee is fantastic of course!", "author": "Evelyn Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "First time to this place.  Their menu looks very creative.  I tried the popular Mint Mojito Iced Coffee with sugar and cream.  I added some extra sugar, since I like my iced coffee sweet.  The drink tasted great.  The ambiance is fantastic and the lady there told us \"taste it and let me know if you want me to make any changes.  I am here to do that for you guys\".  I thought that's the next level to awesome customer service.  I will visit this place again very soon.  Just be prepared for long lines...haha", "author": "Ani R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "Love the straight forward, individual cup of coffee.  The bet way to say it, it's a coffee drinkers, coffee shop.  Be prepared to wait as they make each cup as you order.  Staff is friendly and ready to work. Space is bright and has large outdoors seating area.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "Come here to study before work because I love the ambiance and I love the coffee. My favorites so far are the Silken splendor, El Tesora, and Mint mojito (of course). I LOVE that you can customize your drink with the level of creaminess, sweetness, and what type of milk/cream/soy/almond or sweetener/honey/etc. \n\nWhen they give you your order they usually ask you to try it and see if you want them to adjust the drink for you. That's pretty great customer service.\n\nWhen you go at prime time, expect a wait for your drink. I think it's worth it. My tip? Get the OrderAhead app - although be realistic if you're trying to use the app at peak coffee break times - it still will make you wait if you don't give them enough time. \nBonus points for ample outside seating for chillage/studying/pondering life/etc.", "author": "Tommy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-22", "description": "Don't make it to the city that often so when I went today, I was pleased to see a new Philz near my BART stop.  Line was out the door but it moved quickly.  Coffee was decent but the service was very good and the smiling people making the coffee was a welcome departure from places like Starbucks.", "author": "Jonathan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "Another beautiful philz!! Made it today for the soft opening. Despite the super long line, the wait was not as bad as it seemed. The interior of the store is super beautiful but much smaller than many of the other philz. It's in a really central location, so I'm sure they will get tons of traffic. Can't wait to come again soon!", "author": "Charissa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "First time experience at a Philz joint and it was amazing! Barista made me a \"Canopy of Heaven\" on ice that was brewed to perfection. Two other employees gushed over my daughter and gave her a cookie to enjoy (which she absolutely did) with her juice. Will definitely be a patron at Philz Coffee again!", "author": "Nuri H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Delicious coffee. However the line is beyond ridiculous. I won't guess what the wait is, because when you're waiting in line, your time perception is warped. I feel like it's under a half hour. Probably 10 minutes or so. It's poor business management to be open Monday-Friday when you can't satisfy the need. There is an obvious need to be open 7 days a week. But yeah, the coffee is worth the wait, on my days off, which are Mondays and Tuesdays. Work days, they absolutely lose my business. I cannot be absent from work that long.", "author": "Richard V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "Best iced coffee I've ever had. Seriously, BANGIN. I was here a week ago and I still remember how great that coffee was. I hear the mint mojito is the move but for real just the basic iced is a winner. I got love for Philz. Never forget", "author": "Brandon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "Love this place, but the line is always so long. No worries, once you take a sip, you'll know it was all worth the wait!", "author": "Jules C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "I've never been super picky about my coffee until I tried Philz coffee. Now I can't accept anything else. They make the best coffee in town, hands down. Also, a beautiful store and location. Fast Wifi also a plus. I highly recommend Philz to anyone wanting the best cup of coffee they have ever tried.", "author": "Sandra M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "It'z the best is still one of the best cups of coffee I've had. This location is great because it has a lot of outdoor seating and the employees are very friendly.", "author": "Hi T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-03", "description": "I am a long-time Philz customer and started drinking their coffee way before they have become so popular. Sadly, quality has gone down as their business expands. I think it's another classic case of great things ruined by hipsters/hype. Before, their coffee had always been spot on and consistently awesome. Now, especially with this Front St location, the quality is mediocre, if not poor. Philz has fallen to a new low this morning when I got a super rude barista who had major attitude. I usually use Order Ahead to skip the line but Philz wasn't accepting orders through the app this morning so I had to wait in line. The barista I had the misfortune of encountering practically barked at me. He did not give me any greetings, barked \"what do you want\", never asked how much cream and sugar I wanted etc. When my coffee was ready, he did not call out my order but just let it sit there. When I took the initiative to ask if the coffee sitting on the counter was mine, he was like yeah and turned away, busy getting back into chit-chatting with his coworker. Unlike the usual Philz fashion where all the barista are always friendly and polite, always be sure to check if the coffee is to the customer's liking, this batista did none of that and was simply awful. The coffee he made was horrible too. I hope I would never see him again.", "author": "Nerdy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "Philz is love.  Philz is life.  The Iced Mint Mojito Coffee may be the best coffee drink I've ever tasted, and this location makes the best version of it of all Philz locations I've been to.  If you've never tried it, do yourself a favor and order one immediately - it will change your life.  It's the perfect mix of exotic, sweet, and savory flavors.  If you go during non-peak hours, the lines aren't too bad either.  Philz is growing really fast and opening new stores every month, so I hope that as they grow they'll maintain their quality and service.  All that said, Philz has been and will continue to be my favorite coffee shop in the SF Bay Area.", "author": "Zach S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "best ice coffee ever! i bring my big thermos but only pay for the price of a small. this place's estactic ice coffee is wayyyyyyy better than starbucks.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "The baristas are super friendly even though they have such long lines to deal with :-) The coffee and the service is worth the wait! Knocking off one star for the confusion over where to stand and pay during the morning rush after you have placed your order...", "author": "Zara Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-09", "description": "I just went to their soft opening where they were giving out complimentary drinks and pastries. Anyways, the staff guys who were guiding people in front of the line were extremely nice and enthusiastic, and they said repeatedly that I could order whatever I wanted off the menu and however many drinks I wanted; this was great because I was going to order another drink my co-worker. However when I tried ordering two drinks, the girl who was taking my order refused to give me more than one drink, even chastising me on how I was being unfair to everyone else for asking for more than one drink. Despite telling her that the other staff said I could order however many drinks I wanted, instead of doing the logical thing and checking in with another staff or her manager, she just kept standing there saying no - rather rudely too. Despite what I said, she wouldn't listen and kept saying the same thing, how I was being \"unfair to others\" for trying to order more than 1 drink. \n\nPlease don't tell your customers they can order as much as they'd like and then scold them for doing so. It leaves a bad impression of your customer service and shows the lack of communication between the staff. I get it, it's free but that still doesn't give your staff the right to lecture a customer and call them \"unfair\" for trying to use a service they were supposedly being offered. Afterwards, I even saw several people walk out with two or more drinks in their hands. \n\nI am insulted! After this incident I don't think I will be going back there for a while because I don't want to take the chance and encounter that same rude employee again.\n\nOther than that, the coffee was delicious. Thumbs up for their drinks as well as the nice staff - except for the girl who served me. Double thumbs down for her.", "author": "Heather L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-12", "description": "My building is just across this location.  Heard so much about it.  Sadly, all hype in my opinion.  Very  long wait. If you have a lot of time to waste for a cup of coffee, go ahead and line up.   Not a fan.", "author": "Cj P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-25", "description": "Atrocious coffee period. Sure the process of an individual pour-over is nice, but the coffee isn't good. If I wanted horrible coffee, I could have gone to Peets or Starbucks. I will continue to wait for a great cup of coffee at Blue Bottle.", "author": "H S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "Daniel makes THE BEST Fresh Mint Chai i've ever had. Plus excellent customer service. That's why 5 stars. Thanks Daniel!", "author": "Katy M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-17", "description": "Don't really get why people love this place. Coffee isn't very good, pricey and bad service. I never feel comfortable ordering due to the bad service. I would rather get a latte or something from somewhere I feel comfortable", "author": "Greg L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "Excellent cup of coffee! Each cup is a pour-over. Made to order; just the way you want it. We tried Jacob's Wonderbar. You must try it!", "author": "Robyn P."}
