{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Pho is solid! Even on hot days everyone here gets pho. Can't say I've tried anything else. The thick noodles are great. The broth is real and authentic. Get the filet mignon on the side!", "author": "Adidas W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-02", "description": "CASH ONLY!!!\nand very transactional.\n\nIf you're ordering takeout and short on cash, they make you leave the cash that you have (as a deposit for the food you ordered), while you go (to the ATM) to grab more cash to pay for it.\n\nYou probably don't want to eat at/buy from/support any businesses who don't care about you. This being one of them.", "author": "Thomas N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-25", "description": "Beware: Extremely large quantities of food!\n\nNot the cleanest place ever, but they have cheap food and an abundance of it. Everything from crunchy egg rolls, to garlic noodles, phi, seafood rice, and everything in between. \n\nThe food doesn't stand out as good, but it's fast and hits the spot.", "author": "Leo W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-10", "description": "Usually I expect service to be slow and  a rude shrug from their servers from experience. This time I couldn't stand the unacceptable rudeness for me and my party.\n\nWe ordered our soups and drinks as usual. I usually crave the traditional chicken soup with flat noodles and my party ordered the beef noodle soup. After asking for two Thai ice teas, I asked for a glass a water. Waiter points at the two hot tea and said \"hot tea\" is right there so angrily. I nicely ask him that  I wanted water since I was super thirsty. He was so rude about asking for water but I shrugged it off\n\nThroughout my whole dinning experience you can hear all of the servers be so rude during the slowest time of the day. I don't understand why you have to give the customers a hard time ordering or asking questions. \n\nThey demand cash and they eagerly take away the checkbook from you. They rudely hates it when you ask for something little like a fork or extra lime. They make you feel like your doing something wrong.\n\nI usually don't write an upsetting post but my last straw was when he demanded to pay now, in cash, right now. We weren't even done with our meal and at that point I just wanted to leave.\n\nI used to come here a lot during my high school/college days but I find comfort in other pho locations. It's not the same. Soup is good at some extent but service is horrible!!!!!!!! \n\nNo smiles, no thank you just demand cash payments.", "author": "Diana S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-15", "description": "I ordered the shrimp fresh roll, and not great. Their peanut sauce was bland and no real taste \nThen my combination Pho was a bit on the salty side but doable. I had to order my veggies since they didn't bring them. And my tea was brought in a  plastic water cup, which I thought it was until I realized it was hot . Why did the party in the next table had a tea pot and tea cups??  Maybe I'll come back, but I like the other place more.", "author": "Salvador G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-08", "description": "The pho and bun are really good. Very consistent and authentic. If this was 10 years ago, it might warrant more stars. There's just too much competition in the pho game nowadays, though. \nThe pho ga (chicken noodle), of which the name of this place is called Chinese (#1 chicken noodle), has nice northern style flat noodles. The chicken is tender and juicy. The broth is light, a tad on the tamer side, but add a little bit of lime, jalapenos and hoisin or sriracha and you are good to go.\nThe bun rieu (crab tomato noodle) and bun bo hue (spicy beef ) were both good. \nThe imperial rolls were ok, crispy but pretty standard. \nOverall the place is good and I will visit if in the area. Will places in the tenderloin, south bay and sacto that has broth that cooks for 10 hours, this place just ranks lower by comparison. But a solid and good choice overall, service is friendly and good too.", "author": "Dom L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-13", "description": "If I can give a zero I would.. Lady who serve us was very rude.. She didn't really want to help us..  We asked for a few drinks and she look at us and said is that it?? In a very rude almost like she didn't want to give us our drinks.. I'm giving them a 2 star because the other waiters were somewhat nice.. If she is one of the owners, then she is in the wrong business.. To top it off, she has the nerves to ask for a tip.. You expect us to give you a tip with your rude service.. This lady is insane.. You would of got your tip if you were polite..", "author": "James V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-29", "description": "This is another bad place to get a decent bowl of noodle... pho is a traditional vietnamese dish... if u really want the real pho... try some real vietnamese places... i dont trust chinese or other asian countries to cook a good bowl of pho... plus no bean sprouts, so basils leaves.... how can u enjoy the real pho without its elements.... they only give u some lemons n jalapeños which is no need", "author": "Michael P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "Their waiter service very bad and the food not like vietnamese food you ever eaten, very cheap and no vegetable they cook so so  And charge\n you every thing you ask for  very bad,   I wish I never ever eat here again, since the food is trash,   and since their waiter  served  very bad\n they get paid under table  and never allow to have tip from customer\n the restaurant owner took it and use it to pay salary to employees\n  they only pay $10.00 an hour or  $80 a day and works 12 hrs for $80 dollars   Most of them works in the kitchen  is from china non speak In English and no legal immigration !", "author": "Kow F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "I am updating my review because I have fallen in love with their Pho Ga (Chicken Pho) with fresh, broad, flat rice noodles. It is an unassuming bowl of chicken broth, strips of chicken breast, and little else. But it is just the thing to quaff when your feeling just a bit off. \n\nI am a firm believer of knowing what's good at each place, and while I have not discovered anything else I am a fan of here, the Pho Ga is what I crave and I will continue to return. And for that alone, 4 stars.\n\nCash only. :)", "author": "Lu-Shien T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-22", "description": "Cash Only\nPortions are great\nFlavors are straightforward\nAmbiance is hole in the wall\nVariety is good\nService is lackluster (typical to these establishments)\n\nOverall Thoughts\n\nIn a pinch, Pho #1 is a decent option for a quick bite", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-20", "description": "Impolite staff that never greeted nor say thank you.   They bang your plates on table treating customers like inmates.  \n\nDirty utensils, sauce bottles, sticky table and more dirty environment you can find.  Terrible place to eat!", "author": "Cookie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "Solid bun rieu served here.\n\nCame here with my girlfriend slightly exhausted and hung over. Bun rieu was the way to go, portion was big.\n\nCertainly by no means the best restaurant in terms of service or cleanliness but the food does the job.", "author": "Mabel Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-19", "description": "I came here based on reviews and it was just so so.  The bun bo hue was absolutely terrible.  The broth lacked flavor and had zero lemongrass.  The spring rolls were good with large quantities of shrimp and meat but overall I wouldn't return. Cash only.", "author": "John H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-26", "description": "I haven't been here in a few years but I knew there food was amazing and that I like coming here for rice plates as I'd been here for my first time when I tried it years ago. Today I went back hoping the food was still great. In fact it was . It was as delicious as I remember it but unfortunately my service sucked . I had to go look for someone to take my order just so she can send me back to the door to order at the door to go. No welcome in nothing made me feel uncomfortable. It's sad because I remember them being so friendly to everyone that came in. The wait wasn't bad. I hope on my next experience it will be better .", "author": "Cece H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "I have now been to many, many different pho places, and none have come close to dethroning this place as my very favorite pho place. Pho ga (chicken) is my staple, and this place hasn't come close to being beat as far as how tasty it is. This place tends to infuse Chinese influences into their Vietnamese dishes, so it's mainly served northern style, though they will bring sprouts and basil if you ask. You can get a few variants of the ga, with slightly different broth (one version has more shallots and onion-y taste), and different noodles. I tend to get their standard pho ga, which has a mix of white and dark meat (probably mostly dark though), and the wide, flat rice noodles. DELISH.\n\nThe ambiance leaves something to be desired, and it isn't terribly fancy inside whatsoever, but it's clean, well run, and they are pretty organized and handle large parties capably. Note that this is one of those Asian restaurants that frequented mostly by Asians, which is generally a good sign that the food is legit. You see the occasional anglo, latino, or Af American, but mostly, it's straight up Asian. Beware that it's cash only, and depending on time of day, the street parking can be a pain. Dinner time, once the meters expire, actually is a better time to come, regardless of day of the week, since a lot of the businesses on San Bruno close for the day at dinnertime (meaning less competition for meters and street parking in general).", "author": "Rod V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "Favorite wide noodle soup in the city. Better than turtle tower and menu is much more diverse.\n\nI wish they have the garlic oil sauce, but the fermented garlic chili sauce is just fine to go with soup because of the quality. \n\nCash only, the margins must be tiny for them because the food is so quality.\n\nService is what you expect from most place. Quick, quiet, call if need something else.\n\nClean environment, interesting foreign feel because of hay hut at register. \n\nDefinitely a regular!", "author": "Stacey T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-21", "description": "went there with friends for lunch cuz i saw some pretty pictures of it in a friend's facebook page..  thought it would be good but was disappointed.  the Pho was not like all the other Pho's I've eaten, with a bold tasting beef  broth.. it was just like a chicken soup.. and did not come with the \"usual\" basil, lime, bean sprouts dish to be put in the Pho.  this left the bowl of noodles real lacking in ingredient.   the menu said  \"3 meats\" but none of it was beef..  there was chicken, processed lunch meat slices, and something else that was not real identifiable.   it was the big size order but other than the bowl, the noodle soup could have fit in a smaller bowl.\n\nwe also had a bbq pork rice plate.  the pork was sliced thin (like pork jerky) and in  square shapes, there was no char on the pieces like other bbq's  and it had a \"springy\" texture, reminiscent of being treated with baking soda,, that also interferes with it getting a char.   altogether it was disappointing and not compelling to come back to try other things.\nsorry", "author": "dee c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-06", "description": "They give you the choice of thin or thick noodles when you order pho. The pho comes with the typical garnishes, but doesn't include beansprouts which was surprising to me. I ordered beef pho with a mix of well-done and rare beef and it was just okay to me. I felt really thirsty afterwards, so perhaps the broth was a bit too salty. This pho was nothing amazing, but pho is pho, so I still enjoyed it.\n\nNote that this place is cash only.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-11", "description": "The staff was really nice, but it helps if you can speak Mandarin.  As an appetizer, I got the fresh shrimp spring rolls, which were delicious!  I also ordered the pork with egg roll vermicelli. The egg rolls were my favorite part, although the pork was succulent too.  The sauce for the vermicelli was overwhelming for my taste buds at one point (tastes like vinegar), so I asked if I could have a small bowl of broth on the side.  The employees happily provided me with the soup, and didn't even charge me for it! :D\n\nDefinitely will come back one day.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "Be careful here ... ordered a vermicelli bowl for my son who has Nut allergies and told them no Nuts because he is deathly allergic.  They replied with no problem and took the plate back.  They then brought back the same plate with just the Nut scooped out.  Seriously?!?!?!", "author": "Sheree A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-29", "description": "Super impressed with how this place turned out. I lived nearby so It is overdue to try the restaurants on San Bruno. I just love how big the portion is and the bun rieu I got was delicious!\n\nMy bf got the beef broth with meat pho soup and he loved it too. They give lots of noodles!\n\nI cant wait to be back! And its CASH ONLY!!", "author": "Debbie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-10", "description": "Came for some pho and they didn't have many options. I love tendon and they didn't have any so I chose the beef ball and steak. I like how they offer skinny or fat noodles because I LOVE the fat flat noodles in pho. I thought the pho was good. Also gave me a generous serving of steak. The fresh spring rolls were also delicious. Good peanut sauce too. One thing that was a bit annoying was that my boyfriend tried asking for a bowl of the broth separately on the side and the worker brought us over a take out box. We asked again and he brought us a take out container for the broth. Then I tried explaining it again, and he brought us a bowl for the broth.. Lol getting closer. My boyfriend then asked in Mandarin and he finally brought us what we asked for. I guess not their fault they didn't understand clearly.", "author": "Annie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-06", "description": "Hard to find a spot that has Chicken and intestine pho so this is my go to if i'm in the area. Service isn't very attentive. But hey! This isn't fine dining. The best hole in the wall asian food with fair pricing will always have the worst customer service.", "author": "Lillian r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "Chicken pho, chicken pho! Noodles are both smooth and chewy. Broth is light and savory.", "author": "Connie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "It's hard to find a place that serves up good \"Bo Kho\" aka Vietnamese Beef Stew. Sometimes the broth is either too fatty, lacking in flavor, or they don't serve enough meat. A good bowl of \"Bo Kho\" would have a perfect balance of meat, broth, seasonings, & veggies.\n\nPho # 1 has a dish called \"Oxtails with Wine Sauce\". Basically its \"Bo Kho\" (beef stew) with oxtails instead of beef chunks. Man did this blow my mind! I don't know whether I was just hungry or was it really one of the best beef stews I've ever had!\n\nThey give you a good amount of oxtails w/ lots of meat. And I would have to say that the oxtails were extemely tender! Fall of the bone but still remained intact. Perfectly cooked! The broth was well seasoned and very flavorful. It was also served with carrots stewed in the broth, which was the perfect balance to the richness of the broth.\n\nI wasn't expecting much but they totally exceeded my expectations. The chef knows what they're doing here. Make sure you spoon the broth over rice. Don't waste even one small bit of the sauce...you'll regret it.", "author": "Ralph N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "One of the 3 pho places that me and my family frequent. It's not the best, but above average in my opinion. Give it a try!\n\nIt's the cheapest on San Bruno Ave and they've added more noodle options (thick and thin) noodles.", "author": "Fanny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "the classic chicken pho is really good especially the soup!", "author": "Yantong Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "i go here for the seafood curry fried rice and pho ga 5/5 why is yelp out here telling me my review is too short this is all you need to know", "author": "Charlie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-07", "description": "Not bad but definitely not \"#1\". The chicken pho is the most popular here, and it's actually not bad. If you don't want a noodle soup, get the Hainan chicken rice platr and make sure you get the chicken thigh.", "author": "Billy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "Okay just went there for lunch.  This is probably my 3rd or 4th time here, ever  I went with their house special chicken pho soup which is #8.  I ordered large while my cousin (in-law) ordered the same thing, but small bowl.  The soup is tasty as I remembered it.  But when I mentioned how good it still taste my cousin in-law (who grew up near by) said \"of course it taste good, they use hella MSG.\"  I was a bit taken back and said, \"really?  are you sure\".  He said yeah they use a lot of salt and msg.  I was some what skeptical.\n\nThis was at 12:45 pm, so the place was jam packed.  The place was very busy for sure, all kinds of people come to eat, white ppl, some hispanics too but 80% Chinese customers.  We speak cantonese and mandarin so ordering was quick and no problem  They can seem understaffed and the workers try very hard to keep up.  I don't have any issues with this what so ever.  You just have to be polite and demanding in order to get your order in quickly.  :)  It's a balance act.\n\nI had to drive up from Daly City (just 3 miles away from the pho shop) to Petaluma to borrow a tow vehicle from my friend.  It was only about 1:45 pm by the time I started to head up but traffic was starting to get heavy.  I started to dozing off by about 2:45 pm and had to pull over and sleep.  When I woke up from my power nap 10 minutes later I was super thirsty and the food coma was a heavy hit.  They really must have use a bit of msg, or salt, or both.  Regardless the soup is yummy so I will still come here to have it from time to time.  I guess I will try there rice plates next time.  :)  Anyway, overall this place is rock solid.  4/5 from me.", "author": "Frank M. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-13", "description": "Why does this place get 5 stars? Only because of their CHICKEN PHO (Pho Ga). I haven't tried turtle tower so I can't compare. And I've only tried the chicken pho. I haven't been able to try anything else here. \n\nIt looks like your typical viet restaurant with mediocre service. It's located on San Bruno ave so it's all street parking and metered. So parking can be a pain when it's busy.\n\nNow what's so special about the chicken pho? The broth is very rich and flavorful. They also give you decent sized shredded pieces of chicken, you can ask for white dark or a mix of both meats. It also comes with chicken gizzards, just let them know if you don't like them. I always get mine with ho fun too, the thick rice noodles. And make sure you ask for the ginger and green onion sauce to dip your chicken in. Delicious! \n\nPrice is cheap $8 for a bowl. How can you say no now?\n\nMy go-to spot when I'm craving some chicken pho.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "I LOVE THIS PLACE!!!! So sooo happy that I live super close. I come here every single time I have a hangover lol! I recommend their pho ga (chicken pho). Let me start off by saying how flavorful their broth is! The only thing I add in the broth is just pepper. I really really like how they use flat noodles instead of the regular pho noodles too. The portions are pretty big, they usually give tons of noodles but they don't skimp out on the meat either. I've had their bun bo hue (spicy beef noodles) before and it was decent. I'm looking forward to trying their rice dishes next time!", "author": "Jenefer N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-04", "description": "I ordered Chicken Hainan, and I specifically asked for BREAST.  What I got was nothing but thick fatty skin, fat and bones. Some bones still with red blood running. See photo. They were very generous threw in 2 wings with horrific thick fatty skin which I didn't ask for. It also came with a bowl of soup that smells like sewage. No axaggeration needed.", "author": "P S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-11", "description": "Pho #1 is a fairly good place. \nChicken pho is fairly good. It definitely hits the spot for when the cravings come along and getting to your favorite spot isn't an option. It's fairly priced and it tastes good. My critiques would include: 1. msg soup base (but i don't care too much because what place isn't going to add some of that, just letting you know if you're sensitive and used to the good home made stuff) 2. very little chicken :( i order a large take out and only received five pieces of chicken for my entire bowl. definitely a skimpy amount. that's about all the complaint that i have. i wouldn't necessarily recommend this place but i would go on my own if it was something that i really wanted and had to stay close by. \n\nAlso, a note on the beef pho. it's traditionally served with rice stick noodles that have a slightly tougher texture. The only noodle that they offer is the flat noodles. Personal preference, i enjoy the rice stick with beef pho.", "author": "Tina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "This place is awesome! The food is fresh and so good! Customer service is amazing! Clean restaurant and super affordable.", "author": "Claudia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "Came here after 8 on a Friday night. I was craving flat rice noodles and this place popped up. It was super close and closed at 9 or 10 so we decided to give it a try. We found parking right out front (woo hoo!). There was basically no one there lol. I got the chicken pho and my bf got the flank steak. We shared imperial rolls as an appetizer. I love places that serve the rolls with lettuce and noodles and this place did ! They were great! Our stoops came soon after. Great as well! I'm going to be honest and say that I didn't even sample the broth alone before adding oyster sauce and sriracha -_-, it's just a bad habit of mine. But I thought everything was great! I will definitely be back- considering , we are right up the hill ! Thanks Yelp !", "author": "Tia Marie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-19", "description": "THIS PLACE ROCKS FOR LUNCH!\n\nThere are many places to eat in the Portola neighborhood but me and my buddy Dede keeps coming back here!  I think it's because of their good food and their lunch special menu is out of this world.\n\nI really recommend trying their Vietnamese Pork Stew.  It is served with a house soup.  It is very tender and cooked just right.  \n\nTheir Vermicelli Noodles with 5 Spice Pork Grilled is also delicious.  Order their Thai Ice Tea too they make them strong and good with lots of milk and strong Thai Tea flavor. \n\nThey are extremely very busy during lunch hour between 11-1PM.  We found the best time to come is around 1:30 when everyone has gone back to work and we get to go in and get a late lunch but well worth the money.  They are reasonably price and for lunch you can get a great meal with huge serving for as little as $6.95!\n\nPHO #1 also serves Chinese Style cooking and they have a variety of dishes to choose from their menu.", "author": "Edwin R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-31", "description": "What pho place does not serve the vegetable dish  with the basil leaves and other veggies on the side?  \n\nThis place.  \n\nHow disappointing!  \n\nI got their Beef Pho and their broth and noodles were alright.  They didn't use the typical vermicelli, but a bit of a flatter rice noodle.\n\nTheir fried roll is not the well-made Vietnamese ones.  It's good, but not the best.\n\nFInal say: Skip this place for Pho unless you really need that Pho fix!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-06", "description": "My husband came home with two types of pho tonight, the Chicken and the Raw beef pho, both were very good. The broth was delicious. I split the large Chicken Pho with my 3yr old son and we both had plenty to eat. Even though both Pho's were good my husband had issues trying to get the Pho. Our order was taken through Eat 24 and when he went to pick-up they had no idea what his order was. The gentle man said the boss only works days and she has access to those orders on her email. I thought that was really strange but my husband still placed the order. As he was walking out to move his double parked car he thought it strange that there were no other customers. He also made a remark about the door being sticky. In my head I just pictured a restaurant under poor management. The food was good so I'll still give them 3 stars.", "author": "No P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "The boyfriend wasn't a fan... But I sure was. The chicken pho was delicious. The flavor was spot on. The noodles aren't the normal thin strand of pho that you would get but more of the hu tieu type. It's a bit thicker than pho but thinner than hu tieu. \n\nThey give you more than you need in noodles. I wish they would actually give you more broth. But the ingredients were fresh. This is a place I would definitely go to if I were sick and needed some good chicken broth. Specially since there is no Sweet Tomatoes in San Bruno.", "author": "Marlene T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "3.5 stars (rounding to 4) for the chicken pho and spring rolls. My regular craving for pho rolled around, so my friend and I decided to come here. The chicken pho here is pretty good, and the spring rolls are made really fresh! Pho portions are big and potentially food coma inducing. I ordered a small, and in my opinion, it could have passed for a medium or a large. My friend ordered a large, and he said he should have ordered a small. By the end of the meal, he was almost falling asleep. Zzz. Overall, good quality, big portions, and friendly service. I would come back again for the chicken pho and spring rolls. I don't know if I'd be brave enough to try anything new based off of other reviews!", "author": "Corinna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "My family and I have been coming here for years.  They serve Northern style Pho--wider noodles, slightly less sweet broth, and fewer herbs.  The place is usually busy, but the service is friendly, quick, and efficient.    \n\nThe Pho Gau (chicken noodle soup) the the main reason we come back.  It is one of the best in the West Coast, it is the real deal.  The chicken is cooked perfectly, with little pieces of bone, fat, and skin still on it.  I recommend tasting the both before adding any sauces to it.  Sometimes it is a little saltier, so you may need to call an audible on your sauce selections.\n\nWell worth a visit.", "author": "Terry T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-23", "description": "The food may be OK for San Bruno Avenue, which isn't saying a lot.  But, I draw the line at disgusting kitchens and food preparers.  I'm sitting there about the get my food, but wondering why it smells like an ashtray inside, then realize some guy is right outside the door smoking.  He turns, flings the cigarette into the street (charming, as he had been leaning against a trash can) and I see the apron.  Yep - walks right back into the kitchen, and gets back to work.  I know this street well enough that I wanted to confirm, and followed him back back far enough to see -- sure enough, right back at the counter, handling dishes and food.  I told the waiter what I thought, and he clearly saw this as perfectly acceptable.\n\nNever again.", "author": "david p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-02", "description": "Very good pho. I like the pho here better than what I had at the famous Turtle Tower from my point of view. Good price good service neighborhood place", "author": "Kenneth L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-15", "description": "Pho #1 is an okay place to get a bowl of Pho but it probably would not be my first choice.\n\nComing from the South Bay, I've been to my fair share of pho joints and I can say that deviation of the broth flavor should be pretty small across all good pho places.  That being said, the broth at Pho #1 is non-standard.  It's not what you have come to love and expect from a quality bowl of pho and that is its downfall.  That and the fact that they did not bother to cut their spring rolls so we just ended up getting two super long rolls.  \n\nThat in itself is not a big issue but on top of the decidedly off-target broth, it's evident that Pho #1 is sort of a love it or hate it kind of place.  You either love their taste and what they have or, like me, you go to a pho place for a very specific flavor profile supported by the countless pho restaurants in San Jose.  Pho #1 is outside that profile by a significant margin.\n\nThe search for SF Pho continues.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-31", "description": "They're clean and they're attentive enough, but the food is really bland. I had the bun Bo hue. The meat was way too overcooked; it just melted in mouth. That's not how you want to enjoy your meat. It was also very under seasoned. The broth was watered down. On top of all that, the side of fresh cabbage, cilantro, and stuff wasn't fresh at all. It was clearly wilted, but passable enough for me to not make a fuss about. \n\nI don't think I will come back. At least not for the bun Bo hue. If I do come back, I'll give the chicken a try. I highly doubt it though.", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-02", "description": "So the 3 reasons of the 3 stars I've given\n1. The broth in the soup was not horrible but it was plain jane. ( got the chicken noodle)\n2. Cleanliness- a pretty clean and we'll kept retaurant. Nothing that stood out. But cleanliness is definitely a plus.\n3. Gave a half point to each of the two topics I've already mentioned. \n\nWhat lacked my 4 or 5 star rating is the broth and the noodles of the pho was pretty bland. Something I feel would Come out of a packaged box and all you had to do was heat. Also, the service... as most  Asian restaurants are.. I had questions and tried flagging someone down but no cigar.. I was ignored. Checking my water or needs at least once after being here 45 min would be nice. But again, no one responded and they weren't really busy... \n\nIt's a place to go to if you're starving and need sustenance but if your looking for flavor and customer service you're better off going two blocks down.", "author": "Nikole D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-20", "description": "Accessibility (Parking / Wait Time)\n\n1/1 Star:  it looks like parking could be a problem in this area but I got lucky. \n_____\n\nService (Waiter / Cleanness / Ambiance)\n\n0/1 Star: very rude waitress. Questionable smells. \n_____\n\nTaste (0=Not Edible / 1=Edible / 2=Good (average) / 3=Must Try!)\n\n2/3 Stars: noodle soup is not bad, but this Pho place is different from the others. They use wide noodles and they don't give any bean sprouts nor do they provide mint. \n_____\n\n\nOverall Experience\n3/5 Stars \n\n_____\n\nPictures\n\n\n_____\n\nLast Words", "author": "Elliott N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "This my favorite place for eat Pho Ga ( Chicken noodle soup ) on the menu is #7 . Also hainam chicken rice . The chili is home made and very spicy", "author": "tang c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-30", "description": "I  tried to order some small items like beef fried rice and some egg rolls and they told me they ran out of those they just don't take small items to go so I won't go to that restaurant anymore I  gave them 1 star just bad that's all", "author": "Lorie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-16", "description": "Bad service. Unhelpful people. We went in 30 mins before closing to get something to go but they told us we need to go get cash. They told us a bank two blocks down. We said we will be right back. We got cash, paid an extra $3 fee to get the money and came back to see that they have locked their doors 20 mins early. If they didn't want to serve us then they should have told us they are closed down for the night. I will never come back. If they are this rude then I don't want to be served by them.", "author": "Mu H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "Love the chicken noodle with chicken meat and gizzards. Soup is a lil salty, but over all the noodles and food are good.", "author": "Mikey D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-18", "description": "Who wants authentic Vietnamese noodles? I DO!\n\nPeople! These are the flat, wide noodles! Harder to grab with chopsticks? Yes. Ever so delicious? Indeed! \n\nI always always always get the small #12 (rare beef & well-done beef) with a side of bean sprouts. \n\nSome days they give you less soup, so you ask for more. Some days they give you bunch of everything and I leave weighing 20lbs more. \n\nWhatever they're doing it's working because I keep on coming back for more! \n\nIf only they serve rare beef salad, then this place will be heaven. Don't let the \"salad\" part fool you. It's not the leafy kind we eat. I'm talking salad as in the rare beef being the main component of the dish! Just rare beef topped with crushed peanuts, and cilantro served with nuoc cham. Oh my! This is my kryptonite!", "author": "Sandy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-30", "description": "Service is average. Cleanliness is average. Can't expect much from restaurants on San Bruno Ave. This place is WAY better than CaliPHOnia a couple blocks down. \n\nCame with the bf 30 minutes before closing. The place was fairly empty on a Friday night. After reading some yelp reviews, we decided to go with the Pho Ga. Of course the broth is nothing compared to Turtle Tower, but it's decent. They aren't too generous with the chicken meat here! \n\nCASH ONLY. They made it clear right after we ordered.\n\nIll probably be back on the days I'm too lazy to drive out to Sunset or Richmond to get my pho fix.", "author": "Fanny H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-04", "description": "The quality has gone down, and it is sad. For the most part it is now average to good Vietnamese. I think they changed cooks. Almost has that organized crime front to it. It's still the best place around San Bruno Ave for Vietnamese though.", "author": "Joseph H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "I don't know why there are so many mediocre reviews for this restaurant. It's one of the better Viet restaurants on San Bruno Ave (There's another called Cali Pho but it's awful). If you want something top notch, then you're better off driving to sunset, TL, or even SJ. \n\nThe rice and vermicelli plates are pretty good. I always get the bun rieu every time I go and that's almost every week.\n\nOh yeah, their hot sauce is soooo good!!!! It goes super well with the vermicelli dishes.", "author": "Cheryl P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-30", "description": "Eh. I don't know why I came back. Their vermicelli is not actual vermicelli - it's just thin circular white flour noodles. It's not terrible but it does break more and I don't see why the menu would tell me it's vermicelli when it's not. \n\nI had the curry beef stew with vermicelli today and it was okay at first but then there were these pieces of the spices that were in the soup that made it impossible to eat the noodles. It was also super super spicy. \n\nTheir pho ga is not that impressive as they claim either. It was flat and over salted. The noodles were bland. If anything, the curry beef stew vermicelli was better. \n\nAverage service quality for San Bruno St.", "author": "Jannet H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-27", "description": "Great place to grab a bowl of something nice in San Bruno street. This place was one of my first experience with a large bowl of noodle soup for myself , so revisiting this place always brings back memories.\n\nJust a warning for everyone who's had traditional pho around San Francisco, they use wide noodles for their noodle soup rather than thin rice noodles. This bugged me a bit because they aren't chewy as I would like and doesn't carry much soup in between strands.\n\nThe rice plates are great here. My favorite is the grilled pork chop. Just the right amount of spices and not to salty. The imperial roll I had last time I came here was dry, strangely. Perhaps they were sitting under a heat lamp too long.\n\nOverall, decent place to grab lunch to go or sit down.", "author": "George Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "My wife and I go to noodle spot. I always get there chicken noodle soup with intestines and giblets. Cheap. Easy. Hangover cure noodle soup!", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-29", "description": "I had the vermicelli cold noodles with chicken and the egg roll. My chicken was so dry and the portion was like the measure everything out but it was disgusting. My husband had the bun rieu and omg it was just the meat in it and it was bland. We had spring rolls and the lettuce was so old and soggy. I'm Vietnamese too so it was not worth your money to pay for awful Vietnamese food.", "author": "Hoa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-15", "description": "The pork dish we had was good. The pho wasn't great. The broth was too sweet and the noodles were over cooked and not the right type of noodles. \n\nThe staff was pleasant and attentive.", "author": "Sacha L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-28", "description": "If it weren't for my intense craving for Tu Lan now that they've reopened, I would not have given this place another shot! Boo for PHO!!! \n\nThe place didn't close for another 30 minutes and I was only allowed to order from the soup section of the menu. So, I was escorted out the door what I thought would be good pho for this foggy night and I was hungry! To my dismay, I get home to nothing but mushy noodles and scorching broth! Broth that was as oily and bland as the personality of the hostess that took my order. \n\nThere were no sprouts, no basil, no jalapeños no NOTHING!!! Just noodles and broth...extra hot, cooked in hell broth! \n\nMaybe you will get better service and product during hours they aren't sitting around ready to close for the night...my bad!", "author": "Candy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "the best pho (pho ga) & egg rolls (imperial rolls) in frisco; dnt believe other places' hype, this is the spot #sfc", "author": "David M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-29", "description": "Don't come here!  They do not prepare food properly and service here sucks!  \n\nThey serve me and my younger brother frozen meatballs in our pho combination...Seriously WTF! \n\nThey didn't even apologize for it and just went off and microwave the meatballs and dumped it back to us in a bowl.. Really WTH! \n\nAfter this experience I will never recommend or even come back!", "author": "Steven C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-20", "description": "Nice and supper clean kitchen.  Great selection with decent prices!", "author": "Thomas N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-07", "description": "My wife and I ordered seafood noodles and was served with spoiled taste shrimp and couldn't finished our food. we just told the waitress re: shrimp, paid and left...no more San bruno restaurants for us.", "author": "Ruben S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-11", "description": "The outside of Pho looks like it's a hole in the wall but inside is decorated. \n\nThe food is good. Not something I was looking for but the taste is not bad. Not a regular beef pho house but a chicken pho place. \n\nIt is a solid three star for what I had. \n\nThe Negative:: CASH ONLY!", "author": "Hei Ming C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-09", "description": "It seems like this is a Chinese-run Vietnamese restaurant.  I ordered to-go.  The people helping me came right to the door, and got me my order and sent me on my way in less than 10 minutes.  They are cash only, so make sure you remember to stop by the ATM.  \n\nI got the bun rieu and ordered bun bo hue for my husband.  \n\nBun Rieu - 5 STARS!  So tasty!  Okay, I must admit to enjoying a nice broth with red oil floating on it, so if this is not your thing, don't order Bun Rieu.  The crab meatball was super tasty, and not falling apart, and they also included like 4 of them!!!!  Perfect.  Also had SEVERAL pieces of stewed tomatoes, It was a generous offering of all the good stuff.\n\nBun Bo Hue- 3 STARS.  It was okay and had a big hunk of fatty pork which was nice, but the base was not flavorful and spicy enough.  \n\nService- 5 STARS!  Fantastic, friendly, and efficient.  They probably aren't going to make small talk, and tell you about their specials (there aren't any) but they will respect your time, and get your order right.  All I need.  \n\nI took my order to the Dogpatch where I opened it up to eat, and it was still piping hot!  They separate the noodles, soup, and add-ins, so they don't get soggy.  I look forward to trying their other dishes, and sitting down at the restaurant.", "author": "Debra W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-27", "description": "although we don't live fairly close by, my dad just had to drive about 20-30 miles to get to this pho place, because according to him its the best one around the bay right now.\nthis place is decent. the service is good, big open space, not too many people, but good for big groups unlike most pho places i've been to. \n\nyou might have to wait a bit to be seated because there is like only two people running the front and sometimes they are busy to notice you standing by the door\n\nthe food is delicious! \nthe soup had a good rich flavor that is not too strong but not watered down either. \namount of noodles a really generous for the price we pay (which is really cheap) and a good amount of meat as well\n\ntotally would come back if i live any closer, especially  around this time of the year when all you want is soup and noodles.", "author": "Janne Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-02", "description": "Terrible service. I requested for another cup of tea since mine had things floating in it (looks like dust...and lots of it). Instead of replacing my tea, my server told me that \"it's supposed to be like that because it's the tea.\" Well, my sister's cup of \"tea\" didn't look like mine. By the way, your cup of tea doesn't even taste like tea. It just tastes like water. \n\nThe food tasted alright but it was pretty pricey for what it is. On top of that, they charged me $0.75 for one to go box and one to go container. I know we live in SF and we get charged $0.10 for a plastic bag but seriously, $0.75 for two to go items?! That's just bizarre and unheard of. \n\nNot happy and will not come back.", "author": "Forest T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-06", "description": "Decide to tried this place. This place is overall clean but the service is lacking. When I walk in and notice there that the waitress was no where to be found. Waited for a while finally someone came out and took my order. Order the garlic noodles with beef (to go order). For some reason the garlic noodles took longer to come out because a group of four people came in after me and they got their order before I did. One thing I notice is that while waiting there is that none of the waitress was out on the floor. It seem like they are hiding in the kitchen. Got home and took out the box of noodle and my hand was cover in oil. It was disgusting. The portion of noodle was huge but there a few piece of beef.", "author": "Chris Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-25", "description": "This place is alright....   The food is ok. The service is soso. I wish they better place with good pho place and opens late in this area.\n\nHope they change togo soup cup. Stop useing paper soup cup.", "author": "Erica T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-03", "description": "Still a 2-star, but came by when my mom wanted to get their Hai Nan chicken dish. In Chinese, their restaurant mentions their chicken, so I went with Chicken Pho. Chicken was only average. They charge $1 extra for thigh meat, even when they ask you if you want breast or thigh...and no where is it posted they'll charge extra.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-29", "description": "Alright. I live around here so this is pretty much my fast food to go. Nothing really stands out but not bad. Portions are big when you ask for extra noodles.", "author": "Anthony M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-25", "description": "I like this place. I live down the street and come whenever I want quick easy convenient pho.\n\nThey come out fast, fresh, and steaming hot. I don't think you can go wrong with any of the items. \n\nThe noodles are the thick noodles (ho fun) which is delicious, so take note if you actually want the pho noodles.", "author": "Emily M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-21", "description": "The Bun Rieu here is spot on. Tastes very homemade and it's as authentic as it gets. The service here is really good and I love how they use the slightly thinner and wider noodles for their regular pho dishes. \nThe atmosphere isn't average, it can get hot but they always have fans running.\n\nOne issue however is that no modifications can be made to your dish so if you want to skip the green onions or cilantro, it can't be done. Ive had no issue with that, but for those that have preferences with that I wouldnt recommend this place. \nFor all the pho lovers however, this place is really great and since I do live in the area I'm glad I don't have to commute too far just to get a nice bowl of noodle soup.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-18", "description": "I know there are better pho places in the city but this one is close to my house. And it's pretty damn good. We've tried a lot of different things and so far everything is good. Wayyyy better than Cali pho nia down the street. Remember to bring cash!", "author": "Clara Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-21", "description": "One of those Vietnamese Pho restaurant by own Chinese. usually i try not to go to places like that cause i feel that Pho might not be authentic. but i gave it a try since my dad been to this restaurant before and saying that Pho here are good. my dad and i both order a small bowl of  Pho tai, nam, gau for lunch. We also wanted to add meatball but it cost another $2 or $3 depending if you want a lot or little meatball. when we got our food, it was very steamy and hot. the soup base was really like which i like when it was is very hot. the noodle cook to perfection. if my dad and i didn't order the meatball, it would not have been enough meat. the meat are alright. in general their food here are average. could have been better. the service here is alright. one problem is that they don't know vietnamese cause my dad was ordering in vietnamese and they didn't know the language so i figure that most of the worker here are chinese.", "author": "Julie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-07", "description": "The pho is actually decent here but I do think it is a little on the salty side. All I could taste was fish sauce but the pho ga tasted good. It's an alright place if you want something quick and if you're in the neighborhood. Nothing to drive miles and miles for.. The service is ok, same as any pho restaurant.", "author": "Brenda K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-03", "description": "Don't think I'd ever come here again. \n\nCraving some duck noodle soup, I decided to give it a shot. I ordered Dry Duck with bamboo and rice noodles. The broth didn't really have much flavor and there wasn't even that much duck in the dish.. there was mostly bamboo that tasted really musty and weird.\n\nThe condiments on the side was a bit weird. It consist of shredded lettuce with a small wedge of lemon and jalapeños.  It also come with this tangy, fishy sauce that didn't seem to go right with the noodles.  \n\nCash Only.", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "I loooooooooove this place!!!!! It's my favorite restaurant of Vietnamese food! They have the best chicken pho! Try it!!!", "author": "Kristy W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-24", "description": "Be warned my fellow yelpers! If you want mediocre food, poor service, unsanitary waitresses that handle money, clear away dirty dishes then touches your food without washing their hands... then this is the place for you. We live in the area and have eaten there a few times. We are all about supporting local businesses. But today we made it official that we will never step foot inside this restaurant again. My sister, known to be a person that eats anything and never complains, ordered a dish which the meat clearly tasted like it hadn't been handled properly. When we kindly told the waitress immediately, she got defensive and insisted that it was fresh. Then she and the other waitress ganged up on us saying that we didn't know what we were talking about while briskly walking away not showing any interest in what we wanted to say. Since they ignored us again when we called for the check,we requested the manager. We told him that we will pay for everything we had ordered despite of the bad meat and that we were simply telling them to double check the meat so they won't serve it to other customers.  Long story short, we paid in full as any kind customer would and left with our still hungry stomachs but without any appetites. So to sum it up, this is not a restaurant anyone should go eat. Clearly they didn't take customer criticisms well. With this kind of attitude, no way they will succeed. No wonder there isn't a pho#2. Service 0/5. Food, let see...just don't dare to defer!!", "author": "M F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-03", "description": "i always come here when I'm hungover and each time it soooo helps me. The pho is northern style, with thicker noodles and they dont serve it with the veggies, like the basil and bean spout. \n\nWhat makes this place too legit, is the fried pork intestine. I HEART THIS SO MUCH, it's probably an acquired taste because it smells a little funny but its so damn delicious. It's fatty, chewy, and crispy and dipped in this sweet and sour sauce, TO DIE FOR!", "author": "Tam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "CASH ONLY RESTAURANT! love this different style pho. They are the closest and best quick fix that is healthier than fast food. They have the wider noodles, not really what I normally get from Pho restaurants, but the noodle is actually good. And fresh! Pho Ga (chicken pho) small is now my favorite and the only thing I will order from here. ;) They use the same noodles and stir fry them too. It's goood. It think it's Vietnamese chow fun. Yum.", "author": "Gessa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-24", "description": "To be honest and really turned me off this restaurant was the hostess/waitress.  I  always ordered bun Bo hue when I eat at any Vietnamese restaurants.  This restaurant has the worst bun Bo hue I ever experienced.  The meat had foul taste and completely disgusted!!,  the noodle s were extremely overlooked, if I have no teeth like drinking it. \nWhen i told the waitress, she reacted annoyed and gave us rude attitude. The restaurant is not busy at all, half empty on Friday dinner. They don't care,  another waitress bought out 3 pieces of meat for us to taste and dump it on our table and asked us to smell it.  When we were ready to go, I over heard another complaint from another table with 4 women.  One of the decent soft spoken woman wasn't happy with what she had as we'll.  We hurry out the door.  Now, I experienced diarrhea.  This is my first time write a review on yelp. God bless you!!", "author": "Dazy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-24", "description": "How do you know an Asian restaurant is good? When all the white people complain about the service. You the food is bomb when service blows and people still keep coming back for the food.\n\nThis place is known for the chicken pho....order that and you have anything to complain about. People constantly rave about Turtletower and I think this place is better. The wait staff don't speak much Engrish well and some not at all. If you can't speak Viet or Canto, just point at the numbers and you'll do fine.\n\nThe rice plates are also hella bomb. Great cheap place to eat and I go weekly. Look past the servers and enjoy the delicious food and you'll have a great time!", "author": "Mike H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-25", "description": "I just couldn't get a good advice from the waiter.\nI mean, it's the first time i go to a Pho's restaurant, so I don't know what to expect. I wanted to try their \"most authentic\" recipe, but the waiter was just asking \"so which one do you want?\"\nFood was good, but overall experience average", "author": "Oleg K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "This place is the best pho I've had in SF . Been in the city my whole life and this place is awesome. No.8 chicken vermicelli soup or no.12 sooooo good. My friends and I come at least 5 times wa month. My friend from San Mateo even drives up here just for their pho", "author": "Monica L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-23", "description": "Disgusting. The \"shrimp\"  imperial rolls were black and looked like death. My \"crab\" pho tasted like sausage. I'm a pescaterian and the waitress assured me that the crab pho was exclusively crab. I later found out that the \"crab meat\" also had pork in it. Worst restaurant experience of my life. #unreal", "author": "Sam F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-25", "description": "To give you some perspective, I came here at 6:45pm Sunday night. I am not Vietnamese but I have actively sought after good pho where ever I've moved (also, i never use sriracha nor hoisin sauce).\n\nIt was dead empty except me and one other guy.  As soon as I opened the door, a lady immediately showed up and asked \"For here or to go?\" Inner-monologue, i was like \"Damn, that was fast.\" She had a Viet accent but I think spoke some dialect of Cantonese to her coworkers. I walked in to sit down, got a glass of jasmine tea (different, but whatever, i get more).  I open the menu and see that they do mostly chicken pho, which is only slightly unusual. The weird part is they have SNAIL MEAT PHO, LOL. One of these days I have to try that. I chose my usual beer pho instead. ***You have the option of thin or thick noodows***\n\nIt came out in a matter of minutes. Only got jalapeno peppers and lime. No basil or mint. That it a no-no because sometimes the pho broth has a \"wet dog\" smell to it. It may be hard for some of you to believe, but it's not necessarily a bad stench. Anyways, this had a distinct wet dog smell. The lime helped, but mint leaves would be better. Noodle texture good, the taste of the broth was alright but gradually became too salty for me (and i tend to like a little oomf to my pho broth). Beef and beef balls were good. I wish they had tripe.....but hey,.....first world problems.\n\n$6.50 for a small pho in SF, it's not too bad (only the ox soup pho was $7.50). Considering I'm local to this place, I would come here once in a while, but I'd have to water down the broth because gradually it gets so damn salty.\n\nTry it for yourself if you're local to here. Service is very good.", "author": "Winton W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-04", "description": "My dad and i come here a lot because it's close enough to our home where we don't have to trek too far. Many restaurants on San Bruno aren't even close to being a Favorite, but it is mediocre enough for me to come back to. This place isn't too bad but I just dislike that their broth is a bit greasy. I like to get the #14 small ($5.95) with is pho with rare beef, cooked beef, and meatballs. It's northern style here, so no basil or bean sprouts! \n\nMy dad really likes their ox tail noodle soup, but just by looking at it, it was greasy looking and not something I appreciate :( The rest of their food here is just okay. I believe they are CASH ONLY, but there is a nearby Bank of America nearby.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-08", "description": "In my wife and I's never ending search for the best Pho Ga in SF this is just ok. The chicken was tender but they use the flat noodles (I prefer the round ones) and they were already very soft when they hit the table. I prefer the places where the noodles have clearly just been placed in the broth and you have to wait a couple minutes while they soften up. The Imperial Rolls were light and crispy. Service was very quick but think that is due to them having the pho all ready to go with noodles in it - it was on our table inside two minutes. Also no side of basil.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-02", "description": "Some guys have a tendency to do odd things in the company of a lady.  I had sworn off this restaurant after a bad experience last December, but when a past acquaintance spotted me recently and called out my name then suggested we grab lunch at this restaurant I was more than happy to oblige.\n\nOkay so maybe I was a bit over dramatic in my last update.  A restaurant is allowed to have one bad dish.  Am I right?  Fine.  With that said don't ever order the chicken curry with rice.  Trust me on that.  My old friend told me she liked this restaurant and had eaten here several times in the past.  She said she especially enjoyed the fresh fruit drinks the kitchen whirls up.\n\nThe service was excellent as usual.  The warm greeting, the menus in our hands, the cups of hot tea on our table our waitress returned in minutes to take our order.  My friend couldn't decide between the pho or the bun, so I suggested we order one of each and share them.  We had a large Pho Tai Chin Nam (well-done beef and rare beef noodle soup) and the Bun Cha Gio Thit Nuong (grilled BBQ pork and imperial roll vermicelli).  She ordered some frou-frou looking fruit drink that I didn't catch the name of.  I think it was their mango puree.\n\nThe food was on our table within minutes.  My friend thought it was odd that I asked to take a photo of each dish.  She inquired whether I worked for the health department or for a rival restaurant.  She had no idea what Yelp was as my explanation had her seemingly puzzled.  Why not just eat the food?  Why do you write about it too?  \n\nHere's what we got.  The Pho (http://static.px.yelp.com/bphoto/xScGXSwZXXkhwlc-cJc1pw/l) and the Bun (http://static.px.yelp.com/bphoto/BYC-txiCFmN0qp7_IlQ-fA/l) came out in big, deep round bowls.  My friend suggested the portions seemed larger than when she dined alone.  I'm not a big fan of raw red onions.  I was so happy to see my friend scoop off most of the rings of red onion and put it into her bowl.  The thin slices of beef in the Pho were generous in portion size and tasted okay.  The medium width rice noodles were abundant and soft, but I detected the sting of MSG in the broth.  There was enough of it to make me switch my attention to the Bun.  I got in under the mound of cold soft rice vermicelli to get to the shredded lettuce, basil, cucumber strips and bean sprouts.  All of the vegetables were fresh and crispy.  The noodles were nice and chewy.  The thinly sliced grilled pork was tender and had a slight sweetness to it.  The imperial roll was good.  I especially liked that in addition to the crushed peanuts and the sauteed green onion, they added some deep fried onion bits to the top of the dish.  I thought the fried onion enhanced the dish quite well.\n\nAs we ate we engaged in small talk seeing what each of us had been up to over the years, and when we finished eating we went through the entire Chinese ritual of fighting to see who pays the bill.  I suggested that although I was all for equality a good male friend never lets a female friend pay for lunch.  She was cool with that, and I got the bill.\n\nAs we exited the restaurant we stood outside and exchanged our contact information.  It was at that time that she reminded me what her name is because she knew I was clueless to that throughout our lunch.  I felt a bit embarrassed that she knew that all along.  I can be such a doof sometimes!", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-19", "description": "The chicken pho isnt bad here. Its nothing to be amazed about but it will get the job done. And the portions are quite large. Either that or I just dont eat as much as I used to.\n\nIve never really had anything else at this place other than the chicken pho and its just as the stars say it..\"A-OK\"\n\nI'll be sure to give that Salted Baked Chicken a try though...", "author": "phillip w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-10", "description": "Maybe I came at the right time but I walked into an uncrowded, clean looking pho place. This was actually one of the pho places that has more than a couple kinds of noodles. I got a large chicken soup with the flat noodles. The bowl was pretty big and compared to a pretty tiny girl like me, it looked like I was in an eating competition. But don't be fooled because most of it was broth with plenty of noodles and only a couple small piece of chicken floating in the distance. Needless to say, I was pretty satisfied with the amount of noodles and the flavor of the soup. It was light but you can still taste the chicken flavor. The noodles were smooth and chewable but not soggy. The chicken was well, not many. I did enjoy my meal though. I do want to come back and try their other dishes also!", "author": "Stella Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-10", "description": "This place is the best pho place on San Bruno Ave!! \n\nit got great rice plates that gives you lots of meat and their pho is OK. I've tried their chicken pho, seafood pho, and beef pho, their beef pho is nasty so if you had it here, then you wouldn't like this place at all. On the other hand, their chicken pho and seafood were pretty OK. give it a try if you ever swing by. \n\nThe best thing here is their rice plates, that is the reason i come to this joint, their rice plates!!! its really good compare to it's competitors:Cali-pho-nia and Yummy Bowl. Also the place is really clean, but the services is ehh.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-21", "description": "Dont ever eat here. Should change its name from Pho to Phat, order of curry beef stew was disgusting to the point I had them take it back before even eating any (which didnt keep them from charging full price for it). There was no meat. Zero meat, I dont know what was going on in the kitchen that day but they gave us complete fat and gristle. \n   The service was very rude, Pho was thin and mediocre and they serve hot tea in plastic cups which makes me worry about the release of BPA's (which cause cancer). One of the few times in my life I don't tip, but there we go.\n   STAY AWAY (if anything, for the crappy J-Pop they play non stop).", "author": "Simon T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-07", "description": "Okay if you must eat pho and dont want to go Sunset. There is only 2 or 3 pho place around here and this is one of them.\n\nNothing special at all. A \"large\" barely fills me up. The bowl had a huge chip, no big deal, but just look janky. Soup was salty and meat was minimal.\n\nIt's one of those first and last times. Wouldnt come back again.", "author": "U L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-10", "description": "This place isn't for you if you only like the thin rice noodles. They seem to only have flat noodles in their noodle soups. On the other hand, their rice plates are great.\n\nI had the seafood pho the other day and it was WAY better than the beef pho. I don't like the soup in the beef pho because I think they put too much msg in it. I would avoid the beef pho if I were you. The portions are pretty big and taste doesn't get boring, unless if you hated your order.\n\nThe service was like any other. The interior was nice. The lighting was good. Wouldn't mind coming here again once in a long while, since it's in a nice location.", "author": "Hui L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-07", "description": "The best chicken noodle soup in San Francisco , I always order no 7 chicken noodle soup & the chili is home made very spicy", "author": "Tang C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-03", "description": "I have had pho all over San Francisco. This place has the best chicken pho in the city.. The chicken isn't dry and the there is plenty of noodle. If your on this side of town and want pho come a eat here... Bring cash though since they don't take credit cards.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "Got seated right away and the waitress was very friendly and attentive. She was very accommodating when my friend spilled his tea. She was really nice about it and brought us extra tea!\n\nOur food came out pretty fast. I liked that the noodles were the bigger flat kind. I had number 6 chicken noodle soup and it was pretty good. Kinda reminded me of turtle tower. The bowl was deceivingly deep and I couldn't even finish a small.\n\nThis is a pretty good place. I usually go to the sunset for pho but this place is so close to my house. I wouldn't say this is the best I've had but I would definitely come back.", "author": "Camilla G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-24", "description": "I don't think I ever needed to look at their menu. Maybe if I wanted to order a drink then I guess I would.\n\n Number 6(Pho ga) regular sized with no skin, extra peppers and limes please! When it comes out, all I get is one extra lime -_- but whatevers. I like their pho ga more than Turtle Tower's. Why? Simply because I like their broth better. It has a bit of a subtle sweetness to it. It maybe something to do with the shards of red onions in addition to the green onions and parsley. They seem to have more chicken than turtle tower too! I love this place so much I can have it for lunch and then crave it for dinner again the same night.\n\n Only downside to this is a cash only establishment, which I find very unacceptable because they HAVE CHARGED MY CARD before! They deny it but I have credit card statements and family as witnesses. I just feel that they should be more honest about it and just say they changed their policy or whatever excuse they want to give. But instead they chose to lie and deny it all ever happened. Shame on them.", "author": "Elaine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-10", "description": "My wife always craves the chicken pho and Bon Bo hue here. Their broth is very flavorful and not loaded with MSG like some of the other places I've tried. Their appetizers are pretty good too.", "author": "Kendall L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-25", "description": "Sunday afternoon and we decided to get some Pho for lunch on San Bruno.  I ordered the Vermicelli with imperial roll and BBQ pork.  The pork was tender, noodles at the right texture.  \n\nThe price was very reasonable, overall recommeded, not sure about their Pho though since i didn't order that.", "author": "Ben S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-12", "description": "A local pho restaurant I go to that serves BBH, chicken/beef noodle soup to cure my hangovers.  \n\nPrice is decent, less than $10 a person.  \n\nThere BBH has real pork blood in it. I haven't found one in SF yet that has the whole shabang.  The BBH is what brings me and my foodies back.  Does anyone know of any better BBH places in SF?\n\nThey also have this special fried egg roll I always order when I come.  Its wrapped in a flakey crust wrap with shrimp meat inside. Comes with 6 pieces.\n\nI will be back!", "author": "Chanel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-01", "description": "Good food, i always try to eat family style here with my younger sister but i want everything for myself. I get so full! The beef noodle soup is good and always keeps me coming back:) \n\nOnly thing that sucks is they only accept cash.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-25", "description": "I went out of my way today to visit Cali-pho-nia, and had to park pretty far away, and passed Pho #1. I decided, what the heck, might as well try this place out since I was quite a distance from my usual spot. I peered through the window, and they looked pretty busy, which is normally a good sign. I then ordered my usual #12 rare beef, and brisket, and was brought one lemon slice, and some jalapenos. I began to look around and noticed that everyone also received the same sides, and I started to question when the basil, and bean sprout were coming...\n\nThe waitress brought me my soup, and I was shocked to see the flat noodles! Little did I know until I got home and did some research that this Pho in particular was Northern Style, and I guess is made/served with less ingredients. Which made me feel better about the entire experience after the fact. Anyways... even with knowing the differences in soup style, I found that the quality of meat, and broth were pretty poor. I could barely stand the smell of the broth, because it had a gaminess to it, and the beef was in such huge hunks, it made me gag trying to chew. I really wish I'd walked the 3-4 more blocks to my usual spot.", "author": "Melody H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-16", "description": "This place would've got 4 stars but at the end we got grossed out.\n\nI ordered the chicken noodle soup and intestines it was good.\n\nFriends ordered the beef pho it looked gude.\n\nthey also ordered imperial rolls, it came at the end started eating it.\n\nthen my friend sees red dots on the lettuce, freaken red bugs NASTY !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "author": "DOM d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-17", "description": "a-okay chicken noodle, what i like here is the papaya salad, probably the best pho in this neighborhood", "author": "Long C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-22", "description": "****** I would really give this place 2 1/2 star, but since i dont round up, they will get a 2 star. *******\n\nWe came here on a Sunday evening after shopping. I ordered a chicken noodle soup which was pretty good. Although they could give a little bit more chicken meat... I think there was maybe like only 3-4 pieces of meat.... The soup base was however pretty good, it wasn't oily at all. \n\nI would come back again if it was my LAST resort... otherwise, I'll skip this place and go elsewhere", "author": "Jenny G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-30", "description": "Don't come here!! The first time i came here, I thought that this place looks nice. But actually worst place ever!!!!!!\nTheir service was the worst, like even worse than china town's restaurant service! \nThe pho are not traditional, the noodles are  not the right kind, their broth are all made up of MSG, it is not classic chicken broth! There was no sprouts, no basil, no jalapeños, no NOTHING!!! I bet they are cheap asses, so that why the pho only got the broth and noddles, and meat!\nOMG, the plates, cups and bowls are all washed with freaken BLEACH!! You can smell the strong bleach smell, even when there were pho in it!\nMy friends wanted to eat pho one day, so I had go along with them, we ate here, and i wanted to add some soy sauce to my pho, and in the soy sauce was little baby cockroaches!! WTF!!! I didn't eat the pho, and i haven went again since!!", "author": "Nancy W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-15", "description": "Went here on Sunday at around 11:30am pissed after terrible service at San Bruno Cafe. So any service where they even say \"hello\" is really good.  So the waitress did say hi and gave us our menu promptly.\n\nI ordered the chicken vermecilli pho and as other yelpers have said, it only came with lime and jalapenos!  So most of the dish was just soup, 3 pieces of chicken and cheap vermecilli!  I couldn't care if it was Northern Vietnam that serves their pho without any veggies but that is why I eat PHO for the veggies and the soup.  The broth was bland and it was nothing special where you would want to come back.\n\nMy date had 5 spiced chicken.  It came with a veggie soup with carrots.  The soup was okay he says and the chicken dish was nicely done with rice.  The only flaw was the lack of again, veggies.  It came with 2 cold slices of tomatos and 2 cold slices of cucumbers.  No flavors but fish sauce was brought out to complement that probably.\n\nAll in all okay nothing special would not come back for the pho for sure since it had no veggies!", "author": "Eating And Living Well U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-10", "description": "This is my go to neighborhood Pho place. The chicken Pho is incredible. The prices are good and my take out orders are always ready on time! The staff is friendly and I've always had a good experience here!", "author": "Phil C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-16", "description": "A clear indication of something being nasty and dirty in a restaurant are bugs on lettuce.  Not only that, the top of the lettuce looked clean, but I usually flip it over and fold it in half to stuff into my mouth.  I saw about 5 bugs crawling on the back of the leaf.  I didn't want to make a scene since the company I was with are more, quiet about things like that.  TBH, if it were my choice, I would've walked out right there and not pay for my bowl of pho.  I usually come here a couple times a month, not no more!\n\nNasty Nasty, I hope the health department catches on.", "author": "Alice E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-22", "description": "3.5 stars but I'll round up for having bean sprouts and hoisin sauce.\n\nThe bf and I were hungry tigers after a morning of classes and went to san bruno street to find some noodle soup.  I've been craving chicken pho for SOOO long now, and have been disappointed by everything I tried so far.  But I am not one to give up that easily.  I have faith that there is at least 1 place in the city with a decent bowl of pho ga or at least a place that meets all my demands.\n\nAnd Pho #1 did.\n\nThe place serves chicken pho the same way as turtle tower (Northern vietnamese style, with the fat (wide) noodles).  The soup is not as good as turtle tower, but definitely still good.  \n\nThey serve bean sprouts and hoisin sauce here, unlike turtle tower, so my bf and I can finally compromise and he agrees that he'll come here again. \n\nBTW if you want all the veggies that usually come with \"pho\" you need to ask them, other wise they only bring you lime and jalapenos.  \n\nThe bowls are really big here, the price is acceptable for the amount of food and the taste.  \n\nThe place seems really clean and it wasn't very busy, so service was good and fast.", "author": "Zu W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-01", "description": "The lady is a bitch ,service is horrible and don't order a large it's just a small but with more soup, the soup is super salty, no basil or veggie sides, she pissed me off lol, just terrible DON'T COME HERE!!!!", "author": "Allison K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "I like this place. They have good Bun Bo Hue, and their Pho is pretty good too. I love the Bun Rieu, and the chicken salad is proper. I don't think that I've ever had a bad time there. \n\nNo complaints here, though my sister's review has me concerned...", "author": "David L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-30", "description": "Four stars because the Pho Ga was really really good. The broth was sweet, the chicken was good and the noodles were slippery perfect. \n\nAlso their Bun Bo Hue is pretty good cus they give a lot of pork's blood in it. \n\nThe only thing.. there was hair in the chicken -_-\" Black colored hair. It wasn't chicken hair, it was human hair.\n\nEverything else was fine. The service was just the normal asian restaurant service that you'd get anywhere else.", "author": "Jenny Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-15", "description": "I always crave Chicken Pho (Pho Ga) upon returning to SF. After all, home is where the Pho is! I usually go to Turtle Tower, but tried local Pho #1. I wasn't disappointed:\n\nGood broth. Shredded chicken (a bit of skin) with red onion. Good portions (their bowls are deceivingly deep). Wide noodles. Hit the spot. But sadly no veggies, just lime & green chilies. The Bun Rieu looked good and I was happy to see that another homey favorite, Bun Thang (#9), was on the menu. \n\nBe prepared to order in Chinese or English, I tried ordering a \"Pho Ga\" when the waitress shut me down saying she didn't understand Vietnamese...which confused me cause 1) I don't either?! and 2) it's called PHO #1! But that doesn't stop me from coming back for more!!", "author": "Alex N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-14", "description": "Clean environment with decent servings. Really customer friendly, I would highly recommend this place if you are hungry for pho!", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-05", "description": "I drove by Johnson's BBQ half remembering they were closed on Monday and saw the sign for Pho #1 and thought, \"if this isn't soup weather I don't know what is.\" I ordered the large pho ga, and it was huge, for $6.95 after the waitress assured me that they don't use MSG. I got it in like ten minutes and dug in. I always taste it as is before I do anything and man it was already awesome. It was so good that I didn't want to do a lot to it. All I added was a tiny squirt of lime and four chili slices. I stirred it a bit and waited a minute for the flavors to blend and truly went at it. \n\nI don't mean to sound corny but when I get good pho it's like a warm happy feeling starts in my middle and grows the more I eat until my whole body is tingling. Does this happen to anyone else?\n\nOne star off because it was so cold in there the waitress and all the customers had to wear their jackets.\n\none star for the asshole cop that pulled me over for no reason out front.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-05", "description": "This place got me and few other co-workers in trouble with the boss!!  We left the office for about 2 hours to locate the famous pho #1 salted baked chicken. After 30 mins of driving in across town in a small ass 2008 Civic SI, with 5 200 + lb guys... (let me tell you the new Civic SI's are fast, but damn 5 ass people didn't help at all!)... cramped up in a civic, fighting for the shot gun position...boy was I lucky to get it on the way there! Back seat was no fun. We finally made it after 30 mins, I kept telling my co-workers that it better be worth the car ride and the bitching later on!! MAN WAS IT WORTH IT! This was definitely the best salted baked chicken I've ever eaten. Moist, savory, and flavorful! The ginger dipping sauce they giving you is to die for! The best i've had any where. \n\nDon't come here for the pho or the other rice plates, just come here for the salted baked chicken. You won't regret ordering it. I mean if i can suffer a 5 man car ride in a small ass car, and being bitched at by the boss.. just for this chicken, it definitely is good! \n\nOrder an Ice coffee to go with your meal as well. They drip it themselves, and it's very strong! Perfect drink to go with your meal!", "author": "Brian P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-02", "description": "Well I came here after reading the other reviews, thinking that the Pho Ga was going to be like Turtle towers Pho Ga (chicken noodle soup). I should of known better, no one can fade Turtle towers Pho Ga.\n\nThe things that I liked here:\nHot cup of tea, it tasted very good. It was something about it being in a regular cup and not in a tea cup made it taste real good.\n\nThe bowls for the soup were huge, and they had the chopsticks and spoons black instead of the regular white or green at most Pho spots.\n\nThe spoons I liked very much, it had a little hook at the end so it can never fall into the soup. It always hooked on the side of the bowl. (Good one).\n\nI also liked how they brought each individual order one by one and not in a tray. It felt like they really cared about each bowl of soup or plate of food.\n\nThings that they need to work on:\n\nSo I ordered the number 7 large, which was the Chicken Noodle soup with intestine. The Pho Ga soup, it tasted OK if i have never tasted Turtle towers soup before. It had alot of MSG which i usually like alot of, but they kind of over did it on this one. Once the soup touched the tongue it numbed it right away. (That's alot of MSG!) The style was northern Vietnam, but they were mostly speaking Chinese and not Vietnamese. \n\nOverall my experience was good, the place is worth trying out. The service was pretty good for it being pretty busy on a Saturday afternoon. I would definitely come back and try something new. I will still stick with Turtle tower for my Pho Ga, but i want to try that crab tomato soup everyone is talking about.\n\n3.5 Stars for Pho #1", "author": "Lux K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-01", "description": "I did not have cash on me so I had to use the ATM machine outside BofA, costing me $3 additional dollars for withdrawing $$ from another financial insitution other than Wells Fargo.  The service was OK but that's what I normally expect coming to these kinds of places.  I ordered pho dac biet, ga luoc, and a plate of cha gio.  The cha gio was good, I admit and the ga louc was good as well but their pho wasn't up to my standards.  \n\nI want to go back to try their rice and vermicelli dishes..", "author": "Tram N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-11", "description": "Eh.  My parents are from the southern region of VN (Kien Giang - super close to Thailand) and I came in knowing that this joint is Northern...\n\nIt's okay.  Soup is sweet, but super oily!  The broth was really clear but the oil splotches...uhh..no.  And just lime & jalapenos?!  I get it, Northern VN climate is not suitable to grow bean sprouts or Thai basil..and supposedly PHO is a northern thing...but c'mon!  If you don't give us veggies, then give us more noodles or  better yet, meat!\n\n$6 for 5 slices of beef and super overcooked wide noodles?   No thanks.", "author": "Thuy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-13", "description": "Finally decided to come here and dine in today, rather than getting to go. This time I ordered the rare steak noodle, which was not on the menu. For some reason, their tai is with cooked and rare steak. Sounds weird, but I just ordered the rare steak. It was not placed on a separate plate, but it was still pink and NEVER went dry or overcooked as it bathed in my noodle soup the whole time. The soup was warm to hot, so it was a bit of a surprise that my beef didn't get all wrinkly and dry. Very high quality beef that was thick and tender. One thing that does bother me a bit is that they don't give out bean sprouts here (just onions & green onions in the soup w/ the jalapeno and lime to the side). Although I ordered the small this time and it looked small, its contents weren't. It took a while for me to finish, and I was pretty full by the time I got done.\n\nThe service was basically like most Chinese/Vietnamese restaurants. Not much service indeed, but pleasant enough. I saw the worker continuously wiping the walls and all.\n\nThis place was clean and neat. They probably tried to go modern with the walls painted green, but didn't quite make it. The dull pinkish red molding/trim absolutely gave the place an Asian feel. The plastic lights on top definitely added to that feel. But they do have some cute decor that reminded me a bit of Penang Garden. Flatscreen tv near the back that plays old school Chinese and Vietnamese music. \n\nI also ordered the papaya salad with beef and it was definitely not the best I've had. The dish looked colorful enough, but almost too colorful. If I hadn't known that I ordered a papaya salad or what a papaya salad was, I would think its some kind of mixed salad (for there was almost the same amount of cabbage as there were papaya and the shredded carrots following). The salad was also mixed with a generous amount of nuts and flaky little crunchy things (never knew what those were called). The 4 shrimp chips were random and again, very Asian. The papaya shreds could've been cut more thoroughly, for lots of it stuck together in a big chunk. There was also no TANG to the dish, when there should be. This was almost a miss, but I managed to finish almost all of it cause I love green papaya!\n\nThey also gave me a free egg custard dessert afterward and it was pretty good. It reminded me of the ones my mom used to buy/make for me when I was a kid. I hope that's not their version of creme brulee though. Ha. Yummy indeed.\n\nPrices - very good. \nPlace - very clean.\nService - like any other Viet/Chinese restaurant.\nFood - noodles are definitely a hit, but not so much the salad.", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-12", "description": "I came here when it was first opened. I ordered a Bun Bo Hue here but felt like the chef has no idea what it suppose to look like because he must thought the food was made for a westerner. I know i went to a pho place and ordered Bun Bo Hue, but if it is on the menu then i believe it is all good. Price is okay.", "author": "Michael Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-08", "description": "I come here at least once a month. I love northern styled pho with the wide noodles. This is the place for that (other than Turtle Tower). That thin noodle stuff you get at other places? I don't tolerate that stuff. I find those noodles to be the kind of noodles that are hard to put into a little spoon because it gets tangled into a little mess AND.. my sriracha just does not taste right with it. \n\nYou see, I have a platonic relationship with my sriracha. We go hand in hand. I give it loving by eating it with my favorite foods, and it supplies me with a hot spicy flavorgasm in my mouth. \n\nAnyways, Pho #1 has very good Pho Ga. The chicken here is soooooo moist! (Just thinking about it is making me drool) Sriracha + Pho #1 = love\n\nI think we have a winner.", "author": "Danielle Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-03", "description": "Even though it is listed as \"pho\", it is not the typical pho you would expect. This is the chicken pho, which means the noodle is a bit different. So don't be surprise if its not what you expect. Flavor of the food is actually not too bad, but I can't give more than 2 stars because the food is SO OILY!!! When the soup got to my table, you see an entire layer of oil, not soup. Yuck! Definitely had better.", "author": "Sappho C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "I really don't understand all the bad reviews for this place. I have to say because of the negative reviews, it took me this many years to try it and I live in the area. The hubs had the chicken pho, the kids had the meatball pho and i had the pork and eggroll vermichelli. All were very tasty! I especially liked my vermicelli, it had alot of garnishes in it, veggies, etc. The pho was very tasty too! The service was fast and friendly, I will definitely come back.", "author": "Ravenous T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-15", "description": "Finally, a new Pho place that open around my work.  Now, granted this place is only a few days old so I'll give it time for them to improve on the service and the taste....but I am still excited to have more variety of food in this neighborhood.  Their specialty....Pho Ga (chicken pho) and Pho Tai stands out when compared to their 20 or so different types of soup base and noodles.  I tried their Bun Bo Hue since I got there late and the ladies were already having their Pho Ga and made me try something else.  \n\nFor their Pho Ga...i'll say it's pretty decent but the broth is a little off, it can use a little bit more seasoning.  As for the Bun Bo Hue, their broth was good. Very filling and very meaty.  I jokingly complained to the owner that it wasnt spicy enough, owner jokingly told me to add more chili sauce, dipshit.  They also have the charbroiled pork with vermicelli and egg rolls that he recommend I try next time I'm there.......yes sir!  The typical vietnamese dessert drinks, grass jelly, three star mix and milkshakes make up the rest of the menu.\n\nNow I know the owner of this place for quite a while.  He was the chef at \"the Window\" and her sister is running the \"little window\" pho place off of Noriega.  I know in due time the broth will taste just right and things will definitely taste great......tastes good now...but will taste great soon.   Will most definitely come back here and try their other dishes.  Service was not up to par yet.....most of the waitresses have A.D.D. and are lost most of the time.  Kinda funny to get the bill when we are in the middle of our meal =)  You can really tell the workers there are inexperience with the vietnamese noodle house atmosphere.\n\n*edit* - 9/24/07 - \nAh...this is more like it!  In less than 2 weeks they have definitely turn the place around.  Service is superbly better and the food tastes good.  Had their Crab Meat in Tomato soup vermicelli and that tasted great.  The crabmeat is full of flavor, soft and meaty......nice nice nice.  Expect me back here more now.", "author": "Dave L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-20", "description": "Wow, their chicken intestine noodle reminds me of turtle tower's.\nThe broth was flavorful and the rice noodle tasted fresh.  They do not offer bean sprouts or basil.  Only lime and Jalapeno.  Which was okay with me.  I guess it's more northern Vietnamese style pho.  The waiter was nice and patience since our friend was not here before us.   And the service was quick.  \nOne star off because my friend found 2 fruit flies drowned inside the fish sauce bottle.  My friend didn't make a fuss over it but request the lady to replace it. She apologized, took it away... but never gave her another fish sauce bottle, i ended up walking across the table to grab that bottle for her to use.  \nOverall, good noodles for a inexpensive price.  \nBe aware of parking around noon time when everyone is out for lunch.  I had to drive in a few blocks for residential parking.", "author": "Selina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-14", "description": "After a night of ingesting alcohol, I felt like a nice bowl of pho. I remembered a friend telling me about a place with Pho Ga that's even better than Turtle Tower around San Bruno. noo waaayyyy! Since I was in the area, I immediately called for the 10-20 of the spot.  \n\nThe Chicken Pho was similar to Turtle Tower's in terms of being \"Northern style\", but different in the area of taste. I can tell they probably used the beef noodle soup broth, but that combo worked as it was tasty. The chicken was tender so no complaints there. One thing I should note is that their \"ho fun\" noodles was on the softer side. Depending on the person, they may or may not like this. All in all, it was a good bowl of pho ga. If you like Turtle Tower's #9, you gotta check this place out!", "author": "Al W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-11", "description": "I came here for a family dinner one night and the overall customer service and food was great. Their price and portion was reasonable. But I came here two days ago to order some food togo. I ordered for 6 orders and this one waitress she was extremely rude and disturbing, I was not ready and she kept rushing me, while I was on the phone asking exactly what my friends wanted, she kept disturbing me with what I wanted. I found that extremely rude because she kept rushing me when I was on the phone, and there wasn't even anyone waiting to order or to be seated. SHE is one of the asian waitress with black framed glasses, kinda skinny, tall extremely rude!!", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-19", "description": "I would definitely say I am a loyal, regular customer here. I truly love every dish that comes out of the Pho #1 Kitchen! My usual is the #7 small, chicken noodle soup with intestines..but if you're not a chicken gut person you can order the #6, chicken noodle soup minus the guts. I strongly reccomend this place! It has thick noodles instead of the usual thin, its northern style pho, i believe. The broth is amazing and the chicken is not dry.\n\nand their crab is awesome!! I hate crab but the aroma of garlic draws me in to this yummy dish.\n\nService very friendly!\n\nBeware! They dont advertise it but its cash only!!", "author": "nichol l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-06", "description": "I order from them quite often becasue it's fast and easy. The food is pretty good. The portions are decent but has shrunk in the past year. \nGive it a try!", "author": "C B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-26", "description": "Pho of the most unappetizing, non-delicious variety.\n\nI don't know where Jenny L saw \"vegetarian pho\" on the menu. When we asked the server, she clearly indicated that not one thing on the menu was vegetarian nor even remotely so. We asked if they could maybe just serve some vegetables and rice for our vegetarian friend, which she refused to do. Finally, she attempted to describe what kind of vegetables they had, but, unable to express it in English, she disappeared and returned with bok choy in hand. Fine, we said, she'll have the bok choy.\n\nMy meat eating friends and i all ordered the bbq pho with beef and pork. The meat was beyond inedible. It was almost completely fat, some of it unidentifiable organs (which alone I would have chalked up to cultural discrepancies). My beef had an iridescent green shade...I decided not to eat any more of it lest it be rancid. We fished white pig's feet from the soups, with the bumpy hair follicles still clearly evident. \n\nI should have ordered the bok choy. I will not be back.", "author": "Gabrielle A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-26", "description": "One of the only places in the city that serves a decent Bun Rieu.  Not all vietnamese noodle houses serves this dish, I've had my share of bad imitations at other places, so if you like crab and shrimp in a tangy tomato base soup, this is the place for you.  \n\nAlso, since their store front claims great Pho Ga (chicken noodle soup), i encourage you to try that too.  Great broth and delicious chicken pieces.  I always ask for a side dish of ginger and scallion so I can enjoy it the chinese way.\n\nIf you still have room after your entree, try out their pancake, it's topped with tons of shrimp and pork and fried just to the right crispy-ness.\n\nNothing like a good bowl of noodle soup for those cold cold windy nights in SF!!!", "author": "Ames K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-25", "description": "The place is well lit, but a bit dingy as far as cleanliness for a restaurant.  Close to home and pretty good pho ga for those cold foggy san francisco nights.  Service is hit or miss.", "author": "judy l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-09", "description": "I ask the lady..\"Do you have bean sprouts and peppers for my soup\"\n\nShe goes..\"Thats not are Style!!!\"\n\nI was thinking damm..That was Strong!", "author": "Eko A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-15", "description": "This pho was edible. I wouldn't say horrible, but the meat was not good and what the heck was in the lemonade. It tasted like lemon cough syrup if that even existed. And it was weird because when we went, all the people here had drinks, shakes, lemonade, iced coffee, tea. I would NOT order a drink if I were you, I couldn't even drink mine, but I am generally not trying to antagonize servers/cooks and did not want to send it back or ask for a refund for $1.50. I wouldn't come here again.", "author": "Lily G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-29", "description": "This place was freakin disgusting! Hecka peed off cuz I ordered Bun Bo Hua over the phone. I should have went in. How the heck is there a small fruit fly in my soup? and the couple bites I did take before I seen the nasty bug it tasted like my meat was rancid. Totally ended up eating my boyfriends tacos! The people working at this place were Chinese.. I'm not at all discriminating, but if your Chinese and your cooking \"VIETNAMESE\" food.. at least  learn the culture and the dish! I regretted not going to CaliPhoNia down the block. Never again.", "author": "Priscilla B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-01", "description": "The food here is very tasty! My sister was driving us to our dance class at the Metronome and she got lost (again) so we decided to pull over and get dinner first. I didn't have any expectations since there were only 2 other pple when we sat down to order. Pay $6.95 for the large pho and they bring you a bowl that's about the size of a small sink. I honestly think that this was the biggest bowl of pho I've ever eaten. I didn't know that there were different styles of pho (silly, uneducated me) and after some research, I now know that this restaurant serves a more Northern style of pho. This is an interesting article about the history of pho, for those interested. \n\nhttp://www.wright.edu/~tran.dung/pho.htm\n\nI got really curious and excited when I saw snail noodle soup on the menu so I ordered it while my sister satisfied her craving for chicken pho. My snail soup came in a tomato broth, had veggies and was surprisingly un-fishy. I never know what I'm gonna get when I randomly order things on a menu in a place that I've never been but I was pretty happy with what I got. Both soups had a flavorful broth and didn't simply taste like msg water. The table next to us got a really interesting appetizer dish of sliced meats, lettuce and spring rolls that we're gonna try next time. The only complaint I have is that the restaurant was freeeeeeezing; it was colder inside than it was out! I guess it doesn't matter once you get your soup but it would've been nice to be able to take my jacket off while I ate...", "author": "Queenie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-25", "description": "After a fun day of shooting in a windy day, Pho fix is what I need.  So we decided to try this place since it was close to our fellow shooter's home and we can conveniently drop him off home afterward.  What was ordered:\n\nSpring Roll filled with shrimp and pork - well wrapped but no flavor, worst than bland.  How is that even possible, I have no idea.  I suppose they assume you can drink the accompanied peanut hoisin sauce, which was watered down, you can't even taste the sauce.  \n\nFried Chicken - another bland dish.  All this dish was, was just the name.  No seasoning or anything.  Fried right and not greasy, but blah.  \n\nCurry Chicken with Bread - the flavor of the curry sauce was actually nice, but the chicken and bread Not.  I can tell that the chicken meat tasted weird and not quality grade.\n\nBun Ouc/Sea Snail Rice Noodle Soup - You don't get this dish in most Vietnamese restaurant, so I just have to have it.  It was nicely prepared with generous amount of sea snails but lacking the fragrant herb and spice flavors as far as authenticity.    They also used canned tomatoes, which was not as good as fresh tomatoes.  It was overall okay.\n\nService sucks they brought out the appetizers 20 minutes after the entrees came out.  The entrees were 10 minutes apart from one another.  As you may imagine, not fun watching someone else eat first and half finish before yours arrive or have their food get cold, if they so choose to wait to eat with you.  This kind of poor service really ruined the restaurant experience  of enjoying food together.  Ugh.\n\nThey have potential to make it better and if they are smart, they should jump on that since there are plenty of competing restaurants on the same strip.", "author": "Vanna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "The chicken noodle soup is delicious. The chicken is smooth and tender . The noodles were nice and slippery ... very yummy !! I also had a side order of rare steak which was very good .... the quality of the meat is good and the meat is not too thin or thick . I've had the bun rieu in the past and it did not impress me . Their soy milk tastes kind of weird . It's not sweet at all and does not taste very fresh . Just come for the chicken noodle soup. Skip everything else.", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-03", "description": "I like the Pho Ga (Chicken Noodle Soup) here. It's actually better than a lot of places. But definitely not better than Turtle Tower. The place is decent, but it's very dirty. The chopsticks and plates look disgusting. After seeing those stuff I never wanna go back there again.", "author": "cadence p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-04", "description": "I'm quite obsessed with their seafood pho because they have bits of fried onions in the soup.  I know it's super weird because it overpowers the seafood taste, but i really dig that fried onion taste in my soup, lol.  \n\nThe small is quite large in my opinion, and every time I finish the whole thing, I look as if im pregnant, lol.  \n\nTry to avoid sitting in the back because they have this blender that's as loud as a jackhammer.  It gets really annoying after a while.  And it gets super annoying when people keep ordering drinks that requires that stinking machine.  \n\nOf course there's better pho elsewhere, but I'm hooked on that fried onion stuff in my seafood pho.  -_-", "author": "Emily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-15", "description": "The best chicken pho! I live close to this restuarant so I usually just call them and order my chicken pho to go. It is ready within 10 minutes, so i will just drive down there and call them to help me bring the food outside. They are actually really nice to do so. \n\nParking sometimes is hard, especially during lunch hours.", "author": "Willa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-03", "description": "My recommendations are:\n\nCrab meat rice noodles in tomato soup - because I have never seen such big chunks of crab meat, soup is HOT, and good for a chilly afternoon.\n\nChicken salad with sesame - I just can't stop eating when it's on the table.\n\nCoconut drink with red beans - thirst-beat iced drinks which I hardly finished up as I was stuffed with noodles.\n\nThey have some crab special on menu, will report after trial!", "author": "Woodspy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-08", "description": "The GayZ visited this restaurant on a Thursday night with his husbear and immediately noticed that they did not have goi cuon (spring rolls) on the menu. \"No problem,\" I thought. \"They must have just forgotten to put it on the menu. I'll ask.\"  When I did, I got a blank stare and had to repeat myself. The waitress who must have been the owner's wife said that they didn't have them. \n\n\"That's fine,\" I thought. \"Deny me my spring rolls. I'll just try something else!\" So I did. I ordered a large seafood pho and a chicken salad to share. Husbear had the large beef pho. The chicken salad came first and was excellent - shredded thin and piled high with cabbage, carrots, mint, crushed peanuts and really fresh tasting chicken with crispy garlic on top. Mmmm mmm. \n\nThen came the pho - without bean sprouts or herbs. Just limes and jalepenos. Husbear asked for sprouts and the lady just said \"Um, this is a Vietnamese restaurant. We don't have bean sprouts. I have basil. I bring you that.\" When she left both me and cubby were like, \"Ooohhh ahn ahhh!!!\" (general sound of disbelief) I could not believe the bitch said \"this is a Vietnamese restaurant.\" Bitch, I could have told you that!! How you gonna tell me that this is a Vietnamese restaurant and then tell me you don't have goi cuon or bean sprouts?? Whatever. They had Teresa Tang playing on the stereo when we came in, this place is Chinese!!!\n\nAnyway, the pho was alright at best. Both soups had good flavor, but the wide rice noodles were WAY over cooked, to the point that they were just falling apart and gloppy. What's more, all of my seafood was overcooked, everything from the unseasoned squid to the shrimp and the imitation crab. Just about the only seafood that was good was the fish cake. \n\nI might go back to try the Bun Cha (vermicelli bowl) or have the salad again, but this is definitely not the place for pho. I'll stick with Them Ky in the Trenderloin for that. \n\nthree stars for english speaking waitress and one star for yummy chicken salad, but minus one star for overcooked noodles and no goi cuon.", "author": "Jeff K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-30", "description": "I went to this restaurant for some pho yesterday with my friend and ordered the beef stew. And let me tell you, it was delicious. Although, it took a while to get the food, and the service was decent. It was really busy and the workers were nice. I give this restaurant Okay.", "author": "Sandy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-25", "description": "I placed the order over the phone and the lady who answered had a hard time understanding what I said. Then I picked up the food and everything is good. The taste is good. It's better than the pho place on noreiga but not as good as Turtle Tower. The soup taste is really good but the chicken is so so. Overall, me and my gf both love it. We will be eating there more. \n\nSuggestion: I will take some pics next time when I eat there. We need pic of the menu if anybody can post up.", "author": "Win S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-05", "description": "I'm glad that we now have a Pho place in Portola. Silver Garden wasn't great anyways. It was just cheap. \n\nThis place does not have the BEST pho. It's just a decent. I guess you only know what's suppose to compliment with Pho if you are Vietnamese or a Pho fan. This place has does not have herbs (mint or basil) to accompany with the noodle soup (Pho, Bun Rieu, Bun Bo Hue). \n\nI have not try their Pho, but according to my family it is only OKAY. I have tried their Bun Bo Hue. It is actually the only thing that I ate there. Their Bun Bo Hue is also okay. No basil complimentary, just shredded cabbage, and bean sprout?. We asked for them and their excuse was that they're from the North. Northern Pho does not come with herbs. SURE! Herbs are expensive, that's why you don't give them. That's more reasonable. \n\nThey're not 100% Vietnamese. They're Chinese in Vietnam or half Chinese something like that. Don't get me wrong. I'm half Vietnamese and Chinese. My point is don't expect too much authenticity when Chinese cooks Vietnamese food or Chinese cooking Japanese food. Yes, there are ones that have done quite a good job, but I feel more comfortable when they cook their own ethnic food.", "author": "MT D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-30", "description": "Windy, cold, and hungry. Again we were at an intersection for chinese or vietnamese. Exited 101S, and here we are. Pho #1. We did go to Yummy Bowl, but they were closed and told us to go down a block to Pho #1.\nWith that, we had vietnamese for dinner.\n4 stars -good location, easy parking, cheap eats\n3 stars- no banh mi sandwiches!\n3 stars- clean ladies room which is important cause it reflects the staff there\n3 stars- open late\n\nWill return in the future!", "author": "Mauling W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-13", "description": "Whenever I don't get tempted by the thought of roast pork at Wing Sing across the street, I come here for pho and the warm soup. I particularly like the conch noodle soup. My taste buds love the tomato broth soup it comes in.", "author": "H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "Not bad for some pho or bun Bo hue if you consider that it is more Chinese orientated than Vietnamese but if you want a clean nice service restaurant with decent pho I suggest this place as Id like to say I'm a regular here. But beware if you want the \"Vietnamese noodles\" or rice noodles here you needa ask for them as their noodle soups comes with egg noodles", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-06", "description": "Two words:  too salty.  Broth in my pho was too salty, but the waitress has a nice bum, I'll give her that.  Sorry for the sexist comment, but this is the last time I'm coming here, that's for sure.", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-22", "description": "Their chicken Pho is the best I've tasted, they have a few other descent dishes, but nothing special. Their drinks are below average. If you want chicken pho, go here.", "author": "Killua Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-15", "description": "What kind of Vietnamese restaurant doesn't have basil?  A fake one.  And they don't even have vermicelli in their pho?  What?!  Disgrace to Vietnamese cuisine.  Bleh.  And to make things worse.  Terrible service and Cash only.  Do yourself a favor, don't come here.", "author": "David N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-12", "description": "Service is as shi**y as the look on the waitress' face. I see why she's only a waitress.  Which one, you may ask? The one that never smiles and pretends not to see you when you walk in or when you need the check. I still eat here because the pho is different and DECENT at best.", "author": "D. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-29", "description": "Been here twice. Once for chicken pho and another for the beef pho with everything.\nChicken pho was pretty good, I'd get it again. Oily but not too greasy. Garlicy but not too potent. Juicy chicken. I like.\nBeef pho, not so much. had better elsewhere. I don't think they change the broth... gross...\nService sucks. They also need to get that door fixed so that it closes when you want! The wind keeps blowing the door open and its been freakin cold!", "author": "Jimmy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-27", "description": "Worth the trip out to a part of town that you've probably never been to for this truly authentic spot.  Service was very friendly and considerate.  We came with one veggie in the group.  They were very accommodating to her needs.  I must note that there were no vegetarian items on the menu except the spring rolls and an excellent dessert and drink menu. \n\nMake sure to order the papaya salad (w/o fish sauce for the veggie) and the spring rolls were slammin.  The Pho was a bit too authentic for much of our group's taste.  I ordered the Spicy Beef and Pork Pho.  The broth was delicious but I was a bit taken by the choice of Pork parts that was selected.  I'll spare you most the details, but mention that I've  never before played with pig hoof.  Had a good laugh convincing our  friend his beef ball soup was a different kind of ball than it was.\n\nAll in all a good spot and the prices were right. A bit more description  on the menu would have been helpful.  The fourth star is mostly for making us come to a part of town we've never been to.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-25", "description": "This is not your traditional pho place...the noodles are thicker you get shredded cabbage instead of bean sprouts for the soup. The soup was pretty good but I've had better...service wasn't all that great either. Lastly, it is CASH ONLY! I hate that because I never seem to have cash on me when I need it...haha I don't think I would come back here again unless I happen to be in the area.", "author": "Karen Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-17", "description": "Bring a big jacket when you come here. I swear I got up like 5 times to close their stupid brokenass door.  So cold... :(\n\nThe service is WEAK!.. It took longer to get the check and pay than to eat the f'n Pho. We were a minute away from dashing. haha lol..  when the waiter came flying out the back like Usain Bolt when we got up to leave. Probably to check the cash. -__-. Where the f were you before??\n\nThe Pho: is not even Pho. The noodles. WTF. It was some thick rice noodle. :( No bean sprouts, mint leaves? I asked her why.. she said this place is not Vietnamese. bahaha. The soup base was good though. :)\n\nTheir Vietnamese coffee with condensed milk was :D.  Too bad it was such a small portion.\n\nIs this place Pho real?", "author": "Simon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-23", "description": "Never understood places that only serve Grilled Pork Chop- Grilled Pork (slices) is SOOOO much better!  And the grilled pork over here is SUPER good!  The slices are tender and packed with flavor, goes perfectly with their fish sauce.  The ladies are nice and attentive.  Nice addition to the neighborhood!", "author": "Judy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-17", "description": "Vegetarian pho in beef broth.  Sounds like an oxymoron but it definitely cures the worst of hangovers.  Not the best service, but that is expected.  Hopefully won't have to go back again due to hangovers.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "Yummy cheap food. The garlic noodles are ridonkulous.", "author": "Pamela W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-24", "description": "I am just a white girl who loves ethnic food. I have no idea of the authenticity level of the food they serve at Pho# 1. All I can say, is the grilled barbecue beef with noodles, #30 on the menu, is so good! It is such a nice alternative to fast food. For under $7.00, you get delicious barbecue beef over noodles, with fresh mint, bean sprouts and cucumbers. The meat is so good, with no fat, that is the best part. The food is fresh and tasty, not greasy. I would love to see a little more meat on my plate, this is why the 4 star rating. Other than that, this place is delicious. I order it to go, as the restaurant is not the most cozy. I would rather curl up at my house to enjoy.", "author": "Keri V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-01", "description": "this is absolutely  the worse Vietnamese restaurant i have ever eat , i order an pho .. first its bit over price.. second the soup is fill with msg, i am drink like gold fish after eating the meal .. third , they don't serve basil nor bean sprout with pho ,, when i ask the waitress they said they never serve basil for pho..however she did bring out an small portion of bean sprout.. can you imagine eating pho with out basil.. its like eating burger without beef patty .. also the noodle are not the right thin traditional Vietnam noodle ,,its thick ho fan noodle.. on top of that ,, the service is very poor..  no wonder this place have no business.. they deserve what they  got .. if there is negative 5 star , this place would have win it easily...", "author": "sunny s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-30", "description": "each time i come here for pho, they serve the round or the chinese flat noodles. didn't even give bean sprouts. cheapskates!", "author": "J K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-12", "description": "My pho place to go to when I'm in the Portola. The service is attentive and friendly. The place is bright, spacious and clean. The bowls of pho are big and prices cheap. I usually cheat and get the chicken pho-delicious on a cold afternoon.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-02", "description": "This place specializes in chicken pho and is a little different from the usual pho place.  First of all, if you are a bean sprout fan just like I am, you might not like it here because they claim they are some regional vietnamese food that bean sprouts and the usual herbs are not suppose to be eaten with the noodles.  The kind of noodles they use are also different.  It is softer and wider.  Some might like it but I prefer the regular pho noodles that has a chew to it.  The broth actually tasted good and was flavorful.", "author": "Heidi F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-22", "description": "I feel like I'm one of the few white people who live in portola... and most places around here I'm a little intimidated to go to.  But the vermicelli noodles with bbq pork are so delicious I will face my fears and order from them.  A friend of mine made the mistake of straying from the noodle dishes... not such a good idea.", "author": "Amanda D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-08", "description": "I have to update my previous review...my 2nd visit I had #14 Beef pho with thin rice noodles instead of the wide flat noodles.  Though the noodles are not the same as most southern Pho, the soup was good.  The broth was flavorful and not greasy.  The beef was tender but I only got 2 beef balls.  I will definitely return for the quail or claypot.  There are no decent Pho places south of the Tenderloin and this place is almost as good.  Place is clean and staff is friendly. Plus they serve beer.  Cash only", "author": "May M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-16", "description": "i love this place, even though they don't serve real pho noodles, i still adore this place very much. i haven't ordered anything to deal with lettuce here since i've read many other reviews about bugs on them. the only thing that i mainly order from here is their chicken noodle soup, it is amazingly good! i haven't found any chicken noodle soup that is as good as the ones from turtle tower. even though the service here is a little bit slow, their chicken noodle soup makes everything all better haha.", "author": "Yummy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-31", "description": "Two large bowls of number 15 for me and my babe please!! For those of you who dont know what I'm talking about, its crab meat in tomato sauce with rice noodles. YUMMY!! Too hot for a hot bowl of noodle soup?? No problem, try number 30!! Vermicelli with BBQ beef with fresh veggies. Me and my husband always finds a way to eat here regardless of the weather. One problem though, I must fight with every other asian person trying to get parking on San Bruno Avenue. If you live around this area, best to walk or take the bus.", "author": "Anonymous P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-26", "description": "It's a different type of Pho, which I'm not commonly eaten. It's Pho Bac, which they called it and the noodles are thicker and thin. The Soup base is extremely SALTY. I can literally drink an full cup water afterward and still have that MSG sting in the back of my throat. If the Pho isn't so salty, then my meal would taste great. I can still smell the nice aroma of the seasonings in my mouth, but SALTINESS has to GO. People are intake lower sodium these days, and this isn't a great place for Low Sodium diet person, nor regular person's diet", "author": "n a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-18", "description": "I kept hearing good things about this place but when I ordered, the broth smelled like rancid oil, it was very off putting.  I definitely will not go back there.", "author": "Danielle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-08", "description": "Is good food and very clean and the waitress  very serve very nice.\ni will go back there.", "author": "Bob L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-01", "description": "i've came here once and the food wasn't even good nor is their customer services about coming to your table to refill your tea. the soup was way too oily. hello, am i suppose to drink oil or actual soup? the only reason why i'd came here was because they opened recently and since i live nearby, but i'd rather drive elsewhere if i knew this place was like that.", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-13", "description": "Excellent Vietnamese food at a low cost. Food arrived in a reasonable amount of time.", "author": "Mark E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-28", "description": "Not the most original name for a Pho restaurant but they are named aptly. Their Pho with flank and meatball is really good; served with ho fun (wide rice noodles) noddles & tasty broth, $6.95 for large. Service was a bit off, the waitress forgot the lime and peppers and our drinks..the place is clean and new looking. Good grub, good prices, definitely coming back soon..", "author": "Steve K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-19", "description": "hey hey! not bad! i was mad because my mom had not brought me here earlier. the spring rolls were pretty goood. (but i dont really like fried stuff). and their chicken noodle soup was good. i wasnt too into the beef.. but yeah the place was pretty comfortable. i approve!", "author": "Judy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-08", "description": "this place is digusting, does not at all taste like authentic pho. the noodles they gave were the wide noodles and you CAN'T choose your noodles. AND they gave a poor amount of noodles so HELL NO I dont recommend people to eat here. There are two other pho restaurants on San Bruno first is yummy bowl and this other one next to the gas station next to silver ave, that new place is pretty good.", "author": "tammy w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-02", "description": "good, solid soup!\n\nusual not very friendly service to match better than good pho.\n\nhad the chicken soup which comes with flat noodles.  \n\ngreat company too!", "author": "Henry F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-29", "description": "we ordered the shaking beef and it was so chewy that it was inedible, when we tried to send it back....they refused! some of the other food was good but we were really put off by their flat out refusal to take the dish back, and they let it sit on our table untouched for the rest of the meal.", "author": "warren a."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-18", "description": "i've had pho before, and liked it, even though i'm not a soup person. i did not like the pho here. j and i got the mango fruit drink, and b got the strawberry one. those were good, sweet, but good. very fruity and just $2.50 i think. we passed on the apps cuz they were small and as much as the pho. ben had the beef with beef balls soup. his came with thin flat noodles and lime and jalapenos and looked pretty good. j and i both chose the spicy beef and pork pho. these came with the jalapeno, lime, and also lettuce. we all got larges which were about $8 i think. i didnt like my soup, and neither did j. one, hardly any noodles, and what were there were soggy fat white things. there were about 2 pieces of beef. 2 small pieces. then it had lots of squares of blood clots, and then 2 or 3 pigs feet. i've had pho before and liked it. this was not enjoyable. i googled pics of spicy beef and pork pho and it comes up with tasty looking soups. then google blood clot pigs feet soup and it comes up with what we ate. or sat in front of. i think they switched it. ok so even if i liked those things, it was too brothy and not noodly enough. i shoulda had the chicken. j and i picked at our soup then the 3 of us left and we went down the st to ling lings and picked up some chinese food for much cheaper that was much tastier. so moral of the story is, go here if you dont mind soggy noodles and you dont mind not getting what it says on the menu. but its not a horrible place. the service was good enough. ps cash only. Dinner for 3 came out to $30 something.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-11", "description": "i like this place cus they have bun rieu. most pho restaurants dont have this. i alsooo loove their three color drink. i only have problems when i came here with my boyfriend and we were sitting there WAITING for help... while the waitresses are wandering around doing nothing... the these chinese people come walking in and they served them first.", "author": "A A."}
