{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "All divey and when we went decked out in Halloween decor. Perfect for a late October pub crawl!\n\nWhere the drinks anything special to write home about? No. Was the beer selection that amazing? No. But the whole experience was fun everyone was super laid-back, if not a little grungy. But I totally dig that. It was fun, it was probably the best night we had in San Francisco. I would certainly go back but if you're going to go. Maybe make it one of the last stops in your pub crawl, so that you're a little more loosened up and can enjoy it for what it is. That's a fun little divey bar.", "author": "Adam H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "I was heading out to a concert at the Oracle Arena and wanted to get a quick drink before catching the bart. Phone Booth is located within 4 minutes walking distance from the 24th Street Bart Station and they serve great drinks for super cheap!\n\nI ordered a Greyhound and IPA for a total of only $10. Such a steal, especially here in SF! The only downside is that this place takes cash, which is why the drinks are inexpensive. \n\nIf you're looking for a casual hangout spot to start your barhopping adventures in the Mission, then I highly recommend trying out Phone Booth! I will definitely will be coming here more before my concerts. :)", "author": "MyTien P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "This place is a dive.  It definitely has that dive smell.  When you catch a whiff you will know what I mean.  That isn't necessarily a bad thing.  \n\nIt's definitely got character.  It's an easy night out, no frills just drink.  Drink and hang out and sit back and be yourself.", "author": "Pauline M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "It's a dive bar so don't expect frosted glasses or even bar stools that match much less look like they are from a design within reach catalogue. Still it's got a great jukebox and the staff is friendly and cool.", "author": "elizabeth m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "CASH ONLY and DOG-FRIENDLY!!! \n\nThe place itself is very small: around 4-5 small tables + bar sittings + a pool table.\n\n$7-8 draft beers, not too bad prices. The selection of drinks is great. It seems like people of all ages go here, it has an interesting vibe. Everyone is very nice and friendly to each other here. It's definitely a place if you wanna stop by and pregame or just chill with friends for a bit. It is not particular clean or fancy, but then again it's not a place that you would stay for hours anyways. \n\nThere was only 1 bartender when I and my friend went at 8pm on a saturday night but she knew what she was doing so we didnt have to wait for very long for our drinks. \nI would definitely dive in again in the future.", "author": "Veronica N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "Hello,\n\nI wanted to reach out about the events that transpired at your bar on Saturday night. Given the circumstances ended with me, you should probably hear from me. I know you've heard from many people... I have many dear friends that are much braver - but my voice should be heard, too.\n\nOn Saturday, I wanted to celebrate my boyfriends birthday at a bar we all love, and frequent often. To note, the minute we walked in, your door guy was aggressive. He walked around shoving chairs, clearing tables at unnecessary moments, and even giving myself weird looks. It was odd, and I noted this to myself, but didn't say anything out loud.\n\nI wasn't outside when he started yelling at my friend that she \"elbowed him\", but given the three people that were are all my dearest friends, I know they tell the truth when they say that she didn't ever elbow him. Even as he was yelling at her, she remained calm, while he continued to insult them. I came outside as he was telling my friends \"to go back where they came from\", and calling them \"entitled children.\" I was there for those comments.\n\nBy this point, he should have gone back to his chair. If he was correct, he should have been resolute with kicking my friend out of the bar and going back to do his job. But he was not.\n\nAs he continued to make inconsiderate and offensive remarks, he chose to zero in on another one my friends, who inquired about what happened. The door guy then  chose to show him by elbowing him in the side. Totally unprofessional, not cool and unnecessary. Obviously upsetting him, my friend asked him not to touch him. He then chose to zero in on him and began pushing him away from the front door, noting that he was \"too close to the fucking door to be smoking there.\" It was unnecessary, and an indicator that he just wanted to fight. He continued to push him, and aggravate my friend. It was shocking. \n\nThat was when I had enough. That is when I told him, that we would all be leaving, but if anyone should have been acting level headed in that situation, it should have been him. Because, out of all of us there -- he was the one working. He was currently at his \"job\", and instead of yelling at us, pushing people around, he should be acting like an adult. There were many others ways he could handled the situation, and this was not okay.\n\nThat is when he said, \"Oh I'm sorry, what do you want me to say? \"Yessa Massa?\". \n\nRacism is something that I'm very used to, and aware of. I'm from Utah, where my black skin has been the base for many jokes. Why I haven't received jobs. Why I wasn't chosen to participate on teams, or just plain ignorance out in the world. But since moving to San Francisco 3 years ago, I've never had anything like this happen. I couldn't even speak. And even today, I'm still in shock that someone would outright and blatantly be so racist, ignorant, and just a sad human being. \n\nI understand that the management there was just doing their job last night, by asking us to leave. They didn't know the full story, they weren't outside to hear the  conversations or see the pushing. Their job is to protect their employees -- particularly in a workplace where patrons can get crazy. But now that you have the full story, I hope you make the right decision and choose to terminate his employment. Phonebooth deserves to be represented better -- and I know this because this is a bar that I frequent often. \n\nAnd in todays landscape, I think it would speak volumes if you let him continue on. He will continue to spew racist hate and intolerance, which I hope you have a no-tolerance policy for. \n\nSincerely,\nShaquille Heath", "author": "Shaquille H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "One my alternative post work haunts if I get off before Mission Bar opens. (again, don't tell my sponsor, hah) Decidedly more hip than Mission Bar, I still enjoy the divey feel and that black cougar painting really is awesome. All the bartenders have been cool, the two guys I mostly see always remember I get a whiskey double. This place works for me both for my solo day time drink and a place I would go out with others at night, which is ideal for me!", "author": "Tanya T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "This is a rad dive bar with quirky details, a friendly bartender and his equally friendly dog.  I came here at an off time and there was plenty of seating available, but I imagine this bar is not often packed.  \n\nA dark and stormy was $7, as were quite a few of their beers.  Heavy handed pours, cold beers on tap (including green flash), and whatever well drinks you could imagine.  The bartender is super friendly, service is fast, and everyone in the bar is relaxed.  Plus, there's a pool table!\n\nThe chandeliers made of naked barbie dolls, and there are branches hanging from the ceilings.  It's located on a street corner, easy to find, and near bart.  They don't serve food, but we brought our food over from la taqueria around the corner and nobody seemed to mind.  Would definitely come back here if I was in the area!", "author": "Kenna H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-20", "description": "Double fuck it. I went from loving this place to not even stepping foot in it. I no longer wish to be discriminated against, smell like cigarette smoke or put up with the clueless crowd that frequents this spot.", "author": "Anabelle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "This place has great energy...one of my fave local neighborhood spots to hang with a friend or solo.", "author": "Jason V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-06", "description": "The Phone Booth is a quaint dive bar in the mission. No crazy night is going to happen here, but it's a good place to start, come to with friends and have a conversation, or to play a game of pool. They have good mixed drinks, a small selection of beers too. Staff is nice and the place is well decorated. Don't expect too much of this bar, but it's a fun place to stop by", "author": "Ross S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "I hit up this spot for two reasons: (1) it's close to where I live; and (2) to chill with my main man Matt. Always greets me with a smile and good cheer! One of the gems of the Mission.", "author": "Jay D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "My favorite bar in SF. Dimmed light atmosphere. Last spot where locals meet before tech guys push them away.", "author": "Kendall M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "The diving dive of dives...but I absolutely love it. Now that it is Halloween season, the decor is kick ass. A great place for pregaming, a daring place if you want the beer and shot combo", "author": "Joe D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-24", "description": "The inside of the place is as depressing as it looks on the outside :)\n\nOverall, this place is like any other dive bar in the Mission, except it's actually slightly on the smaller side, with not a lot of space. There were signed photos of Barry Manilow and Tom Selleck on the wall, so presumably they were once patrons? In any case it's clear they no longer visit, because I have a hard time imagine them going there!\n\nIn any case, the beer was cheap (it was $5 Stella in the afternoon), and not a lot of patrons, so the bartender was kind of bored, which is reasonable.\n\nOverall, an OK place for a quick drink if you happen to pass by, but probably not worth the extra detour to intentionally find this place.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "My new favorite plaaaaaace. Bartender was a sweetheart, the dogs are plentiful, great local-dive feels and good strong drinks.  No hipsters on this Tuesday night!  One girl came in with her yoga pants but ended up leaving before she got a drink.  I guess there weren't enough Edison bulbs, subway tiles or expensive sriracha flavored bar snacks for her..? Phonebooth, I'll be back!", "author": "Adrian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-31", "description": "Red felt pool table. Lots of dogs. Nice mix of gay, lesbian, and straight. Signed Tom Selleck photo.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Great NYE fun.  They should do a DJ set at least once a month, music was good and kept us dancing all night. It actually felt like the Mission I love.  Strong drinks and no fuss. Chris Orr was the DJ, played rare gems all night, what a fucking party.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-21", "description": "Perfect for solo drinking. \n\nIt's actually remarkable how much action they've managed to cram into their small footprint. Bench seating, a pool table, and a rock-solid jukebox are the highlights. Plenty of options on tap, and the cocktails are well done. Their one flaw is a tragic one: it's very popular. When this bar gets busy it's sweatier than MUNI.\n\nNo kitchen, but you can BYO eats. Cash only. No smoking anymore.", "author": "Vivek S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "I stoped by on Saturday night to get a drink with my girlfriend. The guard posted at the door I believe his name was Mark or Matt I cannot remember but he was awesome. He greeted us with a smile and welcomed us to the phone booth. He actually took the time to wish my girlfriend a Happy Birthday. We have gone to two places prior to that and no guard had acknowledge my girlfriends birthday until we met Mark or Matt. We went their had a few drinks and while I went in and out of the bar to smoke I had a conversation with the guard. He was very outgoing, smiling and provided excellent customer service. I give him credit for what this man has to deal with. There had been a bunch of people disrespecting him and he handle himself very well just by talking not even putting hands on people. I also witness this poor man get spit on and a cigar thrown at him. God bless you Mark or Matty on what you have to deal with. Thank you for being such a gentlemen and sorry you have to deal with a bunch of entitled rich kids. Hope to see you soon!", "author": "Jimmy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-10", "description": "This bar just feels off. It seems a bit of a pretentious for a divy bar. It just felt off and I was too drunk to really care when I felt that. It like most of the neighborhood feels like its in between a dive and a bourgie bar. Like its transitioning and it needs to go one way or the other.", "author": "Thomas J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Love this place. Nice people, a pool table, and dogs everywhere. It's the perfect neighborhood dive bar. It's usually possible to find a seat too.", "author": "Henry D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "Came here for a dink, while out on a Saturday afternoon.  I had a bloody mary and my wife had a screw driver.  My bloody was a bit on the bland side, though a little salt helped.  The bartender was making it from scratch instead of using a pre-made mix.  When made from scratch I find it's a toss up, either it's amazing or lacking.  I probably would not order another bloody, but the screw driver was well mixed and there prices are reasonable. \n\nDivey yes, but I like the chill laid back vibe.", "author": "Nick G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "It looks really intimidating from the outside, but it is actually a friendly place! Cozy, relatively affordable, Christmas lights, pool table. Better for small groups. \n\nI also came here for New Years Eve and it was a blast. Awesome decorations.", "author": "Mila K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "the most Berlin-lke Dive Bar I visited on the west coast yet. friendly people all aroung even if it looks a but intimidating at first sight. loved it.", "author": "Christian I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-22", "description": "The only thing I really liked about this bar was probably the cheap beers. \n\nOther than that, it wasn't really my kind of crowd. There was a bunch of hipsters..not that there's anything wrong with that, but I was totally out of place with the plaid shirts, thick rimmed glasses, and beards. If you like that kind of stuff, then this is your place! Not to mention all the white boy music playing. (I'm not hating, I like white boy music. Lol) but like others have mentioned..it does kind of smell funky in here...", "author": "Yannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-01", "description": "No frill dive bar! Love the neighborhood vibe! Pools games are fun and people are friendly. Keep it open!", "author": "Xiu L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-26", "description": "Great bar! Great bartenders & a solid selection in the jukebox. I'd love to get back sometime when I'm back in the bay area. This place stands out as a fond memory of my 2nd trip to San Francisco.", "author": "J D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-26", "description": "Good bar to just chill and relax at. Good place to catch up with people and the music selection is pretty darn good. There's a pool table in the back and plenty of seats. Very divey bar for sure, but a nice bar. Would return.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-15", "description": "Had an amazing time here! Great atmosphere, and I'm pretty sure they free pour, so be careful when counting your drinks. You might have had a bit more than you thought! \nService was prompt and the music was not trendy but/and certainly entertaining! \nWould come back in a heart beat!", "author": "Marta B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "Best donut salad in town. Ask for Tika!", "author": "Joshua Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-22", "description": "Super chill dive bar equipped with a juke box, pool table, reasonable selection of drinks, and a friendly bartender. I will go back if I'm ever in the area again!", "author": "Umeet S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-31", "description": "I think I just created this profile because of this place...\n\nI belong to one of the rare breeds of Europeans that seldom get lost so far out in the world to make a living (yup, kinda like hobbits).\nAfter a whole afternoon of pre-gaming (and a good portion of the night) we decided that the living room was rotating enough for us to leave. We stumbled to the computer and tried to find something that made us feel back home (a place where drunk smoking wasn't something to frown upon, the guy at the door smiled, and where you could get drunker without feeling guilty about the money spent in a party for you head, and that had a nearby alley for emergencies). The jukebox had a nice selection of music (but I think that an ipod was playing at the time-I don't remember if the jukebox had decemberists in it).\n\nIt totally hit the spot.\n\n\nsorry for the crappy english\nTugas, este é o sítio!", "author": "Bea L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-12", "description": "Second stop of our pub crawl for the birthday boy. Such a cool dive! Drinks were made with care and precision.\n\nThe chandelier with barbie dolls are not to be missed!", "author": "Yuchi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-25", "description": "If you don't like this bar...\n\nWe can't be friends, because it is awesome. \n\nCheap and smoky and awesome.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-21", "description": "Shithole full of hipster douchebags sporting wallet chains, bad tattoos, Jason Mraz hats, and.. Well do you really need to know anymore to stay the hell away. Yes, I know hipster dochebag is redundant... but still worth of mentioning...\n\nOh, they also let patrons smoke in the bar, ensuring you will smell like ass from the combination of stale beer, sweaty ass, and smoke. Yuck", "author": "Jim B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-07", "description": "We ended up in this bar mostly because nothing else around the area was open...Being from out of town we had no idea where else to go, and the decor/ambiance seemed cool at this place.\n\nThe people in the bar (clients) were nice and we even had an interesting conversation with a lovely local couple. Even the doorman was friendly.\n\nBut, as other people have mentioned, service at the bar was poor. This bartender guy seemed really annoyed at everything...rolling eyes, not smiling, etc.\n\nI asked him for an Old Fashioned cocktail and he just rolled his eyes and said he didn't know what that was...(I mean, reaallly?)... \n\nHe could have said that he could not make it cause e.g. he had no orange peel, or wtv... But he was just like: \"I have no idea what you are talking about *rolls eyes*\"\n\nAfter explaining the idea, he finally made me a Manhattan that tasted a too much like pure alcohol. We still gave him a tip, hoping we would get a better attitude for the next round. But there was no next round...\n\nMy husband had a pint of beer... Nothing to mention on this, cause I guess you can't really miss that one, right?\n\nHopefully not all bartenders are like this one overly annoyed guy, cause the place was pretty cool... But then again, I think reviews have to be honest!", "author": "Sonia O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "Dive bar with decently priced drinks, awesome music and no pretentious (insert word here). \n\nLove that it is a stone's throw away from work, so I have a feeling that I may become a regular.\n\nFinally, a place to decompress after a long day in the Mission!!", "author": "Hilda Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-17", "description": "I dig this place because of one specific reason: You can smoke inside and no one is going to say anything! \n\nThe bartenders are attentive, the jukebox is always jamming, the pool table hosts intense games, and everyone is just having a damn good time. \n\nThe craziest thing I saw here was a dog-napping. I kid you not, some guy brought his dog, and another dude just unleashed the dog, grabbed it and walked off. The dog owner was so drunk he thought his dog was still on the leash. Woah!", "author": "Maggie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-09", "description": "Awesome! \n\nWe took a cab to the Mission area and were lost in a sea of taco stands and shops. We hit mobile Yelp and walked a block over to this place. \n\nWe were a bit apprehensive to go in initially. It was dark, a bit dingy, and looked like a locals only bar. We each took a gulp of air and headed in. \n\nWhat the....They are playing Morrissey on the Jukebox and have a picture of Tom Select (Magnum years) on the wall. The guy I was with asked if Morrissey was like the Cure and...oddly enough tada they were playing The Cure as he was asking. \n\nEvery fear fell off and we got to drinking. I opted for the 7 dollar PBR and Shot of Whiskey special. No mystery it was PBR but must have been popular because it was fresh PBR. I think there is a difference as you are drinking but the next day is the same. \n\nThe bartender and people at the bar were very friendly and as soon as we left I wanted to come back.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-24", "description": "Cute little dive and I did like the remnants of the Halloween decorations mixing with all the other random stuff. Bullfighting painting + goblin lady + black claw branches: yesss\n\nShowed up right when Glee started, so conversations all kinda ground to a halt and even the bartenderess stopped mid-pour to watch. Typical Mission crowd, with somehow a heavier lean on the gay lever. Cheapish drinks.\n\nDocked 'em one star for the heavy ciggy smoke. Love the place, but I can't stand it when my clothes are imbued with smokiness for the next few days.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-13", "description": "Ring... ring...\n\n\"Who is it?\"\n\n\"Hey, playah!  It's Age-Inappropriate Drinking.  I've conferenced in Poor Decision Making.\"\n\n\"Hi guys!  I didn't think I'd hear from you til the weekend.\"\n\n\"Oh, wow.  Now we're just your *weekend* friends?  Nice.  ANYWAY, we're calling from The Phone Booth.  Come meet us for some rambling conversations, a little light brain cell loss and a shorter life span!\"\n\n\"Yeah.  Listen guys, you know, I'm married now, and I feel like it's time for me to hang out more with my couple friends.  You know, Gardening and Baking.  They're actually really cool once you get to know them.  Reading and PBS Documentaries are great, too.  I mean, they put me to sleep sometimes, but...\"\n\n\"Jesus!  We hate them!  And can we remind you that there used to be a time when you wouldn't be caught DEAD with them?  Sometimes we don't even know who you are anymore....  Plus, you know who's here?\" \n\n\"Who?\"\n\n\"Only your ex.\"\n\n\"Noooo.  Seriously?  Nick O'Teen?  I thought he was 86ed from like everywhere.  I mean, he's not even allowed to hang out in front of *restaurants* anymore.  Everyone hates him.\"\n\n\"Oh no, girl.  He's here.  At the tables.\"\n\n\"God, I feel like we're toxic together.  But it couldn't hurt to say hi...  I mean, it's not like I'm going to DO anything...  Things between us always get hazy and leave a bad taste in my mouth, but I've moved on now...  I'm sure this time will be different...\"\n\n\"Uh-huuuuuuuh....\"  \n\n\"See you in five minutes!\"", "author": "Rosie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-04", "description": "The Phone Booth is one of those dive bars that gets it just right. On the corner, very dim lighting, nice little pool table, decent selection of liquor, and the best jukebox in SF. It's not an intimidating spot and the bartenders are quite friendly. If you want a great local spot that isn't packed to the brim and serving drinks made by \"mixologists\" then this is the spot.\n\nDog friendly, cool people, and just an all around great bar :)", "author": "Nick E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-15", "description": "So far it's my favorite (session) bar in the Mission. Fairly affordable cocktails and beers, but that's not what really sold me... it was the jukebox that did! What a great selection. Being able to put on \"Enjoy the Silence\" and have people from every corner of the bar either hum or sing along, that was kinda cool. :) And despite that there wasn't really any dancing, and that's kind of my thing. I'm an old man at heart.\n\nOh yeah, and before I forget that this is a bar in the Mission: PBR pint and Jameson shot (almost like a 1.5shot) is $7. Not bad if you're taking the midnight express train to inebriation station.\n\nPool table was kind of crowded and I couldn't \"get next\" on it, but maybe next time. Not to mention the free popcorn is a plus - reminded me strongly of the Graduate in Oakland. I'd love to come back.\n\nI heard that one of my friends got some attitude from the barkeep when trying to order a complicated drink, so it's not perfect. But I like it.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-18", "description": "Classic dive bar and I like it.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-14", "description": "A true dive. Way nicer inside than the outside. This place makes a mean cosmo according to some sources. The bartender is requisitely rude.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-26", "description": "Must be a popular place , place was packed , every table , and stool was taken , looked like a \"hipster\" place , people seemed nice , didn't stay for ping because of how packed it was", "author": "Anthony M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-05", "description": "The bartender needs to stop being a gruff, standoffish wanker. Details need to be updated as smoking is not allowed here. Won't be returning", "author": "Luke C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "Was looking it a few cheap beers on an early afternoon. Perfect spot. $2 pbr and someone brought their dogs. Bartender was talking to regulars about local politics. 2pm friday feb 13th", "author": "Colin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-28", "description": "Service is so crappy. Not sure if the fact we weren't locals pissed off the bartender or if it was because we wanted more then one drink. We were staying in an apartment across the street and wanted to grab a few drinks after dinner. This guy was beyond annoyed about EVERYTHING, we felt super unwanted and had to flag him down to order another cocktail (there were 10 people at the bar). Service sucks!", "author": "Emily W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-19", "description": "My rating would've been higher, but the fat, bald queen with the attitude,  that was working at the bar, brought my ratings down a lot.  Cheap drinks. low key.  Needs a better selection at the jukebox.\n\nNote to Queens, Hipsters, Etc.-  A mean, snobby attitude does not make you superior to me or make you look cool, it makes you a delusional douche.", "author": "Tate B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-24", "description": "Bartender, I hope you tell everyone else the same thing you told us about Popcorn at public establishment's..LOL! BTW..you are cute! \n\nCheap, strong drinks, dark, mix bag of people and good music. Just what the doctor ordered. Or  would that be the devil?", "author": "Ennos P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "I was a little hesitant about this dive, but I finally got a chance to check it out.\n\nI had a great time, drinks are cheap, you can smoke (not at the bar), and play pool!", "author": "Mario M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-29", "description": "\"Woo hoo, as good as it gets\" indeed.\n\nBlowing all my money on filipino bbq and a scoop of Olive Oil and Secret Breakfast at neighboring Humprey Slocumb, drinking did not seem like a good idea--fiscally. \n\nIt looks like a residence outside, the only distinct characteristic is a humble sized sign: Phone Booth. It was hard to spot and definitely had a hole in the wall feel to it when entering because the only lights are candlelight, blue christmas lights and red lights,meaning it's almost complete darkness! I felt like I was at a pub in 'Diagon Alley [only Harry Potter fans know] and noticed it was reminiscent of Broken Record by Geneva & Mission. \n\nThe alcohol comes in cheap and generous amounts, God bless them. \nI ordered a shot of patron, salt rim and sprite back. I gathered the last of my ones and paid up, expecting about 1/4 of the shot glass to be full (like normal bars in San Francisco) but to my glee (or perhaps horror) the alcohol was kissing the rim of the glass, almost overflowing, the sprite back was a normal sized $3.50 soft drink at a restaurant. I was in heaven and in drunk stupor in no time.  I forgot to mention they clearly gave me a double, it wasn't in those trendy small shot glasses with the heavy bottom but a scotch on the rocks glass filled to the top! the top! the top! weee\n\nSame can be said of my friends drink orders\n\nIf I could describe the atmosphere further, I would advise you picture a hookah bar on Haight street, except smaller and with a pool table, no baklava ;) Attire is casual, parking abundant. \n\n\nhope this helps xoxoxox =)", "author": "Olivia Vanessa R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-30", "description": "You can smoke inside, but I don't smoke anymore.\n\nTheir drinks are strong and cheap, but it's cash only.\n\nIt's within walking distance of Amanda's apartment, but for the first 5 minutes, we weren't even sure there was a bartender on duty.\n\nThey have a pool table, but I'm sure if I asked to play they'd tell me to fuck right off.\n\nSoooo...3 stars.", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-12", "description": "The Phone Booth is the only bar in SF where I was called out for what I was wearing. The sooooo ironic hipster bartender refused to acknowledge me because I was sporting a gray brooks brother polo shirt and pressed chinos. Sorry man, but I didn't get the memo. I didn't know knee socks and tattered t-shirt was the preferred dress-code. Will you serve me a drink anyway? Douchebag.\n\nListen hipster, one day you are going to have to grow up and get a real job with real responsibilities. Your days of skateboarding on South Van Ness won't be so COOL anymore.\n\nIn retrospect, I really shouldn't be writing this review because I live about 10 feet from here. I can already hear the sound of chuck taylors making their way to my door. Hipsters are like zombies. They congregate in small packs and once you kill them; there are a hundred more ready to impress you with their precious \"irony\". If the city ever puts all the hipsters on their own island, it would be filled with establishments like Phone Booth and Boogaloos.\n\nGod, I'm such an a-hole when it comes to these people. I hope you burn down, just like \"Benders\" did. 1 star.", "author": "John T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-12", "description": "hole in the wall, hipster heaven.\nnice & funny servers\nnormal beer prices.", "author": "Katrina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-06", "description": "If it's granted that bars are worthy of the same innate consideration as most citizens (if not more so, since most citizens don't exist solely to help me get drunk), then a bar is innocent until proven guilty. Thus, every bar's rating begins with 5 perfect stars and goes down as all available evidence is held against it.\n\nIn the case of the Phone Booth, allow the prosecution to offer the follow exhibits:\n\nExhibit A: A cadre of too many smug, self-conscious hipster elitists (or, worse, those who desperately want to be hipsters but can't even pull off the act of fashionable conformity). It's a known fact that the Phone Booth is post-collegiate hipster central, which thus makes it a cornerstone of Mission district gentrification...not to mention more than a little annoying when you're surrounded by a swarm of horn-rimmed fake intellectuals. Penalty: Minus 1 star.\n\nExhibit B: Ironic decor. Not merely kitschy decor, since I can appreciate the whimsical flair of retro paintings and lamps, but the sort of all-out decorative absurdity only hipsters think is actually funny, e.g., a motherfuggin' New Kids on the Block poster. Get your own life and live it, ironic losers. Penalty: Minus 1 star.\n\nExhibit C: Subtle mood-lighting halogen lamps above the bar. Sorry, but no so-called \"dive\" should ever have these things. They reveal the latent yuppie aspirations of any bar (and/or citizen). If I wanted to sit under a chic string of crimson halogen bulbs, I'd go to some trendy SoMa cocktail lounge with a name like \"Lotion\" or \"Smooth\" --- and then I'd kill myself, because I hate those kinds of places. Penalty: Minus 1 star.\n\nAs all-encompassing prosector, judge, jury, and executioner, however, I will go easy on the Phone Booth because of several extenuating circumstances, including:\n\n- relatively cheap prices (i.e., $2.25 pints of PBR, $3.75 tall boys of Tecate, etc.)\n\n- a pretty-sweet chandelier made of Barbie torsos\n\n- a very solid jukebox with punk, post-punk, country, funk, indie rock, and a blessed minimum of cliched Greatest Hits CDs\n\n- a generally enjoyable combination of cozy size, comfortable darkness, and casual bartenders.\n\nSo I give the Phone Booth back 1 of its penalty stars, leaving a total of 3 stars overall. Take down the NKOTB poster and I may give it 4. I'm permanently withholding the 5th star until one of the resident hipsters can finally explain to me why the hell I should give a crap about Stephen Malkmus.", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-08", "description": "The name is the size. It's a fun joint to hang at deep in the heart of the mission, pool table, free popcorn, decorated during Halloween, good enough beer. \n\nPlaying pool can be a butt sometimes as it's so packed your cue can hit the wall. Not a lot of seating, be prepared to haggle for a chair if you have  a group, but it gets the job done and can be a fun start to a mission pub crawl.", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-22", "description": "So tragic what has happened to this place. It was once really awesome, then kinda awesome, and now it's an imperious hipster pad. Putting paper in the ashcan? Yeah, good idea. Yelling at patrons, yeah, that's better. This has been a favorite for a long time (even when it was a gay bar!), but after being pushed out of the way and snidely remarked to by an unwelcoming bartender (I'm not hipster enough, I guess), this place is over. For people who can pay, anyway. Sad.", "author": "Vincent R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-07", "description": "Something of a stank tank.  Phone Booth started off our recent mission/folsom bar crawl by being really, really weak. \n\nThey have a decent selection of beer but so do most quality bars in SF. \n\nWhat I focused on more was how run down it is, a pool table so scratched it's barely functional (and crammed into such a tiny space you'll take 3/4 of your shots with the short stick), and a bunch of hipster lame asses.  This isn't the people friendly break you want from Castro or Russian Hill snobbery; it's mission snobbery with crappy music and no decor.  \n\nAnd they need to do something about the smokers.  It's illegal and it's really gross and it's really rude and it's not fun.  \n\nNext bar crawl will skip this place!", "author": "Luke M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-19", "description": "If there were an outdoor patio it might get 5 stars but then it wouldn't really be the phonebooth.  Friendlier than other bars in the area.  Even if you don't drink it, it is comforting to know that there is $2 Pabst in pint glasses.  The history, as I've learned, is that it used to cater to gay workers in the Pac Bell building across the street.  There are still locals who show up and a pretty tolerant crowd most nights - tolerant of people of various ages, races, genders, sexualities and fashionabilities.  Still, it's the Mission, and clearly not a bar for the Latino immigrants in the neighborhood (though even a couple of them drop in for Tecate when it isn't too crowded), so it is often dominated by hipsters, their contemporaries and their admirers.\n\nDespite the 4 stars, it is my bar of choice in the neighborhood and the city for that matter.", "author": "Carlos V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-12", "description": "As far as I'm concerned, this is the perfect dive bar. It's small, it's dark, the drinks are strong (when you order a rum and Coke, you literally get mostly rum with a little Coke) and cheap ($4!), and they have pretty amazing decor -- there's a naked Barbie chandelier. What more do you want? We were there on a Saturday around 9, and it wasn't overly crowded. We were able to walk in and grab a seat. Getting a drink wasn't a problem either, as the bartender acknowledged you quickly once you approached the bar, and waited on you soon after. \n\nWhen you walk in, there's a bar to your right, and a church pew-like bench lining the left wall, along with tables and chairs. The decor -- and I'm not sure if this is just seasonal or what -- consisted of these awesome tree-like structures with faux cobwebs and skulls on them. Very Halloween-y. There's also an awesome jukebox, as tons of other reviewers have mentioned. Oh, and -- this is one of the cleanest dive bars I've ever been in! Definitely a plus. In fact, someone at another table fell out of his chair and shattered a glass of beer on the floor while we were there. They immediately picked up all the glass shards, and mopped the floor so that it was Pinesol-fresh. Not exactly a delightful scent, but a helluva lot better than garbage, and I appreciated that my shoes weren't sticking to the floor! I will most definitely be frequenting this fine establishment. \n\nP.S. It's cash only. Wah-wahhh. But there is an ATM on site if you want to pay the $3 fee.", "author": "Natahley B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-15", "description": "Little hole in the wall full of mostly losers and a couple hipsters.  Gwen Stefani has been spotted here quite a few times when she is in the area.  I used to work in the area and always walk by the bar and look inside if it looked like any fun and it usually looked pretty lame.  \n\nIf you get drunk there it is better of course, what bar isn't?  I wouldn't bother with this bar.  Check it out if you want.  It will only cost you the price of a drink.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-15", "description": "Let's get this straight. You drive a Bimmer, you look like you just stepped off the set of Sex and the City, and your favorite companions are your cell phone headset and your credit card. YOU totally would HATE this place!!!\n\nFor the rest of this, this is a little spot of HEAVEN. Small, narrow, long, dark, and cozy, with charming vintage elements, like a great wood bar down the length of the place, plaster dancers on one wall, pool table, and cheezy/cool old paintings. Large selection of quality booze to choose from, too. \n\nAfter drinking one too many coffees over the day, I was hopelessly dehydrated (and working on a headache), so I started the evening off with a couple glasses of water, while my friend knocked back a few beers. The bartender was totally cool about it, was super nice, and kept voluntarily refilling my water. Once I was suitably watered, I ordered a Cosmo (the first of two)... not only was my Cosmo exceptionally tasty, it was inexpensive, and plentiful (the bartender gave me the extra drink from the shaker in a second glass--- what my friend called the \"Junior\" cocktail). He even chilled the martini glass with ice water before pouring my drink. Lots of class.\n\nFrom my vantage point, at the corner of the bar, looking down the length of the bar, I had the perfect people watching space, watching the influx of interestingly diverse, unpretentious locals and cute dogs at the door. The place was super chill at 9 pm, and got much more popular in the next few hours. The great thing is, the music was fun, but not so loud up you couldn't have a low-key conversation at the bar. Sitting at the tables would be better for folks who like to get up close and personal with their neighbors, and aren't too claustrophobic. \n\nA good place to go with a friend (or two), a date, or alone, since people seemed happy to chat with newcomers. Dive into this place as quick as you can!!!\n\n(Sidenote: Best of all, not once during the night did I feel too old.)", "author": "Paula W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-07", "description": "Let me phone all my smoker friends because Phone Booth is probably one of the last standing bars you can actually smoke at. Even though I'm a \"quit-except-when-I-sometimes-drink\" smoker, I could even find value in a place like this. Divey place with super affordable drinks and heavy on the pour for the poor. What's not to like about this place? The Mission impossible secretly possible.", "author": "Celia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-10", "description": "The more time I spent in the bar, the more I enjoyed the ambiance.  I like my bars like I like my coffee: strong, dark and proud.  This place certainly hit all three.\n\nSome additional comments:\n\n-Hoegaarden on draft for 4 dollars.  Yes, I said 4 dollars.\n-Sweet lighting: I want to there were a few branches covered in blue and green lights hanging from the ceiling\n-It's called Phone Booth.  Like if we went inside, then we might turn into superheroes.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-27", "description": "This place sucks. The patrons smoke inside the bar and the bartender only meekly once mentioned to one person that they should take their cigarette outside...which the person ignored. Don't go here unless you want your clothes and hair to stink like an ashtray and you really like cancer. Get a drink just about ANYWHERE else in the Mission.", "author": "J.J. P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-06", "description": "Pretty fun little dive bar. Decently priced drinks, good music. And you can smoke inside!! I know that's a big deterrent for those who don't smoke, but big plus for those who do. \nOverall good time", "author": "Caitlin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-11", "description": "The Phone Booth was sweet relief from the hell that was Zeitgeist earlier that evening. An in-offensive cool bar with great juke box, I think I rinsed all my dollars on that machine that night. Really great bartender, friendly and chatty and really great atmosphere inside\nMy only complaint was the massive peephole in the girls toilet door!", "author": "Charlotte H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-17", "description": "The Phone Booth is a great spot.\n\nChris the handsome French bartender can make a fabulous bloody Mary.\n\nNeed I say more?", "author": "Cara L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-11", "description": "The Phone Booth is named that because of the Phone Company across the steet. Atone time it was THE hang out for company employees, especially gays ones.\n I have been going there for 32 yers and have seen a lot of changes.  The smoking is supposed to be after 7PM, BTW.\n Essentially, it is a mixed bar, but was Gay for a very long time. \n It is no pize for  deor but it is friendly. An eclectic mix of bartenders. My personal favourites are Martin and Christopher.  I do not normally go in on the other's shifts.", "author": "Randall M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "Terribly unassuming, but I dig it. \n\nThis seems like one of those \"neighborhood bars\" where it's all the same crew all the time, but manages to feel and be so unpretentious. The drink selection is good and the bartender (Martin) is attentive. Bathrooms are kind of weird though. But you can smoke, I am told there is popcorn, and the lighting is nice and low (but not Ruby Room-low). \n\nAlso, pool table! I'm typically not down with playing pool at new bars where I don't know anyone, but the vibe here was so chill that I really enjoyed myself and developed a more-than-pleasant repertoire with everyone I played against.", "author": "Natalye R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-16", "description": "Best jukebox ever! Good crowd, good prices. The bartenders don't really like me but that's their right cause I'm an idiot.", "author": "Sandy V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-17", "description": "Monday February 17th 1 am. my Money was stolen prior and i had three dollars to my name. I walked into the phone booth and asked the bartender for a PBR which was priced at three dollars even. I gave her my money and she began to curse at me for not having enough for a tip. Understanding to my best ability, i tried explaining that i would tip her the dollar if my money wasn't stolen. She responded with \"im not even fucking listening.\" \nIt was as hilarious as it was kind of sad someone would curse at a person who paid full price for the beer but couldnt afford tip that night under circumstance. so i left the PBR without taking a sip and told her to keep the three dollars so she'd calm down. She continued to curse at me as i walked out of the door.\nI cant honestly say the place itself is bad, however that particular situation was completely uncalled for as it was entirely immature. little did she know i write for a local paper and am still contemplating on whether i decide to let the situation slide, or proceed in writing a very, very bad review.", "author": "Phillip W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-31", "description": "A fun little bar.\n\nI enjoyed sitting by the door and people watching while enjoying a pint of beer with my friends. There is a pool table, free popcorn, and a lot of crazy crap on the walls... seriously! The beer selection could use some work. Oh and the bartender let me charge my phone. That was nice of him!", "author": "Eric G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-04", "description": "Dark, dank, typical SF dive bar (not a bad thing in and of itself).\nCash only.\n\nTwo stars because the ultra-hipster crowd was rather obnoxious and uninteresting, and because it's filled with people smoking.", "author": "Jen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-12", "description": "This place is dingy on the outside, hipster-chic on the inside: an allegory of the typical clientele.  It's got great ambiance, the drinks are reasonable, and there's a pool table.  Add some dancing and this could be a favorite-bar contender.  \n\nThough there is no dancing, there is in-house entertainment... i.e. the 21-year-old hipster kids who managed to get themselves kicked out (to the great delight of everyone else).  Dingy inside and out.  Sit down and let Auntie Mari tell you all about it.\n\nOnce upon a time there was a group of very pleasant people who were trying to enjoy their $6 shot-of-Cazador-and-Tecate combos at a bar called Phone Booth.  But during their game of billiards in the very cramped back of the bar, these dingy kids kept:\n- getting in your face while you were trying to shoot\n- intentionally standing behind you, blocking your cue\n- making out on the pool table (WTF?)\n- placing drinks on the table while trying to impregnate one another\n\nit was this last bullet point which eventually did them in.  You see, the bartenders are very sensitive about the protection of the table, which is indeed very nice.  when one BT tapped a girl on her shoulder to ask her to remove it, \nSMACK! SHE SLAPPED HIM ON HIS FACE. JUST LIKE THAT.\n\nThen there was a bunch of noise and chaos and suddenly our pool game was very pleasant again.  hoorah!  \n\ngood show, good show.", "author": "Mari C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-20", "description": "Cool dive bar except that a lot of people smoke inside even though there are No Smoking signs inside.", "author": "Dan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "me and a few friends went bar hopping and we stumbled upon this gem. We wnet in and to our surprise people were actually smoking inside the bar, which I'm totally down with since i smoke myself. The jukebox had great selections of songs and the drink price were pretty cheap compared to other places we went to. Will come here again. i love the environment and the people.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-21", "description": "Smokey smoke... for sure. Good place to bring your nicotine addicted buds, but bad place if you're trying to quit. Cheap drinks, typical dive, cute red telephone booths painted on the doors. Pool table in the back, table seating on the side. Bathrooms... really strange. The doors have windows on them, (high enough not to see anything too crazy, but weird to think someone's watching you- its like your in a lab getting observed...) I could just see someone far too drunk pushing open the doors- since conveniently they don't lock. Guess it cracks down on the hotboxing or lovemaking, but honestly don't think they'd care anyways.", "author": "Naomi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "IMO one of the quintessential dive bars in the Mission. A great mix of people, including a bunch of foreigners (who come I believe because of the ability to smoke inside--just not while sitting at the bar!) Big fan of the lighting and the energy here. Always some weird stuff hanging from the ceiling. The crowd is a good mix of gay/queer, hipster, young and old. Seems every time I go I end up having a conversation with somebody truly interesting. So. Oh and a big plus is the reasonable cost of beer. $2.50/pint for Pabst, $4 for quality brews like Lagunitas and Sierra Nevada. Juke box is all right, there's a pool table but good luck playing. Bathrooms are gross but who really cares? It's a dive, and a good one at that.", "author": "Jimmie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-10", "description": "I love this place!!! awesome bartenters.cheap drinks,good tunes on the juke box...a barbi doll chandalier...what else can you ask for...oh and free pop corn. And a pool table.\n one of the few places where everyone is welcomed...straight,gay,bi,transgendered...I have seen them all there having a great time. I am a fan", "author": "Raul A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-11", "description": "I always have a good time here, except for the fact that my eyes start stinging from all the cigarette smoke.\n\nThe have a pool table in the back and a juke box and lots of small tables. The crowd is usually pretty fun and I've always met at least a few cool people here. \n\nIt's a dive bar and it's chill. I'm a fan.", "author": "Jackie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-18", "description": "You know those bars you go to where it's obvious their staff hates everyone? At some places it's endearing, but this is not one of those. If you like dive bars with a crusty staff, Phone Booth might be your new watering hole. Not for me though... after having an unpleasant experience ordering drinks on a slow Sunday, my friend and I chugged our beers and promptly left. I don't know what we did- we're nice! We're good tippers! We like dive bars & beer! For shame, Phone Booth.", "author": "K M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-09", "description": "I love this place. The prices are pretty reasonable and a good atmosphere. Everyone I met there was so friendly, they made me feel as though I was back in Texas.", "author": "Celine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-04", "description": "Back in the day when my friends drove me back home, I would always see this bar. I didn't know why it caught my eye... maybe because of the name? The location? I don't know... but for some reason, I kinda remembered it.\n\nSo when I was asked to meet up with someone for a first date to hang out at the Phone Booth, it sounded awfully familiar. When she explained where it was, a photo surged into my consciousness from my memory bank and I instantly knew what she was talking about.\n\nI wasn't surprised to find a bunch of hipsters inside. They've taken over the Mission, y'know. But I didn't feel too out of place... just a tad bit uncomfortable and anxious... my default setting when I'm on a first date with someone I'm interested in.\n\nThey had whatever beer I wanted at the time... either Fat Tire or Anchor Steam or one of the well known Dutch beers... whatever it was, it was cheap, cold and great. \n\nTo be honest, I had a great time there... of course, it was probably because of the company I was with. But then, to put it subtly (only because I know about the ban and I didn't want to get anyone in trouble,) it became like a European bar... in the worst way possible. But fuck, if people are going to point it out, I might as well... it got smoky in there. Of course it would... the hipsters started filling up the joint after all. And since I can't fucking stand cigarette smoke, it got a little uneasy in there. She wanted to leave, too, so we both left to avoid the smoke.\n\nSo overall, it's a great place if you're a smoking hipster and/or you love not paying a lot for beer. I'd go here again but I just can't stand cigarette smoke, so I probably won't. I would have gave it two stars because of the smoke, but honestly, that really is the only bad thing about it... and since I went on a Wednesday, it wasn't too crowded and I didn't feel overly agitated, like I do in most crowded bars. So that deserves a full star. I'm glad I didn't go on a weekend... I don't know how bad (or good) the rating would have been if I went here on a crowded Friday night.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-18", "description": "Ok, I think Phone Booth has surpassed El Rio as my fav spot for a bloody mary.   They too use Guiness and the oh-so tangy delish pickled green beans, but for the same price give or take a few pennies you can get top shelf vodka. (Note to self: run on sentence).  I was feeling a little sideways from the previous night's festivities and two of these babies set me right!\n\nPretty chill crowd and friendly bartenders, one lovely lass bought be a beer..thanks!\n\nDef like this little hole in the wall. The only thing I question is why they allow people to smoke in there.  Otherwise, A-ok.", "author": "Faith S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-10", "description": "An alcoholics paradise thanks to the bargain basement drink prices. One of the best not so divey dive bars in the city. Great uber hipoisie atmosphere, crowd and jukebox. Though there's some activity and decibels, it's not bad enough that you can't hold some convo. WARNING: This watering hole ain't for asthmatics...bring inhaler. Otherwise, prepare for the kind of lounge space that Charles Bukowski would feel right at home. It's mui metro!\r\n\r\n4 thingys.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-21", "description": "i can't count the times an amour will inevitably state \"let's go to the phone booth\".\n\noh no, not again.  OK, it will be fun, it always is.  you just wish that you didn't have a date once you're there.  ;)  \n\ncash only please.\n\nhttp://www.youtube.com/watch?v=X_3bbEsELVo", "author": "Noel J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-28", "description": "The Prince Hits CD here is busted. Wasted other peoples money last night trying to hear Sexy MF and another fine Prince song. Don't cocktease with the Prince please, even if it's not my money.\n\nIn line with that, if you're enjoying a happy hour here and a drunken regular asks you to pick out some songs on the jukie because he doesn't have good taste, know ye this : he'll want to know what every song you chose is and by whom and also what it's like (I just want to hear something fun! Upbeat!). Then moments later when the song comes up he'll want to know all that all over again. Which, whom, what and suchlike as if he wasn't even listening the first time. About the time Violent Femmes came on and he asked \"Is this Prince?\" I went to the Red Place of the semi-batshit musical academic. \"Dude, this is like the opposite of Prince. Are you even listening?\".\n\nProps anyhow to the regulars here. This is one Mission bar that didn't alienate all the original joints rummies when the cool kids bought it. God bless their elastic pants, these lifers. Actual Gov't check recipients slurping down their E&Js before the fixed gear crowd checks in for their shift. You don't see that often. Nothing sadder then seeing a guy in a straw cowboy hat with a Saddam moustache staring longingly at the Latin-American or Doc's Clock as if to say, \"Man, I used to get in some knife fights up in this. But no more.\" Makes me get all Indian Crying At Garbage.\n\nGreat bartenders. So good they'd almost rate Five Stars. But there's the thing about the Prince CD hustle. Do not deny me Prince. To that end, if a working Prince anthology is an important bar criteria to you, feel free to judge this review \"useful\".\n\nCheck The Update 01/14/07:\nMy whistle-blowing saw a clear result in Wanna Be Your Lover earlier tonight. I'm going back for happy hour tomorrow to see if I can break off some Let's Go Crazy. Dearly beloved, when Prince breaks down The Agent don't sleep!", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-03", "description": "So I was sitting in the 21st Amendment drinking mediocre beer and the person I'm hanging out with says, \"lets go to the phone booth, do you know where that is?\" I'm a little surprised because she lives in North Beach and I didn't think anyone outside the Mission knew about this place. It's on the far side of the mission and not on the trendy side of Mission St. \n\nNot only do I know about it but also it's only a few blocks from my house. I wandered in there once and I got the feeling that it's a really clicky place and hadn't been back because while I liked it no one ever suggested going there.\n\nThe Phone booth is a cool little spot, it's small like the name suggests. There are plenty of colorful regulars, including a girl with elf ears. The beer is still only $4 a pint.  Also they didn't even seem to get mad when my companion kicked the table and knocked all the drinks on the floor breaking the glasses in the process. They sprung into action to clean it up like it happens there regularly.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "cheap drinks, rad service, creepy decorations, popcorn and a pool table.\n\ni like coming to this place when i am in the neighborhood.", "author": "Carmel U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-12", "description": "what is the deal with hipster and marina drama? people are people so why should it be, you and i should get along so awfully.\nYOU LIVE IN SAN FRANCISCO. if you have a problem with\n\n1. hipsters\n2. bridge and tunnel and their kin\n3. trust fund yuppies\n4. crackheadz & transients\n5. vegans\n6. homo-sexuals (gasp)\n7. normal people\n8. tourists\n9. time-travelling robots\n\nthen WTF are you doing here? dont go to mexico if you dont like mexicans. go back to suburbia aka purgatory aka where i came from\n\nif you feel \"not cool enough,\" tis' because YOU have issues with self-esteem.\n\ntake it from me, i speak from experience.\n\n-THE MORE YOU KNOW-\n\nyes this bar is small, the pool table is like catching a deluge in a paper cup. prodigious cigarette smoke permeates and the popular/mainstream-indie jukebox follows suit. stale pocorn. cheap drinks. surprisingly congenial bartenders. dudes with 10-o'clock shadows and members only jackets. girls drunk off their asses but not as easy pickins as your archetypal only 2 more vodka tonics away from a gangbang ho. \n\n1- booze cheap. that mean more horny drunk girls\n2- smoke allow. me smoke. me like\n3- hipster crowd. me wear tight pants. me fit in\n4- jukebox. mainstream hits. better than no hits on jukebox.\n5- popcorn. me no know what say about that.\n\nBOTTOM LINE: ive gotten FCUKED up here many a time and its a great place to do it. worth the trek to the ass end of the mish\ndisclaimer - avoid if you have problems with SSS (smoking, scenesters, self-esteem)\n\nedit: the jukebox! omg it has shiny toy guns AND arcade fire! \nthat alone elevates the phone booth into the upper ring of good bars.", "author": "JT X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-28", "description": "2 stars for ambiance.... staff was rude... even though i was the only patron. \"Irish\" bartender gave me a lecture on asking for 50 cents to complete my dollare three juke box request....after playing the only music on his box that he was jammin out to......\n lesson... DON'T GO ANYWHERE........just sayin", "author": "bryan h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "Drinks. Strong drinks. Drinks that get the job done.. whatever that job may be. My friend took me here the other night after a long night of studying studying studying. A stiff drink was in order.\n\nI love this place! Dim lighting, so even after a few drinks I still looked good ... well I thought so at least. Loves the juke box.\nI won't lie I felt a little awkward since I don't smoke the ciggs but after 2 drinks I didn't mind. Blah blah hipster central - I met a nice boy named Gabe and he was rocking the shit out of that scarf and flannel shirt.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-07", "description": "Though, once again, I refuse to qualify something as a dive that clearly is not, I do like this bar a lot.\n\nI like it from the strong drinks to the very eerie Barbie doll chandelier hanging overhead to the great jukebox that gets regularly updated to the regulars that span from surly and strung out to tragically hip. \n\nThis place is dark, sometimes crowded, sometimes blurry but always fun!", "author": "Drue C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-08", "description": "Walking into the Phone Booth on a Friday night is like walking into a house party.  You get the feeling you're going to know these folks a whole lot better by the time the evening's over.\n\nBut unlike a house party, the Phone Booth never fails to deliver an entertaining cast of characters.  Wasted and chain smoking, they're looking for nothing but a good time. From jangle jammers to Joeffrey ballet dancers, they're all obliterated.\n\nGo straight to the bar and order a few cheap ones.  Drink 'em down and stay until late night oblivion.", "author": "Nicole G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-02", "description": "As far as dives go, the place is a full five stars. Cheap. Eclectic crew of regulars, really well decorated for Halloween when I was there. Jukebox. Get a PBR and a Jameson for $7 any time. If you're down with indoor smoking, you've found your happy place.", "author": "Henry D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-25", "description": "Yes, this place does suffer from an infestation of hipsters, but, umm, hello: this is San Francisco. Besides, the usefulness of the term hipster has faded every since Norman Mailer burped out the term one morning while sitting on the toilet, yelling at nothing in particular. But mostly I think this because I would likely be labeled a hipster by someone who didn't know me, and I hate to think that sort of socio-profiling is going on in this enlightened city.\n\nSo yes: if you enjoy 24 oz cans of Tecate and cheap whiskey, that doesn't necessarily make you a hipster; moreover, you will probably enjoy this place. And yes, you can smoke inside. You might have one of two reactions to that sentence: \"Ewwwwwww\" or \"Hells to the fuck yes!\" I happen to fall in the latter category, as it gets cold as bees outside, and sometimes you don't want to relinquish your precious seat just to go feed your little addiction, you know?\n\nAnd I say \"precious\" because this place is small and does get crowded quickly, so show up early and lay claim to one of the tables in front. Then send out a trusted envoy from your party to buy drinks and mess with the jukebox, which is truly fucking amazing, if you are into that sort of thing.\n\nFinally, there is a pool table here, but anyone serious about playing pool will find themselves hopelessly annoyed by the tiny space.\n\nBasically, this is one of those bars that sucks if you can't find a seat, but rules if you can. My review is based on having a seat.", "author": "Max H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-01", "description": "Like Clark Kent you enter the phone booth and you turn into Superman.\nIt happens to all the patrons too or they feel that way when they leave.\n\nInside the the spacious booth you'll find lots of booths a single bar and a pool table in the back.  It can be a little cramped to play requiring the little pool stick.  Not so good to play with but great to wack your opponent.\n\nThe servers are friendly and it's dive bar prices.  It can be a little smokey in there, but besides that it a great spot to kick with your crew.", "author": "Po L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-21", "description": "SUPER cheap drink specials\n\nFREE popcorn\n\nOLD pool table\n\nI think people have failed to notice that this is a gay bar, because there's not that much gayness to it, except the 2 guys making out in the booth.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-14", "description": "Bars. Why did it take me this long to think about reviewing all the bars I visit. Doofus. \n\nSo this place. Nice little corner dive. Or is it. WTF counts as a dive in the Mission? They all seem pretty dive-y to me. This one might be more so because they let you smoke in it at night. Am I not supposed to say things like that that might get them in trouble? I cant be bothered to look at other reviews to reference, but whatever. If you dont mind smelling like old aunt Fran's floral print couch after a carton of reds, then head on over. The drinks are drinks. theres free popcorn, you might get to play with the occasional cute puppy. \n\nAlso the staff there is pretty nice. I went twice with my roommate who, when drunk, easily forgets how to act like the independently functioning \"adult\" that he claims to be. He fell out of his bar stool on the first visit and was asked nicely to leave. I would have kicked him out too, and was relieved that they did because I was definitely ready to go. The second time was same roommates birthday. He was of course plastered when I met him there and proceeded to destroy things inside left and right. \n\nAnyone else might have killed him, even myself had I been behind the bar. But the gal working that night was SUPER patient and allowed him to live. \n\nSo yeah. Big thanks to the Phone Booth.", "author": "Alfredo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-06", "description": "This looks like a job for.... Alcohol!\n\nDespite my desire to see Clark Kent appear at this bar, I had no such luck. I did have the luck, however, to recieve two dollars from the bartender to run in the juke box, which has a pretty super selection. No wonder some woman became all insistent I put on Snow Patrol's Counting cars. With the variety of their hulking cd collection I was also able to put on some Beatles, Violent Femmes, She Wants Revenge, The Subways and Mika. \n\nThe bathrooms have the old style gender symbols, so it was a little funny when my lady friend forgot that the green arrow means it's male, the cross means female. Given the windows into the bathroom though, you don't exactly need X-ray vision to figure it out.\n\nWhen it came to drinks, a measly $3.75 was all it cost for each beer, that wasn't watered down in the slightest. Trust me, I'm not cool with beers full of aqua, man. The quality of the shots here are also nothing to scoff at, so whatever you need they can hit the bullseye. I just wouldn't be a daredevil and order a martini. It's not that kind of bar.\n\nNot quite a divebar, not quite a hipster bar, Phone booth lingers somewhere in between. If you like either type it's worth stopping by for a quiet night. Or if you bring 40 of your friends, a loud and crazy one.\n\nJean Grey Wolverine deadpool Cyclops Hawk Girl Gneen Lantern.\n\nOkay, it's out of my system", "author": "Keith M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-20", "description": "It's definitely a dive bar that is deep in the Mission. I guess it is cool that you can smoke there if you smoke... that is all i can say about that...", "author": "Minh V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-21", "description": "I pepper sprayed a guy here a couple years ago because I thought he was about to assault my roommate.  Okay, so I kinda jumped the gun, but I managed to clear out the entire bar.  Everyone spilled out onto the sidewalk, the bartender chick was going crazy, and all the hipsters were coughing.  I remember hearing some girl mention something about her asthma (I felt really bad).  I thought pepper spray was a straight shot and didn't know the particles were going to dissipate into everyone's lungs, including my own.\r\n\r\nNot sure if doing what I did should've gotten me in trouble or not, but since it didn't, I must give this bar 5 stars for tolerating my trigger-happy, party-foul-ing self.  Honestly, I think I was just jonesin' to use my pepperspray on someone :)\r\n\r\nIf you were there that night, I apologize for any inconvenience.  My roommate and I walked home in silence and never went out together again, and I haven't been back to the Phonebooth since.", "author": "Karen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-26", "description": "Do I need to dive into how awesome this bar is? No...\n\nIt's awesome, OK? It deserves 5 stars, which if I'm saying that and rating it a \"5\" that really truly means it rocks! \n\nFIIIINE, here's a quick rundown of why I love the Phone Booth: \n\n- free popcorn .\n- great red-light ambiance \n- great music on jukebox \n- small place in general --- very intimate/personal\n- great pool table \n- interesting patrons (lots of hipsters, but I prefer hipsters to yuppies or rednecks) \n- great memories! (I know this one doesn't really count) \n- good service \n- (this one doesn't apply to me anymore, but) you can smoke inside. \n- great feel inside, love the decor/atmosphere \n\nSO yeah, 'nuff said. The Phone Booth is my favorite dive bar, period.\n\nAnd I miss it.", "author": "Kai S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-22", "description": "Ok, Ok,\n\nI've owed this place a review a long time ago.  The Knockout is where I get my BINGO game fix.  The Phone Booth is where I get my Naked Barbie Doll Chandelier fix.  It was love at first sight.  Not only is it a 3 minute stumble/ crawl from my house, but on any given night, this place is packed to the gills with a friendly, rowdy, sloppy bunch of lookers and ruffians.  \n\nThis is where you profess your love and appreciation to your roommates and friends through drunken group hugs.  This is where you help your friends pick up on other gals and guys, and no one is creeped out.  This is where you can talk to your neighbors, crash in on their conversations and everyone will return the love back.  \n\nIt's a rowdy oasis smack in the middle of a quiet yet shady mini hood of Mission.  Oh how I love thee.", "author": "Xandria S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-22", "description": "I had never heard of this place until someone from the neighborhood told me about this hidden little secret. Then the very next night I found myself there.\n\nIt's a small. It's a dive. It's dimly lit. There's a pool table in the back. $2 PRB on tap! Not a bad place to kill a few hours with friends.\n\nOooh, before I forget, there's some impressive kitsch artwork on the walls. Apparently I was so dazzled by the shinny coat of arms up on the wall that I totally missed seeing the Barbie chandler and the popcorn maker!", "author": "Aria M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-13", "description": "My best friend's arm got fucked up by a crazy drunk who the owner's never reported so I've got some beef with this place. I thought it was homely, why it gotta get all nasty?\n\nOther than that, man, I always have a good time here. Unlike other dive bars the wine isn't god awful, and I can even drink the beer from time to time. Best of all though folks is the juke box. I always learn something new, say a song, whenever I go here. Good selection, great customers who pick great music to listen too.\n\nI need to go back, lest I listen to Lou Reed yet another millionth time in a row.", "author": "Alexandra M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-26", "description": "This is a great neighborhood bar - wish I had one like this close to where I live....or maybe it is good I don't have that temptation...", "author": "Rick D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-26", "description": "This is hands down my favorite bar in the city.  I love the staff, I love the regulars, I love the jukebox, I love the bathroom!!  I usually go here after work and meet friends here for a drink or two.  The down side is I can usually never find a table and always sit at the bar.  I'm not usually a fan of sitting at the bar, but for the Phone Booth, I'll make and exception ;)\n\nI wish I could in good conscious give this place 0 stars and tell everyone to go away so that I may get a table in the near future, but I can't, this bar is just too great!!!!", "author": "Jessi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-25", "description": "Stiff ass drinks.  Tiny bar.  Smoking is allowed inside.  They have popcorn.  Hipsters.  \n-Matt", "author": "Matt N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-20", "description": "Caveat - when a friend and I were hanging out in this bar it was during the middle of the day and we were the ONLY ones in the bar....so I have no idea what the crowd is like, at all.\n\nHowever, from my experience I plan to definitely go back!!!!! \n\n-Prices were good\n-Good bloody mary (see review below)\n-Friendly bartender (Martin was his name)\n-Free popcorn\n\nWhat more could you ask for in a dive bar?  \n\n*******Blood Mary Review**********\nThe drink I had proved more why it's completely unacceptable to have a bad bloody mary.  \n\nIt was obvious that while the bar tender knew how to make a bloody mary, the bar wasn't 'known' for having good bloody mary's or the bartender wasn't necessarily even an excellent craftsman of the drink.   What it proved is with the right ingredients and just a bit of care, a damn fine drink can be made.  It had balance, tasted good from first drink to last drop - it was all I could ask for. \n\nSo I have to ask myself, why is it that even restaurants that have a bloody mary on their special drink menu more often than not make such a crappy drink?  Why is it more often than not that I get a bigger, cheaper, and better tasting bloody mary at a dive bar than at brunch at a restaurant?  \n\nFrustrating!!!!\n\nhttp://www.yelp.com/redir?url=http%3A%2F%2Fwww.yelp.com%2Flist_details%3Flist_id%3DYHu-iA23Xj2c1bVa7JROhA", "author": "Josh M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-11", "description": "I have a feeling this is a place where ANYTHING goes...\n\nmaybe the best dive bar I've ever been too??? perhaps.\n\ndefinitely divey and whores galore.I think i'm in love. This place rulez: smoking, and cigs on the floor. Cheap drinks, and windows into the bathrooms. tiny. dirty. rock n' roll. Definitely a place to get crazy and do some drugs or other things you're too punk to regret..", "author": "jane l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-19", "description": "I went to Phone Booth over the weekend with a friend of mine after hitting up Truck earlier. \n\nWow, this bar is pretty cool. I haven't been to a bar in awhile that allowed smokers to smoke inside. I'm NOT a cigarette smoker, but for some reason the smoke didn't bother me, despite seeing at least 8 people smoking. Stangely enough the smoke kinda added to the cool vibe. Because it's smokey, if you were so inclined, I bet you could get away with smoking the other stuff here too.\n\nI liked the music being played on the jukebox and the bartenders were real nice. I will go back again. \n\nIt seemed to be mostly a straight bar, but me and my gay male friend felt very comfortable. I prefer mixed clientele bars and this one worked just fine. Very cool and tolerant crowd.\n\nMinus 1 star because I wish they had a dart board, since I don't play pool.", "author": "Yvette K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-09", "description": "A big group of us went here after the Super Bowl. It was crowded (but not too crowded) and some of the patrons were belligerent (a little too belligerent). Some perv was hitting on & arguing with my friend, which wasn't cool, but I was able to ignore that freak and listen to the many good songs available on the jukebox. Plus, the bartender periodically checked on us to see if we wanted drinks, which is good. The only downside (other than the perv) is that it was way too smoky, despite the big no smoking sign.\n\nAlso, they sell pitchers of beer for $9.\n\nI'm giving it 4 stars. If I hadn't smelled like smoke/death I'd rate it 5.", "author": "Wes F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-26", "description": "I like this place.  It is a good dive bar and usually not too crowded.  Drinks are good, good price and good poor.  I would visit more often if it wasn't a smoke house.  Bartenders are usually super cool as well.\n\nPros:\nGood drinks, good price.\n\nCons:\nSmokey.", "author": "Ted t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-14", "description": "I can see the appeal, I mean, if it was my neighborhood I'd be down to go here on random week nights.\n\nBut I went on a Saturday night with friends and it was a tad far from me in the TL, and it was too crowded.  Couldn't order drinks, couldn't sit down, couldn't get out!  The door was blocked by morons who wouldn't move out of the way.  I hate feeling trapped.  Also, it smelled hot and funky.  I ended up going home before my friend attempted to order me a drink.  They stayed however and I guess had fun.\n\nJust not my cup of tea for a Saturday night.", "author": "Mary R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-09", "description": "ME: \"Operator, I'd like the number to the Phone Booth\"\nOPERATOR: \"You'd like a number to a phone booth?\"\nME: \"No, it's a bar\"\nOPERATOR: \"You'd like the number to a phone booth inside a bar???\"\nME: \"Sheesh\"\n\nDIAL TONE.\n\nWIth that aside, this establishment lies in the top three of my bars of choice in the city. You can get beers in a can. A martini in the proper glass, and the usual fare with friendly tenders behind the bar.\n\nIt has a pool table probably not regulation size b/c of the small size of the room, probably the size of a large phone booth, haha. I've heard complaints from some girl companions about the peeping tom views of the bathrooms, i say, flaunt it bitches!\n\nAnd then there's the smoke. I'm a weird smoker, i only buy packs when i'm in bukowski writing modes which is 3 or 4 months out of the year. People do chain smoke here, but usually not at the counter. But your clothes will wreak of parliaments, i say, smell it bitches!\n\nThere is the hip factor especially at party time on the weekends which can annoy. One insulted me, \"what accent did you lose?\". Hehe, good one, it's going in the script.\n\nThe juke is better than most with some electro and cheese metal, and the crowd can shake to it.", "author": "wayne s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-02", "description": "You scene-worriers, relax. The lemmings are only annoying if you deign to take them seriously. They are zoo animals, take a gander. laugh aloud. When you are having the most fun, you are in charge.\n\nAnd there's no better place for all this then the Phone booth! Cheap drinks in a pocket-sized bar, with a Barbie chandelier! Earlier is better for sitting and chatting, and the smoked sardine experience starts up later.", "author": "j r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-18", "description": "God bless it, I love the Phone Booth. That there is a place in San Francisco where I can smoke, eat free popcorn, sing along to both Wham and Interpol and get my shit rocked for $3.50 a glass makes me believe in Jesus again. \n\nThe good news is this place is one of my top three favorite bars in the city. The bad news is it's everyone else's top three favorites. Don't show up here at Rock O'Clock and expect to do anything except share a stool with a cute and slightly smelly hipster in a scarf, otherwise you'll be wearing your cranky pants. That said, it's just a happy place to be.", "author": "Jaime S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-11", "description": "BAD WAY TO TREAT A 1ST TIME LOCAL CUSTOMER-  WHAT A BAD TASTE LEFT IN OUR MOUTHS!\n\nMy friend from UCSF and I heard that this place was really chill and served strong and cheap drinks, and they do... BUT BEWARE:\n\nWhen they were about to close, my friend was exchanging numbers with a girl when the doorman/bouncer asked us to leave.  I being one-drink sober told the guy they were exchanging numbers and my friend was killing his beer.  He stood next to us, AND ONLY US, even though there were 15 other people still there. His hipster and attitude-laden response was that ALL of the other people had \"permission\". \n\nHe pulls my friend up and says, \"Finish your drink and leave!\"  As my friend went to finish, the bar employee POURS THE BEER ALL OVER THE FLOOR.  MY FRIEND HAD JUST PAID FOR IT AND WAS ABOUT TO DRINK (so we could leave).  Obviously, after this a**hole door guy push my friend's drink over my friend was pissed and demanded his money back and an apology. The nice women working the bar offered him the money but the door guy wouldn't apologize. \n\nWHAT fucking pretentious attitude to show after we spend money and time quietly chilling at their bar. NOT THE WAY TO TREAT CUSTOMERS, even if you allow smoking in your bar you still need customer service. \n\nGreat atmosphere -too bad the people who work there have an attitude problem. The two girls behind the bar could not have been nicer, too bad that one guy ruined out 1st impression, not going back soon!", "author": "Max K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-01", "description": "I need to go to the Phone Booth more and say hi to the black velvet panther, I've been missing it the last few weeks.\n\nThe Phone Booth does something to its drinks --- they are strong beyond all reason and well mixed so it's hard to tell sometimes.  I go in for one beer and end up confused 6 hours later with a massive drunk and yet I still manage to have at least 1/3 of the money in my pockets that I started out with.  I remember when the Lawrence and Garner v. Texas ruling came down, I was sitting in the Booth and the whole bar cheered, something along the lines of \"Woo-hoo! sodomy!\"  It was really a very touching sense of community goodwill that suffused the place.\n \nI am also glad to report that the cabs full of \"slumming\" frat-trash seem to have stopped pulling up outside and hence the bar has gone back to its traditional mellow mixed (age and sexuality) Bernal/Mission crowd, even on weekends.", "author": "Gustie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-10", "description": "Why is it every time I go to this bar, someone winds up making out on the pool table? I think that table sees more lovin than it ever does actual pool. \n\nMy favorite pool table pas de deux? The gay man/straight woman tango in which the gentleman in question lavishly twirled and strutted with his partner, and leaned her back onto the pool table (her legs went up in the air in a perfect \"V\" - water ballet style) before dipping her (nearly to the floor) in front of his friends and yelling to them \"I can't handle this vagina!!!\" \n\nHe said it with obvious enthusiasm. As in \"Wow. This vagina is driving me insane with dance madness.\" \n\nAnd that is why I love the phone booth. Also, the drinks are cheap.", "author": "H. S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-18", "description": "Cheap drinks, awesome jukebox and a pool table... so what's not to like about the Phone Booth?\n\n* Cigarette smoke.  You forget how gross cigarettes are until the smoke gets in your eyes, and on your clothes... even one of the bartenders was smoking.\n\n* It's cold.  Maybe it was just a Thursday night thing, but both front doors were open and it was cold at the bar and cold in the bathroom -- which, by the way, is filthier than what you'll encounter at most gas stations.\n\nI like dives, and damn if the Phone Booth doesn't have one of the best jukeboxes I've seen in all of the Bay Area, but I won't be going back anytime soon.", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-18", "description": "Strong, cheap drinks. Interesting jukebox with everything from the Gossip to Belinda Carlisle. Smokers. Dirty. Dark. Friendly people. Generally awesome.", "author": "Kimberley D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-31", "description": "Going here on a weekend can be a mixed bag -- if you get a table you can keep to yourself it's okay, if you can't then it's pretty much hell.\r\n\r\nThe real reason to come here is the staggering cocktails they pour, and for cheap. We're talking six-or-seven-second pours for three dollars. You can get drunk for cheaper, but it involves a brown bag and a pint of Taaka. Go on a weeknight when you're looking to get trashed early.", "author": "Jake S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-31", "description": "I'd give this local watering hole five stars, but the smoking inside made me only give the Phone Booth four stars.\n\nIt was earlier on Friday evening when I was there, loved the jukebox, and the bartender, who wasn't outwardly friendly, but did make a good vodka martini that I requested be extra dirty (pornographic actually, as I like to call them). \n\nThe crowd was mixed, both gay and straight, and many people sang along when their favorite song came on, including a rowdy rendition of \"9 to 5\" from Dolly Parton. Overall, this was a place that you really need to have some drinks at, it's that much fun. Just be sure if cigarette smoke bothers you, get ready to hold your breath.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-30", "description": "love this place. I was there for a minute on Saturday night but it was crowded so we stepped out. The bartenders are cool, the drinks are always cheep and the poor is always heavy. What more can you ask for.", "author": "josh m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-25", "description": "Great dive-y bar. Weird stuff hanging from the ceiling.\nGood place to get a table with friends. Pool table. \nIt's far enough from the epicenter of bridge-and-tunnel (16th/Mission area) that they either don't know about it or it's too far for them to venture. \nThere is smoking inside but as a nonsmoker it's never really bothered me.", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-21", "description": "Chicagoans: This bar is like a mixture of The Empty Bottle and Hungry Brain.\n\nI came here on a Sunday afternoon and there was a great crowd. Mostly older men that didn't look like they'd hang out at a hipster bar. But they were sweet and the clientele changes the later in the day it gets. \n\nSuper cool bartender and even super cool-er Barbie chandelier. Good stuff on the jukebox. it was just my speed. Not sure if it is this cool on a weekend night, but I loved it.", "author": "Kera E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-09", "description": "My first experience with The Phone Booth was on a St. Patrick's Day when the Mission was overrun with Marina and bridge/tunnel douchebags vomiting in the gutters.  Seriously, what's wrong with you guys that you can't hold your booze, especially when all you're drinking is green PBR?  (Also, as an aside to other Yelpers, please note the your/you're distinction.)\n\nAnyway, a small group of us wandered into The Phone Booth and found it unpolluted by the aforementioned douchebags.  The bartender was friendly and fast, which serves as a nice contrast to, for example, The Dovre Club, and we were able to chill with some booze in a companionable atmosphere.  TPB is the place to go if you just want to kick back with a drink, talk with your friends, and feel welcome.", "author": "Bitter J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-29", "description": "cool, low key dive bar.\n\nawesome jukebox.", "author": "Anne B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-06", "description": "This was the first bar I got wasted in when I moved to San Francisco.\n\nThey make really, really, REALLY strong drinks.\n\nI threw up in the bathroom and there wasn't a working lock on the door so a bunch of people came in on me. I don't know about you, but I like my privacy when I'm throwing up. Short bathroom stall doors, too.", "author": "Maren C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-23", "description": "This place is alright to me. It gets super packed, and I didn't care much for the music. The cigarette aspect was both nice and frightful. The best part besides the cheap beer had to be the creepy naked Barbie chandelier. Oh, and free popcorn.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-03", "description": "Always the place I come to when I have friends in town.  Great beer selection and the $4 Hoegardens can't be beat.  The jukebox is also always rockin'.  Smoke!!!!!", "author": "Sin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-13", "description": "Excellent neighborhood bar, period.\n\nOkay, I take that period part back because otherwise this would be an annoyingly super-short review.\n\nFirst off, the bartenders are solid.  They aren't looking to be your pal, but they are friendly enough and pour good, stiff drinks.\n\nSecond, yes it is small.  If you are afraid of someone brushing past you, then don't go.  Come to think of it, better move out of the City entirely.  Don't plan on finding a seat after ten on a weekend, but does this really matter?  You are there to drink, enjoy good company, drink, listen to the excellent juke box and drink.\n\nC. And as for crowd, yes, you will see a few bad shag haircuts, skinny jeans and ironic t-shirts, i.e., people we all like to mock as \"hipsters,\" but you will only notice if you are bored with your own company (and not paying sufficient attention to drinking) and need something to talk about.\n\nOk, now period.", "author": "Padraig M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-22", "description": "I hereby dedicate my 100th Yelp review to my favorite San Francisco bar, The Phone Booth.\n\nI don't think it's an exaggeration to say that this bar is one of the reasons I stayed in the City during those first few difficult months of living here. After a day or a week of feeling out of place, lonely, wondering what in the world a midwestern girl like me was doing in a crazy city like this, I would sidle up to the bar at the Phone Booth, order a well vodka and cran for $3, and my worldview would immediately improve.\n\nTheir prices have gone up a bit since then, but they still have some of the cheapest drinks around, and definitely the strongest.  The bartenders are friendly and the jukebox is one of the best.  It gets a bit hipstered out on the weekends, but if you get there early or go on a weeknight, it will be the bar of your dreams.  If you're me.\n\nI have peed in the alley around the corner at the beginning of a long trudge home.  I have celebrated two birthdays here.  I have secret pet names for the bartenders.  I have fed lots of quarters to the great jukebox. I have smoked lots of cigarettes inside.  I have danced and played pool and been heckled by the regulars.\n\nI don't get down here as much as I'd like to these days, but this bar will always hold a special place in my heart.", "author": "Megan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-10", "description": "The bartenders can be hit or miss here, sure the bar stinks, yes when you go home you can't recycle the clothes you wore because they reek of smoke, sure it gets super crowded as the night progresses, I know the popcorn- no matter how fresh it is- never tastes fresh.\r\n\r\nBut I have a love for this bar because of all the good times we have had together, and nothing can ever take those away.  All those drunken half-blank memories of taking happy hour way passed the happy hours.  Remembering the nights when Sara would slip us an xtra shot now and then.  All those PBR/Whiskey specials.  The Tall cans of Tecate stacking high on our table.  The jukebox playing AC/DC's \"Hells Bells\", followed by the overplayed \"Jolene\" by Dolly Parton.  The time spent wondering why anyone would hang up a picture of Tom Sellec.  The nights stumbling my way back to my friends house down the street, waking up and wondering how I got home, and why did I feel so friggin sick, and then I get a whiff of my jacket and I knew I had been at the phone booth.", "author": "Bone D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-22", "description": "Love the small, intimate and unassuming bar setting.\r\n\r\nLove the mix of locals and hipsters.\r\n\r\nLove the pool table.\r\n\r\nLove the free popcorn.\r\n\r\nLove the jukebox with a rotating and eclectic selection of some really great tunes.\r\n\r\nLove the properly poured and priced mixed drinks.  Just your basics though, they'll give you the stare down if you ask for anything more complicated than a Jack and Coke.\r\n\r\nLove the bar special of Jamesons and Ginger Juice.  Spicy and strong.\r\n\r\nLove the friendly bartenders.\r\n\r\nHate the attitude some of the bartenders give you if you aren't a recognized local.\r\n\r\nHate the pseudo-private and claustrophobic bathroom that doesn't quite lock and that you can sort of see into if you try. \r\n\r\nHate the cooler -than-thou hipsters.\r\n\r\nHate the chain-smoking-cooler-than-thou hipsters.\r\n\r\nHate the chain-smoking-cooler-than-thou hipsters taking over your table and pretending like they don't notice what is going on.", "author": "Sharon R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-08", "description": "surly bartenders, affordable swill, jukebox jumps and just a lot of goddamn fun!  see you there", "author": "Mike M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-11", "description": "I puked inside the bar, on a bench and on some chicks hair.. and they let me back in after the kind bar back cleaned it up and when i was done  after a breather.\n\nthats awesome..\n\nI usually go for Dolly PArton, jesus And Mary Chain, Prince.. on the jukebox...\n\ni cant understand all this resentment against so called hipsters.. i mean i have no idea what a hipster is?  do they even exist? I get along with everyone.. for the most part... and if people wanna keep to themselves, so be it.. if somebody bugs me, i avoid them politely.. maybe the person who has  a gripe, is annoying..", "author": "Georgio S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-29", "description": "Stephie went to Phonebooth for her friend's 21st, because her friend was trying to get laid by a midget douche.  Aren't the midget douches the worst?  It seems the shorter you get as a douche, the more insulting it is to the senses.  Anyway, some weird troll looking guy entertained her by barking nonsense and screaming at his dog, Joseph.  Stephie, being a comedic genius herself, sensed that he was trying to be funny and appreciated it, because hanging out while your friend tries to get laid by a midget douche for her 21st birthday is pretty, pretty, pretty.... lame.\n\nStephie says don't bother washing your hands after the bathroom.\n\nMikey says, \"what's phonebooth?\"", "author": "Steph and Mike A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-18", "description": "It a great dive bar they have good cheap drinks and the service was excellent . So many regulars were having a good time and we started talking with them and they started telling us stories about this place.", "author": "Yoen K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-17", "description": "Pretty much no bar is worth walking into a cloud of cigarette smoke, and Phone Booth is no exception.  I'm sure if i liked smoking i would disagree with myself, so don't bother pointing this out to me.  Sure, the drinks might be cheap and strong, the juke box might be rare and exceptional (i wouldn't know).  But let's be honest: hipster bars are a dime a dozen in the mission, most are smoke free, and i'm fine with paying a quarter more per beer to not smell like someone else's second hand smoke tomorrow AM.", "author": "Melodie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-08", "description": "my neighborhood hipster dive.  drinks are priced fairly.  a good to great jukebox, that lays heavy on the Duran Duran - could do without the Lady Gaga cd in there (though I'm told it has since been removed).  word of warning tho, lots of smokers.  a good place to go when yr alone at 12:30pm.", "author": "eric i."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-24", "description": "If you are gonna hate, please don't come to this bar. We don't want you here, we don't want you to eat our popcorn and we don't want you crowding our space. \n\nI am sorry if you are too self-conscious and busy looking at everyone else to enjoy the super-cheap drinks and fabulous atmosphere. \n\nThis is the first bar I ever went to in SF and after 3 years it is still my favorite!  It's one of the only spots left that hasn't been corrupted by the far reaching claws of the Marina-in-the-Mission weekend movement, and it's  not nearly as hipstery and obnoxious as Pops.\n\nI am lucky enough to live a block away and call this my neighborhood bar. Strong cheap drinks, great jukebox, free popcorn and good friends! What more could you want?", "author": "Javier B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-18", "description": "Eww, smoking in bars... gross. I hate it when that smoke lingers on your clothes for days. And its hipster central! Its like American Apparel opened a dive bar.\n\nThough not my scene, the drinks were pretty cheap, and if you smoke, own a bike, and refer yourself as a 'hipster', I can see it being a fun place to be. I'll take my fresh air over this anyday. *cough cough*.", "author": "Rocky K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-05", "description": "Not much to say about this little number other than: Smoke. Popcorn. Pool. Drink. Sweet jukebox. \nClearly a bar designed for smokers so all you pompous SF yoga health freaks out there stay clear and need not let another good place go shit. RIP Amber Lounge.", "author": "Jessica U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-20", "description": "A fun narrow little bar, interesting painting and kooky decorations.   But a point off for being a smoking bar (people don't even bother to hold their cigarette low or be considerate of other patrons -- I'm not saying you have to go outside, but don't blow it in other people's faces). And another point off for the crowd -- a little too cool for school. Truly cool people don't need to broadcast it...", "author": "Vanessa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-08", "description": "Scary on the outside but fun on the inside.  It did have a bit of a Castro vibe to it with the way it was decorated.  All of these silver painted branches popping out of the wall.  It gave me the impression that some queen from the Castro tried to put a fancy touch on the place.  It didn't work for me but I did enjoy playing pool.", "author": "Scott P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-20", "description": "Have you checked out the bathroom situation at Phone Booth?\nIt is SO FREAKING COOL.\nI'm serious. You walk up to a green window/door and look through and you see the toilet behind another door and in this way you can tell if someone is in there. It is immaculate and delightful to use these toilets. At least the Women's. \n\nOh..The bar itself. Right.\nIt's rockin', too. They had some nice Halloween decor up when I went.", "author": "Addyline L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-03", "description": "I have had so many varied experiences here.  Some nights are just awesome.  Cool music, cheap drinks and a fun crowd.  Other nights it is so packed that your date has to stand on your feet. There is just nothing fun about that.  I mean, I know 'the phone booth'... it is small.  But there are better ways to set up a bar than just haphazardly throw 8 tables and a handful of chairs into the space and 'let the bar configure itself.\n\nAlso, is everyone that goes here from the old Kilowatt crowd?  Seems like the same vibe as that joint circa 1999-2000.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-14", "description": "You can smoke in here, which is cool if you do, but I don't and I stank afterwards :(\n\nPeople were nice. Bartender was nice enough (except she kept keeping our change without asking..).  Good enough on a Monday night.", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-23", "description": "An excellent little neighborhood bar that over the years has turned into a hipster haven. Long ago, you would find the most interesting mix of Mexican tranny's, blue collar locals, and random folks who happened upon The Booth for the first time.\n\nLuckily they still have the popcorn and the pool table.", "author": "Chris I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-27", "description": "Popcorn + Cheap Drinks = Heaven. I love the bartenders. i love that I can have 'dinner' here by stuffing myself silly with free popcorn while I down deliciously cheap vodka sodas. I love how many crazy evenings have started or ended here.\n\nI would give it five starts except for them advertising on their menu a super cheap bottle of champagne which I've only been able to have once. Every other time I've asked they're out of it. And that one time I was so gone already that I might have imagined it. Then again that's probably a good thing because if they started offering bottles of Cooks on the menu, I would probably never leave.", "author": "Jen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-04", "description": "Cheap beer, a chandelier made out of Barbies, laid back people.  If you happen to have a birthday cake on hand, the bartender will provide you with a knife for cutting the cake.  You can even smoke inside!\n\nAll in all this place would merit 5 stars but for the snarky person at the bar who mocked the fact that I used the word \"like\" in a sentence when I asked the bartender if I could borrow a knife.  Please dude, I don't need your sass!", "author": "Katina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-10", "description": "Bring a friend to the Phone Booth and you'll leave being solid BFFs forever as you share secrets over those giant cans of Tecate. Snuggle up at the bar and be entertained by hilarious patrons and a bartender with a wicked sense of humor. Enjoy a strong pour in a $4 cocktail. This place is one of my favs - it is what it is. Unapologetic dive bar. If you dislike this type of bar, stay out and take your whiny yelp review with you. Bleh.", "author": "Allegra F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-02", "description": "$4 cocktails?? I'm in! \n\nIt's the definition of dive. Jukebox, unpretentious, dimly lit, you can smoke inside (or at least it smells like you can), cheap drinks, and 1 bartender. $1 @ the jukebox gets you 3 songs, and the selection is pretty good too. \n\nThis is the perfect place to get the night started and then move down Valencia to the various other watering holes. I'll definitely be back!", "author": "Yee-Shing W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-24", "description": "P Booth is the truth.  Its got an amazing jukebox, a delightfully worn pool table and I always run into friends there.  Always.  But the best part is definitely the drinks: the bartenders measure booze like 60s pot dealers and its almost always an eight finger count.  Seriously, I had friends from LA up here and they could not believe how much Makers you get in a drink for five bucks.  \n\nI'm a Makers and ginger guy and now they even have some special home made ginger concoction that is perfect for getting sauced when you got a cold.  Really good shit.  \n\nNow if they only had Racer...", "author": "Gianpaolo P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-16", "description": "I like to call it \"Smokey the Bar.\" Anita is awesome and it's a bar you can smoke in. Don't get me wrong I like not being able to smoke in bars but when you're sitting at the bar PBR in one hand Makers rocks in the other you don't want to leave that moment to go out and smoke. It's slows down the getting drunk for cheap process.\n\nI LOVE SMOKEY THE BAR!!!!", "author": "Prestin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-25", "description": "best smoking bar in town, great music", "author": "Peadar K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-15", "description": "A nice spot to come in for a quick drink, or a place to linger for a while taking in the decent jukebox and loud chatter of the other patrons.  The bartenders are always friendly, and there is a good selection of both draught beer and liquor.  \n\nBe warned, it is tiny, and a trip to the loo will most likely require waiting for a shot of pool to be played.\n\nIt's the closest thing I've found to my favorite hangout  (back in NC) so far in SF.", "author": "GeneR S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-22", "description": "Prior to his nonsensical ramblings in The Expendables Mickey Rourke was cast in a film called Bar Fly. Portraying a rough and tumble alcoholic poet his character occupied a space at a down town dive bar, over-running his tab, picking fights with the local steady and making a mess of himself in the company of any female who would entertain his type. This film romanticised, in a peculiar way, the American dive bar. An establishment operating with the sole purpose of getting its clientele well and truly liquored for a reasonable amount of money. The Phone Booth is the last remaining homage to the great American dive bar. Located off Mission this locals-only haunt consists of an old, unkept bar serviced by disinterested bar staff, a stained old pool table and a gang of faithful natives all of which seem to pay no regard to the recently imposed national smoking bans. It was refreshing to find an establishment that operates under an unspoken client-staff agreement, you do what you want and we will tell nobody. A bar that never measures drinks, plays the bartenders ipod and allows everyone to smoke inside; a seemingly blatant middle finger to the powers to be. I recommend staying till close on a Saturday night just to witness the crass but highly effective approach the bar tenders take when clearing their place of business. The Phone Booth is a diamond in the rough, the last Lost Boys club, be ready to drink and enjoy your favourite unsavoury past times.", "author": "ryan b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-01", "description": "When I go into a dive bar I generally stick with beer to avoid getting poisoned by the lowest of the low end alcohols so often kept on bottom shelves at these establishments. However, last night I wanted something a little tastier and the adorable Monday night bartender whipped me up a cosmo (and then another. and then another). I could not stop talking to my friend about how good it was all night. So much fresh squeezed lime and little chips of ice floating on the top, just like it should be done. One star off because personally I think smoking inside is way gross.", "author": "B. C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-30", "description": "one recent evening, i was hanging out with friends of a friend at the phone booth.  i didn't know these people too well and honestly, i'm pretty sure i didn't want to.  however, i felt like i must charm the pants off of them and have them all secretly or not so secretly in love with me by evening's end or else my entire sense of self worth is out the window.  i'm totally insane/insecure like that.  the problem with this particular night was that due to a fairly large amount of alcohol consumption earlier in the evening, the laura b charm machine was set on TOTALLY FUCKING NUTS.  \n\nconversation went a little like this:\n\nscenester #1:  i'm in a band.\n\nlaura b:          BANDS ARE GREAT!\n\nscenester #2:  cool.  so am i.  where does your band play?\n\nscenester #1:  makeout room...\n\nlaura b:           I LOVE THE MAKE OUT ROOM!\n\nscenester #1:  (continuing) ...a couple other places, ya know.\n\nscenester #2:  cool.  me too.\n\nlaura b:           I AM NOT IN A BAND!\n\nscenester #1:  (bummed out sounding) yeah, but we don't have any gigs until september.\n\nlaura b:           AUGUST IS A BULLSHIT MONTH!!!!\n\nall scenesters:  silence.\n\nlaura b:           i'll take a jack and coke, please!\n\nthe rest of the evening was pretty much spent engaging the bartender in a round of, \"what color underwear is that girl wearing?\"  which seems like an innocent enough game until the tables are turned on you.  this would mistakenly appear to be the   low point of the night but actually, i believe that came when i drunk dialed my own parents.  I DRUNK DIALED MY OWN PARENTS.  this ended in a lecture about my substance dependency issues and the fact that i am 28 and on a road to nowhere and will probably die alone with 16 pit bulls and a mean case of regret.  MY OWN PARENTS!!!!  totally fucked up night.\n\nall of my memories of the phone booth pretty much roll like that.  which is to say, pretty lamely.  everyone here is trying just about as hard as the juke box.  see ben v's review for more info on THAT.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-06", "description": "Love this dive bar, great mission scene", "author": "Scott R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-27", "description": "Love the vibe at the Phone Booth. GREAT jukebox and cheap drinks. My only quarrel is that they let people smoke in the bar. I always leave stinking of cigarettes. Boo to that.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-01", "description": "i rang in the new year here last night. the decor was 'heavenly' and they gave out free champagne. besides this, my drinks were cheap and tasty and when the new year hit a monkey ran in and jumped around for us all and i kissed someone i love.  also, i was given free pot which was vaporized shortly thereafter. i also experienced riding on the back of a bike for the 1st time and all in all, celebrating at the PB was not too shabby if ya ask me...  since my evening prior to the PB consisted of a shitty mission crawl, i was happy to have not gotten stabbed or puked on.\n\n\nhere's to a happy new year everyone!!!", "author": "Karen K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-05-19", "description": "A jukebox can be a very telling piece of anthropological evidence when evaluating a bar.  Put in context with this bar's patrons, everything starts to make sense.  Let's say you're into \"punk\", well, we've The Clash, a little Go-go's (for the ladies) and you know, like The Stooges.  Oh, so you're so hip and unique your thing is \"soul\" music, well we've got some Aretha Franklin for ya.  Oh, so you're a \"rocker,\" well we've got Nirvana, a little Motley Crue.  Or maybe it's the 80's you're vibin', well we've got some Billy Idol, a little Duran Duran.  Oh, wait, you're one of those people who truly is just interested in hipster fashion, well, for you we've got some Coldplay, a little Killers, you know, all the new hip musical accessories.  Like, seriously is this place a joke?  Bar owner: \"Let's take the most generic, pop culture examples of each genre of indie subculture and throw them together on our jukebox.  I'm sure our patrons, who dress, look and act like they've just scratched the surface of this subculture themselves won't see our ironic grin.\"  \nThis bar is crowded, smoky, exceedingly dark, and you can't even break on the pool table without brushing your stick up against a nautical star tattooed arm or some buttock in a pair Seven jeans looking to fuck an \"artist\".  Before 9pm it's a decent place to have a conversation and a beer, so it gets an extra star for that, but like, for real.  Who are these people and what do they stand for?", "author": "Ben V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-08", "description": "Everything about this bar is perfect, except for the smoke that assails you as soon as you walk in the door. Cheap, good drinks (including some specialty drinks you wouldn't expect), great bartenders, a pool table, and a good variety of people that are usually in a good mood. One of the reasons I give it top marks is their holiday decorations. They are always really creative and well done.", "author": "Cyrelle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-04-17", "description": "For all the time I spend here I might as well be on the lease. Asking me why I love the Phone Booth is like asking your soulmate why she loves you. It's just this incredibly strong feeling inside. Small as the name implies, smoky, drinks about fifty cents cheaper than most places, an excellent jukebox and central location (25th and South Van Ness) -- I don't even know if it's better than most places because to me it's the only bar in town. A recurring cast of interesting characters helps, and a different atmosphere from most Mission watering holes. Nobody comes here to get stinking drunk, just to have a great time and leer at the occasional tragic hipster who stumbles in.", "author": "Davi M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-27", "description": "There was a time when PB was S.O.P. for a Monday night but that ended when Tuesdays got to be way too shitty. There are a couple of great bartenders but then the opposite side of the spectrum is well represented too. Most evenings you will find a pool table, a great jukebox, stale popcorn and depending on what you look like, serious attitude from far to many of your fellow patrons. I should really accept that I am old and crotchety because I am so over the crowd here.  Marina pretension is based on making more money than you. Mission pretension is based on being \"hipper\" than you. Same douche, different uniform. Two stars for some pretty good memories.", "author": "Mingus R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-02", "description": "Saturday was the night of the Michael M. great hipster bar crawl of 2009. We went to Uptown. We went to the Make Out Room. We went to the Attic. We went to Pops. Only when we went to the Phone Booth did the real fun start. The music was killing it. People were dancing on chairs, dancing with the bouncers, moving their hips around the pool table. Everyone was having a good time. It was like the red room in Santa Cruz, but better. The red room of yesteryear. I love the decor. The bartenders are nice (rare in a hip dive like this, can you say pretentious?). Even when we were there after the last call the staff generally treated us with respect for the fun we were having. Overall The Phone Booth is quickly becoming my favorite dive east of Valencia (that is some fierce competition).", "author": "Michael M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-12", "description": "Strong, cheap cocktails (my vodka sunrise was only $4). The place is pretty small, but the lighting and overall ambiance is pretty nice.", "author": "Faith A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-09-21", "description": "This bar is pretty great  - until it gets more than half full. Too many hipsters with ironic tatoos, too many smokers, too many lame conversations and the average age is 24. If you are a young hipster who wants to chain smoke, binge drink and hook up with tatooed strangers who dress like bike messengers BUT ARE NOT bike messengers - then check this place out. If you are mature you probably won't like it.", "author": "Pucktart T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-03", "description": "With the sultry red lighting, Phone Booth looks a lot like a smaller version of The Attic, a Mission favorite of mine.  But the scene here is a lot fringier, right down to the Van Ness & 25th edge-of-nowhere location.  There were a few classy hipsters (myself included of course), but a lot of the patrons had taken the chain-smoking counterculture thing into the realm of sketchiness...at least that's the vibe I got.  Oddly, the jukebox blared a hell of a lot of cheesy 80's music.  I was too busy car-bombing my PBR & Jameson to determine what level of irony that amounted to.  All told, it's worth having in your Mission bar-folio, but not going to be my first destination.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-12", "description": "Ended up here already half soused with a group of friends, we migrated from an obnoxiously loud and overcrowded bar where it was impossible to move or carry on a convo.  We immediately felt better about the whole situation upon entering and being seated.  A few of us ran into old friends we hadn't seen in years, the place was dim, the music good, the queers loudmouthed and smartassed (just the way i like em!).  The bar served cheap, strong drinks, the smoking happened within.  The bathroom was reasonably clean, and i liked that it was multi-use stall/urinal/sink.  I had a fabulous convo with a random stranger in line for said potty.  Basically it was like candyland with booze!  Long lost friends and loudmouthed queers and nearly clear rum-n-cokes.  Fuckin-A Phone Booth, where have you been all my life?", "author": "RJ M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-05", "description": "So, in moving from a little diddy in the central valley just south of this city, I grew up with the idea of treasuring local dives and cherishing them as a place \"....where everybody knows your name.\"  Well I'm always glad when I came, or come, or go, to Phone Booth.  Nobody knows me there and really I've only been there a handful of times.  But, the bar absolutely is a corner home where our neighborhood can count on good music, no incredibly crowded scene of people and reasonable prices.  Oh Phone Booth--\"I like you just the way you are!\"", "author": "Nicole d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-16", "description": "pros:\n- cheap drinks\n- bartenders under charge half of the time\n- best juke box in SF\n- black cougar velvet painting\n- best mix of people\n- I FORGOT THE BARBIE CHANDELIER!!!!\n\ncons:\n- hipsters (although i can't fault anyone for being 20)\n- smoking (sorry, I had enough of smoky bars in Chicago and smelling like white trash)\n- bartenders that when you try to break into their 10 minute conversation about the band they are in, get pissy\n\nOther than the above, I love this place.\n\n(ps  to the very large drunk girl  that came up to me and slapped my boyfriend for no reason - who slaps a gay man thats not another gay? - and I knocked into the jukebox, you should have apologized to everyone in there for skipping that great song!)", "author": "J J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-27", "description": "This is my favorite neighborhood bar. I'm a bit confused as to why it is being dubbed a hipster hangout because the crowd is as diverse as the neighborhood it occupies. If you don't feel comfortable there, go somewhere else. Yes it can be crowded and yes it can be smokey, like all proper dive bars should be.  I have nothing but love for Phone Booth.", "author": "Bonnie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-24", "description": "Since I live right around the corner, I try not to wear out my welcome at The Phone Booth... but I have such a great time when I go that its getting very hard!\n\nStar 1: Strong drinks. Their beer selection is typical for a dive, [PBR, Olympia, Anchor Steam, etc] but now I opt for strictly mixed drinks because they are crafted with care and a heavy hand. For about $4.\nStar 2: Indoor smoking. Even though I'm trying to quit, its nice to not have all my friends leave to go outside when they want one. \nStar 3: It can read my mind. I swear, whenever I go to this bar, its set to the exact mood I'm in. From a pool game, after-work unwind, or catching up with a friend, it all works here.\nStar 4: Solid Jukebox. I usually have a bit of distain for jukebox bars, [music should be part of the atmosphere, not something you have to pay extra for!] but TPB has the best bar music. A hearty selection of '70's-'90's rock [read: New Order, Replacements, Mac, Bowie] plus enough new shit to appease hipsters. MGMT fans need not apply.\nStar 5: The Phone Booth really came through for me and my friends this year with a bangin' Halloween Party! Totally unexpected from this understated dive, but when I had a house full of people with no idea where to go, we were blown away by the dj's, costume contest and general debauchery of this bar's All Hallow's celebration. \n\nall in all, this is the kind of bar I would run myself, so I will continue to show it love.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-22", "description": "there are framed photos of tom jones & tom selleck above the bar, which i noticed immediately for the sake of my friend nicole, who is kind of obsessed with them both.\n\ni wrote her this haiku:\n\ntoms selleck and jones\n'cole's pants are totally wet\nshe loves the phone booth\n\nbars that inspire writings of this kind (amazing) are obviously worth drinking in.", "author": "Irene S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-13", "description": "The Booth used to be one of my favorite Mission dives untill I moved too far away to make it a regular venture.  They have a good juke box, a fun mixed crowd, a pool table and cheap man-cans of Tacate.  I subtracted 1/568th of a star for every time I have been in there when it was too crowded to get to the bar when I desperatly needed a refill.  While you're waiting to get to the bar you can enjoy a cool smoking, slow burning Camel brand filtered cigarrette because they let you smoke inside.  Now I'm in flavor country.", "author": "jason k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-11", "description": "This used to be my post-El Rio-spot when I lived in the Mission.  You can smoke in here, there's a Barbie Chandelier, and the place is so damn dark that you can't tell if you're talking to your friend or some random stranger.  But who cares.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-07", "description": "This place is the best.  We ended up here after a full day at the beach and what a way to cap the day off, but to have a couple of drinks at the bar.  Liz  and Robert give good pour.  The jukebox is pretty fracking good- little bit of some new stuff (mika) and some oldies (dusty).  It's nice to see people dancing their asses off at 7pm to Michael Jackson. It's the perfect little neighborhood bar.", "author": "Valarie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-06", "description": "This is such a little  local jewel, a great juke box agin just a sliver but just like the name suggests it dares to pack everyone in. And like any great dive bar there is always a clever mix of hipster and old kook. There is pool and a popcorn machine but what really strikes my fancy is the long bench and adjoing chairs and tables allowing to make friends or hold a pack of friends as stated it is a smoking speakeasy at night which can be a blessing on those chilly nights. The drink specials always invite cheap drunken times. Take your out of towners they'll love it.  Did I mention the dark red moody bordello atmosphere with heavy drizzle of kitch? well I did now.", "author": "crystal j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-05", "description": "3 draft Pabsts for $6 (seems like the minimum unit), 1/2 block from my house and possibly the hottest bartender chick in the history of the free world... a great great bar if it's not too smoky.  Go on a weeknight, otherwise you can't breathe.  \"Jolene\" more than likely on the jukebox on any given entrance.  Why is dolly parton hip now?  There's a limit to the irony of \"9-to-5\"...", "author": "Scott C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-15", "description": "Dragged here after a night of drinking and a burrito at el farolito. Drinking again so soon after the greasy burrito was probably not the best idea. Should've digested a bit first. But drink I did. And holy crap, their drinks are strong. Jack and coke? 80% jack, 20% coke. Vodka tonic? 80% vodka, 20% tonic. Might as well have just taken shots. And you can smoke inside. Cool.", "author": "The Sock S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-01", "description": "THREE friends have recommended Phone Booth \"because Matt Roberts drinks there.\"  What is this guy, Collin Farrell? More like Collin Quinn! HAHAHAHAHAHAHAAA!  Anyway, sure, it's a hip bar and sure, it's crowded.  But it's suprisingly unassuming (for its coolness) and negotiable (as far as ease of movement).  I always have a good time here and it's the Mission bar I lobby for when everyone's dragging their thrift store Adidases.", "author": "J P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-22", "description": "smoking still flies in this bar.  if you are a smoker, wooho!  If you don't smoke, well, your clothes are going to need to be dry cleaned.   Great on weekdays when its not busy.  Weekends bring with it a much younger hipster clientele that can't real fit into the small space", "author": "BeeryMcGymrat X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-04", "description": "This place rocks- it reminds me of \"boat\" in Brooklyn.  It has a kick-ass jukebox and a great ambiance.  The pool table is usually open.  The owner is really friendly and the prices are reasonable.", "author": "Damien S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-05", "description": "This is my favorite bar to go to in the city. They have great music, and the wonderful combo of cheap yet strong drinks. My kinda place. I don't even mind that its cash only.", "author": "Kendra P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-06", "description": "I don't know about this place.  I mean, it would appear to have the strappings of a place I would dig.  It really does have a good jukebox, and the jameson and fresh ginger is bomb.  They make a mean hot toddy too.  Plus you can smoke, which is always a nice addition as far as I'm concerned.  It's just....it's always too crowded with people who are trying too hard be cool.  I mean, it's a dive bar, not a fashion show.  That's just me though.  I'm not saying I wouldn't go back...I just wish the clientele weren't trying so hard.", "author": "Coco D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-21", "description": "After standing in line  at another venue, for almost two hours to get into a show, only to have the door guy say that the bar has met it's capacity at the person in front of me and my friends, needless to say, we needed a drink - fast.\nWe trucked it back out to the Mission where one of my friends lives and decided to pop into the Phone Booth to throw down a few.\nI ordered my usual Kettle and Cran, the husband got his usual whiskey sour, and our two friends ordered their usual Kettle and Tonic with a splash of Grapefruit juice (yeah - weird, I know!)\nSo, I watched as the bartender makes our drinks. In amazement, I see him literally pour almost half the bottle Kettle in our 3 vodka drinks. Then I saw him put a \"splash\" of cranberry in my glass, a splash of tonic and maybe a drop of grapefruit juice in the other two glasses. (I love this bar already!) Usually, I need to ask for a \"splash of cran\" in my usual and it's only really for the \"color\". But I didn't need to do that here. After a couple of these, I am feeling aaaaalllllrrrriiiiggggghhhhtttttt. The people at the bar were cool, drinks were good, and I seriously think we had a better time at the Phone Booth than if we made it in to see that show.", "author": "Jan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-08", "description": "i haven't written about this place yet?\ni have always stumbled home from this place, and sometimes it wasn't even my home. ummm...i mean... strong drinks! it gets rather crowded at times and i have been hit in the face with a pool cue here. accidentally, of course. luckily i was drunk, so it didn't hurt. they have deerhoof in the juke box.", "author": "Oleya P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-24", "description": "love this shit.  seriously awesome.  xo bitch-es", "author": "Pammy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-26", "description": "You leave smelling like a pair of gym socks. It's kind of a shit hole. It's always packed with hipsters, good looking ladies, and plenty of people who get in photos with you and your friends, so the next day you go \"who the fuck was that guy\"  I love the place.", "author": "F B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-05-08", "description": "Me and my friend call it \"The Haircut Bar\".  It's pretty fun to go there and make fun of all the 80's revivalist haircuts and fake track bikes outside.  Hopefully you're trashed and ready to bounce before the novelty wears off.", "author": "SC .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-04", "description": "Another wonderful neighborhood dive and one I always bring out-of-towners too, usually after I've picked then up @ the airport.  Within' stumbling distance, usually a funky, socially adept crowd with whom a conversation with strangers over which Darren (from Bewitched) is better, and a dismally swank, yet perfect dcor makes this a fave.  2 caveats- Please get a short cue-stick for the pooltable AND...the occasional appearance of \"stinky-tranny\" can damper an otherwise good time.", "author": "Afab M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-02", "description": "I started going to the Phone Booth three years ago, largely because I had a major crush on one of the bartenders. fortunately, i quickly realized that the bar had more to offer than a cute hipster bartender. first, there were many other cute hipster boys (and girls, for those of you who go for that sort of thing). second, the jukebox is great. third, the drinks are ass-cheap, especially if you can find someone to split the jack and PBR special with you. it's my favorite bar, hands down, and i'm still going despite the fact that the cute bartender grew out his hair and became far less cute.", "author": "Casey P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-06-15", "description": "fantastic jukebox, and the bar has creative drinks (i.e.,jameson and ginger juice) and classics.  hipster, laid-back and always a nice place to chillax and catch up with friends.\n\nupdate: used to love this place, but these days it is a CLOUD OF CIGARETTE SMOKE.", "author": "Sid D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-07", "description": "A pool table, a jukebox with Xcellent options, fun bartenders (some), chill people, Xcellent cocktails, and a two blocks from home (and 24th street BART).  Truly a dive bar.  Their margaritas are very well made and have a popular ginger version.  plus, me can smoke.  Check out their barbie chandalier.", "author": "Adrian N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-29", "description": "I have a soft-spot in my heart (and probably in my gut) for the Phone Booth. The first time I went there, the power was out. No obnoxious music, no flashing lights - just friends, candles, and booze (strongest drinks in SF, period). Fantastic. More recent visits have meant some away time for the Phone Booth and I.", "author": "Blaine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-06", "description": "This is sort of the perfect bar for alcoholics.\nYou can drink here instead of drinking alone.\n\nTends to cater to lushes and theres always a group of gay companions.\nThe popcorn is always a favorite.\nThe liquor is relatively cheap.", "author": "Henry C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-25", "description": "I spent about 4 nights here this past May. I am giving The Phonebooth 4 stars because it's definitely a go-with-friends place. Unfortunately if you're flying solo, I don't think this is the place to be. Additionally, you can smoke in the bar, which is fine with me, and I did- without realizing that I would smell absolutely like an ashtray and have to wash my hoodie twice to get the scent out. So just prepare yourself for those 2 things, and The Phonebooth will rock it for you.\n\nOn the upside, the drinks are fabulously huge and strong, and cheap! Pace yourself, because if you're usually a 3 or 4 drink type, you might want to have a little bit less and see how it's going. I don't know how they do it, but these are some stiff stiff drinks for a low low price, don't be fooled. The jukebox was great, the bartender was friendly, and the dim lighting only makes drunk goggles work even better.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-18", "description": "YAY for whiskey with fresh ginger!! But be sure to specify 'fresh' because they also make the regular whiskey with ginger (as in ginger ale) here. Which, you know, is good and all but you can get that anywhere. Live it up! Go for the real stuff!", "author": "Angi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-30", "description": "so its my first day of third grade.\n \n---my 3rd grade teacher-- \"if anyone knows the answer to this(complicated) math question i will let you all go 5 minutes early for recess?\"\n\n---in my mind-- \"i do its (some number, which i actually don't know)\"\n\n--my classmates in my imagination-- \"yaaaaaaaaay... jeff rules\" (as they carry me out on their shoulders, a hero.....a hero for all 3rd graders and the center of attention)\n\n\n\nflash forward 19 years\n\n--some guy at the bar (phone booth) -- \"SOMEONE PLAY SOME TUNES\" (slight lisp and drunkenly said)\n\n--me in my imagination-- \"i got it\" as i throw a quarter in the general direction of the jukebox. it lands in the slot and i pick the perfect song. some song that everyone was waiting to hear\n\n--my barmates in my imagination-- yaaaaaaaaaaaay jeff rules (somehow they know my name, and proceed to carry me out on their shoulders, singing and cheering for me.......a hero.......a hero for bar-people)\n\n\ngod I'm 27 and nothing has changed. \nand where are the people carrying me out on their shoulders?\nand where are we going on their shoulders?\nwhy are all my imagined situations the same. \nill tell you one thing. \nnext time someone does something sh older carrying worthy. they are getting a ride...........from me..........on my shoulders..........somewhere...\nyaaaaaaaaaay jeff rules.\n\n\num as for the phone booth... ..... not sure yet. ....... lots of mustaches here.........( i mean don't get me wrong, i watched magnum PI marathons, and i consider Thomas magnum a far superior police/private investigator to TJ hooker or Remington Steele,  but the mustaches don't look good on you guys........only magnum. don't make him mad. you see what he did to Higgins (made him his bitch)) anyways......to be continued cause i've only been there once.", "author": "jeff e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-13", "description": "Wow it has been a long time since I've been to this place. It defenitely gets 5 stars from me if it's still the same. I remember it had a bitchin' juke box and really cheap beer. The best part was that I was able to smoke inside!!!! Oh, how I miss this place. I wish they could've moved with me.", "author": "Paul P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-05", "description": "Such a cozy little spot, it's like the Uptown, but smaller. I like when no smoking is happening, that's just me.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-04", "description": "Definitely chill, definitely found the $6 pbr and a shot of jack deal to be enticing, but also a horrible idea. Definitely dark in there. Definitely hard to find if you don't have directions. But nothing really definite about this place.", "author": "Ian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-29", "description": "I really like this bar.  Its really laid-back and relaxed.  But be warned it is rather small and can get crowded.  I think I loved it mostly cause you could smoke inside.  Now that I don't smoke, having my clothes and hair reek of it is no longer appealing.  Nice drinks and a nice crowd.  Everytime I go there I make new friends.  Oh and there is a jukebox with a decent mix of music.  If I recall correctly I frequently played Michael Jackson and The Gorillaz.  But who knows, I was drunk and the music could have been in my head.", "author": "Isi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-30", "description": "Saturdays at this place are the best. The bartenders are super on it and hilarious. The drinks are perfect. Popcorn and smoking?Wow. The music is eclectic..what can I say, Sold!", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-14", "description": "i like to smoke and drink so this place is great. \nits dirty and like most dive bars smells like vomit and pee. \nbut i love me a good dive bar.", "author": "Morgan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "dive extravaganza. jukebox bliss, barbie light fixture, velvet wall coverings, even a lone spider spinning it's web over the toilet seat. does a bar get any better? it's a good place to drown ur worries or to float ur boat. the crowd is quite eclectic too. from the old man with a fedora stroking his knit scarf to the bubbly fat chick in fishnets sucking a red lolipop. all kinds.", "author": "S. G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-24", "description": "I kind of love getting the spot in the corner, and camping out until being there seems like a good idea. There's never a shortage of good people watching opportunites. I really like that it's small, I don't really like how smoky it gets.", "author": "katharine s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-01", "description": "damn, i'm the second reviewer!!  oh well... i was just missing this place so I thought I'd write a review.  I'm thinking of visiting tonight.  anyway, used to hang out here all the time with a good friend of mine (unfortunately she moved away  :(   )... chill, neighborhood type bar.  not too sceney if you go early...  good jukebox, stiff drinks and nice & dark.  just how i like it...  and right around the corner from la taqueria, my all-time favorite burrito joint!!", "author": "Yvette H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-02", "description": "I went to this bar in the Mission district at the behest of a friend, and was really pleasantly surprised.  The place looks super dive-y from the front.  Well, it is pretty dive-y inside too, but I stopped caring after I had a special drink that the bartender had invented, some pommegranate sake concoction served in a martini glass.  The martini and vodka collins I had subsequently were also ace, mixed strong and well.  The place boasts an amazing jukebox.  Also, they allow pets (not an issue for me, but I found it cute).", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-21", "description": "The only problem is that they allow people to smoke in the bar, for non smokers this can be a problem. Your clothes will smell like an ash tray when you leave the place, to be honest this is the first place I've been in Ca where people can smoke inside, out in patios yes but not indoors.", "author": "Mauro B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-29", "description": "The Phone Booth is a great dive. It's a neighborhood bar for me and I love coming here to run into friends and listen to the jukebox. The bartenders are great and they make really stiff drinks!! You can smoke inside, which is a plus or a minus but I always make cool new friends here. The Phone Booth is a good place to have random interesting conversations and to wonder if the bartenders are gay or straight.....that's how you know if you have a good bartender on your hands, if you can't tell if  they are gay or straight.", "author": "Natalie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-12", "description": "Actually it was ok the few times I've been here, plus you can smoke inside, which is kinda gross but whatever. I'm a social smoker so it works for me, but only if I'm kinda drunk as well (I'm just not used to smoking inside anymore, it weirds me out). It's been crowded all the times I've been here and it was hard to get a drink. But overall, not bad and the crowd is pretty fun and neighborhoody.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-01", "description": "I like it here. But don't go here if you don't want to smell like smoke all night, that's my only complaint, and the jukebox that skips... and the weird bathrooms that the people playing pool can see into..but I mean other than that. yes.", "author": "Constance C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-25", "description": "this is where TOPHER O'NASSIS was born!\n\nsmall, super hipster, cheap drinks, they let you smoke inside...and...PBR!!!!\n\nsometimes, the klassy van is right outside.", "author": "Ameigh F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-30", "description": "A good neighborhood spot in which non-regulars are accepted if they are friendly. Cheap strong drinks. Pool table. Good juke box. Smoking allowed inside (at night at least). Pretty friendly clientele and bartenders. It's the kind of place where you start chatting with the strangers sitting next to you.", "author": "Tim K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-02", "description": "i didn't think this was a hipster bar at all (does that mean i'm a jaded super hipster?). it was packed and on the night we went there seemed to be two separate scenes going on inside it.  it seemed more of a ladies'-for-ladies pick-up joint to me.  my friend and i were getting cruised hardcore by different groups of women, but that was towards the back of the bar, the front was more hetero.\n\ni liked it, our beers were $5 for two pints of stella and that's enough to make a girl weep. \n\ni'd like to check it out when it is less crowded.", "author": "ms.kiki g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-20", "description": "I feel a grudging love for this place.  Its kind of like an extension of my living room.  I feel no pressure to be friendly, impress anyone, or even have fun.  but I do, have fun at least, except when I forget that i'm not in my living room and get yelled at for lighting up something other than cigarrettes.  Whatever.", "author": "Emilia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-11", "description": "Cheap, popcorn, and lots of lesbians with tatoos I'm afraid to compliment.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-26", "description": "Good neighborhood bar for happy hour, but becomes less bearable as the nigh wears on.  Really good bartenders offering great pours and draft beers filled to the rim.  I guess I'm getting old or it's been too long since I quit (or both), but I have a hard time dealing with the smoke these days. I used to smoke in here and loved that you could, so it's all relative. Something for everyone on the jukebox", "author": "Jen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-20", "description": "It's inexpensive, friendly, and has a great jukebox.  This is my go-to spot for drinks with friends.  I even went there last night.  I think I went there last weekend, too.  Damn, I go there a lot.", "author": "Chadwick W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-31", "description": "Appropriately named because it's very small.  However, there's a pool table, free popcorn machine, and cheap, strong drinks.  Surprisingly enough, a place this small actually has both a men's and women's bathroom; why they have see through glass on the doors, I don't know, but at least the stalls are private!  Overall, a great neighborhood bar in the Outer Mission.", "author": "Rick E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-17", "description": "One of my favorite bars in the neighborhood. It's just real comfortable. Good jukebox. Good clientele. Nice bartenders. Perfect.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-02", "description": "Very chill neighborhood spot. Friendly bartenders, generous pours, no pretension. One star for the chandelier alone, which is made with contorted plastic (barbie?) dolls. Only one star gone b/c you can smoke.", "author": "SL N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-27", "description": "the phonebooth is MY bar! granted, i've lived on the same block as it for the past year and a half. really though, the booth was the first bar in san francisco i started going to on a regular basis. this place has so many amazing memories for me! i cant imagine never going in there (really! i'd go through withdrawals!). every time i'm there its a fucking party with good friends, cool bartenders, awesome music, and stiff drinks. honestly, what else can you for?\n\n\nbest part is? i can get obliterated and its only half a block home!", "author": "Jaei P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-07", "description": "Awesome jukebox, dive-y  with the double c's (casual and cool) atmosphere plus stiff drinks, full of locals and the bar tenders know how to make one of my favorite elixirs, captain morgan's w/ pineapple juice....shaken so it's nice and frothe......mornin'!!!!", "author": "erica u."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-11", "description": "This is for the best jukebox in sf...at least so far.  fresh ginger drinks that make the mwind grow dim pickens.  2 dollar tecates.  also, you can play pool and the people who play are usually worse, so you can play for hours. sorry people who read this that a dude beat. also,  great bartenders.  a little too crowded for a maing on the weekends, but just far enough away from the main drag to be relaxing most times.", "author": "chreesh b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-01", "description": "yay for smoking in the bar. yay for a good jukebox. i put on 3 songs and i think everyone in the bar was enjoying them -- which is a good sign. drank a few anchor steams, had a few bogies, watched some pool. the bathrooms are a little weird, but whatever. overall, probably my favorite dive of the weekend.", "author": "Joanne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-02", "description": "dear phonebooth,\nyou never ever let me down! cheap delicious drinks that get me plastered every time (awesome bloody marys), i often bump into random friends from my past, but even if i don't, i never fail to make new friends. everyone, is nice, interactive, drunk. free popcorn, at least one of the same bartenders since i moved to sf around 2002, some things in the mission keep changing but i'm glad i can always come here at the end of my night and stumble out nearly nauseous!", "author": "celiac j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-02", "description": "A friend introduced my hubby and I to this bar when we were housesitting in Bernal Heights. I wish we had something like this in Berkeley (ha ha!) I would love it to be my neighborhood bar. Affordable drinks, friendly bartender, diverse crowd, I don't feel like it was overrun with hipsters at all - in fact that was a big part of the appeal... looking forward to going back!", "author": "Julia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-24", "description": "Gotta love everything about this local dive bar except the smoking.... is what it is I guess.  Sometimes feel a little like I'm hopping in the water at fort point with a \"heh is this a cool spot to surf\" look on my face with the overly local feel, but great nonetheless.", "author": "Willy c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-08", "description": "jukebox bliss, barbie light fixture, velvet wall coverings, even a lone spider spinning it's web over the toilet seat. does a bar get any better? it's a good place to drown ur worries or to float ur boat. the crowd is quite eclectic too. from the old man with a fedora stroking his knit scarf to the bubbly fat chick in fishnets sucking a red lolipop. all kinds.", "author": "ray c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-02", "description": "Hipsters or not, these were some of the most friendly folk I've ever met at a bar, not counting Memphis in Santa Ana down south. My fear of being snubbed by pretentious regulars quickly disappeared after a cheery response from a pool table user. Everyone we ran into, literally and figuratively, was sincerely nice and interesting and, well, just chill; in fact, they were completely the opposite of pretentious. Perhaps the most snubbing seemed to have come from the bartenders, but I just blew it off as being busy and having to work New Year's Eve. Free champagne at midnight, cheap drinks--$17.50 for three, good long island iced teas. Maybe too good. Really too good. I felt very comfortable shoved in a little corner of the phone booth, playing partners pool all night with fantastic people we had just met. It's a bummer the BART stops running so early, it means next time I go I'll have to be outta there by midnight.", "author": "Kimberly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-07", "description": "phonebooth. i always thought of you as my neighborhood bar, i'm sorry that i didn't put in the effort to make our relationship come to fruition. now that i am moving to the east bay, i can only express my feelings through the lyrics of james blunt: \n\nGoodbye my lover.\nGoodbye my friend.\nYou have been the one.\nYou have been the one for me.", "author": "Erica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-09", "description": "if you like to dress up like you're straight out of napoleon dynamite, then throw your smoky clothes straight into the laundry basket when you get home, this bar is for you!  other than that it is actually pretty cool.", "author": "Alfredo I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-09", "description": "all my greatest friends love it here and it seems most yelpers do too.  i just can't bring myself to feel the same way and always get bummed when my group announces we'll be meeting here.  i think it's mostly that i don't smoke and end up inhaling about five cigarettes anyhow just being in the joint for a drink or two... and my clothes & hair will reek of smoke for the rest of the barhopping night. also it's almost always shoulder to shoulder with one bartender who can't hear your order over the yelling bar talk and music.     yeah the drinks are cheap and strong, fellow drinkers who smoke are happy as clams, and there's a fun mix of regulars but i just can't hang.", "author": "E M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-15", "description": "hipster hell , way too crowded, but the bloody marys there are worth their weight in gold", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-04-29", "description": "What can I say, every time I go to phone booth I swear I will never go back. The place is OK until about 8pm when it gets super crowded and smoky. One thing I can say is that the drinks are strong and reasonably priced. But still its not worth it. The environment is hideous. The smoke is the worst part (sorry, cigarettes are foul when smoked in small enclosed areas). The bar itself is dingy. most of the people (uber hipsters)  stand around the pool table and play all night. Everyone else takes up the rest of the small bar, which inevitably is overfilled. The topics of conversation are .... well lets put it this way last time I was there I heard walmart mentioned three times. Once by a Humboldt native who now works as a techie in walmart's corporate office, once by a hipster who \"just doesn't care what people say\" walmart is her favorite store and and once by a tattooed messenger looking guy who was really excited that he was going to walmart with his friend the next day. Yeah, I don't think I really need to say more. I understand the appeal of this bar (and yes I go there every few months for an hour until I remember how much I hate it and swear I will never  return). I think it is just one of those places you either love or hate.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-07", "description": "what can I say, I love this place yes it's a bit of a bummer being a non-smoker now, but the drinks are strong and cheap the music is usually good (depending on the people who put 10spots in the juke box) and the fact that it is still a neighborhood bar is nice-", "author": "A. Gun n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-30", "description": "if you like cigarettes (but i don't smoke) and margaritas (but i don't drink tequila), come here.", "author": "Lita F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-30", "description": "After a lengthy, sweaty, 30 minute walk \"over the river and through\" the mothereffing woods from Hayes Valley, at least that's what it seemed like, my buddy and I finally roll into this place to meet up with an old friend.  All I wanted to do was sit the hell down, slide some suds down my throat and relax.  I accomplished approximately 1.5 of those goals.\n\nMy friend and her companion had a hook-up there with the bartenders, so we were stoked out on drinks all night and the service was top notch.  I can't complain on those two aspects, but then again it's tough to critique price and service when you've got a sly deal with the staff.  Unfortunately, they were fresh out of seats, so I got to stand all night long, which led to an annoyance which I hit on later.\n\nThe decor was a bit odd, although I was diggin' it.  If my memory serves me right, and often it doesn't (just a disclaimer), one of the main walls was red, and was adorned with Spanish-style bull fighting pictures.  As I ran my eyes past that wall, over to the pool table, and then back across the bar to the middle of the room where we were standing, my eyes stopped on a chandelier.  At first, I wasn't quite sure why I was even giving it more than a glance, but then I realized there were multi-racial barbies connecting the outer bulbs to the inner part of the fixture.  Uh-huh, yep, a barbie chandelier.  Just chillin', like it was a perfectly normal lighting fixture in any bar.  I don't know about you, Mr. and Mrs. Yelper, but I like when bars aren't afraid to throw random shit in their establishment.  It adds to the flavor and makes the place that much more of a trip as you start to get your drink on.  So there's that.\n\nAs for the crowd, it was quite the mix, which was nice.  Made for a fairly friendly atmosphere, because no group really had the upper hand numbers-wise.  The only thing that really pissed me off, was that the place ain't that big, and it was full of people (bad mix), so I was constantly, and I mean like 5-times-a-minute, getting bumped as people walked by.  There were no bad vibes or ill intentions, just passers by, but damn, that's a lot of spilled beer.  Luckily for me, mine was on the cheap.\n\nOverall, not a bad bar to hit up.  It certainly doesn't get me all warm and fuzzy just thinking about it, but it serves pretty well for a dive.  My only advice is to get there early enough to get a seat.  Otherwise you're in for an expensive evening.", "author": "Travis F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-12", "description": "I always wondered why people liked this bar when I passed it.  After finally venturing in, now I see why.  The perfect mix of low lighting, cheap drinks, and no frills--exactly what I like in a bar.  And for peeping toms, there are two windowed doors looking straight into the girls bathroom...", "author": "Emma H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-04", "description": "my kind of place. dark. rock juke. pool table. cold cold stella drafts. it was all a blur. fantastic.", "author": "r b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-24", "description": "the phone booth rules because they have cheap strong drinks and they're really close to my house.  minus one star for awkward bathroom situation and for allowing smoking inside.  thanks for the extra cherries!", "author": "Charly G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-16", "description": "PBR on tap, Jim beam rye, a fucked up mix on the juke box (that's a good thing) old regulars by day, little hipsters by night, cool bar tenders.", "author": "elliot a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-28", "description": "If you ever have to send a dear friend to rehab, go here to unwind from the drama.  I did and it was fantastic.", "author": "pauline e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-09", "description": "yes, it's too smokey, which makes you feel gross the next day, even if you're a smoker. yes, the crowd has gotten so young that you begin to wonder whether you're the only one present with a valid i.d. but this is four stars just for the memories. because when i first moved here --- in the mid-90s, in my early 20s --- san francisco was feeling a bit dreary. the dot com thing was making yuppies out of 21-year-olds, the coolest kids were oversaturated in retro 60s culture, and i can't recall a single place where gays and straights hung out together and made out together and made memories together. maybe the 500 club? it seems like a stretch compared with what the phone booth was to become: The place to be, a place you squeezed into sloshy and dirty, knowing you'd leave in some sort of trouble. that was a couple years back now, and it's just become a neighborhood bar to me now, with a bit of melancholy attached --- considering what the place once represented. phone booth = friendster era. still, cheers to the fact that it exists. the owner is a sweetheart. and, hey, i think it's kind of fun to wonder whether the scruffy guy with the cheeky grin is gay or not, and to be truly unsure either way. he could be, after that next beer.", "author": "jeremy l."}
