{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "I'm from out of town, and my father I were exploring the restaurants near the hospital. At first we were thinking about going to a Indian food restaurant across the street from Phuket Thai, but it was more of a socializing place with small portions for food that only did breakfast foods. So we ended up deciding to go to Phuket Thai. \n\nThe inside was very pleasant, and elegant. So many choices for food, good size food portions, the food was Very tasty, the service was very kind, and the prices were fairly cheap for San Francisco. I would HIGHLY RECOMMEND this place to anyone who enjoys Thai Food! \n\nNOTE!\nIt may not have a lot of room to park, but if you can get around that IT's DEFINITELY WORTH IT!", "author": "Casey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "This place is right down the street from my work so I order from here pretty often.  I've ordered the same thing all the time which is their beef pad see ew!!  Decent proportion of meet with crunchy broccoli, not too salty or oily just right. Their ginger chicken is already really good too, but I always find myself coming back for those noodles.  The owner is really nice too! I had to order for a catering event during their afternoon closing hours and he was able to still make it during then. Very accommodating.", "author": "KB B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "I really enjoy the pad see ew. This place is very homey. The lunch prices are very fair. As a native to SF they have been in the Haight on the corner of Divis. for many years. Wish I would have stopped by sooner.  The spot to go when you crave authentic thai! Great pricepoint!", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-11", "description": "Great food, friendly staff. They feed you like family. Not difficult to get a table here. The Aquarium helps it give a nice, homey feel.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Incredible service and delicious food! Highly recommend the pad see ew and Thai tea washed down with the delectably spicy coconut curry. Always a great place to pop in for a quick bite.", "author": "Lacey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "I tried this restaurant for the first time a few weeks ago. They were the only place still open and though I had always been reticent to try them (I'd been judging them by how it looks from the outside), I was pleasantly surprised! Great dishes with delicious flavors! Good price points. Nice service. And the decor on the inside is quite clean and pretty. I've been back several times since.", "author": "Storm A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-16", "description": "1. Food: We ordered takeout from here- beef fried rice, larb salad and tom yum. All the items didn't taste very Thai in that they lacked flavor. The beef fried rice was decent (we had asked them to remove tomatoes and they did that), they also added a good amount of chilly in the larb to make it spicy as requested. The reason for this review though, was the tom yum.\nI had a few sips and felt very ill with a bad aftertaste in my mouth, despite the fact that it had very little flavor. \n\nLooking at the other reviews for this place I'm sure it has some good dishes but there are definitely things to avoid on the menu- which isn't generally what I'd want to do when I order from a restaurant. \n\n2. Delivery: The delivery time pretty swift for how far they delivered and the lady that delivered was nice.\n \n3. Buck value: I definitely ordered from here because it seemed like a good cheap Thai place- which is pretty rare in the city but I don't think it met any other expectations besides that it was a cheap meal.", "author": "Spriha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "This place is definitely underrated and deserves more than a 3-star average. I ordered green chicken curry and brown rice from here for pick up, and it was tasty and cheap with good portions. I haven't tried any other dishes yet but would recommend the curry. The staff was very friendly on the phone and in person.", "author": "Erika G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-13", "description": "How is Phuket Thai still here? I don't know, but I'm thankful they are. Nothing fancy, just a low-key place to get a yummy Thai meal without breaking the bank. That's all there is to know!", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-03", "description": "You have to try their coconut ice cream!  I'm not a ice cream lover, but this coconut ice cream can't let me stop eating it \n\nGreen curry is so spicy! We ask whether it's spicy, and the server say it's not spicy at all to her. BUT it's soooo spicy !!!\n\nOverall it's great", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "I've lived nearby for 2 years and never stopped by this place because of the reviews and general uninviting exterior, which I now regret, because it's a totally fine restaurant and doesn't deserve the 3-star average.\n\nWe were seated & served quickly. Food wasn't super authentic or innovative, but it's tasty, well-spiced, and the vegetables were wonderfully crisp and fresh and the meat tender. It's also a great value - dishes generally range $8-11 and are well-proportioned for an average person. Also, the wine is real cheap - $7 for a 1/2 carafe that got me + a friend nicely tipsy.\n\nI wouldn't go out of my way to visit this place, but if you're in the area and hungry and definitely if you live nearby and need a reliable go-to thai place, this one is a winner. I'll be back!", "author": "Liz R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-09", "description": "Super cute hole in the wall type place. It was a little hard to find because I was expecting a big fancy building/sign which it doesn't have. Pretty cheap, but the food is alright. Not sure if I'd check it out again, to be honest. The tom kha was disappointing, but the pad thai was alright. Kind of an average place overall.", "author": "Priyanka P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-05", "description": "Solid. Cheap beers and good food. The jasmine rice was overly sticky... a weird consistency. The main course was good though.", "author": "Alonzo B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-09", "description": "I just wanted Thai food and seeing that this was nearby and the prices weren't too shabby, I thought why not give them a shot. \n\nComing in, the place wasn't too busy at all so I expected speedy service, and it was just that. \n\nAs for the food, it didn't taste very Thai to me. I ordered the Calamari appetizer and that was probably the saltiest thing I've had in a while. My lips felt chapped afterwards which was pretty surprising and I had to get a bowl of rice in order to finish the squid. I also ordered their \"Pud Thai\" (Pad Thai; you'll see what I mean if you go there) and it didn't taste like any Pad Thai that I've had.\n\nIt didn't even taste Thai, once again. I'm south East Asian, so I'm honestly quite familiar with the taste. The noodles are normal rice noodles, not skinny flat, and the taste of the plate in general was like a tangy barbecue sauce, replicating something more of Chinese noodles masked with loads of lime.\n\nIf you're not in a hurry and you just want some quick food for kinda cheap, I wouldn't recommend to come here but give them a try. They're shabby, but not too shabby.", "author": "Millie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "I love this place. I recommend bringing a bunch of friends and ordering several entrees and doing it family style", "author": "Sam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "Love the food, but could've been more enjoyable had the restaurant been heated. Yikes! I had to wear my jacket and scarf throughout the whole dinner. I will be back but with a down jacket. Lol. Food was reasonably priced but I would pay two dollars more for my meal for some warmth.", "author": "Lance A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "This is hands down the best green curry in the city! I've been searching for a green curry that reminds me of Thailand and this place comes closer than any I've tried in the city.  Very authentic!  Their other dishes aren't bad either, but the green curry is the reason we keep coming back!  \n\nIt's a great place for takeout and they also deliver (singha beer too)!  If you're looking for a dish to push your delivery order over the minimum order size try the fried tofu with spicy peanut sauce.  Yummy!", "author": "R C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "I never even post on Yelp but found it necessary because I think this restaurant is highly underrated. While I only get take out here, it has always been excellent. The food is fresh and delicious and I never have to wait long. Phuket is solid for take out.", "author": "Graham G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-14", "description": "When Eat24 says 45-60 minutes to deliver. BELI-IT !! I live like .5 miles away and it took exactly 60 minutes to deliver on a Monday night. \n\nDelivery lady was adorable, I wanted to put her in my pocket... but there are probably laws against that. \n\nHere's what I ordered and what I thought. \nPud Thai - its just ok. Too much Tofu, 1 shrimp, literally - that's it.  Tofu is literally tasteless. Noodles and the 1 shrimp had OK flavor. I had to heat up when I got it, its ok if you are starving.\n\nPo Piah Tod - was soggy and cold when it showed up. I put it in the broiler for 5 minutes to crisp it up. After that, Excellent flavor. I would order it again, knowing I will have to re-heat it up a bit when it shows up. \n\nKaeng Ka Ree Kai - was Really great. Excellent Flavor and Hot when it arrived. I Would order it again Fo Sho.", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "Nice and very clean restaurant. I ordered their kee mao with beef and shrimp. My fiance son ordered the same. It was very good. I especially like their papaya which came with shrimp and little bit of crunchy calamari. Their price is very affordable. We got to meet the owner and she made us feel very much at home. Wonderful woman and best host.", "author": "Samantha P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "I'm sorry to say that it's just decent cheap food really. There's nothing noteworthy about it, except for the fact you'll spend less and get nearly as good as anyone else in the area. The service is nice. I'm giving 4 stars because it's a 1 dollar sign place that doesn't suck. So it's relative. \n\nWhat I think is a really great tip to share is that their party trays are such an incredible deal if you've got a lot of people to feed. I couldn't believe the amount of food I got for $100. It felt like 20 lbs. We had leftovers for days. There was no other way I could find to feed that many people for that little money and this was more fun than pizza. For you and a bunch of friends over casually, or a work event, this is a great place to try for their bulk order party trays.", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "We live just up the street from this place and my girlfriend and I love it. We're regulars now, but even before becoming regulars the staff was so incredibly nice- definitely concerned with quality service and creating a friendly and cozy neighborhood spot to be enjoyed by all! I will say, gauging by some of the other Thai places I've tried in the city, this place is nothing fancy, so please adjust your expectations.", "author": "Yasmeen G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-08", "description": "Yea so this place is nice and cheap. But the pad see ew was fettuccine noodles. Y u do dis?? And chicken was chewy and ugh.", "author": "B H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "Very good food . Good value for the cost. Never crowded. Great for take out. Clean and good service.", "author": "Richard H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-30", "description": "This place is great. Great food. I love the shrimp that are wrapped up in a crunchy shell. I also love the BBQ chicken. This place seems to be doing well even though there are not a lot of people here on any given day. I would come back here if I were in the area.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "Cheap, and as spicy as you want it. Food is fantastic, definitely my favorite Thai restaurant in SF.", "author": "Francis R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "I've only eaten here twice so far but I'm confused about the bad ratings.. Both times I had really yummy food and it's reasonably priced. I get the pad see ew (spicy) and Tom yum soup. + the servers have always been really sweet.", "author": "Tessa C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-12", "description": "Okay, we ended up here on a Saturday night around 9. The restaurant was completely empty. I am always scared to go into empty restaurants, but my friend had eaten there before, so we went inside. \n\nThe prices are relatively inexpensive. Entrees do not include rice though and will set you back 2 extra bucks. I had the pad thai which was a ton of noodles and a few pieces of tofu and a couple shrimps. I was especially scared to eat shrimp from suspect restaurants, but thankfully everything went okay. The pad thai tasted particularly American. Ketchup was definitely involved in the sauce. The tom yum soup was not so yummy. It had an odd taste to it. We split a bowl and there was still some left over at the end...\n\nThe table said they were drought friendly and only served water upon request, but when we sat down the waiter brought over water for us. And they refilled glasses without asking. \n\nThere are a million Thai restaurants in San Francisco, and this one is not worth your time. The prices might be on the cheaper side, but you get what you pay for...", "author": "Jon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-18", "description": "I used to go here 15 years ago...it was the joke...\"where should we go? Aw Phuket!\". I just moved back and tried it again with great results.\n\nFour stars for delicious food and huge menu selection. Minus one for decor.  I'm not a big fan of flowers in beer bottles. Get the warm flank steak salad if you like citrus and cilantro! Also num 39 prawns with spinach and peanut sauce. Phuket!", "author": "gabriella m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-26", "description": "I should have read the Yelp reviews on this place before coming here but I'd driven past it a million times and I assumed it must be half decent since it had stayed in business in San Francisco for so long. Oh, how I was wrong.\n\nThe first bad omen was that there was a handwritten sign taped to the front door warning: \"The charge for non-customers to use the bathroom is $2.50\". (No, I am not kidding.)\n\nI walked in at 2:30pm today and the place was totally dead. A woman greeted me and immediately told me they were closing soon. (It was half an hour before closing.)\n\nI should have taken this as another clue that things weren't going to end well but I'd commuted by bus all the way over and it's hard to find a Thai restaurant open in the middle of the day in this area. \n\nI ordered the Veggie Pad Kee Mao and it was the worst Thai food I've ever eaten. (Both in the US and in Thailand.)\n\nI thought about sending it back because I really didn't want to pay the $11 and change I knew this was about to cost me but decided to go ahead and eat it. I could only eat about 1/4-1/2 of it when the waitress came back over and asked how everything was. I told her \"It's not that great...to be honest so I'll go ahead and take the check and a box.\"\n\nI think she thought that I felt rushed by her and not just that the food was bad but actually it was both.\n\nI had to ask a second time for the check and the box. At least she was polite enough to offer a \"to go\" fork. \n\nI just put the food outside for a homeless person. In fact, it's sitting on top of the trashcan right across the street from the restaurant right now if anybody's interested in a sample. :} \n\nThe only thing good about this place was the Thai iced tea. \n\nNeedless to say...I won't be back or recommend it to others.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-21", "description": "Ordered take away but got tasteless chicken, low quality chewy beef. Rice was ok.\nYuck. won't order again..", "author": "Ido K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "My friend and I eat there often.  The food is very good and the service is great.  They are happy to accommodate you.  There a many wonderful things on the menu, so we don't get tired of it.  And the prices are great.  I very much recommend it!", "author": "Ruth L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "Great food and amazing service. Everyone's very friendly and helpful. And the crispy chicken is delicious.", "author": "Austin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-24", "description": "A place will never improve unless they know they have to, so I am writing this review with the hopes that things can improve.  First off, they had a special lunch menu, but it turned out that it does not apply to weekends.  We were the only people there and something like lunch deals are supposed to draw people in so I don't know why they are the only Thai place in the area that does not offer lunch deals.\n\nWe ordered the fried calamari, which some dropped on the floor upon delivery.  They apologized, but did not really compensate us in any way.  No big deal, but it would have been a nice gesture.  The calamari itself was ok.\n\nThen came the nuer yang.  The reason I even stopped in this place because I was craving this grilled beef dish that I haven't had in years.  My best guess was the beef was microwaved.  Now I doubt that was really the case, but it was so chewy and flavorless.  There was no sear marks or browning, it was basically grey and rubbery.  They offered a replacement dish, but this was the only reason I walked through those doors.  As I said, we were the only customers there so there is no reason for them not to make a little bit of an effort to cook the food.\n\nThis was the worst food I have ever had in San Francisco, but I hope they don't blow off these reviews and put some effort back into their work.", "author": "Ian E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "Love this place.  Quiet, relaxing, great place to go by yourself or with a group, love to watch the fish in the fish tank.  \nHere's what to order:  get the green papaya salad -- it's the best I've ever had, cool and super-refreshing papaya strips with a light but tangy sauce and topped with sizzling pieces of flash-fried whitefish and sautéed prawns.  Best. Salad.  Ever.  \n\nAlso love the green curry chicken with green beans -- enough to take home and have a second meal the next night.  And the soups are uniformly delicious, esp the ones with a bit of coconut milk -- creamy and really flavorful without being too heavy.", "author": "kat m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "One of my favorite thai restaurants yet! We ordered pad Thai, yellow curry & beef skewers they were all delicious. Food was delivered quickly and cured our hanger before it got out of hand. I wish the skewers had a chicken option, but nothing is perfect...except for this rating!", "author": "Rachael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-13", "description": "I was going to give them 3 stars but bumped them up to 4 bc they took excellent care of my sons which I definitely appreciated.\n\nLunch date with my boys and my girl, Ms. Rica.\nWe phoned in our order so when we got there, food would be ready and on the table waiting for us. My friend ordered the chicken eggplant over rice which was amazing I'd have to say. Deliciously sauted eggplant and chicken. My order was not so great bc it seems the chef may have over cooked it bc it had some burnt noodles :(\nand their thai tea was sweet just like I love it.\n\nTrying to have lunch with two super hyper active kids is no joke and the owners and waitress made my experience an unforgettable one. The owners stopped my kids from running around with puzzle sets and toys to keep them entertained while I rested and had a moment to eat and catch up with my good friend and that's what I call the west coast hospitality :)\n\n*Street parking if you're lucky\n*Place is a little small but well worth it :)", "author": "Anonymous P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "I eat here often.\nThe food here is excellent and reasonably priced.\nThe setting is great for conversation.\n\nOh Don't be fooled by the critique from the wimp who fears shrimp.", "author": "Martin Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-12", "description": "This place seemed decent when it first opened in my neighborhood and I remember some good times there. Last night got some dinner to go from there for a lazy Monday night last night since we happened to be walking by and got this:\nTom Yum Goong was very bland, watery and almost tasteless, shrimps were mushy and NOT FRESH, no lemon grass or chiles in it at all, one HUGE pc of overcooked onion in mine...like they stretched it from weekend leftovers - worst I've ever had ! but starving I ate most of it. Noodle with curry powder tasted like warmed up overcooked leftovers as some of the noodles were hard and chewy, NOT FRESH; Fish was weird, not overcooked, almost gooey and more undercooked in the thicker section. You wouldn't expect this in SF... I didn't expect it at all and hate giving one star reviews...but noticed other bad recent reviews so it seems that this place has bottomed out.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "I have been there several times and I love it! The food is so good for the price. Overall value? My girlfriend and I just ate 2 entrees, rice, 1 dessert, 1 bottle of wine and a 20% tip for 42.00$. Every time I eat there it's really good and I feel I got a good deal.", "author": "Morgan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-22", "description": "My family has been ordering takeout from Phuket Thai for years and we love it! Definitely my favorite Thai place, I recommend it. The staff are all super friendly and attentive and the food is always awesome. We love the Pad Thai, fried rice, chicken skewers, and their soups. They're always quite quick, too :)", "author": "Emilie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-02", "description": "I lived in San Francisco from '89-'91 and I remember this place being here then, although never had the opportunity to dine there -- and when I returned last fall, some 20 years later, I was surprised to find that it's still there and thought, well, maybe the place is amazing since it's been around so long.\n\nNope.\n\nAdmittedly, I only had two things on the menu, but they're classic Thai food items, and did not pass the test.\n\nChicken Satay was fine -- not the best, not the worst -- although for take-out I was shocked to open the bag and discover that the satay was in an open box and were not wrapped in tin foil (as EVERY other Thai satay take-out I've had).\n\nThe real test, however: Pad Thai.  Um.  Yah.  First, they use what is akin to vermicelli noodles.  Just not used to pad thai that thin.  The tamarind sauce: meh.\n\nAlthough it's cute driving by that place and thinking about the English phonetic pronunciation of the name (as some have mentioned here), I think I'm simply going to pass it by from now on.\n\nNow, on the other hand, just continue going up on Haight, almost to the end before Stanyan, and go to Ploy II -- now THAT's great Thai food (but for a different page on Yelp).", "author": "Merrick W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-22", "description": "I have only done takeout and only order one thing-- #66, this noodle dish with chicken and shrimp and greens in pad thai type of noodles, spicy, but tosses in yellow curry powder! It's amazing and not like anything I had before, and they make it hot and spicier if you want. $12 min to use cars. Low key place that's casual and hole in the wall good Thai food!", "author": "Taz H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-03", "description": "Not as good as the Thai restaurants I normally go to. Also, quite oily. I wouldn't eat here again.", "author": "Tim M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-08", "description": "Padthai: 4-star (taste was good, but my girlfriend and I got diarrhea)\nPrice: 4-star (not bad)\nService: 3-star\nAtmosphere: 3-star\nTemperature: 4-star (not warm and cold)\nBrightness: 3-star\nTable: 3-star\nCleanness: 3-star\nBathroom: (not sure)", "author": "Yosuke K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-21", "description": "Yelp keeps telling me to review Phuket Thai. Everyday, for two years, I log on and it says \"REVIEW THIS PLACE! REVIEW IT.\"\n\nOkay Yelp. Okay.\n\nI live next door to Phuket Thai. In fact, it would be the fastest place to get a meal for me, but I always avoid it after having eaten there a few times. (You have to give it a chance, you know!)\n\nThe food is very mediocre. It's sub-standard American-Thai food. Everything seems to be bland. The restaurant is always empty. The servers are really really nice but it can't make up for the food that always leaves my stomach a little bit emptier and sadder.", "author": "Carissa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-14", "description": "Phuket is my go to Thai restaurant and luckily I live just a few blocks away! I usually come here with a small group of friends, although I have dined here alone many times too! \n\nMy group usually starts off with the satay chicken skewers and fried egg rolls for our appetizers--both very delicious. I have also tried their TOM YUM KAI a hot and sour soup which is excellent on cold days or whenever you're feeling under the weather. My favorite dishes include both the sliced chicken in green curry as well as the prawns in green curry with coconut milk-- perfect amount of spice and very flavorful. I like to pour the curry over my rice and even my pad thai and it's so so delicious.\n\nThe Thai iced coffee is also extremely delicious! I am always very pleased whenever I come here, it's pretty quiet most of the time, but that's what I like about the place. And the service is always very friendly.\n\nI recommend this place to anyone in the area!", "author": "Lisette O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-21", "description": "This place has been here forever, and this is the first time we have been. \n\nFood: We ordered a standard chicken Satay and Pad Thai. These are uncomplicated and I wanted to see how they would do. Satay was fair, a little dry accompanied with a tame/lame dipping sauce. The Pad Thai was somewhat gloppy and not very spicy. Bottom line: both dishes were not very interesting. \n\nThe weird rope lights do not add to the Thai experience, and if they are burned out, I would suggest removing. (I will have my meal with a little whine.) \n\nI think we will try again. This place has been here too long, not to have something going for it.", "author": "A I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-04", "description": "Phuket brings out the immature elementary schooler.....well actually more like middle schooler in all of us. Phonetically  - the name is a blast.\n \nBut...as a restaurant - Phuket's just decent.\n\nThey fooled me with the vegetarian headline right by their name. Once inside, I found that their vegetarian menu was pretty limited,  but that being said, I'm sure they could have whipped anything up on the menu with tofu and it would have worked - so not a huge deal.\n \nThe server was friendly and quick. I asked what he recommended on the vegetarian menu.  He pointed out a tofu peanut dish. I ordered it. \n\nWhen he brought it out, I found the dish to be pretty mediocre. It was filling and tasty, but nothing I would rave over, especially for the OK price.    \n\nPhuket Thai is pretty close, and the service great, so I could see myself picking up an order in the future, but I think I'd have to sample some different things on the menu before giving a higher rating.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "I really don't understand why this place does not have enough customers. The food is authentic, spicy is spicy enough, they serve you lemon icy water, and it's with lovely ambience. I really don't hope they run out of business.", "author": "Yuan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-20", "description": "They know me so well that I feel like Norm from Cheers when I enter Phuket and they said \"Nicki!\" \n\nI'm a big fan of their classic Pad Thai which is delicious, as well as any dish with garlic and silver noodles. My husband likes the stirfried rice with cashews which is more savory than sweet. It is very inexpensive with large servings and the owners are great people. \n\nThere is a Thai place nearby as well but we always choose this one as I've had an upset stomach twice by the other one and I decided a third time would not be the charm.", "author": "nicole m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-27", "description": "BAH! Not great Thai at all. I have had this placed bookmarked for a couple years and it is too bad that it was not worth the wait at all. Mediocre food and service.", "author": "Rebekah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-15", "description": "Looks are deceiving.  We walked in because of the name, LOL, it smelled amazing and I loved the decor.  \n\nWe expected a pretty expensive menu, but were pleasantly surprised, even though the menu was small, there was enough to choose from, the pork satay w/curry coconut sauce drizzled on it was delicious.  The Tom Yong Guy (sp?)  was enough to split with 2 other people and had large shrimp.\n\nMy friend wanted Pad Thai but couldn't find it on the menu, so he opted for the grilled chicken w/peanut sauce (yum!)\n\nThe place is small but I considered it cozy, e-z access to public transport and they do take credit (yay!)", "author": "Foxy F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-09", "description": "The worst pad thai I ever had. They probably just said, Phuket.", "author": "Samantha E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-14", "description": "The food here is really bad. \nIt tastes bland and it just looks sad..\n\nThe place is dingy and low lit. \nThe staff is grumpy and inattentive.\n\nGo somewhere else and thank me later.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-01", "description": "Good family-style Thai food, friendly service, and reasonable prices in a casual environment.  This restaurant has been here for many years and I've eaten here several times, most recently this past weekend. Overall the food was pretty good and our group of six seemed fairly happy with the food.", "author": "Kent W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-24", "description": "Tried the Pud Thai with Shrimp.  Came with a lot of noodles, but only 3 shrimps!  And they were not jumbo shrimp either.  If I'm gonna pay over $7 for Pad Thai, then I expect more than 3 shrimps! The glass of water they gave also had some kind of weird after taste.", "author": "Irfan R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-26", "description": "Horrible experience. I ordered delivery of beef pra ram and fried banana/ice cream dessert. I asked for the food to arrive at 8 so the ice cream didn't melt and my break wasn't til then but they came way too early, gave no utensils in the bag and my dish of beef had no peanut sauce. They tell me they'll be back to get my correct food and when they return they just have a small container of peanut sauce to add to my incorrect dish. They also brought their version of \"utensils\" which consisted of a spoon .... Really expect me to eat a meat dish with a spoon? Oh and the beef was very dry, rough and rubbery and difficult to eat. How do you mess up thai food?!? Never ordering delivery from them again.", "author": "Marisa P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-11", "description": "Wanted to charge 2 dollars to add veggies for pad thai. Service was inattentive.", "author": "JT S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-29", "description": "Gotta love the name! I live close by, but have never actually eaten in the restaurant. I have ordered their take-out on multiple occasions and they have always delivered in a timely manner... However, the food quality is quite variable. Sometimes, it's almost \"as good as it gets\", but other times I have been completely underwhelmed (I wonder if they have different chefs on certain nights of the week?). \n\nBottom line: I can recommend them for delivery if you are hungry and want your food quickly, but are willing to take a crap-shoot on the quality.", "author": "Lyla R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-16", "description": "Gosh, from the reviews below you'd think this place is a dump. It's not. It's also not trendy/hip or into catering to the hipsters that live in the neighborhood.  I think they could care less if you like the place or not.  That being said, the food was delicious. We had chilled tofu salad which was ENORMOUS and the seafood salad.  I had a vegi curry which was delicious with brown rice. I forgot what my friend had but it was a spicy pork and apparently was prepared just right: not dried out and very flavorful.  The price was reasonable and worth the amount of food we were served.  \n\nI think they do a fair amount of take-out and the place was not busy at all. i don't mind the slower pace of eating so the wait time in between dishes was fine for me.  Try it and see for yourself.", "author": "Jasmine B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-23", "description": ":-\\\n\n\"\"FUK IT,\" just go to PHUKET Thai!  It's good eats?\n\nCan't remember much. My friend says he swore they served psilocybin mushrooms in the TOM KHA KAI soup. So we ordered that... and the Pud Phuket. We still giggle at the name.. PHUKET Thai.. (we say FUK IT Thai:  cause hell, when you can't decide what or where to eat... \"FUK IT,\" just go to PHUKET THAI.) \n\nI've eaten here a number of times... trying in vain to order different soups to prove him right.. or wrong. Thats all I can remember from the days when I lived in the neighborhood.\n\nNothing happend. Except that I had thai food. NOTHING to write home about. Perhaps another San Francisco urban legend.\n\n2 Woofs.. yeah.. its just like that. Because I lived in this neighborhood, it was a quick walk. But I've definitely had better.", "author": "JöHnNy A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-27", "description": "The WORST Thai food I have ever had. Pad Thai was dry, chicken with veggies had canned bamboo in it, I swear. \nSo awful. Any flavor that was in the food was NOT good.  Don't waste your money.", "author": "G W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-11", "description": "We had a LONG day looking for furniture and came home deciding that we would get some kind of take out.  We went with Phuket Thai, I think because we drove by it on the way home. \n\nThe BEEF SATAY was tough and dry. Probably cooked days before. The KAI PRIG KHING was too oily. Bland. \n\nBottom line:- \n\nSF is full of great places for Thai, but the quality here is the type you would find in strip mall in West Virginia.   But it's cheap and food came quickly.\n\n(And yes, my was like \"Ha ha FUKIT Thai!\"  Unfortunately it's pronounced PHOO-KET)", "author": "Mike H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-09", "description": "Extra points for authentic egg rolls and a sweet chili sauce that had a nice funk to it.\nWe got a tofu curry and a stir fry with prawns for our main dishes. They came out fast but were rather unremarkable. Spicy-ness was just right, though!\n\nThis place is pretty dive-y and looks like it's stuck in a timewarp. Service was curt. \n\nBut for the price and for the yummy, authentic egg rolls, I will give it some redemption in the form of three stars. They also deliver, which is automatically a plus.", "author": "Erin M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-22", "description": "Pretty pedestrian, standard Thai fare. \n\nThe combo of the classical music radio station,  the multi-colored Christmas lights, cheap plastic dangly ceiling decorations, flashing neon signs, and mostly empty feel made me think I was eating at a Chinese restaurant on Xmas eve. \n\nBut it gets the job done on a typical weekday.", "author": "Clayton S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-03", "description": "I'm not sure what's up with all the negativity about this place (it couldn't really be about the name...could it?). I've eaten here a dozen times over the past 5 years and it totally satisfies. This is healthy-ish neighborhood Thai food with nice service and reasonable price. The folks that run it are super-sweet and I'm glad they are in my neighborhood!\n\nI also have a feeling they are Buddhist and specialize in vegetarian recipes (although perhaps they feel they couldn't survive in this market without meat).", "author": "Charlie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-03", "description": "In a restaurant town as competitive as San Francisco, it's really, really hard to find a ghastly meal but this place has consistently delivered the worst worst possible food over the years. \n\nI have gone there from time to time because it is a block from my home and sometimes you get lazy and hope to get lucky.  \n\nHowever, I have concluded that you are better off staying home and eating stale Fruit Loops in curdled milk than dining at Phuket. \n\nI will never eat there again.  You shouldn't either.  Do I make myself clear?", "author": "Alan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-18", "description": "I hit this place up because it's super-close, cheap and VERY fast.  \"How long before that's ready?\"  The response is always \"5 minutes.\"\n\nI've gotten the shrimp & red curry w/ veggies dish  and a similar one in yellow curry and both were quite good (sorry, the thai names escape me). \n\n Can't comment on what dining inside is like although complaints about the interior's appearance are overblown and whiny (par for the course for the vast majority of complaints on Yelp). I thought the flatware and appearance was perfectly acceptable for an inexpensive Thai place.", "author": "Rob G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-23", "description": "This is the absolutely WORSE Thai I have ever had. The moment you walk in it's musky and smells super moldy. And the food... don't let me begin. It was awful, be cautious and stay away.", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-21", "description": "Absolutely excellent vegetarian peanut sauce. Especially if you love spinach, fried tofu & peanut sauce over rice. I do and I know to get it with an extra serving of peanut sauce. Delicious!\n\nTheir customer service can be spotty, but after over 15 years going there I feel confident recommending this restaurant to lacto-ovo vegetarians in need of a good lunch or dinner.\n\nThey're very convenient to get to. You can take public transportation to right outside the front door from almost anywhere in SF. They're also inexpensive being on the lower end of Yelp's \"Price Range\" (more like $12/per person).", "author": "Molly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-21", "description": "I'm not sure what everyone is complaining about.  The food is good, cheap, and fast.  The servers are very sweet.  In the end I think you should just pick a Thai place based on convenience, not any noticeable differences in quality since all the places in this neighborhood are the same.  \n\nMaybe part of the problem is that this place hasn't made much effort to modernize or look fancy or anything.  But in the end it is good and cheap.  Isn't that all that matters?", "author": "Rachael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-23", "description": "My husband and I  visit frequently for lunch.  The food  is quick, delicious, and inexpensive.  The service is always very good.  I recommend Phuket for lunch or a quick dinner, eat in or take out.", "author": "Lois M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-17", "description": "Let me be honest - the only reason why I was compelled to go to \"Phuket\" Thai was their name. Tomatoe, tomatow right? I remember driving passed this restaurant with friends and having a quick laugh.\n\nMy curiosity got to me, so I decided to have dinner here with a friend.\n\nAfter walking in from the thrashing street noises of Divisidero during the commuter hour, the door closed behind us and we were embraced with a tranquil and peaceful eating area. This is a perfect place to have a quiet conversation with someone, or even go solo with a book or journal. \n\nI've been to many Thai restaurants all over northern and southern California, and the food was not very memorable. For a person not familiar with all the other great Thai restaurants San Francisco has to offer, this would be a good start. The menu consists of all the standard seafood, soup, chicken and curry dishes.\n\nI usually judge a Thai food place from how they create their basic dishes, particularly their noodles, curries or tom yum gai soup. Since this was a new venture, I decided to ask the server what their popular dish was, and was guided to one of their pad thai. If this was one of their signature dishes, I may choose a different restaurant for thai. The noodles seemed overcooked, so they became too sticky and starchy. It also lacked the full flavor I know Thai food is capable of.\n\nSeems like their delivery service was a hit, since that night there were many call in orders. FYI - it was rainy on this given night.\n\nBottom line - if you do your research, you can find several great Thai restaurants in many areas of the city at all price points, but if you want some basic Thai food in the Haight/Divisidero area, this is the place.", "author": "Ron C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-17", "description": "Terrible. Seriously what are you people eating that you're enjoying so much? I just got the green curry w/ chicken and beans and it's terrible. The portion is tiny and the curry is just lame and tastes like it was made with water instead of coconut milk. Might try this place again if I get desperate but i'll likely just return to Thai Place II up the street.", "author": "Stephen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-17", "description": "Well I have been here a couple times, I take the 6-bus down from the Haight Ashbury so it is kind of a neighborhood spot. That said, the service is always slow... and I have never seen more than 1 other table in service each time I have been here. The service is so slow in fact that it gripes me, but the food is good. Aside from slow the staff is not bilingual and that can make for an interesting evening.\n\nSo let's recap, slow non-communicative wait staff, tasty and different Thai cuisine, overall worth a visit. Also check out the lone fish in the tank by the door. What happened to the rest? Dinner?", "author": "Richard P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-21", "description": "I have nothing nice to say about this place.\n\nNormally I wouldn't harbor such ill feelings about a restaurant but it abused me at a time in my life when I as at my most vulnerable and needy.  \n\nDrama Alert: Back when I was poor and starving, my bf and I decided to treat ourselves to dinner at this place. Just to remember what eating out was like. We spent our last $20 on some veggie food here and it was just horrible. We both love Thai food. This wasn't like Thai food at all. It was bland and watered down and just wrong. We had to eat it because we were hungry but it was not a pleasure. I remember sitting there, thinking about all the other food we could've gotten with our money and I actually felt like crying. Nay, I did cry. \n\nAnyways, it is in my neighborhood so I have to see it all the time. So much pain.", "author": "Laura V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-03", "description": "Whatchoo gonna do when Thai Place 2 is closed? \n\nYou might be inclined to say to yourself \"Phucket, let's walk the extra block down to Phucket Thai.\" That's where I come in. The little angel on your shoulder.\n\nReally bad calimari, straight up mediocre garlic shrimp, & just passable spinach peanut chicken.\n\nWhen restaurants make your food just so they can pay the bills, it's called \"Losing The Love\". I don't know when, where or how, but Phucket lost the love. \n\nI'm sorry to report that I'm not likely to return.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-27", "description": "We just had take out from here yesterday. The flank steak with cauliflower was pretty good but the Pad Thai needed quite a bit more flavor as did the spinach and chicken dish. \n\nService was decently quick. Price is reasonable for the amount served. The interior has a very nice ambiance: nicely decorated and appropriate dinner lighting. The key element I was after though was a great tasting Pad Thai...", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-10", "description": "Well, Phuket.\n\nI live down the street from this joint, have always wanted to try it because I love Thai and because the name is great, so a few weeks back I ordered some take-out.\n\nEasy stuff...two orders of Pad Thai and some veggies.\n\nYuck and yuck. And I eat food that's been on the floor for 5 minutes, so when I say yuck, I mean it. \n\nOh well, at least there's 10 other Thai places in the area. Let the search for a good one continue...", "author": "Kate P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-18", "description": "I know the capital of Thailand is not supposed to be a joke. And the Thai kid from school whose last name was Pornpromlikit -- I don't think that's a joke either. \n\nBut I was secretly hoping that maybe the people who had opened this restaurant were in on the joke, because it's so much fun to pretend Phuket is an English word and pronounce Phuket Thai accordingly. I'm sure you can figure out what I'm getting at.\n\nI made a field trip here to investigate (and also because my friends demanded a cheap place to eat lunch), and I'm saddened to report that I don't think it's supposed to be funny. \n\nSo now I feel a little culturally insensitive for softening the 'ph' and shortening the 'u' in Phuket. But not enough to stop.\n\nAs for the food itself, I've had much better Thai. The pad thai was too tomato-ey for me and the curry wasn't too exciting. But all the vegetables were tasty and fresh, and 4 of us shared 3 dishes for around $25, so I would definitely recommend Phuket Thai for a cheap lunch in the neighborhood.\n\nI would, however, pronounce it wrong...", "author": "Liz G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-12", "description": "Phuket Thai's a family owned restaurant that is one of my go-tos for Thai.  It's close by and has friendly service.  I am a fan of their Pad See Ew with extra veggies.  It isn't mind-blowing but it is not a bad option if you happen to be in the area!", "author": "Alice Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-04", "description": "I found 6 shrimp in my vegetarian tofu and veggie dish...1 shrimp = a mishap, 2 shrimps = tighten up guys...6 shrimp = LOSER!\n\nand I'm a pretty strict vegetarian too...Still ate it minus the shrimp.The food was bland and tasteless.  Even the peanut sauce...how do you make that bland!  Order from Thai Place 2 next door.  delivery time might be an extra 15 minutes but its worth it.", "author": "Tim T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-12", "description": "During my  quest to find the best Thai delivery in SF, I decided to try Phuket. I remember eating there a few years ago & thinking it was pretty good. However, the delivery was really disappointing.  The spring rolls were ok, but the rest of the meal was not so good. My partner & I ordered peanut sauce with chicken and a tofu dish...nothing special and it was really oily (and the spinach came separately from the chicken with  a ton of water in the carton - very weird). Overall, Phuket just didn't make the cut, but maybe the food is better if you eat at the restaurant.", "author": "Owl B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-15", "description": "I eat at Phuket quite often when I'm in the mood for Thai because it's the closest to me, but deep down inside I don't LOVE it. I think it's slightly over-priced, and the dishes are average at best. There is nothing special on their menu that warrants a special visit from across town, so if I lived somewhere else, I'd probably never go there.\n\nI can't say that their food is bad though, I've never had a horrible dish. They make good Sticky Rice and Mango and excellent Tapioca Pudding (the kind with corn kernels in it.) The Fried Banana and Coconut Ice Cream is the same as in any Thai restaurant.\n\nThe restaurant is nice and clean. The walls are an unusual green color. There are a couple of aquariums but the one by the entrance appears to be empty. Once, this cook, who I suspect was stoned out of his mind, came out to stare at the aquarium while I was eating lunch. I couldn't see what he was looking for, yet he kept glaring at it. Maybe there was some sort of elusive creature hiding in there which he wanted to eat, or maybe he dropped something in there.\n\nVegetarians beware. I observed a huge argument outside the restaurant where I heard a guest yell that they ordered their meal vegetarian, and the cook tried to argue that it was vegetarian. Sketchy.\n\nI like Thai Place II better but it has a much longer wait.", "author": "L. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "There are two Thai places within walking distance of my flat.  Thai Place II, and Phuket Thai.  I prefer Phuket for some reason, although both of them are really good.  Sadly, I've been to Thai Place II many more times just because it's a block-and-a-half closer.  I know, I'm lazy.\n\nThe food is pretty good, and when you see the prices, you'll think the food is excellent.  There are better Thai places in the city, but if you're in the Lower Haight (or even the Upper Haight) and don't feel like going far, just trudge up Haight (or coast down Haight) until you hit Divisadero.", "author": "John S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-07", "description": "I got food poisoning here, and the food was mediocre.  'Nuff said.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-05", "description": "If I had a Thai grandmother, her house would look like the interior of Phuket: antique knick-knacks galore, covered in plastic slip covers to protect from dust. Beyond the decor, Phuket is a typical Thai restaurant with the usual fare. If nothing else, it serves your immediate Thai carving. \n\nThe standout performance at Phuket was our waitress. She had an encyclopedic knowledge of the menu that impressed our table of 6. If only the food was as impressive.", "author": "Tim B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-05", "description": "We had just come from seeing the famous LEGS at haight and ashbury and we thought there would be tonnes of restaurants in the area, we were wrong.  We walked what seemed like forever and we came across this restaurant.  Usually i am not a huge fan of thai, but this place was really good, and extremely affordable.  The exterior of this place is enough to scare off somebody, with the grafitti on their awning, but the food makes up for their lack of ambiance.  We had red snapper with ginger sauce, really good, flavouful but not too spicy.  Also we tried their curried chicken with potatoes, vegetables and rice, all really good.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-05", "description": "I'd been wanting to try Phuket ever since, well, seeing it's name and having the immature male in me laugh. Tonight was finally the night, and I was totally impressed. \n\nFor $9, I had an outstanding dish of charbroiled chicken and steamed spinach. That price alone is worth four stars. But what makes this place one I return (hence the fifth star) was the service. I called and placed an order for the sauteed chicken with spinach, and asked it to be made as healthy as possible (i.e. no peanut sauce). That the waitress recommended this as an alternative is worth bonus points, not to mention that the amount of chicken was substantial. \n\nTwo subtle moves that make this place stand out among all the rest - not to mention the uber cool name.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-22", "description": "San Francisco has so many Thai places.  Other cities have Big Macs and Whoppers; we have Chicken satay and Pad Thai.  Phuket is not the best Thai place in San Francisco, but it beats out all the others in the area.  There are three very close to this place that are in the same price range.  Of the four, Phuket has the best quality of meat and the freshest veggies.\n\nI recommend the Prawns with Panang Curry.  Yummy.", "author": "Megan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-04", "description": "Love these guys for their speedy delivery, and prefer their food of the other Thai delivery options in my area (in the Lower Haight/ Alamo Square locale, this means Chili Cha Cha -- Thep Phanom does not deliver, unfortunately).\n\nConsistently fresh & crisp veggie dishes and I generally love their duck curry (though there was one time it tasted a bit off).", "author": "Claudine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-04", "description": "I gave this place a try about half a year ago and wow its pretty damn good. My favorite dish here is the fried fish. I would have to say its probably some of the best fried fish i have had in a really long time. the only dishes i tend to stay away from here is the the seafood dishes with alot of lemon in it. but overall i would have to say the food here is pretty good. No wonder they have been open here for so long.", "author": "Art N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-11", "description": "OK, well the name was always a draw, I must say, but after eating here, it's not worth telling your friends where you just had dinner. \n\nEverything that we ordered was super greasy and oily. Not a ton of flavor that you would expect from a Thai place. \n\nI mistakenly ordered a shrimp dish, and had one bite of the shrimp, and it was NOT GOOD, not fresh, not edible really. \n\nThe only thing that was redeeming was the frie tofu appetizer, and that was only ok.", "author": "katie p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-15", "description": "Very friendly.  Fast delivery in the neighborhood.  And generally good food.  Their vegetable pad thai is consistently delicious, and the shrimp coconut milk  with lemon grass soup (#15) is excellent.", "author": "Jim Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-17", "description": "This unassuming little Thai joint is world famous.\n\n\n I have friends in Los Angeles who begged to go there when they came to visit. My friends in London still email me about how they miss the tom kha gai. I told some Aussie backpackers about it and they blogged about it for their friends back home.\n\n\n Personally, I don't think it's that amazing overall, but the food is consistently delicious, the service is always courteous, and yeah, that tom kha gai soup is pretty freakin' great.\n\n\n On second thought, maybe the food IS outstanding - my friend who never touches seafood went ape-doody for the shrimp. That speaks volumes.\n\n\n Just avoid the delivery - I've had very little luck getting a good meal delivered from here. One out of five is not a good track record. But dining in has been a pleasure every time.", "author": "Omid T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-24", "description": "This is an often overlooked but consistently good.\nThe soups are good for a cold.\nThe staff is courteous and the food is tasty.\nThere isn't anything memorable about the inside or the food but if you are in the neighborhood, its worth a stop in.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-02", "description": "I really loved the dish I had & normally Thai isn't my favorite.  It seems like you either get peanut sauce or coconut curry of some sort & damn it- I want something different!  They offered an absolutely delicious tofu dish with perfectly cooked green beans, some spinach & a red sauce that was mild, but sooooo delicious the person I ate with scraped my plate to eat the rest of it with her rice.  They get points for having brown rice too.  Slightly weird that they give you an old hershey's kiss with your bill, but endearing at the same time.\n(Sorry i don't remember the name of my meal, but it was the first option in the vegetarian section- go for it, it is amazing!)", "author": "Karyn J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-18", "description": "the food was REALLY bad, cheap tasting but not cheap in price. I will not order from them again :(", "author": "Kary M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-13", "description": "The restaurant has a worn down feel to it -- like the owners don't want to put another dime into it.  For ambiance, it's definitely not a standout.\n\nThe pud thai (not pad) is fine, and it's never very crowded.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-09", "description": "Good Tom Ka. I'm a soupie.\nLocal.\nI go there partially for the name and that it's a mere 4 blocks from my house.", "author": "Vee B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-01", "description": "I like Phuket.\n\nIt wont rock your world, but its pretty good and cheap without feeling like you might contract hep.\n\nPlus they are really nice and doting. \n\nDid I say cheap?  Really they should be charging more. I really feel good after a meal there, not heavy or greasy.\n\nTake a chance on Phuket to get through the weekly hump.", "author": "Serene M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-20", "description": "I order take out about three times a year from Phuket Thai Restaurant when I'm way too lazy to cook.  I like it because it takes about 10 minutes to arrive.  I ordered last week.  The food was fine, though, the price was much higher than I remembered.  It came with a new menu so I will be better prepared next time.  I think the vegetables and shrimp were all very fresh, but the Pad Thai was dry.  Still, good enough for take out when cooking is not an option.  I have been to some really terrible Thai restaurants recently, but Phucket remains consistently OK.\n\nOh, I've dined in the restaurant before and it's fine.  Don't expect anything fancy.", "author": "Billy Dee R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-12", "description": "I had lunch there today and even if the place doesn't look that nice from outside, the food was really good and a very good deal. I had a mixed seafood curry and it was amazing,came with rice and even a shrimp egg roll for like 8$. Definitely worth going!", "author": "Marie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-04", "description": "the waitress was not pleasant in the least bit. \nshe was very impatient and pushy when the restaurant was not busy\n\nhowever the food was cheap and decent. \ni like cheap and decent\n\ni probably will be back one day even though the service sucked\n\noh yea the semi dirty fish tank next to the table was kind of gross", "author": "Trent D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-23", "description": "Pretty good Thai food. I started coming over here 10 years ago, and it doesn't look like the inside of the restaurant has changed one bit. I wasn't sure if they delivered out my way, so I swung by for some take out.\n\nI tried the garlic chicken - which are broiled pieces of chicken marinated in garlic - and the green curry with shrimp. The chicken was the surprise: moist and flavorful. I thought it would be more of a dish, but it was really just pieces of chicken on a bed of cabbage. The green curry had some heat, and the shrimp was, well shrimp.\n\nBetter than I thought, but more of a take out/delivery place.", "author": "Timothy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-27", "description": "I am a VERY picky eater.  I had the Nuer Yang and it was GREAT!  Meat..sticky rice...needed pepper(spice).  Service was quick, nice and patient.  Friend had a really great fried rice KAU PUD that was GREAT.  Price was pretty ok...thai ice tea wasn't too sweet and that made my day.", "author": "Tallen K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-11", "description": "Phuket seems to be more of a delivery type of place than a dine-in restaurant.  There was about 1 other table with diners when my boyfriend and I went on a Monday night.  But people kept on coming in and out for take-outs.  \n\nEverything was alright.  Service was a bit on the slow side; perhaps because the chefs were in a hurry to get all the take-outs outta the way first.  We shared the tom kha kai soup (oh boy, it was only yesterday and I can't remember the spelling), and pad thai.  Or Pud Thai as they call it.  I always find these subtle name differences very amusing.  It's like the restaurant's own way of sticking it to the Man.  \"Pad thai?  oh yeah?  well, we call it Pud Thai!  It's supposed to be pronounced Pud Thai!\"  \n\nBoth dishes were delicious.  Like most Thai restaurants in SF, food here is good and reliable.  I guess I could've given it 4 stars, but the stale decor and lack of dine-in customers just make your dinner experience that much more boring and lackluster.  So I will stick with 3 stars.", "author": "Candice B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-24", "description": "I'm gonna be a little generours and give Phuket 4 stars.  Been ordering take out for 10(?) years now.  Still really like certain dishes on Phuket's menu but agree with a few other long time local loyalists that they have slipped over the last few years.\n\nHowever, very friendly owner and staff keeps me ordering. Plus, like my favorite bartender, they know my order, 1/2 star for that.\n\nTake out or delivery is the way I go.  Credit card accepted.\n\nI live almost three blocks away so naturally I order delivery.  Yeah, I'm real lazy come 9:-9:30pm. I eat at the restaurant with friends a few times a year. The decor could use a makeover but the friendly staff and the dishes we like make up for ambiance shortcomings.\n\nUsually order the Tom Kha Kai (chicken in coconut milk soup) which I still love, Nuer Yarng (charbroiled flank steak specially marinated with honey garlic served with garlic chili sauce), and rice.  The Nuer Yarng seems to have changed over last few years, seems rather chewy now.  Please, fix the Nuer Yarng!\n\nGuess after all this time I'll have to try something different, maybe the Panang curry or the Kai Yarng (charbroiled chicken with chef's special marinade served with sweet and sour garlic sauce).\n\nI hope Phuket reads these reviews and make the improvements to return it to one of Lower Haight's Best Thai restaurants.  With all the Thai palces in the neighborhood I hope they can be one of the best. They did (once or twice?) receive the Zagat award for Best Thai so I believe they can compete at that level once again.", "author": "Keith S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-09", "description": "We frequently come here with our kids because there's never any wait and the service is quick and friendly.  I always order one of the curries, and they're reliably good (especially the green curry chicken). The fried snapper in all its various forms is good as well.\n\nif you need a decent meal in a hurry, you can always find a table here.", "author": "nicky c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-07", "description": "I don't know Thai very well...but I LOVE this place. I order the same things over and over again...the KAI PRIG KHING [#33] and the KAU PUD [#64].\nThe flavors are pretty simple, and maybe not as spicy as I would like, but it's a definite comfort food that I crave, and often.\nPlus, they DELIVER!!!", "author": "tiera k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-01", "description": "When you're choosing between Thai places in NoPa, you've got two options: the spot with the boring name (Thai Place II) or the spot with the badass name (Phuket Thai). \n\nDecision made. In all seriousness, Phuket makes satisfactory Thai grub and indeed tastes better than its neighbor down the road.", "author": "Jordan D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-05", "description": "Seriously pronounce this any way you want, but it is not a place to eat.  I have passed by this place numerous times and it never really looks all that inviting or even open.  I was starving and had to grab something quick.  The food fit the name and it was terrible.  I can't even remember what I had, but I vowed never to return to this place.", "author": "Anna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-17", "description": "This place is AMAZING. I never write reviews but I had to after seeing all the negative ones on here...c'mon people! I've lived around the corner from this place forever and it's always just....great.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-10", "description": "It used to be good. I dont know what happen...\n\nI used to like their food but recently it's been terrible. Pass on all the curries. they taste like a big piece of styrofoam... Thai Place 2 is better with the curries.\nThe service is good, decor is traditional Thai.", "author": "Karen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-29", "description": "i am giving this place five stars for one reason - free delivery!!  I have never actually eaten at phuket but i order take-out all the time.  here's a tip for the ladies--if you are suffering from PMS, order the following to be delivered directly to your door:\ngreen curry w. fried tofu (ask for xtra veggies)\nbrown rice\npad thai\negg rolls\nconsume w. bottle of wine in front of hours of sex and the city.\nit doesn't exactly \"cure\" pms, but it'll help you forget about it for a while.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-25", "description": "Never has a restaurant name been so apropos. I ordered delivery from here once and that will be the last time. I actually got an uncleaned prawn in my food...ugh, gross! The portions were small and the food was bland. The pad thai left much to be desired...it was overpriced and the worst I've had in awhile. I would skip this place.", "author": "Veronica J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-05", "description": "Dinner was average.  The ambiance was somewhat nice. The fried bananas after dinner really hit the spot.  I wouldn't go out of my way for this place..  but if I lived in the neighborhood, I would probably grab take out there.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-01", "description": "If I say my green curry tofu looked the same going out as it did going in, am I saying too much? Phucket!", "author": "Nicole K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-11", "description": "Food is just okay.  Fast take-out.  Thai place II is close by and has better food, and is only a little more expensive.", "author": "Neil G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-28", "description": "I was a bit hungover but ready for some thai food. I got the red curry beef which was MAD spicy. I like some spice in my stuff and it did help me sweat out the booze a bit but it was a little overly much. I'd probably go again and order more stuff since its two blocks from my friend's house so this review may be updated later.", "author": "Kathy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-03", "description": "The consistency of the curry was pretty awful and liquidy, but it tasted all right. Still, there is no reason to go here when you have Thai Place II up the street with equally priced much better food.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-28", "description": "The best deal in the neighborhood for lunch hand down.  Four of us ate here with five entrees to share and it was still under 40 dollars a person.  Not to mention the grub was fantastic.", "author": "brian m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-20", "description": "Decent enough thai food at okay prices.  The name is funny which is probably the only reason I remember it at all.  They will deliver huge thai ice teas though and that earns a star from me.", "author": "Jill D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-02", "description": "I really don't have much to say about this place other than the fact that it was extremely mediocre.  Nothing exciting about it at all and I probably won't go here again.", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-02", "description": "This place is at the top of my road and I get take out from here a lot. i wouldn't eat in - it's a bit drab and needs a make-over. But it's good value, they're friendly enough and they do a few things things consistently well -- the larb salad, the soups, the steamed fish with ginger and the yellow curry. It's really a three-star place but I give it four stars out of loyalty - it's there when I need it - and hey, it's called fuck-it.", "author": "mefloquine x."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-24", "description": "I totally agree with Jenifer A, when I lived nearby we'd have Phuket deliver (within a block) on rainy days or if one of us was dying with some illness or another. Never have I eaten inside. It's all about the Tom Yum Gai, the soups are perfect for those clogged sinuses. The rest of the menu is pretty much solid, it's nothing to write home about, but it is something to Yelp about for sure.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-11", "description": "Mmmm the best pad thai in the city.  Too bad I don't get to eat there too often.  Only when my dad gets a chance to pick up to go.  Our usual is the pad thai, veggie delight and a tom yum.", "author": "Allison T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-23", "description": "Ho hum. The inside of the place actually took me by surprise, as the outside looks a little grim.  They didn't have my staple, Pad Kee Mao on the menu, and I had to ask for it. The chicken in the dish was overcooked, I asked for medium spicy, and it was rather bland, and my kee mao was lacking in any sort of vegetables.  I ended up eating my dates food instead.", "author": "Jasmine B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-11", "description": "Another mediocre Thai food with pretentious service. I do not understand how they have stayed in business for such a long time.", "author": "D'Andy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-11", "description": "I feel bad giving a bad review, 'cause I've got a thing with karma (always finds me), but this may be the worst Thai food I've ever had.  It may be my fault for ordering the steak, but I have seriously low standards.  I'm giving the two stars for location and fun christmas lights.   Oh, and for the many puns the name Phuket warrants.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-08", "description": "I was referred to this place on 2 separate occassions in my search for good Thai food.  I was very disappointed by the lack of kick \"very spicy\".  I tried it twice, hoping by emphasizing \"VERY spicy\" that my experience would be 'hotter'.  Nope - disappointed.", "author": "Kerri L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-07", "description": "SInce I live across the street, I used to go here a lot when I was lazy and desperate for any nourishment. It really isn't anything special but it is cheap and has free delivery. When they are really busy I meet the lady in the island for my thai food- really!", "author": "Katherine B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-24", "description": "While it's occasionally fun to intentionally mispronounce the name when in certain company, and it's a pretty cool little place on the inside, the food just isn't all that great.  It isn't bad as in super greasy or going to make you sick, but it just isn't very exciting either.  With the number of good Thai restaurants in the city, you can do better.", "author": "Zach J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-10", "description": "Try the specialties of the house. The combination seafood one is particularly good. Ask for it spicy if you can handle high chilli heat.", "author": "Ed R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-01", "description": "Not a place i'd eat-in (bland), but for take-out (plus free delivery), it's great (pad thai, coconut milk shrimp/veggie soup, thai iced tea).  Reasonable and low prices, big dishes so you should share.  Yummy.", "author": "Today Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-30", "description": "no idea why i was so generous the first time. this place bites it.", "author": "who k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-03", "description": "It had been awhile so I decided to order for pick-up.  The Tom Yum Kai was just ok. Pad Thai was dry and not much flavor. Ordered the Pad Thai with chicken and got shrimp.  Kaeng Keo Warn Kai (Green Curry w/Chicken) smelled good but it was way too spicy. It was so spicy that it was barely edible.  I like spicy food but this was way too spicy.  \n\nEither their food is not as good or I've had better somewhere else. I'll give them one more try.", "author": "Ruben G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-16", "description": "i mainly get the fried rice, sauteed shrimp or chicken dishes and thai iced tea... delish! decent delivery service, too.", "author": "kittenfart s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-30", "description": "I have never been to Thailand, so I don't know what is considered authentic, that being said, Phuket Thai is fine. It is not great and it is not bad, it is decent. We went on a Tuesday at 2pm and were the only ones there for a late lunch. The waitress was extremely friendly and nice. My husband had Pad (Pud) Thai, which he said was good and I had red curry with tofu and mixed veggies. My curry was a bit more watery than I am used to at other Thai places. Also, it had a lot of cauliflower and broccoli in it (as well as carrots, bamboo, basil, cabbage).  For some reason, broccoli and cauliflower don't strike me as common Thai vegetables, but I have never been there, so what do I know? But I don't like broccoli, it makes me super nauseous when I eat it (my husband was happy to eat it all). The flavor was fine, but nothing to get excited about and there was almost no spice. Would I go there again? Sure, when I am too lazy to walk a little further to Thep Phenom and, it will be fine.", "author": "Kathleen Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-22", "description": "This place blows. Seriously, it's probably the worst Thai food I've ever had. :-(", "author": "Meg R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-31", "description": "The fried snapper in ginger sauce is awesome and I love anywhere that has pineapple fried rice! YUM! My only complaint is that they do not have my other favorite thai foods on their menu: mango stickyrice for dessert and chicken satay for a starter.", "author": "Shan R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-18", "description": "Ok, I have only had the delivery, but it was so bad that I will never go to eat in, especially given the sheer amount of Thai restaurants in the city.  We got the Pad Thai and Massaman Curry for delivery -- not good. The Pad Thai noodles were hard and orange, kinda like if you made pad thai at home from one of those kits it would have tasted better.  The Massaman Curry was runny/watery.  The rice could not even absorb the flavor it was so thin.  It looks like many yelpers like this place, so maybe I will give it one more go, but then again, maybe not.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-16", "description": "I used to have food delivered all  the time, but I found a big, black, and dead fly on my silver noodle salad :(", "author": "a b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-14", "description": "Hmm i should have read the yelp reviews first... I just wanted to go cuz of the name lol.  We went here last nite, it was pretty good  not the best. I think that it cost more than i would have expected a place like this to cost. Not that it was expensive - it wasnt - but it just seemed to have a couple extra dollars it shouldnt have. I had a dish with chicken and shrimps and veggies, it was pretty good. i was starving.  n had something that tasted better, it was tofu and eggplant.  my thai iced tea was good too.  The servings weren't really tiny, but they were kind of small. I finished mine and didn't feel the slightest bit stuffed. I think I could have eaten more...  when we got back to my house, i told my roommate we went here. he said he never goes there because its only ok. that the thai place ii down the street is better, but they gave him peanuts when they werent supposed to (bad for us pnut allergy people).  I tend to agree... with all the thai places, i could find something better or cheaper or both, so why bother going here.  Except maybe free delivery.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-11", "description": "i tried this place because i sometimes get this hankering for greasy noodles when i'm hungover, and i happened to pass by in just such a situation.  and for that, to be fair, it came through for me: the pad thai was sufficiently greasy, and the tom kha gai wasn't bad.  so, two stars.  but i probably wouldn't go back, hung or non.", "author": "brian g."}
