{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "The place is small and cozy. They do not sell liquor, it's BYOB, but will provide wine glasses and will open and serve.  (If you forget the wine, can be procured right next door).  \n\nFood was great, servings generous. Had the Classic Lasagna, Penne All'Arrabbiata, Gnocchi alla Sorrentina, and of course dessert. \n\nWe will return", "author": "Teresa F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "I tried this restaurant for the first time today on my lunch break. It was a truly wonderful experience!\n\nThe restaurant is very clean, nicely decorated, and it smells like heaven. \n\nThe gentleman who greeted me and took my order was incredibly friendly and helpful. He seems like a lovely person. \n\nI ordered the Funghi and Salsiccia to go. The pizza came out fast, but it was very fresh and delicious. In fact, I ate most of it before I even thought to take a picture. \n\nI will definitely stop by again!", "author": "Olivia O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-23", "description": "Overall, very average food and very average experience. They charged us for more drinks than we had, but the service was so slow that it wasn't even worth complaining about.\n\nWouldn't go back.", "author": "Alli N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "My favorite Italian Restaurant in north Beach. They make pizza just like my mom made. Everything is super fresh and homemade. And great value especially for San Francisco. Never disappointed. \nThis is the real deal on many levels. Buona apetito!", "author": "Salvatore R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "I really liked this place! The smells going in were very fine and definitely a welcome scene from the windy cold outside. The place was packed but we got seated pretty quickly. The place looked very busy and everyone seemed to be having a good time. The owner? Greeted us warmly and led us to our table. \nI ordered the lasagna classico and we got a margarita pizza to share. The lasagna was amazing! Very authentic tasting with an amazing flavor. I really enjoyed the stretchy cheese and meaty sauce. The pizza was also excellent with aromatic basil flavors and great mozzarella. \nMy friends got the tortellini and gnocchi respectively and they both looked very good. I'd definitely come again and really recommend this place.", "author": "Lawrence H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "Nice quaint little spot with great pasta and pizza.  Had a delicious plate of meatballs, a tasty burrata and my wife had a crab ravioli that was delicious while my some had a penne dish with pink sauce.  Very reasonable too - our whole dinner was around $50.", "author": "Basem T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "Amazingly good food, great atmosphere, owner and staff are awesome.  Highly recommend!", "author": "Stephen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "We were around the pier craving Italian food and found Piccolo Forno on Yelp! \n\nThey have tables outside as well as insides. The interior is pretty nice.\n\nWe had the Alfredo pasta which I think was the best dish out of all 3 we ordered. The carbonara was pretty good and the pizza I forgot the name but it had this unique taste that I personally didn't like it was like wine infused tomato sauce or something but the mozzarella tasted fresh. \n\nCustomer service was great our server refilled our water when needed and asked us how we liked our meal. \n\nOverall, this place place was pretty good I'll probably come back to try more pizza!", "author": "An L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "Reasons why you should come here: \n-very nice Italian owner with friendly staff \n-clean and modern but reminded me of those small but amazing restaurants in Rome \n-open kitchen because they have nothing to hide! \n-authentic food \n\nI came here on a Wednesday evening with a friend and the restaurant was about 75% full. Glad we got seated right away because we were so hungry after an long day of work! We ordered the burrata, Ideale pizza, and spaghetti with meatballs. Burrata was amazing.. as it should be since it is such a simple antipasto. The Ideale pizza was made with good quality ingredients and it wasn't greasy. (I ate the leftovers the next day for lunch and it was almost even better!) The spaghetti with meatballs was me and my friend's favorite. It had thick tomato sauce and super flavorful meatballs. The pasta was cooked perfectly! It's like they used a timer and a thermometer to make sure it was cooked right. We ordered simple dishes and everything was made to perfection. \n\nI think the perks of having a small restaurant is that the owner has the opportunity to be present at the restaurant and interact with his customers. I did not catch the owners name but as I've mentioned before.. he was so nice and friendly! Other yelpers have already mentioned this and I must agree. He gave us complimentary beverage and dessert, which I really appreciate. Maybe he sensed that we had a tough day at work, and we needed something to mend our mid-week crisis LOL. My 5-star rating isn't because he gave us complimentary items, but it is because of the food, staff, and atmosphere. \n\nThanks Piccolo Forno owner! Can't wait to come back and try the other dishes.", "author": "Joyce S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Amazing local Italian restaurant. We got the crab ravioli and the lasagna both of which were excellent. Perfectly cooked pasta and a lot of meat in the lasagna. \n\nThere was enough seating that we were able to quickly get a table with a lot of space. The waiter was very nice and kept the water constantly filled.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "The workers were super nice and outgoing and the food was amazing I'll definitely be back to eat there when I visit San Francisco again", "author": "Domineka B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-19", "description": "We found a cockroach in the olive oil used for dipping the bread into. Both the carbonara and the Alfredo were very bland. Giving them one star for the pizza that we ordered. The only decent thing that we had all night. Will most definitely not be back.", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "The food here is amazing.   \n\nIf you have a group with some who want pizza and some who want pasta or other dishes, this intimate, but friendly Italian eatery will surprise and charm you with their good, flavorful food and quick service.  \n\nIn this neighborhood, there's a lot of competition for your dining dollar.  I submit to you this small, independent dining establishment.   If you want some pizza to go, there're several ready-made by-the-slice pizzas to choose from.   If you want to bring a bottle of vino and ask them to serve it with your food, they will gladly oblige.  \n\nSome of our group wanted individual marguerita pizzas, a shared platter of grilled vegetable sides (delicious and recommended), and some wanted lasagna or crab ravioli.    We were all pretty hungry.  Soon after poring over the menu and placing our order, a couple of dishes of bread were brought out and olive oil to dip it in.  Water glasses and carafes of water were brought out, too.   \n\nThe kitchen was fairly open, so if you wanted to watch the chefs prepare your food, you could.  Or, you can enjoy some conversation  in a convivial atmosphere that is Piccolo Forno.\n\nThe   food was all very, very good. The crab raviolis were served with a pink,creamy sauce.   Cutting each in half to make bite-sized, you could see the stuffing of fresh crab meat plumping each little pillow.\n\nThe lasagna...my gosh, the lasagna... delicious and resounding with umame.   \n\nFrom watching my friends polish off their pizzas,it was obvious that they were enjoying their food, as well.\n\nDessert: we got one lemon sorbet served in a whole lemon skin for a friend's daughter.   Watching her enjoy the treat was fun.  then the plates of tiramisu the rest of us were sharing arrived, and we got caught up in the enjoyment of our own plates.\n\n\nI will look forward to returning to this place in the future.  The food is just great, and the pricing is very reasonable.   Mangia Mangia!", "author": "Candace Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "This  delightful restaurant is popular with locals and tourist alike. The food is fantastic, prepared with attention and passion. The service is attentive and professional, but also warm and friendly. Don't be scared off by their lack of alcohol; BYOB and consider it a discount (they will gladly provide wine glasses and open and pour your bottle.) Located on Columbus it has a convenient, yet quiet location. How Michael Bauer (SF Chron food critic) missed this place in his 'favorite North Beach restaurants' article is a mystery to all of us who cherish this neighborhood gem.", "author": "J E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "Lasagna was delicious and the owner was very  very cute restaurant. Also have gluten free options", "author": "Lorain C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "Ownership of this establishment rocks. From the first time I walked into this pizzaria resturante I was treated like an elite customer. Pizza is served in the North Beach style in a 6 inch square slice. If you are in North Beach for lunch you won't have to wait normally like some of the other pizza joints. The owner is friendly and takes care of each client as they walk in the door.", "author": "Derald C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "Excellent.  Like being in Italy.  Modern but comfortable ambiance.  Friendly fun staff.  Great food.  In our party:\nLocal halibut puttanesca - generous portion, spot on flavors; served on a healthy bed of grilled vegetables.  (European style: mind the bones and olive pits)\nHomemade ravioli - also spot-on\nPizza - Romana style, perfectly crisp and drizzled with EVOO\nAlfredo - also perfectly done.  \n\nDesserts are definitely worth checking out, especially the panna cota and lemon sorbetto. \n\nGreat meal--we'll be back.  \n\nOh! P.s.: no liquor license, but you're welcome to BYOB or purchase next door.  No corkage and they have the glasses.   \n\nAnd...continuing on the authentic streak: they don't hurry you out when done eating.  Stay, talk. Bene!", "author": "Steve K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-14", "description": "A nice cozy casual place with BYOW scenes. Ordered Linguini with pink sauce ...pretty nice for a first time. Would like to try their raviolis next time. Ohh ...they have some amazing coffees to finish off your meal.", "author": "Prateek R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-13", "description": "Average and sloppy. Service non existent. Greek salad wasn't Greek, had no olives or proper dressing instead it had some Italian vinegarette.", "author": "John W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "Stopped in for a quick bite before going to a wine tasting based in the reviews other people left. Great looking, clean, modern as described.  The waiter was about as friendly and authentically Italian as you could ask for.  He was prompt, courteous, and efficient plus the accent made me feel like I was in Italy.\n\nOrdered the fusili puttanesca (my favorite sauce).  Water and really good bread was delivered almost immediately with the food out 5 minutes later.  Overall decent puttanesca. And well cooked pasta.  For the price I'd say it's a good deal, but it's not what I'd call amazing.\n\nThe Good: very clean place with extremely nice staff.  Prompt, efficient, etc.  He was being genuinely kind to everyone I saw come in while I was there.  Nice menu.  Great prices.  Great value.\n\nThe Bad: nothing at all! \n\nThe Mediocre: the puttanesca sauce itself was just ok.  Now before I get flamed, I didn't say it was bad.  It was fine for a basic tomato sauce with some capers and olives added. And a couple pieces of fresh basil. And it was delivered quickly.  It just wasn't the long stewed amazing, aromatic work of art that oozes garlic and oomami.  I was a little disappointed, that's all.  Everything else (including the price) more than made up for it.  \n\nOverall: great and friendly place for a quick bite of good tasting pasta.  Good value and nice folks.  I'll stop in again for sure.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "This place is wonderful! From the incredibly friendly owner to the sweet ambiance this place is a winner! We had the days special ravioli and the gnocchi (do not miss these little pillows of heaven!) truly an amazing little restaurant. Very very pleased we stopped in and can't wait to come again!", "author": "Allegra M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "Overall food was good, service was excellent. I had the Penne Piccolo Forno, an eggplant, mozzarella, and basil pasta dish. All the flavors and textures complimented each other well. We were also served complimentary bread with olive oil and red pepper flakes in olive oil as well as a panna cotta desert. The only drawback was waiting an hour outside to be seated. But it was a Saturday evening so I can't complain too much.", "author": "Julia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "I came here recently and had an amazing experience. The staff was amazing and the biggest plus was that there was no corkage fee. I cant wait to come back and give some other dishes a try. Food was good, I believe once I try some different dishes that I can change this review to a solid 5 stars.", "author": "MJ L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "Had such a good experience here! Had our mind set on another place across the street, but it was too busy and we wanted to sit down for dinner after a long day touristing our neighbor town San Francisco. We looked in, got approached from behind by a guy asking if we were three. \"Get that table in the corner!\" \"We don't serve alcohol, but you can get a nice bottle of wine next door!\" Said and done. Got a nice Primitivo next door. Shared a lovely Caprese for entree, and then Pasta Carbonara, Alfredo and a Tortelloni al Fungi as main courses. Everything tasted great and the service was friendly and swift. We finished up with a Pannacotta with strawberries. All lovely, we will be back!", "author": "Maria A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "Delicious place definitely worth the wait! The pasta was cooked perfectly to al dents with just the right amount of bite and the sauce was a wonderful mingling of basil, oil, tomato's, mozzarella, and eggplant. I would recommend waiting for this place because you won't be disappointed!", "author": "Smrithi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "The best Italian food I've had, dare I say, ever!! We order the lasagna, gnocchi and fettuccine, plus a pizza to share. Literally, they do EVERYTHING right. Of course we had a favorite- the gnocchi. Also stuff was super kind!", "author": "Nikki W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-18", "description": "Sorry.   Nice ambience but at best mediocre\nfood.  Salads good.  Pasta w clams oily\nand heavy with unpleasant burnt flavor.\nThe touted lasagne was bland with a sauce \nsubpar to a market jar sauce.  Take some homemade Italian cooking lessons Piccolino.", "author": "andrew b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "My first time here and I would definitely go back. Had the arugula salad, which was yummy! The cheese was salty the arugula was dressed perfectly and very fresh. The crab ravioli was delicious, but the shining star was the Gnocchi!!! It was amazing!! Melted in your mouth, the combination of sauce to cheese to basil was delicate, decadent and perfectly balanced. The prices are super affordable too!", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-16", "description": "Charming place with two Italian gentlemen manning the front.  Service was prompt (the two seemed to be working interchangeably), but our salad was forgotten with our entrees (which took a fair bit of time to get).  We had pastas and the highest marks went to the gnocchi while the carbonara was just meh.  Ravioli was fine.  The waiter (#2) came and recited our order before bringing the bill--including our forgotten salad--to which we reminded him we never got it.  (\"Oh, of course.\")  It wasn't on the bill, but our lunch's pacing was kinda weird--something was off-kilter.  Packed with lunchtime crowd.", "author": "Monty H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Fabulous find in North Beach! Tiny little spot with amazing flavors. The bread is like no other I've tried in the city - melt in your mouth good! The Greca salad had the most vibrant dressing on it, super refreshing for a hot day. We ordered 2, 12\" inch pizzas, both were fabulous. Definitely worth driving into the city for - we will be back!", "author": "Candida B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Found this place wandering around and stopped in for lunch. Staff was extremely friendly. Large delicious pizza for $4.00/ square. The halibut melted in your mouth and was extremely healthy. The egg plant was fantastic.Fresh homemade ravioli was extremely rich And delicious\n\nHighly recommend .", "author": "Rob D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "Excellent service, agreeable prices, delicious meals.  Giuseppe has created a very good place that people keep coming back to.  It's the REAL Italian pizza, pasta, insalate you've been looking for in SF.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "Everyone that has come in as been personally acknowledged by who I think is the owner. They shake hands, smile, maybe even a hug. Super friendly. They are so popular there's a line our the door on a Friday night, but you won't wait longer than 30 min. Sadly, they are also so popular that they ran out of lasagna. I left the group I was with to grab some lasagna from somewhere else. Piccolo was nice enough to let me join my group due to the inconvenience, and they still waited on me even though I had a meal from somewhere else. Highly recommend. Average price of food is around $15.", "author": "Cutter P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "This place was very good! Our friends stopped by to get pizza and the very next day, we were trying to figure out what to eat near Pier 39 area and decided to walk over to here (which is farther from there than expected but it was fine). \n\nThey give you bread when you sit down which is nice--load up on those carbs! We each ordered a pizza for ourselves and a couple people took some other stuff like the burratta appetizer (so bomb) and amongst our table, people got the Prociutto Crudo, Vegetariana, Tonno & Cipolla, Lasanga, 4 Frommaggi, and a bunch of the antipasti.. I took the Cappriciosa which was good! But I gave the egg away to someone accidentally :( The artichokes were a little overpowering but overall the dish was really good--flavorful, fresh, and great cheese! I was a fan!\n\nWould come back and probably get the gnocchi and some of the other pizzas my table got, all of which looked tasty! Highly recommend if you're in the area", "author": "Nerissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "Some of the best pasta we have had in a while! Love the seats facing the street to people watch, just like in Europe. The smells are amazing and the waiters were all so kind and happy. The dress is very casual and the noise level is medium. We will most definitely be coming back here to enjoy their food. Thank you Piccolo Forno!", "author": "Breanne B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-18", "description": "Good food. Very stingy with Parmesan cheese. I like it at the table. Drinks are not desirable. My husband had a Snapple tea that had 46 grams of sugar after ordering a regular iced tea. Sorry for his pre diabetes", "author": "Chrissy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "I love this place.  Their caesar salad is good and it's different compare to the other place.  The lobster ravioli is delicious. Lobster is fresh and the ravioli sauce is so so good.  The services are good and all servers are super nice.", "author": "Quynh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Amazing food and great service. If you are in San Francisco area you must try this wonderful little restaurant. The food is delicious and yes it may take a few minutes to be seated since so many people want to eat here but I must say it is worth the wait.", "author": "Jay R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "Great for a quick, casual bite.  Food was tasty and service was friendly in a warm and clean environment.\n\nPiccolo Forno means \"little oven\".  In the open kitchen, you could see that this small kitchen churned out mighty good food.  We ordered the crab ravioli and the spaghetti and meatballs.  Both came in substantial portions (we were too full for dessert afterwards) but the food was a SOLID 5/5.  \n\nCrab ravioli came with a creamy sauce, and spaghetti arrived to the table piping hot and noodles perfectly al dente.  Absolutely delicious!  Our Caesar salad had crunchy lettuce leaves perfectly coated with dressing and topped with anchovies and capers.\n\nWe were surprised by how affordable our meal was.\nThe bill for 2 full plates of pasta and a large salad was under $40.  Amazing in today's SF living standards.  Just wish they offered more creative drinks than run of the mill soda, so we stuck to water.  I don't recall seeing the wine list.\n\nOur service was friendly and everyone was speaking in Italian.  It didn't feel like the usual tourist trap in North Beach.  More like a neighborhood casual bite.  Which honestly was a little confusing.  The service felt attentive enough that it should have been more upscale, but everything else reflected a casual atmosphere.  This place is best suited for families or a group of friends.  Not a romantic place for couples or a fancy night out.\n\nSo did Piccolo Forno blow us away?  No.  \nWas the food delicious and well prepared?  Yes.  \nAuthentic?  Yes.  \nService friendly?  Yes.  \n\nWill we be back?\nYES!", "author": "Cin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "This place is great! Fresh home made Italian food! We stumbled across this place accidentally. Walked by the front door was wide open and you could smell the delicious food. They weren't open yet but Massimo let us sit a few min early. He was also our server and he was awesome! He is polite and attentive. The food is delicious! I had tortellini in 3 formaggio, my friends had gnocchi and pizza margarita. Classic Italian dishes. We all shared and all dishes were awesome. This place clearly has an excellent chef behind the menu. I'm assuming since they nailed 3 for 3 on our dishes that everything on the menu is amazing. Can't wait to come back here to try more. If you are in the neighborhood this place is totally worth it and it is not expensive at all. Great food great service great prices great smells and a clean restroom, what more can you ask for! Check this place out", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "This place came highly recommended by our AirBnB hosts, who knew we were traveling with 2 elementary school -aged kids.\n\nBYOD, no cork fees!!! (Liquor store 2 blocks away).\n\nAmazing Italian food made by real Italians :))). Ordered a large pasta and meatballs entree for the kids to split. It came with meat ragout sauce and meatballs. Kids polished it off in seconds and fought for leftovers.\n\nWe had a few appetizers and a pizza, ate everything to the last crumb! \n\nWill be back for sure", "author": "Katherine G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "My second time here and I can't say enough about the food as well as the owner Guiseppe! Super nice guy with a big heart who offers personalized, awesome service! The food is beyond delicious! Real Italian food is hard to find. The part I like most is that he offers quick bites to go right on the spot at the front counter or you can hang for a couple hours and enjoy a 5 course meal if you feel inclined.\n\nThank you Guiseppe!", "author": "Sandy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Best Italian restaurant I've been to outside of Italy! The food was beyond excellent. The service was super friendly, very considerate, and just all around pleasant. \n\n1. Burrata (5/5): Very creamy, yet light. Came on a bed of arugula and delicious prosciutto.\n\n2. Spaghetti and meatballs (5/5): Excellent. Love it when a restaurant does a wonderful job on an old classic. The meatballs were tender, flavorful, and plentiful. No joke, they don't skimp on the meatballs. The ragu sauce was hearty, and the pasta was cooked to a perfect al dente.\n\n3. Tuna Pasta (5/5): This was a special, recommended by our server. Spaghetti with fresh tuna, pancetta, mushrooms, all tossed in parmesan and olive oil. Light and very flavorful. Again, pasta was cooked to a perfect al dente. \n\n4. Complimentary bread + olive oil (5/5): The bread was fresh out of the oven (really, we watched them pull it out)! Crispy on the outside, soft on the inside. The olive oil was nice and fruity.\n\n5. Cappuccino (5/5) \n\nThe pizzas also looked amazing, but we were too full to order one. Next time!", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Fantastic experience all around!\n$4 for slices of pizza. \nHalibut special was delicious and healthy. Portobello ravioli was divine. \nWe found this place wandering around and looking for lunch. We were greeted promptly and seated. Service was quick and friendly.", "author": "S M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Mamma Mia! Such a great local establishment in the beautiful North Beach. :)\n\nIt's genuine Italian, and though they don't serve alcohol, it's BYOB without a corkage fee. :) Many non-sketchy corner stores around this adorable area to pick up a last-minute bottle of wine.\n\nWe ordered the gnocchi and a pizza- both delicious. I've had their assorted veggies of the day in previous trips here, and they are even better than the menu dishes.\n\nThe staff are so friendly and food is so good and well-priced- can't beat it. Deserves its great rating. :)", "author": "Katherine G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "One of my favorite places to go in North Beach sort of at the end of neighborhood. No beer/wine but little known secret: bring your own and there's no corkage--even better! You can pick up a bottle at the convenient store across from Cobbs. Prices for dishes are reasonable, casual environment, wait staff is nice, will sometimes have the game on, which is a plus. Quiet calm environment, which I prefer.\n\nItalian Homemade has great pasta, and Piccolo Forno's are of similar quality, but I would claim that Piccolo Forno has slightly better sauces. I'm not Italian, so I can't vouch for authenticity, but there is something about them that just happily remind me of my childhood. Again--never grew up Italian and I'm not an expert, but I have been to Ideale (also I highly recommend), Sotto Mare (a different thing since it's seafood), Caffe Sport, and a few others along and off the main drag, and I would get a red and/or meat sauce any day from Piccolo Forno. Haven't been enough times to try the pizza, but one of these days...", "author": "Sleepy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Great mea (again). This time the mushroom ravioli were exceptional. Delicious fresh para stuffed with mushrooms with a hint of truffle in the ravioli and in the sauce. Perfect.", "author": "Corinne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "Great food with a friendly, neighborhood atmosphere.  My favorites are the Margherita pizza and Cesare salad.  Eat in, or if you're local and prefer to eat at home, you can order for pickup.  Yum!", "author": "Rosie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "When I return to San Francisco, this will be a mandatory stop.\n\nPerfectly light cream sauce, savory and smooth vodka sauce... And perfectly cooked pasta. My student center I began with a salad of arugula and pecorino tossed with a ball sonic vinaigrette. After our perfectly prepared past her hives, we were all in heaven. And my personal favorite dessert, Pana cotta was just barely sweet enough to be considered a dessert. It was a perfect evening. \n\nIf I could give this family restaurant six stars for kindness, speed, accuracy, and deliciousness, I would!", "author": "Jacob H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "My daughters and I really enjoyed our meal here. We start d with the Cesar which was top notch. We then had the crab ravioli, Alfredo and cheese ravioli with pesto. All were excellent. The only downsides were the lack of wine (I am the only drinker and would have enjoyed a glass) and it was crowded - which is really a good thing in the long run. The staff was excellent too.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-06", "description": "a friend picked this cute little spot for girls night yesterday and we all loved it!  it's been on my list for a while, and it's great that it's BYOB because it really keeps dinner costs low!  the owner is very italian and so sweet. we ordered the carbonara, a pizza with egg and prosciutto, and the crab ravioli.  the carbonara wasnt as creamy and delicious as we were hoping for, but the other two dishes more than made up for it.  i would come back for the pizza a hundred times over! so yum, and does not taste super guilty :) we also shared the panna cotta with strawberry and the tiramisu - great!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "Delicious food! The Gnocchi was unbelievable , the Beretta was unbelievably fresh as well. Highly recommend, genuinely delicious authentic Italian food", "author": "Lauren O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "Fantastic pasta and beautiful owner/waiter Guisseppe. Eaten twice with family in 2 weeks, love the the Gnocchi. best in town", "author": "Paul E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Best. Sauce. Ever. Don't even waste your time going anywhere else in North Beach for traditional Italian - this place is the BEST, and we have been close to everywhere before discovering Giuseppe and co at Piccolo Forno. The pasta is perfection - the bucatini dish is amazing - and so is the penne with eggplant. You really can't go wrong with anything on the menu. They've got a woman on the pizza oven and Italian men on the floor. Also - this gem is BYOB. I love this place, and so will you.", "author": "Richie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "You feel like your stepping into Italy as you step into Piccolo Forno. This place is really adorable, with a very friendly and hospitable owner. The pizza here is wow!...light crunchy but fluffy bread, homemade sweet marinara sauce, and stunningly fresh ingredients as toppings. The pasta was also cooked to perfect and the salad was yummy. I really highly recommend checking this place out!!", "author": "Taline M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "Wow... I used to think there wasn't room for more pizza in North Beach. After having a most delicious lunch at Piccolo Forno, it feels like a North Beach staple that has been there all along. The food was remarkably flavorful, with the pasta and crust tasting like it was made that morning. Try the gnocchi!\n\nThe owner, Giuseppe, is one the most genuine people you'll meet and he takes great pride in this place that he opened with his own sweat and equity. Wonderful spot all around!", "author": "Trav K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "Nice restaurant with good service and really good food.  Not a ding for me, but be aware they do not serve alcohol, though you can buy from a store around the corner and they do not charge a corking fee.  Pasta and pizza were both good.", "author": "Matt T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "We love the pizza and love Giuseppe! He was so sweet, his service was great and he went over and beyond to make his customers happy. Love this spot coming back again soon!", "author": "Christine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "I've only eaten their pizza. Buffalina and the prosciutto. Both are great thin crust pizzas, I prefer the buffalina. The pizza crust is to die for. I've eaten  at a lot of \"famous\" pizza places in SF but this one is definitely my favorite.\n\nOrder 2 pizzas and a side (burrata is delicious) for a nice wholesome meal for two.", "author": "Dylan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "BEST homemade tiramisu I've ever had! The owner makes it himself along with many of the other desserts. Ive been here plenty of times and ALL the house made pasta dishes are FANTASTIC. They also have great to go pizza. The place is modern and friendly. The portobello ravioli in the cream sauce, the bolognese, and any special they offer is WORTH it! Will forever be a Piccolo Forno fan:)", "author": "Niaz N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Real deal here.  Possibly the best Italian I've ever had! Owner Giuseppe personally checks on you, he's such a nice guy. \nAmazing food, even basics like spaghetti and meatballs and pizza are masterfully done. Just look at these pictures they're practically glowing!!!", "author": "Chad C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-15", "description": "Avoid this restaurant unless you wished to get reprimanded by the waiter when he gives you the wrong dish and salad. And then he makes fun of you with the other waiter in front of the customers. \n\nThe waiter, thinning brown hair, thin frame 5'9\" speaks broken English. My son ordered the capricciosa pizza but the waiter kept saying caprese salad. My wife and son both corrected him and told him it was the pizza. He then brought over the caprese salad along with a Caesar salad when we ordered the arugula salad. When we told him we did not order the caprese salad he got very hostile and insisted we did until I finally said we would keep it as I was concerned about how angry he had become. At that point we did not mention the second mistake.  They did not chargeus for the caprese salad \n\nAlso they make their Italian sodas with sprite; instead of soda water and Italian syrup. The food was very  good and a new waiter took over, but we will never comeback.", "author": "John L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "Great little spot for delicious food! Meatballs were tasty! Pizza was very tasty as well! The homemade raviolis stuffed with crab were delicious! The pink sauce was creamy and smooth. My only complaint is that the raviolis were not very hot. I was a bit disappointed at the lukewarm temp of the food. Service was friendly and prompt.", "author": "Suzanne M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "I would say my dining experience at Piccolo Forno was worth the wait, as they were extremely busy and the wait was longer than I expected. I ordered a caesar salad and gnocchi with mozarella, marinara sauce and basil. The sauce was a bit too salty for my taste, but overall the dish was great.", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Delicious pizzas and pastas.  I recently started a gluten free diet and was thrilled with the number of gluten free choices at this restaurant.  They'll make any pizza a or pasta on the menu in a gluten free version.  The gluten free pizza crust was delicious.  Unfortunately I live in LA or I would be a regular customer. I look forward to going back the next time I visit San Francisco.", "author": "Danna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "By far my favorite pizza in the city, next to Delfina. Not too thin, not too heavy. Crust is just right and they're always consistent. I recommend the ideale. Also the service is fantastic!", "author": "Julian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "one of my favorite restaurants in little italy! the owners are so kind and the food is fantastic - we love giuseppe!!!", "author": "Lea C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "This has to be one of my new favorite Italian restaurants in SF! It is perfect for anyone looking for a quick bite of Italian food without the high prices that are common throughout the city. Me and a group of friends ended up here around 3pm after doing some sightseeing. The host was extremely friendly and had us seated immediately at a table of our choosing. Right after, he took our drink orders and brought us fresh bread and flavored oils to enjoy while waiting for our food. He kept making jokes and kept us entertained while taking our orders and bring out our food. \n\nAt Piccolo Forno, not only is the hospitality amazing but also the food! Each of us got a different entree including the daily special an amazing butternut squash ravioli, cheese tortellini in red sauce, a margarita pizza topped generously with fresh arugula, and a panini. The menu selection is very wide and has something for everyone. All of our dishes were prepared to perfection and we had no complaints! The food was fresh, light yet extremely filling, and overall the perfect casual meal.", "author": "Prathna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Great service and great food. Had a special of hand made cheese tortellini with meat sauce and pizza. Both were good the pasta was GREAT! Would go here again.", "author": "Stacey R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "My wife, baby daughter, and I needed a place to sit down, rest up, and eat after an afternoon of walking around the north beach and wharf area.  We popped in to this place and decided to sit outside since it was nice weather and more spacious for our baby.  The waiter was great and constantly made sure we were doing okay and interacted with our daughter.  The food was great; the prosciutto was delicious with a nice airy crust and wonderful parmesan cheese slices, the lobster ravioli was light and the pasta shells you could tell was made fresh, and the pasta carbonara was eggy and light unlike typical pasta carbonaras that is heavy - pleasantly surprised.  Overall we had a wonderful experience.", "author": "Raymond F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-17", "description": "I tried the pizza here. The one with the egg. It was okay! My boyfriend had the crab ravioli which was very delicious! I will come back just for the crab ravioli!! This place is very casual in comparison to the very nice and fancy restaurants in the area. I was on my lunch break and it was a Friday afternoon about 2pm. Absolutely no one else in the restaurant but us and the workers who were absolutely fantastic. Thank you!", "author": "Jazmine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "After a chilly ride on the cable car to walk down the zig zag of Lombard street we were hungry for something warm and filling. \n\nOnce we reached Columbus and Lombard we quickly checked for reviews of nearby Italian restaurants knowing that competition would be fierce and a restaurant with good reviews was bound to do the trick. \n\nWe walked by a couple and chose Piccolo Forno as it looked clean, modern casual and reminiscent of our recent travels to Italy... we knew it was going to be authentic! \n\nThe owner seated us and presented us with a concise 2-page menu in a native Italian accent. We chatted briefly about where he was from, his history in the restaurant business after leaving Italy, first in Toronto and then San Francisco. Apparently he also owns another full service Italian restaurant in the city. \n\nWe ordered a pizza with buffalo mozzarella, arugula and shaved Parmesan. The pizza was thin and crispy with what we could tell were simple quality ingredients. As in Italy it wasn't over seasoned and seemed like a Neapolitan pizza but a little different cooked in an electric oven. The crust was crispy and not chewy as if wood burning. \n\nWe then ordered a side of meatballs which were delicious. The tomato sauce was a little salty but rustic and addictive. \n\nFor our mains, we had 3 pastas, cheese tortellini with a creamy Alfredo sauce, penne with eggplant and buffalo mozzarella with tomato sauce and fresh basil and finally linguine Vongole with a very healthy serving of clams. All were very tasty, plentiful and made simply and light without much fuss as Italian food should be. \n\nThere is no question that this is authentic real Italian food, not NY style Italian American. \n\nThe only heads up is that they do not have a liquor license. You are able to bring your own wine with no corkage fee and there is a wine store right next door although not open on Sundays.....yes, we visited on Sunday! \n\nGreat value for quality, no frills, just excellent food. If you have or have not been, this is what Italy tastes like!", "author": "Jefferson H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-14", "description": "I have to say I was a little disappointed. I chose this restaurant because of its high yelp rating. I even spoke with my waiter and asked for what he thought would be the most delicious dish on the menu. He recommended the veal tortellini which I agreed to and I also ordered a Caprese he salad which is a favorite for me. The Caprese was just so-so. Tomatoes were sliced too thin and the mozzarella was too thin as well. The tortellini was undercooked and still hard, and the sauce didn't have the big bold Italian flavor I was going for. \n\nThis would be a better choice for someone who just wants a slice of pizza. The premium dishes were a disappointment. \n\nThe service was good and the place was nice, but that's about it for highlights.  \n\nThe owner just messaged me and said I don't know what I'm talking about. That is terrible. \n\nI am now lowering my previous review of 3 stars to 1 star.  There was no malice in my review. It was honest. Now I am really disappointed that I ate there.\n\nThis owner just won't quit digging a hole for himself.  He just sent me this message:\n\ngiuseppe t: steve .u are rong ,I'm mast say ,the really italian place never put balsamic on caprese ,only american to that,, you can put zero star too ,I'm really don't care ,,u rong ,,have good day", "author": "Steve W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-26", "description": "Tasty pasta dishes - beef meatballs with spaghetti and all'arrabbiata spaghetti medium spice; my kidos devoured it! I enjoyed a GF pasta carbonara. Was thrilled GF was an option. If you are visiting Coit Tower it's a quick 10 minute walk. There is no wine menu but you are allowed to bring your own wine without a cork fee. There is a liquor store across from the park! Cheers. Good food and hospitality. Local vibe.", "author": "Erica M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-26", "description": "This place has good reviews, so we checked it out. Friendly staff. The Caprese salad was the tastiest part. Good seasoning, the capers added great flavor. I ordered chicken fettuccini Alfredo, and it was very watery, and the cream sauce wasn't too flavorful. I asked for a side of red sauce, which was much better tasting than the cream sauce. I wonder what the pizza is like.", "author": "Ashley A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-31", "description": "I ordered some dishes to go and the owner was nice and the dishes were surprisingly tasty! I ordered the meat tortellini with meat sauce- LOVED this dish and wish it was on the regular menu. It was hand made and the meat sauce was really tasty. They even shredded some nice cheese on top which I appreciated because it was a take out order (they could have skimped on this).\n\nI also ordered a margherita pizza which I thought was just OK. But the fresh bread that came with the meal was great- fresh out of the oven, warm soft and chewy middle with a crusty exterior, perfect with some good butter!", "author": "Jenny H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "Tasty and fresh homemade Italian food -- friendly and helpful wait staff. I had the penne arrabiata and the greca salad (wherever the dressing was, it was AMAZING!). They bring you fresh bread and olive oil while you wait for your entrees, and I really loved the spicy red chili flakes oil you can add to your food to make it spicy. The homemade pizzas looked amazing -- will have to try it next time!", "author": "Deepa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "It's nice to see an Italian place in North Beach that's actually good, very good as a matter of fact. The terrific Italian Homemade Company is just across the street, so maybe this stretch of Columbus is looking to offset the overcrowded tourist traps that lie just down the street. Funny thing was that Jamie W. and I came here on an early Friday evening around 6:30PM and found the place nearly desolate. Odd timing, I surmised, since the place is quite welcoming in an unobtrusive, contemporary way, and diners indeed started to trickle in after us. Owner Giuseppe Terminiello greeted us and generously gave us a table for four as he probably saw us as guys with big appetites. He was right, but we managed to exert some self-control.\n\nI wasn't aware that Giuseppe is also the owner of Ristorante Ideale, one of the few eateries on that stretch of Grant Avenue that serves good Italian dishes worthy of a return visit (review: http://bit.ly/2d5kwK4). The menu here is more casual with an equal emphasis on pizza which is on full appetizing display on the counter (photo: http://bit.ly/2ehdV4h). Still, we were both in a pasta mood, but first, we wanted to try the $12.50 Burrata with Prosciutto and Arugula (photo: http://bit.ly/2dXS8uv). That was startlingly good with the burrata the perfect creamy texture topped with just enough olive oil to make the arugula and prosciutto the most compatible of accompaniments. In fact, the complimentary bread made the ideal vessel for all the goodness (photo: http://bit.ly/2dp8nAF).\n\nJamie's love of meatballs came to the fore with the $13 Spaghetti con Polpette di Manzo, which was a fresh treatment on an old-school classic with the trio of large beef meatballs providing carnivorous satisfaction full of seasoning (photo: http://bit.ly/2e5PpnI). I decided to go for one of their daily specials, the $15 Spaghetti Carbonara, which nicely blended eggs, pecorino and Parmesan cheeses, and cubes of pancetta (photo: http://bit.ly/2ddrlN5). It brought hearty satisfaction in a manageable portion. Believe it or not, we stopped short of ordering dessert even though the menu included the usual suspects: tiramisu, profiteroles, gelato and sorbetto. No, we were strong...at least until we looked at the cannolis at Stella Pastry five minutes after we left.  \n\nFOOD - 4 stars...traditional Italian but given a fresh quality treatment\nAMBIANCE - 3.5 stars...more spacious and a cleaner look than most trattorias in the area\nSERVICE - 4.5 stars...Giuseppe and his crew care about his customers\nTOTAL - 4 stars...this could become a regular habit for us paisans", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "This place has the best ravioli. The owner is from Amalfi coast, Capri. Very authentic ravioli. Totally worth your money. We had the butternut squash ravioli and the asparagus. \n\nThe owner is so kind and almost personalizes the food depending on what you like. He is very open to different kinds of orders. \n\nDo try the ravioli and ask him to suggest because these raviolis were out of the world", "author": "Kruthi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Really good pizza. A friend and I wandered in here on a touristy night in the city and couldn't even tel they were closing because they told us they were still open and treated us so nice. The pizzas were out in 10 minutes and the prosciutto crudo and Margh were fireeeeee. The staff were super cool. Super authentic Italian pizza.", "author": "Arielle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Ate here a few weeks ago.  Very good and reasonable prices.  North Beach has many authentic Italian restaurants and this one of the best.  The location is easy to find and staff was very friendly.", "author": "Phil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Found this place on Yelp with good reviews so we went there today after walking the Golden Gate Bridge. Excellent service and the food was great. We had the lasagna and a pepperoni/sausage pizza. We will definitely go there again the next time we spend the day in beautiful San Francisco!", "author": "Rose A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Found this small Italian bistro while walking down Columbus Avenue with my roommate. He got in to grab a bite of pizza and an something caught my attention while casually browsing the menu. They appeared to have a dessert I used to love when growing up as a kid in Rome. It's a Lemon Sorbetto stuffed in a real lemon shell. The owner said he gets it delivered directly from Italy.\n\nSince then I'm often at this place just to get my Sorbetto. I love the place.", "author": "Luca G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Terrific penne all a arrabbiata. A bit of a wait on Saturday night. No reservations... walk-in only. Bring own wine or buy next door until they get liquor license.  Fast service. Excellent food... fettuccini Alfredo and cheese tortellini with meatballs.", "author": "Shane B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "Simple and positive review for this place. Good food that was authentic, fresh as delicious. Spot was awesome location with a great seat/table right next to the window. Menu was large and full of many great and diverse choices. \nOnly thing holding back a five star was the waiter was overworked, serving all 8 tables at once. The man in the back making salads and pizzas was not as busy and could have helped alleviate the business of the dinner rush. He did after an hour at the end of the meal. Also, there were two tables that got a free dessert at the end of their meal for waiting a little longer for their meal. We waited as well but did not get a free dessert. Not sure why. Maybe noticeably non-locals?\nEither way, I would go back definitely as the food and spot was fresh, delicious and authentic Italian.", "author": "Jon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Amazing food! Very fast service And very friendly! Our friend Pepe is the best he take care very good of his restaurant", "author": "G R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-20", "description": "We went here on Sunday afternoon and ordered the lasagna, spaghetti with meatballs and spaghetti carbonara. \n\nThe lasagna was great. The noodles you can tell are homemade because they're soft and thin and the sauce is just right, not too tangy.\n\nThe spaghetti and meatballs was alright. The pasta was perfect but it was drowning in sauce and I personally don't like that much sauce. The sauce was also too tangy for my taste. The meatballs were good though.\n\nMy sister had the spaghetti carbonara and she didn't like it at all. It had a bad aftertaste and had curdled eggs. She's had carbonara at Buca di Beppo and loved it and even made it herself and it was better then this.\n\nThe service was pretty good. The bread they gave us was nothing like the bread in previous yelp posts. It was really small and hard not a big soft loaf like in the pics. After the 2nd bread refill I think he stopped checking on our table so he wouldn't have to refill our bread again. Lol\n\nOverall it's pretty good. Just order the lasagna and you'll be fine.", "author": "Ashley F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "Food is excellent, very authentic. Owner is super friendly and I loved the Italian music!  Reminded me of my grandma's cooking!", "author": "Mark G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Came here on a weeknight, and was seated quite quickly. We ordered the crab ravioli and prosciutto and arugula pizza. They were both really good, although not mind-blowingly innovative or anything. Just really good quality ingredients and excellent preparation. The ravioli pasta were toothsome, fresh, yet thin, and with great crab flavor and tomato sauce with cherry (or small) tomatoes to add some brightness. The pizza was thin crust, with super fresh dough, and a good balance of flavors between the bitter arugula, salty\\meaty prosciutto, and a fresh\\sweet tasting sauce. \n\nBest of all, it was pretty reasonably priced (maybe $33 for the two dishes, with leftovers)! Not bad for North Beach. \n\nNo beer/wine/cocktails though.", "author": "B Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "We loved this place, felt so authentic, probably family owned, everything was fantastic from the appetizer to the dessert. I don't remember the exact name of the dishes (they need a website, desperately) but we had, appetizer: the bread with mozzarella and anchovies sauce (it was AMAZING, a must). The Pizza Pugliese and the Tortellini ai 3 formaggi as entrees. And Profiterole and Mocha for dessert. Everything was really good, you have to try this place. 100% recommended.", "author": "Jonnathan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "Walking through North Beach while thumbing through Yelp options, we found Piccolo online and in person at about the same time.  Turns out 0.02 miles away translates to \"you are standing in front of the restaurant\".\n\nWhile vacillating over the menu, a very friendly server called us in, walked us through his favorite options, and persuaded us to take a seat.  The service remained exceptional for the remainder of the meal.  In casual conversation, the servers speak with a heavy Italian accent, which was simultaneously charming and tricky to decipher.\n\nThe layout of Piccolo is very open; there's the tables in the front, a display case of all the options, and to go to the bathroom you walk through the kitchen (which you can also see clearly from the table).  There is nothing to hide, of course; just people rolling dough and making pizza.\n\nWe ordered the ideal, $16 with arugula, tomato and a hard cheese.  It arrived in roughly 25 minutes.  Thin crust, so didn't take up much space in my stomach.  After wolfing down my half, still felt vaguely hungry but that went away after a bit.  Ah, the miracles of digestion.  Then, since we were in a bit of a rush, we walked up to the iPad cash register to split the bill and head out.\n\nI don't know if it's the best pizza I've ever had, but a charming meal in a friendly environment deserves at least 4 stars.", "author": "Emily Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "I just ate the portobella ravioli special. It might be the greatest dish I have ever eaten.\n\nGreat authentic place. Amazing food.\n\nI wish I could give them 10 out of 5 stars.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Delicious pizza! Wonderful and friendly staff. Will definitely be back to try the pasta.", "author": "Ilana S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-01", "description": "Boring pizza  the crust was good but the sauce was bland and the \"spicy\" salami was mild.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "Delicious, authentic pasta! We started with burrata, which was super creamy and came with a great prosciutto. Rustic homemade bread with high quality olive oil was complementary. My husband had the sea bass ravioli that was on special and I had the ricotta gnocchi. The gnocchi may be the best I ever had. Definitely top three....and my mom is italian so that is saying a lot. The service was top notch and they also have BYOW, at no corking fee.", "author": "Libbi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "Was craving some pizza and ran across this lil' spot.  Prompt and quick service.  Reasonable prices and tasty food.  You can taste the quality and authenticity in every bite.", "author": "Yadi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "Simple Italian comfort food, relaxing chill ambiance, and very friendly staff! \n\nAffordable yummy pastas. Came for lunch on a Sunday around noon and it was pretty empty. My friend and I were wondering where all the people were since this place has a Yelp rating of 4.5\n\nWe decided to order lasagna and spaghetti carbonara. It was a really nice day and the restaurant had the front door open which let the breeze and warmth of the sun in. Ah...felt great to be sitting right near the door. \n\nBy 12:30pm, the place was filled with people, and majority of them were Italians! All seemed to be speaking Italian with the restaurant staff (most likely owner?). Our pastas were simple but perfectly cooked. each plate was around $15. We ended the meal with tiramisu - omg sooooo good. We gobbled that up in a second and licked every bit of it off the plate. Will be back to try more pastas!", "author": "Rohenne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "Extremely nice people work in here and the food is good. I asked the owner if I could charge my phone inside the restaurant and he gladly helped me. The sauce on the pizza was very light and flavorful. I recommend you eat here. People with warm loving hearts work here.", "author": "Becky G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "It really taste good.  Anyone should try it the pasta and pizza is very good! Service is really personal owner come out with cold water to take your order.", "author": "Roy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Came here last week for a quick lunch with a friend who is a regular here. We shared the Caprese and Vegetarian pizza dough sandwiches and I'm just in love with the bread they use for it! The filling is very simple: tomatoes/cheese, cheese/seasonal veggies but it works somehow. Staff were friendly, I am not sure why some reviews say otherwise. Would like to give a 3.5 but gotta round up for nice people!", "author": "Sadia I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "I am particularly jaded when it comes to most Italian food. Mainly because it's so darn filling. And today's general trend towards avoiding carbs. \n\nI've been here twice and I've got to say, Piccolo Forno makes me appreciate pizza again. Both times we got the Capricciosa and a caesar salad. It was so good the first time we had to have the same exact meal again the second time. The pizza dough was a perfect thickness, neither too thick or too thin and just the right amount of chewiness. The toppings of artichoke, olives, prosciutto, mushroom and a runny egg was such a lovely and unique combination of savory goodness. And extra kudos for serving chili in chili oil as an accompaniment.\n\nBut what pushes this place over the edge is the amazing hospitality and especially of the main guy who seems as though he is the owner. He shared with us his last glass of wine (I hope that doesn't get him in trouble!) after we found out this was a BYOW/B kind of place.\n\nThe second time we went, we were sure to bring our bottle. Next time we will try the pasta.\n\nEach time, there is sounds of Italian being spoken among the people who work there and even among other patrons and that gives the ambience in here an extra special feel.", "author": "S. S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "This is such a great little place! Great service,fresh ingredients and reasonably priced! My husband and I shared a simple house salad of mixed greens,a margarita pizza and the Bucatini pasta- so delicious as well as a beautiful dessert recommended  followed by a lovely cappuccino! While you may bring your own beer or wine to consume,they don't sell alcoholic beverages. We will be back!", "author": "M M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "Cute place. No liquor license, but there is a small wine shop next door where you can buy a bottle to enjoy with your meal. We had a salad, pasta, and pizza. The salad was fresh, but simple. The pasta was delicious. The pizza (prosciutto) had two sheets of prosciutto placed on top, which we had to cut appropriately for each slice, and that made for a messy presentation, but still tasty.", "author": "Robin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Holy cow. Great food and even better service  it's so hard to find great Italian food these days.", "author": "christina d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "The Ristorante Ideale guys opened this new gem on Columbus.  This block used to be pretty sleepy, but no more.  Thanks to Italian Homemade opening, the Petite Deli reopening, & now Piccolo, this block is now wide awake.\n\nA thoroughly positive experience all the way around.  It's very casual, & the staff treat you like family.  The food is authentic.  It's a win-win.  \n\nPiccolo, like Ideale, shines w flavors that are so clean, that cleanliness comes out in a strong way.  That's one of the biggest strengths a kitchen can have.  \n\nThe pizza Diavola was as delicious as ever (it's on the menu at Ideale, too).  Perfectly crispy thin crust.  Sauce like nonna's.  Spicy salami.  Simple, fresh, & quality that you can taste.\n\nBoth neighboring tables ordered the gnocchi.  The aroma was intoxicating.  That scent of uber fresh basil filled me w regret for not ordering it, though I have had it at Ideale a few times.\n\nFabulous home cooking.  Good people.  That's what you'll find here.\n\n5 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "Their service is amazing! Even though they don't have many servers, their attentiveness is superb!\n\nAfter 6pm, they came by and served us complimentary gelato. \n\nDefinitely will be back soon!!!", "author": "Y T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "One fantastic small place! BYOB, no corkage, no on sale license either. \n\nGreat pizza, bread, crab ravioli, etc. \n\nService was by far the best ever!\n\nHighly recommended!", "author": "Mike B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Great pizza and homemade tiramisu! Owner also also doesn't charge a corkage fee if you bring your own bottle, no alcohol sold here but you can bring your own.", "author": "Alejandro S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "Piccolo Forno gets me excited about the future of North Beach eateries. Located a couple of blocks down Columbus from the cluster of carbon copy tourist tarps, Piccolo Forno (along with The Italian Homemade Company) offers a simple and relaxed - yet contemporary approach to Italian dining. \n\nOpen and clean interior gives off a relaxed vibe. No stuffy and fussy service but rather a straightforward and personable approach to hospitality. The same applies to the menu. Pizza slices, calzones, and pasta dishes along with a variety of antipasti and salads. The namesake Piccolo Forno pizza is almost a take on a niscoise salad in a pie. You won't even miss the fact that there isn't cheese on it with the nice combination of flavor between the tuna, artichoke, olives, tomatoes, and egg - it's very tasty. I can't wait to come back to try more of the menu. \n\nPiccolo Forno is a casual Italian eatery with quality food at affordable prices - a departure from places up the street but definitely a win for the neighborhood.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "Chanced on this place, given strong yelp reviews. The place across the street was busier, but the owner talked us in. So glad he did. \n\nFirst, the bread. I could eat this all day, and my youngest was in heaven. Ordered the Arugula salad and Caprese salad, so flavorful. Next, meatballs on the side, ravioli, and the prosciutto and arugula pizza. Just awesome, the crust was so delicious and the sauce was perfect. Finished with gelato and cappuccino. The check was extremely reasonable for the quality and my family of four was stuffed and happy.\n\nWe've visited Italy and the pasta and pizza are hard to replicate, but this place nails it. Don't be put off by the decor, which looks like a graphic designer went a bit overboard, the food is the real deal.", "author": "Dave G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "Lovely place and original Italien food, friendly staff! Small but fine place to enjoy ur pasta, pizza :)", "author": "Sam I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Fabulous local place. Everyone was speaking Italian. My ravioli dish was perfectly cooked and our waiter was so warm and friendly and welcoming", "author": "Heather L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "The food was amazing!  This place is fun and the staff is friendly and very helpful.  Everyone's dinner was delicious, even my gluten-free pasta which can be questionable sometimes.  This was exactly the kind of experience we were looking for.", "author": "Kyle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Some of the best Italian food I've ever had.\n\nI got the Lobster Ravioli - stuffed very nicely and the pasta, sauce, and filling was very obviously fresh and handmade. Very good.\n\nMy dad got the Crab Ravioli - a little less stuffed than the Lobster but still amazing quality and taste. I personally prefer lobster but if you're getting multiple don't rule this out. \n\nMy brother got the pizza with tuna and onions. I would never order it but it was surprisingly good. Everything was fresh tasting, I think I just don't like tuna. If you do it was very well made though.\n\nThe salad was very good, I'd ask for more vinaigrette but it was very fresh.\n\nThe margherita pizza was fairly standard but perfectly executed. One of the best crusts and sauces I've ever had.\n\nService was excellent, you can tell it's a small place and everyone is very friendly and Italian too. Very authentic feel.\n\nIf I was in town again I would come back for sure. Definitely check this out if you're in the Bay area.", "author": "Bruce W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "This is I think the best Italian place...the food are amazing and the prize are modest... people are super friendly and ultra available..guys try the tiramisu!!!", "author": "Federico F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-07", "description": "With all the positive reviews,  I was looking forward to some good Italian. First, I ordered a slice of cheese pizza.  Unfortunately, it was bland and wished I got a slice from Golden Boy instead.  I ordered the cheese tortellini in marinara sauce.  Again, it was bland but even worse the pasta was overcooked and mushy and tasted like a can of Chef Boyardee.  I know I am being harsh and perhaps I came on a bad day but for the price, it was sad.", "author": "avi a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "This place excellent. Ive been looking for a place like this for a while. It reminds me of my honeymoon when I got to go to Italy and had my first real Italian meal  (instead of the Chicago style I grew up with, which was still good but different and heavier tasting). The burratta was one of the best things I've had in a long time and the ravioli had this light fresh acidic tomato sauce on them. Honestly think it's better than Italian homemade across the street.", "author": "Sylvia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Absolutely delicious! You may have to wait a bit for a table but trust me it's so worth it. The pesto is the best I have ever had, also the tiramisu is SOO GOOD. The owners are so friendly as well. T was overall an amazing experience. I will for sure stop by next time I'm in San Fran!!!", "author": "Ana H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "Earlier, before dinner, he showed me a picture of us from nearly 20 years ago. He said that it was taken on the first day we met. My first instinct was that dated me, I did not like to look at me when I was in my prime. But wait, on second thought, I should, and it seemed that I looked exactly the same, hiding behind sunglasses and hat (I'm that vain, yes.)  Perhaps because staring at my old self smiling back me made me hungry, we went to fetch food.\n\nOwner is italian. He told us that this is a 2 and half weeks old restaurant. It felt very European. I did not catch the owner's name, who greeted us warmly.  We did the dine in version vs. take out.  My companion used to run a Yelp like site before there was Yelp. I think it's because he's extremely observant, often have smart things to say about anything that interests him, and he's a people person. I'm not a people person. I'd like to eat in peace and not talk. He observed that the owner was in a talkative mode. \"He could tell that we were locals so he chatted with us.\"\n\nI liked the ambience of the new place. It felt neighborly, local, even though it's just a block away from the tourist trap. The restaurant appeared to be easy on the eyes. Whatever they did, it works. \n\nI could see that the owner was making a caesar salad in the kitchen. He tossed it by hand. Just enough times so that the lettuce could stay crisp, yet the dressing was mixed in. Interesting technique. \n\nThe counter displayed a wide array of premade pizza and things. A man who appears to be a local worker stopped by to order a piece of pizza. The owner told him that it's free, it's getting to be end of the day, clearly they know each other, and he was being very generous. So incredibly kind. You don't see that often enough. \n\nThe salad arrived with the pasta. It's all freshly made. The meatball was crunchy outside and soft inside. The pasta was al dente. If you google spaghetti meatballs, the google image would show that dish. Their pasta is stock image ready. The caesar salad had just enough anchovies, which is my favorite thing in a caesar. I think it is most likely the best I've ever had. Most of the caesar salads we eat in America is ladled with dressing. This one was light and intense at the same time.\n\nWhen the bill came he went, \"Wow.\" I asked why, he said that it was very inexpensive. I did not offer to pay. He won't take my money anyway. But I'm glad I was not the usual expensive date for once. \n\nThat evening was full of surprises. I received my belated birthday presents from him, I had not anticipated anything really; I saw what I looked like nearly 20 years ago and I had not really changed that much at all, except I think I'm more in shape now even though I was not out of shape before; I had met the owner of this neighborly restaurant who is kind, ernest, and talented in the kitchen, which proves to me good people are still around; and I finally found a caesar salad I liked...\n\nWelcome to the neighborhood. Please stay.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Great food! Worth the wait in line! I highly recommend this place if you like Italian food.", "author": "Jonah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Second time here and it was just like the first, exceptional service and food. Kids live the pizza and Caesar as well as their Italian sodas. Burrata was amazing. Spaghetti a la carbonara was the best as well as there fettuccini Alfredo. Something unique about the place is that they do not serve alcohol here but welcome you to being your own bottle of wine and they will bring you glasses with no corkage fee. A place we will continue to visit every time we are in the area.", "author": "Dario G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "Amazing pizza!!! Super fresh and extremely tasty!!! Stumbled across this place waking to somewhere else and stopped in!  So glad we did! Bring your own wine!! Delightful! Great Service too!!!", "author": "Dre D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Came after a full day of sightseeing and little eating. Perfect find. It is small but we were greeted and seated right away. Welcoming and friendly service. Felt right at home in this casual atmosphere. They don't serve liquor but we were kindly informed there is no corkage fee and wine is sold next door.  Gnocchi, lasagne and pizza were all delicious. Desserts (tiramisu and panna cotta) were amazing.  Not super fancy, super good.", "author": "Kere V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Came here after a visit to Coit Tower. 15 min walk all down hill. Arrived at 5:00pm, greeted very warmly. Staff authentic Italian. Food superb. Tables filled early by both locals and tourists. Recommended highly.", "author": "David O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "We are  up here in San Francisco on vacation and have decided to order some Italian food there about a mile and a half away if you try to have them delivered to your hotel I recommend you ordering ahead of time way ahead of \ntime. We've decided to try the Philly cheesesteak and also the chicken cheesesteak the food was excellent.  Even order the cheesecake which we haven't had to yet but it does look delicious. I do recommend you going to eat or get it to go and bring it back to your hotel or home I know what we had is an Italian food but it's totally worth it was delicious.", "author": "R B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "If you're looking for authentic Italian this is definitely where you should be. I'm from New York City and they could put some Italian restaurants in New York City out of business. The fresh ingredients and great customer service are what really make this restaurant absolutely amazing. You can definitely tell it's a family owns and operated business. The hostess/waiter was very genuine and funny with his customers. Across the street is The Italian Homemade Company which I've eaten at before and Piccolo Forno is definitely a better restaurant. The price is very reasonable as well. Don't waste you're time anywhere else. I'll definitely be back again.", "author": "Imani M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "Buonissimo!!! Fresh pasta make it in place and very friendly staff. A taste of Italy in the heart of North Beach. You will not disappointed!", "author": "Gaetano B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "We had amazing service and food at Piccolo Forno! We would highly recommend to any friends visiting that want delicious Italian food!", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "I ordered the pizza with artichokes, olives, prosciutto, and egg. This is a city with truly phenomenal food, and this pizza was exemplary. More, the staff were genuinely kind and really cared about your experience. Cannot recommend enough!", "author": "Anna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "Delicious pasta, and the price is just right. Warm atmosphere. Life advice when you need it. Italian being spoken, and Spanish. Many neighborhood elderlies stop in to chat with the servers, which makes it feel so homey. Love this place, it's very comforting and they let me sit and draw and chat for as long as I please, make me cappuccinos to go, check on my often. This is my neighborhood cozy spot and it never gets so busy that I feel harried or like I'm being ignored. The only thing missing is they don't serve alcohol, which I'm hoping will change soon so I can enjoy a glass of cab with my pasta. Regardless, I love sending people this way when they ask for my recommendation as I work in the neighborhood. Ti amo Piccolo Forno!!!", "author": "Justine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "Best Italian restaurant I've been to since Italy.  Pesto special was perfection, and vegetable dish was perfect.  Great service, will definitely be here again.", "author": "Gregg P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "This place was so good I came here two weekends in a row! My favorite dish was the lobster ravioli (AMAZING), but the crab ravioli and arrabiata were delicious as well. The interior is super cute and cozy and I appreciated the modern art on the wall. The server speaks with such a thick Italian accent that I felt like I was in Italy. :) I wish I hadn't been too full for dessert!", "author": "Elyse W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-05", "description": "Piccolo Forno just opened a few days ago, and I tried it out for lunch today. With the Italian Homemade just across the street, it's great to see North Beach moving farther north.\n\nI had a slice of the mushroom pizza and two supplis (fried rice balls). The mushroom pizza was pretty good - the crust was thick but crispy. Similar in style to Golden Boy, but thinner and crispier. The sauce and toppings were tasty as well. The owner mentioned that they're expecting a new pizza oven from Italy soon, so perhaps the pizzas will change a bit when it arrives.\n\nThe supplis were very interesting, and I had not tried them before. They appear to be fried risotto, mixed with bolognese sauce and parmesan cheese, then breaded and fried. They were very tasty. Although they heated them up for me when I ordered them, they were still a bit cool in the center.\n\nOverall, Piccolo Forno is a nice addition to North Beach, and I'll definitely be back.", "author": "Allen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Really, really nice place for lunch on Columbus. The service could not have been friendlier, (wisely) treating my two kids as any other customers. I wasn't sure who was happier to get to speak Italian: the waitstaff or my kids, who had been to Italy for a few weeks and missed the food and culture. The pizzas are all excellent, as is the Burrata w/Prosciutto appetizer. I'll definitely be back here, and not only for family time.", "author": "Aviah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "Absolutely love this local gem. The food is amazing and very reasonably  priced, the staff is warm, friendly and attentive. Best part: bring your own wine with no corkage fee! I visited twice in one week and will be back many times. Grab a table near the front if you run warm as some heat does come off the kitchen from the pizza oven.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "The owner was incredibly friendly and the food was great! We had a baptism planned down the street and needed to do a simple party for a group of 17. The owner went out of his way to fit us in to this small quaint restaurant and we felt so special. Food was excellent and the atmosphere was clean and lovely! Loved it", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "For under $6 I got a tasty corner slice of pizza with egg, olives, tuna, tomatoes, and I think mozzarella. Crispy but chewy, and bursting with fresh tomato.\n\nWhen you walk in, there is a display of all the food options, and the staff is so friendly. The owner,m and chef, who is from Capri, chatted with me and even brought me extra utensils and napkins. There's also wifi - just ask for the password.\n\nWould definitely recommend!", "author": "Grace Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "I had the margarita pizza . The dough was so light and airy. The sauce was simply delicious and mozzarella was fresh . The complimentary bread was to die for ! Airy and a little crunchy on the outside ! Wow one of the best bread I have had . Next time I visit I have to try their pastas and salads . I kept glancing at my neighbors food because it looked an smelled so delicious ! Ahh can't wait to come back and visit this warm and friendly place that has amazing food. Thanks for the great service !", "author": "Jamie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "Super authentic Italian place. Fresh fresh pasta, trendy atmosphere, and phenomenal personal service. Italian owner is passionate about his restaurant and very friendly.\n\nFood: Best Fettuccine Alfredo I've ever had. Margherita Pizza was also delicious.", "author": "Kaz H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Hands down best ravioli I ever had! I had the special of the night portobello ravioli and the sauce was to die for. Service was great. Ambiance was excellent, very clean. Will definitely make it back here when I'm in town!", "author": "Michael B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-14", "description": "So came to the Chinatown Moon Festival event and wanted something to eat. Chinatown was packed with people and kind of wanted something different, so decided for Italian. So went to Yelp and was looking for something for a high rating, found Italian Homemade Company and this place which was right across the street. So it was going to be one or the other.\n\nI went to Italian Homemade Company and seen as I stated in their rating all they had were stools inside, meaning not kid friendly. The table and chair option was only outside, didn't want to sit outside and smell the people walking by.\n\nSo I came here and ordered the special of the day and my partner ordered a classic dish. We were given some fresh baked bread with some olive oil, would had like some balsamic vinegar too but didn't have. \n\nWhen the plates came I thought it was off the kids menu, until I thought about it. They didn't have a kid menu, and if they did how small would be the portions if the adult portion was already kid size. So the staff already noticed we were happy with the portions and asked if liked more bread. Of course we did, but the bread the second time around was stale. Most likely day old bread not even reheated. \n\nThe pasta was good, nothing special other than the small size considering the price.", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "AMAZING Italian food. Everything was freshly made and hot as the food was brought out. Ordered lasagna, fettuccini, margherita pizza, and caprese salad. All were amazing. Definitely will return on the next trip to SF!", "author": "Ainoki T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Best Italian food I've had. If you're looking for pasta that makes you feel like you're eating in Italy, then this is the place for you. The staff is super friendly and the service is impeccable! Highly recommend it.", "author": "Tanya D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Fantastic!  We were searching for an Italian restaurant and were starving.  We read the menu and grabbed a table.  The service was great, friendly servers and fast service.  The 4 of us had 2 arugula salads, a pizza and mushroom raviolis.  The salad was fresh with a delicious vinaigrette.  The mushroom raviolis were rich with a creamy sauce, they were incredibly rich so it is a good idea to share them.  We had the ideale pizza which was perfect.  My husband ordered the lemon tart which was divine.  Trendy, casual and fun atmosphere.  We will be back!", "author": "Kathy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-06", "description": "This is a good and unpretentious Italian restaurant. I stopped by one night with a friend for a prosciutto and arugula pizza and spaghetti with meatballs. Both were very good and had a homemade, comfort food taste to them. It was more typical of what you will find on the East coast than here in SF. The owner is a real Italian and was very friendly. I will definitely stop by again when in the area and might take a trip there even before that. I highly recommend the pizza.", "author": "Tim Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "This is an AWESOME quaint authentic Italian restaurant. Found it on yelp while roaming around SF and they grabbed a 2nd table so we could sit four of us outside to enjoy the walk by people. SUPER reasonable prices.", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Great place!!!! Food was on point and dessert was delicious. The guys working there are very friendly. I will definitely be back to this place every time I want Italian and I am in the city", "author": "Ralph Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "Incredible. I would take this over any other \"Italian restaurant\" any day. Spaghetti is fantastic! A really cool/chill atmosphere yet feels like you're at a family owned joint. Which, you probably are. \nYou'll regret it if you don't stop by!", "author": "Brexten P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "Very good Italian place. From pasta to pizza and everything in between. We had the 4 cheese pizza, chicken Alfredo and stuffed ravioli. Delicious! You can tell it's a little mom and pop place with great food! The previous reviews led us here. Great choice!", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-25", "description": "Based on the reviews we were expecting great food . Unfortunately the food was so salty . We ordered spaghetti& meatballs , and lasagna ... \nmaybe we came on a off day? However , the lasagna was watery as well, possibly because they did not drain enough ? Either way ... wasn't worth the $$. Two stars because the service was quick", "author": "Cool C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-23", "description": "Me and my friends went here two weeks ago. We deceived to eat here, because of all the positive reviews. At our arrival the waiter told us that we have to wait for 15min, apparently the tables were reserved for someone, but nobody came. \nFinally we got a table and ordered our meal.  We ordered two Spagetti carbonara and one Spagetti with meatballs, but what we got really disappointed us. The meatballs were frozen in the middle, the carbonara weren't only drastically different sizes but also the sauce looked more like scrambled eggs than a creamy sauce. Honestly, this is not acceptable for an Italian neighborhood! Wouldn't recommend!", "author": "Bunmi A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-28", "description": "I think the biggest thing that turned me off was a meat slicer with a slab of meat on the slicer that was next to the sole bathroom. Mushroom ravioli was ok, but almost anything with truffle oil is tasty. Pizza is about what you can get in any one of the fast fired pizza chains- pieology, pizza rev, mod pizza. I.E., nothing special", "author": "Cyndi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-21", "description": "I came across this place while visiting SF for business.  Charming place, mainly local Italians eating and hanging out speaking in Italian adding a great atmosphere to this little place.\n\nI ordered the Burrata appetizer which was incredible. I also ordered a margarita pizza which I was not so thrilled about the crust. However, that said the man I presumed to be the owner noticed I only ate one slice and was not interested in taking it to go. He apologized that it was not to my liking and refused to let me pay for it. I offered to give me something else but, honestly I was already full from the burrata and prosciutto salad and the basket of awesome bread. Had a nice double espresso to finish the lunch. Overall, was a great experience.\n\nI would go back again and recommend others to give it a try.", "author": "Ariel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "Love, love, love this place! We came here the other night for my friends birthday and everything was wonderful. Not only was the service amazing, but the atmosphere was so cozy, and the food was delicious. Will definitely be coming back here!", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "I always thought authentic Italian pizza would taste bland because of how simple it looked, I was DEAD WRONG. This place truly brings out the flavors in each of its ingredients, a pizza margherita tastes more than just \"cheese, basil, and crushed tomatoes\" I don't know how to describe it other than the flavors run deeper than most simple pizzas I have ever eaten. \nThe owner of the place is incredibly friendly and engaging with his costumers, he actually lured me in when I was just passing by, and I'm glad he did.\nI will be back whenever I visit SF!", "author": "Crystal N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "Fantastic food, fantastic ownership!\n\nGreat pizza, amazing ravioli and  tiramisu!!\n\nThe owner was very friendly and was the nicest guy", "author": "Dan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Pastas or delicious pizza is great so convenient and close to my house have eaten there four times in the past three months . Staff is so Italian polite charming and amazing!", "author": "Reneè S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "Here's a place so authentic, you feel as though you were casually dining on a side street off some quiet Roman piazza. It was intimate yet at the same time lively with conversations from other tables in Italian. One small child at the table next to ours was quite indecisive about his seat and meal, but overall pleasant and mannered. It simply added to the comfortable and laid back atmosphere. Giuseppe was an amazing host.", "author": "Teera G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "We were in the city visiting family and came here for dinner. Everything was amazing. I had the Gnocchi and my husband had the best Spaghetti and meatballs. The Caesar salad was perfect also! Will definitely come here again, next time we are in North Beach!", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "This place is amazing! The lobster ravioli is out of this world and I haven't had better gnocchi anywhere in sf. Bring your own wine, no corkage fee and settle in for some mouth watering pasta!", "author": "Stephen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "The food, the service, the quality overall - 5 stars!\n\nOur waiter (presumably the owner) was welcoming, attentive, and carried a very charismatic demeanor which made our dining experience even more enjoyable. \n\nThe chicken fettuccini alfredo was the best I've ever had... no exaggeration. \n\nNote: they do not sell wine, but go ahead and ask the owner about your options. He will not disappoint!", "author": "Lexy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "This place is ridiculously good, reasonably priced, and the owner is a great guy. The only minus is the pizza by the slice (rectangle) is not the same crust as the pizza if you buy a whole pie (round). The latter is awesome, the former is just ok.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "Giuseppe is probably the most genuine guy in north beach, I love their pastas  also the portions are nice , affordable price cool environment, I strongly recommend this spot is one of few authentic restaurant .", "author": "Nicola C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Ohh yeah. This is a great place. The pizza by the slide tastes like the authentic pizza al taglio back in Italy. So good!!!!!!!\nI ordered some pizza and a coffee and the waiter told me: but the coffee for after you have finished the pizza.\nYeap. That's how things should be served, not just the coffee together with the pizza.\nFantastic.\nA must try for anybody going to north beach!!!", "author": "Luca R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-08", "description": "Wow! Delicious pasta and pizza at a very reasonable price.  Tasted fresh and highlighted the flavors in true Italian fashion. Not over sauced or over salty, just basic exceptional food.", "author": "Joana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-20", "description": "Small cute, clean restaurant with Amazing food!! Everything from the salad to the spaghetti, the pizza was Delicious!!!! We had the homemade sausage & mushrooms pizza and we loved it! They do not serve wine or beer, but we picked some up about a block & half away and the owner allowed us to drink it with our meal. Believe me you will not be disappointed! Prices are good and the food is authentic yummy!!", "author": "Lisa V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "Fist off, bring your own bottle of wine. They do not sell any but also they do not charge a corkage fee. Small and some what intimate, with extremely friendly service. The food was fresh and delicious. We had the insalata mista, arugula with pecorino, pasta puttanesca and spaghetti with meatballs. All was delicious. We enjoyed ourselves tremendously.", "author": "Waylon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "Bravo Piccolo Forno! I've come here about 2 times in the past two months, because it's my boss's favorite place near work. I have to say, I was not disappointed in the least! The first time we went, I had the Crab Ravioli in Salsa Rosa, and it was absolutely wonderful. The second time, I had Cheese and Spinach Ravioli in a olive oil and parmiggiano dressing. As you can tell, I'm a softy when it comes to Ravioli... Both dishes were so simple yet so satisfying! We ended both meals with a homemade Tiramisu (my favorite) and a shot of espresso!\n\nMille Grazie for the great service and even better food!", "author": "Maria Francesca A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Solid place excellent ingredients. Price point is about average with the surrounding area but highlight is the comfortable atmosphere. Not pretentious, doesn't try to impress people with fancy food, food is simply made and delicious. Had beef lasagna and margarita pizza. Super fresh.", "author": "Raymond F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "I ordered the Fettuccine Alfredo to-go and waited outside for 15-20 minutes which was understandable since it was very packed and busy. The fettuccine was perfectly cooked with the right amount of white sauce and chicken. They also gave me bread on the side but it was too hard to chew. Reasonable price and one of the employee ran to give me my order since he saw me walking away. I would return to this place again.", "author": "Kathy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "What a great authentic Italian food! \nI went to sushi restaurant next to this place and walked in to get a coffee. They had a really good pizza and roast pork. The owner was working in kitchen and they make their own bread too. Even coffee was delicious! !!!", "author": "Jiyoung L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Spectacular local Italian restaurant.  Informal, very personable and sauces to die for!", "author": "john w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "Visiting SF on business and dining alone. Wanted a place casual enough that a solo diner would not feel out of place but with good food. Found this place on Yelp. It was exactly what I was looking for. The place is small with about half bistro tables and half bar-height tables. Atmosphere is casual bistro - you might almost mistake it for one of those fast-casual chains where you order at the counter, but it's not and the service was excellent. The staff all speak to each other in Italian so you almost feel like you've stepped into Italy. Even the young couple sitting next to me were Italian so I figured it must be good! The waiter brought out a partial loaf of delicious bread, crusty outside and flaky inside, with a large bowl of olive oil for dipping, and a bottle of (tap) water. My Greek salad was delicious and my penne all'arrabiata was perfectly al dente and pleasantly spicy. Tira misu was just right. And the prices were very reasonable - especially for SF. Only giving 4 stars because I didn't think the pizzas looked very good which is half the menu, and because the waiter neither offered me fresh pepper for my salad nor Parmesan for my pasta. But overall it was an excellent meal and I'd definitely go back again.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Great place, real Italian food. Got the Classic Calzone, was just plain Italian goodness. Waiters are really kind and precise about your order to get it just the way you want. Highly recommended.", "author": "gabriella c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "Fresh and delicious !!\nArtichoke ravioli is one of a kind, egg pizza was a fresh take\nVery recommended !!", "author": "Liron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "I see people poke their head in and keep on walking and I want to tell them \"hey, hey, stop, this is the best spot you'll find\" but I'm always too busy stuffing my face with pizza - this is the kinda place where I order pizza and then pasta. Carbo load but this place makes it worth it. So the food is great but so is the owner who makes it a habit to say hello and welcome you. I don't know of any other restaurants like that, do you? If so I want to hear about them, that's where I want to be putting my money.\n\nOn to what to eat. I start with a slice of the vegetarian pizza and then do the butternut squash ravioli - it's literally the best I've ever had. I'm a meat lover but I go veg when I come here. My boyfriend always orders the puttanesca which is also so good.", "author": "Reyna F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "Another low key but super reliable local establishment. In the sea of so-called Italian restaurants along Columbus, Piccolo Forno has proved itself not to be a tourist trap but with awesome home styled delish dishes.\n\nThe atmosphere's like a modern bistro but without crazy prices. \n\nAnd when you're there, say hello to Giuseppe. He always recognizes the locals and offers interesting dishes. I'm glad they're in the neighborhood and redefining \"Italian\" in North Beach.", "author": "May W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "Piccolo Forno is a gem Giuseppe and his staff are hard working people always with a smile and ready to joke \nFood is excellent I love them!", "author": "Elisabetta A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "*Excellent Service, Excellent Food, Great Location in North Beach*\n\nI found it on yelp...5 stars and 32 reviews...they have only been open for 7 weeks!  The hubby and I ventured out and it was so worth it!\n\nORDERED:\nMargarita pizza\nMushroom and beef gnocchi\nBeef Lasagna\nRaspberry italian sodas\n\nThe the lasagna was so good we were playing tug-of-war with it.\n\nThe servers were sweet, responsive, patient.  I felt like family a little bit!\n\nDefinitely worth a shot if you're in town.", "author": "Rimi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "It's little Italy - the ambiance, and the owners; super auhentic. Excellent pasta. You get wine from the store next door. Tortellini, Gnocchi, and Artichoke Ravioli are all excellent dishes. Special shootout for Artichoke Ravioli.", "author": "Sai M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "Went after seeing the Summer of Love exhibit and it was just perfect. The owner is charming and funny and his food is fantastic. My husband and I enjoyed pasta, salad and dessert and our bill was incredibly reasonable for the quality. We live in Napa and would venture again to the City just to eat here again.", "author": "Emilia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Solid spot. My spaghetti and meatballs was seriously on point. It has a casual type of feel to it but they are sweet and the food speaks for itself.", "author": "Rouz E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "My husband accidentally found this place when we were walking through North Beach on our weekend urban hike.  \n\nThe restaurant was new, clean and modern, yet cozy.  The kind and friendly waitress named Julieta greeted and seated us at one of the high tables.  She immediately told us about the pasta of the day, which sounded all delicious.  \n\nWe started off with the Greek salad (romaine lettuce, feta cheese, red onions, tomatoes tossed in olive oil and balsamic vinaigrette).   This was super tasty and fresh! \n\nMy husband got the margherita pizza that was freshly made out of the oven.  The pie was thin and perfectly crispy.  It was simple, but good flavor.  \n\nI had the spaghetti with meat sauce. The pasta was cooked al dente.  The flavors were well-marinated and it kept well when I finished the other half to eat at home.  The portion was pretty generous.  \n\nOverall, this is a great place to sit down and enjoy a good meal without waiting for 2+ hours for the other well-known Italian restaurants.  The prices were very reasonably too, which is always a plus!  \n\nA quick shout out to our adorable waitress, Julieta, she was attentive, kind, caring, and took care of us well.  If you read this, we loved your Argentian accent!  (Can you read a book next time we visit)?  \n\nWe will definitely come back soon!  Cheers and XO.", "author": "Deborah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Cosy local restaurant . Friendly and fast service . Food was great . We ordered Pizza and Pasta both very delicious and homemade style . Highly recommended.", "author": "payam b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Pizzas are really good and the service was very welcoming and warm. I had a great dinner and I will come back for sure.", "author": "Monika B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-26", "description": "Nice owner (I assume) but meh food. Worst Caesar salad ever plated. Antipasto had no flavor at all. My son liked his sausage pizza and my lasagna had a good flavor. I can't imagine a city like San Francisco would allow such an establishment to flourish in a town with such stellar Italian food. Someone is asleep at the wheel. I honestly feel bad leaving this review because the owner or manager was so nice but the food needs work.", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Haven't been to any other spot in SF that does thin crust the same way. Super thin, Crispy on the bottom and cheese melty on top.  \n\nJust how it should be done, pasta, pizza and espresso in the same sitting. \n\nThe small team that works at Piccolo Forno could not have been more welcoming. They obviously care how everything is tasting and how our experience was shaking out- Has the warmth of a friendly neighborhood corner and the heartiness of a family dinner all in a modern shop. \n\nWill take all my pizza lovers here.", "author": "Gabrielle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Wonderful spot! Just stopped in on a whim as I was heading back to my hotel. I ordered some pizza and ceasar salad w/chicken as take away. Great service and concern to be sure I was happy with what I ordered! Thank you guys!", "author": "Barry M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "Excellent food. We ordered chicken alfredo and a pesto pasta special. Yum. Near perfect service.  Highly recommend.", "author": "Chelsea M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Stopped by for a quick bite and it was amazing! Definitely recommend, prices are great and service is wonderful.", "author": "Vivian G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "The staff is rude, but the food wakes your senses up!  I'm truly amazed by the pizza and gnocchi.", "author": "Avinash R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "Wow! This little restaurant is authentic, delicious and fresh. Everyone (including the kids) loved it! \n\nMy family's reviews: the pasta with spicy red sauce was amazing and the Pizza Margherita was excellent. The owner was incredibly kind and accommodating with my dietary restrictions: he created an amazing dish that avoided things I can't eat (which says a lot, considering I am a gluten and dairy free customer eating Italian food). The result was divine: gluten-free Fettuccine with mildly spicy olive oil, garlic, spinach and herbs. Yum. \n\nWe will be back.", "author": "Laura N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Came here with a bottle of wine, left with a full heart and stomach. Giussepe, the owner, was super friendly and the food was top notch. Great prices, great flavors and great times. Looking forward to my next time back :)", "author": "Mike J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "BYOW - bring your own wine! The restaurant doesn't serve wine or beer but you can bring some in. We split the spinach and cheese ravioli with beef ragu and the calzone with ricotta and some kind of meat (I forget -- too many beers at the Giants game earlier). Both were so good. The calzone was a surprise hit for sure, and they serve it with spicy olive oil. YUMMMMM. Come here hungry and leave feeling full plus slightly drunk. Win-win in my book.", "author": "Caitlin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "They've brought real Italy to us!  Lovely lunch, never rushed, Owner rocks and the special of the day \"Halibut on Eggplant\" was amazing! 2 of us shared that & the anti pasta platter that Owner let us select what we wanted. And so comfortable there that 12 noon luncheon & fun chatting ended at 3pm! I wish they had a beer/wine license but hopefully someday they will (City moratorium) but he said we can bring our own for a minimal corkage. My Genovese self is going back soon with my Vino for dinner and back for a great lunch. It was like being in Italy without jetlag", "author": "Judi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "This food here is vary authentic and feels like Italy.  Excellent service and fine quality ingredients. If requested they can make your pizza cracker thin.  Try it!", "author": "steve o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "Great food! Only four stars because the dishes are a little small (I understand they make everything by hand and it takes forever, plus Americans are used to huge portions, but still disappointing). The food was amazing!!! They don't have a alcohol license, but you can buy wine next store and they don't have a corking fee! The squash and artichoke ravioli were so good!", "author": "Meghan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "First customers there, Great service. Very friendly as soon as you walk in. Feels like a legit little taste of Italy. Definitely would come back again! We also got some ice cream on the house which was also amazing!", "author": "Layla D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "We found this place by accident and so glad that we did!! Had such an amazing dinner!! \n\nThe restaurant is small and very cozy, and the staff is extremely friendly. The staff makes you feel very welcome and like family. We were immediately greeted and seated. We started off with 2 Italian sodas (ginger beer, chinotto). After much debating we decided on the house specials (gnocchi and carbonara) and ordered a side of warm foccacia bread. Our dinner came out fast, and hot and oh my it was DELICIOUS!! So fresh and light, pasta was cooked perfectly and seasoned to perfection. The gnocchi was light, fluffy and melted in your mouth. We just about licked our plate clean.\n\nWe were so stuffed, but since dinner had been so good we had to get dessert. Our waitress recommended hazelnut coffee cake (tasted just like the Ferraro rocher chocolates) it was amazing and the lemon gelato was light and creamy. \n\nLooking forward to coming back and trying the pizzas!!", "author": "Annelise G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "If you're looking for authentic Italian food, this is a must. Food is great, service is great. I eat here every week more then once!!", "author": "Jimmy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "There are few Italian restaurants that know how to make home-cooked, authentic Italian food. This is one of them, and it's fantastic. The Italian owner and chef is friendly and makes fresh pasta and pizza that's some of the best I've ever had. Highly recommended.", "author": "Eric G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "Great food and freshly made! The 1st guy wasn't so pleasant and friendly but when the owner got there, he was definitely the light of party. Very social, welcoming and just seemed to be very outgoing. The calzone was ENORMOUS, i literally cut it into 1/4 & fed my family of 4. The parmesan cheese was freshly grated and the & pizza was yummy! My FAVORITE thing and most flavorful thing were the raviolis by far. Good, fresh, Italian food.", "author": "Deanna D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "Everything we tried here was delicious. We tried the lasagna, the gnocchi, tortellini, and pizza.  It was like being back in Italy.  The marinara and bolognese sauces are perfection!", "author": "Mauri S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "A terrific little Italian restaurant. All the dough is made fresh, the sauces are terrific, the pasta has the right texture,  the bread is incredible. Just amazing well executed food at a great value by SF standards. A definite recommendation to anyone visiting the North Beach area. \n\nHard to beat", "author": "Ajit K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "I can't say enough about this place! We brought our whole bridal party here the night before our wedding and it was one of the best decisions we made. Everyone raved about the delicious food, amazing service, and wonderful ambiance! Giuseppe was so great to work with, he helped us accomplish exactly what we wanted for our casual rehearsal dinner. It was casual but still very authentic and so much fun. This will be our new go-to restaurant in SF!", "author": "Kimia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "Amazing Italian. Having lived in Italy and Brooklyn, being raised in an Italian family in the food business, I usually hate Italian food in America. But this place is AMAZING. Fresh. Authentic. Cuts no corners. We got the arugula salad-incredible. Pizza: half anchovies and half tuna-delicious. Made fresh. Crust was crisp but not too thin. Perfect amount of toppings. Dessert: profiteroles-perfect! I will be coming back. Owner came straight from almafi coast, so sweet and genuine.", "author": "Xena F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-10", "description": "I'm from Chicago and in my opinion, the food here is really not good.  We had a margarita pizza which was mediocre at best.  The alfredo had limp noodles that were more like an egg noodles than fettuccine, flavorless sauce and barely any chicken, and the lasagna was soupy.  I don't recommend.", "author": "Julie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "Walking back to our hotel and we smelled Pizza!  Yelpers gave this place a good review. Simple local and clean. We each had a slice ( mine with the thinly sliced pepperoni and my wife had a plain slice with cheese.  The slices are square but amble and good tasting. Unfortunately not like New York style but this was like the type we had when visiting Italy. They gave us warm bread with Italian Olive oil..  My wife ordered a house salad and large enough to share and the vinaigrette dressing was light and delicious.  The owner told us we could buy wine next door and enjoy it in his place without a cork fee. Soft Italian music in the background   Saw Stromboli there too. I would recommend this place for local pizza", "author": "Louis A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Best pizzeria in SF, Excellent Artichoke Ravioli! Sauces are amazing. The staff seams to be all from Italy, and it shows.", "author": "Jason A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "Excellent pasta and pizza. Very good food and good value - recommended. Amazing sauces, cozy atmosphere. all perfectly executed.\nAMAZING!!!!", "author": "Thomas R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "Fresh Pasta, delicious sauces, and excellent service! The place is modern and clean and you will definitely leave feeling satisfied! If you're craving some fresh Italian food, I highly recommend this spot!", "author": "Ethan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Came here to get a quick bite. We ate 3 slices, all delicious. The owner was super friendly as well.  Very pleasant!", "author": "Denise M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "Super delicious and great service! Best pasta sauce I've ever had. Also, high quality olive oil and Parmesan!", "author": "Grace W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-17", "description": "I went to Piccolo Forno with a group of 6. No beer or wine, but you can bring your own with no corkage. I ordered the salsicce and mushroom pizza. It was one of the worst pizzas I have ever eaten. The sausage had no taste exploding in my mouth when I bit into it and the cheese congealed and was hard. The crust tasted like cardboard. They also cut the pizza before serving it to me which I hate. Yes, I ate the pizza because I was hungry, but I didn't like it. When the bill came, we figured it came to $26.00 per person with tip. Three of us paid by credit cards and asked to be charged $26.00. They brought it back with a charge of $27 something. We asked why and they said something like they had to put down what we ordered, bla bla. They are all very nice and it's a lively place, but I will never go back.", "author": "Tom T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-07", "description": "this place is solid. Some highlights:\n- really nice/new/clean space. Great place for a casual lunch or even dinner.\n- I had the spaghetti/meatballs. It was very good. Good portion. I finished everything. \n- I've had the pizza here too. A slice of square mushroom, sausage. I didnt think it was very memorable. I thought it needed more sauce and I wish they had left it in the pizza oven for a bit longer to crisp up and melt the cheese. \n\nI can't help but to compare Piccolo Forno to Italian Homemade which is just across the street. Italian Homemade makes their own noodles in shop which is a huge difference to me. I think Piccolo Forno uses regular store bought dry noodles. The meatballs at Italian Homemade are almost twice as big as well and you really just get the feeling that they put more love into their food. So for me, it's a no brainer to go to Italian Homemade since prices are pretty much comparable.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "I loved the guys who worked here..the pizza was very thin and delicious. The pasta was light and the pomodoro sauce was excellent.", "author": "Victoria D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "The Pizza is great in taste and freshness. The cheese tastes so good just like in Italy.", "author": "N Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "The food is delicious!!!\nThey have a great service and the place is nice. We love the pizza, pasta and Salads!", "author": "Suelem A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "This is my wife and my favorite Italian in North Beach.  We live around the corner and come back all the time for whatever is on their specials list and just let the owner, Guiseppe tell us what is the best that day!  It has been such a great addition to their neighborhood.  Can't go wrong with any of the homemade pastas!", "author": "Cameron A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Coming to Piccolo Forno makes you feel as if your own family is running the place. And their dishes are superb!", "author": "Angela B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Small but absolutely authentic Italian restaurant - we tried multiple entrees in order to share and everything was fantastic.  Stop by the corner wine shop and bring your own wine.  Great restaurant.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Always great place to stop by for pizza! This is a really authentic italian restaurant. The service is great and everyone really goes out of their way to take care of you.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "It would be hard to beat this place.  This is true Italian.  Perfectly cooked pastas and pizza.  Highly recommend the crab ravioli.  \n\nWonderful people and ownership.  Giuseppe is the owner and is so friendly and helpful.  This one is a must in San Fran.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "Amazing pizza and pasta, plus the friendliest service! Highly recommend the burrata, which they have delivered daily from LA. A gem of a place.", "author": "Hilary H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Great prosciutto and arugula pizza- perfect sauce and crust. Friendly service. So glad we stopped in.", "author": "Greg M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "I can honestly say this is the pasta I've ever had! We stumbled upon this place while exploring Little Italy and I can't wait to go back. They were able to seat 7 of us right away, although it is a smaller space the food makes it worth it. People in our party wanted lasagna and they had just ran out, so the owner said we could wait 30 minutes and he would bring out fresh made lasagna. This lasagna was absolutely amazing! I personally order the cheese tortellini and I loved it. However, I did try their specials for the day and wished I would have order them for myself. They had a butternut squash ravioli that was to die for. Great flavor and texture! The dish that made my fall in love with this place was their asparagus ravioli with white truffle. I've never tried truffle before and was excited to try it. This ravioli was beautiful, the best I've had. It's hard to describe the flavor but I can't wait to go back and order this! The owner was exceptional, very welcoming, and kind. BEST PASTA!", "author": "Taylor P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "The best fettuccine we have ever had!  The sauces are amazing & they make their own pasta everyday!!  Lemon sorbet was served in a lemon & just excellent & refreshing!  \n\nWe will be back and we are from Dallas & we are foodies!   Thank you!!!", "author": "Theresa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Great pizza for a good price. We got the 4 cheese, Margherita and the Bresaola. Highly recommend the Bresaola. Very authentic experience and the staff is really friendly. Bring a bottle of wine (or buy one from the place next door like we did) and they have glasses and will ice the bottle and take care of everything for your free of charge.", "author": "Lance H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-31", "description": "Piccolo Forno is an excellent Italian restaurant in North Beach.\n\nI ordered the special, a breaded pork medallion and it was superb. The seasoning was tasty and the sauce was elegant. The price was reasonable; I think it was about $16 for the port medallion and vegetables.\n\nThe waiter was helpful in making recommendations.\n\nThe restaurant is small but that has a nice touch. Piccolo Forno also offers a variety of pizzas in addition to traditional Italian dinners.\n\n I recommend this place. The only downside is that there is no private parking lot; metered street parking only.", "author": "Robert H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "So good. So cute. Great neighborhood spot and the yelp app pickup situation is on point. Ordered the sausage mushroom and the veggie to-go and both were delightful. May I also say, the best veggie pizza I've ever had. Grilled radicchio for the win!!", "author": "Emily G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "This was the last stop that my wife and I made on our honeymoon.   We had the Greek salad and a pizza with sausage and mushrooms.  Everything was soooooo good.   The pizza was cooked just right and the salad's dressing had a great flavor.   We will definitely come here again when we return to San Fran.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "My favorite Italian restaurant in north beach for sure!!! Service is wonderful and every staff member is so friendly. A very welcoming authentic restaurant with a family feel. Marg pizza was so great, gnocchi was to die for, and buratta was perfect. We were ready to leave and owner told us to sit back down and brought us dessert on the house!! Now that's great service!!! Highly recommend this place!", "author": "Evelyn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-22", "description": "Excellent pizza and pasta. Great neighborhood atmosphere. Pizza crispy on bottom and yummy on top. Pasta and wife's special requests were accepted with a smile", "author": "Stan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "Excellent food. Fantastic service with a smile. The marinara sauce was phenomenal.  The calzones were amazing. Only negative was it got an it warm in the resturant. We had a group of 9 and everyone was very happy and really enjoyed their food and the experience.", "author": "Scott R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "Whoa! This pizza is superb. The rich, chewy, crispy crust. Some of the best I've ever had! And I would call myself a pizza connoisseur. The toppings, the prices were perfect. I also ordered some of the roasted veggies they had and they were excellent. \nNo wine or alcohol served here, but the pizza made up for it. Not the fastest service, as it was just one guy waiting on every table, but he was pulling it off ok I suppose.\nI'd eat here all the time if I lived in the area!\nRecommend!!!!", "author": "Sharon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-14", "description": "The food here is so good, I could cry of joy. We had little pizza squares and shared a tortelloni with a tomato/meat sauce that competes with my nonna's. \n\nThe coffee afterwards was delicious and I now have a better alternative to the standard North Beach coffee.\n\nNext time, I'm trying the traditional pizza and dessert.\n\nWe're coming back every week from now on!", "author": "Shelley C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "Excellent service and food! The staff was very friendly and attentive. If you are in a hurry or starving, they have pizzas premade in a glass case in the front. We ordered a few slices for our kids upfront, which were okay. We then ordered a pizza with caramelized onions/tuna and spaghetti with marinara, which were absolutely delicious. The marinara is so fresh and tasty - we did not let one drop go to waste by soaking it all up with our bread/pizza crust!", "author": "Shauna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Yesterday I had the best sandwich in my life her at this restaurant. 6 hours of roasted pork on focaccia bread with roasted romaine lettuce and dip it in there olive oil. Both my kids loved their meal, spaghetti and meatballs and lasagna. Everyone at the table kept dipping their bread into my sons sauce.", "author": "Jade E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "I order their crab ravioli and was delicious!!! Very light and flavorful, a prefect combo! Our server was very friendly and funny! My family and friends ordered their margarita pizza and spaghetti & meatball and they said it was delicious as well! Highly recommend.", "author": "Carman C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-07", "description": "All around fantastic. My husband and I went here after a long day traveling in and we were driving looking for parking and figure we find a place after we parked. Luckily we didn't have to walk far in the pouring rain. This place was friendly, delicious and clean my top three musts. I tend to only do reviews on here when. Place really has the wow factor or have given the three strikes and this place has the wow factor. \nIt was very clean and has a modern feel as look. The server was very knowledgable and beyond friendly. After the most delicious appetizer of zucchini slice of pizza and the penne with eggplant and fresh basil which was mouth watering I can still taste it mmmm. I was just right not over full but not enough room for my own desert. I did want the pistachio gelato but my husband ordered a delicious berry layered pastry. And the server heard me say I wanted gelato but knew I couldn't finish so he added a scoop. It was the perfect ending to an amazing dining experience. \nFOOD: they have an open pizza slice selection we chose to try two different ones for our apps yes we were hungry lol. I had the zucchini and was mouth watering the cheese was perfect so flavorful and the sliced zucchini was a great touch as opposed to the diced like most other places. Crispy thin crust. Then our meals. I had the penne eggplant marinara it was perfect amount for the dish not over the top amounts. It was a flavorful mix of tomato, fresh slices basil with chunks of eggplant that melted in your mouth with so much flavor. There was a perfect amount of mozzarella cheese to not overpower the dish with cheese flavor. My husband had the chicken Alfredo which was a light dish packed with a lot of flavor with its simplicity.", "author": "Jenn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "Seriously can't wait to come again we ordered the affogato espressos it has ice cream in  a strong expresso so delicious and creamy. Tiramisu it was thick creamy delicious.\nService is great friendly staff informed and let you know what's on the menu.\nI order today special which has crab raviolis you get about 6 of them for about 16 bucks worth it great flavor you can taste crab and each ravioli.\nHubby ordered the Pizza Capriccioso. Thin crust pizza with Kalamata olives, artichoke, mushrooms, prosciutto, and  cheese and the middle they have a over easy egg absolutely delicious and savory.\nAlso very important when you're walking around San Francisco to have a nice clean bathroom open on to customers.", "author": "Nona W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-08", "description": "Piccolo Forno is a new Italian spot in North Beach, essentially the Italian food central of San Francisco. They have a selection of pre-made pizzas, sandwiches, and cold dishes on display, but I'd recommend you try their menu items that are made to order. My boyfriend and I tried their margherita pizza, which I loved. The crust was just right, thin but with a doughy crust. The slightly sweet tomato sauce was a great contrast to the light mozzarella and generous basil. We also tried the spaghetti carbonara, which tasted authentic yet relatively light. The noodles were perfectly al dente as well. Although I was satisfied with all the food, it was still difficult to live up to Italian Homemade, located right across the street. But it's definitely a place I'd go to satisfy a pizza craving!", "author": "Ashley T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-05", "description": "I'll start by saying that the food is actually quite tasty and the servers are friendly. The major problem is the portion size. I ordered the $14 lasagna to go, and it was TINY. I'm a small guy and not a big eater, but I had to go buy a sandwich after my lasagna because it was essentially 4 bites of food. For a $15 including tax, you expect a little more than a few bites of tomato sauce.\n\nI wanted to like this place, but I just can't recommend it.", "author": "David T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "My friends and I came here for dinner after a long day and absolutely loved it! We brought bottles of wine with us and were so excited that it was BYOB (we had good wine with us). The service was great. The food was great. We had a really nice night and I'm so thankful we wound up there. If I could've changed anything, I would've turned up the volume of the music up to set the tone a little more - but overall, fantastic night out! As a local, I'll definitely be back and spread the word :)", "author": "Elizabeth A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "The people behind our neighborhood favorite Ideale have come up with a winner on what was once a forgotten stretch of Columbus Avenue in North Beach. If you are looking for unique and delicious Italian fare at reasonable prices this is the new place to be...\n\nI've eaten here now on a number of occasions and have yet to be disappointed. From classic Italian meatloaf complete with hard-boiled egg in the center, to pasta, to a savory pie with veal, to Roman thin-crust pizza - everything is simple, hearty, and makes you feel like someone's mom or grandmother is back in the kitchen throwing the food together with ingredients fresh from her garden. You'll know that's not the case when you're here, however, as you'll see Giuseppe and the crew back in the open kitchen pouring love into everything that's prepared...\n\nThey make different items daily visible 'under the glass' when you go in, but be sure to look at the menu too otherwise you'll miss the pastas. Their uniqueness comes from the variety and nature of the fresh daily items, all of which can be taken out for lunch at the office or an easy dinner at home too. But eat at the restaurant if you can, you won't find a friendlier environment in the area.\n\nGreat, clean, fresh food from people who know good food, served with a little bit of Italy and a smile. Two big thumbs up...", "author": "Arthur S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Always a great authentic Italian meal here. Pizza is fantastic and pasta as well. We always get the Meatballs and pasta and a pizza. Daily antipasto are authentic and delicious. Desserts are awesome too. Owner operated in the middle of North beach. Great for families but needs a few more high chairs.", "author": "Charlie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "Very good pizza and pasta. The meat lasagna was delicious and the mushroom and sausage pizza also. Service was very good. Prices were excellent for what you got. Clean restaurant. Owner and patrons speaking in Italian. Very impressed.", "author": "Kristie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-14", "description": "Loved the ravioli and Mysta salad. The Caprioso pizza was interesting and better the next day. The ambience and friendly staff was great as well.  3 stars because the bread was burnt. It was quickly replaced but still slightly charred.\n  Especially enjoyed the stark modernity of the decor and striking paintings on the walls.\n  Moderate prices. Will return to explore the menu.", "author": "E W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Perfect. We had the 4 cheese ravioli and it was wonderful. The couples with us had delicious pizza.  One said it was salty. We brought in our own wine, they don't have drinks. Great service and they seem to take pride in the place.", "author": "Kathy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "Authentic Italian cuisine and service in North Beach!  We love this place!  The antipasti, salads, pizzas and pastas are excellent, very warm and welcoming atmosphere, very laid back, Guiseppe the owner recently came to SF from Italy, really cares about the quality of the food, and warmly greets his guests.  Great value price-wise!  They are still waiting for their liquor license, so just bring a bottle of wine and they will open and provide glasses-- no corkage charge!  You will feel you are in Italy!  Come and experience genuine Italian food and hospitality !  Buon appetito!", "author": "Anne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "I love love loved this place! Great atmosphere, Amazing food at a reasonable price. We had the crab ravioli, an Ideale pizza and a Monte Bianco pizza, everything was delicious. If you're ever in the area, stop by, you will not be disappointed!", "author": "S H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "The ingredients are fresh and seasonal.  The service was great.  They even opened the door for incoming customers. You can see what they are making in the kitchen. We saw a patron local SFPD officer resembling a comic book caricature, wearing a 7-point cap and carrying a wooden nightstick and thought he got confused since it used to be a donut shop.\n\nIt is great to see young Italian restaurateurs bringing cuisine back into North Beach, which at a previous time became an exodus for the district. The place feels authentic, so much so that the waitress from Capri is still learning English. The ambiance feels hip but their food still holds true to Italian cooking -- lots of amore and freshness put into it.  We had the vegetariano calzone, bull mozzarella arugula salad, and ham lasagna and liked them all.  Will try the tiramisu for desert next time.", "author": "Vic C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Great food and friendly service. We had a nice lunch of salad, pizza , pasta, dessert, and espresso drink all for about fifty bucks. What an awesome deal! The pizza was thin and crisp, the way I love it.\n\nBest meal I've had in a while and so glad this place opened up. Strange how empty it was but I'm sure this will quickly change once people catch on to this new gem in north beach!", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "What an awesome Italian restaurant. Only about a 10 minute walk from Fishermans Wharf, this small restaurant is kid friendly and delicious. Everything has that homemade flavor that makes you want to try more. Treat yourself to some amazing pesto and room for dessert.", "author": "Josh M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "So so good! So easy to end up at a mediocre restaurant in North Beach that finding this place was a real treat. Original and delicioso and very friendly and welcoming staff.", "author": "Alison S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "Delicious and so friendly! The staff was amazing accommodating our large group. We also have various allergies and they did their absolute best to accommodate. Would absolutely come over and over again.", "author": "Amilia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Best gnocchi sorrentina  I've ever had!!! The Homemade tiramisu was DELICIOUS!! My parents were impressed with the pizza too. We will be back. Thanks Piccolo Forno.", "author": "Kenneth B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "Love this place, the food is always delicious, I recommend you always try the specials, very authentic Italian food, very reasonable prices!!!!", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "I was new in town and had friends visiting. \"Surely,\" I thought, \"Surely we can get a table around here somewhere.\" Even though there are about 11 Italian restaurants per block, most places had an hours-long waiting list. Some even laughed in our faces for asking, so we had that going for us. \n\nNot Piccolo Forno. We walked in to a friendly greeting, an open table, and a pizza display to refresh a tired soul. It seemed like hardly any time passed between ordering food and food appearing. My spaghetti was perfectly al dente and the sprinkle of fresh basil on the meatballs made my whole day worthwhile. One of my friends got the piccolo forno pizza. He is now seriously considering moving to San Francisco. \n\nA week later, when my family was visiting, we went back. We received the same warm greeting, and the owner quickly rearranged tables so we could all sit together and without getting a cold blast of air from the door opening. My dad and I split a salad and fought over the last tomato. I don't even like raw tomatoes. My sister-in-law and I got spaghetti carbonara. I now realize that up to Wednesday night, I'd only ever eaten \"carbonara,\" not carbonara. \n\nTL;DR: kind people, amazing and authentic food, not crowded.\n\nI'm going to be pretty sad when everyone finds out about this place and I can't sneak in there with no reservation on a Saturday night anymore.", "author": "Allison P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "Awesome service, quality and value.  Pizza and eggplant penne was perfect.  Got there just before closing and they accommodated us well.  Worth the five stars.", "author": "Warren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "Fantastic food and service!   The meat sauce for the lasagna was AMAZING!   The calzone is big enough for 2 people and the staff was so nice.  The guys there love cooking and it is very evident.", "author": "Shana P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "Amazing place and the service was kind and genuine. True Italian. We ordered whatever was suggested! We wish we could go here every night for fresh authentic Italian food!", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "We found this restaurant by chance while visiting San Francisco and we want to make sure you find your way there as well. The food is amazing and the service exceptional, you can enjoy fresh pasta, freshly made bread, delicious tiramisu... and lots more. Loved it and definitely coming back :)", "author": "Andrea T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "My brother, sister-in-law, and I had just a bit of time to hang out in North Beach on a rainy Monday afternoon. We discovered \"sunshine\" and delicious authentic Italian food at this fun, little cafe. The staff was very welcoming, attentive, sweet, and eager to make sure we enjoyed our meal. My lasagna and (three flavors of) gelato were so delicious. (See my clean plate!) I'm definitely going back for more! Oh, and they have fun \"Shazamable\" Italian music. Check it out!", "author": "Sharon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Authentic Italian food! Friendly service from Giuseppe the owner. My sister and I were walking by and noticed his new place. The pizza and spinach ricotta pie looked so delicious it stopped us in our tracks even though we just ate. We ordered pizza and the pie to go and heated it up for dinner per his instructions. Mmmmmmm the ricotta was exceptional and the pizza yummy with flavor!!! Welcome to the neighborhood!", "author": "Cecilia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Ultra impressed. The pizza was perfect (assuming you're into woodfired pizza). We had the \"Ideale\", and I was very impressed. And that's just the food. As we walked in, the owner walked in with us as he discussed why might be was good, set our table, and made us feel like he was our oldest friend.  This restaurant embodies the North Beach experience, not with ambiance, but with character and flavor.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-11", "description": "One of the few really Italian places in North Beach, and I'm Italian so I can tell!!!\nEverything is great, from the pizza slices to the pasta!!\nTry the sorbetto as well! Is really fresh and juicy and is served in a lemon!! \nThe owner Giuseppe is so friendly and helpful! \nI love this place!", "author": "Anastasia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-29", "description": "In my last review, I had to share some tough love about pizza that was just plain bad, but I truly hope they visit Piccolo Forno to see how it should be done. \n\n[http://www.yelp.com/biz/san-drino-sausalito-2?hrid=dlx5Df8FGisQs7pRd62KWw&utm_campaign=www_review_share_popup&utm_medium=copy_link&utm_source=(direct)]\n\nTonight my wife and I were delighted wander in on Piccolo Forno's very first night in business! They are expecting a very big forno shortly so I wondered if the name was in reference to the tiny warming oven behind the counter, perhaps a sentimental possession that got the whole thing going, or just a nod to the restaurant's cute size.\n\nThese guys, Simone & Giuseppe, were friends from IDEALE, another great restaurant, and just opened up this new venture. I overheard Giuseppe say that they kitted out the interior themselves which is modern and hip. The low volume, old school Italian pop playing in the background made the scene.\n\nAs for the food, they haven't even gotten their pizza oven and these guys are already rocking great pies. It is quite clear they really know what they are doing and are very good at it. Giuseppe talked with passion about getting the temperature just right for pizza crust. Now this is a guy I can respect. My wife's pasta was also delicious as was the Torta Caprese that we finished the evening with.\n\nI am not the kind of guy that fawns over great service, but the service was distinctly friendly with a nice local feel which I hope they can maintain when they get as wildly popular as I think they will be.\n\nOddly with the The Italian Homemade Company across the street, North Beach is moving closer to our house! Piccolo Forno replaces a sad place called Tasty Bites that was not too tasty but did bite. Their doom was clearly near when virtually the entire front window was plastered with offers of an overblown and far too diverse menu. Piccolo Forno is a welcome addition to the neighborhood. Nice work gents. You are off to a great start!", "author": "Ken P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "Just stopping by to express my love and approval for the spaghetti and meatballs.", "author": "Janett R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Great service, although we had to wait a very long time for a table (no reservations taken, so you have to stand around if it's busy) the staff definitely worked hard to make up for it when we got seated. Pizza was good, and the sorbet inside an orange was really good too", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "Very happy we came across this hidden gem! We will be back. All good was homemade, fresh and authentic. \n\nEven the locals frequent this restaurant.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "Wow, the food is great here. This newly opened casual restaurant reminds me of a pizza cafe in Rome. There are slabs of pizza, bowls of marinated vegetables, and a case of homemade desserts. It's like walking into an Italian kitchen. \n\nEverything was affordable. Pizza is $4.50 for a large slice and $10-14 for homemade pasta and sauces. Menu changes daily so it's pretty exciting to go in and see what they made for the day. \n\nIt's relatively quiet now since it's so new but I think this place will be packed pretty soon because it's high quality food and affordable prices.", "author": "Charles L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "1st time here and the food was awesome, i ordered pizza al funghi, penna All'arrabiata and spaghetti Meatballs everything was just perfect. people working here are very nice and friendly. I will definitely come back here for this amazing food and hospitality", "author": "Fatma I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "The food was fabulous. The service was excellent and the price was very reasonable. We will certainly be back.", "author": "Dowdy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Italian food is something that is prized. PF is one of the best experiences you can have in the city. From the moment the food touches your mouth to the moment you realize how perfect the experience is, is something that you will never regret. BYOB for an outstanding job is why myself and our friends always come to this hidden gem!", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "So good ! Amazing customer service and even more amazing pizza & pasta ! Definitely a treat", "author": "Stacey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-19", "description": "I am absolutely enamored by the fact that restaurants like these are sprouting up along Columbus with each passing year. It makes me appreciate rent control more and more in one of the best neighborhoods in SF.\n\nThe first things you notice upon entering is the clean no-frills interior and a booming/hearty welcome from the staff. You want Italian? Well, the owner's friendliness, accent, and concern for your overall enjoyment of the meal makes you feel like you're at a sit-down meal with the family. Just ask him to recommend things off the menu and subsequently listen to him rattle off 12 things and then say everything's tasty!\n\nOverall, the food quality was pretty good, portions were a bit small and plating was messy...kinda like how you would serve yourself at home. Rather than critique using my subjective preferences (i.e. Carbonara was runnier than expected, pizza was doughy/a little dry, etc.), I will say that I had an extremely pleasant experience.", "author": "Nick W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "The ravioli was delicious! Pizza outstanding! You can bring in your own alcohol....best place in little Italy!", "author": "Catherine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "Great service and delicious food!!! I'll make sure to be back on my next trip to this City.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "The best pizza . With good pasta really Italians place . Try . Good service with Giuseppe. Thanks piccolo forno", "author": "Aey S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-20", "description": "1- This place praises itself for it's oven by naming itself as a bakery (Forno=Oven). Yet the bread was served cold.\n2- We had a pizza ideale & an arugula burrata salad. The arugula wasn't dressed. \n3- The pizza had a rotten cherry tomato on it, I told them they said they get their produce fresh on daily basis.\n4- The waiter walked out of the restaurant & spat out on the sidewalk where we could see him. \n\nI wasn't feeling well after eating here.\n\nOverall this place felt like a tourist trap. We live in SF, we always go to The homemade italian pasta company, but mistakingly gave this place a try.\n\nHope they improve.", "author": "Evelyn Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "The crab ravioli was the best I've ever had. The owner was personable and kind. The location is great. I'll definitely be back!", "author": "Gerold D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "My husband and I had lunch here. Great atmosphere, great service. Crab ravioli was delicious. The veal tortellini with meat sauce was really good too, but the crab was our favorite. I would highly recommend for service and price.", "author": "Emilie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "This place is perfect! Great pizza, good vibes, friendly staff, great dessert! We will definitely be back.", "author": "Charleen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-09", "description": "Loved the casual, friendly atmosphere.\nI had the Insalata Caprese, the Ravioli ai Carciofi and a cappucino. Food was fresh and flavors were great, though my ravioli was not hot.\n\nBut the main reason I'm writing the review -- I had to use the restroom.  The walk through the kitchen to get to was kind of cool, but then the bathroom wreaked horribly of urine. Can't even express how disgusting that was. It nearly ruined the whole experience.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "Food was really good here. Service was also exceptional. We had a party of 11 and they were very accommodating.", "author": "Rami W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-07", "description": "TLDR: Service: abysmal, Food: decent. \n\nI came here Saturday night with a party of 6. I made a reservation ahead of time. There were only two waiters (who also helped cook) and they were clearly overwhelmed. I asked my waiter twice to bring balsamic vinegar for the bread and he forgot both times. He also took our empty water pitchers in the middle of our meal, and instead of refilling them, never brought them back.\n\nWe ordered 2 of one type of pasta, and instead of giving us two portions they essentially cooked one serving, and split it in half. The waiter insisted that the large plate made the serving look small, but looking around at other people's plates you could tell that it was half of a portion masquerading as a full one. Kind of a dishonest place. \n\nI will not come back.", "author": "Mauri W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "I think this is the best casual place in North Beach but the food is often better than what you can find in the more expensive restaurants.  Run by real Italians.  Gnocchi is fabulous and pizza is light and delicious.  Bring your own wine, no corkage fee.", "author": "Rich A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "Loooovvvee this place! Amazing pasta! Delicious pizza! Great salads! Staff is soo nice! Will be back!", "author": "Angie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "Square slices were a bit too flaky / pastry like for me. Solid atmosphere and other food looks great", "author": "Jeff L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "Great place! \n\nWhile staying in San Fran for work I really wanted some home made pasta. This place makes their own noodles, has fresh food and they have extremely accommodating staff who make the Italian place very authentic. Their owners let us try so many things! Can't beat it!", "author": "Alexandria V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-16", "description": "The food is no better than average. The service is substandard by any measure. I certainly won't be going back. Too many good restaurants in town to choose this one again.", "author": "Gordon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-11", "description": "We got take out. Ordered online through Yelp. Prompt, friendly, all orders were prepared exactly as ordered. They work hard in that kitchen. Both pizzas, and spaghetti with meatballs were outstanding. Would order or sit in this place to eat again. Everything is fresh and made from scratch. Keep it up.", "author": "Vinny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "All I can say is: wow. I came in here with high expectations. North Beach has a lot of great pizza places already so opening up another is pretty ballsy.  The toppings are amazing, and the dough! Best pizza dough I have ever had. Perfect Italian flatbread that would be great on its own, but with the sauce and toppings this pizza is too good to miss. I will definitely be back, often.", "author": "Nelson S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "Amazeballs pizza.  Not sure you can find much better anywhere on the planet.  While the don't serve wine, they pointed me down the street to the liquor store and happily corked a bottle for us.  Memorable food, attentive service... Will return with friends.", "author": "Ed J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-09", "description": "Waiter was having trouble communicating in English, food was extremely heavy and greasy, pizza had little flavor, and we waited a very long time to receive our check. Will not be coming back.", "author": "Najah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "Me and my wife were quite lucky to find this lovely great Italian restaurant on our first day trip in San Francisco. We ordered Pizza and Spaghetti with meatballs everything was extremely delicious. I highly recommend this restaurant.", "author": "Ed C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Excellent service and the food it's just GREAT! Pizza or pasta... Doesn't matter is just delicious! \nOttimo Giuseppe and company!!!!", "author": "Beli O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "I wish I could give Piccolo Forno 10/5 stars. Amazing place that is one of my favorite, if not favorite restaurant in the city. Giuseppe, the owner, is one of the most friendly people.\n\nDishes I have tried:\nSpaghetti con Polpette di Manzo (perfectly al dente)\nPennette Piccolo Forno (again, perfectly al dente with delicious pieces of eggplant)\nRavioli ai Carciofi (light pink sauce, delicious)\nSpecials (Carbonara, spaghetti with clams)\n\nThey have a counter full of delicious sides from porchetta (amazing), zucchini, eggplant, spinach - all amazing\n\nBest kept secret in North Beach and a place I will continue to keep going back to.", "author": "A B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "One of the best place in the city to have your pasta , no need to think, just go there and try the carbonara\"! It is really really delicious! \nThank you guys. you are the best .", "author": "Victor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Welcoming atmosphere, charming staff, and the food was really good.\n\nFreshly made pasta and pizza - we had the pizza diavola and spaghetti carbonara - both are recommended. \n\nWe'll definitely come back here!", "author": "Maya B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "So good!  We wanted a good meal in Little Italy, and this was fantastic!  They have a BYOB policy, but there is a wine store nextdoor that did the trick.  Delicious food and excellent service.  We'll be back!", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "This restaurant has delicious food and friendly staff. We had some pizza and pasta. The potato white pizza was uniquely fantastic. The crust is medium thickness with great flavor and crispy on the edges. The chicken fettuccine Alfredo was some of the best we had ever had.\nWe met the owner and he was so nice to us. We will be back. We need to try dessert next time.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Amazing gluten free pizza! The roasted veggies are to die for and the crust is perfect! I cant wait to go back!", "author": "Michaele K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "I really liked the spaghetti and meatballs here! Super simple yet delicious. The meatballs were very flavorful and soft. My boyfriend and I also tried their pizza. It was thin and made to order. Very fresh and I enjoyed eating it! Service is good and it's a cool environment.", "author": "Catherine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Owners who also work the front of house are authentic, personable, and very accomodating.  Very good customer service to make your experience great. We went there to order out pizza and while we waited, owner politely provided seating and water (free) and made good conversation.  Watching them do their jobs with others showed good service and attentive to each guests needs.  We got the Margherita pizza and it was really good. Sauce and cheese were high quality and the crust provided the perfect platform for everything to indulge the pizza.", "author": "Kenton P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Delicious food and excellent service!! Small cozy place, love it I'll definitely come back", "author": "Luisa Fernanda Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "This was by far one of the best pizzas I have had since my time living in Europe.  Glad I read some of the reviews in advance about bringing your own wine.  Enjoyable evening!", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "First time eating at this restaurant. We had the margherita pizza and the gnocchi.  Both were so delicious!", "author": "Denyce U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "Tried spaghetti, pizza and fettuccine Alfredo. All was delicious. Best meatballs and fettuccine I've had!", "author": "CC H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-03", "description": "Loved the Greek salad! Best feta I've ever had. Fast service once you get a seat. Pizza crust hand tossed good flavor. Sauce is fresh and home maid.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Food was amazing. Fresh bread, gf options, pizza by the slice for our kiddos. Wait staff didn't speak the best English so we didn't get an extra topping we added to our pizza but it was still delicious! Small dining area but took reservations!", "author": "Jesica G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "Best food ever! The staff were very friendly and made you feel like a part of their family. I have never been to another restaurant with such friendly staff. They brought us bread for an appetizer. Just by tasting the bread, I instantly knew that the pizza we ordered was going to be amazing! When it came, it was probably the best pizza I have ever had! The food was fairly expensive, but it was definitely worth it! I barely had room for desert, so I shared it with my family. We got a vanilla gelato. It was amazing! I would highly recommend this place if you want delicious, authentic Italian food! Definitely coming back here next time I'm in the area.", "author": "Hudson G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Good, tasty and pretty cheap Italian food. Nice service. I would go there again! You should make a reservation though because the place isn't too big and there were people waiting in line...", "author": "Johanna D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "These folks live to provide excellent food and service. Everyone is made to feel like family.", "author": "Gregg O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "A neighborhood favorite. Food is always on point whether delivery or dine in. BYO with no corkage. Reasonable prices and the best staff. Also they have gluten free pizza and pasta!", "author": "Samantha B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "We walked by the night before and it was so busy we had to move on. Ordered dinner tonight through yelp while we were playing at the park across the street so the kids didn't have to wait. When we were ready, we walked up, told them I had an order and it was ready in minutes. Well worth it. Yummy margharita pizza. Amazing cheese tortellini (the sauce!!). And the tirmasu ... delicious. Well worth doubling back after missing out the night before.", "author": "Micaela S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "Loved the atmosphere and personal attention!  My husband and I felt like we were back in Rome at one of the local restaurants there - homemade pasta, great authentic flavor and a cappucino to top it off!  Grazie!!!", "author": "C D H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "Great pizzeria although small place. The staff was super nice and I was very happy to find authentic Italian pizza, and delicious.", "author": "Carmen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "The food is amazing.   Well worth the walk away from the tourist traps at the pier.   Clean and fantastic food.  Daily specials and custom to order food.   Simply amazing.", "author": "Dennis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "Always solid food and friendly, personal service.  Pasta and pizza are equally excellent.", "author": "Adam D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "So good! The gnocchi was fluffy, the pasta was al dente and Giuseppe is great, will definitely be back!", "author": "Caitlin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Best local Italian place on Columbus! The staff is incredibly genuine and friendly. Definitely recommend!", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "Best pizza value in North Beach! If you're yearning for Italy, this is the place: a small (piccolo) space between Rialto Mercado & Graffeo Coffee which radiates Italian warmth, generosity, & delicious aromas. Giuseppi's meat & cheese pizzas are hearty, & his vegetarian ones are works of art -- frescoes in eggplant, spinach, & mushrooms -- at prices even a North Beach artist can afford. As the menu expands, I may never have to go anywhere else.", "author": "Charisse H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "Friendly staff, relaxed environment and tasty food.  We enjoyed their pasta, but the pizza was so so.  Would come back for their pasta and lasagna's.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-26", "description": "The Caprice salad was amazing.  Fresh tomatoes, basil, sea salt (i think), capers and the richest extra virgin olive oil.  Also had the Margarita pizza which had a thin crunchy crust.\n\nThey do not serve wine but if you'd like to drink, you can bring in a bottle and they will gladly serve it for you.", "author": "Mike F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Beautiful display of the pizzas, excellent service & clean, urban environment. A must eat. Pizza is delicious!! We knew it was well loved when many local Italians were eating here too.", "author": "Rachel K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-23", "description": "Gluten free spaghetti carbonara was delicious!! Very clean place and the owner is a very nice man and very friendly!! Love that an Italian restaurant has lots of gluten free options, excited to try the pizza next!", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Great place, the service was great and the food was the best felt like part of the family, it was also very clean. I had the gnocchi... man was that good my wife and baby had marinara spaghetti which also was very good, I've never seen my daughter eat so much. Wonderful experience", "author": "Chris V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-03", "description": "Extremely slow service, not very good food, and poor quality control (specifically, a piece of TRASH in my Greek salad -- part of the wrapping for the Feta cheese that was in the salad -- and some sort of sludge at the bottom of the iced tea).  \n\nService was unbelievably slow.  Our party of 4 walked in directly behind another party of 4.  We were all seated at the same time at adjacent tables.  The other table ordered AND RECEIVED their meals before we were even able to order ours. Then our food took so long that the other party finished all of their meals before ours even arrived!  Our orders were not fancy: 2 pizzas (one of which was already made and sitting in the case) and 2 orders of pasta.  I have no idea what could have taken the kitchen so long.  It was about 45 minutes from the time we arrived until our food arrived.  \n\nWhen the food finally did arrive, we discovered the piece of trash in my Greek salad and the food wasn't good.  My pasta carbonara was lumpy with cooked egg (though bacon in it was good).  The meatballs in my son's spaghetti and meatballs were dense and flavorless (though pasta did taste homemade).  My companion's pizza had undercooked dough, watery sauce, and little flavor.  His iced tea had sludgy stuff on the bottom -- I guess the equivalent of coffee dregs so was very unappetizing to look at or taste.  My younger son gobbled up his pre-made square of pizza, but by that point he was starving and probably would have eaten anything put in front of him without complaining.  \n\nAtmosphere was also pretty lousy: very loud 70s rock music (such as Queen and Aerosmith).\n\nThe restaurant did not charge me for the trashy salad.  However, the bill still came to almost $80.00 including tip, so all in all, it was an expensive, slow, terrible meal.  We will never go back.", "author": "Katy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "Stopped in here for lunch and had the BEST gnocchi! The staff was very helpful in picking our meals, great bread and fresh water served in bottles at the table. Great service, we never had to ask", "author": "Cherie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Best gnocchi I have ever had. This place is special. Outstanding food, great service, you will be hard pressed to find a better place to enjoy a meal. Five stars through and through.", "author": "Richard M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "Extremely nice staff! Food is AMAZING. Usually take photos of my food but it was so delicious that I forgot lol totally would recommend! I am a tourist from San Diego. Very chill place not dressy.", "author": "Mar R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Everything about this place is wonderful. The food was perfect. Pasta was al dente, meatballs and sauce had great flavor and perfect amount of meat. The pizza was home made thin crust, and my family couldn't stop eating. The chef (maybe owner) came around a few times to check and see if everything was good. Great place, great food.", "author": "Matt D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Here for a weekend vacation with family.  Found this spot and we all loved it!!!  Will absolutely be back!!!  Great service, great food!!!", "author": "Darrell B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-07", "description": "We went in on a Sunday night. We got there a bit early and the place wasn't too crowded but got crowded by 8pm. The place is pretty casual and decor isnt fancy - very bistro-ish. Food was decent - Spaghetti and Meatballs (al dente), Rigatoni Alla Grecia (mediocre) and the arugula salad (mediocre). Service was lacking as we had to remind our waiter of things a few times but hopefully will improve as the place matures. The pasta entrees took a long time to come out vs the pizza and lots of the other tables who ordered after us got their food before us. The owner Giuseppi was really warm and attentive to patrons. -Golly", "author": "G S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "The most amazing pizza place! They have the most amazing flavors and such a wonderful ambiance. Can't wait to come back!!:)", "author": "Paris S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-03", "description": "I wanted to LOVE this spot since they have creative slices and exceptional service. We came on a Saturday and had arugula salad and 2 slices. It was worth the value and the crust was super crisp but the flavor was lacking. Alcohol soon to come...", "author": "Maria C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "Simple, non-fussy good food.  On a recent trip to San Fran, stopped here for dinner, and we were not disappointed.  My husband had the fettucini alfredo; I'd say his was the best meal, but all of us were happy with what we got.  The Ceasar salad is quite good.  Kid friendly, very casual, and good service.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "Randomly pick this based on Yelp reviews. It was awesome!  Between the pizza, lasagna and spaghetti and meatballs, all were amazing!  Staff was great. Food was awesome.", "author": "John B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-06", "description": "authentic and delicious. i would recommend the ravioli and the pizza. also their mozzarella is the most amazing i have ever tasted. the owner is really nice, but our other server was not great.", "author": "Button L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "Absolutely DELICIOUS!!! Perhaps the most \"authentic\" Italian grub you can get in SF. The pizza was perfect as was the ravioli. Could not have been more satisfied! And everyone who works here is delightful", "author": "Phylicia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "Love this little place. Service was fabulous, food was hot. They've only been open about 4 months. I was greeted at the door and given recommendations for what to order. They have gluten free pasta and pizza. The penne was cooked perfectly and had an amazing pink cream sauce. The flavor was unbelievable. I want to eat here forever.", "author": "Sabrina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "Neat place with friendly staff. Our group ordered lasagna (which was notable, with thin pasta surrounded by nice amounts of cheese and sauce and sausage), and several pizzas. Each of these was quite good, with an interesting and well balanced crust. Toppings were nice and the sauce was decent.", "author": "John P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "My husband and I were visiting San Francisco and wanted to check out the North Beach area. Both of our meals were delicious. I had pasta with eggplant and tomato. The meal was made to perfection. We were served by a very nice waiter who was attentive and friendly.  I also ordered dessert-tiramisu.  It was perfect. I would definitely come back!\n\nSimple, authentic Italian food in a great atmosphere, beautiful modern art work decorating the walls to enjoy too!", "author": "Karen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "Really good pasta, tried the lasagne and the meatballs. Both excellent. Good al dente pasta. Good service. Decent lunch spot", "author": "James R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "I love this place. Family friendly, outstanding food, not too pricey, very friendly staff. All of their dishes are very good, some are spectacular (like the prosciutto pizza, and make sure to try the profiteroles. They may make you cry tears of joy.", "author": "Rob G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "Very happy with the lasagna and penne arrabiata. Free bread was okay, and the paid focaccia bread was okay as well (but should be better considering it's extra).  Servers were very, very nice, but not particularly attentive.\n\nStill the main courses will definitely bring us back.", "author": "Buddha B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "Just had a great dinner. The food and service was superb!  Both my daughter and I ordered a pizza. Both delicious and left overs will make a great breakfast.  The warm bread and olive oil among the best I've had. I don't understand why there weren't more dine in guests.  Don't let that stop you from enjoying the food and service!  It i worth a stop and so much better than the touristy places. I accidentally left my credit card when I signed my bill and was chased down the street to return it - Now that is service!", "author": "Diane D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "Amazing authentic Italian food and service!!! We had the gnocchi and calzone. Both were so fresh and tasty! They treated us with such kindness including the owner chatting with us for a while. He's the real deal!! We will go back often.", "author": "Joel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "Best fettuccini Alfredo I've ever had! The service is excellent and the restaurant is really cute. A definite must if you love Italian food.", "author": "Tara V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "What a life saver on a chilly rainy day in San Francisco!!! They started us out with fresh bread. Excellent ideali pizza (great flavor) with great service and great atmosphere. Loved this lovely place. Wish this place was in Houston too.", "author": "Aliya V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-13", "description": "This place is ran by two Italian brothers. They are very friendly, genuine, and nice people. Fausto, who is one of the owners, has offered me a caffè macchiato while we were chatting about Italy. The coffee was exceptional; I have missed the invigorating and rich scent of a real Italian coffee. The lasagna and the pizza margherita that my friends and I have ordered were absolutely delicious. As an Italian born and raised, I know for fact how the authentic Italian dishes should taste like. I was also very satisfied with the service and had overall a tremendous experience. If you love Italians and if you like to talk and try some authentic Italian food, then this is the place for you. Buon Appetito!", "author": "Giulia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "Very nice and friendly stuff. If you look for an italian restaurant, its the right choice for you.\nWe had lasagne and tiramisu, which was very nice!", "author": "Samuel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "Most amazing meal. All three dishes were superb!! We had artichoke ravioli, lasagna, and pizza. The pasta was fresh and homemade. Melts in your mouth. Dare I say the lasagna was better than grandma's and we were fortunate enough to bring home two pieces of pizza to enjoy later. The staff was super friendly and warm. Plenty of Italian spoken her by both staff and patrons. Absolute must in North Beach.", "author": "Leanne R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "Just leased my fourth car from this incredible dealership! They've always been honest and very accommodating. Shout out to Kevin Frankel and Jeff Cirks for being a dream team.", "author": "Alli G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-16", "description": "The pasta seasoning is too simple to my taste, and a bit on the salty side. I like their bread, though, quite flavorful.", "author": "Nick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "This is the perfect place if you want to feel like you're in a local restaurant in Italy. The staff, cooks and music are all authentic Italian. The pizza is great with a perfect crust. We've ordered the penne arrabiata and the spaghetti and meatballs. Both were delicious, flavorful and cooked perfectly. The Caesar salad is so tasty. We will be returning again and again.", "author": "Ariel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "So fresh and delicious I wonder if they have ever a garden out back. Loved every bite! I had the Capriciosa (prosciutto, egg, funghi, artichokes, olives)  only wish my stomach was larger so I could order another or toy the others on the menu. For authentic flavor, friendly people, pleasant atmosphere I would highly recommend Piccolo Forno. The by the slice selection looks amazing as well. Every detail was perfect! I will swing by here without a doubt next time I'm in little Italy", "author": "Alfonso T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "It's rare to say this, but the service was probably better than the food!  And that's not to say the food wasn't good. The minestrone soup was EXCELLENT, pizza pretty good and spaghetti great!", "author": "April S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "This is such a cute little place! It has GREAT pizza, pasta, and gelato! The gentlemen that helped us was amazing! He was so sweet and so friendly. He suggested all the best options! I love the Italian feeling you get the minute you walk in the door. And they speak fluent Italian which was pretty awesome to hear! Definitely a must go place when you're feeling like Italian cuisine! Such a friendly environment, with amazing food!", "author": "Tiana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "My girlfriends and I were looking for great Italian and found the perfect spot. The gentleman was so friendly, the food was spectacular and the ambiance was gorgeous. The pizza and Alfredo are to die for. The art on the walls and the red chairs along with the Italian music playing make the building feel warm and welcoming. The gelato was fantastic. I highly suggest this place.", "author": "Jaymie E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-08", "description": "Stopped by after watching Joy Koy at the Cobb and this place caught my girlfriends eye so we stopped in. We were welcomed so nicely by the owner and employees so we felt like we had to try their food. My gf had the eggplant pizza and I had the focaccia turkey sandwich. As far as my sandwich it was perfectly toasted with freshly sliced turkey. The turkey had great flavor and wasn't bland by any means and they had put some sort of house sauce that complimented the sandwich very well. Also came with an arugula salad dressed with oil and olives, which was a little bland for me but my gf liked it. The eggplant pizza was a very traditional Italian pizza, but to my gf's liking was slightly lackluster. It looked very fresh, however might need some tweaking since they just opened. We also had ordered a cannoli, but the owner wanted to treat us to a special dessert which turned out to be a dessert ravioli. This special dessert definitely won us over and was special. \n\nOur 4 star review is based on a combination of amazing service and hospitality with just minor changes needed to their eggplant pizza. We definitely stop by again when in the area. They made us feel like we were in Italy .", "author": "Pedro G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "Wanted to find an authentic Italian restaurant in North Beach while visiting and came across this place. There were two workers who were incredibly friendly. I was surprised with how quickly they attended to us and how quickly our food came. We started off with an appetizer of potatoes, which seemed to have rosemary, they were absolutely delicious. My husband and I split two diff. slices of pizza - one with zucchini and another with sausage and mushroom as well as the lasagna. It was seriously so good!! Cooked perfectly and great portion sizes. Honestly some of the best Italian food I've ever had. Definitely a casual place!", "author": "Danielle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "This restaurant is fantastic ! We ordered the mozzarella prosciutto arugula appetizer was amazing ! It came with pine nuts and raisins and the flavors were delicious ! The olive oil was amazing ! My fiancé and I bought a bottle because it was that good ! Our pizza ( sausage and mushroom) was really good. The crust was perfect and crispy and the ingredients were fresh. We also ordered the tarfuto desert (Hazelnut , chocolate , vanilla ice cream. So good ! The servers were also very nice ! We will be back again !!! Very delicious !", "author": "Nancy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "My beau and I knew this was the perfect place to start our romantic endeavor when we were warmly greeted at the door by the owner.  Bae and I indulged in delicious salads, a diavola pizza, wine and an excellent tartufo ciocc.  Highly recommended!  Enjoy your delicious moments!!", "author": "L W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "Very good. Great staff. Very authentic pizza by the slice with unique ingredients. This place is only going to get better.", "author": "Matt D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "Wonderful!  Italian feel, Italian spoken, and fresh ingredients. Italian food like no other! I will be back! Much competition, and many choices here in North Beach, but I highly recommend Piccolo Forno.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "Tunisian. Fresh, authentic, tasty. \n\nI got a large pizza slice, arugula with, as the server said, \"lots of prosciutto.\"  It's not the hot, gooey pastry crust slice from Golden Boy, but it's not meant to be.  The pork, the soup, and the other meals looked fantastic.", "author": "The P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "The homemade pasta is amazing and the sauces are authentic and delicious!! Everyone that works there is incredibly friendly. We had homemade gnocchi with cheese sauce, eggplant parm with spaghetti, and a Greek salad. It was amazing!!! We will be back many times- it is our new favorite.", "author": "Scarlet F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "This place is amazing! The chef built the place himself and he cooks all the food. My son thought the pizza was fantastic and their white sauce is very very good. It's a plus to hear all the employees talk in Italian. I have nothing but good things to say about this place. You definitely should try it.", "author": "Sue H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "Amazing!!! The atmosphere was great, the service was phenomenal and the food... The food was delicious!! We had the ricotta gnocchi and it was really really tasty. Hope to eat there many times!", "author": "Jake O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "Traditional Italian food and pizza by the slice. The Eggplant Parmesan was delicious. Very friendly and warm service. Laid back atmosphere. This would be a nice place to grab a bite to eat and relax for a bit with a book.", "author": "Ania M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Try it instead of other north beach Italian restaurants - Flying under the radar never tasted so good.\n\nI moved to the area recently and have been trying to find a reliable and affordable Italian place that I can frequent for comfort food without the fuss of dealing with tourism traffic. This place looks modern from the outside, but the place is very much run by real italians and they've not been jaded in terms of food quality from having to serve throngs of tourists (yet). \n\nThe pizza is quite good (I've only tried the pepperoni once), but the truly outstanding dishes are the pastas that the cooks make on the spot. They're always properly al dente (just sightly undercooked like real Italians love) and the ingredients (such as the guanciale in their amatriciana) are some of the best I've tried along Columbus. I've tried 3 pastas here in 2 weeks since they've opened and they definitely make all the staples with more care and attention than other places. They also delightful appetizers that look great, but knowing me I'll probably just grab a slice with my pasta and pig out.\n\nI cannot directly compare dishes to dishes along all the Italian restaurants I've eaten at in the community but I know quality when I smell/taste it and I'm definitely going to come back for much more in the future; especially if their pastas cost under 14, whereas some of the more established places try to rip you off for more than $25, which I find ridiculous.\n\nMaybe they're just great for now cause they're new and they're trying hard to make an impression. I probably shouldn't write this review anyway cause I'd hate it if more traffic lowers their food standards..", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Delicious.  Can't wait until they get their wine license!  Exceptional meatballs.  Great homemade pasta.  And really amazing value especially by San Francisco standards.  Couldn't be more satisfied.", "author": "Andrew G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "Pizza and pasta are very good! Nice selection of salads. Lots of desserts to pick from. Overall, a very nice experience: clean, fresh and friendly!", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "Great delicious neighborhood gem. Had the veal tortellini and my gf had the spaghetti meatballs. And we had the tiramisu and lemon sorbet for dessert. High quality home made flavor for the mains and dessert. A must try!", "author": "Nima R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-22", "description": "This place has great service. The owner and wait staff were very attentive and offered suggestions on the menu. I ordered a Greek salad to start. It had lots of creamy feta, but was overall disappointing. The dressing tasted bottled and bland, and tomatoes and romaine were the only vegetables. I had the daily special, the veal tortellini with meat sauce. It was good, a solid choice. I would come back, but not frequently as it seems a bit overpriced and the pasta did not \"wow\" me.", "author": "Colleen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "Great little place with a relaxed atmosphere. Excellent food. When you go there ask for Simone, he will take care of you like family. Both him and Giuseppe have such good attitude and made us feel like old friends.", "author": "Blerina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "My must-go Italian every time I'm in SF.\nAuthentic food, large portions, genuine atmosphere and great service.\nI've never eaten a Carbonara like this out of Rome.", "author": "Marco C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "Delicious!  They even accommodated my request for low a low carb meal.  Very friendly staff & owner.", "author": ". .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "The food was pretttyyyy good not fantastic, but the owner and waiter were awesome.  Went in for some pasta and pizza and would go back.", "author": "Paul H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "Very consistently delicious!  I absolutely love this place; it's full of neighborhood regulars and Italians visiting from out of town.", "author": "C B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Fantastic! We stuck with the classics (lasagna and spaghetti with meatballs) and both were delicious. The insalata mista was fresh and generously sized. The owner and staff were very friendly and engaging. The icing on the cake was that prices were very reasonable by San Francisco standards. The space is small, but manages to be both airy and cozy. Yelp says this place is 'new and hot,' and I can see why. Highly recommended!", "author": "Travis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "Very nice waitress. We had pizza. It was excellent with thin crust. We also had pasta special.  It was top notch. Also had lasagna.  Very good. It was also reasonably priced.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "We had pasta, pizza and a salad here the other night. The food was delicious, the location was great and it was perfect with a couple of kids. Our waiter even brought us some free ice cream at the end for the kids even though they were being kind of loud and disruptive.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "I got one of the personal pizzas, and it was divine. I left satisfied and full, but not too full. I haven't had a pizza that real in a while. Ditch Pizza Hut, the grease, and the heart burn, and get pizza that will actually make you glad you just ate pizza.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "This is the best Italian food I've ever had. I came with my family that are visiting from  out of town and we were all loved this place. The prosciutto pizza was so fresh and tasty, the egg plant pasta was cooked just perfectly and everything was so flavorful and authentic. This place is also new so it's not too busy! I will definitely be coming back again soon!", "author": "Emily M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "The staff is amazing and the food is delicious! Come check this place out for sure. The atmosphere is so comfortable and relaxing. I feel like a regular already.", "author": "Sariah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "you know,  it is hard to find a good spaghetti and meatballs. This place has a great spaghetti and meatballs. Definitely coming back.", "author": "Craig V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "Great authentic 12 inch pizza or pizza by the slice. Very nice atmosphere! Will definitely come back next time I'm in town!", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-03", "description": "The food was mediocre at best; what was most intolerable was the waiter who brought dirty dishes to our table to inquire if we were finished- I guess trying to be efficient.  Waiter looked bored and couldn't care less.", "author": "Shaorn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-25", "description": "Love it! This place is the real deal. I ordered three pizzas to go--Margherita, Salsiccia, and the Pizza Alla Diavola--and a few meatballs for the kids. The service and decor was great and welcoming. I even got a little extra treat while waiting for the order. It's a wonderful spot and we'll be back.", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "Excellent service & incredible homemade pasta. The Sauce was so good that I waned to lick the plate. Prices were very reasonable.", "author": "Jim Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-19", "description": "I live in the neighborhood and have been wanting to try this place out. I stopped by today for lunch and couldn't be happier with the food and service.  I ordered the turkey sandwich and Greek salad, the two gentlemen working recommended the calzone over the turkey sandwich which was absolutely delicious. I'm excited that we now have a neighborhood restaurant that we can frequent. You can tell they are extremely passionate and authentic which comes through in all they do. Definitely worth checking out!", "author": "Monica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Perfecto! Amazing and fresh pasta, pizza, and cappuccino, and super friendly service.", "author": "Allie Rae T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "This place is cute and has delicious food. The service was excellent and the food was fresh and flavorful. You can tell they take pride in the food and service. Would recommend if looking for casual Italian food.", "author": "Kaitlyn D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "Amazing pizza! Their homemade tiramisu is to die for as well. So happy this is walking distance from my house.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Roman holiday in SF! They have pizza by the slice but I recommend ordering your own pie...amazing. We ordered the Ideale and it literally took me back to Rome. Also ordered the pork special which was tender and tasty. Great new spot!", "author": "Leah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "We found this place as we walked back to the hotel from union square. Both pasta dishes and the pizza were perfect as was the service. We finished with affogato which was excellent.", "author": "Dean L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-22", "description": "Had the vegetarian pizza and LOVED it, so sad I forgot to take my leftovers. I have never had eggplant on a pizza but this very thinly sliced topping was excellent. So many other fresh veggies with just the right amount of sauce, not soggy but enough to really taste it. The crust was spot on as well, I easily are more than half of the 12\" pizza on my own, not ashamed but definitely could've split it between 2 people and been more than satisfied.", "author": "Amanda W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "This is exactly what our neighborhood needed! Unpretentious, delicious pizza with little wait. It's reasonably priced, and the owner even gave me a free slice since it was the end of the day. If you want a nice warm dinner without any fuss, come here!", "author": "Natasha B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-01", "description": "We are visiting from SoCal and  looking for a little gem like this on our quest to find small non - touristy places with delicious food. My daughter spotted this place as we walked toward the more touristy part of north beach and we were glad she did. We tried the pizza margharita and the veggie pizza and a spinach pie like item that wasn't on the menu but was on display and they were delicious. Very friendly and attentive service. We will definitely return next time we're in SF.", "author": "Annette L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "terrific italian pasta and desserts!!! \nhighly recommend this place.\nvery friendly staff!!! Esp. Josepi", "author": "Henry O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "Great service, fresh ingredients and very clean.  Had lasagna and pizza and both were great. A great place for a casual dinner date! The only - no beer or wine", "author": "Ruth H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "A really enjoyable meal.  The atmosphere is upbeat and cozy.  The service was excellent and friendly.  The food was fresh, hot and seasoned perfectly.  It felt like you had been invited to an Italian family dinner..", "author": "Nan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "Piccolo Forno has all the street appeal that a traveler like me was looking for in a local pizzeria. I am so happy to report that the pizza here is the best tasting pizza i have ever had, the price was fair and the atmosphere was cozy. I really think this will be a staple for my future visits to SF. I highly suggest this place but be warned it can get full fast!", "author": "Anthony A."}
