{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "We had guests in from Australia were down in the area sooooo why not try a classic SF bar, inside another SF classic \"The Palace Hotel!\n    As a bay area resident for over 30 years this was my first time venturing into the Pied Piper ~very sorry it took me soooooo long~ this is a elegant, chic, traditional SF cocktail lounge. Loads of business men in their suits, quiet conversations, cushioned banquets, dark hardwood on the walls, nuts on the tables & the iconic mural over the bar~\n   Nice mixed drink selections and healthy pours (which did surprise me for sure!!!!) the food menu looked interesting however this was strictly a libations stop b4 dinner for us. We arrived about 4:30ish not to full, however by the time we left it had a consistent influx of thirsty business people.\n    All our cocktails arrived timely and one of the best observations was we enjoyed conversation (there were 5 of us) without having to strain our voices/ears.\n    Expected to be back in SF in August and we will be back for sure! Again! & AGAIN", "author": "Becky L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-26", "description": "Meh. The story and history of this \"San Francisco staple\" is a good one, the restored painting behind the bar is certainly iconic. Also make sure to checkout the palace hotels lobby - it's exquisitely gorgeous! \n\nThe cocktails are good and nicely presented but on the expensive side. I mean it IS SF, so it's expected...but upwards of $15 for a drink. Overall worth it as a bucket list destination. \n\nIt can be crowded and so the service can be slow and inattentive.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Good clean meal in a comfortable environment. \nA must stop for any MAXFIELD PARRISH fan (and I am).\n\nExcellent place that doesn't allow San Francisco's copious legions of junkies to leave their hazardous waste on or about the premises.  (at least for now, see if the Board of Supervisors changes enforcement guidelines)", "author": "Ricardo O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "I came here because of the name! \nI'm a big fan of the show Silicon Valley, and I really wanted to check out Pied Piper bar. The bar is located inside Palace Hotel, and it's a classy bar. The drinks are on the pricey side, but it's definitely worth it for the atmosphere. There are plenty of space, if you come early. It's nice to grab a drink at the bar, and after walk around the lobby of the Palace Hotel. I highly recommend this place, especially if you want to go to a bar that's not too loud but has a unique aesthetic.", "author": "Brenda Jiwon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "I had the pleasure of having a couple free drinks here with my stay at the Palace Hotel in the city.\n\nI was celebrating my 28th birthday and the concierge was kind enough to give me a few drink coupons!\n\nThe Pied Piper is really classy and old school. There's a large beautiful old looking painting of what I guess would be a depiction of the \"Pied Piper.\" \n\nThe ambiance is intimate, dark. Dark wood furniture.\n\nMy drink was made perfectly. I always get my usual which is an amaretto sour, came out perfectly.\n\nThey also serve nice plate of mixed nuts. \n\nA great place for a nice cocktail to talk and enjoy a drink. Not too busy either.", "author": "A Z Flor H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-30", "description": "Stopped in for a quick drink on my way to my hotel. Great dark old place. I love these type of places. Had the mushroom bisque and it was amazing. And the reason I gave this place 4 stars. If you like mushroom soup, mushroom or a bisque then u must try this soup. Their old fashion drink is very tasty as well. A little bit on the sweet side for my taste but still tasty.", "author": "Tracey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "You might be forgiven for thinking that this bar has something to do with the HBO comedy, but it actually has quite a storied history thanks to its panoramic, showcase Pied Piper painting from artist Maxfield Parrish. \n\nAlready in a grand setting - a high-ceiling, spacious venue in the lobby of the Palace hotel - the painting is an unmistakable draw of attention, and is a surefire conversation starter over some spendy but quality drinks. The blueberry Manhattan (blueberry infused Makers' Mark, sweet vermouth, benedictine, peach bitters) and Last Cocktail (Bombay Sapphire gin, lemon juice, organic pear juice, rosemary syrup, prosecco) were quite tasty and sufficiently strong.\n\nService was engaging and professional, and there are also light bites if you want something solid with your drinks. You might come just for the painting, yet find yourself staying for some good drinks and conversation.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-06", "description": "oh my goodness please someone staff up in this bar/lounge. service was really bad. really slow. I think there were probably two bartender/servers taking care of the entire room that is off to the side of the bar. And what a shame because the atmosphere is AMAZING. The couches are superb and the coffee tables and other decor lend to such a great vibe.\n\nHad a charcuterie board and some truffle fries. Food was good.\n\nCocktails were poured well, but my drink order was not perfect the first go around so I just got up and went to the bar myself to ask for the correction.", "author": "Alexandra M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "My BF is all about the atmosphere... so we went for a late lunch after some retail therapy in the city.\nAtmosphere was delivered in spades!  Cozy and not crowded in the late afternoon, we grabbed a great table.\nSmall food menu but great choices.  Decent wine list. Server was great.\nWe shared a club sandwich and truffle fries, I had a glass of  Viognier. \nFood was good, not amazing, but this was all about escape.... nice break from a trying time.  Peaceful in off hours. Perfect!", "author": "Katherine F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-13", "description": "I've walked by here, oh probably hundreds of times but never really bothered to give this place a chance until today.  I just got off working a 12 hour shift and unfortunately Per Diem had a 1/2 hour wait and I was starving for a decent sit down meal.  So Pied Piper it was.  \n\nMy partner ordered a burger and I wanted to eat a healthy salad after stuffing my face with chocolate and Fritos chips (needed to appease my guilty conscience). \nMy goat cheese salad arrived and I was pleasantly surprised to see a beautifully dressed salad garnished with a colorful array of flowers. It was a shame the lighting in there was dim because it was a sight to see! I took the first bite and marveled at how fresh it tasted. The goat cheese, heart of palms, soy beans, quinoa, spinach and endives all merried well with each other. It was like a functionally productive eco system I thought as I hurriedly inhaled my salad. \n\nThen I took a bite at the burger and I was floored. I couldn't believe I lived a block away and never tried this place!!! I don't know if it was my famished, delusional stomach talking but it was one of the best burgers I've had. What gave it an edge was the bacon!! Super abundant and super crispy like a potato chip.  The meat was tender and thick and the buns were solid. \n\nOur server was prompt and efficient, came by just enough to make us feel we were not in want of anything. \n\nDefinitely coming back, this time I'm getting the salad and burger all for myself :)", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-04", "description": "Loved the $3 million dollar painting that the bar was named after.  Did not love the anything but $3 million dollar service we received.  Before I completely disband this bar's reputation, I have to say that the ambience of the bar was spectacular.  The feet long painting, with all its vibrancy, was the shining star, the focal point, of the bar and it definitely kept me mesmerized while sipping on my drink.  The dim lighting and all the high-backed upholstered seating was also quite lux - there's nothing not love about the atmosphere here.  \n\nThere is likewise, nothing not to love about the cocktails here at the Pied Piper.  You'll find many cocktails that are understated, yet very bold - perhaps this is why the bar is named one of the best in San Francisco.  I enjoyed a Fully Monty while my fiance ordered the Charlie Chaplain.  Mine was sweeter (though not too sweet) whereas his was slightly more bitter.  We had also ordered a beer to split between the two of us however, I don't recall which one it was...I only know that it was strong enough to make me feel significantly more tipsy.  \n\nThe trouble is this: we loved our drinks, but the service was horrid.  We had been given two drinking vouchers as we were Starwood hotel guests here at the Palace Hotel in which the Pied Piper is located.  Yes, we were able to use these but not without great attitude by the staff.  When our waitress was present she was rude, but otherwise she was nowhere to be found...and even when catching her attention she never came to our table except to take the order...someone else even dripped off our drinks.  When we'd ordered the beer  (from another staff, mind you) we drank it and waited 25 minutes to pay.  We tried flagging people down and had even gone to the bar to ask for our waitress, and no one ever came over so with that, we left.  It wasn't our intention when coming in, but it was ridiculous.  It's the service being ad terrible as it was that makes me say this is anything but the best bar in San Francisco.", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "This is a popular Bar in The Palace A Luxury Collection Hotel. There have 2 zone in Bar for donning room and drink room. You can sit everywhere you want inside. About foods is ok not really big menu. \nAbout service is good and friendly.", "author": "Somphop S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-16", "description": "I stayed at The Palace for 12 days for work, so I was excited to find there is a restaurant conveniently located within the hotel. The staff is amazing - professional, friendly and timely. The decor is also beautiful. However, the food itself was below average for its price point. The calamari I ordered was very bland and tasteless ($17), and sandwich was overly greasy ($24). Hence, it was my one and only visit during my stay. I however, recommend the Garden Court Restaurant located behind the main lobby.", "author": "Suzy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "It's a San Francisco institution. Went with a couple of out of town friends Thanksgiving Day. Wanted to show them the palace, Garden Court Cafe, and grab a drink in the bar. It was jammed packed, expected, but with little kids in tow?  Really?  About 6 or 7 if them in there. Not pleasant. Had bloody Mary's  - about a 3 - fine, not memorable, fries - 4 good - and chicken wings - 1 really really tasteless, not even seasoned with salt.  Service was horrible but again expected on this day. A brand new server was the most attentive. The actual server a real turd. Go for the art - the Maxfield Parrish on the wall behind the bar, and not on a holiday. The 4th and extra star is for the Maxfield Parrish painting.", "author": "Marguerite S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "1st visit at this location...we had the Wagyu burgers--beautiful presentation -- the taste - worth the price! Also had the calamari as an appetizer - was pretty good! Love the decor and ambiance here - plus it's inside our hotel - The Palace -- service was great!", "author": "Margaret B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-21", "description": "3.5 STARS\n\nMet up two friends here before going to an event nearby. One of my friends arrived earlier and managed to save a couple seats at the bar. I joined him a little later around 5:45pm. We met up on Friday, September 9th.\n\n*Harding's old fashion: basil haydin's, ruby port, fernet branca, brown sweetner, orange bitters ($14)\n*Oban \"14 year\" ($17) ×2\n*Charlie chaplin: absinthe, old overholt rye whiskey, dubonnet red, honey, peychaud's bitters ($14)\n*Cragganmore \"12 year\" ($15)\n*1906 martini: unfiltered belvedere, glenmorangie 10, lemon oil ($14)\n\nI've been on a straight pour kind of kick, so I haven't really been ordering cocktails. I ended up getting the two Obans neat. The pours were average and the price as well. I think my friend enjoyed the old fashion. I'm not a huge fan of fernet, so I didn't like that addition. He also got the martini and seemed to like it. My other friend got the charlie chaplin which was more up my alley, though I only had a sip for tasting. He also got the pour of cragganmore. When sitting at the bar, they also give you what looks like an Asian snack mix with peanuts. Good for snacking if you need something salty with your drinks.\n\nI actually liked the vibe and decor of the bar. It feels a little old school with all the dark wood, but there's a hint of extravagance in it. And even though it was busy, it didn't feel too crowded or loud. We were able to enjoy our drinks and have a conversation. Our bartender was nice and attentive. Noticed whenever our drinks were done and would ask us if we were ready for the next one.\n\nFun, quick stop. Nice bar to have a couple of rounds.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-04", "description": "the atmosphere is nice, the service is very good, the food is so so but I have lousy wine.", "author": "Than N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Cecilia was our waitress. Quick and efficient and accommodating to my friends 30th birthday. Food was impressive. The cod was unbelievable !!  \nThe ambiance is classy and old which we loved. The painting is gorgeous behind the bar (worth 5 million I hear)! I would definitely eat here again.", "author": "Elease A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-05", "description": "Typical hotel bar, except for  a great old Max Parish painting, filled with buzzed traveling sales people. They're are so many cool watering holes in SF, why bother coming here? SoMa or even North Beach offer cooler options.", "author": "J B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "Great spot for happy hour cocktails after work. It's off the lobby of the Palace Hotel. Fast and friendly service. The drinks were reasonably priced, the food was a little expensive, but it was very tasty and filling.", "author": "Lou S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-20", "description": "Expensive food, food was OK, slow service, getting water was like drawing blood from a stone. Nice environment", "author": "Eric B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-27", "description": "Mmm    \n\nNo so much\n\nHad the garlic fried chicken \n\nNot so much garlic or chicken \n\nHeavy breading over small mixed pieces of chicken with a smooth mashed potato side and a few green beans \n\nNo discernible garlic\n\nSide sauces were uninspiring and probably came from bottles \n\nRoom is wonderful. Classic walls and intricate ceiling and nice mural decor\n\nMusic 80s. Not too intrusive \n\nBig TVs with games on.  \n\nOk in a pinch", "author": "Dave H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-23", "description": "Supposedly they have open seating. I was asked to wait while they cleaned a table and then two couples swooped in and took what should have been a table of me.  The host/server would not ask them to leave, so I did.  Still no seat, until one couple did finally get up.  Then I was served cold truffle fries for $14.  I had them sent back.  Don't waste your time or money here.  I had better service and food at a gang infested bar in South San Jose last weekend.", "author": "K G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-21", "description": "I thought this place had so much character.  Being in here you get a glimpse of how things use to be in SF in the 1930's-ish.  This place, in it's day, was the spot to be be!  People would come just to drink and  stare at the famous painting at the bar.  Now the place has a modern touch with TV's and such,  but it has kept it's integrity.   It was mellow for lunch and we were able to sit right away.  I really loved the decor.  We started with the cheese plate which was so good, maybe one the best ones I've had.  Then I had the shroom burger--no bun.  No complaints other then the waitress didn't bring me any ketchup or mustered to go with it, but the other person I was with got a burger and she brought some for him.  I would definitely go back.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-18", "description": "Tired.\nStale.\nLackluster.\n\n3 adjectives I do not want the venue I choose to have a sophisticated drink to be.\n\nEspecially when 2 drinks average 40 bucks.\n\nAnd the service?\n\nTired.\nStale.\nLackluster.\n\nI know that hotel staff can be very unenthusiastic.  I get it.  But the service we experienced last night hit a whole new level of corporate impersonal.\n\nFirst off, the bar was full except for one empty seat.  We were told that that seat was extra, & wasn't supposed to be there.  I'm sorry, what?  \n\nI immediately saw 2 women had just paid their bill & were about to leave.  I said \"those 2 ladies are leaving, can we take those seats...?\"\n2 different employees told me they weren't leaving.\nOne right as the 2 ladies stood up...to leave.\nShe then said \"oh, you can take those if they're leaving.\"  \n\nBrilliant.  I must have said they were leaving 3 times.  I've never felt staff go so out of their way to not welcome or accommodate us.  They had no interest & couldn't be bothered.  If you're not happy to be working here, then don't.  I'm not responsible for your career path or unrequited dreams, right?\n\nThe bartenders were...civil.  It would be a stretch to say pleasant, but they weren't completely impassioned.  We asked one bartender about the liquor they had in a glass case.  He informed us it was Louis XIII, in the most expressionless way.  My man didn't hear him the first time, so the bartender then practically barked it at him.  Much in the same style as when we first sat down, & the bartender gave us the bar snacks so haphazardly that he may as well have thrown them at us.  Like we're cattle.\n\nThere is only one reason to come here.  That painting.  \n\nAnd that's it.\n\nThe Big 4 at The Huntington Hotel runs MILES around this place.  That's where you should go the next time you want a drink in a refined establishment.  Dirty Habit, Hakkasan, Bourbon Steak, Top Of The Mark...are also exceptional.  \n\n1 star for the Parrish.\n1 star for bringing it back.\n\n2 stars period.\n\nWait.  I was too generous.  Giving credit for bringing back the painting when they should have understood that it shouldn't be sold in the first place?!  \nThat's like giving a kid credit for brushing his/her teeth.\nYou're not supposed to get credit for doing the bare minimum...\n\nONE star.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "Beautiful, dark paneled and elegant space to enjoy a drink, while taking in the painting of the Pied Piper.  A must see bar and hotel, if you are in town. Lots of history in that structure. \n\nThere is a menu you can order food from. We had the Poke and a large salad. I'd skip the food.  Not too tasty and overpriced. \n\nThe Palace Hotel is very elegant, but not a snobby place. \n\nService is professional and courteous.", "author": "Teresa F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "Having a drink at the Pied Piper Bar was on my friend's \"Bay Area Bucket List\" so we decided to give it a try. The bar itself is located in the Palace Hotel. My friend and I sat at the bar, and we drank from The Cocktail Collection section of their menu. Both their Last Cocktail and Market Gimlet were strong, refreshing, and tasty! The bartenders were super friendly and kept restocking the little Asian snack mix they provided.\n\nWe didn't get to try the food here, but if the fries from Flatiron Wine & Spirits (next door) come from Pied Piper, then I know they're REALLY good. There's plenty of seating, though we saw that it get pretty busy during dinner time... obviously. Great lively vibe. On the pricier side, but I'd imagine it's a decent place for casual business meetings, especially if you're coming from out of town and staying at the Palace Hotel.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "I went to The Pied Piper while I was staying at The Palace Hotel, and the experience was excellent. My friend and I were there on New Year's Eve so I was very surprised that we were even able to snag a table, but there was one available in the bar section. We both ordered a whiskey sour and a Vesper. My one complaint is that the Vespers where made with gin instead of vodka, but it wasn't a huge deal. The drinks were definitely not watered down, so I felt like we were getting our money's worth, and the service was relatively quick considering how packed the bar was. We also ordered the truffle fries, which were delicious. The spot is pricey, but for a special occasion it definitely delivers. All together, a fantastic experience!", "author": "Alli S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "This bar was amazing. They have everything from gourmet appetizers to your basic tavern fried foods that feel more upscale because of the atmosphere in the bar. All the architectural details are stunning and the staff are very welcoming and friendly! A must try if staying at the Palace Hotel or nearby that area of the financial district.", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-11", "description": "Gone down hill for sure.  Too many kids, too many TV screens, mediocre service, tasteless drinks, and the Streak tartar looked like is was ground hamburger and not finely cut filet.   Too bad so sad.  Oh, ya.  It's pricy too.\n\nSince when do kids belong in a bar anyway.  If you are an adult, look elsewhere.", "author": "Kai T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Everything is cool about this old hotel and bar. In beautiful condition and food is good. But why are they playing pop crap techno in a super old school wood paneled bar? Music does not fit at all with the vibe. Try some Erroll Garner", "author": "Greg L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-02", "description": "Staff completely ignored us and it's overpriced. They need to fire the staff. Friendly service please! Then I'll pay for that fancy cocktail", "author": "Alan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-09", "description": "If you can, head to the back room rather than the front bar. It's much quieter and has a really great ambience to just sit and enjoy chatting with your friends over a drink or two. \n\nMy only gripe is how pricy the drinks are.", "author": "Kristen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "Beautiful, iconic bar in the Palace Hotel on the corner of Market Street and New Montgomery in San Francisco.  The drinks are expensive (you're paying for the atmosphere), but the bartenders know how to make just about everything.  Did you know that King Kalakaua of Hawaii once stayed at the Palace Hotel? Even if you can't afford to stay in the hotel, it's worth coming to this bar with a friend, colleague, or loved one just to enjoy the ambience!", "author": "Norm G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-06", "description": "Bad night. I brought friends by to show them the painting, which is pretty much the only reason to visit the place. Sadly we sat in Ria (Rhea?) section and she acknowledged us after five minutes and then didn't come back  for ten minutes so we got up to leave. We drew the eye of another waiter and I asked him whose section we were in, which is how I got the phonetic of her name but even them he didn't ask why we were leaving. \n\nThis place is poorly run and will likely soon fail. We were accosted by beggars outside and inside the hotel. Just not the scene you want.  Go elsewhere. The staff doesn't give a crap and the drinks are fungible with any other place.", "author": "Rich V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "Fantastic cocktails.  Service is very good at the bar, and people are very friendly. The hotel is gorgeous and definitely worth a stop.", "author": "Crystal S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-20", "description": "Great hotel bar! Dark wood, great liquor selection including tequilas, bourbons, and single malts. HOWEVER... Hands down one of the WORST Guinness pours I have experienced! They pour Guinness the same way they pour IPAs and lagers! If you love your Guinness, DO NOT come here!", "author": "Steve L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "I have had two bad experiences, food and service was weak...but it's a beautiful, quiet bar. The Palace is in my personal top 10 so I really WANT this bar to be great. The bar menu has four things on it I would order. The food menu is too long, too fruffy. I had the \"Tuna Poke\" that was quite tasty. It had a little kick, big cubes of Ahi & Avocado. The service was much better than my first two trips. They had Thursday Night Football on at one end of the room...soccer on the other. There were a lot of people having a fun time. I'll be back...if for no other reason but to see the fantastic Maxfeild Parrish painting, The Pied Piper.", "author": "Rodney M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-18", "description": "Very average, wouldn't go back. Supposedly best burger in san fran, it really wasn't.\n\nOne server was very rude too. \n\nWings and calamari were nice.", "author": "David K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "If you want to have some cocktails in the perfect hip vintage lounge bar, this is one of them - in my humble opinion.\n\nWalking through the hotel lobby to the bar is an experience. The place was built in 1875 and rebuilt after the San Francisco earthquake in 1909, and all of its opulence shows.\n\nThe Maxfield bar / lounge is an upscale setting where you can drink as well as eat if you wish. It is so fucking beautiful and has a comfortably cool kind of classic rat pack hip place to have a drink feel. Take a look at my photos.\n\nThe huge wall painting by Maxfield is a reason to come here alone just to see. Absolutely gorgeous if you're into art.", "author": "Jonah O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-27", "description": "Poor food selection. Quality of food not great. Server was nice but food definitely not worth the amount we spent. Can't believe this is one of two restaurants at the Palace.", "author": "R B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-16", "description": "The other reviewers are right that this is a great place for one cocktail.  The bar is beautiful, but the service is slow and the prices are pretty high.  It's really all about the painting and the atmosphere.  It's still fun if you want to just relax after shopping and have one cocktail in a beautiful place.", "author": "Greta R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-17", "description": "It is too bad that a famous bar in a famous hotel should be so below par.  I asked for a Gibson; I was brought a Gimlet; asked again, and was brought a Martini; and this went on.  No one seemed to know their cocktails, or even to follow directions.", "author": "Bruno A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-18", "description": "So I came back to update this review after thinking more about it. For the price and the hype, this was a huge disappointment. The only thing saving this from a single star are the fries which were good. There is a sign outside advertising \"The best burger in San Francisco\" or something similar. That really made me interested because I love a good burger and being new to the city was hoping this was it. I was gravely disappointed. The meat might have been good, but it was so charred and overcooked that there was nothing to taste. To add insult to injury it was expensive too! I would love to come back as it's so convenient and the inside was a cool old world classy, but I just don't think I can for the price. Sorry Pied Piper, if you can't get a burger right, I'm not interested in what else you have to offer.", "author": "John W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-16", "description": "This bar is located in the Palace hotel, fyi. I really didn't need any more drinks but my friends raved about their gimlets. So we stopped here to try their drinks. We got a round of the Market gimlets. It's served in a tumbler like glass. Not sure how much it was but pretty big size drink. It was super tasty - there was like a basil or cucumber flavor to them. I think they were strong but I really couldn't tell at this point in the night. It was our last stop and well past midnight so I think they had also stopped serving food. And another friend ordered the St. Germain cocktail. I had a sip of it and it was delicious. They use like an elderflower liqueur and I think it tasted like lychee. Mmmmm. Would like to come back for HH, food, and more drinks!", "author": "Alison W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-09", "description": "I was never sure if I was supposed to call this place Maxfield's or the Pied Piper, but I used to come here often in the late 90's when colleagues needed a place to congregate after work. But I hadn't been back for at least a decade when Jamie W. read in a blog that someone anointed their burgers as the city's best. Really? I mean, I just went to The Original Perfect Hamburger in the Tenderloin, and I thought they had the city's best. Actually I didn't think that, but I do like the ballsy name of the place. On the other hand, calling a place the Pied Piper makes me think I will be led down the proverbial garden path to no good end. Yes, I know it refers to Maxfield Parrish's 1909 painting which is finally back behind the bar after a long-term restoration. Truth be told, I never liked that picture anyway since its overly fanciful tone borders on the creepy.\n\nI forget that Maxfield's is divided into two parts - the always-crowded bar in front and the cavernous ballroom that acts as a dining room most nights. We made a beeline to one of the big booths, and both of us ordered the $20 Pied Piper Burger, medium rare, with Swiss cheese, a couple of strips of Applewood smoked bacon and fries (photo: http://bit.ly/15L9l5a). The beef was quite food in quality but still a tad dried out for medium rare, and the fries were downright arid. Better were the $11 Bacon-Wrapped Scallops using the Applewood smoked bacon again around a half-dozen plump scallops (photo: http://bit.ly/15L9kxS). One nitpick - we hated the mini-jars of mustard and ketchup, the same kind they use on business class, because hey took forever to unseal and open (photo: http://bit.ly/1ajid07).\n\nRegardless, we liked the quiet ambiance so much that evening that we returned a few weeks later. On our second visit, we saw a mini-stage was set up for a jazz-swing ensemble to perform (photo: http://bit.ly/18Oivc6). Oh dear, it's swing dance night, and the senior regulars came trickling in with their natty duds and talcum powder for the soles of their shoes. But before the jitterbugging began, we shared the $10 Crispy Confit Chicken Wings, a pallid pile that wasn't enlivened by the Fresno Chili Sauce or the Pt. Reyes Blue Cheese (photo: http://bit.ly/17OVsg4). For his entree, Jamie ordered the  $19 Chicken Club Sandwich, which was lackluster hotel fare with roasted chicken breast, bacon, tomato and red pepper aioli between crusty focaccia (photo: http://bit.ly/1euPeZQ). Served with fries, it tasted like room service food left in the hallway a bit too long.\n\nMy dish was easily the better one, the $25 Fulton Valley Roasted Chicken with roasted potatoes, blue lake beans and salsa verde (photo: http://bit.ly/17Ks3ri). As we tapped our toes to the band, we held court with a couple of the house specialty cocktails at $12 each. Jamie had the so-called Last Cocktail, which was a mix of Bombay Sapphire gin, lemon juice, pear, rosemary infusion, and prosecco (photo: http://bit.ly/1cXy8SD). I had the Market Gimlet, an intriguing blend of organic cucumber vodka, fresh lime juice and tarragon-infused agave (photo: http://bit.ly/1euOGTH). Both were tantalizing enough for us to consider cutting a rug, but I was in no mood to be Fred or Ginger that evening. Clearly there is an ideal customer for Maxfield's who wants to have the comfort of old-style American food while tripping the light fantastique.\n\nFOOD - 3 stars...nothing too exciting and adventurous on the menu if that's your cup of bland\nAMBIANCE - 3 stars...old-style dining room with a bit of swing on some nights\nSERVICE - 3 stars...old-school, sometimes disappears for long stretches\nTOTAL - 3 stars...stodgy but quiet and spacious on any given night but expect hotel-grade food", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Omg ordered the wings, tried my friend's cubano, and the fries with the truffle dip. All of it was excellent! The truffle dip, I wanted to take that home with me. So good! The service was great! The atmosphere was nice. The bar is beautiful! Will be back the next time I visit SF.", "author": "Toni R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-16", "description": "Little by little, the ambiance of this gem has been reduced to a shadow of its former glory. After many years of enjoying its cozy charms we have finally given up on it. What is the management thinking?\n\nFirst they ruined its lovely and iconic painting by overshadowing it with two huge TV sets that play non-stop sports. Classy?  I think not. Next, they removed the historic photos from the walls and replaced them with large, oddly-shaped images of the hotel.  Their awkward placement hides the lovely wood walls, and we assumed they were temporary, but alas they seem to be here to stay. Finally, they have changed the lighting from the warm light of the chandeliers and table candles to the harsh blue light of what seem to be fluorescent tubes behind some of the ceiling glass.  This leaves most of the tables in gloomy darkness, and the rest of the bar as harshly lit as a laundromat.", "author": "Alison P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "This place was made for martini lunches and booze-soaked happy hours. It ain't cheap, being in the Palace Hotel and all, but if you want a bit of old-timey ambiance with your cocktail, Pied Piper is what's up. It's dark, full of glossy wood, and man cave décor. Draper and Sterling would most definitely approve. \n\nService is impersonal, the servers just trying to keep up with the demand from their high-fly business clientele. That said, this place is perfect for biz meetings, when your expense account is paying for those $15 drinks.", "author": "Nique F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-07", "description": "I think a place has to try really hard to be this bad. \n\nDungeonous crab appetizer had an excess of celery salt- poor and salty. \n\nThe lobster bisque had chards of tomatoes and the spice- I think tumeric was so strong it took over. \n\nMy companion got the Caesar salad with chicken. The chicken was dry and over cooked. The service is pretty poor. . \n\nWe waited to be seated in the dining area. After 10 minutes of not being acknowledged, we sat in the bar area. The other night when we came for a drink, they told us they wanted to go home and started chasing everyone out at 11:45 pm. \n\nWe hoped for a decent dinner but were disappointed. Save your money!!   Too expensive, worst food, and poor service. I would have given zero stars.", "author": "Laurie F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-21", "description": "This place used to be a good place to have good meal. Now they've changed the menu and caters to the noisy rowdy convention bar crowd. Another one bites the dust!!", "author": "Nancy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-31", "description": "If you have time for a single cocktail at a legendary bar this is your place. \n\nThe restaurant food isn't great\nThe service isn't either \n\nBut the painting is incredible.", "author": "John R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "AMBIANCE: in the Palace Hotel. They have bar seating and then a larger more open room with tables. Very classy, beautifully decorated, feelings of old luxury, gorgeous historical painting over the bar (hence the Pied Piper), live music with a very talented band (maybe only certain days of the week, we were there on a Friday). \n\nFOOD/DRINKS:\nCocktails: they boast about their \"signature\" cocktails. I tried the Ralston Cocktail which was Absolut pear, passion fruit puree, and peach bitters, topped with sparkling wine. I noticed that a lot of their cocktails used cheaper/mid-range alcohol, yet the drinks were $14. They also make a pretty mean Manhattan. I'd say the bartenders are talented. The Market Gimlet also seems to be pretty popular. \nFood: I was absolutely surprised that the food was so good. Pricey, but delicious. The salmon ($29) was cooked perfectly and served with brussel sprouts (YUM), butternut squash puree (YUM), potato hash. The trout with couscous was also good. I would also recommend the burger. It's huge! The spicy shrimp salad looked meh. The bread basket was also noteworthy with the biscuits and the olive bread. \n\nSERVICE: very nice, prompt, quick. The waiter even noticed the kitchen forgot to put the sauce on the trout so he took it back for us. \n\nEverything was pretty on point, but it is pricey. It's a good place to go for a date or a business meeting with some drinks, something were you need to be intimate but don't mind the background music of a live band. The historical aspect to it is also a plus. Great experience overall, but not somewhere I'd go all the time.", "author": "Sara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-13", "description": "If you want to be a baller in SOMA, then this is the place to grab drinks after work.\n\nLocated in the fancy-schmanzy Palace Hotel, MaxField's Pied Piper Bar is a pretty hip, happening spot for an old-school venue. To be honest, I was expecting a much older, stuffier scene (eg elderly women sipping tea and playing Bridge). But this bar attracts a wide arrange of people (young and older). In fact, it took my friends and I 10 minutes to find a table where we could perch our thirsty bods.\n\nThe interior sort of reminded me of the House of Prime Rib (lots of leather chairs, wooden tables, a long bar, and servers dressed up in formal attire). I don't know what it is, but there's something about the setting that made me want a martini. While my friends opted for a glass of bubbles. Prices, while high ($12 for a cocktail), are still no higher than other places in the hood (I'm looking at you Trou Normand, House of Shields, etc.).\n\nService is prompt and efficient. But given how busy they are at 6pm, it's definitely not a place where you and your server are going to engage in lots of idle chit-chat. \n\nIf you're looking to impress a client or a date after work, then I would def recommend Maxfield's Pied Piper Bar. Or, if you and your friends just want to do some fun people watching, this is the spot for you. I'll definitely be back!", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "An outstanding bar in the Palace Hotel on busy Market Street. Come here at the wrong times and it will feel exactly busy and crazy inside as it is outside, but even on busy days, this place provides a nice respite from the milling crowds outside.\n\nOne does not come here for any vaulted cocktails, because the bartenders while friendly and attentive, can only make the basic cocktails (old fashioned, manhattan etc.).  Asking for anything like a corpse reviver will need instructions that are executed pretty well, and with a smile.  The nosh list is quite good with the cheese plate and baked potato croquettes being particular favorites. The croquettes boast a beautiful texture and flavor bomb enveloped by a perfectly fried crisp outside that is a perfect accompaniment to a beer in the summer or a warming cocktail in the fall.\n\nOverall a old fashioned interior complemented by old fashioned attentive service and a pretty good old fashioned make this is a worthwhile stop on any pedestrian journey on market.", "author": "Sunay P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "Love the vibe of this place at the Palace. It's a great place to stop and rest your tired feet after hiking around the city and get a nice glass of wine or cocktail before your dinner reservation. Unfortunately, the service can be quite spotty. If they're properly staffed it can be great...if not it's frustrating. We had to get up and put our jackets on to get our tab the other day as the waitstaff was clearly overwhelmed and not able to check back with us after our food arrived. Not good for a luxury hotel.", "author": "Anne K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-15", "description": "I do not like giving only 1 star especially to a restaurant in a ritzy hotel but we came to the Palace Hotel to spend our Wedding Anniversary. The Hotel is grand and we would highly recommend it however,  Maxfield's Pied Piper Bar menu clearly states that their Kobe Beef Burger is the Best in the Bay Area~me thinks not. This poor burger was cremated by the 'chef'\nMy husband clearly ordered this burger medium; which is a bit pink in the middle. This burger came out totally well done, dry, no flavor. Why would any 'chef' totally over cook expensive Kobe beef is beyond me. Also, our waiter was so forgetful. The restaurant was not busy at all either. He forgot my husband's wine, didn't bring us napkins with our appetizer. He was jolly however. We would recommend going somewhere else in the area as there are plenty of other delicious restaurants!", "author": "R. B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-19", "description": "First time here. It was early on a Saturday...about noon. Came in for a reconnaissance pass to see if we liked it. Didn't. But the wine was good: Stag's Leap Merlot at $18/glass. We split the glass due to the cost. \n\nThought about having dinner there later, but they would not offer a reservation (\"we don't take reservations, we're a bar\"...really?). Funny, they have both lunch and dinner menus, which make them appear like a restaurant. From the lunch menu, I would have ordered: New York Steak $32 (grilled Delta Queen asparagus, olive oil rubbed baked potato). But, NO! Sorry, I'm not going to try a major hotel restaurant on a Saturday night without a reservation. Been there, done that.\n\nBeautiful space, dark and mysterious. Calming and well decorated. But the staff is not quick to serve, and with no reservations, they are rendered into a minor league \"bar\".\n\nVery disappointed. I expected more from a Sheraton Luxury Collection hotel.", "author": "Reyn J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "This place was awesome.  My fiancé and I came here to celebrate after I proposed to her.  \n\nShe said yes, so we had a few glasses of champagne and I had a dirty martini with gin.  To be honest, we probably wouldn't have come here if she hadn't of said yes.  \n\nI'm glad she did. \n\nThe mural on the wall is awesome and colorful, the service was incredible and I'm getting married(!!!) so\nFive Stars!!", "author": "George P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-05", "description": "2 stars for food. 5 stars for the classiest dining room in SF, may it never be \"improved\" as the old Compass Rose was, as when Michael Mina was given permission to PAINT THE IRREPLACEABLE WOOD PANELING for his abominable corporate hack restaurants. \n\nSo please admire the hand-laid mini-tile flooring, the two story wood paneling, the coffered ceiling worthy of a European palace, the priceless stained glass panels from San Francisco's own United Glassworks, installed in 1909 when the Palace reopened after the Great Earthquake. The Bar itself was once the Buffet Room, and the Restaurant was formerly The Grille, a gentlemen's Dining Room (men and women had separate DRs in the Gold Rush days!).\n\nThe recent remodel has fully upholstered the high-walled booths (which are moveable); they are delightfully comfortable if you can get there early enough to snag one. \n\nThe food...well, it's corporate. But still, the portions are large, and a couple of dishes were actually quite good. We hate the current fad for heavily battered chicken wings, so we loved Pied Piper's simple flour-dusted, extra-large, generous portion of wing parts. Comes with two dips: a very good blue cheese (real cheese, mashed with milk, not blue cheese dressing from a jar), and a simple but tasty hot sauce.\n\nThe 1909 pork schnitzel special had overcooked pork, but was otherwise excellent, with delicious red cabbage and nice chewy buttered spaetzle. The pork cutlet was actually two cutlets, so if you get the wings, the schnitzel should be shared.\n\nThe lamb shepherd's pie was excellent: simple, but very tasty with a fine gravy, and again, rather larger than we thought it would be.\n\nThe old Swiss pastry chef has retired. The new pastry chef is talented, but her desserts are a bit too sweet. Sized for sharing by two. Coffee is okay, reg so-so but the decaf is low-acid and surprisingly good.\n\nThe food at the Pied Piper Bar & Grill was exactly the level we expected. Again, this is not a destination restaurant, unless you just want to appreciate a gorgeous old-style dining room. It's B-level food, approaching a B+ only at brief moments. \n\nBut the dining room is as beautiful than ever, and we'll probably come back for at least one more visit, for lunch next time. It's a classy place, the Pied Piper, and we only wish the hotel owners would care just a little bit more about offering food that would better match such incomparable architecture.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Visited Pied Piper and Garden Court on several occasions during a recent stay at Palace Hotel. Excellent service from Rei and Nate. Great atmosphere, each venue unique and beautiful. And great drinks!", "author": "Beth C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-11", "description": "I don't go out for just cocktails much anymore, I'm getting cheap and can make top shelf cocktails at home for much less than the bars charge.\n\nThat said - when someone says \"i'm buying\" I am in!  For its central location this happens to be my ex-office husband and my go-to spot for a cocktail and a catch up.\n\nWe have been there maybe 3 times in the past year, it is usually crowded and a bit of a trick to get seats, I try to get there not much after 5pm, and we often get the last table open. Last night I actually looked at the cocktail menu, and noticed a grey goose cocktail was only $13, which is actually VERY reasonable. I've seen them for $20+.\n\nHe ordered something brown (scotch or some such) I had the Grey Goose martini.  Ya know how often when you order a martini you can tell that it is watered down? -- well this one wasn't the coldest martini in the world, but I'll tell you what - it might have been the strongest.  After two of them I poured myself into a cab to head home, and don't recall much of the rest of the evening with my bf.\n\nThe service is fast and sweet - but there are glitches, the water glasses were dirty, my table took a while to wipe down from the previous customers, and not much ice in the ice water.  \n\nThe painting is great, so it is sorta like going to a museum (see how I can justify a cocktail?)", "author": "Amy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "Quintessential, old world San Francisco.  \n\nA wonderful place to meet for drinks. \n\nWhat a treat to view the 16', $5 million dollar Parrish \"Pied Piper\" \npainting which hangs over the bar.", "author": "Maureen M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-10", "description": "As a part time bar tender, I believe that if you cannot make an Old-fashioned, you should not be in business. One of the worst I've had anywhere and the service isn't that great either. For the same price, walk down a few blocks to the Four seasons and you will never be disappointed with their cocktails.", "author": "Nehal M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-23", "description": "Pretty cool old, upscale bar in a hotel. Beautiful old wood, not the hippest scene in the world but nice to look at over a quick drink.", "author": "John D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-10", "description": "Stuffy , snooty, hotel wanna b s. Move on to a real SF experience. ......not.  ..... your not in LA baby.  It's all like this.even the wait help is off balance..........black n white  , let us not see another dressed in black n white with grey accents again....", "author": "Kid Rico ?."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-20", "description": "While staying at the hotel we decided to stop by for a drink one night, the service was so-so not the most friendly of waitresses. Once we ordered our drinks she dropped them off then never stopped by again until we were standing to leave. The bar itself was worth the 16 dollar drinks. Beautiful place.", "author": "Jay N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-06", "description": "I stopped here for a drink while staying at the Palace. It was great to finally have a drink under the legendary Pied Piper painting. However, I found that the drinks were lacking. They were not balanced and were a little strange. This isn't a bad place, but I think next time I'd stick to the standards.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-11", "description": "Drinks and food are good. Staff are generally attentive. \n\nThe highlight is the Pied Piper mural behind the bar.", "author": "Camille B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-28", "description": "A strooooo'ong JACK & Coke, spicy snack mix, hanging out w/AM, & an original Parrish oil painting, last appraised at 14.1 million dollars, just a mere 6' away...  \n\"Life is good.\" - http://www.yelp.com/biz_photos/6iyaRBDPVgap2mQJTK68CA?select=o2sxvNI6ZKKixwF-cINyIA\n\n'Not stopping by Maxfields - (Maxfield's Pied Piper Bar & Grill), while in the city is like going to Disneys and not going further than the parking lot.  Maxfield's is located in The Palace Hotel, a historic landmark having been open for over a century.  The bar is adorned with mosaic floor tiling, high ceilings, and deep, rich wood paneling.\nPhoto - http://www.yelp.com/biz_photos/6iyaRBDPVgap2mQJTK68CA?select=_TXzxG5QYnB1I8-TI94BwQ\n\nOn December 15, 1909 the Palace Hotel re-opened its doors, completely rebuilt after the April 18, 1906 great quake of San Francisco.  Since its 1909 reopening, the Palace Hotel has remained the Grand Dame of historic San Francisco hotels.\n\nThe clientele are mostly business types/suits, usually working in the area, in town for a conference,  with most of them staying here at The Palace.\n\nI would stop in here every now and then while attending the, \"formerly known as,\" Academy of Art - SF.  The Bay Area has so much to offer, rich in diversity, culture, history, and people.  (I currently reside in South OC, rich in clichés...  'But the weather is nice!)\n\n'Met up with another fellow artist/mischief maker and good friend, AM, at Maxfields shortly after 2:30pm.  As I was waiting for AM, I was able to see Paul - tall cat, helping people check in/out as they arrive at The Palace entrance on New Montgomery.  'Used to see him a lot when I was up in SF, I miss that guy!  'Awesome personality, friendly, all around-great kinda guy!\n\"Paul\" & I - http://www.yelp.com/biz_photos/6iyaRBDPVgap2mQJTK68CA?select=qPnD3N5H7mfuzC_WeyAOtg\n\nWhen we arrived, there were just a handful of people scattered throughout the bar, not crowded at all.  I personally think the best seat is at the bar, you can socialize and take in the art, beautiful.  I always liked how Parrish wasn't timid to use that cobalt blue... 8)\nPainting - http://www.yelp.com/biz_photos/6iyaRBDPVgap2mQJTK68CA?select=p7_FWPWI5OR5A7Yd3q7ymA\n\nLuis was out bartender, nice, conversational, and made a strong Jack & Coke..  'There was coke in there but barely enough to qualify.  It was more like Jack & C'...\nLuis - http://www.yelp.com/biz_photos/6iyaRBDPVgap2mQJTK68CA?select=1JdOSPLd1kKXpVNpZ3zqZw\n\nWe were also served by Robert who was none too shy in pouring a strong drink as well.\nRobert - http://www.yelp.com/biz_photos/6iyaRBDPVgap2mQJTK68CA?select=w42hQfuxrdnJHDdSoXuuUA\n\nBy the time we left, all the tables were taken and the bar was full.  I thought it was crowded but the bartender Robert said \"crowded is when there is a row, three deep surrounding the bar...\"  Yep, that's crowded alright.\n\nDo yourself a favor and slip in to Maxfield's, you won't regret it.  I can only comment on the drinks, have yet to order something to eat besides the adult beverages...  'Looks like I'll have to make another trip to The Palace to do an updated review!  Life is tough. 8)\nNext drinks on my to-try list the - Market Gimlet & the Chaplin!\n\nJack & Coke (x4) = $50 (+tip)\nGreat crowd, cool bartenders, & strong drinks...  Aloha! I'm home!\n\n- \"Okole maluna!\" (Bottoms up!)\n\nFood: (Drinks) 5+\nAmbiance: 5\nService: 5\nValue: 5", "author": "Darrell P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-15", "description": "Solid 3 star cocktail experience in the heart of San Francisco. \n\nQuintessential old school ambiance, but the cocktails don't really live up to the prices when factoring in that it's well type liquor and the Maraschino cherries. \n\nHave had appetizers and meals here before, but it's not thing to write home about. \n\nYou're paying a premium to drink before a vivid work of art in a stately bar. Cocktail and beer snobs will fare much better at House of Shields.", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-07", "description": "Fun bar\n\nHad a work reception in the rear of Pied Piper's.  Very attentive and considerate staff.  The place is well pointed and patrons obviously enjoy the atmosphere.  \n\nIt's a hopping spot to enjoy.  Also very loud.", "author": "Rob L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-24", "description": "Down with the Palace.  After 104 years they stole a piece of San Francsico history and culture.  To sell Maxfield Parish's \"The Pied Piper\" painting to the highest bidder is exceedingly poor form.  It shows this hotel has not sense of history.  They have a duty to curate the building and the art in it for future generations.  \n\nWay to go Starwood. You have another hotel bar.  Nothing special and I will not return. Ever.", "author": "Evan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-07", "description": "Can I just say Maxfield... I love you! They actually have one of his amazing paintings here. It's a must see. Great place to meet friends or do business. Drinks are expensive but the service is great.", "author": "Jen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "Super classy hotel bar with awesome ambiance. Bartenders are attentive, friendly, and provide generous pours. If you find yourself in here looking at the massive painting above the bar by Maxfield Parrish titled The Pied Piper, I encourage you to Google it. Very interesting and rich in history. \n\nSoak in the classiness, knock back a drink or two, and enjoy...", "author": "Brittney H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-01", "description": "So nice to see the refurbished Pied Piper. I am glad they kept it here in the bar instead of selling it off. The Scotch list is excellent and a good pour. We sat at the bar and the service was friendly on New Year's eve eve. We like to go out the day before the madness.The bar was quiet and we could converse.\nIt was lovely to stroll though the hotel and see their take on holiday decorations. Beautiful shades of red flowers.", "author": "Cynthia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-20", "description": "You have to be International when ordering the staff comes from the four corners of the world so you have to be patient when trying to order a drink or food. We got caught in the usual city downpour and decided to stay in and get some food. The main salon was closed early for supper being Sunday and we settled into Maxfields for bar snacks.\nWe ordered the soup de jour cream of artichoke a mild not very flavored Luke warm creamed soup. The filet quesadilla was a nice surprise packed with soft moist meat and variety of condiments to slather on the lightly browned shell. The Caesar with whole anchovies was delightful and very authentic, crisp romaine no hearts and lightly dress a yummy side dish. The Lobster club was enjoyable with the truffle fries, crisped lightly and tossed in a black truffle oil. The service was nice but they were busy and could have had one more person on the floor. It was down pouring outside so I understand how they could be busy when not expected. Al in all very nice and I will return on my next visit to SF.", "author": "Bill J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-29", "description": "I didn't leave a tip for the first time in my 66 years of existence. Here's why:\n\n1. The waitress neither knew the menu or English, for that matter.\na. A member of my party asked what a drink called the Full Monty contained. The server said bourbon when the menu said it was rum.\nb. I asked what the soup of the day was. \"Butter nut.\" \"Butter nut squash?\" \"No, butternut.\" Apparently she didn't know what squash was.\n2. The waitress gave one food menu for the four of us and then removed it before we could order.\n3. We got another one, but couldn't give our order for at leas half an hour. Here's what I did to try to remedy this.\na. Left the table to talk to a server who wasn't assigned to our table. She said she'd talk to our waitress, but nothing happened.\nb. Went to the host and asked to speak to a manager, but none came.\nc. Talked to another waiter, who finally came and took our order.\n4. We ordered one desert for the four members of our party, but the waitress brought only two spoons.\n5. I got a piece of paper so I could explain why I wasn't giving a tip when the waitress approached us and said to me, \"You don't have to give me a tip.\" \"Do you want me to explain why I'm not doing so?\" \"You don't need to give me a tip.\" Apparently, this isn't the first time a customer failed to tip her. I wonder why.\n\nBTW: My hamburger was very good and so were the cookies and the lemon cheesecake deserts. I liked my drink, too. Normally, I'd give this place four stars, maybe five. But the service at this high-class hotel bar was worse than any dive I've ever frequented.", "author": "Andrew Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "After a long, hard day of trading on oil futures, cranking out some mergers and acquisitions, and diversifying my portfolio, I like to have a drink at Maxfield's Pied Piper Bar. Actually that's not true. I don't do any of those activities. But I DO like to pretend I'm a titan of industry and drink fancy cocktails at fancy hotel bars. \n\nAs the house bar of the Palace Hotel, I'm fairly certain this bar has seen it's fair share of the 1%. The walls are covered in photos of guests from yesteryear, ranging from John F Kennedy to James Beard. Combine that with the ornate history of the hotel in general, and it's all very The Shining. And I love it. I also especially love the huge mural of the namesake flutesmith. At once epic and whimsical, it reminded me of a Thomas Hart Benton paining, of whom I'm a big fan. \n\nThe cocktails are fancy, and I particularly liked the Charlie Chaplin, an absinthe and rye whiskey concoction that tastes delightfully old school. The specialty list is small, but they can make any classic drink no problem. If you're only a beer drinker, I wouldn't suggest a visit here. The list was quite limited. Also, keep in mind that you pay a premium, as one cocktail and one beer ended up being like $22 or something. Still, it's worth it to feel like such a baller.", "author": "Matt E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "I am ecstatic that I have found this neighborhood bar thats only a stone throw away from my home..\n\nI love the atmosphere there. Old school and not your hippest bar but hey, its like a beautiful library and their seats are super comfy! Servers are friendly. Big props to Edwin, Rene and Cecilia!! Love them!\n\nTheir *Market Gimlet* is my go to drink. They have bar food till 11pm and last call is at 11:30pm on Fridays (Guessing the weekend?)... I was hungry one night and got their tuscan bean and kale soup. It had pancetta inside!! Super hearty and delicious. \n\nYes, it is on the pricier side but I think it is worth it. The password controlled bathrooms also relieves my extremely OCD traits!", "author": "Amber S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-26", "description": "This is a bar located inside the Palace Hotel. It wasn't too busy when we went on a Saturday night. The cocktails were on the pricier side, but they were strong. They also give you a bowl of snacks, which include wasabi peas, peanuts, and asian crackers. And FYI, taxes are not included in your drinks, so don't be surprised when you get the bill.", "author": "Anita C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-25", "description": "I used to find this restaurant and bar to be semi-charming, in a fuddy duddy sort of way, but the ridiculous wine pricing (the St. Regis seems like a Groupon deal in comparison) is now just offensive to my senses. \n\nAdd to that the gaudy Pied Piper painting that encompasses the entire bar, well it's  just plain creepy. I mean when you think about it, the piper was sort of art's first great child molester. Stick a fork in it, Maxfield, you're done.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-13", "description": "Hipster Douchebags!\n\nOk, I might be going a little over board here but finding space in the cities cool bars (Rickhouse, Americano and the list goes on) is getting to be near impossible. And to make things worse, some of the other cool hip places don't begin serving till after 6:00. Where is a thirsty hot chocolate lover who wants a simple gin martini supposed to go?\n\nAfter a failed attempt at one our favorite watering holes, we trekked a few blocks to the Palace Hotel and found seats at the famed Pied Pier Bar. No crowds, quiet, relaxed and friendly servers. Why fight the masses? To look cool?\n\nNot I, a hotel bar is the perfect remedy..\n\nAnd that huge Pied Piper painting? It was almost sold and sent off to places far from here. But lucky for us Bay Area residents, it still resides in this historic venue.\n\nAnd my Nolet's martini was perfect. Just a hint of vermouth, barely even knew it was there. Vodka vixens? you will be in Heaven too.", "author": "V B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-22", "description": "Met a pal here after work because it was central to our offices. No happy hour and beers are $7. Service was OK. Asian crunchy snacks!", "author": "Alyssa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-04", "description": "Amazing drinks - pricey, but super tasty. The beautiful Pied Piper painting behind the bar is huge and impressive. The service is wonderful - had a lovely conversation in Japanese with one of the servers. Walked through into the room further in the back and it seems to have just been remodeled - it's GORGEOUS! The wood is beautiful and everything just has a really classy but cozy vibe to it.", "author": "Mio W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-16", "description": "We waited for a good 15 minutes before a waiter even came to our table. Then he forgot all of our orders and had to come back 5 minutes later to write them down. In all we waisted more time than we wanted to... Food was average.", "author": "Taylor M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "I can't say enough about this place.  The history,  that gorgeous painting... maybe a touch pricy,  but it's a time machine and time machines are worth it.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-03", "description": "Great spot for afterwork drinks. Gets crowded at the bar. Tables are in the back, equally awesome. Waitstaff is attentive. I only ordered drinks here so can't say much about the food. Great hotel bar in the fidi.", "author": "Katie Anne N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-23", "description": "While we were having drinks at The View, we were deciding where to have our dinner. I recommended this place to my man because I've been here before with a couple of friends, I thought I liked and plus it's close to where we were at. It's inside the palace hotel. lovely charming place and cozy. I love the huge painting in the bar area!\n\nI ordered seared Salmon on the Big Plates menu ($28). It came with haricot verts (buttered) and ginger broken rice. I loved everything except for the ginger rice, it was just okay. I wasn't too hungry when we had dinner and nothing on the ginger rice tasted very appealing for me to over-stuffed myself with carbs. We also ordered Tuna tartare ($15) and jumbo lump crab cakes with micro green and citrus beurre blanc ($17). They were very good. I had them before the last time I was here and the boyfriend liked it as well. The Tuna tartare came with tomato, wanton chips, avocado, chives creme fraíche. \n\nWe didn't order for desserts as we have a different destination for it. Over all dining experiencing was great.", "author": "Lora M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-24", "description": "I love this bar!! Delicious, unique cocktails and a warm, elegant setting make the prices well worth it. It's fun to sit at the bar with your little snacks, watch the bartenders, and get a quick history lesson about the humongous Pied Piper painting hung behind the bar.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-04", "description": "Nice place very elegant, one problem we ordered our food and the waiter kept telling the food is almost ready 1hr still waiting on food. If you're dying of hunger this is the place to die of waiting.", "author": "Noe D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-27", "description": "Stopped in for some appetizers with the family, and eh it was okay...\n\nIt's quite dark inside this bar so be prepared. We snagged a table for four in the corner and ordered some drinks while we perused the menu. Our waters were brought over quickly but my parents did not receive their cocktails until my dad asked the waiter about them... since it had been 10 minutes or so. \n\nWe shared the calamari, the potato croquettes and the oysters on the half shell. Everything was so so. The calamari was a bit overcooked so the rings were chewy, but the tentacles were good and the squid ink aioli was nom. The potato croquettes were fine but nothing spectacular. The oysters were actually pretty good so I would order those over the other two dishes we tried.", "author": "Sam F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "The Pied Piper bar is located in the spectacular 'new' Palace Hotel.  There is simply one but very compelling reason to visit, and that is Maxfield Parrish's masterpiece, and bar namesake, which hangs above the bar.  I had the privilege to bask in the light of this amazing painting while visiting friends whom were staying at the Hotel.  The staff was not warm but they were attentive and unobtrusive, albeit reserved.   My advice, bring your own company, do not expect the bartender to be your chum.  The drinks are expensive but not by landmark hotel standards for a top metropolitan area.  Great whiskey and cognac selection.  If you have to ask what Louis XIII is, maybe this is not the spot for you, especially given a glass' $240 price tag.  I would recommend the Market Gimlet, and you can actually find Yamazaki single malt for less than certain spots off Embarcadero.  Free savory snacks offset the high cost.  That said, even with high prices and cold staff, the price is well worth it to be able to closely study Parrish's amazing work.  Those poor children, lol, does anyone think about the macabre subject matter? Will this be my regular haunt, probably not, but as an art lover, I am glad I had the chance to stop by.", "author": "Chris K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "Cool, old world SF place. I love the painting of course. The appetizers were great and so were the drinks. Only ding was that it wasn't clear if there was service or if you had to walk up to the bar if you were sitting at the high tables near the bar. Turns out there was service but we didn't see the guy until we were half done with our drinks.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-25", "description": "Had the burger and truffle fries which were good but I ended up with food poisoning and hunched over a toilet for the entire night. Not an ideal way to spend your last night of a vacation.", "author": "Zach M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-06", "description": "Great prices on the whiskey and Scotch list. I've gone twice close to closing and had no trouble getting a table for an after dinner drink with friends. \n\nThe only downside is they close at 12am. Don't expect to finish your socializing here.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-06", "description": "Crab Omelet is the way to go!  I was very impressed with the breakfast/brunch offering that they had there.  Their bread basket is somewhat decent too.  The only disappointment was their breakfast potatoes.  Very mediocre.\n\nThe drinks were a bit weak, but thats fine\n\nService is hit or miss, but it didn't bother me too much, since I ate by myself anyway.  The atmosphere is very casual.", "author": "Ken H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-10", "description": "I met a friend there for a drink and the waitress came over right away, I told them I want the 1994, she was like what are referring to, I replied I saw it on the Internet menu, I then realized it was a port and I wanted a single malt so I ordered a double of single malt !\nThey brought a single without saying anything, & then brought another with no explanation !\nMaybe they were busier than usual yet regardless I wanted a double !\nIt is a good place with a good atmosphere !", "author": "Abraham L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "It's a nice place with tons of history. Check out the black and white photos on the wall when it's not busy and you can see all the celebrities and politicians that visited the place.  Due to the interior design, it feels very heavy and......kind of \"old person-ish.\"  It's like the place where your grandparents would go and..... just has that kind of feel to it.   I'm not hating, I still like the place and recommend it.  Check it out when you have time to sit and enjoy your meal.  It is on the pricier side, so fyi on that.", "author": "Shaun W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-18", "description": "The décor  is very reminiscent of a men's cigar lounge or social club as there is a large painting surrounded by lots of wood. So, it's most suitable for business meetings and dinner but I would not recommend for casual hang outs. The entire menu, excluding beverages, is brief and is not expensive but not inexpensive either. \n\nMy companion and I shared the calamari and cheese plate. Both were done very well. The calamari pieces were a mixture of ringlets and mini bodies with sauces. The cheese platter was beautifully presented with strawberry halves, grapes, fig spread, crackers and different cheeses.\n\nOur server was very attentive and there was not a long wait despite the crowd.\n\nOverall, it's a more refined place to gather to meet.", "author": "Z M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-25", "description": "Th service was horrible.  There were several tables piled with dirty dishes.  We sat at a dirty table for at least 30 minutes without a word from anyone.  How awful!  The painting was still magical even if the service was so bad.", "author": "Georgia R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-29", "description": "Okay ... like others have mentioned, The Pied Piper mural is missing from behind the bar. The hotel tried to sell the painting at auction hoping to get $5 million for it. The city of San Francisco was outraged by this, as were guests who expected to see it there because the painting was actuall done by Maxfield Parrish SPECIFICALLY FOR THIS LOCATION! This goes beyond even the concept of the Louvre selling the Mona Lisa because that is just where the painting ended up. To sell a work of art that was made for the location behind the bar ... that's just hard to believe.\n\nAfter all the negative backlash from the city and customers, the hotel decided to take the painting off the market and replace it. Before they do replace it, they are having it cleaned and restored a bit. So, likely if you go within a month or two of this review ... you won't be seeing the famous painting because it is in NYC being cleaned.\n\nIt is a curious thing ... to have a painting worth $5 million dollars or more in a hotel bar that contains around 20 tables. Some restaurants/bars do a one million dollar rennovation and brag about it on their website. Very few bars have $5 million+ worth of art hanging there. But while I am sure the hotel is a little miffed about not being able to have $5 million more, customers to the bar will be relieved to see this painting in its originally intended location for years to come. 2 stars off for the big, ugly empty blank wall I had to stare at while I was there a couple weeks ago. The mounting brackets for the painting and the discolored wood panel was visible!\n\nHaving said that ... this is seriously some of the best food you will find in San Francisco. Just about any cocktail here is overpriced by double what it should cost ... and the amount of liquor in them is almost non-existant. To pay $35 for 2 drinks and not catch a buzz is criminal. $7 beer and $40 bottles of wine are where the value lies here.\n\nIn regard to the food ... I've always figured bar food is pretty much a bad idea anywhere you go. Greasy, cheap cheeseburgers and dry chicken sandwich on cheap hamburger buns are what I expect from hotel bars. NOT SO AT THE PIED PIPER! The shrimp salad is huge and comes with fist sized shrimp on it. The chicken sandwich was seriously one of the most appetizing looking things I've ever seen.\n\nThe food literally looks like the food from an adertisement here! And it is fresh and the quality is great. Seriously, if you have a few days in San Francisco ... you should do at least one lunch or dinner here. Its restaurant quality food in a bar. What could be better?\n\nOnce the mural is back in place, this will be a great spot. The only thing other than the weak but expensive signature mixed cocktails that I don't like is the fact that the bar closes so early. I think the last time I was there on a weekend, last call was at 11:30 p.m. on a Saturday night. There were still plenty of people in the bar at last call ... another two hours and it probably still would have been packed because heading out in San Francisco after dark is never a good idea.\n\nAnother suggestion ... I'd love to hear some music playing at night. The televisions with Sportscenter on make it feel like a cross between a classy hotel bar and an Applebees.", "author": "E T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-11", "description": "Classy joint they have here... about a dozen of us showed up for happy hour on a Friday night and were seated and served promptly and with a smile. The bar itself is in a nice, small room that probably rarely feels empty, and during peak hours the crowd overflows into a larger and more relaxed room adjacent.\n\nIf you're the 99%, then the 1% prices here aren't for you. But the space is beautiful and ample, they have a great selection of drinks, and the snack mix occupied my belly nicely. \n\nI'll be back if I need a nice, quiet place for conversation or to catch up with old friends.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-23", "description": "After having a Maxfield Parrish original painting over the bar for more than 100 years, which was commissioned for the re-building of the hotel after the 1906 Earthquake and Fire, management decided to auction the paining off to the highest bidder.  It's gone.  \n\nThis bar no longer has any connection to Maxfield or the Pied Piper.  Nothing like selling your heritage.  Now it is just another hotel bar.  \n\nI hope they choke.", "author": "Bay G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-02", "description": "Great drinks and great for people- watching!\n\nSure the drinks are a bit on the expensive side but the amount becomes priceless when you start seeing that all the women/men that cross the bar  are the equivalent of the house wives of Beverly Hills. DEAR LAWRD the botox in those face! The BIG diamond rings!! The Tight Dresses! The Snobbery! (I might be making up half of this words) The men in suits holding their trophy wives! \n\nYou might think.. why would I want to go there? Well Not only is it great for people watching a drink but it's 50's theme. So if you are into Mad Man this is something of that era. I do wish they dimmed the lights a bit and perhaps add a grand piano. Now that would set the tone for an even better experience.", "author": "Abby O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-25", "description": "When I started going to the bar, it was wonderful, old world type of bar - I could be transported by good drinks, an excellent wait staff, and some tasty food. While meals and drinks were expensive, they were actually worth it. \n\nI had not realized the hotel had been sold when the first reports of really bad bartenders, cheap drinks, and poor food started coming in. It makes sense now but what a shame. It's incredibly sad to see something that you really treasured as a \"spot\" be basically strip-mined for all its \"cash value.\" \n\nI think the painting being removed is the last straw for me. I'm done. It's too bad for many reasons, not the least of which is that something so beautiful is no longer shared with so many people. You know the real shame? If they had kept things the same and maybe done a little more promotion, the bar would continue to thrive. Now, it just seems to be circling the drain.", "author": "Kris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-22", "description": "I waffled between 3 and 4 star and decided to give it a 4 due to the atmosphere, decor, service, location, and menu selection.  An average lunch item is $20, and goes to $30, without drinks.  This is, after all, a bar and grill within the Palace Hotel (formerly the Sheraton).\n\nI ordered the grilled chicken sandwich.  It was served on ciabatta bread with a bed of shoe string fries.  The white meat was moist and plentiful.  My dining companion had a cob salad which looked fresh and crisp.  On a weekday lunch hour, there seems to be more patrons at the bar than dining tables.  It appears to be a popular hangout for the premier AARP card holders.  Kidding aside, I did enjoy the experience of this SF city landmark.", "author": "Jean T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-23", "description": "Apparently, the beautiful painting by Maxfield Parrish \"The Pied Piper\" was removed by the Sheraton Palace Bar and is to be sold at auction by Christie's.  Sad news, but not surprising. Loved the painting, but the last time I was at the bar (with a friend from Switzerland, no less), we were treated so rudely by the staff (probably 'cause we didn't order enough overpriced food and fancy-named drinks), that I had no desire to heed the piper's call again, ever.\n\nThis brings up the question: Will they still call it \"Maxfield's\" without Maxfield?", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-27", "description": "Junky service on a Friday night. Plus they kicked us out at 11pm. \n\nNot okay", "author": "Kim P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-01", "description": "A great place to meet for drinks. I frequent this bar when I stay to the attached Palace Hotel (which is a rare treat). The drinks are pricey and the service could be much better but the specialty cocktails are good. I often find myself studying the beautiful painting behind the bar in a cozy chair. Old world, 1920's feel to the place.", "author": "Caitlin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-02", "description": "This place is across the street from my work and my co-workers love to come here. By default I am here at least once or twice a month. \n\nIt has a very old school vibe..and when the bar gets too crowded they open the back side..which is spacious with lots of cushy couches. \n\nMy one complaint is that it is unforgiving on the pocketbook--wine and martinis start at $14...we usually never walk out of there with a check under $100...", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-07", "description": "I have nothing good -- nothing -- to say about this place. It has no personality, no soul. \n\nWhere to start with the list of \"things I hate about Maxfield's?\"\n\nPrice: This bar is seriously overpriced, even for San Francisco. House wine: Twelve dollars. The other wines start at twelve and go up to twenties. For a glass. Of. Wine. And really, when you rip me off by trying to charge me $12 for a glass of wine that came from a bottle that cost less than twelve dollars, I don't care what else you do well. And here, they don't do anything well, so nevermind...\n\nFood Quality: The deviled eggs  were awful. They were bland and tasteless. I don't even know how you can make deviled eggs tasteless, but Maxfield's has managed. \n\nAmbiance: For starters, the uncomfortable seats at the bar. The oversized and horrible Maxfield Parrish (Maxfield's, get it?) replica painting over the back bar. The complete lack of any comfy seating, so you can sit back and have a chat with your glass of (overpriced) wine. In short, totally uninspiring ambiance, and uncomfortable, uninspiring seating . \n\nBottom line: If this place were not in a hotel it would be out of business so fast. No one in San Francisco would put up with this dreck.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-03", "description": "Starving after an afternoon at the SOMA we popped in to the Pied Piper.  We were really early so we almost had the dining room and the server to ourselves.  To lay the groundwork, as is typical for a hotel setting, everything is pricey.  That said I loved the \"Mad Men\" Martini, which was a combo of vodka and scotch (two of my favorite things).  Do splurge on this!!\n\nFor food we had the oysters on the half shell (nice and flavorful sauce accompanies them) and the tuna tartar, which was nothing special, it just needed something to break up the bland.  But, the Cowboy Steak was really, really perfect so if you have a hankering for some red meat this might be the thing to order.\n\nThis might be a place I would pop in and have a signature cocktail again but I might leave the food to the folks staying at the hotel, I hope they have an expense account.  Bottom line...dinner for two $106.00.\n.", "author": "Heather D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-08", "description": "Great little bar and dining room. Burger and drinks were fantastic. Good date spot, great live band, fabulous ambiance, nice little find. I suggest ordering drinks at the bar then snagging the couch in the dining room to eat and chat.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-18", "description": "Continuing on last weekend's tour of those bars I've never managed to check out we landed at the Pied Piper Bar.  I've been to the Palace before but during the day and never had the chance to check out this bar.\n\nIt was 9-ish and managed to find a 2 person seat.  Right away a waiter came by, brought us some water, salty snacks and a menu.  Got to love the awesome service!\n\nThe room is large with very high ceilings.  All art deco top to bottom which I'm assuming is when the bar was built and appointed.  Saying it without saying it, a rich guys bar.  If you didn't know about the name of the bar or the painting on the wall, you could tell just by looking at it, it was pretty special. \n\nThere were a couple of holiday parties going on in the hotel so the place was filled with 50&60 something's in coat and tie.  Don't know if this is the standard dress the rest of the year.   \n\nDrinks are expensive - 27 bucks for a glass of house cab and a dirty martini.  The martini also included a side glass of extra olive juice in case you wanted it dryer.  Nice touch.  \n\nMy only suggestions - the lighting was a bit bright and of course they added a flat screen TV, I suppose a necessity.\n\nIf your into art the deco or look, Maxified Parrish, want a great martini swing by the Pied Piper bar.", "author": "R P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-12", "description": "I went here on 12/11/12 with some friends to explore the historic hotel Palace Hotel and we treated our friend for her birthday to dinner at the restaurant.  Due to the limited reviews on the food we all just ordered what we thought sounded good. \n\nThis is what we ordered:\n\nAppetizer:\n\nFried Calamari - Soggy, bland, oily and flour taste. Dipping sauces mayonaise and ketchup unusual.\n\nEntrees:\n\nKorobuta Pork Chop - Bland, dry, and unflavorful.\n\nSeared Atlantic Salmon - Salmon was dry over cooked and coconut flavoring overpowered the Salmon. \n\nNew York Steak - Requested steak medium rare and was cooked almost well done. \n\nCharnette's Famous Southern Fried Chicken - Chicken was bland and flavorless, not crispy, tasted like chicken was breaded and baked. (Even fast food places i.e. Popeye's, KFC and Church's Chicken taste better and put this fried chicken to shame)\n\nSeveral minutes after eating and tasting each other's food. We notified our waiter how we felt about the food. He didn't look surprised about our feedback about the food. It was almost as if he knew the food was not good. Nonetheless he notified his manager with our concern with our meals. We received an apology, an invitation to return, and were given a 50% discount on our food bill. \n\nUnfortunately my friend's and I won't be returning to the Pied Piper Restaurant. We will return to the Palace Hotel for either the Garden Court Lunch or Sunday Brunch. I hope we won't be disappointed.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-23", "description": "This place was popular! We walked in and could seat ourselves. Within moments a waitress put two containers of snacks on the table and pointed out the drink menu. She was back quickly to take our order and handed us food menus too (available from 1700). I ordered the salmon and my friend the burger, which was big! We had lightly fried calamari for a starter which was good as well. Despite a full house our server and the other staff were on top of things and friendly. Seemingly a popular after work spot as well as for hotel guests. Prices are on the high side; we got out for around $100 which was perfect as that's just how much I had as a credit for being a hotel guest (and booking through American Express' Fine Hotels and Resorts Programme). The decor was soothing too. It looked like \"old money\" with it's dark panelling and leather seating, but felt fun and youthful being so busy.", "author": "Ben S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-23", "description": "One waitress worked the entire room during brunch time Sunday, on the week of Christmas. The service was about as slow as you'd expect for one person, on Christmas week.\n\nThe waitress also refused to give an unlimited mimosa with the cheese platter I wanted. The rule is a $12 unlimited mimosa goes with any brunch entree. I know it's a technicality, but the cheese platter *is* on the entree section of the menu. I pointed this out to her, but she still wouldn't budge.\n\nIndividual mimosas are $8 / glass, fyi.\n\nThat said, I wasn't in a hurry and the space is fun. Lots of dark wood and almost no outside light. Ordered a side of fries that came sprinkled with garlic and a side of mayo. Pretty delish. Though I probably won't be back.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-21", "description": "Let me first say that I was not a guest at the Palace, but was visiting a co-worker who was staying here and suggested we meet up at the Pied Piper Bar for a drink one night.  I was first astounded by the grand dining area as you enter the hotel, just past the lobby.  You walk down the hallway to the right and are greeted by a wonderfully decorated bar area full of intricate wood detail... this is the Pied Piper Bar.  We sat in the lounge area and were quickly approached by the bartender how popped out from behind the beautiful bar to take our orders.  While we waited we were provided a couple bowls of munchies, which is always a nice touch for those that have been out drinking.  Our drinks arrived quickly and were quite strong (a good thing in my opinion.)", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-24", "description": "Loved. For the glamour, the old school decor and service, the massive martini. It was very busy (the night of the Chinese New Year Parade), but despite the busy-ness, we still received friendly and efficient service. This room is a treat for locals and tourists alike.", "author": "Lizzie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "Service was excellent.  Ambiance is old school cool.  Lot of neat history all over this place.  The mural was very lovely.\n\nThe food was overpriced.  I'm sorry but a $20 burger should be insanely tastey.  this was good at best.  Two small bits of bacon, watery tomato.  The cheddar and pickles were nice.  The patty was good, but I make a better burger at home and don't see why this is so expensive.  It was cooked right at least.\n\nMy guess is this is the spot for good ole boys after biz hours as I hear the cocktails are on point and maybe after a couple of those the burger doesn't seem so expensive.", "author": "Matthew T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-14", "description": "Historic bar in an even more historic hotel? Yes please!\n\nWhilst staying in the stately Palace Hotel one evening, we met up with some friends for drinks in the historic Pied Piper Bar. It's stunning...old wood and stained glass. It's elegant, not too stuffy or old. And the masterpiece Maxfield Parrish Pied Piper mural is a gem to behold! \n\nI ordered one of their signature drinks, The Ralston. It packed quite a punch, but I didn't taste a drop of the alcohol. Sparkly, sweet, and refreshing...just how I like my drinks! It was so good I ordered a second!\n\nYes, the drinks are a little pricey, but this is an experience to remember! I certainly won't forget it!", "author": "Greg S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-17", "description": "So we were staying at the Palace Hotel and were tired after flying cross country and spending the afternoon in wine country.  We wanted some dinner and did not want to travel.  So we stopped in.  The menu is limited.  So is the wine list.  There is a long list of mixed drinks, which is not my interested.  The prawn salad is outstanding.  Good size, interesting flavors.  The wines are extremely expensive, even by San Francisco standards.  Service was friendly, but slow.  It filled a need, but I still feel I could have done a bit better.", "author": "Mike N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-08", "description": "My friend and I had limited time and wanted to grab a quick drink and this was the only place with room within walking distance on a Monday after work around rush hour.  So I was like sure we're probably just drinking beer or wine so it can't be that bad.  Oh all the reviews are right - it's expensive.  $12 for house wine is ridiculous.  AT least the pour wasn't too stingy.  They did give us some snacks.  I think this place is definitely a tourist trap.", "author": "Kay C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-07", "description": "Ah, The Palace. Its quiet history waiting patiently for us to drop in, nosh, stay, wander,  and ease into its infectious calm....Gosh the bar is a delight, a unassuming nook of a respite from the busy traffic (and sunshine this day) along Market St.\nService was quiet and too-the-point polite. The asparagus soup was a gutsy, warm, gingerly (yes, both ways) nudge towards a light Indian cuisine sort of stew but, instead, showed some peppery fire....and, it all worked -- for an asparagus soup.\nTuna tartare was next, a ubiquitous dish these days. But, what, why even the diced portions of the fish were perfect, gently cozied next to a delightfully light crème fraîche and a lustrous-sheened \"tomotilloes?\" splash....\n\nAlas, put free wi-fi in the darn place you dingalings who manage the facilities -- my generation doesn't smoke pipes nor cigars -- we talk about data and the arts!", "author": "Christopher R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-05", "description": "I liked this place.  My friend who came with me, not so much.\n\nMaxfield's Pied Piper Bar has a strange name because they basically branded the name of the bar after Maxfield Parrish's famous oil painting that adorns a 6X16 length of space above the bar.  The painting is currently worth upwards of $2 million.\n\nThe bar is very, very old school.  Meaning it is made with heavy, dark wood, dark interior lighting and chandeliers from the 1930's.  There are pictures of Dwight and Mamie Eisenhower on the walls to give you a clue on the old factor.  I felt like the bar was really beautiful but I like those types of places.\n\nNow for the issues.  The cheapest glass of wine is $16!!  WTF.  The house wine is only a couple of dollars cheaper.  I would say stick with a cocktail like I did which \"only\" runs $12.  I had a dirty martini and it was really nice.\n\nThe food at Maxfield's is very average.  I had the tuna tartare and it was okay.  My friend had the deviled eggs but she hated them.  For the price the food should have been better.  At least you got a uh, complimentary bowl of variety nuts to snack on.\n\nFor what it is I still think this bar is worth a visit.  Just be ready to pull out the wallet and not be totally blown away by the food.", "author": "Heather F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-04", "description": "I stop in to this place at least once a week. I am a martini man and have tried them all in a 6 block radius. From Sutter station to the Four Seasons( new remodel of the bar,but that is another review)\nSpicy mixed nuts at the bar. They use to serve in very small carafe which was hard to eat. They have changed to small silver bowls\n\nThe Bart station is out the door so great access.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-01", "description": "Tremendo cafeteria food!\n\nFood = Bland bland bland\n\nDrinks = MEH!\n\nService = 1 bartender for the whole place + 1 waiter = Long Ass Wait.", "author": "Drella J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Lovely bar at the Palace Hotel, on Market Street. Good drinks and friendly, knowledgeable wait staff. Plus that wonderful Maxwell Parish painting behind the bar. What's not to like?", "author": "Margery N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-16", "description": "Love this historic bar and grill!  The service is good if the place is not too crowded.  The Pied Piper painting is beautiful and I love coming here and staying at the Palace Hotel.  The food is good, not amazing.  Prices are moderate.  I can't help but fantasize about all the people that have dined here throughout the decades...le sigh.", "author": "Mari R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-21", "description": "The poorest service ever!  Waiters seemed very unhappy and no one seemed to want to work.this restaurant is at the Palace Hotel and the service was not even very regal", "author": "jose b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-30", "description": "Sheraton Palace Hotel\nGreat old school lounge; check out the Parrish painting behind bar\nPlace is crowded, meat market, noisy\nFull bar w/bar menu w/top shelf booze\nExcellent drinks, beers, & wines by the glass; little spendy\nFantastic bar/food service by Keith; he is so excellent\nNice complimentary nuts\nPork sliders were good\nGigantic delish cheeseburger w/tons of fries \nNice place for a splurge", "author": "Rosquete B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "Upon entering the Pied Piper Bar I felt as if I were meeting an organized crime syndicate for drinks. Secluded tables, big chairs, low lighting, and awesome decor added to the experience.\n\nI came here with a large group of friends for happy hour, and they were very accommodating after pushing together three tables in the back. The service was amazing, and my personal favorite was the assorted snack food they bring -- wasabi nuts included!", "author": "Jason M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-13", "description": "Order the Market Gimlet and the Tuna tartare.  You will love the service, drinks and the food.  Place rocks.", "author": "Tonya M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-27", "description": "Came here on Christmas Eve for a nice dinner with my boyfriend. We sat ourselves and kind of had to flag the waitress down, if it was another minute longer I would've been really upset. Cocktails are very delicious. I had the Ralston cocktail and it was so good that my boyfriend ended up ordering as well. Those drinks definitely got us buzzed and it was a bit pricey.\nWe ordered an appetizer and two entrees.\n\nPotato skins: Yummy but if you take them home definitely heat them up\n\nFried chicken with coleslaw: Fried chicken was ok...needed a bit more salt. But it came with honey and buffalo sauce, very interesting and actually goes well with chicken. Coleslaw was spicy and had a great sauce to it...no left overs there.\n\nChicken club Sandwich: Delicious with apple wood smoked bacon, good size and perfectly salted fries\n\nAmbiance is great and very cozy..servers are nice and we had a great time. Try the Ralston cocktail!", "author": "Lana K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-10", "description": "This is a nice place for brunch!  The drinks are included in the price of a brunch or you can order a la carte.  Hubby had the american breakfast  - the chicken apple sausage was amazing - potatoes were wonderful  with peppers and onions.  Eggs Benedict was great, the eggs were poached perfectly, holandaise was light and airy.  \n\nThe service is a little slow but it was crowded on Sunday, and maybe it's just a slower pace that we all need once in awhile!", "author": "Julie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-19", "description": "I feel so glamorous here!  It's got that Mad Men cool vibe without any pretension.  The drinks are delicious.  I love the crispy goodies they put out for munching.  My dirty martini was good, although I like my martini without ice chunks in it.  We had a great view of the gorgeous Maxfield Parrish painting.  The clientele was dignified; we had previously been at The View at the Marriott and were put off by the noise and couples macking on each other.  This is a classy joint.  The only drawback was the service, it was harried and inattentive, I wonder if they were short people for the night.  Overall a fantastic stop for an elegant drinking experience.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "A cover of Cigar Aficonado immediately comes to mind whenever I step in.\n\nUsed to come to this place every once in a while to take a little break from the busy FiDi.  Never really knew that this place was here until I was visiting a friend who was staying at the Palace.  I'm glad that I found it though.  It's a chill spot, and has that elegant classic look to it: think of the bar from the Shining (minus the ghosts and psycho Jack).  It's a great change of pace from other locations around the area.\n\nThe place has a wide selection of liquors.  The drinks are on the more expensive side.  Apparently they serve food here too, but I have never eaten here.  The food looks good.\n\nA nice, chill place of off-beat charm for the downtown crowd.", "author": "Satoru Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-21", "description": "Rich - in every sense of the word - is the best way to describe this bar. It's a wonderful, swanky place for a drink... especially if someone else is buying. The dark, polished wood of the walls and bar helps accent a century-worth of pictures of San Francisco and the highly impressive mural of the Pied Piper of Hamelin. (Hence the bar's name.) \n\nTRIVIA: Most people are familiar with the Pied Piper fairy tale. Interestingly, mention of the piper luring away the children forms the origin of the town history for Hamelin, dating from c.1300 BCE. However, the elements about the rats didn't appear until the 1600s.", "author": "Bill B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-12", "description": "WHO KNEW, and WHO CARES, right?\n\nI'm the second reviewer for one reason only:  NO local would think to be buried inside the Palace Hotel.\n\nWell, my friend from out of town happened to be staying there.  The plan was to watch the Lakers Game at Dada.  But we had to bounce:  too crowded.  too stinky.    \n\nSo we ended up in no-man's land at Pied Piper....  \nTotally low-key.\nHotel / older crowd. \nThey have a bar menu.\nThey have TVs!  LAKERS AND THE YANKEES at the same time!, omg.\n\nA decent place to chill while the crazy happy hour dies down everywhere else.\n\nTwo last bits of commentary...\nI swear I spotted John Voight.\nBOOOOO on the Lakers!", "author": "Angella S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-15", "description": "The burger here has really gone downhill. Not special anymore. Just another boring, overpriced corporate chain hotel burger. Kind of on par with superduper burger or other burgers not worth getting excited about.", "author": "Brandon R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-06", "description": "So I am wandering about the streets of San Francisco on a Sunday looking for a nice place to grab a cocktail and I remember a friend had recommended coming in here and checking out this bar specifically.  Well it was an awesome recommendation and a fantastic bar.  The first thing you notice is the \"Pied Piper\" by Maxfield Parish hanging prominently behind the bar.  Its not everyday you get to see an original Parish, usually you only see them in books or prints.  I am a huge Parish fan ever since my days back in art school in New Jersey.  An absolute treat to get to see this painting, in fact at first I couldn't believe it was the original.  I came to find out it was commissioned by the hotel back in 1909 for $6000 and now is estimated to be worth around 5 million.  Now that's an investment...\n\nThe room is beautifully decorated (it does have a bit of a speakeasy look to it) and has excellent ambient lighting.  Since it was a Sunday afternoon it wasn't too crowded nor too empty, the sound levels are good and you can carry an easy conversation with no problems.\n\nSo how about the drinks...they were very good.  I had a White Mandarin Cosmo and a Market Gimlet and both were solid drinks.  Free unlimited senbei snacks were provided and it was an overall good usage of a few hours time.  I will definitely come back here again.", "author": "LwoHeat S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-29", "description": "As a background, my mom, sister, and mom's friends have made it a Christmas tradition to come to Maxfield's for dinner.  We've been coming here for the past 15 years and it never disappoints.\n\nPros: amazing location right above the BART station in the Palace Hotel, great menu, excellent service, wonderful restaurant atmosphere, nice and quiet and comfortable for dinner conversation\n\nCons: none :)\n\nIf you do make it to Maxfield's during the holiday season, be sure to check out the 12 days of Christmas layer cake in the hotel lobby", "author": "Caitlin K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-04", "description": "Great bar, but food sucks. Every time I order something it is not cooked as requested or something worse. Others in my party, always get exactly what was ordered. I've spoken with the food manager 6 times, not wanting to be comped or have anything free. Service is great, bar is great, the restoration of the mural is amazing, the food is indescribable.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-09", "description": "My cousin is staying at the Palace hotel. She was jet lagged so we agreed to meet at the hotel bar. The bar was packed so we sat ourselves down in the dining room, which is quite grand. Several times a busboy told us our waitress was on her way. She never materialized. After thirty minutes or so a waiter did take our order.  My cousin had a couple of cocktails at $17 a piece....I had an Arnold Palmer which was bad. How can you mess up iced tea and lemonade? Then we ordered the charcuterie plate and fried calamari. I know... I know..... I was being accommodating. The charcuterie had the fattiest ever pate and some dried up rubber tasting prosciutto. The calamari was barely warm and fried in old oil. The busboys really tried to be helpful. Fire the wait staff and the chef.  Promote the busboys!", "author": "Patale M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-24", "description": "Love the gimlet here! Best I've had. The cucumber vodka made the drink tasty and refreshing. The bar itself is nice; it feels like you've stepped back into old San Francisco.", "author": "Sherice W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-06", "description": "A classy old school hotel bar that's hella expensive as all git.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-19", "description": "If you have the chance, and you're near the Palace Hotel (Market, and New Montgomery) stop in The Pied Piper Bar and Grill, for a drink and maybe some food. The decor is super fabulous.. the bar ... GRAND, the upholstery... comfy cozy, and the walls... covered with pictures. With the signature painting of the Pied Piper, hung over their enormous bar. \n\nIt's like a place right out of the movies where you'd suspect the high society, beautiful hobnobbing people of yester year, would gather and speak in hush hush tones, and hear feminine flirty sexy giggles, in response to those hush hush romantic innuendos. \n\nBut... enough about that, what are we here for .... food and...COCKTAILS! And you know what, we've found our new favorite drink, and I think it's probably only made professionally here. It's called the Market Gimlet, and it's wonderful, it's sophisticated, elegant and decadent. \n\nIt's muddled organic cucumber, vodka, simple syrup ( maybe a splash of Sprite) fresh lime juice, and Tarragon infused Agave. Shaken, and poured in a tumbler over ice, rimmed with a slice of cucumber. It's refreshingly natural, and yet intoxicatingly addictive. Well worth the $12. price.  I think it could just be one of those drinks that'll make you forget about ordering food. Hey, cucumber's food isn't it... then it's all good!\n\nFor appetizer we ordered the fresh shucked Oysters ( what else would you order with these drinks and romantic surroundings) They were kinda on the smallish side for $12., but they were fresh, and very good with the rice wine wasabi cocktail sauce. \n\nOur two Cowboy Steaks for dinner arrived cooked to a perfect medium rare, with baked potato, and grilled asparagus... mmmm yum! $36. \n\nOur waiter Keith, was very professional, classy, and attentive. The bartender efficient, and quick, the cooks ( though we never seen them) did an excellent job preparing our meals. \n\nLike I said at the beginning.... if you get the chance... and you're near the Palace Hotel, stop in and try the food and cocktails \nIt's not JUST hotel food!", "author": "Joe K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-29", "description": "$12 for a rum & coke? Are you serious?  \n\nMaybe it's because I work for a tech company that has a casual dress code (I don't think i've ever seen people in business suits in my office), maybe it's because I'm under 30, or maybe I just think you should be able to get a basic cocktail for under $10.  Any way you look at it this bar is not for people like me.", "author": "Lara O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-25", "description": "Twenty bucks for a cold ham and cheese croissant.", "author": "Daniel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-06", "description": "Of all places, THIS is where we used to come when I was in law school. Reasonably priced beers is why. \n\nBut to be honest, if I was toting a tourist around town for the day, I would absolutely bring them here. The Pied Piper is inside the historic Palace Hotel and transports you to another time. The bartenders and friendly, the crowd is quiet, but sociable (a good spot if you actually want to have a conversation with someone) and the food is good!", "author": "Melissa N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-14", "description": "Servers were rude and patronizing. They also did not know what bottomless mimosas meant. If it says bottomless on the menu, it means endless. Yet, it took them 4 servers, 1 manager and 30 minutes to figure out they made an error on the menu. You gotta fight for your right... To partyyyyyy!", "author": "Yunah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-13", "description": "THE go-to place for a sophisticated, yet relaxing cocktail experience.  The atmosphere is pure old-school San Francisco, dark, woody, old-world classic.\n\nJoel is my favorite bartender.  He has a really good sense of pace and knows when to leave people alone and when to ask if you want a replenishment.  His martinis are perfectly done!\n\nThis is the best bar in the City to meet friends or business associates for a well-made cocktail.\n\nBonus: food is excellent.  The burger is one of the best in the City!!", "author": "Donnie Mac M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-28", "description": "Home of the Pied Piper mural by Maxfield Parrish. Voted best Martini in San Francisco and \"World's Seven Greatest Bar.\" Rich in history and architecture. Good place to unwind before retiring for the night. But mind you know, don't drink and drive.", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "The bar is 4.5 stars and the restaurant is 3.5 stars.  \n\nThe bar has the legendary Maxfield Parish painting and is a pretty good meeting place, if not quite an awesome 5-star hang.  It's a nice spot for ordering a cocktail.  Well worth the time and effort... A little crowded after work, but an excellent place to rendezvous.  Service is mixed, but the halfway decent the by-the-glass wine list is generally easy to get your hands on.  Bar snacks add a nice little touch, though not a lot.  But here's the kicker that puts it over the top, I've never been sorry to meet up with someone here.  The setting adds a little joie de vivre.\n\nThe restaurant is a decent location for white table cloth business.  Nearby  enough for downtowners, consistent enough - as in always pretty-to-very good...with a notable exception in the mountainous kobe beef burger, AKA the stack o' beauty.  Otherwise, good soups, salads, pastas and entrees.  Crab salad is a good call.  As well as most of the specials.  Dining service is consistently great.  But why no refills for my Arnold Palmers?  \n\nP.S. This may not apply by time you read this, but June is asparagus month.  Woo-hoo...", "author": "Ted R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-29", "description": "This has to be appreciated for the icon it is. It's a charming, clubby room that is dominated (usually) by the mural of The Pied Piper painted by Maxfield Parrish. After a bit of a brouhaha, the painting which was earmarked for sale, ended up staying. Except it is out being restored at this time. The cocktails are lovely but $14 is probably the average. It's a one-drink sort of place for most people- following an evening on the town.", "author": "Paula H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-28", "description": "The combination of hardwood paneling, stained glass ceiling and the nearly hundred year-old mosaic floor give Maxfield's an old-time sort of feel. When a colleague invited me to Maxfield's for lunch recently I felt like I walked into another century. This is not the sort of establishment you patronize if you're looking for a quick and dirty lunch. This is a restaurant where you ought to take your time. \n\nIf you enjoy a deftly prepared Caesar salad, this is the spot to get it. Whole leaf romaine coalesces with a richly superior dressing and is accompanied by white anchovy, shaved grana padano cheese and a focaccia crouton that runs the length of the rather large plate. It is available with chicken, an addition I happily accepted. And by chicken I do not mean a few cubes of dry breast. Instead you'll receive a succulent portion of cooked to perfection chicken - a wonderful complement to the well-prepared salad.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-26", "description": "It's all about the painting!  And of course, situated in the upmost of elegance off the lobby of the Palace Hotel, Pied Piper is worth stopping for a drink! Get a seat at the bar, talk with the friendly bar tenders and ponder what all those kids are doing exactly in that huge painting over a few cocktails.  Easy conversation starter! Bar is very elegant; elaborate dark wood work, plush seating, profesional staff. Pricey, but worth a stop!", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-20", "description": "Get the Market Gimlet. For the love of god...if you are in San Francisco, and like cocktails, go to this bar and get the Market Gimlet. I don't care that it's kind of expensive, do it. And sit at the beautiful bar, with the old school bartenders, and bask in the glow of the Maxfield Parrish mural.\n\nThis place is old school classy...dark wood paneling and cushy dark leather seats with those studs around the edges. The drinks are great, and made by bartenders that take their time and do things right. If I lived in San Francisco, I would spend a lot of time here. Even if you don't stay in this hotel, stop by the bar for after dinner drinks. It won't disappoint.", "author": "Morgan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-17", "description": "A truly real and enjoyable lounge!  If you consider yourself a true aficionado of lounging in a true lounge, a connoisseur of fine brandy, good wine, distilled spirits or a just a plain neat libation, and where you enjoy it, this place is for you. It is, in the most traditional of senses, with the wood finishes, subdued lighting, traditional motifs, art and architectural design and décor, as well as the service and ambience, one of the most traditional, quaint and extraordinary old fashioned lounges in the country. Maxfield's Piper artwork behind the bar not only adds to the flamboyance of the locale, but gives you somewhat of the sense of heightened euphoria of an age gone by, today! It's not only the libation but the environs that make the sensation! Go for it!", "author": "Rick G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-11", "description": "I know a place that will set the martini shaker next to your already to-the-rim glass bc their pour was so generous.  And there are places like the Pied Piper who leave about 1/2 inch left to be desired in your glass.  That makes me wince just a bit.\n\nPied piper will keep a well-filled bowl of little crackers and wasabi peas at your table, and will make sure you have your next drink before you finish your last.\n\nThe crowd was a mix, but, yeah, mostly businessy.  It was fun to watch hotel guests wander in the hotel from Market.", "author": "Meg W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-28", "description": "Ok, so i went here with my crew based on the positive impression i got from the yelp page.  It seemed like an alright place, clean, not too loud, not super crowded.\n\nSo a friend of my is ordering stoly and tonic, and the waiter says, hey, you know we have a featured vodka thats about the same price as stoly and tastes much cleaner...  Now, I'm a man who can appreciate a good vodka, so 3 of us tried the 'featured' vodka and then i think i had another one after that was through.  So we're there long enough for me to have 4 drinks (not drinking very fast) so they bring us the check (for about 6-7 people) and its $300!  Turns out beers there at $6 even for the bottled ones!  those \"featured vodkas\"... $12.   I mean, this is not a nightclub by any means.  Anyway.... not a great place to go with a group of friends.  The price was simply not justified.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-21", "description": "Smashing ginger champagne was fantastic, as were the fried calamari and beef short rib meatballs (a bit salty).  Seating in the main room was limited, and prices were typically high, but it's a nice place to unwind with friends.  Definitely not a pick up joint, but more business convention-friendly.", "author": "Gregory N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-23", "description": "Classy place to grab a drink before dinner or a meeting. I was there on a late night arguing with him but the beauty of that place made me stop and enjoy it all. Def reminds me of a breakfast at Tiffany's kind of thing. They had these cute little salted nuts as a snack....I'll def go back with my gfs next time forsure.", "author": "Lisa Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-19", "description": "Ambience and drinks are very nice. Wait staff is professional and caring. The room is warm and friendly and classic. \nHowever, the food has much to be desired. Prices are very high; quality very low. What's worse is that they keep changing the presentations so if you frequent the restaurant/bar, you never know what to expect even if you order an item you had previously. Absolutely no consistency. The chef appears to go for change for change sake without concern for how customers will react or enjoy the food. The changes are never on the positive side--reduced portions, lower quality food, additions that don't enhance but are attempts to cover up the changes.", "author": "Jeffery K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-04", "description": "Ahi tartare pretty good. Butternut squash purée and Brussels sprouts blah. Pan roasted salmon dry and over cooked -- not quite salvaged by the hollandaise, as if it should have to be. The sundae (cake) was  drier than the over cooked salmon-- spare yourself. However, the service was very good-- they just had nothing to work with. Least memorable meal I cam remember in San Francisco -- whatever the price point.", "author": "George A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-04", "description": "Stopped here this afternoon to watch the Giants game, have a drink and some food. The good: wait staff & decor, convenient location right next to Montgomery BART, an oasis from the characters on Market Street, a few decent beers on tap. The bad: the food. This place should be ashamed! Ordered Chicken Club sandwich and Chopped Salad. Sandwich served on hard roll, chicken was dry, and fries were just OK. Salad was plain & just horrible. Chunks of sliced iceberg, a couple of sliced cherry tomatoes, a couple of small beets, topped with some gross mayo dressing. Salad was $16 and sandwich was $18. Bleh!!! I'll return, but will stick to cocktails and mixed nuts.", "author": "Kathy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-03", "description": "Stopped in and had the Sirachi hot wings (awesome!), bacon wrapped scallops (yes please!), and some wine. Well worth it and beautiful setting! Great service also!", "author": "Briana C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-05", "description": "This is for the restaurant. The food is decent, but it's about 30-40% over priced. I had the mac and cheese (this should've been like 12 dollars, not 24.) and it was decent, but I've had much better. I also had the ahi appetizer which was good, but not great.\n\nThe reason I give this a 2 and not a 3 is that the waitress basically just ignored me (I was dining alone). I had to flag her down several times. For as much as this place charges, the service can't just be some woman who seriously ignored me to the point that it felt like she thought if she just kept doing it, I would go away. There is just no excuse for ignoring someone when you make a living on tips.", "author": "jac n."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-01", "description": "Unless you have business to be dealt with that requires dark, moody, and woodsy room with a scattering of men in suits, I don't see a reason to come here. The crowd here is predominantly older business men sipping dirty martinis and watching tennis on one of two midsized flat screens. I had to watch a world cup game here out of convenience and it was extremely unpleasant because of the stiff environment. One of the flat screens was a few seconds off, but luckily I was watching on the faster one. The bartender was just cold, but one of the servers was incredibly nice. I like the discreet entrance, which gives it a speakeasy feel. Anyway, this place is alright if you want to impress a client with overpriced drinks, but not somewhere I'd associate with a good time.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-25", "description": "Well, not so great tonight. Prawn salad, at $24, was awful. Prawns bland, and undercooked, if such a thing is possible. Other ingredients virtually indistinguishable, other than morsels of cheese, beans, corn, and avocado, and thoroughly overpowering dressing.\n\nA simple glass of Cakebread Sauvignon Blanc hugely overpriced at $16. Burger ordered medium rare arrived medium-to-well done. \n\nStill a fun place to people watch, albeit very noisy.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-09", "description": "This review centers around the Valentine's Day experience, so it may not apply to regular Friday nights.\n\nTypically, when I write down my thoughts on a place, I think of the experience and then the cost, and decide if it was worth the time and the money.   This place has a great experience, but the price is a left hook to the jaw.\n\nThe Wife and I came here on Valentine's Day, which is also her birthday, and also our 'Engagement Anniversary.'   So I don't mind coming to a place that is pricey because I'm fitting two dinners into one.   And I'm also usually comfortable with a fixed price menu on Valentine's, although I like to know the cost before I start (preferably when I make the reservations).\n\nWe arrive to a wonderful ambience (the Palace hotel is a palace), get seated, wait, wait a litle longer, and then a little more before our waiter returns from his smoke break, hands us the menus that were $90 per head, with a glass of champagne and port included.  We got a half bottle of wine to supplement the meal.\n\nWe split a half bottle of wine and made our selections.  The appetizers were a little above average, the entree was excellent, I had the Kobe beef, but there was only one dessert to split.  They did bring it with a candle, but to be honest the entire time it seemed like the waiter was waiting to do something else.  \n\nAll in all, the food was excellent and the environment definitely has you 'putting on the ritz,' but I can't say that I whole-heartedly recommend a regular visit here...the bill was way too high and the service too average for the cost.  Perhaps it would be different on another day with a different waiter.", "author": "Dennis H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-08", "description": "Great place for business meetings.  Fabulous staff...not in your face, but there to please.  No worries about staying a long time, just tip accordingly.  Be sure to look around at all the great pictures on the walls!  Check out the back room too where the wines are stored.  I feel like I should be sipping scotch in this place.  Even my glass of wine (Cakebread was outstanding!) wasn't classy enough for this place.  ;)  Definitely a must-see while in SF!  And be sure to visit the main dining room too...but I prefer the bar ambiance over the bright restaurant.", "author": "Tara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-24", "description": "Better for drinking than for food. Not sure why there is a very large painting of the pied piper but there is.  \n\nThe cocktail height chairs are very uncomfortable, low backs and too high. \n\nCrowd is fun and friendly.  Service is inconsistent.  The Palace Hotel is a lovely venue.", "author": "Coral H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-21", "description": "If you must, come here to gaze at the painting while you \"enjoy\" one overpriced drink and then do yourself a favor and leave. \n\nDon't waste your time or money on anything else. We waited 35 mintues for our meal. When we finally tracked down the asbsent waiter he said \"I have no idea how long it will take, it's a mess back there\". Really? What does that mean? He had the nerve to ask if we wanted the check for our drinks, then changed his mind & said if the food wasn't out in five minutes we could just leave. That's the only thing they get a star for. \n\nI wonder how much money they throw away doing this? I wonder how much food they throw away? \n\nWhen the food came, it was awful and not worth the price by any means.", "author": "Amarar S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-28", "description": "This bar is amazing! I came here with some friends after dinner. We were walking home from Scoma's at midnight, headed through China Town, and one of my friends (who grew up here) said \"Wait--I have to show you the coolest bar you've ever seen!\" So we followed him as he darted across the streets, over the cable car tracks, to some random glass door in the side of a really large building. Boy am I glad we did. The art on the wall behind the bar is absolutely breathtaking. It's the largest painting I've ever seen in my life. Apparently, it's worth several million dollars.\n\nWe got some real spicy trail mix and drinks. My only complaint is that my Gin/Tonic (normally my favorite drink ever) had FAR too much Gin and not enough Tonic. After dinner that can be a little overpowering. I'm sure I could have asked the bartender to fix it, but I was so enrapt by our conversation about the artwork and the other original art pieces my friends had seen all over the world. \n\nThat small complaint aside, this is a stellar joint, and I'll be back again soon for sure.", "author": "Ron S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-01", "description": "22 dollars for a salad? Uhhh good thing the meal is comped...\n\nAside from it being a very expensive salad, it was incredibly delicious. The thai shrimp salad is soooo good. Dressing is not typical \"asian ie. tangy dressing\" it has a nice subtle flavors that pair well with the avocado and cripies. My only complaint is it came with like 4 shrimp. They were big but still. 4!?! I need my protein!", "author": "Amy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-25", "description": "Poor service. Me and my girlfriend came here to try their food and was completely ignored by the waiter. He helped a table behind us and didn't even acknowledge us. Stay away from this place", "author": "Jessie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "LOVE this bar. And believe i have been to a LOT. There are not too many in this city like it : dark, cozy, authentic with lots of wood, leather & low lighting. We have lived here almost 2 years & have bypassed it so many times, that finally after an afternoon of shopping, we stopped by on the way home. I cant believe we waited this long. The drinks are well-made & reasonably priced for the city. The ahi tuna appetizer is fantastic too.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-30", "description": "A really, really cool bar with some great food.\n\nI had a steak quesadilla and it was excellent.\n\nA little pricey, but a great place to relax.", "author": "Tom V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-23", "description": "I enjoyed a delicious, over-priced salmon pizza on puff pastry this evening. The crust was light, flaky and a perfect match for the delicate taste of the salmon.  But yeah - it was too expensive.\n\nOn the plus side, plenty of free crunchy, savory snacks to nibble while you're waiting.\n\nExtra star for our server Rene.  Friendly, knowledgeable and competent, he was a true professional.", "author": "Ms J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-10", "description": "I have to say it is as good as it gets for a few reasons:\n\n1. I have never enjoyed a wedge of lettuce with the most perfect blue cheese and apple smoked bacon.\n\n2. Reminds me of a place where you can go time and time again and they would remember you and it would feel like home...or better.\n\n3. Watching the staff get along so well and help each other with ease made me feel happy.  This is what it is all about. \n\nLuis you served me well and made me smile.  Thanks for making my afternoon lunch a great one. I have only 4 months left in San Francisco before I move and you are going to see me at least two more times.  Why didn't I stop in years ago!", "author": "Scott P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-13", "description": "The painting has been returned, and there is now a reason to visit. I am happily returning for my weekly lunch and cocktails. I will give them 5 stars if they take down those hideous tv sets.", "author": "Christopher R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-13", "description": "Wild Mushroom Pizza is off the hook!  The Pied Piper Grill gets its name off the Maxfield Parrish painting that hangs behind the bar.  Overall this is a great place to grab drinks and hang out but this review is dedicated to the Wild Mushroom Pizza I tried here last.  \nIt was a Sunday afternoon and we wanted to unwind after a long day of exploring the city.  Wanted something light to eat since we had lunch couple hours before but the guy next to us had ordered the pizza and was raving about it, so we decided to get it.  Less is more and that's so true with this pizza.  It's light, airy, and complex.  The herbed boursin gives it a nutty creamy texture and the small arugula salad on top adds the perfect compliment and crunch.  It was so good that we scarfed it down within 5 minutes.  It's always great to find something you'd want to come back to a restaurant/bar for, and for me it's their Wild Mushroom Pizza", "author": "Sunny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-14", "description": "The Palace Hotel is gorgeous and majestic! Walking through the lobby to Maxfield's was like being transporting back in time. The dark, moody lights and predominantly wood decor reminded me of the saloons from back in the day frequented by well-to-doers smoking their cigars over a strong glass. We came here on a late Saturday night to wind down with some cocktails and truffle fries. A heed of warning, the cocktails are pricey but quite potent. \n\nIt was quiet with an interesting mix of middle-aged folk, perfect for a night cap or just for getting away from hectic Union Sq. with a nice strong drink. An intoxicated woman started running around the bar with a light saber which unfortunately broke up the quiet atmosphere but also added some chuckles to end the night.", "author": "Lizz K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-02", "description": "We stayed at Maxfield's during a stay at the Palace, which made it awfully easy to get to, so I don't have any complaints about parking that many other's had.  We also only had drinks, so no food reviews here.\n\nWe had 3 drinks between us, a Lemon drop (delicious), Lychee Martini (tasty) and the Ralston I believe (not so much).  I had originally ordered a Vesper, but they apparently couldn't make it.  Prices are $11-12 for a cocktail, which aren't too bad for a hotel bar.\n\nWe were seated at a nice corner table, but had this creepy old lady stare at us for a good five minutes.  This admittedly make the experience a little more awkward, but otherwise was great.\n\nAs for parking if you don't take a cab or public transit, I'd recommend the SFMOMA parking if you're not going to be there too late.  Rates there are great for short term, it's close and there's always good parking.\n\nPros:\n-Good drink selection.\n-Good atmosphere.\n\nCons:\n-Old (sometimes creepy) crowd.", "author": "Hans -."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-13", "description": "The bar has a really \"corporate\" feel to it but the drinks are good and the food was pretty decent, at least what we ordered.\n\nService was just okay. The waiter didn't refill our water glasses. Guess that was cue for us to either order another cocktail or please leave.", "author": "Leanne S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-05", "description": "Sat at the bar, ordered a steak, rare, with only broccoli on the side.  Waited over 30 minutes and it comes out cold.  How hard is this?  This place is fine for drinks but go to the Four Seasons down the street if you want to eat. Same price but the food shows up hot (sounds like a basic requirement but apparently they're having trouble with it at The Palace.)", "author": "Matt C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-07", "description": "My favorite bar in the city, this place makes a lot of good cocktails, and has a nice selection of snacks and small plates available as well.\n\nThe decor is old school classy, with wood panelling and lots of small wooden tables with laid in chess/backgammon boards lit by tea candles. The bar gets its name from the large mural behind the bar, which sports an interesting history of its own. Read all about it in the menu.\n\nStaff is friendly and attentive, even when you're seated on the outer perimeter.", "author": "Wes T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-30", "description": "Maxfield's Pied Piper Bar is conveniently located smack in between my work and one of my close girlfriend's work...otherwise, I don't think we would've found ourselves there on a Tuesday evening.\n\nThe bar was pretty crowded when we went - the last time I had been there it was relatively empty but I'm sure it must vary with the conventions in town.  I was a little surprised by the wine by the glass prices ($12 for a pinot grigio!), but the service is great.  My friend and I were searching, searching for a place to sit down...  Alas, nothing.  The kind waiter saw us looking for a place to sit down, so when a table freed up, he let us know and showed us the table (there are no hostesses here).  He totally didn't have to do that, and we definitely appreciated it (she was having a tough day!).\n\nOtherwise, the place is beautiful, albeit old school, on the inside.  Tons of dark wood - a very classic look.  And, some of the best bathrooms in the area...", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-10", "description": "My company hosted a Christmas party at the Palace Hotel's grand ballroom, and Maxfield's bar was inside. Boy oh boy, I will NEVER come here again.\n\nThe bartender was RUDE as hell. He served me as if he hated his job and it took almost 5 minutes before he even acknowledged our group!\n\nI rarely give out bad reviews, but this place was absolutely TERRIBLE. The tequila shots weren't even measured, and they didn't even offer salt & lime.\n\nDo yourself a favor, and DO NOT come here.", "author": "Jorge S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-25", "description": "The bacon cheddar burger and truffle fries were excellent. The ambiance was full of rich wood and old Mad Men style charm. Unfortunately the service was just so-so, even though it wasn't too busy at 1pm on a Friday. Too bad the old famous painting was taken down, but I hope they will replace it with a replica or a 70-inch flat screen TV :) I'll definitely come back!", "author": "Ariel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-09", "description": "My girlfriend and I were staying at the Palace and we stopped into the bar for a late night drink.  This place was awesome.  I'm not aware of another place where you can grab a drink 10ft away from a piece of art valued at over $3 million.  The colors in the painting are so bright and vibrant; we just sat there and stared at it for a while.  The drinks were nice.  My Manhattan was extremely smooth, very drinkable.\n\nI have to say that besides the famous painting, the best part of the experience was our waiter.  I think his name was Moshe, but I'm not entirely sure (he said that he was originally from Israel).  He was very attentive and made sure that we were happy with everything.  At the end of the night he even showed us around the surrounding bar and lounge area and gave us a brief history of the place.  He knew everything about the hotel, right down to the details about building material used such as tiling, wood, etc.  If he's still working there, he needs to be promoted to a managerial position.  His attention to detail and dedication to service were incredible and he should be responsible for sharing those qualities with other employees.", "author": "PJ F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-23", "description": "After doing some downtown shopping, the sis and I wandered into this bar for afternoon drinks =D It was very fancy schmancy and we were definitely under dressed in this classy bar, but we were tired and just wanted some drinks. Cocktails were a bit pricey, $24 for a margarita and a martini. They were very strong for drinking at 2pm on a weekday. We also got mimosas and that def made up for the first two drinks. It was so good, I finally understood why people would drink mimosas at breakfast! All in all, this bar was lovely and a good one to check out if you're feeling fancy. The sis even asked me, \"Do you feel like you're on the Titanic? Because this bar looks like the same one in the movie!\"", "author": "Panina H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-14", "description": "I popped into Maxfield's/Pied Piper bar last night after a uber-touristy trip around the city in a festively decorated Cable car. (Done through duck tours, highly recommend it) An event must have taken place earlier at the hotel because the bar was full of men in suits and ties and women in flowing dresses. They were, although sharply dressed, a bit rowdy and noisy. This isn't enough to make me subtract a star from the review; it created a dissonant ambiance but I suspect isn't a common atmosphere for the bar. \n\nMy party of 4 slipped into a corner booth furthest from the bar, we were instantly greeted by a waiter who brought us a bowl of spicy/salty snacks for us to munch on while deciding what to drink. The drink selection is great- very interesting concoctions, ones I haven't seen in other bars. I ordered a hot apple cider drink with Tuaca (our waiter informed us this is an Italian liqueur, vanilla/citrus). The cocktails are a bit pricey ($12) if you want to be there all night, and though they are absolutely delicious, they are wavering on the small side.\n\nThe bar is absolutely massive which gives a very impressive feeling, there are wood panels on all the walls with beautiful vaulted ceilings. The walls have images of old time celebrities who have stayed in the hotel, and of course-the famous pied piper mural is brilliantly displayed behind the bar.\n\nPersonally, I am a fan of establishments with lower lighting, and if they are as vast as this bar- they are designed in a way that allows you to feel cozily nestled in your particular space. The Pied Piper bar feels too open and bright (and on this particular night, too loud). The people watching isn't as interesting since there is an upper-crust air to everything. The bar was perfect for what we accessed it for- a place to rest for a bit, grab a warm spiked drink and close our Sunday night conversations. I wouldn't think to go back since it didn't have an ambiance that pulled me. And at 12 dollars a drink, I'd rather go to a place with a bit more life, some interesting music, and a more dynamic atmosphere.", "author": "Tawnee K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-30", "description": "Despite it's downtown location, it's residence within The Palace Hotel, and it's pristine display of yesteryear's opulence, the Pied Piper is all but unknown to most long time residents and born-here locals.  Because of this, it's a cool whistle-stop to bring a done-it-all, seen-everything date.  I like to spring it on people at the end of the day, usually after a day of hoofing around North Beach or hanging out around Union Square.  We'll be heading home....then right around the base of Montgomery I'll keep walking past the BART station.  When my sidekick asks where I'm headed, I'll gesture across Market and reply in a mischievous tone, \"C'mon....We're going somewhere\".\r\n\r\nThe two over-sized doors of the Palace Hotel face New Montgomery Street, and walking through them takes you into an elegant lobby.  Take the 1st right down the marble floored hallway, and the entrance to Maxfield's is an unadorned passage about 50 feet down and to your left.\r\n\r\nStep inside and you're greeted by a room that oozes with old-guard swank.  This isn't the sheet-rock, Masonite, and trendy lighting swank that you'd expect to attract the tawdry likes of Brittney Spears or Paris Hilton.  This is well-lit, old-growth hardwood from top-to-bottom swank that might have hosted the likes of Harry Truman, Winston Churchill, or F.D.R.\r\n\r\nThe crowing attraction is the Pied Piper itself...an over-sized painting by Maxfield Parrish that consumes most of the wall in back of the bar, and is reputed to be worth somewhere around what you'd expect to shell out on an all-you-can-eat pizza party for the entire state of Rhode Island.\r\n\r\nThe scenery is nice, but the suit-and-tie crowd is usually dull as dirt. The pick-up scene is non-existent, the music is soft and very old-guard, but sports are usually on the corner TV during the daytime.  The staff and clientele are usually dressed to the nines, but nobody bats and eyelash if you pop by a-la-tourist in blue jeans or shorts.  Don't expect to find one-dollar PBR's at happy hour....Though beer prices aren't anything that'll break the bank, they're understandably higher than what you'd expect to find at your average neighborhood pub.  But woe to you if your date likes good wine....they don't serve two-buck-chuck here, and if you stick around for more than one round the resulting bar tab can begin to drain your resources at an alarming rate.\r\n  \r\nIf you're in the downtown area entertaining a local who's seen it all, just mention Maxfield's...if she flashes you a puzzled look, take the lead and make your way to the corner of Market and New Montgomery.  It's great little surprise, a good addition to a first impression, and a nice finale for a low-key date.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-25", "description": "Sad, sad, sad, sad... The Pied Piper Bar without the fabulous Maxfield Parish Pied Piper painting. Now with just bad service and high prices, can't think of any reasons to go. They really need to change the name: maybe the Plunderer Bar, Kyo-ya Cash Bar.", "author": "Donald O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-22", "description": "Fun old-school bar in a classy central location. The truffle fries are wonderful, and the tuna tartar is spectacular. The service was fast, even when it was packed to the gills. A somewhat pricey but fun place to visit. Oh, yeah, and there's a huge Maxfield Parrish painting on the wall, you might want to take a look at it. ;-)", "author": "Jim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-25", "description": "This was a nice little place for dinner.  The atmosphere was very relaxing.  We sipped nonalcoholic drinks and ate appetizers for a couple of hours.  I will definitely come back!  The service was a bit slow, however.", "author": "jennifer p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-20", "description": "A bar that serves food- it's on the stately side of things without being too stuffy.\n\nTruffle fries are delicious.  Wedge salad was good.  Drinks were stiff to quite stiff.  \n\nA four star for the prices, which were high, though not unexpected.", "author": "I I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-02", "description": "the place is a real landmark grill and bar, a beauty at that. with a maxfield parrish painting of the pied piper above the bar to dazzle all visitors. the drinks (we had virgins) were remarkably pleasant and the atmosphere was perfect for a relaxing and sophisticated evening together. and yet, the service could not be less enthusiastic. that was almost a spoiler, but all other things being so top notch, it couldn't quite ruin our evening.", "author": "Frank G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-06", "description": "So I don't go to the Palace Hotel to sleep..I only come here to drink. It's kind of hidden, but I prefer to rest my head not in an actual hotel room -- but a bar -- that's cozily hidden in the hotel. \n\nThere are doors at the Market Street entrance.  Walk in, walk pass the mirror and down the hall a little bit and it'll be to your right.\n\nIt's grandiose. And dark. And sexy. \n\nIt is where attorneys bring their secretaries to discuss \"post - work\" matters.\n\nIt is where stockbrokers gather to talk about trading -- and we ain't talking about trading cards.\n\nIt is where the struttin' girls are tastefully admired by men sitting at the bar. \n\nIt is where class meets high class .. meets .. some ass.\n\nIt is where you can score a fabulous lychee martini. And great bar snack food like pretzels and peanuts and those green wasabi bad boy balls.", "author": "Vanessa W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-04", "description": "Went in for a drink and asked the bartender to change channel to tennis, he says ok my shift is ending the new bartender may want to change it back, ok new guy shows up ,,, what a dick ,claims we owe money for drinks we never had Won't shut up, old bartender comes back straightens it up,new guy can't say sorry for mistake,dick changes channel to provoke but it doesn't work so becomes bigger dick. Stupid dick looses customers with stupid dick attitude,  we go spend money elsewhere.", "author": "James m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-10", "description": "San Francisco is a frontier city. Its history is rooted in the Gold Rush and, as such, its story is one of entrepreneurs, adventurers, outlaws and other people who played on the fringes of society. Today, it's no different, really. We're still an outlaw town, in many ways. We still inhabit the fringes. Only now our frontiers are in technology and cuisine, as well as energy, social and environmental activism. San Francisco maintains an abiding respect for its heritage because that back-story justifies who we are today. And so our eating and drinking establishments are as likely to allude to the city's colorful past as they are to pay tribute to what's current, fashionable, or avant-garde. So when it comes to bars, the first thing I always notice is whether some place is \"old\" San Francisco or \"new\" San Francisco.\n\nThe Pied Piper is decidedly of the \"old\" San Francisco. Dark wood adorns the bar, a checkered tile floor, large oil painting above the bar, and the classiest cocktails you can find. Not to mention, it's set inside the opulent Palace Hotel in the city's historic financial center. Servers sport ties. You could imagine bankers of the early 20th century doing business over scotch and cigars. \n\nGrabbing a drink at the Pied Piper makes me feel stylish and, I must admit, damn important. You know you're experiencing something special. But it avoids exclusivity or priggishness; everyone is welcome at this bar. Of course, be prepared to pay dearly for the drinks :)", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-09", "description": "Disappointed. One of the worst meals I've had in SF to date. Server had zero personality, wasn't friendly at all. Bacon wrapped scallops were tolerable. Prosciutto plate was edible. Oysters were fine I guess. Cookie plate dessert tasted store bought. Overall, the Anchor Steams were the only thing I really enjoyed. Won't be eating here again.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-09", "description": "I love the ambiance! Dark wood, dim lighting with furniture that add to this mysterious yet charming vibe. Imagine a setting with men in business suits, narrow ties and tilted hats accompanied by cocktail-sipping women, circa 1960s: a scene stolen from Mad Men. (I have quite the imagination!) \n\nBut don't let that fool you, it's a mix crowd! Suit not required!! \n\nUnfortunately I've been here on nonalcoholic occasions (aka business meetings). Luckily it's not on my personal dollar, it's a little pricey. The food is pretty good, I usually stick to the salads. Food arrives quickly and nicely presented. The service is great, servers keep an eye on our table and check in without interrupting. \n\nI have yet to go during happy hour, I'll be sure to wear a fancy hat to fulfill my imagination (or I'll just pretend it's there).", "author": "Jamie Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-10", "description": "Took a chance and stopped by on the way to dinner.  Glad we did - atmosphere was sophisticated but relaxed.  A combination that is hard to achieve but amazing when it happens.", "author": "Charles W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-13", "description": "Beautiful bar (you must see the Maxfield Parrish painting, it's gorgeous). Nice ambience, yummy cocktails. Had the bacon wrapped scallops (delicious!!!), organic deviled eggs (OK), grilled, grass-fed lamb chops (delicious). The ambience is lovely, as is the hotel.", "author": "Elizabeth W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-18", "description": "I hereby dub myself the Dive Bar Ambassador to the Hotel Bar Circuit crowd.\n\nThis also starts out with the following epiphany...apparently, whenever I am within four blocks of 2nd and Market, during daylight, I become a raging alcoholic.\n\nBut I digress...within four blocks of the epicenter of my weekday-drinking-while-the-sun-is-still-out-universe there are a bevy of places to get your drink on. Some rougher around the edges* as well as some that are the exact opposite...meaning the Hotel Bars. Normally, due to ill formed preconceived notions of the patrons of both, the denizens of one do not usually cross-over to the other side, i.e. the groups and bars are normally mutually exclusive. I think this is a shame because both are really missing out so...this is where I come in.  I feel at home in both worlds and so I believe I can help both the Dive Bar Dweller person (\"DBD\") and the Hotel Bar Haughty person (\"HBH\") by putting forth reviews like the following for Maxfield's.  Call me something of social silly putty that wants to bring people together!\n\nAt Maxfield's:\n\nThe HBH crowd is just as self absorbed in their own groups or their drinks as any party or patron of any DBD's bar.  Meaning they have the same interest to take a load off from their day off meetings or work and are just happy to have a good drink with some friendly peeps.  So what that most are dressed in suits and cashmere...many are not too.  Often I found some of the wealthiest people I know are the most casually dressed...therefore...anybody actually fits in and doesn't feel ostracized.\n\nThe décor is straight up what you'd expect a top notch hotel bar.  Great wood.  Comfortable seats.  A strikingly beautiful bar with the signature painting overhead.  There are both small tables and plenty of bar space.  The area can hold a lot of people!  Essentially thing a very well designed tall roofed rectangle.  Just beautiful.\n\nThe drinks...well..I always get Grey Goose or Belvedere rocks..so impossible to mess up.  For $10 I get a very large drink.  I'll take this any day over the Sutter Station $8 for same that is half the size!  So you'll get a generous drink...now I've been with people who got house cocktails and they were neither impressed nor disappointed.  So I'd say hit or miss there.\n\nThe intangibles: nice to see only two small TVs...I'm here to chat w/ my peeps or to have a nice drink out with a good friend ...not to watch TV.  The service is spot on.  It is always easy to get someone's attention and they are crazy courteous.  You may need to schmooze a little to get a table if it is busy...but whatever.  Lastly, I love the snacks.  Three choices of munchies that are definitely worlds better than popcorn!\n\nSo, all in all, the only real differences for the DBD visiting the Hotel Bar, and specifically Maxfield's, is that it is brighter, cleaner, and has better munchies.  The people are essentially the same but just in different outfits.  Diversity in any environment is the most desirable quality.  So I encourage the Dave's, Sutter Station, Louie's, Dada crowd to mix it up a bit and grab a drink here...you'll get the crème de la crème of the classic Hotel Bar that SF has to offer.\n\n* Please see my Yelp review of Sutter Station at http://www.yelp.com/biz/sutter-station-san-francisco#hrid:mqmRKdeq50egjP11cmZlYg", "author": "Chris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-03", "description": "Here is the deal.\n\nThis must have been the place where the classic gin martini was concocted. \n \nAtmosphere:\nYou don't need a suit and tie to enjoy these libations although you would not be out of place if you had one on.  It's come one, come all at this bar. This seems like a place Hemingway would like to sip a mojito. This place is perfect for after dinner drinks with company or without.\n\nPrice:\nNot bad considering what you get. The drinks are amazingly mixed and the food is not your typical bar menu. You can get a great gourmet burger with a cocktail for around $25. \n\nParking:\nMuni and Bart stops right out front. There is also street parking and garages all around this part of the city.", "author": "Aaron A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-01", "description": "Absolutely the worst service I have ever had in SF!!!!\nThey don't care period!\nI will never darken their damn door again!", "author": "Walter S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-01", "description": "20 minutes to go before my customer turns up. He doesn't want to eat and its nearly lunch time on a Friday and my office is an embarrassment. The Pied Piper delivered and then some. Great ambience - sophisticated, classy but not too much - allowances for the slovenly dress code that is San Francisco (you won't get this in Manhattan at a hotel bar for instance). No pressure to eat or even drink and quite simply, the best pint I have had in San Francisco in a year - Fat Tire. It gets busy in the evenings particularly on Thursdays but lunchtimes should always be fine.", "author": "Richard M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-01", "description": "Although I think the Pied Piper master piece is so out of place here; I love the old world charm of this bar. It's a sophisticated quiet place when you're trying to get know someone or spending time with someone special. \n\nPss : Be careful!  The chicken sandwich is actually a chicken BLT.  If you're with a Jew, and can't finish the sandwich don't feed it to them!!\n\nSorry Zohan ;)", "author": "Anastasia Beaver Housand J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-15", "description": "Just had a drink here ... Would love to come back for a bite. My review is based on the history and decor of the place. I would love to come back for a meal next time..... the history of the large dining room and large paintings is worth a trip!", "author": "Shane S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "Staying at The Palace and while walking by noticed a couple empty seats at the bar. Sat down and had a couple pricey cocktails. The bartender was great and the restored Pied Piper of Hamelin painting was extraordinary. Great historic place to stop for a drink,", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-02", "description": "I came here on Valentine's Day/Chinese New Year for their Sunday Brunch Buffet. Everything was really good - especially the scramble that I had made-to-order. I was downing mimosas, scarfing down cantaloupe (because brunch isn't brunch without a good helping of cantaloupe), pastries/desserts, portobello filled ravioli in pesto cream sauce, etc.\n\nThe waitress was very friendly, her advice to \"take it slow, take it very slow\" was extremely helpful. I think we sat there for like 2.5 hours.\n\nAs a bonus that day, I saw that old man from 30 Rock (the rich old man, I forget his name, but he's in some other comedies) and also Dave Chappelle. I know a guy who called him Chris Rock to his face 2-3 times even after he denied it. I was sitting next to him. I was mortified. Same day as this brunch. True story.", "author": "Ellis L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-18", "description": "Definitely a sweet little spot to pop in after work for a martooni :)\n\nI've only been here when it was packed, so seating isn't always there, but every time I've gone, I've found that people are more than happy to let you share their table with them, which is nice. One time, a businessman thought I was a high level call girl, which honestly, I will just take as a compliment and go with it :) Either that or i need to stop wearing red lipstick and talking about how much I charge by the hour.\n\nOther than that, the crowd seems mostly after work businessy, but hey, it's the FiDi, so what do you expect. Definitely worth checking out and occasionally they have live jazz music which is pretty damn cool.", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-29", "description": "Went to Maxfield's restaurant tonight with my husband, mother and a few of her friends.  What an embarrassment.  I think this restaurant takes the cake for the worst dining experience I have ever had in San Francisco!!!!\n\nWe arrive and waited about five minutes before we are seated.  The waiter passed us a few times and did not even make eye contact.  I thought we were invisible.  Our waiter, Carlos, finally seated us without saying a word.  He basically just pointed to the table.\n\nWe sat down and were not given enough menue.  The menus followed five minutes later with a slap to the table.  Carlos came to take our orders, still unable to make eye contact.  We asked for a wine list.  He disappeared without a word for at least another ten minutes.  The food is expensive, the salmon (at $29 a pop) is farm raised and the atmosphere felt cold and uninviting.\n\nCarlos had his hands full and seemed to be the only server on the floor.  The entire time we dined he never connected or made eye contact, all the meals, drinks, the bill etc were all thrown on the table instead of being placed and we had to wait a hella long time to order, to get our wine, to get the wine glasses etc.\n\nAt over $50 a head you would think you would get some service.  Carlos never refilled our waters, we had to pour our own wine, he handed us our to go boxes to prep ourselves and he did not even ask my husband how he wanted his burger.\n\nThe food was good, but ordinary.  The only positive was the meals were large and there was plenty of food.\n\nMy mom enjoyed her farm raised salmon but I am guessing she could make it better herself at home. The chicken seemed plain and came with not much more than steamed broccoli etc.\n\nMy husband enjoyed his burger - thank goodness he likes it medium rare. I like mine well done so I would not have been pleased.\n\nAll in all is was a PISS POOR dining experience.  Crappy atmosphere, the worst service I have ever gotten at any restaurant, extremely high prices for average food and an overall horrible dining experience.\n\nI left covered with white lint all over my black pants.  Needless to say,  I will NEVER return.", "author": "N. Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-17", "description": "Come only to gaze at the Maxfield Parrish masterpiece, but not for the overpriced drinks and neglectful service.", "author": "Anastasia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-07", "description": "Nice bar.  Great place to take clients, parents, that special someone you want to impress.  Good drinks, a relaxed yet classy atmosphere.  You know how you wouldn't wear a suit and tie to Zeitgeist?  This would be the place where you might not feel entirely comfortable in a Mohawk. They have good free snacks, and they also have a good appetizer menu.  \n\nHere's the thing (leaning in closer, yeah I've been drinking gin.  Huh?  Tanquerey or Sapphire, maybe both.  What?  I think I had one of each.  Stop changing the subject!)  \n\nAnyway, here's the thing:  Directly across the hall from Maxfield's (It's just off the lobby inside the Palace Hotel) is the BEST bathroom in the Financial District.  It's very nice, it has marble, great stalls, always clean, the works.\n\nI don't share this secret often.  People always go into the McDonald's down the street and find out that no, there is no bathroom.  If they only knew what they were missing.", "author": "Nelson W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "This place is wonderful! One of the things I really love about it is that it exists in an area that is super bad dining-wise - most of the places that are nearby the Pied Piper are either really cheap but really bad quality or are extremely fancy and way out of my price range. Though, this place manages to have a wonderful polished pub atmosphere, delicious food, quality service, and a reasonable price! On the lunch menu steaks, burgers, chicken sandwiches, and seafood can be found on the menu, among other things. My waiter, Katsuko, had an amazing personality so energetic that it was infectious! She also served me very promptly, and was just all-around amazing! The food, for a lunch menu, was pretty creative. The chicken sandwich was topped with red pepper aioli (which, just so you know, is not really spicy at all) and had swiss cheese, I think. It was great! It's the perfect place to go after a shopping spree downtown.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-29", "description": "Love this place but they mail-it-in on some of their cocktails.  Their Old Fashioned, for example, misses the mark: they serve it in an oversized bulb-shaped glass with nearly-crushed ice and a splash of soda water.  Net result isn't very enjoyable.  Their choice of ice melts too fast and adds to the already watered-down experience.  The oversized glass tries to make up for the experience, I suppose.  Back to lab, gentlemen.", "author": "Anonymous S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-07", "description": "This is OLD SCHOOL San Francisco. Clientele is mix of traveling businessmen and old SF dudes in suits. I came here for the first time when my parents came to visit me from Philly and stayed in the Palace. This is the kind of place my parents love, which does not mean that I don't like it, but rather that it's not my \"go to\" spot. The drinks are really good and priced that way. This is not where the nouveau riche hang out, this is where I imagine the descendents of oil tycoons come. Ladies, this is a dry cleaners-- you can come here to pick up a suit. In general I'll be with my bearded plaid shirt wearing husband over at House of Shields, but I'll happily head back here the next time there's a reason.", "author": "Kathryn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-03", "description": "Nice old Bar, I mean historic old. Best cream of mushroom soup EVER! I had it as a meal after trying it. Great single malt selection very reasonably priced. Can't wait to come back.", "author": "Tre T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-23", "description": "As hotel bars go, this spot is pretty nice.  Good table service and a good selection.  Sure, you pay a premium for drinks, but sometimes it's nice to get away from the great unwashed.\nThe interior is large and airy.  There's nothing particularly cozy about this place.  I generally prefer bars in boutique hotels.  The sort of places that have like 4 tables.  All in all, Maxfield's PPB is a solid place in a great location.", "author": "Leif N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-11", "description": "Featuring a magnificent painting by Maxfield Parrish of the same name, the Pied Piper Bar is the perfect place for a quiet late night drink with someone special...a place of quiet, subtle sophistication where you can get away from the madness of it all.  \n\nThe painting itself is rather impressive and the sheer magnitude of the piece combined with the long redwood bar conspire to give this establishment a powerful, yet understated elegance not commonly found in the bars in San Francisco.\n\nMaxfield's would not be my choice during a first date as it's a little too dead and quiet, but would be a nice stop at some point in the evening if you desire somewhere calm to talk and get to know one another.  Just be sure to avoid the after work crowd.\n\nThe Pied Piper Bar is also one of my favorite places to take business associates in the daytime when you need a nice, quiet, and impressive place to talk business over cocktails.  The inspiring environment empowers you to talk and make that deal in an atmosphere that positively reeks of success.  \n\nExcellent well-prepared appetizers and impressive wine list with some unusual selections that you don't ordinarily see.  I prefer their bottle selections to those offered by the glass.  Prices are on the high side, but about what you'd expect for a place of this caliber. \n\nAs an added plus, the bar at the Four Seasons (another of my favorites) is within easy walking distance.\n\nIf you're looking for a hot, fun crowd with \"a see and be seen\" attitude, this is not the place.  For that, you need to go to XYZ at the W Hotel or equivalent.\n\nThe painting alone is worth the trip...highly recommended.", "author": "Roy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-05", "description": "Great drinks subpar service. We were staying at the hotel so we went straight to the bar after checking in to meet up with friends. The location is good because our friends were able to walk in from the Market side instead of having to go through the hotel.  Drinks are tasty and overpriced (but it is a hotel lobby bar). Agree with most of the reviews on here it's a one drink kind of place. More options are a walk away...", "author": "Lea G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-08", "description": "The first time i went here was for emergency booze before a wedding.  It was one of those ceremonies where i absolutely had to be intoxicated to survive (read:  bride and groom's little brothers would be performing acapella and barber shop).  Thank GOD for Maxfield's downstairs.  I would have had to go kill myself otherwise.\r\n\r\nLittle did i know, they have a fantastic lunch as well.  pan-seared salmon over risotto with truffled oil was well done and not overpriced in the least;  the chicken sandwich with fresh fruit and fries also looked so good that i was about to steal food from a pregnant woman!  \r\n\r\noverall, the ambiance is that of old-school pub... and it is still every bit as luxurious as it was meant to be!   Service was impeccable and just right.  Not to forget is the beautiful painting of the Pied Piper which hangs over the bar and sets the scene.", "author": "lulu p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-28", "description": "Beautiful bar. Nice wine selection. Lots of travelers. Incredible service. \n\nThis is the kind of place where you go after a long day of meetings and sit at the bar in your sexiest workwear and get picked up by a man traveling on business who will happily buy you a house in Marin and a condo in Paris in exchange for you sharing your conversation that evening.\n\nNo? Well, it's the kind of bar that makes you fantasize. :)\n\nThe wine is uber pricey. Know that going in, and limit yourself until that expense account shows up.", "author": "Monika M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-18", "description": "Swankissimo!  The food was okay but the martini was very dry and I could have bathed in it, size-wise.  Although using the word \"wise\" after having two of them is questionable.  The menu was restricted but my food was quite good, except for the Mrs. Pepperidge-esque dessert at the end.  At those prices, they should be spinning caramel threads from the derrieres of a chorus of angels. \nThe room is lovely; although glass ceilings give me that Dario Argento horror movie deja-vu feeling.  At any moment a beautiful designer-clad Italian B-movie actress could come crashing through...and then the dessert wouldn't matter much, would it?", "author": "Valentina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-15", "description": "My friend took me here for a pre-birthday lunch.  I've been to The Palace Hotel many times as a child - singing in the school choir for patrons in the Garden Court.  This was my first time to Maxfield's.\n\nThe decor was very warm and inviting.  Lots of wood paneling, comfy booth/chair combo tables, and just an overall cozy feeling.\n\nWe were served with our water, bread and butter right away.  We even ordered fairly quickly after that.  Our food took about 20 minutes to get to the table.  Why?   I don't know.  \n\nI had the chicken club sandwich.  Thick slices of seasoned chicken breast, apple wood bacon, cheese, and a red pepper aiole.  Add some seasoned fries to the mix - delicious.  But we had to ask two different servers before we got some ketchup...\n\nMy friend had their special, beef tenderloin.  It was fabulous, but my friend had ordered it well done.  There were still some pretty red spots that she was not comfortable with.  Luckily, her trusty friend, \"moi\" doesn't mind meat a little rare, so I stepped up.  Hey, what's a friend supposed to do?  I gave her some of my sandwich.  ;)\n\nOverall, I think the food was delicious - but I don't know what caused such a long delay.  One could say it's because the steak needed more time, but I've cooked beef tenderloin at home before - it doesn't take 20 minutes.  And certainly, for that amount of time it wouldn't have been as rare as it was.  Fine for me - but my friend was disappointed.", "author": "Denise M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-22", "description": "I can't think of another word except for \"nice\". You know, similarly to how you would describe the guy your best friend is dating when you can't really think of anything meaty to say. \"He's just...nice. Yeah, like that vase in the corner. Nice.\"\n\nI think the bar is a nice centerpiece to the hotel. The drinks were good, though pricey. The french fries were great though. You see, I'm classy like that. I get dressed up, put on some heels, take my man here for a pre-bday cocktail while staring up at a priceless painting of the Pied Piper....and we chow down on fries. \n\nFancy bathrooms, indeed. Best in the city. If the guy's only knew we ladies have our own little lounge in there...full length mirrors and a couch! \n\nIt was full of the \"convention crowd\"...aka, \"Suits with Badges\" and it was pretty loud, so we moved on fairly quickly. At least I can say I've been, but I don't need to go back.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "Did I just have my first power lunch?\n\nA co-worker and I met with some consultants to discuss a project we're working on and someone suggested going to Maxfield's.  It was kind of like stepping back in time, and I wish I had had the gumption to order a martini or three, but since I was the low man on the totem pole, I followed the lead of my lunching companions. \n\nThus following the lead, I had the kobe beef burger (one of three at the table) and was impressed with the choice.  Very juicy and tasty and I rather enjoyed the fries (truffle oil?).\n\nIt was cool to see through the glass doors into the kitchen and I loved that all the waitresses chirped at each other in Chinese!", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-12", "description": "I agree with Nish's comment regarding the ambiance or food quality so I just wanted to add:\n\nFor September, they are serving special luncheon (separate from the regular menu).  The entire menu consists of CORN.  Corn soup, appetizer, main course, and desert!  \n\nThe lobster corn soup was the best I've ever had!  Everything else was pretty good (lobster pasta, Thai prawn salad, and salmon sandwich), but the lobster corn soup, yum!  \n\nMy friends actually ordered the soup after mine was served and decided that they all have to order one (since I was too stingy to share with them).  \n\nThe soup is only available in September so it is limited time offer (or you will have to wait until next year :))", "author": "Gin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-02", "description": "This is one of my favorite bars in all of San Francisco! I stopped in for drinks with clients last week, they had never been there. It's always crowded but the atmosphere is cozy, service and drinks excellent and the Maxfield Parrish mural on the back bar makes it  a one of a kind experience.\nLocated in the Palace hotel, I would recommend this place to locals and tourists.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-15", "description": "Stayed at the Palace Hotel for CHEAP (thank you Hotwire!) over the weekend so we were able to be a little spendy at the hotel's famous bar (Esquire named the Pied Piper one of the top 7 bars in the world!). \n\nWe sat at the amazing giant redwood bar and ordered girly drinks. I started with either a white cosmo or french cosmo(?)- can't remember. Do remember that it was amazing! A mixture of mandarine vodka, a splash of cranberry, fresh squeezed lime, and some type of dried berries at the bottom of my martini glass. I could have drank 10. But I moved on to the Anjou pear martini which BF had started with and was prepared with pear infused vodka, a dash of vermouth, organic pear juice and had a slice of fresh anjou pear floating in it. It was light, refreshing, not too sweet but not too vodka-y and basically the perfect martini. \n\nBF got overly chatty with the bartender and we learned that the famous Pied Piper painting was recently appraised at around 5 million. Geez! Needless to say BF was super impressed and happily accepted a postcard of the painting from the bartender. It was at this point I could tell the martini's were beginning to take some serious hold on us- be warned, they are big guys! (And better be at $12 a pop.) And we still had to get through dinner with BF's mom at a nearby fancy pants restaurant, so I dragged us out of there while we were still on the up & up.\n\nIf in the neighborhood I would most certainly return to this classy joint for drinks and snacks. It would also be a great place to bring the folks visiting from out of town. A peek at the bar menu revealed raspberry brie wontons with devonshire creme as well as an heirloom tomato salad w/burratta cheese, sea salt and saba vinaigrette. YUM!!!", "author": "Callie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-01", "description": "I went here on a hot date. As we finished our first drinks (my Manhattan was excellent by the way, and I am picky) I felt like the date was going pretty well.  The server came over to refill the snackies and accidentally knocked my glass, which knocked the glass of Hot Date, and both glasses broke. \n\nBut this is not the moral of the story. It was a perfectly honest mistake, a fluke, could have happened to the best of us. Anyway, the server apologized profusely and insisted on bringing us two new drinks on the house. After the second Manhattan, the date was going very well indeed. Ah, fate.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-14", "description": "Went here after Kaboom... ask my way? I have NO idea. I was following my friends parents.\n\nThis is a lovely bar. I could see people entertaining clients, having a first date, and there was a wedding going on in the next room.\n\nLoses two stars for a very valid reason. For a place that's supposed to be classy, sophisticated, etc. Why or why were my feet STUCK to the floor? I literally could not move my feet because the floor was so sticky. \n\nGained a star for the cutie server with the adorable accent.  I am a sucker for an accent.", "author": "Nancy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-03", "description": "Stopped in on a Saturday night for drinks.  We both got a martini, they were good.....a bit pricey.  Really liked the feel of the bar and wouldn't mind going back for dinner in the future.", "author": "Heathet B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-24", "description": "if I could give the management a minus 1000 I would.  \n\nthey sold the painting which was the only reason for coming here, since the new management took over - they got rid of any staff that could mix a drink, could serve a table, or cook a meal. \n\n they switched out the kumumoto oysters for tasteless pacific oysters and didn't change the price -  and it took 45 minutes in a half full bar to get them.\n\nthe bartender admitted that they no longer carry many top shelf liquors, and couldn't mix a common drink (and one specific to san francisco)  I suspect because they fired the old staff and hired under qualified people so they could pay them less.\n\nI shudder to think what they've done to the $85 champagne brunch on sundays.\n\nthis place was a family tradition for us and they have destroyed it utterly along with a piece of san francisco history.\n\nit's not just sad, its stupid, and bad business.  why take a historical showplace like this and try to make it into a motel 6?  the bar is a dreary dark place now, utterly devoid of anything that would cause anyone to pay $15 for a drink.\n\nI won't go there again, and tell everyone I know to avoid it like the plague.\n\nSHAME ON THEM!!!", "author": "lucreze c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-24", "description": "I had drinks here early on a Friday night a few weeks ago.  I asked for a house merlot...they sold me a $17 glass of wine which I paid for & tipped 20% on.  However, I asked the bartender for my drink to give me the least expensive red wine they offer.  H served me a cabernet which cost $20. I was pissed. Then when I tried to pay he wouldn't accept one of my $20 bills because there was a tear in the corner of the bill & he said no bank would accept it that way.  I loved the atmosphere here but I wouldn't go back because of this bartender. Disappointing.", "author": "Camilla W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-24", "description": "So very sad about the selling of the Pied Piper painting....will never set foot in this place again.  To sell a piece of SF Culture and History can't be worth the money the Sheraton will receive.  There are ways to preserve a painting......especially since it's been there since 1909.  It was painted for that hotel...where else could it possibly hang?  It would have been wonderful if they announced the selling prior to taking it down so all of the Parrish fans could go toast to it!", "author": "Theresa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-02", "description": "A great lunch spot in a central location. Good service and a lovely ambience make for a good place to talk shop. Superb espresso.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-25", "description": "WASABI PEAS TO NIBBLE ON!  just for that, i'd go back again and again!\n\noh yah, and like half nelson w. said, nice bathrooms...", "author": "Suzanne A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-05", "description": "As a painter, this is a dream come true to have a cocktail in front of Maxfield Parrish painting. As if in those cafes in Bohemian period, the atmosphere is awesome. Good lightnings around the painting and music.\n\nit is a Classic.", "author": "Chacha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-29", "description": "I like the atmosphere, very old San Francisco.  But the $30 Kobe burger was not the best burger I have ever had.  I asked for it well done, and it came back a tad bloody! barf!!!...So I had to wait another 30 minutes for another burger...So we ended up being there for awhile!\nI gave it 4 stars, just because I liked the way it looked! ha ha ...", "author": "J R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-11", "description": "This is a fabulous place. Sure, the food is overpriced but so is almost everything in San Francisco, so you have to discount that and move on. Our service was stellar, above board. We popped in our first time ever yesterday when it was raining and was pleasantly surprised. The ambiance is beautiful, dark and relaxing. It was well attended. My wife got a tuna tar tar that she says was the best she has ever had. I got a chicken club sandwich which was perfect. The beer was average unfortunately. But the butterscotch cheesecake was simply delicious--the best I've ever had. You owe it to yourself to try this place at least once if you're in the area.", "author": "Ted C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-07", "description": "They took the painting out of the bar to sell at auction?  You have to be kidding me!!!!  Shame on the owners.  This is a great bar with a painting created by on of America's foremost painters.  This would be like Pac Bell park baseball, sorry, no baseballs, you have to use tennis balls, they are cheaper.  It looks like the Palace Hotel is owned by an Asian company.  Clearly they do not understand the CULTURAL IMPORTANCE of this landmark.  I wonder who came up with this bright idea?  Boycott the place until they figure it out.", "author": "craig u."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-23", "description": "This was definitely the worst restaurant I have ever been to in San Francisco. The quality of the food was horrible, Ordered a caesar salad, fries, fried calamari, and shepherd lamb pie and they were all bad. fried calamari was very oily, lettuce tasted like it was washed with soup, shepherd lamb pie had more fat pieces than actual meet.  the fries was okay but not good even but how much can you mess up fries!! I would not recommend this restaurant to anyone.", "author": "M H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-16", "description": "This restaurant is very good and has a very nice bar!  It can get very load and doesn't have much space. The service is good and overall it is a very good restaurant.", "author": "Matthew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-03", "description": "Pretty elegant watering hole for the after hours business class.  They have a good little appetizer spread and you can't beat the Palace Hotel setting.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-03", "description": "The bar is most famous for its heroically proportioned 1909 Maxfield Parrish painting of the same name. Tragically, the current management has seen fit to flank the painting with two big-screen tvs. No, you can't make this up. It's criminal.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-16", "description": "Each night when we got back to our hotel we went to Pied Piper for a drink before heading up the room. \n\nThe bar was a comfortable space and drinks were pretty strong and good. I had a lemondrop martini and it was good....but it was $16. Seriously? \n\nIt's just went with the rest of the hotel it expensive.", "author": "Amiee L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "A wonderful throwback to another era. It was named one of the 'Mad Men' bars and that is the atmosphere. Wood paneled, thick carpets, white tablecloths. It reminds me of when I was a child and dined in many similar restaurants.\nI highly recommend the Kobe Beef Burger. It is delicious made with artisan cheese and served on an incredible roll.\nThe fries are incredible and put one in mind of the Pommes Frite of Paris.\nThe martinis are legendary. Large and ice cold.\nThe servers are friendly and all have stories to tell.\nHighly recommended.", "author": "Kent P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-10", "description": "Splurge\n\nThe food is great but not for the price. However, you would expect it to be expensive because it IS inside a gorgeous hotel. I had the lamb which was cooked to perfection. I chose mac and cheese and mushrooms as my sides. My girlfriend had a caesar salad (12 bucks by the way....) which was good but nothing special. I'd arrived late and my friend had already ate. They didn't look all that happy with their food. They said the steaks were sub par and actually sent 1 back. The bill for 8 people was about 500 dollars.\n\nI don't think I would ever go back. There is a lot better food I could splurge on with 500 dollars.", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-08", "description": "My favorite watering hole since 1994. \r\n\r\nOne of the few places in the city where you can meet the most laid back of friends or sophisticated of clients, chat with safe strangers, peoplewatch, write, or share an assortment of food and drinks.\r\n\r\nCharming, charming place. Very old world men's club atmosphere.\r\n\r\nEvery now and then it's nice to have some lounge time without the smurf-colored drinks, attitude and wannabe urban dj music spewed over a bad sound system.", "author": "Tanya P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-03", "description": "A really classy San Francisco bar in a beautiful hotel that's worth visiting even if you live in San Francisco.  It's an institution.  Wood-paneled, dim lights, and that huge Pied Piper oil painting.  I ordered a glass of Neibaum-Coppola Sofia, which was pleasantly refreshing, and the heirloom tomato salad with burratta - that was my first time having burratta cheese, and it was absolutely delicious.  I'd go back for that.  \n\nAfter I finished my first drink, I decided to try one of their specialty cocktails, the Green Goddess.  It's made with oronoco rum, Hendrick's gin, cucumber, and other items ... well, I didn't like it.  I apologized to the server and asked if I could get another drink.  She brought me another glass of the Sofia, and didn't charge me for the Green Goddess at all.\n\nService was quick and very friendly.  They bring you a tray of munchies (wasabi peas, salted nuts, etc) but I'm not too fond of them in the first place, although other people may like them.", "author": "Asteridae A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-10", "description": "Maxfield's is a nice place for lunch with Old San Francisco charm nestled in the Palace Hotel.  Reservations are not necessary but highly advisable.\n\nThe waitstaff is very attentive and the Crab Salad, and Panini are highly recommended.  The Kobe Beef Burger is good - a bit over-rated garlic fries YUMMY!", "author": "Rich W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-25", "description": "Went here on Christmas Eve for a quick cocktail before braving the Westfield Mall again. Its becoming an annual tradition for my mom and I to stop in here for lunch and drinks during the Chistmas holidays! Tuna tartar was delicious, fresh and some of the best I've had. && of course- the drinks! Mom always gets the Mad Men Martini and my poison is the White Mandarin Cosmo. Mad Men Martini certainly has a kick!", "author": "Julia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-30", "description": "During the course of the adventure that was last evening, Mike and I were strolling down Polk street and happened to pass by the Russian Hill Bookstore.  A Maxfield Parrish book in the window caught my eye, and I mentioned that he was my favorite all-time artist.\n\nMike: Well then you must be at Maxfield's all the time!  I think it's even close to where you work.\n\nMe: What's Maxfield's??\n\nMike:  OK, let's go... \n\nWe hailed a cab and made our way to the Palace Hotel.  He didn't laugh at me (much) along the way, but admonished me gently for not knowing about this gem.  He also shared some of the hotel's history with me as we made our way back to the bar.\n\nWhen we got to the door, I was actually afraid to go in.  We must've stood in the doorway for at least 10 minutes, admiring and analyzing the miracle that is Maxfied Parrish's work from afar.  Mike finally convinced me it was OK to go in, and we grabbed a table toward the end of the bar so that we could sit and stare some more.\n\nThe server came and took our order, and brought our drinks pretty quickly.  He was a bit of a smart ass, but he was hot and had a sexy accent, plus...I WAS SITTING NEXT TO A MAXFIELD PARRISH PAINTING!!  Even having football on the tv couldn't diminish my joy at finding this place.\n\nNow I'll admit, I'm no art buff - but I happen to love Parrish for his treatment of light: the way he used color and light made his subjects seem to glow, and I've always been drawn to his work.  The Pied Piper is by no means my favorite of his works; he created so many other wonderful pieces that touch me: Ecstasy, Daybreak, Aquamarine, Morning, Reveries, Enchantment...the list goes on.  But this is the only one I've seen in person, and damn...it's exquisite.\n\nOh, but I think the drinks are expensive.  To know for sure, you'd have to ask Mike.", "author": "Madeleine K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-30", "description": "I've stayed at the Palace Hotel the past four weeks (I've visited the bar 1-2 times each week) and have been far from impressed. The two consistent male bartenders are mediocre at best. On multiple occasions I have had to repeatedly ask for a drink and have been given attitude after finally speaking up. They have limited beers on tap and are out of a few of the scotches listed on the menu. For the price and level of hotel, I would expect a lot more. House of Shields directly across the street is a much better bet for a drink at a better price. I would only recommend this place to someone if they are staying at the hotel and not looking to leave the building. This comes from someone who stays at Starwood hotels 100+ nights a year. Overall, save your time and money.", "author": "N V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-24", "description": "A gorgeous Maxfield Parrish mural and fabulous cocktails. Great bar bites, especially the fries with truffle aioli.", "author": "Brian F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-04", "description": "As I've reviewed before, I'm usually a fan of Maxfield's. However, last night was not stellar. The ceasar salad with steak was indeed tasty, but it went downhill from there.\n\nService was extremely slow and the dining room and bar had the smell of bleach and not so clean kitchen floors.... disappointing atmosphere. :-(", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-09", "description": "Fantastic old world charm, and the Charlie Chaplin cocktail (w/ absynthe) is remarkable.  The nibblies could use some updating/creativity.  A regular for after work gatherings!", "author": "Craig M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-17", "description": "Great service. This place has an old, classic, yesteryear vibe to it. Check out the ridiculous mosiac floor! Some hints to its class are the individual size Heinz ketchup bottles (which I'm sure my mom would've pursed if I took her here). We got the Kobe hamburger ($24), possibly the most extravagant burger I've ever had...but unfortunately not the best tasting, thought the beef quality was top notch. The coq du vin looked like a midget roast chicken but was actually quite a generous serving, and the breast meat was thoughtfully de-boned. The pumpkin soup is excellent as well: it was funny how a bowl of a few strands of tortilla was placed in front of me...\"what the hell is this?\" I thought, but then came the soup in a separate little pitcher that the waiter poured.\n\nFor my fellow average Joes: I recommend you indulge here at least once in your life.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-30", "description": "I've tried very hard to like this place.  After having many lunches there and a couple of dinners, I must say that this place thoroughly disappoints.  \n\nI would say that the food here reminds me of the Peppermill Restaurant food.  Peppermill was a food chain popular during the late 70s - early 80s.  The idea was (in my opinion), that folks would be so stoned on what ever that they wouldn't notice how bad the food was.  (The food was pretty bad.)\n\nThe most \"adventurous\" item on the lunch menu I've had was the halibut.  Absolutely no flavor.  A good enough portion of fish, but tasted like nothing and it was paired with cold asparagus.  My lunch companion and I could do nothing but comment on how bad the food was.  Oddly enough, the waitperson never asked us if we enjoyed our meal.  He just rushed by to take our order and drop off the check.  The buspersons or lesser waitstaff actually delivered our meal.\n\nI've had burgers and salads and other meals here and they have been equally as non-descript.  I'm sure they cater to the out of town visitor taste...but I'm sure out of towners have taste buds too.\n\nAmbience is good.  The food is not.  Defiinitely not worth the time or price.", "author": "Maggie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-20", "description": "OK, yes, this place is generally filled with tourists and old men, but something about the dark wood-paneled bar and classy cocktails in the Palace Hotel keep me coming back. The service isn't spectacular, but the drinks are good and strong. The food isn't gluten free, so I can't eat it, but it looks like standard bar food. Anyway, I like to go here for happy hour, when I'm downtown and don't feel like schlepping up to North Beach or FiDi or down to SOMA. Overall it's an A-OK place.", "author": "Deirdre P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-16", "description": "ZZzzzzzz....*snores*   Hmm...waited 45 min for an $18 burger that ended up being cold on the plate with no water/bread refills.  The burger was done medium rare like I asked and would have been good if it came out sooner.  Service was terrible and I would avoid this place like the plague unless you like feeling yourself age.  The only thing good about this place was the fancy wooden decor which made me feel like I was in a fancy restaurant.", "author": "B F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-20", "description": "We came here after a business meeting with some out of towners.  It was great.  Yes, it's pricey, but its in a nice hotel, has an awesome mural, and has great Bartenders.\n\nWe only got beer, so I don't know how the mixed drinks were but they looked like they were being made on the fairly strong side.\n\nDrop in for a quick beer to see what an expensive painting looks like, then move on to something more affordable unless you can expense it.", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-19", "description": "Stopped in to see the mural, but it was not there! Had a great time nonetheless. Absolutely stunning wood all around and a nice old school feel. Some people don't like the dark panels, but it's worth stopping in for a drink. Unbelievably, the drink prices were not outrageous!", "author": "Heather P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-16", "description": "Extraordinarily slow and inattentive service, mediocre food, venue is charming  but dated and does not come close to making up for the high prices.  Had a hamburger, which was okay.  Fries were nothing special, and garnishes were not as high quality as Denny's.  Ketchup, mustard and mayo were on the table in those sealed mini bottles they send with room service trays and were difficult to open.  Choose anywhere else. if the Garden Court in this hotel is open, definitively go there instead.", "author": "Pamela M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-15", "description": "Yum Yum,\n\nDefinitely the kind of place for business lunches, meals for richer relatives with its relaxing upscale ambiance, delicious food and upscale prices (reason for minus a star).\n\nI definitely wouldn't go to this place on my own dime but the food was good enough for my job to pay for :) For starters I had the chicken quesadillas and the calamari fries. The calamari fries were good but a little oily. I wasn't a big fan of the mushy texture but they are alright. The quesadillas were also good but no better than something you'd find at Chevy's. My entree was muy delicious though, Pan Seared Seabass with Polenta. Verrrry good. My coworker had a steak. She said it was juicy, tender and delicious. So good food if youre willing to pay the price. Nice Ambiance. Older, professional crowd. \n\nOh yeah, our waiter was a little absent minded but it wasn't a huge deal.", "author": "Kiristen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-08", "description": "Old SF charm. Its what I imagine bars would be like in the roaring 20's.\n\nExcept I'd have to come here in a rickshaw, and I wouldn't be the passenger, and I doubt I would have been let in.\n\nWell dressed locals and visitors made up most of the patrons, so picture it as I walk in with sandals, jeans, and a ratty sweatshirt at 9pm looking like I just got off my dishwashing shift in Chinatown. Kinda outta place. \n\nGood thing I was here with a fine Southern gentleman, so I guess I was deemed OK and allowed to stay.\n\nOh, and it was expensive here too, so my returns will be limited. That and my rickshaw's in the shop.", "author": "Rocky K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "Great for cocktails and the truffle fries are to die for. The Palace is very glamorous and drinking here makes you feel a little like you're in a scene from Mad Men.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-07", "description": "So one of the big deals here is that the Palace makes it virtually impossible to get or leave information about the steak house \"Maxfields,\" as distinguished from the Pied Piper Bar, which sits in front of Maxfields.\n\nMaybe it's a clever plot.  Maybe it's because the management of the Palace couldn't find a cat in a paper sack.  \n\nPied Piper -- historically, good drinks, bland white crowd, good service. Tonight, no good drinks, no good service, but check on bland white crowd.  Drunk and loud.\n\nMaxfields - Historically, one of the hidden gems of SF (though with a hefty price tag).  I am not a steak house fan, but been there say 4 times in the last 4 years (though not in the last year), and DAMN is that a good restaurant, with amazing service.  And if you like old, wood, stained glass rooms -- just go there.  But tonight, despite an advance call to verify availabilty, it was closed for a private party.  The confusion may be due to the Palace's inability to distinguish between bar and restaurant -- but they need to get over that.  Or explain it. \n\nAnd then $48 for valet.   Yes, $48.  Seriously, $48. Even after 6 p.m.  Even if you park there because they told you the restaurant was open when it wasn't.   $48. I could park in St. Mary's and take 7 of my closest friends for awesome Pho, and just barely reach $48, including parking.  And the Pho place would have been open.\n\nJust saying.", "author": "Laura T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-20", "description": "Friend wanted to go for happy hour ...didnt even know this place existed and must have walked past the hotel 100 times. \nIt was pretty packed for happy hour (on a wed night) but the crowd seemed like it belonged at the Star Alliance Club in O'Hare International...good thing the bartender knew the meaning of generous drinks to make me forget - read buzzed after 2 drinks (what normally takes me 5)\nSnacks were plentiful and kept getting refilled. Seems like a great date place, casual but elegant.", "author": "Ido S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-25", "description": "What's the Pied Piper Bar without the Pied Piper? Please bring back the 1909 Parrish painting that was commissioned for this space.", "author": "Katherine P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-20", "description": "Great old world bar off Market in the heart of the city. Perfect for having an after work scotch or ask for a Mad Men Martini. The food is good and not overpriced as you'd find in a hotel. The service doesn't quite match the upscale-ness of the venue but it's acceptable. If you want to sit in the path of interesting business people this is the place.", "author": "Melonie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-08", "description": "1 Star Rating only because Maxfields is STILL CLOSED for the entire month of May! When are they going to reopen???? I've been waiting since March to eat here again!", "author": "Julie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-26", "description": "Good drinks, good basic food, friendly service. Mucho expensivo.  \nAlthough inhabited by suits, the atmosphere is congenial and surprisingly low key.", "author": "GS M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-01", "description": "Stopped in briefly on a busy night to recharge and take a load off... Great service even when it's busy and the atmosphere is low-key relaxing, yet very classy.  I like this place each time I come in even though some people feel it's a bit touristy.  I think it's a good combination of locals and out of town folks.  Always a great stop!", "author": "Jane D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-26", "description": "Horrible food and service.  It was a really good restaurant before and now the food and services has completely gone down hill.  I would never go there again.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-16", "description": "The bartender thought I was from out of town.  \"Have you had Anchor Steam?\"  Yeah, and Liberty Ale and Old Potrero Rye and once that seasonal christmas stuff which I didn't like too much.  Then he one ups me and taps the bartop with the edge of a gin bottle, lable pointed at me saying Junipero Gin.  Okay, cool.\n\nThe Pied Piper Golden Ale was tasty.  A 2.5 million dollar Max Parish mural dominated the view, and I ate some of the best chicken wings ever while thinking about whether Twain ever sat in this same seat.\n\nIf your suit has been sitting in the bag for too many months, bust it out, buy a new tie, sit down at this place and feel like an old school gent, hundred percent class.  Plus, they have a great looking bar menu.\n\nIt only gets four cause I haven't seen delved into there whiskey selecton yet.  Hopefully, the next time, I'll find a gem.", "author": "Ashby U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-30", "description": "I've been a semi-regular at Maxfield's Pied Piper Bar since I worked downtown in the 1980's.  Drinks and food are good, although the food selection is a little limited and some of the wines by the glass are expensive.  I love the room though; it's dependable and a comfortable place to hang out.  It has a great history, and I could stare at the Maxfield Parrish over the bar for hours.  Since the original Redwood Room is gone, this is one of the remaining classic hotel bars downtown.", "author": "Kim M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-11", "description": "I went there with my family. We were seated promptly. Most of the food  was excellent!  I ordered a NY steak and it came out perfect.  The calamari appetizer was not so great... it was very fishy and had a strong odor. Needless to say we didn't  eat it.    I would go back, but would stick with the steak.  The atmosphere is more like a loud bar than a restaurant, so keep that in mind.", "author": "Samantha V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-04", "description": "I love the ambiance!! But the drinks are just average quality for the price you pay. So I wouldn't go out of my way to come to this bar but I think it's a nice spot if you're staying at the hotel or if you're in the area.", "author": "Jenn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-01", "description": "Elegant, classy, sophisticated. This would be a perfect place to bring mom and dad for a scotch. Good free kibble while you drink but their calamari was pretty awful (overwhelmingly greasy). If you don't mind expensive drinks, go here for the classy ambiance, it's a find.", "author": "margot b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-05", "description": "Nice place for drinks while shutting out homeless people and busy traffic outside. A bit stuffy but quiet atmosphere. Drinks are solid and desserts are decent. Good place to hit up with important people.", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-14", "description": "Very sophisticated atmosphere for the financial crowd. Moshe, our sweet bartender, served up one deliciously potent apple martini. After that, both my friend and I were so buzzed that we couldn't even finish our second cocktail. Thanks Moshe!!", "author": "Connie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-18", "description": "I have been eating at Pied Piper for years.   The staff, especially Joel at the bar, is terrific. However I will no longer be eating at PP because of their decision to change the bar menu. Gone is the incredible Kobe burger, enter the totally unappealing Organic burger. Throw in a WAY overpriced Organic Chicken Pasta, and you've just encouraged me to try someplace else. Improve the menu, and stop gouging your customers!", "author": "Matt I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-27", "description": "Gorgeously, deliciously, superb bar.  I experienced some serious deja-vu here, I thought, am I in \"The Shining\"?  This establishment screams of a bygone era when everything and everyone was gilt and glam.  It's just so amazing it makes me wanna get naked and roll around on top of the bar.  Yeah, it's that sexy.  And magical.  Maybe it's all that Parrish blue but yowzas, I would have followed that guy with the flute, too!  One of the few places where the drinks really are on par with the ambiance.  Oh thank heaven for Maxfield's Bar!", "author": "MJ P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-10", "description": "I haven't found a bar downtown that I really love.  This place was expensive, for sure, but the drinks were delicious.  The waitstaff was really gracious, but I thought it was funny that our server asked us where we were visiting from.  When I said, Oakland, he genuinely seemed surprised.  Oh well.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-25", "description": "I have only ben to the bar.  What can I say-it is a great and WELL MAINTAINED old bar in excellent shape with an original Maxfield Parrish mural!!!  Don't forget to check out the old photos lining the bar and also look at the historic cases of Palace Hotel memorabilia all down the hallway outside the bar.   NOTE: this is NOT a dive bar.  Have fun- dress up a little or a lot!    Enjoy.", "author": "BRUCE S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-05", "description": "My friend Suzanne and I fled here after a horrific experience trying to celebrate Bastille day down on Belden Place--too much great hair, strong cologne, warm champagne, and bad attitude.  This restored our faith in so-phis-to-cated drinking. I love sitting up at the big long bar, staring at Maxfield Parrish's vaguely creepy Pied Piper mural.  Nibble some nuts, sip your drink, and for an hour or so you feel like you finally got to sit at the grownups' table.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-05", "description": "I love this place. It has a classy ambiance without being overbearingly stuffy. The drinks are not reasonably priced... but walking through the Palace and staring at that lovely mural over the bar makes it all worth it. It is a great place to grab a drink and catch up with a good friend or two.", "author": "Rada I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-04", "description": "Great Gimlets and happy hour snacks. A great place to shake off the work day. :)", "author": "Audrey Jean T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-05", "description": "I probably especially like this bar because it was the place my mom, my maid of honor, and I chose the celebrate the purchase of my georgous wedding gown, but we have returned many times since!  My two favorite things: 1. the giant, beautiful Maxfield Parish painting behind the bar depicting the 'Pied Piper'.  2. Thier exclusive Pied Piper IPA, and probably the best reason to drop by if your a beer fan.  It is seriously good, highly alcoholic, and this is the only place on earth you can try this beer.", "author": "Gabrielle P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-16", "description": "really nice bar in a really nice hotel. came here with a friend to meet her fam for drinks. great service. the second we sat down at the table a waitress was already there to take our order. not sure how much the drinks were but i wouldn't be surprised if they weren't cheap. the ambiance is very elegant and has an old school feel. not somewhere i would go all the time, but if you're in the area it would be worth it to check it out.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-30", "description": "In the spirit of full disclosure, I have a thing for hotel bars. \n\nIt started when I was five. My dad took me into the Hyatt Regency at One Embarcadero and bought me a virgin strawberry daiquiri and we tossed pennies into the big glassy fountain and I jumped on the plush couches and danced around by myself to the music being played by the nice man on the grand piano. Every time we came to San Francisco, I would insist on a trip to the Hyatt. \n\nI have since turned in the virgin daiquiris for gin martinis and I don't jump on the furniture anymore. But stick me in a hotel bar with a piano playing and give me a chilled Hendrick's martini and I am in heaven. \n\nThe only thing Maxfield's lacks is the piano. But they have an excellent selection gin and every other liquor known to man, including an impressive array of single malt scotches and small batch bourbons. Their by-the-glass wine list is also a roll call of the best wineries in California and around the world. \n\nThe joint is all class. I would guess that all the original fixtures are in place from the bar's inception in 1909 when the hotel was rebuilt from the ground up after the 1906 quake. The floor is delicate honeycomb tile, the bar is solid carved wood, the walls are of gorgeous, warm wood paneling, the barstools and seats are covered in soft leather, the room is brightly lit by two huge chandeliers and on the wall behind the bar is a gianormous Maxfield Parish painting, The Pied Piper. \n\nThe service is friendly and there is a happy hour buffet on Friday evenings. It is a great post-work destination after a long week. Or a long Wednesday, perhaps.", "author": "Sage R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-19", "description": "It's an upscale, classy bar in the Palace Hotel.  You will feel rich lounging around sipping a Remy, but you will assuredly leave poor after you are served the bill for their overpriced drinks.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-10", "description": "This bar is an excellent old school deep wood panelled spot to dip into. An oasis from the crazy overkill of Market Street. The Chicken wings are scrum, and they have a good wine selection. Also, I love the Mural behind the bar.", "author": "rachael s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-11", "description": "I don't think I'll be paying $21 for a Caesar salad on my own dime anytime soon, but luckily I have a nice uncle who works down the street from me and was willing to take me out to lunch at Maxfield's. This place seemed very stuffy and buttoned down at first, but I actually really liked the ambiance - very sophisticated and upscale. My Thai shrimp Caesar salad was delicious and I felt very posh and grown-up eating here. I'd definitely come back - but only if someone else was footing the bill. Too bad I don't have more altruistic family members!", "author": "Lindsey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-19", "description": "Nice, solid, wood-paneled establishment that's classy but friendly.  They have a limited beer selection and a few veggie options on the menu.  Try the cocktail and martini specials!  I recommend the basket of french fries with sea salt and truffle aioli.  Be sure to visit the spacious and lovely marble bathrooms on your way out.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-25", "description": "The service wasn't the best that I have received. The meals were ok, large portions. I wouldn't return.", "author": "Robyn G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-31", "description": "This place can be 1 star or 5 stars depending what you expect from a bar.  But regardless, the service is 5 stars; the cocktails are 5 stars. It's not too loud that I can still hold a conversation with my friends.  I like-I like.", "author": "N. C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-02", "description": "It's a great place for a couple of beers sat at the bar but I can't recommend it for dining.  In a party of three as a walk-in looking to grab some food. It's primarily a bar however their menu is posted at the entrance and they encourage evening dining.  Food was certainly acceptable for the price and the choice was good.  Unfortunately the service was absolutely terrible.  After sitting down we couldn't catch anyone's attention and eventually picked-up menus from the service area.  After a while we caught the eye of a waiter who came and took our drinks order, with apologies for the wait.  Food took a long time to appear however we were asked if we wanted more drinks, which we ordered but then didn't appear until the server came back to tell us our food was nearly ready (15 mins after checking for drinks).  Food was good however by the time we got it we could have done with further drinks but no-one checked-in with us and we couldn't catch anyone by eye.  We finished our single course 90 mins after we'd arrived and decided to call for the check (had to call another waiter as ours was nowhere to be seen) rather than think about desserts.  Discussed issues with the manager upon leaving who was wholly apologetic, however by then the disappointment was beyond fixing.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-06", "description": "Decent lunch spot.  Good food, quiet, not too outrageously priced.  Service was a little sketchy.  Waitress looked like she had just snorted some coke in the bathroom...and she didn't even offer to share!  Beware if you're in a rush - they won't bring you your check unless you ask.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-20", "description": "Meeting a friend for a cocktail and I was looking for something close to the office...did a search and found this place.  From the pictures, I thought it was going to be low-key, but upon arriving at the Palace Hotel, this place was anything but low-key.  We got lucky and found 2 seats at the end of the bar. The bartenders poured a mean drink and after 2 a piece, we were done! Great place and a good pour equals a good time had by all!", "author": "Valarie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-11", "description": "Had a business lunch here the other day and, I must say, it's pretty swanky.  The interior is lovely with the wood paneling on the walls and the stained glass ceilings.  The place totally looks like the kind of place where business deals are constantly being closed.  I felt a little out of place there.  The service was excellent, but my food was good too.  I had the crab cake salad.  The idea of that alone is interesting.  I probably wouldn't go here on my own, but with an expense account, I'm totally there!", "author": "Kris L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-18", "description": "Be prepared to be assaulted by your tab. The place is upscale swanky cozy and you might let your guard down and have a second round of drinks, but proceed only if  you are on a company tab or celebrating a windfall. Ok Ok -it's classy and our service was great,  but for most occasions, it's best to get in and get out so no one gets hurt. We lucked out and snagged three seats at the bar upon our arrival- so it's definitely worth a try even when super packed...", "author": "Amy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-08", "description": "A great place to share an after work martini with old school San Franciscan professionals.", "author": "Philip M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-19", "description": "I've loved going there for years, but the other night we were charged $18 for a glass of mediocre table wine and $14 for a watery martini. Outrageous gouging.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-20", "description": "(Pied Piper Bar) Pretty place ... actually looks quite impressive.  Good place for drinks and conversation.  Not overpriced, so its a great deal for that level of ambiance.", "author": "J P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-24", "description": "Great atmosphere...great drinks (5 stars)....very bad food (-3 stars).  Stick to the quick and simple bar food, if you're hungry.  Stay away from any seafood.  The crabcakes ($12) smelled like old sardines and had the texture of a sponge.  I would have sent the plate back, but I had already returned the half dozen \"fresh\" oysters that consisted of four bad and two dried fellas that were only parially shucked.  I hate to bad mouth this bar and hotel, but the quality of the food and prices associated are an insult to the history and charm of this landmark hotel.", "author": "Jeff A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-30", "description": "Not sure what the big deal is here, but then, I'm the kind of guy who prefers to save the expense of a bar and just get drunk at a friend's house. It's a nice space, but doesn't live up to that \"Seven Greatest\" nonsense you'll hear about. If it's the art you like, for heaven's sake go to a museum not a bar! If you are staying at the hotel though, it is convenient to have a nice place like this to gather for drinks. Or better yet, order the drinks from room service to the grand lobby/Garden Court. (I didn't eat at the Pied Piper so no food review.)", "author": "Teddy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-05", "description": "This place can be the bomb depending on what you're looking for. Sometimes, nothing beats an old world dark wood bar with some history. Was with a quasi-gf and we weren't dressed fancy. Just wanted to get a well made cocktail and a bite. They treated us just fine. Her mudslide was prepared to perfection as well as my extra dry, extra cold martini. We split a salad and sandwich and probably got 2 regular size salads. Nothing fancy, but well prepared and very tasty. All things considered, the price was actually quite reasonable.", "author": "fred t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-22", "description": "Funny that the House of Shields was once considered the \"official\" Palace Hotel bar and now the \"official\" is Maxfield's Pied Piper. I found them remarkably similar. Enjoyed a beer with a colleague at the Pied Piper just before Christmas. Bar snacks were a nice treat. Even more treat-y, the house brewed beer on draft among other staples Anchor Steam and Guinness, opt for the special!", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-29", "description": "Had a great (and surpeisingly affordable) dinner here on NYE. First of all, I have been several times to the bar only and am simply in love with the fish bowl they call a martini...hello lover. Now, I can say without hestitation you definitely get a lot for your money in the restuarant too. Each entree comes with two fairly large sides (not a la carte either), and my rack of lamb was ridiculously large. Great for an elegant date night, plus any place that serves gourmet mac n cheese is a place worth checkin out...", "author": "Jess W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-13", "description": "I like this bar after work to just chilll. No attitude, no sorority girls, no children. Just one drink.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-22", "description": "Ah, my secret little oasis of old-school swank: low-key but elegant surroundings, fantastic martinis, a fine selection of single-malt scotches, and a genuine Maxfield Parrish painting presiding over it all, so gorgeous you could weep. Having a drink at Maxfield's is the ultimate in adult entertainment, and I don't mean the naked kind. This is the kind of experience I dreamed of at 12 when I imagined being \"grown up.\" Ring-a-ding-ding!", "author": "Fawn F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-19", "description": "Very nice classy bar with some of the best service I've had in a long time.  Also worth mentioning is the food, even just the bar food is very high quality - I recommend the smoked chicken quesadilla.", "author": "George K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-31", "description": "Kobe Burger (medium rare) was awesome, and the fries that came with it was even awesomer.  Server wasn't all that.  Got to go back and try out the old school bar soon.", "author": "Derek C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-28", "description": "Great Bar in a Grand Hotel and the food is very good as well. The Bar is very \"old school\" rich in history with a great attentive staff to ensure your experience is pleasant.", "author": "francis A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-05", "description": "My roommate had a book club discussion meet up here this past Friday. I arrived about 30 minutes later than everyone else due to some A's game traffic. The space was great and we even had a whole table in the back to ourselves, which made it easy to hear everyone, which consisted of 9 people at a long rectangular table. I got a Lychee Martini which was good, but was also 12 dollars; I'm not sure it was $12 good. I forgot to ask for some water, and never got any automatically. Near the end of our discussion just about everyone's water glass was empty. Empty! One of the people in our group went over and got the water pitcher. It's self service here for the water I guess. The waiter came with more water a few minutes later. A little late homey. So drinks for 9 people, maybe 1 or 2 people had a second drink and someone had some soup. Check, over $200. Hrm. Summary: Nice place, but you'll definitely pay for it.", "author": "Ken L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-25", "description": "I hate to be the bearer of less than a steller review, especially after I recommended this bar to out of town friends. We went there for after dinner drinks and had to wait more than 15 minutes before someone took our order. We requested Irish coffees and they were absolutely terrible. Our friends had been to Buena Vista earlier and raved about their Irish Coffee's.  In the past I have ordered martinis at Maxfield and been very happy. A SF bar should know how to make the classic drinks especially a place like Maxfields.", "author": "Bob Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-14", "description": "Great service, pretty expensive for mediocre food (at least for what I ordered.)  Went there for a team dinner, this time our boss was there, so we didn't really go ALL OUT!  That night, we were all pretty drained so everyone just want their entree without any appetizers.  I ordered the Jumbo Lump Crab Cake & Petit Fillet.  OMG the crab cake was soooo seafoody sweet!  One of the best crab cake I ever tasted!  The petit fillet was overcooked especially I ordered medium rare... it was medium well.  Not really liking the steak.  Entree came with 2 sides and I picked the smashed fingerling potatoes & sauteed white & green asparagus.  Sides were tasty, and I just love asparagus....  Pretty filling for an entree, but hey, it IS almost 40 bucks for that!  Anyway, after the entree, we all just want to go home without dessert... super drained... that might've influenced my perspective on my dining experience at Maxfield's...", "author": "Gigi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-14", "description": "There's nothing like retiring to The Palace for a cocktail and nosh after a long day at the office or a non-profit board meeting. Though I absolutely love the bar and lounge staff, they are often shorthanded during the afternoon rush. I would yank out the TVs since they cheapen the ambience, but still a favorite. And the Maxfield Parrish mural is lovely. I also recommend visiting another MP mural at it's fancier sister, The King Cole Bar at the St. Regis in NY.", "author": "John B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-04", "description": "went there for happy hour with some friends...totally historic bar...way tooo stuffy for me..but customer service for me was great...altho not so much for one of my friends as she kept on getting the wrong drink, would I go here again?..hmmm..only if i had no choice, then okay, however on my own, definitely i'd pick another venue...oh btw....they didn't hold back on my cocktail so the drink is definitely worth the price you pay for here.", "author": "Syonora A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-12", "description": "The steak was good here. The crab soup was also good. However, there was an issue with a mouse scrurrying around the restaurant. No joke. Management didn't apologize, but noted, \"It's because of the close vicinity of Mission Street.\" My dinner companion and I stopped eating. Stay away/", "author": "Olivia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-18", "description": "Went there during lunch break and had the Kobe Beef Burger.  Considering the price, I had high expectations for the burger.  The burger was topped with short ribs, bacon, artisan cheese and sauteed mushrooms.  Easily one of the most tender burgers I've ever had, but it wasn't the \"BEST\" burger.  I'm not sure if this makes sense, but the burger tasted too clean.  I'm use to burgers being gritty.  The fries on the other hand were amazing.  They were cooked / covered with truffle oil which made them ridiculously good.", "author": "Alon D."}
