{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Great place, great service. The atmosphere and the patrons make me feel like it is my home away from home. Johnnie, mike, Tommy and Micky (the Irish lad) fo a great job.. keep it up.", "author": "Anthony H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-27", "description": "Wow, my favorite bartender is gone. The music can be heard down the street and no one knows their beers like my favorite who is no longer there. Can't believe this place is no longer what it was, sad!", "author": "Megan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "Love the atmosphere of this bar. It's nice and divey, and has a great patio area which is one of the more spacious patios in the city equipped with overhead \"roofs\" for those rainy days. The beers/drinks are all reasonably priced. Not the strongest I've had in the city, but always to the mediocre expectations of what I expect at a bar. \nI'm still very puzzled at the whole \"inn\" part of their name. Is there a hotel connected to this place that I'm not seeing?!\nOh and also, it's a cool place to catch a game with their nice sized televisions. Perfect for those weekly games if everywhere else that you go to is busy. Thank you Pilsner Inn!", "author": "Nick A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "This was my local go-to bar when I lived in the Castro. As a straight woman, I never felt out of place and the bartenders still recognize me (and remember which drink I always ordered) even though I have been gone a year.\n\nIt's a pretty large (and popular) bar. They have a big patio out back with lots of seats and nice plants. It's popular with smokers. They have a pool table and some great pinball machines, and a great jukebox.\n\nBecause it can get crowded, keep an eye out for the 2 places at the bar where you order drinks - there's an obvious service area (with no bar stools), and usually a very orderly line. Drinks are strong and cheap.", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "Why would I expect to get service sitting at the bar for over 20 minutes by some hateful person who obviously doesn't like their job or tips.  There's no reason to snarl at people or slam glasses down once they place their order", "author": "Jamie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "This bar backyard is bar backyard that all bars backyards wish they were :)  Drink specials are fantastic - I had a great $4 IPA.  The PRIDE IPA is also fantastic, but they only have it for a limited time - hurry in and try!", "author": "Emma H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "I stopped into the Pilsner for happy hour with friends. Loved the beer and back patio but what made the evening was Michael the bartender. He knew most of his punters, has a fun personality, great service with an irish accent to boot. Had such a fun evening.", "author": "Catriona M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-11", "description": "I have lived a few doors down this bar for 4 years and have been a few times here with my friends and my dog; I used to like it because their drinks are fine, and bar's atmosphere is very laid-back. \nThat was until the last time I attempted to get in, and I was stopped by the bartender because apparently, dogs are not allowed; once I said that's weird because I have brought my dog here before, and they heard my accent, they were so nice to explain everything to me about hygiene rulings that apply to such establishments. Instead of apologizing for their own inconsistency, they pretty much kicked me out. Needless to say I will never come back - there are plenty of bars in the neighborhood who have a much friendlier attitude (and drinks, to be fair).", "author": "Eirini P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-23", "description": "I came here during the week leading up to Pride with a friend. They were hosting some political event where members of the Harvey Milk LGBT Democratic Party collaborated with the bar and this outside vendor that sold pulled pork. We originally came here for the pulled pork but it was expensive AF. Almost $15 just for a sandwich? I'll just go somewhere else and get something half of that, lol.\n\nAnyway, I ordered a Blue Moon and it was good enough to last me over an hour since my friend and I just talked and introduced to his friends. There were also some San Francisco political figures that stopped by which was pretty cool.\n\nThere's an outdoor seating outside but people were smoking so we decided not to stay there for too long.", "author": "Aj C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-18", "description": "Tried to get the Chimay here on Tuesday... keg had just run dry. Here on Friday, ordered a Chimay, keg is dry. Not accusing, but, like, do they actually have it here? Tuesday was 11/14, tonight was 11/17, did anyone have the Chimay here between those dates?", "author": "Nick R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-13", "description": "After visiting Aardvark Books next door I had some time to kill so I cruised in here to grab a pint and read some of my books. I guess technically it's a \"gay\" bar but on a slow Saturday afternoon it was just a chill sports bar. Some games were on the TV and a few people were shooting pool. I was pleasantly surprised to see a pretty good craft selection on draft. I got the \"Wilhelm Scream\", a seasonal pumpkin beer from Magic Hat Brewing Company and settled into a sunny front corner to read. I didn't check out the patio but that looked very pleasant as well. All in all a lovely hour or so was spent enjoying a beer and book. The bartender was very nice as well.\n\nSTEPH JUDGEMENT: Great casual and welcoming place to get some drinks on.", "author": "Steph H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Fun bar to have a drink with friends.  The outdoor area is nice for socializing and smoking.", "author": "Dennis W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "This is one of the best bars around town. Friendly staff, a large selection of beers (with nightly specials), pinball machines (including my personal favorite: theatre of magic), and an amazing back patio with plenty of seating (as well as standing tables). This is a comfortable place to come have a beer, play pool or pinball and have a smoke on the patio. I love this place and will continue to be a loyal patron.", "author": "Alex E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-05", "description": "One of my preferred places to hang out in this neighborhood, if only because it's never too crowded here. As such, you can always get a drink quickly from the bar. There's also lots of room both inside and in the rear outdoors patio to spread out and have some real conversation with friends without having to yell in each others' ears. The ambience is also airy and accessible enough so as to avoid sketchy-dive-bar status.\n\nA solid bet if everything else in the neighborhood is jam-packed.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-25", "description": "Went in to this place last month and again last night. It's one of the closest bars to my new place. The bar's nice and they've got a good selection of beers, a patio out back, and pool and pinball -- but the douche at the counter is unreal.\n\nLooks like the guy from TVs Cash Cab but this is a lower class knockoff type. \nTrash Scab seems about right. \n\nRude, obnoxious and obviously doesn't want to be in a customer service position. (hello! craigslist.org has jobs ads.) He yelled at me for not ordering in the right place (Silly me, thought the bar was the right place to order, but apparently at this place it's only two feet of the bar). Long and short of it is I've been there twice now. Fool me three times, uh, no. Won't be back", "author": "Theo S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-30", "description": "Great patio, nice guys, fun pool table, pinball machines, arcade games.\n\nThey've got a bathroom that locks, too, which I love.\n\nSome rude-ass bartender last night. Bald maybe? Some friends were telling me he'd taken a testy tone with them for no reason, and I initially didn't believe them until I was standing and waiting for a drink.\n\nHe pointed really obviously, like I was riding the short bus. \"To get a drink, you have to go OVER THERE. Geez, I thought you people would have figured that out by now.\"\n\nI'm sorry, no. If you don't like people in bars, don't work in one. Happy New Years to you, too. Hope your manager sees this.", "author": "David S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-12", "description": "I walked into this place with a prosthetic arm and a service dog and was immediately told to leave. The bartender Al went on to ask me what my disability was, what she does for me and proof.  Two out of three questions he asked wrong with a obvious disability will only lead to a full on inquiry because of people like me don't stand up for others with disabilities like myself the the rest of us get repressed and looked down on for who we are.", "author": "Brad B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-18", "description": "Go for the chill outdoor patio where you can enjoy a cold brew, just know that ciggy smokers are welcome here. \n\nGo for the well used pool table, antique looking photo booth and all business bartender. \n\nGo for the ($6!) Tanqueray G&T: it was all gin and almost no tonic! Well, they like to keep it STIFF in the Castro!", "author": "Janice C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-23", "description": "First time there after having it recommended by a friend. Horrible experience. Rude patrons and then the staff was even worse. We got treated like absolute trash. With so many great bars in the area, definitely will not be returning.", "author": "Emily J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-28", "description": "I love the back patio, but I have never had a good experience with the staff. Today a staff member yelled at me when I called looking for my lost wallet. I called once and he said they didn't have it, when I called again to explain it was a gold cigarette case not a standard wallet he got angry. \"You called already! I said we don't have it! You asked and I looked and we don't have it!\" \n\nI know it's a frustrating job, and they must get similar calls all the time, but just a little hospitality wouldn't be a bad thing. Even just listening to what I was saying would have been preferable to being cut off. It's really sad, because this was one of the neighborhood go-to's for a lot of my friends, but after hearing their stories and now this none of us will be going back. Don't want to drink at a place where you feel antagonized by the staff.", "author": "Danielle D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-26", "description": "The place was big, open and decent when we walked in. The bartender not knowledgeable at all. Asking about stouts he had no clue. Looking at the tap handles I said ill take that stout. He seemed confused and possibly drunk? He was very out of it. The pricing here is high for beers, however, it is better than a dive bar. :) The older patrons were pretty rude and did not mind taking up excessive space. This was definitely a decent place. The back patio seemed very fun, however, it was just viewing. We were not out there to enjoy a drink. Overall a decent place with beers and some pinball. By the way, please clean the pond out back. The water is WAY too cloudy and murky. That is not good for the koi. :)", "author": "Big D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "The Pilsner Inn deserves great respect for being a place that welcomes all scenes. (Since the Lex closed, it's been popular with women on Friday and Saturday evenings, but truly everyone is welcome and has a good time.) There is a vast selection of beers on tap and wonderful bartenders. I've enjoyed meeting tourists (both gay and straight) from all over the world who find their way to Pilsner Inn. Whether to give a fifth star has to do with the outdoor patio. People who still partake of tobacco would definitely award the fifth star. People who wish the patio had a non-smoking section probably would withhold it. The inside bar, of course, is smoke-free and inviting.", "author": "Ted C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-16", "description": "Is this even a gay bar anymore?  There used to be really awesome bartenders but not the case anymore... the barback seriously sat behind the bar chatting up some chick for over 20 minutes when I got here tonight.  Nobody offered to get me a drink even though I had cash out in my hand waiting.  \n\nThe crowd tonight is also the most annoying, obnoxious group I've seen in here ever.  Overly pretentious wannabe frat boy geeks and loud, screaming loud, chicks everywhere.  There were, of course, a few lesbians that we're hanging out and a couple of gays.  The rest, who knows... I gave it two stars in the hope that it will be the chill spot to drink, hang out, play pool or video games and have a few drinks.  I doubt it though, judging by the way this city is quickly becoming a douche haven.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "The Pilsner is a priceless gem in San Francisco. Everyone is welcome. The bartenders are friendly - especially Johnny. The drinks are strong. The regulars are welcoming. The penguin collection is priceless. Definitely one of my faves in the Castro.", "author": "Thomas M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-13", "description": "I have been along time fan. know a bartender or two. but the new extraordinarily loud music since about March is unbearable. even the bartender couldn't hear my order. not going back till they go back to a reasonable level for a neighborhood bar", "author": "Joey D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "I love the Pilsner.  Great drinks, great beer selection and great staff. Love the outside patio and the vibe.  One negative: It's it's too bright inside. They need to dial back the lights a bit to provide a little intimacy.", "author": "Christian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-26", "description": "No frills casual dive bar.\n\nThe service was friendly; the cider on tap was decent.", "author": "Geoffrey B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-25", "description": "Been going here for 10 years and just got kicked out for having a half can soda I didn't buy from them. You just lost a long time customer due to an a-hole bar tender (guy with a pony tail). Apparently smoking pot, bringing pets, and bringing in food is welcome, but not a half empty can of soda even though you are in the process of paying for a drink you already ordered and the bar tender poured. \n\nThere are a couple of great bar tenders here and then there are the few with power trips that ruin the whole place.", "author": "Angelito R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-03", "description": "Nice, quaint, neighborhood bar. It's a low key and very casual kind of place.  Came here with friends after our shift was over. Nice drinks with no attitude here.", "author": "Kenson K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-12", "description": "Nice size glass. Took the bartender all of 2 minutes to make. Tasted like slightly chilled straight vodka. Poured it in the glass and it overflowed. Lifted to drink and spilled more. Ask for dirty, came clear as water. Only 2 olives. \n\n-3 Olives.", "author": "Gregory P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "A very hot day in San Fran today, very hot. We don't  drop by The Pilsner very often, however, bartender du jour, Johnny, served up some 'cool' drinks and made us feel welcome.  Seems everyone here is always in a good mood.\n\nHopefully see ya all soon Pilsner!", "author": "Bobby J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-08", "description": "Recently, when asked to decide upon a neighborhood bar with a good back patio, my mind brings me to Pilsner. (My thirst makes me actually go.) Pilsner is an old school sports bar. (Hence why I laughed when Hi Tops was being called the \"first\" gay sports bar in the Castro-- not that I don't love Hi Tops, but it's not true!) In fact, the only times I've felt crowded at Pilsner is during a big sports event (local or otherwise, as they often host events supporting various local sports groups).\n\nBut, the real reason we go is for the back patio. It's got a plastic covering, meaning it's got wonderful light while being sheltered from much wind. There's a small alcove for a large group to the right, long benches and various tables throughout-- making any spot a good one to be at. There isn't a lot of music, meaning having a conversation is easy. Yes, this is a smoking patio (for tobacco or... whatever was picked up at the Apothecarium) but spacious enough that it shouldn't overtly offend those with sensitive noses. AKA, this back patio perfectly suits a grumpy gay man who hates crowds and loud music (AKA what I am quickly becoming).\n\nCome for the beer, stay for the patio!", "author": "Bryan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-31", "description": "This review is solely based on the bald bartender who was working on a Wednesday night! Not everyone has a same taste. Just because we didn't like the beer you recommended you don't have to be a jerk about it. Just so rude and unprofessional!! You can tell he's an ass from the previous reviews! Never coming back!! If you hate your job don't work in customer service, it's obvious you're taking your shit out on customers.  I hope the owner reads this!", "author": "Kay L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-25", "description": "I really love Pilsner Inn.  Every time I visit the bar tenders have been super friendly and I've always met new and interesting people in the back patio area.\n\nDrinks are reasonably priced, and it seems like it's never too crowded.  They make a pretty delish bloody mary - btw.\n\nThey have a pool table and a couple of pinball machines, and there's ample seating inside the bar as well as on the back patio.\n\nConveniently located to public transit and a number of yummy eating spots.", "author": "Margaret I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "Torn between 4 and 5. Really friendly local\nbar with nice service. Not necessarily fancy but not really divey either. Good beer selection. Good service. Would actually give it a 5 if it weren't for the smoking on the back courtyard deck, which is somehow permissible, but still gross. Otherwise, great place for either a drink on a weeknight or a fun Saturday out.", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "Now *this* place we found in SF is Awesome!!  After a horrifying experience elsewhere, we came in not expecting much.  A World Cup game had just ended and the daytime crowd left quickly.  Which was kinda cool. The place is pretty big.... Lots if big TV's around. The pool table was in use the whole time we were there....\nWhich ended up being 4 or 5 rounds beyond my expectations!  The pinball machines got mii first.  They had 2 next to the pool table. \n\nThe super-nice older bartender humored my drunken inquiries about the penguin motif....  Has to do with an \"inside-thing\" between the couple that owns the place.  That I get, we've got a thing about pointing out Zebras to each other.  (Long story). So the penguins make sense in a cute-couple kinda so sweet you gag in a GOOD way.  \n\nWe got lucky and it was spectacular weather for a Sunday in July.  The back patio was pretty.  We took pictures of some of the flowers and a dragonfly that landed nearby. Pretty and the whole place is accessible. There was a guy hanging out back there in his wheelchair.   Not that i need the accessibility. But nice to see a bar in ADA compliance. \n\nAll in all, we will likely go back next time we are in the neighborhood \n\nAlmost forgot the decorations overhead!  It was a full week after Pride events wound down. But they still had an awe-inspiring balloon rainbow arch thingie overhead   \nMust have cost some $ and taken a ton of time..... I can see why they left it up  :)", "author": "Tiffany J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-25", "description": "The bartender was such a DICK to me eww never coming back again. Rude all the way. As I remember he was bald? or grey hair. I understand that he's probably sick of working there but come on, if a customer asks you simple question then just give simple answer. Don't work customer service jobs if you hate people THAT much.", "author": "George H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-24", "description": "I've been working in the service industry for my entire professional career and I'm disappointed by the disrespect of the staff in this bar.", "author": "Cassidy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-28", "description": "I like the Pils. It's not glamorous, it's not flashy, it's just the place you go when you want to chill out and have a drink but not really be a part of the scene.\n\nREALLY wish they'd disallow smoking on the back patio though. Sucks as a non-smoker when your reward for making a good decision is that you get to choose between stuffy (inside) and carcinogenic (outside).", "author": "Sean B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-13", "description": "Well, well, well... the Pilsner.\n\nIt's amazing how many people zeroed in on a 4-star rating for this place. That  just feels right, doesn't it?  Well above average place, tho not exceptional.  The comfort level is likely what we're all yapping about.  You can feel good and comfortable here. People are just people here, no one is conspicuously present (if you know what I mean). \n\nBack in the old days, when I lived on Liberty Street, I sometimes stopped in to sit at the window seat closest to Market Street.  It was a favorite roost -- far enough from the pool tables to avoid cramping someone's shot, up next to the street to take in the early evening's activity. If it was a cold and rainy evening it was even better: cozy inside, looking at people rushing around in the weather. There's usually something interesting to see, like passengers on the J MUNI. Are they art majors or young people who escaped from Iowa and are overcompensating?\n\nI'm not much of a beer drinker (1 or 2 beers a month, ha!) but when it's time for a tasty brew I want to sit some place that feels special without pretentious or snotty people around. Here I feel like I'm among a really decent slice of humanity, just the right amount of friendliness.  I'm grateful for places like this because with all the crap in life  there are still spots where all of it is kept at bay.  You can reassure yourself that it's far far away. On cold evenings this is a great place where you can watch the world.  And get some reassurance that everything is better than you thought before.\n\nSo there you have it, a recommendation from someone who doesn't really drink much.", "author": "Noe B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-13", "description": "Cheap and divey with a patio. Draws a serious crowd, at least on the Friday night that I went.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "Our first time in the Castro district after a nice dinner and I have to say I was very impressed with this place. The bartenders are super cool, drinks are strong but very cheap and everyone there was laid back. If we are ever in this area again I am sure we will back to this place.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-26", "description": "This is my neighborhood bar and I've been going here for nearly 9 years. Perfect place to play pool, hang out in a flower-ridden patio and see your regulars. Reasonably priced, lots of beers on tap, and awesome bartenders.", "author": "Paradise S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "Strong pours. ESPN bumping in the daytime. Great staff. Fun people to talk to . And one of the best backyard drinking areas in the city. And no shade thrown to heteros which is really nice because as Depeche Mode did try to remind us,\"people are people so why should it be, you and I should get along so awfully\".\n\nI love you Pilsner", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-23", "description": "relaxing  bar  and most staff friendly  . The outdoor smoking area is great except choking on the pungent smell of pot at times", "author": "Andy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "Love it here.  Cheap beer, not too crowded, and they let you smoke your medicinal marijuana in the back if you need it.  Love the pinball, too.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-09", "description": "It's full of good times and good people. You can smoke on the back patio. Tom the bartender is one of the best.", "author": "Thomas F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "Somehow, the sun seems to shine right on this patio, every day. With the space to comfortably play pool, pinball, a trough, a selection of beer of Napa Smith IPA and a rotating $4 IPA special, relaxed bartenders and regulars, this bar is as good of a neighborhood bar there is in the city. Bring in an Ike's or Dinosaurs....", "author": "Jon A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-14", "description": "It's all about the back patio, at least when the weather isn't shit. And like a typical gay bar, strong ass drinks.\n\nCheers.", "author": "Justin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-17", "description": "Pilsner made my night this Friday.  I  asked for the bathroom key  - not long after I arrived here.  The bartender paused - and then asked for my ID. I didn't have it on me - so I said I'd be back with it. \n\nAs I found my way back to my bag - I had a crazy big smile on my face. Someone asked me where was I was going. And when I revealed that I was trying to find my ID - they seemed confused.\n\nI was thrilled though.  Being IDed when you haven't even asked for a drink yet - is huge. It's truly a massive compliment! I couldn't wait to head back to the bar with my tattered ID.\n\nOutside of awesome - complimentary bartenders - who kept my water glass full - throughout my time here - I loved how big this space is - and the warm positive vibes that moved throughout it. Their bathroom was clean and accessible - and their back patio is truly What's Up.\n\nSeriously if you're ever trying to find a unique space for an event or get-together - the Pilsner Inn is a wonderful spot. Their back stretching patio has a nice cover on it  - which keeps the wind out - but keeps the gorgeous San Francisco light- in. \n\nPilsner feels like a warm familiar friendly hug. Which is the ideal way to begin a long weekend.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-19", "description": "I like the Pilsner Inn, it has a nice little homey bar feel to it - even though it's located on the very busy corner of Church and Market. \n\nIt has a nice little pool table, pinball machines and a nice little outdoor area that is covered. Nice little bar for group events.\n\nThe drinks were strong, my second drink was even stronger. I definitely appreciated the good service over at the Pilsner Inn.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-21", "description": "A small little gay bar. There isn't much room from the door to the back, worry about bumping into people either on the stools or playing pool. The men's restroom has a tub men pee in or a one stall. The women has a private room. The backyard can fit about 20 people.", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "One of my favorite haunts. You're never feeling crowded, the vibe is very welcoming and neighborhoody, and you can actually take your friends there and enjoy each other rather than shouting over some screeching diva thumping out the speakers. Plus the patio is my everything.", "author": "Brad F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-01", "description": "Had a round of drinks here last night -- one of the last stops on a Halloween crawl in the Castro. Bald male bartender was incredibly rude (looks like another reviewer had a similar experience). \n\nI order two drinks for me and my friend. My third friend, after contemplating what to order, chimes in. I tell the bartender the third drink order as he's bringing our two drinks. \n\nHe says something along the lines of, \"For fuck sake, can't you order your drinks at once? Look how damn busy it is here.\" I look around and it's the least crowded bar I've been to all night -- in fact, it didn't even have half as many people as the last bar we had just been in. My friend and I look at each other baffled. \n\nBut hey -- I get it. It's Halloween and a busier than average night for you. I just don't know why you have to be such an asshole about it. A simple, \"Hey let me take care of these other people first and I'll get back to you.\" would have been perfectly fine. Because really... you're going to give me shit for ordering drinks at a bar?", "author": "Edward Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-25", "description": "Great bar to chitchat in without having to talk over the thumpa thumpa. Cute penguins above the bar and especially a set of penguin stuffed animals that I think I own too from Sears... Nice selection of beers and cheapish too ($3.75 before tip). \n\nPatio looks like it'd be awesome in the warmer months.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-07", "description": "After watching the Michigan-Butler game (and many delicious beers later) at Toronado's, we stumbled into Pilsner for some afternoon sun and even more delicious brews. \n\nI really like the patio at Pilsner. It's well-lit with the transparent canopy and it never gets smoky even when it's crowded on Friday night. The seating is well designed so everyone has space, yet it all feels very intimate and social at the same time. \n\nSince it was nice and sunny out, I knew 21st Amendment's Watermelon Wheat would be the perfect brew for the conclusion of our lazy Saturday afternoon of drinking. It's light and delicious with just a hint of watermelon after. \n\nIf you haven't been to Pilsner Inn's patio yet, I strongly encourage you to. It's really a great place to enjoy a perfect sunny San Francisco day with a nice brew in hand.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-03", "description": "It's a fine establishment in a great area.  Mostly cute old guys playing pool.\n\nBut specifically, Pilsner is prime if you are a smoker, because that's all people do on the back patio.  Like, smoke 'till they die.  In which case, I usually don't love coming here because all of my friends smoke.  Henceforth, I get a load of wonderful secondhand and end up smelling like an old house fire.  Cough cough, can we go now??", "author": "Rachelle P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-30", "description": "Bartender was a dick to my partner on her birthday. Honestly, little bit if class would've been appreciated, but apparently this isn't that kind of place.", "author": "P M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-27", "description": "The bullet points:\n- Friendly staff (always)\n- Outdoor area (that is smokey)\n- Bathrooms are on the gross side of life\n- Cheap\n- Friendly clientele \n\nEven though I go here a fair bit, I cannot justify giving this more than 3 stars, as I tend to only go here because it is inoffensive, has an outdoor area, and relatively cheap, not because it is awesome.  Sad, but true.", "author": "Tia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-20", "description": "I went to this bar after work the other night and it was on the slow side, which was perfect. The bartenders were soo nice and chatty - I loved them (they are the reason for this review). \n\nI was meeting up with someone who while en route had a nasty bike accident. After showing up bloody to the bar, the bartenders, without hesitation were offering towels, peroxide, band-aids, packs of ice.\n\nI will definitely come back again, just to hang on more of a mellow level with a beer, some pinball and a surprisingly large back patio.", "author": "Leslie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-24", "description": "like the pool table go as the designated driver sober person free soda with my group im a fan good place to watch a game with friends", "author": "Leigh G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-02", "description": "The back patio is great. It's nicely shaded and tented with lots of foliage everywhere, but smokers allowed so keep that in mind. The bartenders were nice. Drinks are strong and the beer selection is great. I only had eyes for the 21st Amendment IPA. I didn't think prices were actually that cheap, but fair. This place is cash only.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-06", "description": "Pilsner Inn - sounds kind of fancy and posh, eh? Well, it's neither and that's just how we like it! It is a great, neighborhood, divey sort of hang out. They have a full bar,  back patio that can be used all year 'round, and a pool table. \nThe pool table is a bit of a hassle (the space is too small and you know those certain pool players that think they are on tour and get angry if you are innocently enjoying a drink AT THE BAR and their stick bumps you..), but other than that I really enjoy the place. \nThey have a few big screens up and it's one of my top picks for grabbing a beer with friends and watching whatever sporting event is happening at the time. The bartenders are pouring big drinks, lots of beer on tap and you can carry food in from nearby restaurants. \nIt's in a great location - close to muni and bus lines. And you can get anywhere in the Castro in about 5-7 mintues from the Pils.", "author": "Shannon K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-24", "description": "The bartenders are exceptionally rude and condescending.  It is a dive, but the bartenders act as if being there is a privilege they're extending.  It has a back patio, which is its only cool feature, but it smells bad and is not worth being around the cocky and rude staff members.  The rude staff seem to cater to a few regulars who are also rude except with each other.  I wouldn't waste my time here again.  If you want a patio, go to The Mix on 18th between Castro and Noe.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "Love this bar. Strong drinks, solid draft selection, and a fantastic back patio scene. It doesn't hurt that it's directly adjacent to Aardvark Books, also highly recommended.", "author": "Andrew J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-06", "description": "Not a bad space.\nBeer specials are nice, and plenty of nice ones to choose from on tap.\nMusic was fine at first, but that was then squelched in favor of the ball game.\nWhatever.\nOne pool table, two pinball machines, and a soft-tip dart machine.\nCame looking for a dart board, and this was a let down.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-22", "description": "Most people don't even notice the penguin theme until i point it out.\n\nThis bar is never crowded and i like it. Good to hang out for a bit and have some beers.", "author": "Phuong M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-03", "description": "We went here?\n\nI do not recall.\n\nLack of recollection is an automatic 3 stars.\n\nDAMMIT, my brain sucks.", "author": "Pam S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-09", "description": "Wow--hostile bartender tonight.  After ignoring the four of us for a while, the orange t-shirt wearing bartender finally approached us after we waived to him.  The bill came to $24.00 for four drinks.  My friend put $25.00 on the the bar ( a twenty and a five) and another friend already had a $10.00 bill on the bar.  The bartender swiped all of the money and put it in the register.  We all told him that he made a mistake.   He got defensive and angry and  wouldn't correct it until the older bartender who was also working that shift asked him to give us the extra $10.00 back.  He threw the $10.00 bill on the bar and said \"here!\"   We also found out that he was training a new employee that night too--nice job with showing him how to handle customers!\nSo tired of poor service.  Management--why do you allow this?\nThe bartender who got our money back also told us that there is yet another drink maker there who waits for the customers to come to him first.  Apparently, his entitiled attitude is even worse.  What a dump.  I've felt this way every time I've been in there.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-17", "description": "I had to go to the bathroom, and I had a hard time manuvering the door. (???)\n\nI knock off a star for their dirty bathroom, but at the time I realllly didn't care. \n\nThey were SO NICE. I had a hard time figuring out why there was a key on the door outside the bathroom but no lock? So I stood there trying to read the sign (which was about 4 paragraphs long) and a couple guys helped me out by saying \"Just take the key in no one will bother you\". \n\nSweet! And their Stella is awesome here. Right next to Chow, so you should come here when waiting for a table and a super delicious dinner. \n\nI don't recommend getting drunk here beforehand, though.", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "Pretty cool neighborhood bar with a solid following.   Thank you for supporting all 500 of your softball teams!   We all really appreciate it", "author": "Matt V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-22", "description": "This is a love letter for Pilsner Inn, written by a regular. \n\nI've been coming here at least once a week for over six years. My then-girlfriend (now wife) stumbled across Pilsner Inn with her cousin after they moved into the neighborhood. A low-key gay/neighborhood bar with good beers, friendly bartenders, and an outdoor smoking patio? Sold! Soon after I would come across the bay and meet up with them as well, always having a good time.\n\nAlmost every patron is a local and/or a regular. In fact, most of us know each other well enough on sight, but not very often by name. We're just there to have a good time, be social, and continue on with our lives. Which is not to say it's for \"regulars only\", nor that it's an unfriendly bar; I've met a lot of great people there, and have had many parties mingle together.\n\nAnd with a mixed crowd comes a mixed juke box. Johnny Cash, Frank Sinatra, Lady Gaga, the Rolling Stones...whatever...always entertaining.\n\nNow, that being said, even though this is probably my favorite bar in the city, it has only recently become a decent beer bar. They have the requisite American lagers, but they've been expanding the IPA and local line a little too. A good day for me was when they started carrying Lagunitas IPA; an even better day was when they starting carrying Sierra Nevada Torpedo!\n\nAnd the bartenders...Tommy, Jeff, Warren, Mike, Johnny...they're all great. We consider them to be our friends and look forward to seeing them every time.\n\nOh, and do yourself a favor: never order a Mojito here. You will be stared at until you change your mind.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-19", "description": "The sports bar feel is a little tacky, but it's fun because they have the patio, pool table, pinball and darts available. What I don't like is the service. So far I've experienced 3 different bartenders who were in lousy moods, bitchy, unfriendly and sometimes rude. Suggestion, if you're the only employee working for the night, try treating your customers with respect and personality if you expect them to come back. I've been there a number of times and typically see less than 15 people there at a time. Listen to your customers, they are the most valuable asset to your business.", "author": "Foodie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-29", "description": "I love this bar. David, the bartender we had, was fantastic to talk with and made my drinks wonderfully! I love the patio out back for smoking with all of the flowers and plants and awesome lights. And the penguins every just make it one of my all-time favorite bars. I would highly recommend this place!\n\nIt's not a very packed bar which makes it easy to move around and not get bumped into all of the time. There's a pool table you can play on, too. It's a gay friendly bar, and the people are nice.", "author": "Autumn D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "A gay bar that isn't your typical gay bar.  If you doubt my statement that it's a gay bar, please note the following:\n\n1) It's in the Castro (although on the eastern border)\n2) There is a rainbow flag out front\n3) The men's bathroom has a through-style urinal with a mirror above it.  Umm...hello?\n\nSo what makes Pilsner Inn unique is the patio out back.  On a warm night, it's the perfect spot to enjoy one of the many beers on tap and shoot the shit.  Oh, and as with most gay bars, they have stiff cheap drinks too.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "Great neighborhood bar with a huge patio to enjoy my martini. When I want to hang out at a bar after work that is close to home, this is my go-to place.", "author": "Rich S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-12", "description": "Two stars because it's the only gay bar with a good beer selection I've ever been to.\nDigital jukebox, which sucks, especially since when it ate my money, the bartender just shrugged.  IF IT'S IN YOUR BAR IT'S YOUR RESPONSIBILITY TO MAKE SURE IT FUCKING WORKS.", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-09", "description": "Well once again I found myself back at the Pilsner Inn this time on a Saturday night. I brought a friend who had never been to this place after we had dinner. I was glad to see that Steven was behind the bar once again. My friend and I found a few seats at his station had a great time.\n\nThe one down side to the night was while Steve was helping other customers the bar back came buy and I asked him for a glass of water at which point he gave me a dirty look. I thought maybe he didn't understand so I asked him again at which point he poured me a glass of water and gave me dirty look again.\n\nOver all the two bartenders treated us well and we had a great night I just hope that barback doesn't treat other people in the same way. My last visit was on March 3rd.", "author": "Whisky T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-14", "description": "My out of town friends brought me to Pilsner Inn on their last night before heading out.  This chill bar has an unpretentious crowd and seating by the windows.  (Perfect for people watching.)  They also have a pool table, darts and outdoor seating in the back.  \n\nThe cool thing about this place is that it's casual. It's a very laid back crowd and a laid back scene.  There's a small TV over the bar and a phone booth in the middle too.  \n\nMy only concern was when I used the restroom and maybe because I didn't see a lock.  But I was concerned someone would walk in on me and see all my glory.  And the restroom isn't off to the side, so anyone walking by would get a view!", "author": "Teri C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-18", "description": "Broken pinball machines don't add to the ambiance.  Bartender could have cared less.  Too noisy inside.  Patio is great as a cancer alley.  Very eclectic crowd.  Otherwise, low-key place with a good beer selection.", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-26", "description": "I really like this bar, but the one bartender here is ridiculous!  So I am a bartender, and NEVER HAVE I NOT GIVEN A CUSTOMER BACK THEIR CHANGE!!!  I ordered two beers and the total was $9 for the two beers.  I paid with $10 bill. He did give me my dollar back, so I asked him to confirm how much the total was and he replies $9  I would have probably let it slide if the bar was busy, but there was no more than 10 people in the place.  I am in the service industry, and I am a very generous tipper.  This is  unacceptable in so many ways!  He is about 5'9 brown short buzz cut, and sometimes he has a go T.", "author": "Tylr K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-14", "description": "I've going to Pilsner off and on for years. It was a dive bar that lucked out when the no-smoking ordinance took over SF in the 90s!  That big patio became a lure and it became a place to order a drink before going over to Chow, which had just opened.  \n\nSome of the same bartenders are still there.  It's owned by an old queen\nwho needs a reality check.  My biggest complaint is that they dont pay attention to glasses and Ive had a couple which have had some jagged chips on the  cusp which could rip someone's lips off.\n\nThe bartenders dont seem to give a good goddamned and 1 in particular crowds the jukebox with his own folky Bob Dylan taste.  It's just one of those places that won't get any worse and won't get any better.\nThings just coast along.  They have some regulars who flip out if you dare play a song while their games are on, which is great to watch.\n\nI prefer the similar looking Mix, where you can hear music on the patio--not so at the sort of troubled Pilsner...\n\nOh I met a woman at the Lucky 13 who told me she would never go there again after being mistreated rudely by one of their bartenders.  I can totally believe that....", "author": "Latin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-25", "description": "The Pilsner is hands down the WORST bar in The Castro. I'm ashamed to even have this bar in my own neighborhood.\n\n\nThey have 2 horrible bartenders that completely dislike women. They throw things at the patrons if you are rooting for a team they don't like. And they are total drama queens.  \n\n The place is dirty and evil.", "author": "Amie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-03", "description": "Penguins!! They have penguins painted high up on the walls, so naturally I felt right at home. \n\nFriendly folks, friendly drinks, and very nice outdoor patio. I'm sure that the pool table would be friendly too if you asked it.\n\nIt's within walking distance to so many things other things but, Pilsner, dear, sshhhhh, don't worry about that. I'm only walking towards you.\n\nFriendly note: Plenty of lovely wood in here.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-06", "description": "I didn't know I was in a gay bar when I went here. It feels like it could be a sports bar. It's nice. I could take my boyfriend here and once he gets over his fear of the Castro...he'd kick it with the gays here like they were his buddies.\n\nHonestly, if it wasn't for the rainbow flag I wouldn't have known.\n\nIt's nice to have a place like this to take tourists, family, etc who aren'tt ready for the HARDCORE HOMOS of Badlands. I could take my lesbian mommies here and we'd be cool.", "author": "Lana P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-23", "description": "A nice bar that feels like a dorm! Nice people and feels very relaxed! Pretty cheap beer!", "author": "Jesper H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "What Euge said - \"gay bar?  I was at a gay bar?\"   Pilsner is laid back with cheap beers and a come one, come-all vibe.  It could have been a bar anywhere in the city but it just so happened to be in the Castro.  I came to meet up with friends who were hooking up with another friend on a layover in the City.  They had just had dinner next door and so the Pilsner it was.  We met up, had a few drinks, shot the shit, and on to another watering hole it was.  I would totally come back here next time I'm in the neighborhood.", "author": "Joe B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-24", "description": "One of my all time favorite bars in SF...i've only had one bad experience with a bartender here, but that was like 6 years ago...i think he since died ...so thats taken care of. (I had nothing to do with it!)\nI suggest waiting in Warren's line...he is uber sexy, friendly, and never gives attitude....did i mention he is uber sexy???\n\nHi Warrren!", "author": "Ripley B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-13", "description": "Low key and very casual gay bar on the edge of the Castro.  Good place to wait if there is a line at Chow.  Beer selection was good.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-11", "description": "Wow, I met a lot of friendly guys here.  I ended up going to this place while on vacation like 4 times.  I like that they played sports on the TV.  My kinda guys were hanging out there.... I didn't care for the smoking patio out back.  yuck", "author": "Matt W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-01", "description": "Short Bald Bartender working on Halloween. You need to find a different job. Will it kill you to smile and not be so bitchy? You ruined one of my favorite bars and my night.  I will not be coming back.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-23", "description": "Such a better area to be in, as far as bars, and Pilsner Inn is a large part of that. The whole pub is really cozy and on the right day, the back patio is just pure bliss. Not much to it other than that. No frills, just cozy pub bliss.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-22", "description": "I am no stranger to gay bars. So when La Novia pointed this place out to me on a random weeknight trip to San Francisco, I was more than happy to check out the Pilsner Inn.\n\nThere is a plenty to like about this place. For a gay bar, it has more than just gay patrons. It had a sloppy drunk guy, a sprinkling of sorority girls, and a few meathead guys who just wanted to play pool. \n\nIt has an overall unpretentious vibe, a pool table, a nice patio, and a digital jukebox.\n\nUnfortunately, when you let certain gay men control the jukebox, you get some interesting results. I had so sit through well over 25 excruciatingly painful songs before I could I hear my selection. The terrible song choices consisted of Britney Spears, Christina Aguilera, Rhianna, and Colplay. The latter being the worst and lamest of them all.\n\nAnyway, the night improved once my music selections came on. People at the bar started dancing and having fun. Or maybe the alcohol hit later. Who knows. But all I know is, a party is always better when you play Van Halen and not Coldplay. \n\nIn the end, this place was pretty solid. As in 3-stars solid. But the torture of bad music and the fact this place only takes cash makes it go down a star.\n\nOr maybe I am just bitter because none of the boys hit on me.", "author": "Archie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-06", "description": "The Pilsner is my kind of bar. Casual and friendly with 'regular' guys just being guys, no twinks no drama (sorry twinks and dramas). Some of us actually like men with facial/body hair and a more masculine appearance . I love the back patio area. It's a great place to go and hang out with friends before or after dinner, or whatever. This is one of the few gay bars that will show sports on the video monitors, and we are not talking water sports.", "author": "Greg S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "Friendly neighborhood pub atmosphere with an awesome choice of draft beers!", "author": "Robert L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-07", "description": "local neighborhoody divey bar. the bartender was nice. there's a pool table to play in case you run out of things to talk about with your friends. if you don't come with friends at all, there are some random arcade games to play just so you don't look like an alcoholic. i prefer to cover my alcoholism/solo drinking habit by playing with my phone and pretending to text my non-existent friends.", "author": "Te R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-06", "description": "Tonight there was a beer bust for the Pilnser Pups -- it was awesome. Good crowd, good drinks, and a great bar. Honestly this is probably the most chill, and the most laid back gay bar in the Castro area. \n\nOh, and did I mention that they have a great jukebox (Journey! ACDC!) and an amazing beer selection? Yes! Beer! Good beer! That's typically an anomaly for gay bars - but not this one!\n\nAnd of course, lets not forget their kick-ass back deck. It's great for the summer!", "author": "Tom A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-01", "description": "This is a great place to go with a friend or two, have a drink and relax; I especially love the outdoor patio!", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-08", "description": "I wish I could have given a no star to this s*$&hole of a place..... My friends and I went to this bar last night and the bartender Gary (that's what he said his name was) was a total D.. bag. First of all he wanted to close the bar twenty minutes early, my friend wanted a beer so he asked for one and Gary yelled at my friend \"Didn't you hear that the bar is close???\" (yeah we were in shock and pretty pissed off) I can keep going on how obnoxious, rude and simply unacceptable the bartender was but I don't ant you to cry...  I'm never ever stepping a foot in this place and hope that you will read this review before going there. Also I would hope that the owner reads this review and does something about it, people go to bars to chill out (we were not drunk, we had just gotten off work in case you were wondering) not to get yelled at....", "author": "sandra b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-12", "description": "This is the first time in my YELP life that I have ever written a review. Understand that I have relied on this site for many different reasons- but the service at this bar- a bar where my partner and I have spent THOUSANDS of dollars.... was so horrible that I HAD to write a review.... \n\nTERRIBLE\nATROCIOUS\nEMBARRASSING! \n\nI mean for real. Terrible. \nI am a waiter in Florida. \nI came in on thursday the 11th and the service I received was abysmal. I was even tacky enough to relay the fact that I'm \"IN THE BIZ\", hoping that they wouldn't be fucking pricks to someone who was willing to shell out massive tips to these pieces of dung!. Well... they embarrassed themselves through and through. I will never go here again- they suck! They actually tried to be difficult. There are so many other places RIGHT DOWN THE STREET that you can go to and receive better service from cool cats. \n\nSeriously- This place was so terrible that I'm going to make it a point to monitor this site daily and email people who have missed the message about how much this place sucks! I will then instruct them on where else they can go and find better deals on liquor and common sense!", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-21", "description": "Having vowed to boycott St. Paddy's Day following last year's debacle, which involved getting dumped for fat sorority girls doing car bombs, I gave my friends the ultimatum that if we did go out on amateur night it would have to be an entire spectrum away from blonde marina chicks and the guys that love them. \n\nUnless there's a new gay fetish involving sorority girls that I'm unaware of, the Pilsner was probably as far away from last year's drama as one could get  --as ideologically polarized as a Hooters opening in Kabul -- so I agreed.\n\nA great scene -- dozens of beers on tap, pool table, patio in the back. My only bone to pick -- $4.75 for an Amstel Lite. Really? Seriously, in the body-obsessed Castro, lite beer should flow like water.", "author": "Suzanne R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "A pool table, a patio with plants and a pond with koi fish, friendly locals, and a great bartender named Mike, who makes great drinks at good prices.", "author": "Vani A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "My favorite place for a quick drink after a long day at work. Super nice staff, cheap drinks, beautiful patio. I'd definitely recommend it to anyone in the area. Also, it's my favorite place to have a conversation with a friend. The music isn't super loud and the people are nice.", "author": "Reuben D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-30", "description": "Getting pounced on as I come out of the bathroom...\n\nBearish Gay Guy: You have excellent teeth. What are you doing here?\nMe: Huh?\nBGG: You're really pretty, and too straight for this place.\nMe: Huh?\nBGG: Have you ever seen Mean Girls? You could totally be a mean girl.\nMe: Huh? \nBGG: I mean you look like one, not that you're a bitch. So, how the hell did you wind up here? Do you live in the Marina?\nMe: Uh, no. \nBGG: Pacific Heights?\nMe: Uh, no.\nBGG: Ok, let me guess. You live in the Inner Sunset, but only because your friend Heather gets free rent from her parents. \nMe: Uh, no. I think I need to get back to my group. \nBGG: Ok, that's fine. I just think your teeth are perfect. And I'm obviously gay, but I love straight girls and always wind up dating them.\nMe: Right. I need to go. Over there.\n\n-------\n\nDrinking a gin and tonic, talking with people next to the huge not occupied whatsoever bar, because hey, it's a bar, THAT'S WHAT YOU DO...\n\nBartender: Can you guys move? You're getting in the way of my business. \nMe: Huh?\n\n----\n\nThree stars for good ambiance and strong drinks. Two stars taken away for the bartender's odd requests and the BGG who not only was judgmental, creepily complimentary, and probably not even gay, but who also on his way out of the bar grabbed a certain part of my body that you just don't grab unless you can make me say more than \"Huh?\"", "author": "Devon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "Great for an after work drinking session... the pool table and darts make the bar complete, but the outdoor smoking patio really rocks.", "author": "James V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-18", "description": "As I said in my \"Gay!\" review, if I were a man, I'd be gay.  And I would come here.  Every Saturday.\n\nI am a woman, however, and Pilsner Inn still fits the bill - in wonderful ways that appeal to those born with a hoo hoo.  In addition to the constant bathroom availability, I got to hear about latest (and old) conquests and hookups, smell a variety of colognes on men more than happy to hold out their wrists for me to smell, and learn about the perfect Marc Jacobs model.  To top it all off, when someone paid me a compliment, I knew he wasn't just trying to get into my pants.\n\nI fearlessly put my name up on the board to get in on the running pool game (and promptly went from pool champion to pool disgrace).  But at the urging of my friend, I put my name back up for another game.  My would-be opponent was so nice to allow me to play with Tinna, but when I won, he didn't continue the \"winner plays again\" rule...he moved on to the next guy.  Apparently the little lady didn't fit in exactly the way she thought she did.  :-/\n\n-------------------------------------------------------------------------\nIn spite of that douchebaggery, I'm taking this opportunity to urge everyone to do your part for equality - please vote NO on prop 8!", "author": "Kerrie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-09", "description": "I'm gonna start a list called \"Straight-friendly gay bars with pool tables.\"\n\nWhen I start this list, Pilsner Inn will be right there at the top.\n\nHahahaha - as if there's such a thing as a gay bar that would turn away a straight guy.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-30", "description": "Where bears come to teach lesbians and a random straight couple how to waltz to Olivia Newton John.\nTrue story.\n\nRidiculously pleasant back patio, and some mighty strong margaritas to boot.  (Drink from a boot?  Didn't do it.  But I'm sure that's someone else's true story from here.)\n\nA San Francisco melting pot.  Welcome to all.  Fun *will* be had by all.", "author": "Ravena F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-07", "description": "While technically a Castro bar, it's on the edge so you end up with a mixed crowd. Props for being a pretty cool sports bar with some damn strong drinks. The Vodka Redbull they gave me was served in a tall beer glass and was only a few bucks. \n\nAmazing!\n\nLots of room here and didn't get hit on. I should come here more often.", "author": "Ryan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-19", "description": "Random.\n\nThat is all I kept thinking during my visit here last night. Oh and, \"Man, I'm really buzzed.\" But those are two excellent things to be experiencing and thinking in a bar on a Monday night. They say it's a gay bar, but as others have noted, it is a very friendly to breeders dwelling as well, which is cool since I live in this hood and generally like to go to places within stumbling distance.\n\nAs a true drinkable bonus, this place sells Freixenet Champagne by the bottle for only $18.00. Sure, it's a mark up from retail, but when the bank account isn't allowing the Crystal, there is nothin' wrong with a few glasses of Freixenet. The one bummer is that it's cash only; a usual drawback in a lot of SF bars, but other than that, it's a chill place to convene with friends and have some laughs.\n\nOh! And they have ELO in their jukebox! Numerous points for that :)", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-21", "description": "I'm not really sure what the penguin theme is for, but I can dig it.  I also dig this no frills bar that has a clientele that appears mostly gay, but is not exclusively so.  I have come here twice and had some good beer, stiff cocktails, and great conversation on both occasions.  Was it the company?  Probably not.  But in such a cozy spot like this, how can you not enjoy yourself?", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-19", "description": "One night, we were driving around town from this event to the next when I received a text:\n\n\"Come to the Castro and have beer w/ me.\"\n\nOdd.  What is my allegedly straight friend \"B\" doing in the Castro?  On a late Thursday night?\n\nBut I was sold on beer, so off to the Castro we went.\n\nUpon entering, not only is B there, but so are my other guy friends C and T.  All lined up.  In a row.  At the bar.\n\nAmongst many, many other guys.\n\nI looked around the room and one twirl later, I was quite certain that as suspected, this is a gay bar.  That's all fine and dandy, but what are THEY doing HERE?\n\nThen again, what the hell am *I* doing here?\n\nHmph.\n\nSitting at the bar at Pilsner Inn was awesome, though.  The bartender was just a fabulous guy - and by the third round, he was giving us massive discounts on drinks with outstanding pours.  \n\nGuinness, on tap here - pint after pint of merriness.\nVodka drinks were a tall glass FULL of vodka w/ a dash of whatever else you asked for.\nPatron shots were given to you in water glasses.... FULL to the rim for minimal cost.  I had to split it into two shots, and even then, it was 2 XL shots.  One nearly knocked me out cold on the spot.  Damn Tequila.\n\nEven cooler is the outdoor patio in the back.  If I recall correctly, it was like an arbor-covered patio w/ flower boxes and just an all around homey feel to it.  There, I kicked my feet up and chilled out as everyone teased me that no matter what I did, they were more wanted here than I was.\n\nAs IF I didn't notice.\n\nBut the staff @ Pilsner makes it possible for you to not care by filling you up with strong drinks at cheap prices - - and we just hung out until they finally asked everyone to leave.\n\nSeriously - - if you're out for a good time w/ your friends, and want to party it up with good people who know how to have fun, come to Pilsner Inn.  This place rocks.\n\nI still don't quite believe my three friends (one or all three?) are totally straight.  I know what I saw when I entered. But it's okay, because their potential gayness is what brought me to this place.  \n\nGood comes out of everything.\n\nBut I will say for the record - - -  I always knew B liked purple entirely too much.", "author": "Grace K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-23", "description": "All I know is that we ended our '8 bars in 6 hours' marathon here, where we met up with the 'Fabulously Fierce' Darin I for a beer.\n\nWe walked straight through the place, right to the back where there was a lovely little covered patio and several benches. Lots of beers on tap. We had Pilsners.. A bit obvious, we know. :)\n\nDarin was kind enough to hold my handbag while we sat and talked.. I'm not sure if it was b/c he was being sweet or maybe he just really liked the damn thing. I mean, it's a hot bag and he's got great taste! \n\nAt any rate, it did the trick. Good, cheap beers and a nice place to drink them. I'd totally hit up the Pilsner again. It's a good place to end your night.", "author": "Katie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-08", "description": "Everyone's favorite neighborhood bar... and the bartenders are amazing... and there is a back patio. What is there NOT to like? \n\nFavorite bartender is Mike, and not just because he is dating my best friend (though that does make for a good story of how they met (not that Im saving it up for talking points in Key West or anything).", "author": "Jordan Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-31", "description": "I cannot overemphasize the value of a place where you can go on a Friday night and still find enough room to breathe. The bartenders are friendly and attentive, pours are legit, and I didn't get dirty looks for showing up with a bunch of straight people. Pool table, patio, Magic Hat #9 on tap... yes please. Also, prices are completely reasonable -- 3 imported draft beers and a Stoli tonic cost me less than $20.", "author": "Tracy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-03", "description": "It's just your average bar really.  I've come here many times to enjoy drinks with friends on several occasions and once while waiting for a table at Chow.\n\nIt gets an extra star for the exposed men's restroom that has the trough like urinal...with a large mirror strategically placed along the back wall that shoots out a reflection of your wiener for all the bar to see while you shi shi.  Not the place to go if you get stage fright.", "author": "Luis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-23", "description": "I could be at the worst bar in town, but still give an automatic three stars if they have a pinball machine.  Good thing Pilsner Inn is already a cool, breeder-friendly gay bar, with pinball as an added bonus. \n\nIt ended up being a great place to kick my week off with a bang on a Monday night.  Or, rather, a blur - a big, super, happy, drunken blur.  There were some standout moments though, not least of which was getting my beer replaced FOR FREE by the oh-so-patient bartender after getting too excited about pinball and letting my glass of beer tumble and shatter all over the ground.  Somewhere else mixed in the spin art-esque blur of night were some great songs on the jukebox, jokes about high school, blue moon on tap and even more pinball.  I'd definitely check it out again on another visit to the city.\n\nThumbs Up:\n-Blue Moon.\n-Pinball!!\n-Bartender understanding of my extreme clumsiness.\n\nThumbs Down:\n-Cash only.  What is this?  1995?", "author": "Hazel Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-17", "description": "As we were walking down Market towards the Pilsner, my fashion industry friends had some commentary about the people we passed by.  Actually, they mostly addressed the \"shims\" in their lovely evening wear by singing, \"I'm going out\" ala Ms. Diana Ross.  So fashion.\n\nThe drinks I had were good and it was nice sitting out in their patio area.  \n\nI hadn't been to a bar in the Castro in a while but it was the first time I saw 3 not ugly women practically clear a room.  Eh, we all got to sit down at least.", "author": "Seong P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-30", "description": "Can I give them six stars?  It's the mellowest gay bar I've ever had the pleasure to be gay at.  \n\nYou can find me here most Sunday nights and occasionally during the week.  It is the PERFECT way to end the weekend--with a good friend a few beers.\n\nThe only way I'd improve their beer selection would be to add Boont, but they've got Trumer and that's just lovely. \n\nThe back patio is a wonderful hangout--and a great place for conversation or playing cards--no thumping bass here.", "author": "Eric E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-23", "description": "Yeah! Nothing but 5-stars for the Pilsner. Probably the only bar (apart from Q Bar and perhaps the Lookout) that I enjoy frequenting in the Castro neighborhood.\n\nLOCATION! LOCATION! LOCATION!\nAnd they've got it down pretty good. Market and Church with the Muni lines J, N and F stopping within a block, as does the Fillmore.\n\nParking? Hell no! You ain't kidding me. You can try the Safeway lot but good luck praying they don't tow you.\n\nThey've got two sushi places, Chow's, Crepevine, Muddy Waters and a whole bunch of other restaurants close by. So either you can eat and then get sloshed or get sloshed, totter over and then fill yer face.\n\nInside the bar, the window seats are good if you want to people watch or want to stake out your target as he / she walks in the front door. In the patio, the benches are good as is the table way at the back\n\nDRINKS... YESHHH! THAS WHAT AH'M... HEY, YOU'RE CUTE!\nThe beers on tap are pretty darn good and affordable. They do have wine but come on! You don't go into a place like the Pilsner asking for wine!?! Cocktails and the Jagermeisters are pretthy strong so get ready to have your underwear / jock strap / chastity belt / thong / kilt knocked off!\n\nTHE CROWD... I'M A CROWD PLEASER!\nCrowd is low key, mellow, friendly, so non-pretentious and everyone is just out to have a good time and chat, catch up and yes, cruise too. Met some fun people here, met some drunk people here and met some people people here too. Reminds me of Trax in the Haight.\n\nThey got a nice pool table, an ATM (the don't take credit cards, folks so don't wave yo plastic hoping for something fantastic!), an odd telephone booth, game boxes and a pool table (and be polite as you walk to the back patio and not knock someone about to take a shot)\n\nVERDICT\nGive me a draft beer and I'm yuurrs! Pilsner saves my day... yet again.", "author": "Amit S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-10", "description": "OK Bambi has the biggest crush (which by the way I know is mutual) on someone who works  here that has been going on for a good 10 years. (damn am old slut  and I need to get over it or PUT OUT). So I avoid going here since I don't know how I would react to this fine thing who by the way is also a great artist. \r\n\r\nSo last Monday after an evening of socializing I ended up getting dragged in here kicking and screaming by a few friends and guess who was at the bar\r\n\r\n\"Mr hot pants\" behind the bar pouring and entertaining. \r\n\r\nNow Pilsner is a great laid back space and there is no need to impress anyone. People go here to just chill at the local bar, play some pool and enjoy the great patio on a sunny afternoon while sipping on a cocktail  with friends and maybe meet someone new.  There is no need to bust out with the designer crap, the attitude or the name dropping cause they don't  and I mean the clientele or the staff don't give a FUCK. \r\n\r\nOh no not this Bambi... I had the Mr SHOW OFF  I JUST CAME FROM A GREAT PARTY AND CLEARLY I DON'T FIT IN WEARING AN EVENING JACKET look with a designer hat ,fake Gookies that are way better than the real ones and a cell phone in hand all loud and obnoxious while a bit buzzed and blushing (WAY OUT OF LINE) and you  know what Mr Hot Pants was as sweet and gentle and took care of us just like the rest of the crowd that was there enjoying their evening quietly playing pool and sipping on a nice cold one. \r\n\r\nNow that is adorable, kind and deserving of a big smooch. \r\n\r\nThe real deal: decent cocktails, pool table, outstanding patio, good service and attractive friendly bartenders.  \r\n\r\nBathroom report: Clean and decent... now the urinal is another story. It is one of those co-ed urinals that is like a tub( I don't know what it is called) there is a huge mirror and if someone is using it while you are get ready for a show. Sometimes it is huge sometimes it is missing if you get my point... OK I will stop before this is flagged.", "author": "Teddy d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-18", "description": "Pilsner's about as neighborhood bar of a place as you can get in the Castro...simple wood tones, a single central bar, a pool table, and some window boxes coupled with a decently sized patio in the back make for a comfortable place for anyone to relax.  If it weren't for the overwhelming number of men, you'd never think of it as a gay bar, and even then, I still forget that it is sometime.  Definitely just  a place to hang out and have relaxed conversation over a decent variety of beers.\n\nJust be wary of the trough urinal and missing door on the stall.  But other than that, a great place to just hang out.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-01", "description": "The Eagle has landed - at the Pilsner!   I think it's so cool that the Pilsner has taken up the where the Eagle left off, supporting gay community charities with their Sunday beer busts.  There are so many bars that make a fortune off of gay folks and give absolutely nothing but attitude back.\n\nBesides, the patio is fab - not a grungy back alley for smokers, but a nice place to relax and hang out.   Inside, pinball and pool make it feel like a down home bar.\n\nYou don't have to be a \"type\" to hang out at the Pilsner - just be yourself.  I recommend checking it out on a Sunday afternoon and giving some community charity a boost.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-03", "description": "Consistantly fun and Shatangi always meets somone new and interesting. Even if you are a non-smoker, check out the patio. Always a livelier crowd (and you can hear yourself think). Great cheap drinks and the sexy-assed bartender with the goatee. I almost forgot, I spent 9/11 there with friends watching the news.\r\n\r\nShatangi told you", "author": "Njon W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-29", "description": "Wait. Where the hell am I?  Oh that's right.  I am having a \"chill evening at home and possibly going out for one drink with friends\".  Except that I'm not at home.  I'm on my third drink.  I also keep making friends and it's 1am.  I was under the impression that this would be a gay bar but I just got picked up on by several cuties at the pool tables.  Huge smoking patio and friendly bartenders means I'm doomed and my bed is going to miss me yet again.  \nI may as well face it.  This is how I spend my \"chill evening at home and possibly going out for one drink with friends\" nights.", "author": "Jill D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-09", "description": "4 stars for -\n-Great patio\n-Blue Moon on tap. Fuck yeah.\n-Reasonable prices\n-Hot bartenders. Even if they aren't into pussy, it doesn't mean I can't enjoy the scenery.\n\nNo stars for\n-Cash only. Have I told you how much this is an inconvenience to ME?\n\nBut the Blue Moon on tap is what makes it worth having to go buy a pack of gum at Safeway.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-07", "description": "This is what a bar should be. It's spacious on the inside, but not to the point that there are empty corridors that make the bar look unpopular. There are several tv's above the bar and I got to see the end of the Cincinnati/Hawaii game (but honestly, who even cares about the bearcats?). The drinks were tasty and reasonably priced and the pool table is a great space for making out (my hopes, not my reality).\n\nAs someone who is extremely pee shy, I didn't appreciate the trough in the bathroom... so I just waited it out until I could use the one toilet. \n\nSide Note #1: Why do bars feel the need to put mirrors directly above troughs? It's bad enough I don't want people seeing me/me seeing people as they use the loo... this makes it almost unescapeable. \n\nThe HIGHLIGHT of the bar is the patio. It's fun, roomy and there are lots of places to sit and congregate. I was there on a Saturday night around midnight with a group of 6 or 7 people and I never felt crowded or pushed around. \n\nI'd definitely come back. It's a very chill alternative to the pandemonium surrounding the Pilsner.", "author": "Jared S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-28", "description": "Loved this bar for several reasons:\n1) Beer selection - Awesome! Great beer choices AND they are \n     available to order in my favorite size glass - a pitcher.\n2) Seating - The back patio is awesome. Even on a cold, misty day I \n     was glad to sit outside in the city. There is an area that is covered \n     in plexiglass, which helped keep the mist off. It was nice.\n3) Crowd - Diverse. Everything from what I call \"Hey Girl Gays\" - the \n     ones that say \"hey girl!\" to other gay guys (duh?) to my very sweet, \n     straight, ecclectic friend who indiscreetly changed his pants on the \n     back patio, after giving himself a front-wedgy. And it simply isn't \n     crowded - awesome.\n4) Flyers Near the Bathroom - THE BEST FLYERS FOR RANDOM \n     CRAP EVER!! I took 5 and they now decorate my fridge. I learned \n     about an 80's club, Pedro Penis and everything I could ever need to \n     know about AIDS while standing in line for the bathroom. Two \n     thumbs way up!", "author": "Chia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-17", "description": "Good bar.  I'm the out of place guy there at 3 pm with a beer and my book =D\n\nOkay selection of beers on tap.  +1 for the big outdoor area with plants.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-06", "description": "Ok, I may be a bit biased, seeing as how I essentially live at the Pislner (the Pils, as it's been murmured  within my ever inebriated posse), but this is greatest bar in the world ever.\n\nBartenders: easily the hottest, friendliest men I've ever met.  Even when they're busy taking elaborate orders from the bridge and tunnelers (\"What do you mean you don't make mojitos?!\") waiting for their tables at Chow, they always take a second to ask how I'm doing, or say \"dandy\" when I inquire as to their current states.  Coolest.\n\nDrinks:  Some of the barkeeps here will make it their mission in life to get you totally smashed from one jack and coke.  You know the kind: they're pouring the whiskey, and pouring, and pouring, and then the token *squirt* of coke at the end for good measure.  The others settle on forming a nice buzz.  Either way, I've never been disappointed in a drink here.  Also, they have great beer specials nightly.  Don't confuse that with \"happy hour\" because it lasts all night.  The only night they don't have specials is Friday.\n\nThe Patio:  Yes.  Me and the patio are one.  The round table at the end with the plastic chairs that provide superior back support after a long day are best friends.  And the smoking.  Smoking and drinking go together.  And there's a coy pond, and shrubbery.  Need I say more?\n\n(And they got a pool table too!)", "author": "danielle p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-29", "description": "Good beer selection, reasonable prices. Cash only. Fairly loud music in the bar and pool table area, with a quiet back patio.", "author": "Mara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-19", "description": "Addams Family Pin Ball\n $18 Bottle of Champagne\n Friends \n+ _______________\n\n=  Fun times on a Monday night.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-10-27", "description": "Its like the college bars I hated but everyone here is gay.\nThen you think, gay people did THIS? and they keep coming here every week, o no honey.\nThe outside patio is very nice but cough, cough, its littered with smokers.\nI'm told that the smartest gays hang out here, smarter and more successful then the other places.\nHmm, like a phd matters when you bring him home.  \nEven a high school dropout gay knows where to find the goods. Pfft.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-11", "description": "I love this bar and always have. I told my onetime roommate that we were being evicted on their patio. Then I took him here to tell him I was breaking up with my then-girlfriend. And then I took him there to tell him I was gay. And then there was the time that said ex-girlfriend's friend thought it would be funny harass the straight boy by ramming his tongue down my throat (joke's on him!) And then there was the time the bartender tried to pick me up while my date went to the bathroom....So many good memories out there.....\n\nAs for the patio - good place to take friends, gay or straight for a mellow night and a good place to find a friend when you're solo. The people are usually friendly (except for the night that this guy I didn't call was there with half of my gym and they all gave me the evil, hairy eyeball all night long). On a warm late summer evening, it's one of my favorites places to grab an unpretentious drink", "author": "Andy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-05", "description": "Would have been five stars if the bartender hadn't given my dates attitude.\nThis place is a gem, the crowd is mellow and lesbian-friendly and the drinks are really cheap for the Castro-Church scene.\nI had no idea this was where all the chill lesbians hang out.  No one was trying to \"outcool\" each other, everyone was just trying to have fun.  There were a lot of groups there, but the place still was comfortably un-crowded.  The patio seemed nice, but it was too cold to enjoy it.\nAs for the bartender with the ponytail, it was early and the place hadn't even gotten busy yet, and he gave my friends attitude about deciding what they were ordering.  Next time we'll be at the other end of the bar.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-24", "description": "Loved it! Went there after work with some coworkers and discovered the awesome back patio area. Lots of greenery, places to sit, and... was that a koi pond? Sweet.\n\nGreat low key atmosphere, great people... will definitely be going back.\n\n(update: embarrassingly corrected my spelling of 'koi'... thanks, keane!)", "author": "Tara B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-01", "description": "SF Food Inspection Score: 92\n\nI really enjoy coming to the Pils because it's rarely crowded and it's straight friendly with gay appeal. \n\nThe other day, I was struck with a pleasant surprise...\n\nAfter a 16 hour shift, I head over to the Pils with a co-worker and we went to town on the drinks! And how else do you end a looong day? You gotta have a Bloody Mary.\n\nNow I've had my share of Bloody Mary's. But this by far is the BEST one I've had. Don't get me wrong, I love ZEITGEIST's version of the drink. But I can rarely ever finish them because they're so big and so kick my ass. (I know, if I can't handle the heat, get out of the bar...what?)\n\nBut anyway, this drink was well done: perfect portion, all the flavors were melded flawlessly, and it had of course my fave topping of all, lots of BIG OLIVES!\n\nAnd the location of the Pils (don't you hate that nickname now?) is great. Right on the corner of Church and Market. Great for people watching. But if you want some outdoor/back door action (no pun intended), they have a beautiful back yard set with a pond of koi fish!\n\nAlways a great time here.", "author": "Kristina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-27", "description": "I love the patio here!  I absolutely love it.  The crowd was random, but had a good mix.  The drinks were pleasurable, and fairly priced.  Gentleman Jack and Coke was only $6.  There is plenty of room here, and the place wasn't too crowded.  \n\nI'm not convinced I adore this place, but it certainly is a change of scene.  I would certainly come here again.  If you want to spice up your bar choices, check out Pilsner.  Just think, right across the street is Sparky's if you have a hunkering for food late at night, too.", "author": "Brent A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-20", "description": "At one point I found this western styled building or bar to be intriguing so I gave it a chance and walked into the saloon styled bar and it felt very \"cheers\" like , until people started talking and I found most to be very unintelligent and quite rude when I came to interact with them . My last appearance there was two weeks ago on a Wednesday around 4pm. I was treated with total disrespect by the bar tender and his bar friends which most were x drug addicts. I removed myself from the group of x drug addicts after they told me to go back to pacific heights where i belonged and I wasn't wanted at their bar. I went to the front to finish my beer and the bartender was \"were you rude\" to my friends ? I then explained \"no\"  I removed myself from their chaos of drama.  He then gave me my money but kept the tip lol but as I walked out we exchanged words as I explained he was rude and I'd never would come back. He then decides to rally his friends at the end of the bar and tells them to say \"tell him he looks 50\" and being no where near 50 I found it to be so childish . It was like kids bullying the different kid for being himself. The bartender was very unprofessional even if I were the so called victimizer which I was not . If you like trashy x drug addicts and bartenders that ignore their customers by allowing them to smoke weed on the back when a children's school is directly above the bar. Again I do not recommend this bar unless your looking to use the bathroom which is beyond dirty. You Can't pee without privacy or someone looking at your junk at the mirror located directly across from your junk. Oh and let's say one time a girl decided it was okay to lift her dress and piss In the pig feeder your expected to pee into. Again trashy bar and staff!", "author": "Zeo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-12", "description": "Went down for last week's DYL night and it's an OK bar. Good selection of beers and spirits, friendly bar staff and it didn't get too crowded, although I left fairly early.\n\nThe pool table is there, although I can see playing would get problematic if the bar is more than 50 per cent full. There's also a garden out back for smokers.", "author": "Iain T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-12", "description": "This is a great bar for before/after dinner on Church Street, or for getting out into the Castro without much of a scene. Rarely have to wait for a drink. Fag hag friendly. They used to have good drink specials but something happened to them.\n\nThey could make some improvements to the patio area, but it's a nice alternative to the usual crowded back area.", "author": "Ian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-25", "description": "The best gay bar to take straight people to. I Love Chow and Pilsner both, and the fact that they are next door to each other is one of those entropy or synchronicity or whateverity things I love about Frisco. All my out of town visitors are brought here for drinks, followed by dinner next door. I'm always happy when the wait at Chow is long, because it means more time at Pilsner!\n\nThis is one of the nicest pubs in town, great atmosphere, jukebox, staff, pinball, pool, smoking patio (for whatever you like to smoke), and penguins. Most \"Sports Bars\" in this world would kill to be able to duplicate this ambiance. Window seats are a bonus for people watching along Church. \n\nOn busy nights the bar out back is open too. I like to watch Midwestern or Texan people's faces when it dawns on them that they're in a 'gasp' GAY BAR! Then they immediately realize it's not so bad after all and that Reverend John Piggy (Hagee) is a lying fuck. This is also a great place for unthreatened straight guys to meet the fag hag of their dreams (if only for one night). \n\nSeriously, if I lived nearby this would be my only hangout. I imagine this is what Castro bars must've been like in the old days before people like Les Natali had their way.", "author": "stephan k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-07", "description": "Throwing back Hoegaarden while playing pinball is a ridiculous way to end the most nervous night.", "author": "Fish F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-08", "description": "The Pilsner Inn was a great place to hang out with friends during a birthday party. Unfortunately the bartender Tommy was not friendly and made the bar not fun for anyone. Maybe he just had a bad day but the other staff refereed to him as \"Grumpy\". Get over it Tommy you are a bartender and you job is to make the customers happy. We would have had a much better time if Tommy wasn't working.", "author": "Dustin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-06", "description": "I like Pilsner because my 32\" waist isn't considered extra large as it is at many of the other gay bars in castro. I like Pilsner because of the outdoor patio where I can get some fresh air and enjoy a long conversation with a friend or total stranger. I like Pilsner because the drinks are affordable and usually poured heavy. I like Pilsner because of the Puffin-themed decor that seemingly makes no sense. I like Pilsner because Pilsner likes me.", "author": "Wayne F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-16", "description": "holy crap?!?! this is a gay bar?!?!? i was at a gay bar? \n\nnow it make sense. there WERE a lot of bald headed dudes there. \n\nloved the patio area.\n\nwatermelon beer on tap? nice.", "author": "Euge L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-16", "description": "Oh, Pilsner. Home-away-from-home; Desi to my Lucy; mother, brother, secret lover. If going to the Pilsner at the exclusion of all other bars is wrong, I don't want to be right. Except I'm totally right, because the Pilsner rules. \n\nConsider the facts: it has the nicest, hottest, hard-drink-pourinest bartenders in town. The patrons are (generally) local and polite. They have a wide variety of high quality beers and liqour, served with a smile. \n\nDo they have a patio on which to smoke? Why yes, yes they do. That is where you will find me most waking hours. Do they treat smokers like pariahs? Why, no, they do not. They (shockingly) understand that some people like to have a little nicotine with their liver damage. They will even empty your ashtray for you if you ask nicely. What's not to love? \n\nPilsner is a great bar, with cheap drinks, a friendly staff, and a neighborhood atmosphere that is unpretentious. It is literally where everybody knows my naaaa-aaame. And they're always glad I caaaa-aaame. \n\nCome by for a drink sometime! Just don't sit at my table.", "author": "Noelle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-27", "description": "I love the Pilsner for what it is: a low-key nonpretentious gay bar that you can take straight friends to or just relax.  \n\nDrink:  There are a good number of beers on tap.  Beer is reasonably priced although not dirt cheap.  They have wines by the glass, but I stay away from it here.\n\nVibe: The best seats are in the window alcoves which seat ~5 people and gives a nice view on to the street. There is a great back patio for when the weather is warm.   Music from the juke box is generally okay to good.\n\nAlso, they have the strangest penguin theme if you look around at some of the art and statues on the walls.  Sometimes I try to figure out if this is a joke or whether the owner just has a penguin obsession.", "author": "Jeff A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-15", "description": "Great great place! And I work next door and live down the street, so I get to frequent this place. Truly a neighborhood bar.  The kind of place where you know the bartenders(heart them all!), know all the regulars, had a few too many after a break up, have good fun times with a group of friends at the picnic table on the back patio (BEAUTIFUL PATIO), got kicked out at closing time, but felt the love! LOL \n\nAlways a good crowd, cute, and friendly, fun, great place to hang with your neighbors.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-15", "description": "Finally a gay bar where I feel comfortable. By fairly random chance, I ended up here 4 times in one week, enjoying the remarkably different crowds that can be found on different nights. The patio is comfortable, even on Saturday night, the crowd isn't too overwhelming, and most of the people I've met have been friendly.\n\nThe only reason I didn't give them 5 stars was the night I was there at closing time. First, a guy walks through the patio announcing \"patio closes in 10 minutes.\" So, figuring I had time, I lit up one last cigarette. No sooner had I done so than another employee starts announcing \"patio closes in 5 minutes.\" By the time I'd taken my third puff off the cigarette, the first employee had turned to my friends and I and said, \"we're closing the patio now, can I get you to head back into the bar?\"\n\nWhen I shot back, \"I thought we had 10 minutes left.\" The guy said, \"nope, we're clearing it out now.\" I said, \"I lit this cigarette when you announced ten minutes.\" \"Well, you can smoke it up front right next to the entrance to the bar. We just want to get people moving because it will take us 10 minutes to get everyone out.\" Riiiiiiiight. I glanced around and saw a total of 5 other people left on the patio. Yup, clearly an unreasonable mob who would be stubborn and impossible to move. Yeah, I get that they were anxious to get out of there and end their shifts, but talk to me like an adult. Say, \"we're closing the patio now\" in the first place, rather than this \"10 minutes\" crap. I wouldn't have complained if they hadn't made a misleading announcement.", "author": "Jere K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-24", "description": "A down to earth and unpretentious bar. \n\nIt is at a convenient location for non-drivers because you could take buses, street cars and Muni to get there.  The parking could be difficult from early evening on because it is located on Church and Market.  Try finding parking on Delores Street.\n\nThis is another option when you want to get away from the Castro which is walking distant (10 minutes).\n\nIt is also a nice place to have a drink while you wait for a table at Chows (which is a nice restaurant next door).", "author": "SFGAM d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-11", "description": "Yes, its a gay bar and, no, I'm straight.  Though I have been offered free drinks by hopeful gay San Franciscans, I don't ever feel the atmosphere of predation that I do in many Castro pubs.  \n\nI've lived near this joint for almost 2 years and it has become my neighborhood hangout.  The bartenders here and extremely competent and attentive (their long-islands are surprisingly good compared to bars like Dalva's and Double Dutch ... ie delicious but toxic) and I have been able to give back the wrong beers, even on busy nights.  If you live with or date a smoker (I sadly deal with both), there is a back yard area that always has a seat and allows smokers to indulge their habit without disappearing every 20 minutes and there no TVs back there!!  \n\nDon't bother with the pool table ... its always busy and the pinball machines are rigged in my opinion, especially that damned Monopoly one.  Keep your eyes open for deals and special events; because the prices are a little above average and this place is really worth experiencing when discounts are available.", "author": "Justin T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-20", "description": "Penguins. Testosterone. Penguins. Nicely made but pricey drinks. Penguins. Play Lotto here! Penguins. Pool table in use. Penguins. Nice patio. Penguins. Stoic but not unpleasant bartender. Penguins. Ladies room key on a big metal spoon. Penguins. Too beautiful a day to stay long. Buh-bye penguins.", "author": "Poet D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-31", "description": "I came here for DYL a few weeks back. Not bad, but not great. The back garden/patio area seemed nice, but it was a bit crowded, even though it was only 6:30. The bartenders' attention was a bit difficult to get (for a bunch of us, not just me), but they also didn't charge me for my club soda like some other places do.\n\nI guess I'd go back, if someone wanted me to meet him/her there, but with so many other bars in this city, I won't be rushing back.", "author": "Katie I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-17", "description": "Where can you:\n\nwait for a table to dine in a different establishment\ngawk at men with men\nwatch sports\nbuy lottery tickets\nask for the bathroom key, and the key chain is the cumulative size of Rhode Island\nsing ABBA\nplay pool\n\nIt's a good time. Bring your friends.", "author": "Rene D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-10", "description": "Pilsner is a great place to grab a beer, hang out, and talk when you kinda want to do Castro, but don't. They have a great random jukebox and selection of beers on tap. Just take the plunge and get a pitcher if you plan to be there awhile.\r\n\r\nSmokers or no, the patio is nice and inviting... wonderful to just sit and kibbitz for awhile. But seriously, why does the inside have to smell like feet?", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-20", "description": "A gay sport's bar? Who da thunk it? But yet it exists. The patio is really nice when the weather is good. It's spacious, covered, and well landscaped. I have less favorable opinions of the inside of the bar. It feels divey and uncomfortable. \n\nThe drinks are decently priced, but I sort of hate it when bars charge $3.75 rather than $4 for a beer. Yes, it's cheaper, but then I feel the urge to tip with the quarter and keep the dollar for myself. Totally evil of me, I know. \n\nI'm not gay, but in terms of the dating scene for my gay friends, it's a good spot. The gay guys are usually more friendly and less lecherous, but still hit on my friends, and for the gay ladies, there are lots of lesbians there on days when the weather is nice.", "author": "Netty L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-18", "description": "So long Transfer and hello Pilsner!\n\nIt appears that if I'm in need of a beer in the neighborhood and don't want  to hit up Haight Street, I'll now be frequenting the Pilsner. Great outdoor patio, nice casual crowd, friendly bartenders and no stinky bathrooms. Huge plus for the fact that it's a gay bar and a comfortable one at that. No pretense here. Get a beer, relax and catch up with your friends.\n\n\nps. Even if The Transfer does get a facelift, I refuse to frequent a place called The Bar on Church. Bad move, BOC.", "author": "Corey F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-07", "description": "Best gay bar I've been to in the city hands down, or up, or wherever you wanna put them. They have a good selection of beer on tap, cute penguins on the walls (anyone know why?? ), and cheap beer.\n\nThe crowd here was very diverse, unlike most bars in the Castro. We weren't the only non-gay men there!! I love gay men though.. I'm putting that out there. Who else will tell you \"you have a wonderful pony tail\" when you need to hear it? Also, there were a interesting group of gay clowns (actual clowns) which made for interesting conversations. \n\nI really like the outdoor area and the little fish pond, but wish it would have been heated because it was a bit cold to stand outside. Next time I go to the 'stro for happy hour I'm going here!", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-09", "description": "I had a bitter fight here with my best gay friend a number of years ago (over whether the Inner and Outer Mission is contiguous. Ahem, it is not). The friendship has persisted and I'm glad I had chance to go back and rid myself of the bad memories by knocking down pitchers on a sunny day in the patio.  It's a mixed crowd. There's long benches along the wall and we scored the picnic bench. There's also a metal table with three plastic chairs.  Pitchers, $15 for premium beer.", "author": "Vanessa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-09", "description": "Love this place for a beer. Good place to grab a beer after work and chill. \n\nVery low key which I love.. its more about having a beer and talking with friends.\n\n:-)", "author": "Art A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-09", "description": "I love the non-Castro-y feel of the Pilsner.  It's laid back and comfortable with a good eclectic mix of different kinds of music on the juke box.  \n\nThe back patio is a big draw too.  I've spent hours hanging with friends.  I've seen people who saunter out into the back with a beer and a book and settle in for some down time alone.", "author": "Jen I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-19", "description": "I've been obsessing over Fat Tire Amber Ale lately.  Yeah, yeah, yeah, I know it's the trendy beer du jour, but still -- it tastes really good, and that lovely amber color.  Plus the fact that New Belgium Brewing is a very eco-friendly company.\n\nSo, I go down to the Pilsner Inn for a couple of reasons.  It's a gay bar that's very straight friendly.  They show sports games on the televisions.  And they have a wonderful selection of beers on tap.  I love that about them.  Well, and the fact that the bartenders are hot doesn't hurt, either.\n\nPlus, I can have a few beers and walk the ten minute trek up over Mint Hill to my flat in Hayes Valley and only see one or two pink elephants!", "author": "Paul B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-24", "description": "Three stars alone for the lack of pretension, which is always great for a bar. However, one of their bartenders threw some serious attitude to my friend over drink prices. Hello buddy, but if your specials board is advertising $4 Absolut and you try to charge $5, you're going to hear about it, so admit your mistake and back down. \n\nAside from that, another star off for the overall bathroom theme that pervades this place. Toilet paper on the floor that sticks to your shoe and makes you look like as ass? Check! No door on the men's room so you can see them all, ahem, doing their business into a large trough? Check!\n\nThat said, it's nice to see Hoegaarden on tap and keep those $4 cocktails flowing.", "author": "Carla C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-08", "description": "Ooh, this place was FUN! I almost wish I was a gay man because they really know how to have fun - I try and I try, but I'm just not going to grow a willy or get into girls that much. \n\nWish they had a better beer selection, though.", "author": "Mi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-15", "description": "Wow. What a fantastic and amazing bar. I'm not gay and I was well aware that this was a gay establishment but as me and the fiance walked past it looked very inviting. We sat down and ordered some very cheap beers. Excellent prices all around. White Russians were 7 a piece.\n\nGreat conversations with people we didn't even know. Awesome locations (right next to MUNI church street subway).\n\nnot too busy. It's cash only so that's a drag.", "author": "Adam C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-03", "description": "THE BEST BAR in San Francisco, hands down.  They have great bartenders, a rockin jukebox, and a very cool patio with plants.\r\nDoes anyone know of an equivalent in LA?", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-31", "description": "One night, after a day of drinking at the beach, a friend and I went to the Pilsner.  We *both* fell off the benches and into the garden in back on the patio.  Lost my sunglasses -- and they were still there the next morning when I sulked in to check!\n\nAlso, soooo much fun to hang out and play pinball on any sort of afternoon.\n\nFor that, I will always love the Pilsner!\n\nHowever...I find the drinks a little on the pricey side...", "author": "Dwayne A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-17", "description": "It can be a little bit of a loud space in certain parts of the bar (hard to talk to others) but it's cute. Very \"homey feeling\" and welcoming. Plus, they got my Wyder's Cider (pear flavored) and I love that some goodness, ya know?!\n\nCheck it out. It's a good place to go if you want to just relax and hang out...not one of the places that you might want to visit if you are looking for some place to \"be seen\" (because everyone here could care less who is there...they're all just relaxed.)", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-14", "description": "worst bar in the city.  i'm not gay but i used to stop in to grab a beer since i live close by.  they used to treat me like garbage because i dared walk into a gay establishment with my girlfriend.  it was like oh no, she has a vagina.  well, mr. bartender from redneck land your in cali now.  women live here too as well as do straight men.  don't be threatened because i dared walk into your establishment with a woman.  i thought this was sf where we accept everyone!  go back to your redneck land and see how you like it there.    \n\nanother major drawback is the men's bathroom.  i know it's a gay bar but leaving the door open and putting mirrors over the toilets so the bartenders can check out the dudes while they are pissing should be a crime.  it might be.  \n\none final drawback is all the pot smoking in back.  ah pilsner.. you can't smoke in bars anymore, why do you think smoking pot is ok?  stupid place, bitchy bartenders, terrible service = TOTAL SHIT HOLE!", "author": "T D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-29", "description": "Fun Bar with lots of gay men. We had alot of people meet of there because: 1) central location 2) Large outside garden patio where you can smoke and 3) I don't know what three is but you need things in threes!\n\nDrinks: standard and moderately priced\nLocation: Central with a beautiful garden\nPeople: All 30-50 gay men\nDid I just repeat myself?", "author": "Rory V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-05", "description": "All time San Francisco favorite. Too many lost evenings accrued there. Although it can get very crowded, and quite intrusively noisy, it's a great local romp and a convenient location to and from your nightlife.\r\nLong bar, pool table, outdoor smoking patio...so cosmopolitan in a dive. Make friends with the bartenders, hooked up for life.", "author": "E.Mo. .."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-28", "description": "when did the bartenders dictate the tips they get?\ni guess today was it.\n\nas I left the bar the bartender said i left change on counter. i replied it was for him. he countered its an insult, my reply, i see you only take dollar or over for tip.\n\nyou'd think anyone would take money when they can get it. \n\nthis occurred today wednesday afternoon 3:30\n\nbuzz cut hair, brown, small framed white boy.\n\ndont go there this time of day.\n\nHe's a pig", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-16", "description": "Of all the bars I visited during my vacation in San Francisco, the Pilsner Inn is my favorite.  The outdoor patio is beautiful and spacious, though if there's not much breeze it can get a little smoky.  Inside is a friendly atmosphere, a pool table, and several pinball machines.  The rotating lineup of beer and drink specials, is great, especially for a fan of draught beer like myself.  Friendly bartenders and a prime location right in front of a stop for the J Muni line, with Market St. just around the corner, round out the Pilsner's charm.\n\nIt never got crowded, even on Saturday night, which was half the appeal, given the small size of most San Francisco gay bars.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-02", "description": "My friends like this place a lot more than I do - just not really my scene.  The only way I can describe it is to say that it always feels \"dirty\" - and no, not in the fun \"dirty\" kind of way.  Parking is dreadful so definitely take a cab or Muni.  Drinks are good and the patio in the back is nice.  People always tell me they go to Pilsner because it is something different - I must be missing something.", "author": "prior O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-20", "description": "This is pretty cool laid back bar in the Castro where you can get a beer and not have to fend off an attack from people just looking to go home and f***.   Not that there is anything wrong with that.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-14", "description": "This is a funny little bar. Some say it is a gay bar. I say it is more of a waiting room for dinner at Chow on most busy nights. It is also a smoking lounge to save you from the harsh San Francisco wind tunnel that is Church Street (they have a fairly sheltered back patio). You get a complete cross culture in here. I have seen it all....including things I didn't ask to see since the mens bathroom is pretty damn exposed on many nights, leaving the men pretty damn exposed as well.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-18", "description": "Forget waiting here before Chow, cause Chow, well, blows. But the Pilsner is a great gay bar that actually has a little thing called ROCK N ROLL on the jukebox and decent drink prices and, and, wait for it, A PATIO! I wish all those pathetic souls waiting for Chow's food would wait somewhere else, thank you.", "author": "patrick g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-27", "description": "As one of those 'pathetic souls' waiting for a table at Chow, I find the atmosphere here to be less oppressive than in most gay bars, maybe because the majority of the clientele appears to be here for socializing rather than heavy cruising. I've been known to return after dinner to relax on the patio out back, wondering if there's anything more pathetic than someone who feels the need to call others pathetic, simply because they don't share his inexplicably bad opinion of the outstanding restaurant next door.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-29", "description": "Pilsner is great.  There's no pretense and the guys are actually hot.  Not hot in a primped out Castro kind of way, but hot in an I've got nothing to prove kind of way.  Also the men here are not recently turned 21.  Thank god.  The back patio is about as good as it gets for outdoor drinking.  It's always quiet enough to hold a conversation, but it's never boring.  The diverse crowd sees to that.  Just sipping a beer in back and eavesdropping can keep me entertained.   Also, I think I've actually had more conversations with strangers here than anywhere else in the city.  Ultimately that's the reason you go out, right?   Otherwise we'd all drink at home.  So yeah, Pilsner's where it's at.", "author": "Ben R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-22", "description": "The Pilsner is one of my favorite spots to meet up with old friends after work.  It's got a diverse atmosphere, the staff is friendly and if you like beer they have a lot.  My favorite thing about it, though, is the back patio which on a nice day is a real treat especially for San Francisco.", "author": "Sean O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-19", "description": "WHAT?! A bar near Castro where peopel don't stand around as though they're about to audition for Vogue magazine??!! NO!! IT'S IMPOSSIBLE!! I DON'T BELIEVE IT! Well, believe it or not it's here. Pilsner Inn is a great chillin' bar with a patio where YOU CAN SMOKE! Not a scene bar, you're a bear? You're into leather? Are you a twinky? A 56 year-old jock? Everyone is welcome here! The drinks are reasonably priced too. See ya' there!", "author": "Javier G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-14", "description": "I've been going to the Pilsner off and on for many years and it has always been consistently a good place to meet friends, chill out and catch up. The bar is very unpretentious and friendly. The crowd is very diverse. The music comes entirely from a jukebox which is fine. The only downfall is that is off the beaten path from the Castro, but kind of gives it it's unique quality. Its not like Badlands, Midnight Sun or even Moby Dicks.", "author": "Clive L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-04", "description": "Since my regular fave neighborhood bar Amber died, I come here now.\n\nIt's a mixed crowd somedays, pool table is a bonus.\n\nThe smoking patio is roomy, and often packed on nice days.\n\nThis is a decent place to hang, and I used to come here more often back when (those of u who live in the neighborhood know what I'm talking about)\n\nThere was a restaurant called Hong Kong, i soooo terribly miss that place!\n\nBut I'd hit the pilsner after a huge bowl of chow mein.\n\nAlso, it's pretty rad during football season on Sundays. If u r into that sorta thing", "author": "Kristin Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-13", "description": "Great place.  Relaxed, friendly and comfortable.  I've never seen it too crowded or too empty.  I usually run in to a bunch of old friends here as the place invites hanging around, while kind of repelling attitude at the door.  The patio is lovely even if you don't smoke.  I also have a bit of a soft spot for for the intricate and titillating but ultimately harmless rituals surrounding trough urinals.  Ha.  Half a star off (I rounded down, sorry) for not being really EXCITING.", "author": "Scott K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-15", "description": "Chill environment with no attitude - a definite respite from the sights and sounds of the Castro.  It has a nice patio out back, and a number of tvs that were tuned to football, not cheesy dance music videos, the last time I was there.", "author": "GeneR S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-07", "description": "First, I am surprised that this place is described by others as nothing but a gay bar. True, most of the clientele are guys and, true again, most of them are probably gay - dunno... don't ask... but to me this is a drinking dive first and a gay bar second. (It should be said that I have tried to clarify my position on this as I have taken some heat for daring to suggest that this is not a gay bay. I guess I am just saying that it is not one of those scary gay bars where the gayness is jammed down your throat.)\r\nSecond, I am surprised that there are so few reviews for this place - although, perhaps not... it's never that crowded - in all the times I have ever been in there, there has always been a full bar, but plenty of places to sit or stand and down a few with friends. Not sure why that is, given the convenient location - but I am not complaining - more room for me and mine.\r\nLast - I love this place - this is a easy-going, relaxed place to have a few drinks. Park in Safeway's car park for a couple of hours, order a Newcastle Brown Ale, go out on the patio, and pass the time or catch up with friends. Nice.", "author": "Kingpin X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-10", "description": "Nothing about Pilsner Inn really stands out, except perhaps the relative lack of pilsners on tap. However the outdoor seating is really nice, great place for a drink on a warm SF day! The bartenders are all very nice, and they do pour very generous drinks at very reasonable prices. There are plenty of places to sit, and it wasn't overly crowded on a Friday night. Either I'm blind, or this place really is super \"straight friendly\" because I didn't realize it was a gay bar! If I was in the neighborhood and wanted a drink, Pilsner Inn would definitely rank highly on my list.", "author": "Will A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-13", "description": "Sorry to say that I've experienced discrimination here.  If your straight or just not outwardly gay, you will have trouble getting a drink. I sat at a bar with not other customers for over 15 min for a beer because I am not a hip, gay lesbian..or cute guy.  I felt hostility when we finally got served.  Weird, If the straight community acted like this..where would we be?.. oh well", "author": "M L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-31", "description": "this place is great for the things it *doesn't* have:\n\n- no pathetic excuse for a dance floor.\n\n- no shitty music blasting on a pathetic excuse for a dance floor.\n\n- no cover required to get in the door to try to muscle your way to the pathetic excuse for a dance floor to be assaulted by blasting shitty music.\n\n- no line outside you have to wait in to pay to get in the door to try to muscle your way to the pathetic excuse for a dance floor to be assaulted by blasting shitty music.\n\njust a cool little pub with a nice patio out back, laid-back atmosphere, a pool table and an overall aversion to pretense.\n\nbring some friends, grab some beers, head out back to the patio and have some good times together.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-04", "description": "I don't know about this one.\nI used to like it. I used to hang out there with friends. There seemed to be a nice, laid back crowd. Attractive in a non-Vogue (to reference an earlier review) and fun. It seems that every time I have been lately, the clientele is spotty at best and the music choices are downright awful. And, is just me or does this please always feel a little dirty, (and not in the good way)? Hmm. And then there was the night I saw the bartender punch one of the patrons. Oh well, not my scene anymore I guess. As they say in New England \"takes all kines...takes all kines [sic].\"\nAnd while I'm at it, can't we have someplace that has a NON-SMOKING patio? There are people who like to sit outside with a drink and enjoy the fresh air - not inhale second-hand smoke. I know, I know - the persecuted smoker and all that. Whatever - move to Des Moines then you can smoke wherever you like. (No offense meant to lovely Des Moines)", "author": "Jamie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-23", "description": "Cool bar, mixed crowd and good jukebox. Drinks were strong and the staff was very personable. Laidback vibe all around. Also can drink and smoke simultaneously. A rare treat in the city.", "author": "Jerry M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-07", "description": "This is still one of my favorite hangouts on a warm sunny afternoon or a rainy cold day. I always have a good time just sitting with my friends or reading a book. The staff is always great.", "author": "Travis H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-07", "description": "Great bar.  Nice outdoors seating. Nice window seating for watching the street.  Friendly and attentive bartender.  Cool scene/crowd of folks.  Yes, lots of gay men.  No, no pressure to be gay to be there.  I will definitely be coming back.  Also sports screens, but I don't care.  Also pool table, which I do care about.  Overall yay!", "author": "Heidi P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-25", "description": "I love this place.  I'm so sick of the Castro becoming yuppified - all of my old favorite joints have been ruined (Badlands, Detour, etc) but this place still rocks.  The bartenders are all nice (and cute, especially Warren), there is NO attitude, and people are way laid back.  Plus there's a patio so you can smoke...", "author": "Jay L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-14", "description": "Your neighborhood bar where everyone knows your name....maybe it's time I find another place.  Very friendly bar, great service, LOVELY patio in the back for smoking, and often some good games of pool going on.  A very nice escape from the typical Castro crowd.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-08", "description": "I love the Pilsner. It's laid-back and unpretentious, and the drinks are stong and cheap. Cute guys, too. And they have a great patio.", "author": "The Other Jeff A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-21", "description": "My best friend, god bless him, loves to drag me around to the gay joints around town. Unfortunately, as a breeder these joints all seem to fall into two categories for me: (a) two dimensional trite characterizations of what a gay bar/club \"should\" be --think Cher/Madonna/random assorted bad dance music-- or (b) a grope scene (sugar, I'll let you know if I want you to touch). So, when we recently dropped into Pilsner for the first time I found the place to be a breath of fresh air despite being a sports bar. The jewel here is obviously the outdoor patio out back, but even inside (the few times I've now been) the place has a low key/laid back mixed friendly crowd (like the lounge Lush). Contrary to another review or two on here I found the drink prices to be on the lower end. The downside? I found the pinball machines to be a tease... the table we played had craptacular action.", "author": "Rob S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-06", "description": "Totally my neighborhood bar.  A great place to go to avoid the typical Castro crowd and bring your hetero friends for a level playing field.  My co-workers are actually the ones usually suggesting to go here for a happy hour on Friday afternoons so it's gotta be good for something.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-07", "description": "definitely my style gay bar.  it's so nice to hang out in a place that's not jammed with posers (unless everyone there is posing as a non-poser). the heavy-pour drink specials are easy on the wallet and at least a couple of the bartenders are easy on the eyes. it's never been jampacked when i've been there, and that's a definite plus.\n\nhow refreshing to have a non-scene gay bar that's not a bear bar (though everyone is clearly welcome). yay for pilsner.", "author": "Sidney B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-05", "description": "When I moved into the inner Mission area in 1995, the Pilsner Inn was not a popular place. Over the years, and particularly after the smoking laws changed and Chow opened next door to it, it turned that corner. It has a CD jukebox, pool tables with decent, friendly competition, and a very good outdoor courtyard that accommodates smokers and non. Heat lamps help ward off the cool SF nights.", "author": "Jim G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-14", "description": "Had my first date here with the last good bf. This was back when it was pretty diverse crowd wise. He won me a stuffed spider in the long gone steel arm fluffy creature game....wtf are those things called? Anyhow, I like the back patio, I only go with good friends and always have a nice time convincing myself I am not a 'fag hag'. Am a bit put off by the $5 Stella, but the bar staff is so quick and right on it and the bar back is Superman quick to come to your aide with a towel when your drunk friend spills his lemontastic Hefeweizen in your eye.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "The Pilsner has definitely become my new fave gay bar. Nice mellow vibe most of the time, great selection of beers (Gotta try the Moose Drool!) and usually friendly staff. But really, it's all about the patio. I, of course, remember the good ole days when it was entirely different, but hell, for a place to hang out, drink a beer, have a cigarette and have a conversation with someone that you can actually hear, you can't beat the Pilsner.", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-31", "description": "Whenever i go, I'm surprised how they've remodeled the patio. Whether or not they've actually made changes to said patio remains to be seen, but I'll tell you one thing, they mix those drinks pretty strong.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-12", "description": "They let a straight guy like me hang out and play pinball - a fully restored Indiana Jones table - what more could you want. Someone will need to explain the mirrors above the urinal to me - what's that all about?", "author": "hunter w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-12", "description": "I'm definitely a fan of this place especially Mike who has been a bartender here since I have been going for the past few years.  I moved away for a bit to southern CA and came back and still come here for a few drinks.  He's always a gent and happily to help my friends and I.  He always remembers what I order even if I haven't come in for several weeks. Again, hit this place up if you want a low key hangout and a drink.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-19", "description": "Can't say much for the inside but this is a great spot to grab a beer while waiting for a table at Chow.  Just make sure you head out back to enjoy that brew on the awesome patio.", "author": "Kyla B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-03", "description": "because there was a 10-15 min wait for a table at Chow's next door, our hostess suggested we can wait at the Pilsner and have her fetch us when our table would be ready. It was packed inside and it was too windy to wait outside, so off to the Pilsner we went. I ordered a pint of Sam Adams to sip leisurely for the 10-15 minutes we'd be in there but as soon as our pints arrived, our hostess walks in and says our table is ready! She noticed the full pints in front of us and said \"I can get you in 10 minutes when you're ready.\" and so we had some time to enjoy our beer while we anticipated ginger cake. haha. The bartender was friendly and the beer was cheap and i left a little tipsy after leaving my tip on the counter, yah-yuh", "author": "kristin e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-15", "description": "While the inside of this Castro spot feels like a sports-bar with lot of unwanted neon signs, the beer-garden in back is a wonderful little oasis.  A great spot to have a beer on a warm night before getting dinner at Chow next door (if you're waiting for a table at Chow, this is the way to go.  The hostess/host at Chow will come get you in the garden when your table's ready).", "author": "Debbie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-23", "description": "As an avid pinball nerd, and a fan of relaxed bars, I find The Pilsner Inn to be the best possible bar. They have three pinball machines, and a wonderful patio out back for smokers, friends of smokers and fans of the outdoors. My favorite thing about the Pilsner is the relaxed atmosphere. It doesn't feel like a meat market, nor are the other customers unfriendly. People are friendly, and kind and seem to be having a good time.", "author": "Jordan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-09", "description": "Great centrally located local bar, gay bar, yes, but hetero friendly.  They don't have happy hour ( I asked) but they have regular specials all the time.  Great outdoor patio with a fish pond, plants, tables and overhang.  Inside, there is a pool table and juke box.  It's never really packed, but always has great service and proximity to Chow is a bonus.", "author": "regina k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-06-24", "description": "I've had many nights sitting on the wooden bench by the front window or outside in the patio with my gayboyfriends where I've wanted to slit my wrists. I dunno, call it a morose vibe at the Pils. But, regardless, it's a fairly cool spot where you can smoke and drink in a nice backyard patio. Although what the hell did they do to the patio? Now it has a lame hippie-esque floor with benches where you can only sit on one level (you used to be able to sit on two levels). It sucks, but it's still okay. If you're an abercrombie boy into similar you'll like it.", "author": "Liss C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-09", "description": "The Pilsner's patio is my happy place.  And Warren's chesticles are spectacular, as are his martinis.", "author": "LeSLiE W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-08", "description": "Meh. A good place to meet up with friends for a drink before heading out to other adventures, given its central location and proximity to Church Street MUNI. Also a good place to take your straight friends when they're visiting  town, because it feels like a gay bar, but isn't too slick (e.g., Badlands), and you won't have to worry about anything unusual happening. But therein lies its weakness too: as a destination of its own, I'd say it lacks a little texture. I mean, it's not like everybody's white, but everybody is pretty vanilla. Of course I realize this is exactly its selling point for 99% of all people.", "author": "Deano M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-15", "description": "A friend took us here, claiming it as one of her favorites. It's a pretty chill bar, great for hanging out and chatting away, specifically the back patio (as long as cigarette smoke doesn't bother you). Should I start the term \"straight-friendly\"? Hell, beer does not discriminate in my book.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-26", "description": "3 Stars for being a pretty good dive bar.  But they earned 4 stars for a beautiful outdoor patio in the back.  The vibe to me at least, was Castro meets the mission.  The drink specials were also something I noticed...cause they were cheap!! And god knows I love cheap drinks ;) I will definitely be back.", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-22", "description": "Pretty low key place.\n\nLong lines for drinks and the quality of the drink strongly depended on the bartender.\n\nI was there for St. Paddy's day. The crowd's age distribution was definitely peaking somewhere between 35-45.\n\nThe venue smelled kinda bad overall.\n\nA nice little alley-ish patio on the back is great for smokers.", "author": "Jan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-08", "description": "GREAT BAR! Get off the subway, grab some dinner, stop at Safeway and then mosey on in to Pilsner. Friendly staff. Mike is a great bartender, especially on a game night. Warren is the best bartender you'll ever want to meet. The best! He can make your lousy day dissolve before your even knock back that first vodka.\nGreat jukebox. Pool and darts. And a window booth for boy watching.\n\n(And by great jukebox, I mean a hangout bar with hangout music. Dance music is great -- in a dance bar. Gay men like, and listen to, music beyond dance. No, really, they do. And Pilsner knows it.)", "author": "Dennis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-03", "description": "there's just no better way to relax than sitting down to a good book and good beer, surrounded by orchids, chain smoking outside. weekday afternoons at the pilsner offer just this particular brand of bliss. you're guaranteed to be one of 2-4 customers, and, if you're a girl, no one will ever bother talking to you.\n\npeace.\n\nso difficult to find. so readily available here.\n\n(more general comments: bartenders are very laid back and very nice, pours are decent but unspectacular, regulars are friendly, pool games are constant but competition relaxed. the pilsner gets packed on sunny weekend afternoons and some evenings, when the bulk of this review just does not apply.)", "author": "jen s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-21", "description": "I like this place a lot.  I can't say that I love it, even though I can stumble home in five minutes and it has good beer specials everyday.  The bar is low-key and thankfully there is usually no euro pop or techno pulsing.  The jukebox is good, but the electronic dart board is bunk. Be prepared for a daddy and/or daddy bear vibe and a smattering of straight ladies.   Great patio for smoking, but no sun really gets in because of weird plants hanging overhead.  Overall, the bar isn't super exciting, but its a fun and unpretentious neighborhood hangout for gays and those who love them.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-29", "description": "Nice atmosphere, pool table, patio and I've never had a weak drink.", "author": "Matt C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-04", "description": "A really mellow spot. The few times I've been there, it's has been pretty empty, but that doesn't bother me.  No blaring techno mixes of pop songs, no dancing (that I've seen), and an outside patio! When there are a lot of people there, it's the perfect dive bar to go sit with friends and talk, which is what I like.", "author": "Sam S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-16", "description": "Great outdoor patio that you can sit on and smoke your lungs away, but could this place get more expensive?", "author": "Liz E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-22", "description": "What you don't about the Pilsner!!! The Best Mimosa's in SF on Sunday's From Mike and A Fabulous Margarita called JERZ (that sounds familiar) and worth the trip to SF.  Intense Pool playing Thursday night and pool lessons Saturday morning from Tim and Bryan. A very Mixed Crowd on Friday (torelance required!) after all STR8 people have to go someplace that's not boring.", "author": "Jerz Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-06", "description": "I love the patio. Once I get there I don't really stray too far from the back unless to play a game of pool (which i suck at, but the Pilsner seems to be pretty shark-free) They also have a good selection of beer on tap. It's a good place to bring straight and gay friends alike.", "author": "Conor C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-12", "description": "Frankly the crowd at the Pilsner is friendly, gay, male, relatively courteous for a bar, more mature than the majority of the Castro and a really nice place to get a drink. They have Trumer on tap - yummy local beer - and a large selection of other beers and liquor. The bartenders have been nothing but nice to me and the back patio pretty much sells the place as one of the most stellar hang out bars in the area. I really enjoy this place as a meet up spot pre or post dinner at Chow or Home.", "author": "Jenifer G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-30", "description": "wait, this was a gay bar? i would have never known. most of the groups coming in were women and there was a good mix of people. and the tv was on sportscenter. anyways, they served ryan the biggest red bull/vodka ever so that always a plus. another plus for the phone booth. there was no phone in it, but you could go in there and actually here the person on the other line of your cell. unfortunately for me, i didnt want to hear the person on the other end and that kind of ended my night. although i was tired and wasted already anyways. good place", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-30", "description": "Way, way over-priced bar with less than competent bar-tenders. Quite a nice crowd but what a rip-off.", "author": "Matt E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-24", "description": "I've been to this bar about 5 times in the last 12 months.  Let me tell you...it is DIRTY.  Each time I go there, the glasses are so disgusting.  Today was the worst...I was served 2 drinks in dirty glasses with crap all over it, and mysterious floating objects in them.  I asked for a straw and they didn't have any. only these cheap coffee stirrers.  Bartenders (after 4pm) were rude, and obviously lacking in customer service skills.  Wont be spending another dollar here.", "author": "ang b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-18", "description": "ive only been here once and i dont know how sober i was but i know i had a blast! pinball, yummy beers and the back patio is really cool!", "author": "Britney K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-04", "description": "We stopped by after dinner at Warakubune down the street.  They play fun music in here and the bathrooms are fairly clean.  The beers are cheap and there are plenty of places to sit.  It can get a bit loud in here even with a small crowd, but you are in a bar!", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-21", "description": "I requested my friends and I come here before venturing the rest of castro.  It was a mellow place to start the evening, which was what we wanted. I didn't enjoy it as much as I thought I would, but I could tell I would have liked it more under different circumstances (it was so freezing and the outdoor area was mostly rainsoaked).  The yelp reviews regarding the atmosphere were correct (no \"scene\" or attitude, just a chill place to hang out).  I knew I'd be having some heavier cocktails later in the evening, so I was stoked they had Beck's Premier Light and it wasn't too expensive.  Can't say too much about the place.  I'll have to go again to get a better feel.", "author": "J B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-10", "description": "one of the loveliest bar patios in the city...and usually good drink specials from what I've noticed.", "author": "Kerry L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-12", "description": "when we don't know where to go we go here, so it's like the default bar.  not a bad place, not annoying, but not great.  or this is the bar we start at to think about where we'll go next.  on a good night we might even end here because it's actually decent bar, i think i'm coming to realize that i really do like this place as i'm writing this review!  good drafts and your normal selection of drinks.   go puffins!!", "author": "Monk R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-12", "description": "Laid back bar with strong drinks and good beer. They have a nice back yard area, although it's been mighty smoky lately. I tend to pop a few dollars in the the juke box, then a few into the darts and pinball machines. A good place to hang out with friends because it's not super loud.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-17", "description": "if i'm headed out with (gay male) friends, and we want a low key drink before dinner, the pilsner is it. this used to be our favorite birthday party venue- the big outdoor patio lends itself well to crowds, and the window seats are fun on weeknights- but i've somehow grown out of this now. still, the pilsner holds a special place in my heart.", "author": "oona m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-25", "description": "i was here. had two beers. or three. i can't remember. had a decently pleasant time. thought i was getting looked at a couple of times but was probably my imagination. upvote for the good times. will buy again.", "author": "Yan Biao B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-25", "description": "The second best (after the Lucky) actual bar in the Neighborhood.  If it had a better jukebox it might be tied for first.", "author": "Todd E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-12", "description": "The first time I ever went here some bum got in my face and started yelling at me. Luckily my later visits were much more enjoyable. The patio is great on nice days and the bartenders and other guys there are polite. It's a nice neighborhoody bar.", "author": "Michael G."}
