{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "Fresh bread and perfectly priced, just the way I like it. Love this place over bigger chains like Sheng Kee.\n\nMy go-tos: sponge cake, scallion bread, hot dog bun, egg/spam sandwich (I usually get this after I go for a run in the park and haven't eaten dinner and it always hits the spot. The egg isn't overcooked and the bread is a tad bit sweet - so good!) They also have tea eggs if you want another quick, salty snack.\n\nCash only. (There are BofA and Chase locations on Irving, if you happen to forget). They're open pretty late (8 PM) for a bakery, which is convenient for those that work and commute. I'll usually stop by if I'm in the area and pick up a bunch of things for breakfast. Located near the busy intersection of 19th and Irving so parking is doable, but you may need to scour a bit depending on the time of day.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Got the pineapple custard bun for $1.20. Nice and flaky on top, and good consistency custard is on the sweeter side, but not that sweet compared to American custards. It was good, but not amazing, but maybe it's different if you get them fresh. They also have a variety of other pineapple flavors, such as pineapple taro and pineapple red bean.\n\nCash only.\n\nSaw one lady with 10 hot dog buns on her tray, so maybe I'll try that next time.", "author": "Eva W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Managed to get a couple pastries here just before they closed on a Saturday night.\n\nTried a pineapple pastry which felt like a cross between a croissant and a pineapple cake and was an instant fan. Also had a slice of their strawberry shortcake; I really like Chinese cake because it's not as sickeningly sweet as American cake can sometimes be and this one was quite excellent- fluffy, not-too-sweet cake with light frosting and fresh strawberries.\n\nI'll be back to try their signature pineapple bun. I'm actually kicking myself for not getting one after seeing the other Yelp reviews, but I have no doubt that it'll be just as good as what I did try!", "author": "Harry X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "Custard-filled pineapple buns exist?! This was seriously a game changer for me and now my Uber ride history is filled with trips to Pineapple King Bakery. All their flavors are delicious and made to order, so you are served a warm, flaky bun each time.", "author": "Jay R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "If you love Hong Kong-style buns and pastries, I assure you that Pineapple King will not disappoint! They are well known for their custard pineapple buns, and they fill their buns fresh right in front of you. \n\nMy go-to order is always the pineapple bun with lava custard. The bun is super soft, buttery, and flakey on the top, and the custard is deliciously sweet. They're not too big either, so I usually pick up at least half a dozen. \n\nI haven't tried any of their other pastries, but I have heard great things about their BBQ pork pineapple buns. The combination might sound strange (salty and sweet), but it definitely works!\n\nIf you're in the area or visiting SF, I would highly recommend a quick stop. Also remember to bring cash--cash only.", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-25", "description": "Tips: CASH ONLY! \n\nI got the corn and ham bread + chicken bun. \n\nThe corn and ham bread was super salty. It was more like all corn and no ham. What you see decorated on top of the bread is what you'll get. So I guess, make sure to pick one that have both ham and corn on it? It's also pretty soggy than I like my bread to be. \n\nI reheated the chicken bun but as you can see in the picture, it just seems like a mushed chicken in there. Tasted and smelled like chicken curry. Also very moist on the inside. I don't know what I expected, but it wasn't this. \n\nOverall, it was too salty and soggy.", "author": "Yuan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Best pineapple buns in SF. My family loves this place.  They're always served warm and it feels so soft and comforting to eat. The buns are fluffy but still have the right density. There's a hint of saltiness from all the buttery goodness that went into it. The matcha pineapple buns are regular buns with a matcha custard inside and it's so good. It's creamy/custardy and not super sweet. They have other flavors too like lychee, taro, and black sesame. Must eat these right away to actually enjoy the freshness of these buns. This goes for pretty much any of the buns right out of the oven. They also have a variety of other buns/pastries/desserts on the sides around the shop and they're pretty good too.", "author": "Rachelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "Buns here are fresh, delicious and almost too good. \n\nOur go to favorites are:\n\nOriginal pineapple bun - the crust is sooo perfectly crunchy crumbly buttery flaky yummy, atop a soft warm bun. If you want one warmed up with butter, ask for it at the counter. \n\nPineapple custard bun - slightly bigger version of the original but stuffed with sweet sweet egg custard. It's almost heaven in a bun.... except the custard is almost too sweet. I prefer my custard more thick eggy but theirs is more liquid sweet.\n\nCocktail bun- coconutty sugary custard filled long shaped bun.... my favorite. Here, the filling tastes on point, and well spread inside the bun. $.75 each cant be beat either!\n\nBbq pork bun - ample amount of bbq meat, soft bun, meat isn't over-glazed.\n\nBacon egg cheese bun - tasted just as it sounds, can't beat a $2 freshly made breakfast sandwich!\n\nLychee or matcha pineapple bun- lychee cream or matcha cream filled pineapple bun, filled to order at the counter! Cream was good, but unevenly places in the bun. Not sure I would order again. Pricier than other buns ($1.75 for two small ones)\n\nI just love how fresh everything is here. Although the filling isn't perfect, this place does make my favorite cocktail bun. And the prices are right. We choose this bakery over any other in the area when we are nearby.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "We got 6 amazing pastries for just over $6. We only had one person ahead of us in line at 10 am on a Saturday. Parking is a little tricky, but there are  lots of people coming and going so it works out. We originally had some reservations about whether we'd be able to figure out what wasn't vegetarian, but everything is labeled very well in English. So far we ate a red bean twist, a coconut cream, and a red bean pastry and all was good. :D I am sure we will be back. \n\nBring your cash!", "author": "Teresa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "Have been wanting to try this place for years but just never had the chance or cash on me. CASH ONLY \n\nI am obsessed with anything pineapple flavor so that's what drew me in. We got 3 pineapple buns and one coconut pastry. Everything was very cheap and delicious. We all like the pineapple buns more than the coconut pastry. \n\nThe buns were SOO good. Very fluffy and airy with a sweet crumby coating on top. Delicious.\n\nWill come back whenever I am in the area and have cash on me :)", "author": "Hayley D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "Their egg/ham sandwich is really good, and has a spicy spread that makes it moist and flavorful. I've tried their other breads, which taste fresh/soft. Love their iced milk tea (by the register) because they don't put ice in it, so the flavor stays strong. The store is very small and it's popular, so can be tricky holding a tray. Parking is tough on Irving.", "author": "Ellen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Hype is real.\n\nI can't believe they serve pineapple buns with a slab of butter in the middle. I cringed when my friend was telling me about eating this, but when I experienced this for myself, I understood what he meant by the butter complementing the bun. The saltiness of the butter goes well with the sweetness. They serve the bun warm (!!), so you have to order it at the counter (you don't just grab it like the other breads). \n\nThey also have pineapple buns with a variety of fillings. I got ones with black sesame, purple yam, and pork charsiu inside, and they were all satisfying! I ate them the following morning and heated them up in my oven. A+\n\nCash only!", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "Pretty delicious. Cash only. \nTry everything. Very crummy in that stuffing it all in your mouth results in crumbs everywhere.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-03", "description": "Good bread at good prices! Pastries are mostly a little more than $1 which is like 1/3 the price of 85 degrees. I like the green tea sponge cake and pineapple cake with custard. They don't always have their famous pineapple puff with fillings since it's so popular. Cash only!", "author": "Jennifer Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "So Japanese cute and a perfect place to stop in the sunset for a pastry. It's a whole in the wall in a row of Japanese markets but the signs outside depicting the famous pineapple bun is what gives it away.\n\n10 seconds heated up with a slice of cold butter in the middle makes a pineapple bun the tastiest pastry delight in the sunset.\n\nBuy a dozen at 88¢ each and enjoy for breakfast.", "author": "William R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "Cash Only! \n\nI got the LiuShaBao. 流沙包...\n\nSadly it wasn't running.... the bun was kinda of stale....  not flakey. \n\nI was so sad because I thought it would be so good but just very disappointing", "author": "Tony C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-16", "description": "There is a good variety of items here, and reasonably priced. There's not really any service here since it's get it yourself and pay.\n\nI'm not really into most of the items, but I tried a red bean cookie, egg tart, and mochi with custard. The mochi one was good, not too much filling. The egg tart was a little on the dry side but still flaky, and the red bean cookie was pretty dry.", "author": "Spencer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "This place has the BEST pineapple buns in all of AMERICA. The last time I had such a perfectly light, fluffy, and flakey pineapple bun was when I traveled to HK. That being said -- none of the bakeries in NYC can compare. And it was only $1 with change! It is a shame for those so called Hong Kong style bakeries in NYC. \n\nI bought 3 bolo bao to start the day - pineapple bun with butter, with BBQ pork, and with salted egg custards. I also bought a small matcha sponge cake. They were all so yummy. I wished I had a bigger stomach so I can have a few more of these heavenly good baked goods. \nI was very glad to make a quick stop here before catching my flight back to NYC. \n\nThe staff here was very friendly. I guess she couldn't believe I had all the buns in front of her. But she was very nice about it. She offered to head up my salted egg custard bun since it was a chilly morning in SF. \n\nI will definitely go back next time I am in SF for more yummy pineapple buns!", "author": "Alice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "This is my happy place. I'm always so happy to come here and I always leave with $20 worth of pastries, which I devour in 2 days. \n\nThey are famous for their pineapple buns and they have a variety of them. I like the ones with filling. If you are lucky enough to come here when a fresh batch comes out of the oven, you must buy them and eat them right there! They are so fluffy and warm! They smell yummy and taste even better! Ever since I had those fresh buns, I would heat the cold ones in the microwave for 15 seconds - better than cold but still not as good as the heavenly fresh buns.", "author": "Iris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "My friend showed me this place and it's bound to be my new go to for buns! The pineapple char sui bao is the tastiest bun I've had! I love the variety here and how they make them fresh. I'd highly recommend this place.", "author": "Helen z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-19", "description": "On a recent trip to SF, we stopped by our go-to Chinese bakery nearby, but were thwarted in our attempt to pick up some pineapple buns (which I refer to as sweet top buns, because that's what they called them in Chicago when I lived there many years ago).  Dreading the thought of returning to the Peninsula without these delicacies, I started searching for nearby places and came across the Pineapple King.  With a name like that, it's got to be good, right?\n\nWe wended our way through traffic and were surprised to find easy parking just around the corner.  We arrived to find many different version of pineapple buns, of which we tried 4 or 5.  They were all good, with a light crusty topping that was pretty good, but perhaps not as sweet as I would prefer.  Still, this place is now on my list of places to stop by - especially if my regular haunt runs out early again.", "author": "Lee L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "CA$H ONLY $$\n\nHeard many good things about Pineapple King, so finally had the chance to check it out since I was around the area. It is not the biggest place, but they have delicious pastries and more. I was going in a circle looking at every item and everything looked so good. I wish I could buy everything (I should have).\n\nThey also have like breakfast meals and drinks as well (pretty awesome!) Got a lot of pastries to go as we are not from San Francisco. Go-to breakfast or snack for a busy workday.\n\nDefinitely check this place out if you are around the area!", "author": "Martin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "This bakery was AMAZING!\n\nMy friends fro Hong Kong highly recommended this place to me and it was a great experience. I would definitely revisit and also recommend all my friends who love pineapple buns or just Asian pastries to go!\n\nI got their traditional pineapple buns and bbq pineapple buns. Both were fresh out of the oven and they tasted SO GOOD. They were not overly sweet nor oily. The buns were pretty puffy. \n\nBesides the pineapple buns, I also tried their Japanese cheesecake. Also super light and puffy, just like the one I tried in Japan! \n\nIf you haven't been, you have to visit it!", "author": "Clare L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Delicious shop for pineapple buns. Don't let the size or appearance of the establishment fool you - there's a lot that Pineapple King offers! \n\nThere's a big variety of pastries you can grab with tongs, but make sure to try the pineapple buns with filling. I tried the mini puffs with matcha filling which were 2 for $1.60 and they were so delicious and addicting. They come out hot and fresh if you order them from the counter. \n\nI didn't try other pastries but they looked pretty delectable as well. Make sure you bring cash. I'll be back if I'm in the neighborhood again.", "author": "Chelsea W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-16", "description": "UPDATE: Arrived here around 9AM-ish on Monday 1/15/18 and they had a lot to choose from! Ended up leaving this bakery with 2 big and 1 small box! Spent ~$30. And this time I was able to get their pineapple bun with sesame, custard, pineapple, taro and of course, matcha (I ordered 6 pieces this time). Ordering that many pieces will leave your car smelling so good!", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "I fuckin love this place.  The pineapple buns here are fantastic get them while they are fresh though!!! ...all i got lol", "author": "Jin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "Finally got to try this place last weekend! I got a few items - bbq pork bun, ham and egg sandwich, apple turnover, matcha sponge cake, and pineapple buns with lychee and green tea filling. I would say all the items are a little pricey, but the pineapple buns are worth it! My bf had the apple turnover and the bbq pork bun. He says that the apple turnover was not that great, but the bbq pork bun was pretty good. I tried the ham&egg sandwich and thought that it was OK, but not the best I've had. The Matcha sponge cake was OK as well, nothing too special and not the softest and fluffiest I've had. Something that I will definitely order again though, is the pineapple buns! One of the best pineapple buns I've had, but I guess it's a given that their pineapple buns are good from the name of the bakery.. For the pineapple buns with filling, you need to ask for it at the register and they make/prepare it fresh for you so you will need to wait a few minutes for them to put the filling it. I really enjoyed the pineapple bun with lychee filling, the green tea filling was OK, but I am more into lychee flavors so I will definitely get this again!", "author": "Bailey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "Mmm, this is one of the best Chinese bakeries in the city. It's also the only one that sells pineapple buns stuffed with giant slabs of salted butter, a Hong Kong snack that are the bees' knees if you like something sweet and salty.\n\nThere's never a line out this door, but there are plenty of what seems like fresh goods. I've never seen a fly in the bread cabinets, and nothing looks visibly stale. If you want a heated pineapple bun, they keep them behind the counter. I could probably subsist off of those $1.25 buns for breakfast, which I would if they weren't the opposite direction of my workplace. For every tax-free $1.25 you plunk down, you receive a gloriously hot bun, scored with that sugar mixture to resemble a pineapple, along with a solid three inches of cold butter.\n\nThankfully, those buns come out really quickly, or else you'd have a leaking, melting blob. Eat fast, because that butter will melt to form a wonderfully soft, rich bun that's good to the last crumb. Pineapple King also sells some buns to hop on latest trends, like a matcha pineapple bun.\n\nThey sell boba here apparently, but there's plenty of other boba places on Irving you should try. There's no seating and the parking is crap, but at least that's a snack you can grab and go.", "author": "Gwen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "Clean Chinese bakery serving authentic Chinese baked goods, they have both salty and sweet varieties. \n\nShredded dry pork bun is my favorite baked goods from Chinese bakeries. It is salty, a little sweet, fluffy, and tastes so good as a snack or breakfast. My husband (Jewish) loved it so much that he demanded that I learn how to make these so he could have these around the house all the time. \n\nAnother thing worth trying is the durian crepe cake. It had real durian and was not too sweet. I don't even like durian that much but the cake was so well balanced that I could not stop reaching for more.\n\nThings to skip:\nTarts, mango crepe cake(fake mango), taro balls", "author": "Tata X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-25", "description": "If you love pineapple buns, or soft and fluffy buns in general, Pineapple King Bakery is for you! We stopped by around 10:15am on a Sunday, and it wasn't super busy at that time. It also seemed like they had everything in stock, but were still bringing out new items. I tried:\n\nAssorted Buns (https://www.yelp.com/user_local_photos?select=U6xqYAoVdcARXktN4Mvi9w&userid=76vIFZcC7owykCBjMfGVXg)\n-Pineapple Puff (Matcha & Original, $1.60, https://www.yelp.com/user_local_photos?select=-vTpzL3m-gqrwsjzKQeLtw&userid=76vIFZcC7owykCBjMfGVXg, https://www.yelp.com/user_local_photos?select=kJ5HlZAgg41d5cb5Vsur0w&userid=76vIFZcC7owykCBjMfGVXg): Both were good, and I liked that these were minis. The matcha had great flavor, and both weren't too sweet. These are made to order, and served warm, so it took a few minutes to prepare. Recommended!\n-Matcha Pineapple Bun ($1.50, https://www.yelp.com/user_local_photos?select=TR1oXm8RNbVpUE0TDREJng&userid=76vIFZcC7owykCBjMfGVXg): Just ok- the matcha filling in this bun was a bit too strong. However, the bun itself was still soft and fluffy. I wouldn't get this flavor again.\n-Salted Egg Pineapple Bun ($1.55, https://www.yelp.com/user_local_photos?select=JzBsMKi034KMdczkzGfMYQ&userid=76vIFZcC7owykCBjMfGVXg): Yum! This was one of my favorites. I wish I had re-heated this so that the salted egg filling was more runny (like at the dim sum places), but it was still good at room temperature. It would be awesome if they added a bit more filling to this bun, but this is still recommended for salted egg bun lovers!\n-Sesame Pineapple Bun ($1.40): Not that great- the sesame filling wasn't sweet enough, and it was dry and crumbly. I was expecting a smoother texture in the filling. The bun itself was still awesome, and very soft, but I wouldn't get this flavor again.\n-Pineapple Bun Filled w/BBQ Pork: Yum- this was nice and flavorful. The BBQ pork filling was made well, and had a good fatty to lean ratio. Recommended!\n\nThere were so many other items I wanted to try, such as the dried pork floss bun, bacon egg and cheese bun, scallion bun, and pineapple bun w/pineapple inside. I will definitely be back to try more items, and also for their pineapple puffs, salted egg pineapple bun, and pineapple BBQ pork buns!! Metered street parking is available, but parking can be very difficult to find in this area. Luckily, there were a few spots open the morning I went.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-10", "description": "Nice bakery.\n\nThis place is real nice in terms of the food. There is a large variety of baked goods, with multiple variations of pineapple buns even though you'd normally only find one at other bakeries. For example, I had the custard pineapple bun, which had large chunks of warm, sweet, gooey custard baked into the bun. My friend had the matcha pineapple bun which had green matcha sauce baked inside. Both were really sweet and tasty. The drinks are ok--they supposedly sell special milk tea, but it tastes like normal milk tea. Not bad but not really special. The buns are what they are good at.\n\nThe inside of the store is pretty small, with no sitting room, and not much waiting room. In fact, if there are 2 people in line waiting to pay at the register, the store is already full.\n\nThe staff are friendly, and the orders come pretty quick. We ordered the drinks and it came quickly. They also heat up the buns for you if you tell them you will eat them right away.\n\nOverall, a nice bakery", "author": "Henry L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-24", "description": "Bought moldy moon cake form this bakery yesterday, what a good mid autumn day! Really wanna know when they make the moon cake, some super markets sell the moon cake from last year. I thought it will be fresh cause it is local bakery, but I am wrong, local bakery means mildew.", "author": "Wenli W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Tiny bakery but so many pastries and bread with such reasonable (above reasonable) price!  I bought a ham and egg bread. It was only $1.35 and it filled me up as breakfast. The bread had so much flavor and I enjoyed every part of this sandwich. I also ordered hot tea to go with. I didn't realize they make milk tea. I was expecting black tea but this turned out a good surprise. They make killer milk tea. I am only here visiting but I will return today again and will buy more pastries from here. Wish they have tables and chairs to sit but their small and efficient operation is keeping the price so cheap.", "author": "Aya T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "Cute little bakery that sells baked goods, sweet and savory buns, cakes, etc. They're known for their pineapple buns. I ordered 4 of the pineapple puffs. They're pretty small, kinda similar size as the ones you get at dim sum restaurants. They come in 3 flavors: custard, green tea and a seasonal flavor. I tried green tea and custard and I enjoyed them both. The buns are fresh and warm and they pump the custard in it after you order so they're fresh! The best part is that they're $1.75 for 2 puffs. Super affordable and delicious!", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-30", "description": "Came here to grab a quick snack before i went to library.. When you walk inside, it's small. It can get crowded quick with limited space especially if it busy. It's one of those places where you can grab a tray and tong and pick what buns you want from the bins around the wall and place it on the tray instead of you pointing and the workers get it for you. Once you get the buns you want, you just have to go to the cashier area.\n\nGot 2 bbq pork buns and 2 hot dog buns for $4.80. I really enjoy their buns. And of course its yummy to my tummy . Reasonable price. Decent variety of buns to choose from. \n\nWhen you go to the cashier, you'll meet a cashier who doesnt understand or doesnt know english. Probably theres one or two who knows english.\n\nThis place accept cash only. \n\nWill come back again if i ever crave for their buns again", "author": "Julie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-08", "description": "Great bakery with different variations of pineapple buns you won't find at other bakeries in the city! \n\nTHE BUNS:\n- Mini Matcha Pineapple Puffs (2 for $1.60): Perfect balance of sweetness + matcha flavor\n\n- Matcha Pineapple Bun w/ Red Bean filling: Super yummy, the red bean filling is amazing. You don't taste the matcha on the outside though so I don't really see the point of it.\n\n- Pineapple Bun w/ Purple Yam filling: My fav! That purple yam is so bomb!\n\n- BBQ Pork Bun: Different that other BBQ pork buns I've had. It was pretty good! And I think it was only $0.85!\n\n\nPROS:\n- All pineapple buns were perfectly crispy + flaky\n- Generous amounts of filling\n- Paid about $6.50 for everything - such a good deal!\n- Staff is quick and efficient\n- They heat up the buns for you if you want\n- Fresh, made in small batches\n\nCONS:\n- When I was getting a tray for my buns, I noticed some of the tongs were a little dirty\n\nNOTES:\n- Cash only\n- Small store, no seating\n- Found parking easily a block away", "author": "Debbie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "Walked in and could smell the fresh pastries! Everything looked just like it would in Hong Kong. The Macha Green Tea Pineapple Bun is the best I've had in a long time. Will definitely be back for a few dozen more items.", "author": "M P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "Yummy!! At first, I wasn't planning to buy much here but I've never tried a pineapple puff! The Only regret is that I should have brought more of the puff.. so yummy and creamy! Super cheap for pastries!", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-05", "description": "This yummy establishment sells take out only.\n\nI'm a fan of Pineapple King's baked goods. Not all but many of what they offer comes individually wrapped/packaged.\n\nMost everything is between $1 and $2. For $2.05 they have a decent Bacon, Cheese and Egg Bun. A Raisin Twist is only $1.15 and full loaves of bread as well as Milk Teas are available.", "author": "Caesar A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-17", "description": "Delicious bakery in sunset!  We always try to stop by here when we are in the area.  They are a small shop with a variety of pastries and sweets.  Their pastries are very fresh and well made.  Favorite is the taro pastry!", "author": "Hannah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "We love pineapple buns (bolo baos)! It's even better with a cold slab of butter sandwiched between it.  Warm, sweet and crispy baked outside, with a pillowy soft inside. The best ones we've had were in Hong Kong, but this location is our favorite so far in the states.", "author": "Sherry V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "I love their egg tarts and Portuguese egg tarts here!!!! Their pineapple bun, on the other hand, is just MEH. Despite their store being named after it.... They also have pretty good plain white toast - note that they have a sweet and a salty version, so pick wisely. Their milk tea is also pretty good. Ask for light sweet if you don't like it super sweet. \n\nI like coming here instead of Sheng Kee down the street. It's cheaper and better here! \n\nAlso, you can actually ask them to heat up any pastry there after you pay if you want to eat any of them on the spot :) how nice is that????", "author": "Susanna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Love their pastries! Especially my favorites coconut bun and creamy bun. Have been there many times and love the freshness.", "author": "Devan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "My new favorite Asian bakery in the city. From the spam and egg bun to the coffee cake, everything I tried was delicious.", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "The Pineapple bun with cold butter is amazing. Sounds weird, but it's famous in Hong Kong. Egg tarts are good. Cash only but good prices! I haven't tried their other things, but in general, I would not expect much from non traditional things with like garlic/meat and cheese in them (I think they are cash grab items or something).", "author": "Helen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Love their pineapple bun! Especially when you eat it straight out of the oven. The bun is hot and the butter is cold but melty. \n\nI do think they can go a bit easy on the butter, but I usually just scrape it off myself.", "author": "Kelvin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Bunz, bunz, bunz...\n\nPineapple bun is served warm with hearty slab of cold butter sandwiched in the middle. Butter to bun ratio is not for the faint of heart but this is how they do it in HK.\n\nPineapple bun with custard and matcha fillings. Each flavors comes in a set of 3. The portions are smaller than their regular pineapple buns but hey, you get 3 of them.\n\nMilk bun with cheese (the processed kind), spam or bacon, and half of a soft boiled egg, served hotdog style. If you love processed food, then try this. Otherwise stay far far away.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "I love the pineapple bun with butter! You will get it warm but it is still Good when it's cold! :P", "author": "Yuii J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-31", "description": "P-P-A-P\n\n*cue '80s-'90s style electro- key-tar plinky muzik*\n\nI have a pen\nI have an apple...\n\nUnnhh!  Apple-pen.\n\nI have a king\nI have pineapple...\n\nUnnnhhh!  Pineapple King.\n\nApple pen\n*(Lazer shooting sound effect)*\nPineapple king.....\n*(more lazer shooting pew pew)*\n\nKing Pineapple apple pen!\n:-D\n\nThat ditty should be on rotation here.  Along with peppy pop-y muzik they already play.\n\nTiny shop entices passers-by with a delectable aroma.  Pastries, breads, rolls, muffins, savoury and sweet stuff, all baked fresh.  Grab something for breakfast or snack during the day, or pick up some after-dindin dessert, as it remains open just past usual dinner hour.\n\nSelect tongs, a tray and some wax paper and start loading your goodies.  Hello scrumptious creations of flour, sugar, lots of butter and vegetable oil; my waist-line expands just thinking about you.  I got a couple of different scallion (green onion) buns, pineapple buns (one with pineapple filling, another with red bean filling), and a ham and cheese bun.  YUM.\n\nAnother great place in the Sunset to satisfy your baked goods kraving.  Pineapple King is a new-comer and somewhat competes with the well-established Sheng Kee chain a few doors away.  PK's strictly a take-away counter, though, no seating.  \"Cash only\" policy helps keep prices lower.  Ladies running this bakery are friendly and nice.", "author": "Jade T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "I ALWAYS GET THE HOT DOG BUNS WHENEVER IM IN SUNSET. Never disappoints! This is the only place I buy these inexpensive, yummy, freshly baked goods.", "author": "N P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-26", "description": "I have ordered a dozen of their custard pineapple bun and all the filling went sour the next morning.  It has happened several times in the last several months.  I would not recommend going back as it appears their custard filling has gone bad several times in the last couple of months that I purchase it.  It is only good to eat it fresh, but does not last.  They should make the filling more sweeter and thicker.  After having it go sour 3/3 times after I bought a dozen, I will not go there any more.", "author": "Jane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Who doesn't love themselves some fluffy, heavenly warm buns? At Pineapple King Bakery, you can dive into masses of heavenly tasty buns, particularly their large self-serve Cantonese selection, all of which is very dependable and quite reasonably priced.\n\nThe real gems here, however, are the mounds of deliciousness you have to order at the counter, especially the pineapple bun with butter, which got lots of love from the Chronicle recently (http://www.sfgate.com/restaurants/article/Pineapple-King-s-toasty-butter-filled-pastries-6181540.php). As if pineapple buns weren't already joyously buttery on their own, the extra-generous slab of butter inside them makes for quite the treat. \n\nWorth a visit, and while you're here, don't just try the pineapple bun with butter, but please do grab a good cross-section of their self-serve offerings to go. Sure beats, um, groping *actual* buns.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "Wow great little bakery. Cool sweets with a bunch of quirky yet delicious flavors. Didn't get to try the pineapple buns but the other sweets did not disappoint. Maybe a little on the sweet side, but definitely check out this small shop.", "author": "Dennis F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-30", "description": "Came to try the famous warm pineapple bun with cold butter as well as the custard filled pineapple buns (both original and matcha). I hate to say this but I was quite disappointed. As someone who grew up in Asia, I've had a fair share of good pineapple buns so I know what to expect. The top of their pineapple buns aren't crispy or crumbly enough and the center too moist and bland. Original custard tasted pretty bad in my opinions. Matcha was a lot better but I still wouldn't recommend it to a friend. The butter one just has way too much butter that it's very overwhelming.", "author": "Mandy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "I was walking by and I happened to see that this place had pineapple flavored buns filled with Matcha or Creme... that got me curious.\nI am SO happy that I decided to stop by! It was a pleasant surprise how good they were! I got one of each and they were warm.. melted in my mouth!\nI am from LA... and I will be dreaming of the next time I can have another one! Definitely would recommend to anybody, perfect amount of sweetness! LOVE it!", "author": "Lien N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "Everything pineapple bun! Great selection and it does taste good but service is mediocre. When you ask questions, they really don't want to answer you. So make sure you know what you want here.", "author": "Judy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "On the way to Marin Headlands, we wanted to have coffee and pastries. This place is a perfect location and offering both coffee (Peet's) and pastries. We got melon pan, taro custard pan, fruit tart, custard tart, chocolate pan, cream cheese pan. All, literally all delicious and they are cheap and authentic. Especially their tarts are so good!", "author": "Kaori M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Go for the namesake....go to the counter and ask for it, because you won't find it in the case. Hot pineapple bun with butter (or bolo yao). You just have to have faith: as unhealthy as this may sound, it is the best thing you will ever eat and you will find yourself craving more ... days, weeks, months later. And I don't know of any other pksce in the Bay Area that offers these. It's a slightly sweet bun scored to look like a pineapple (but it contains no such thing). It's made fresh daily. Sliced open and stuffed with a slab of chilled salted butter that melts as you eat it. Amazing. \nApparently they also serve them warm with custard filling, but I haven't been able to resist ordering the butter kind every time.", "author": "Kate D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "Forget golden gate bakery and their \"on vacation\" signs.  This place makes amazing egg tarts and they are open during regular business days.  I wouldn't have stumbled upon the place had we not stopped by this area for milk tea.  I was skeptical to try this place but who can resist a name called 'pineapple king.'\n\nThey had egg white tarts on display by the register but once the cashier pointed out they had fresh egg tarts, I gave them a chance.  I've been searching for a back up place for golden gate and none of the bakeries from san jose all the way up the SF produced something comparable to golden gate.  My search is over!  I had the egg tarts the moment we walked out the shop.  Since it was still warm, the pastry was nice and flaky filled with jello like creamy filling-- it was so satisfying!  I'm so sad I had only had one because I needed to make room for dinner.  \n\nThe bakery is small, so it's more of a take out spot.  They seem to small batches at a time.  Varieties include buns, desserts and cookies.  I had the pineapple and cocktail bun the next day; it was chewy and soft just as you would get it at other asian bakeries.  I'm definitely stopping by here more often when I'm visiting the city.", "author": "Dee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Ive been there Many times and the pineapple bread is both delicious and of reasonable price. I brought some for.a party and everybody loved it. They open.early and.sell milktea as.well. It is the most polular bakery Ive.saw.and a lot of customers buy a box of bread to share with others", "author": "Clare G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Bakeries here are so good yet prices much friendly than other places. We had the pineapple bun with match right from stove, so warm and delicious! Definitely will try this place again!", "author": "Yunzhu C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "Came here Sunday morning, plenty of street parking at 7.30 am when they open.  Simply picked a selection of pastries plus the special $1.99 half loaf of honey bread for a total of $10.\nPastries were freshly baked and still warm.  Tasted good, as expected but nothing really stood out.  Besides selecting pastries from the shelves, look at the menu.  I noticed some pineapple buns with matcha filling which you need to order from the counter.  I  had already picked my goodies, so I guess I'll come back next time to check them out.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "Better than Sheng Khee down the street.\n\nWhy?  Because their custard buns are a lot softer and are like pillows.  I've noticed that the Sheng Khee pastries are dry and not as fluffy. In addition, the customer service here is nice and they are customer service inclined with people whose first language is not Chinese.  I have tried numerous other buns and tarts here, the Pineapple Bun is equally good as is the Red Bean bun.\n\nMake sure you go early for any egg tarts, as they go fast and bring cash.", "author": "Miika M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "Cheap and tasty bread products? Count me in! This place delivers with its prices and fast service. It's pretty much in the style of 85C Bakery where you can select your own pastries from the case but you ask for the pineapple buns at the counter. At $1.25 each, these buns can suffice as a breakfast meal. \n\nOne bun is a sizable portion (probably the size of a brioche at Paris Baguette) and tastes good the following day! I'm in love with these tasty treats and I'm grateful I go to school a short distance away. I brought one home for the boyfriend and he happily munched away on one. I chose the pineapple bun with a stick of butter wedged inside. Paula Dean would approve! This place is great. If you haven't tried it and you don't have a gluten allergy, you should try a bun! You won't be disappointed. I know that I'll come back-- at least for the buns!", "author": "Brittany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-12", "description": "This new Hong Kong-based bakery has a specialty which is a Sweet bread called the Pineapple bread, a pineapple custard filled with a slightly sweet bread. They also offer other flavors like red bean, matcha, pork floss, cream, nori (seaweed). They also sell other Taiwanese snack bread found in other Chinese chain bakeries. Beware!, they only accept cash to avoid paying taxes and don't give receipts which is typical for a Chinese business to get more money from customers.\nYesterday, my sister-in-law bought a small box of Chinese breads and pastries: ordered Portugese egg tarts ( custardy sweet egg filling on a somewhat flaky wet and dry dough tart- average like 2.7/5 and overly sweet custard- not the best I had), cream bun topped with grated coconut - meh like 1/5. \nTonight, she ordered a big box of pastries, breads and their signature pineapple bread. Ham and green onion bread - great for a snack like 3.5/5. Pineapple custard bread - great for another snack 3.3/5. Taro pineapple bread - a taro and pineapple filling in bread roll - 3.4/5. Pineapple red bean paste bread - a chunky red bean paste with pineapple filled bread - 2.7/5. I didn't quite liked the texture and combination on this one (too heavy and chunky texture).Cream horn filled with whipped cream - ok like 2.8/5. Napoleon is a flaky puff pastry filling with light whipped cream and some chopped walnuts and powdered sugar - 2.0/5.\nYou know, what I wished they would filled their buns more filling because each bun filled about 1 ounce of filling. It was pretty sad, but still good. The prices are average for a Chinese bakery, but the quality is above average which is better than Sheng Kee Bakery. On my list of Chinese bakeries from top to bottom on my top 4 list: Kee Wah, Golden Gate, Pineapple King, and Sheng Kee. \nThis is a Cash Only place and don't give any receipts, so you better watch out!\nTry out their signature specialties like Pineapple buns with a sugar craquelin on top of a sweet roll: original Pineapple, custard, taro, red bean, matcha, nori and sweet sliced ham. Try out other bread and pastries too.", "author": "Jade M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "I simply love it. So fresh and tasty. I wish I could sample every single one of them. I will definitely go back.", "author": "Jacky C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "I was craving cocktail buns late in the afternoon/early dinner time. After stopping at a bakery and not having them, I called multiple locations. They mentioned they had 4 left and I decided to stop by after we had dinner. \n\nWhen I arrived, I assumed they'd probably only have a few left.. But to my surprise, they cooked a dozen more and were still warm when I got there. I definitely appreciated that and they were so nice! They even had other pastries that I indulged in and were mighty tasty!", "author": "Miles V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-03", "description": "Their pineapple buns are bomb. Giving 3 stars though because their other products are not so good, sometimes inconsistent, some flat out bad like 1/5 bad. I remember a few years ago I bought some orange flavored bread here and it was the worst bread I've ever had. Somehow it was so bad I started to bleed. Their matcha flavored pineapple buns are inconsistent, mostly erring to the side of awful. I bought a matcha flavored bun earlier this week and it was so darn spankin' good I came back again two days later and bought 8. These 8 are awful. The matcha tastes flat out horrible. I tried the lychee as well and as expected from most lychee products from any store, it wasn't that good. Definitely would've given 4 stars because the plain pineapple buns are good, but some of the other products are simply awful.", "author": "Alvin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "I thought it was a joke when I saw how much the total was. How is it so freaking cheap and taste so freaking good? Everything we got tasted like gold. This place single handedly ruined my attempt to cut carbs for my diet this weekend. The egg tarts, pineapple buns, and the buns with the cream inside shocked my sensibilities to the core - in a good way. Why can't Pineapple King Bakery be closer East", "author": "David Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-13", "description": "YUM, Bo Lo Yao aka HK Pineapple bun aka Pineapple bun with a slice of butter. Delicious! My first time trying it here, and it was a great experience. They toast it for you here, it's so warm and buttery when you get it. This shop is a bit smaller, but the pineapple bun was worth it and memorable. \n\nGonna come back again :)", "author": "Melanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "I wanted a good HK-style pineapple bun and this is the place I was directed to. They even have the butter!!! Now that's a sign of a HK pineapple bun! There is a small selection of pastries compared to some places but they all look really good. The butter pineapple bun was delicious and the HK milk tea was not bad either. This is my type of place, seriously. I just think it's odd that we had to wait so long to get our pineapple buns compared to other people. I think it's cause we ordered more, but really?\nAnyway, I will definitely make an effort to come back when I want a good pineapple bun!", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Stumbled upon this place looking for a sweet snack and I'm so glad I did! I got Salted Egg filling Pineapple bun and it was so good! The bread is sooo fluffy and fresh. And I love how they can heat it up for you upon request as well. For $1.50, definitely a steal! Can't wait to try the matcha version!", "author": "Carolyn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "The pineapple buns are legit. The pineapple top is probably the best I've had so far in my life. There's a nice crumbly texture to it and a flavor that probably is indicative of how unhealthy it is. No matter. \n\nMy boyfriend and I came across this place by chance when walking up and down Irving. So glad we decided to buy pineapple buns from here. It wasn't until after we left that I learned of this place's name. Yes, king of pineapple buns.\n\nPrices are decent, about $0.50 to $2.00 per shelf item. Pastry variety is comparable to 85 C and Sheng Kee. The employees could do better about placing labels with the appropriate buns. With some labels indicating time frames, I'm not sure if that means the time frame the buns were baked or the frame that they're supposed to be on the shelf...\n\nWe have and will continue to come back for buns when in the area.", "author": "Liana F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Wanting to write a review for this place. My son bought me a birthday cake back in January 7, 2015 and need a cake so badly for Friday. He saw a post on my FB page that I wanted the PKB Special - Matcha Green Tea Cake with Chocolate Ganache topped with French Macarons. \n\nWhen he arrived there he ask them if he can reserve the cake and pick it up the next day. My son told me they did a little customization to the cake which is a plus. \n\nHe surprised me with the cake when I got home from work but, I couldn't enjoy yet because he had to work over the weekend. I saved the cake until Monday cause I didn't want to cut the cake alone. \n\nAfter 4 days the cake was still fresh, moist and the fruits were still fresh!!!! I couldn't believe it. Look like we just bought it. The macarons did not became soggy either. I can tell PKB uses the freshest ingredients! I'm so amazed how long the cake lasts. It took us 7 days to finish the cake and it was still good. The fruits did not go bad either in which places I have experienced in the past the fruits lasts 3 days max.\n\nI would recommend this cake is so delicious. I will see if they can do a customized cake or customized macarons for baby shower. This is my new favorite bakery store. Even though it's so far away from where I live but it's worth the trip to get delicious cake! Thank you PKB for making an amazing delicious cake!", "author": "An C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Loved the pineapple and lychee custard buns. The cocktail bun was great too. Can't say the same about the chicken pot pie.", "author": "Shalini C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-10", "description": "I stumbled upon this place on the way home during a crazy storm of the bay area. The pastries I got were delicious. Pineapple bun, egg tart, salted egg ball, and pork bun. The salted egg ball is unique-- I have never tried something like this. It is a salted egg that you can find in Asian stores within a pastry ball. The egg is a harder consistency than the dough itself. Pineapple bun which this place is named after is soft and not super sweet. The pork bun was just okay; it is probably better fresh in the morning. Pineapple King is cash only but pretty inexpensive so you can try a bunch of the goods. I warmed them up when I got home and the pastries were better warm. I recommend a hot drink with this. The pastries here a great way to end your day playing with the stormy weather or to carbo-load in the morning!", "author": "Jaime F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "Order the Pineapple bun with butter at the cashier!!\n\nThis is my go to bakery for savory and dessert pastries.\nThey offer a great selection of breads and pastries with great quality yet affordable prices: When you get here, browse the ones on the shelves, i suggest try the \n\nSpam and Egg Bun along with the \nBacon and Egg Bun, but\n\nwhen you check out, go and order the \"Pineapple bun with butter\" and wait for the heavenly goddess of bread you can ever get from an asian bakery!!! They will give you a fresh and warm Pineapple Bun, slice it, then add a cold thick slice of butter in between. Imagine the texture of a fresh-from-the-oven bread with cold butter! \n\nIn case you're wondering how I discovered this? It's on the menu board above the cashier :)", "author": "Grace W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-25", "description": "YES! I could easily come here everyday! Prices are cheap and buns are fresh, what more could you ask for?! My favorites are definitely their pineapple bun and hot dog bun.\n\nThe pineapple bun is the perfect consistency of a crispy outer and soft inner. Their hot dog bun is also amazing! The hot dog is nice & warm and the bun is so fresh tasting.\n\nOne time I came in around 6 pm, naturally I was expecting more stale tasting buns... But, Pineapple King did not disappoint! The buns were all warm and very fresh tasting. I recommend coming here whenever you're craving a nice warm bao!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "++ Pineapple bun with cold butter. So delicious. Ample amount of carbs, sugar, and fat. Must try one if you're there!\n+ Very reasonable prices\n+ Clean store, prompt checkout\n\n= Very small. Can get crowded fast\n\nBottom line:\nA decent Asian-euro style bakery. There are many of these bakeries around, and each has a few \"special items\". Will return to try some of their other selections.", "author": "Arthur S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "My friend and I stopped here while we were in the city. And, let me tell you -- this place is so small! Their pastries are sooo good. I wish this place was bigger. I got a hot dog bun (one of the best I've had) and my friend got the pineapple roll with butter inside (what they are known for). My friend was absolutely in love with her pineapple roll. The employees were very friendly and parking... well... it's on Irving and it's in the city. All I have to say about parking is --good luck! Haha. Overall, I didn't really have a bad experience. I definitely recommend this place but it can get crowded because it's so crowded. It's definitely worth it though!", "author": "Misty T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-23", "description": "They make the worst pineapple custard buns ever. I swear the filling of custard was measured in the amount of a teaspoon size. One bite was all the custard I had. They have no right to call it a pineapple custard bun. I will never be buying from them again.", "author": "christine k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "This small bakery is famous for their Hong Kong style buttered pineapple buns. Browse the other reasonably priced buns and pastries while you wait. Cash only.\n\nPineapple Bun with Butter, 冰火菠蘿包 - A thick slice of cold salted butter sandwiched between a warm pineapple bun. Just as delicious as the ones I have had in Taiwan. Each bite is a satisfying combination of the crunchy top, fluffy bread, and soft butter. Be sure to eat it before the butter melts.\n\nHK Style Hot Milk Tea - Served piping hot. You will be asked how sweet you want the milk tea when ordering. I thought this was good but nothing special.", "author": "Amanda H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "Stumbled into this bakery after Exploring the golden gate park and having dinner nearby. They sell a variety of sweet and savory buns, milk tea, and small pastries and desserts. We didn't know they were cash only, but thankfully had enough cash on us that day. We got 10 different kinds of buns. I love mochi and the mochi custard was my favorite one. It was the perfect combo of chewy sweetness. They also have some interesting types of buns that aren't found in other Chinese bakeries like preserved egg bun and spam and egg. You can order the custard filled pineapple buns and pineapple with butter buns with the cashier. The salted egg pineapple bun, matcha red bean pineapple bun, and purple yam pineapple buns are also found in the rack next to the cashier. Overall, a great place to stop for some Chinese breads if you're in the area.", "author": "Helen J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Finally posting about this place. Been awhile since they opened. Their original pineapple bun has finally been perfected. When they opened, their dough was too heavy and chewy. My son f in bally declared it as his favorite. They also have excellent Hong Kong Hot milk tea with legit strong tea flavor that they drip. My new favorite over espresso drinks. They offer it at half sweetness my wife digs. Much better than @ShengKee. Also like their green onion or raisin buns much more too!", "author": "Ming W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "I LOVE PINEAPPLE BUNS!!!! These buns were incredible - we got one with taro, one with custard, and one with pineapple inside. I could eat these buns forever. 10/10", "author": "Patricia Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "Dropped in around 4pm on a weekend, and there was a line to order. I picked up a pineapple bun with butter (forgot how much this cost) and a pretty large egg tart that cost $1. The crust of the egg tart was perfectly flaky, and the custard was not overtly sweet. The heavenly treat was worth my dollar bill. \n\nHowever, my favorite is the pineapple bun with butter. This is a snack that I have not had in years! You will wait a couple minutes while they heat up your pineapple bun in the back and slap a piece of butter in. Make sure you enjoy it ASAP as it is best enjoyed warm! I am salivating at work while writing this review. If parking weren't such a hassle, I would probably drop by more often. \n\nService is quite friendly. You just order and pay at the counter. The guy even asked me which egg tart I wanted from the tray that was sitting on the counter. I only wish parking weren't so terrible on Irving! I shall be back to try their milk tea and pineapple bun with matcha filling that everyone raves about!", "author": "Kristi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "-- CASH ONLY --\nCheap, tasty, and fresh.\n\n$0.80 for a pineapple bun? SOLD! I prefer the family-owned bakeries instead of large chains because I know it'll be cheap and (most of the time) better. I've come a few times now all at random times and their shelves are always stocked. It gets a bit cramped in there sometimes and it's hard to move around if there's 4+ people... you just have to squeeze around. It's not a big deal, considering that their bakery is super tiny!\n\nThey also have these breakfast sandwich buns and they're so tasty. Definitely recommend them for a hearty grab-and-go breakfast as well.", "author": "Andrea K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Great place to get some good pineapple bread that never crumbles like the others. Customer service was great they greeted us with a welcome and suggested some of their best options. The bakery has limited options but what they do have, they make with quality in mind. Great experience and definitely recommend.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "Dropped by for a quick snack and it didn't disappoint. Reasonably priced, extensive options and fresh made baked goods!!", "author": "P B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "Came here this morning for breakfast as a recommendation from a friend. Yelp said it opens at 7:30am, but it was open when I arrived at 7:06am. There is no sign that state when they open but that's fine with me. They should really update their operation hours though. \n\nLooking around the bakery, there weren't any \"pineapple bun\" to grab and pay, you have to order them at the register. I might be wrong because I was too early for them to display. Saw some special menu items for breakfast/lunch on the wall which includes a cup milk tea, a mini pineapple bun, and sandwich bun of your choice. I opted for the ham and egg sandwich breakfast combo at around $3.30(?), which was very cheap for the large amount of food I am getting. \n\nThe sandwich was okay; ham, egg, ham, and sriracha mayo(?). The bread part was light and fluffy which was baked really well. The mini pineapple bun was delicious; the layer on top was light crunchy with similar bread on the bottom. They served the Hong Kong style milk tea an it was so good. Reminds me of my childhood. \n\nWill definitely return for the pineapple bun and milk tea!", "author": "Maria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-13", "description": "Hong Kong style pineapple buns in San Francisco? What else could you want? I like this place because their pineapple buns seem to always be fresh and are of course delicious. I don't like this place because their egg tarts, which are in my opinion #2 in ranking for best Hong Kong pastries, aren't the greatest. Their coffee tends to fall flat as well.\n\nAll in all though, I'd come all the way back out here just to get the pineapple buns. \n\nWarning: cash only, but there is a bank of america ATM right now the block", "author": "Patricia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "Nice H.K. style buns in that they're not hard and dried out. I say this because many asian bakeries these days bake only once or twice a day and the product ends up sitting in the warming holds for too long. Pineapple King Bakery is always baking delicious buns and they're economical. Just don't expect quick service.", "author": "Dan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "Warning... this place is cash only! I happened to have a few bucks on me so I got to try it out. The pineapple rolls were great! They had just come out of the oven and were nice and soft. I got the pineapple roll as a combo with a ham and egg sandwich and a HK style hot milk tea. The tea was nice and strong, and they gave me the choice of how sweet I wanted it. The egg and ham sandwich had very soft bread, but the egg was a bit too soft for my taste. The greatest part about the whole experience was that for just about 3 dollars, I got enough food for a substantial meal, win!", "author": "Nadia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-16", "description": "Had this for the first time. The pastries are great! They are quality and great presentation. Will go back again!", "author": "Karine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "This place is freaking TINY and ca$h only.  You grab a tray and some tongs and load it up with what you want. \nMost items are less than $2, and the baos are of decent quality. I would have to say a lot of them are better than Sheng Kee because the bread is softer. \n\nThe claim to fame for this joint are the pineapple custard buns. They're 2 for $1.50 and you have to order it at the register. They are made to order so sometimes there is a wait. The pineapple custard buns are smaller than the average pineapple bun but that's ok. The custard is warm and injected in. Eat it right away to enjoy it's gooey goodness. The top crust is flaky and slightly crunchy like how a pineapple bun should be, and the bread soft. The pineapple custard buns here are a guilty pleasure of mine. Thankfully I don't always have cash on hand so I won't be tempted to get these all the time.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "I didn't think I could love pineapple buns more than I did until I started going to pineapple king far more than I should. \n\nEverything I've tried is delicious--pineapple bun with butter, regular pineapple bun, custard pineapple bun, sesame pineapple bun, pork pineapple bun, coffee bun, taro bun, taro puff pastry, and the matcha and custard pineapple puffs!\n\nSee, I come here way too much.\n\nAnd I recommend everything.", "author": "Annie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "Wow, I was skeptical of this little bakery, but i heard they make the best canto pineapple buns in town.  And reviews don't lie. \n\nThe place is small, but they offer a lot of buns and more than just pineapple buns.  I tried a variety of yam, pineapple custard, and black sesame buns.  The yam bun is really good, lots of yam and a nice crispy crunch from the buns.  The pineapple custard bun is also an excellent choice, it is not too sweet and has good pineapple flavor.   The black sesame bun is okay, too strong and heavy on the black sesame IMO.\n\nThe pineapple pastry is also excellent, even better than some pineapple cakes i have tried.  The flavor and filling is not sweet, and it has a flaky crispy shell.\n\nThe pineapple buns here are amazing, a really nice crispy crust with plenty of filling.  You really cant go wrong with any choice of bun here.  I will be back to stock up soon :)", "author": "Terence N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-08", "description": "I'm a fan, but not for all the items here.  The Pineapple Puffs are a must here.  It's a pineapple bun filled with custard.  These aren't out in the open, but you order them and  wait a few minutes while they fill the buns up with custard.  What you get is a warm bun filled with delicious custard, and it's going to get messy cause there's a lot of custard.  \n\nBesides the Pineapple Puff, everything else I've bought wasn't all that special.  The buns are soft and tasty, but ones like the Taro Buns seem to lack much of a filling.  The cake rolls lack flavor and the outer layer was hard, definitely not soft like their other breads.  However, they're really cheap, especially compared to Sheng Kee a few doors down.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "Be sure to get the matcha filled pineapple buns - they are DELICIOUS, flaky and pure heavenly in ones mouth. : ) The BEST pineapple buns I have ever tasted in my life.", "author": "Jenna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Strawberry shortcake, egg tarts, pineapple buns, sponge cakes....everything was delicious.  The gals work here are so efficient too.  Prices are reasonable.  Wished we lived closer.", "author": "Fiona N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "Came back and tried the custard pineapple bun and to me that's the way to go - creamy custard and soft bun ($1). The browner the tops the more crisp and crackly.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "Minus 1 star because Cash Only. Low prices and everything was fresh and smelled amazing. Will definitely be back.", "author": "Kev N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-08", "description": "I love discovering new Asian bakeries! When my family and I saw the grand opening sign, we couldn't resist.\n\nWhen you first walk in, the overwhelmingly scrumptious smell of fresh-baked buns hits you. There is a wide variety to choose from -- red bean pineapple buns, taro pineapple buns, custard pineapple buns, plain pineapple buns... you can see why they are called Pineapple King Bakery! Each one ranges anywhere from $1.25-$3, so it's definitely not a wallet-breaker to stock up.\n\nYou can also special order the pineapple puff (2/$1.50) which is a small pineapple bun filled with warm custard -- my personal favorite! There's also the pineapple bun with butter, which is exactly what it sounds like. A warm and sweet pineapple bun with a slab of cold, savory butter in the middle. It doesn't sound like much, but it is SO good; the combination of textures and heat and flavors is definitely special. These can be ordered at the register, and they take about 5-10 minutes to be prepared, but the wait will be worth it.\n\nNo matter which one you pick, it's sure to be like biting into a little piece of heaven. Each and every one is baked fresh with a crumbly top and super soft interior. Yummmmm.\n\nThe only reason they lose a star is because their setup is a bit chaotic. The store itself is pretty small (about 7 people wandering around in there would feel extremely crowded), and their cash register and trays are right in the middle in front of the entrance as you walk in. That being said, you can imagine what an ordeal it can be if you're browsing around and there are also people who are waiting in line to pay or waiting for their specially ordered pineapple buns. Talk about claustrophobia!\n\nAll in all, though, good prices and good buns will probably keep us coming back. Now that we know what we like, we can just get in and out (hopefully without too much of a traffic jam!)", "author": "Yvonne K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "EVENT: Grabbing some dim sum for the family for Christmas Weekend... checked my handy yelp for some good buns and bakery goods... came across this place... apparently amazing...\n\nFOOD: There is no lie... this place is super dangerous, but I love it! This place... is definitely PINEAPPLE BUN everything ... well, that's what I got... hehe!\n\n(1) BIG Pineapple Bun - 4 stars\n(2) Little Pineapple Bun - 5 stars\n(3) Little Pineapple Bun with cream stuffing - 100 stars **MUST GET** order... at the cash register! \n\nNOTES: CASH ONLY!\n\n**OVERALL: Dangerously pineapple! 5 stars! Will come again!", "author": "Mindy Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-28", "description": "I've been coming here since they first opened. I love their coffee pineapple buns! They're Chinese owned and operated. They only take cash. But today, they broke my heart. It wasn't the food, it was how I was treated.\n\nI thought I'd get some coffee buns for breakfast at work tomorrow (I'm at work before they open). Of course, I got a few other things while I was at it. I get up to the cashier to pay for my  items when a lady from the back comes out with a tray fresh coffee buns announcing in Cantonese, \"Fresh Coffee Buns!\" I've already paid and the cashier is beginning to bag my items. The lady with the tray says to her in Cantonese, \"Hey, switch out those for the fresh ones.\" The cashier replies in Cantonese, \"Don't have to switch it out for foreigners.\" I kept a straight face and looked her in the eyes. I think I was more in shock that they would do that as  a business.\n\nI don't blame them for thinking I didn't speak Cantonese, I'm really tan and was wearing workout clothes. But really? Did you have to say that with me right there? I think I was more in shock about what was happening to my very face.\n\nHaving grown up in San Francisco, I'm under no illusion that racism exists. But sometimes, reality really bites when thrown in your face.\n\nBut the food is really good!\n\n-2 stars for Service\n\nThank you very much, please come again.....", "author": "Jonathan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "Small bakery located on the same block as Sheng Kee, another competing bakery. I love the buns they offer, particularly the spam and egg. The bread is fluffy and sweet while the filling is meaty and satisfying. They also have a small fridge w/ some desserts. Tried their strawberry cake and the sponge cake portion was springy although the strawberries were tart. \n\nCompetitive/lower pricing compared to other bakeries around the area.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "This place has turned into a full-blown bakery now, with much more than just pineapple buns and their variations. While it isn't as extensive as Sheng Kee down the street, it's a de facto place to go to if you're looking specifically for its namesake. I got their matcha pineapple puff today, and it's probably my favorite one yet. I don't know why I haven't seen this elsewhere yet (butter and egg custard are staples, why not matcha cream?), but it would be fantastic if dim sum places started to offer this. The pineapple bun on the outside is light on the bottom and crispy on the top, but if you're eating it warm be careful about the matcha cream inside. It isn't burning hot, but it's pretty liquid, so it'll spill out if you're not careful. At $1.50 for two, it's pretty cheap as well!", "author": "Tony D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "They really have the best pineapple buns, but what I really come here for... is their chilled HK milk tea at the front. There's no ice inside which doesn't dilute it or make it taste watery. It's pretty strong but the condense milk inside makes it perfect.\n\nTheir warm pineapple bun with a slab of butter is super good. I really like their matcha filled mini pineapple buns too. They heat it up so it's extra gooey inside. Plenty of other pastries, breads and cakes, def can't go wrong here.", "author": "Carmen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Drop by here when I was at Irving St. Seeing the reviews online, I wanted to come here. I did not buy any of the pineapple buns or matcha buns but bought the egg tarts which were $1.00 each. \n\nI was told they just came out of the oven. The crust was flaky and it was just the right amount of sweetness. \n\nDelicious for the price and definitely good. Next time will try the other choices including their milk tea.", "author": "Jen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Its got lemon roll not with cream in the middle, the bread is tasty, and they got pretty good milktea. My go to bakery when I am able to make a trip out to sunset", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-07", "description": "Super delicious bo lo bao to a whole new level with pineapple puff pastries! Made to order and at 2 for $1.50, I'm sold!\n\n\nThink super light cream puffs inside the cutest and perfect mini pineapple buns. And if that rocks your boat just thinking about it, stop by and order! You won't regret it!", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "I easily spent $40 here. Each pastry is a little over a dollar. I couldn't resist all those pineapple buns! They have a variety of flavors too.  My fave is the pineapple bun with a slice of butter. It's a must try!", "author": "Kate W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "This review is just for the matcha cream mini pineapple buns. Honestly. genius. And inexpensive too, they come in orders of two (for only $1.50)! I was in the neighborhood and really came in and bought them on a whim. However, they did not disappoint; a well done pineapple bun filled with light and not too sweet matcha pastry cream.  My biggest regret was not getting two matcha flavored ones...", "author": "Becky M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-01", "description": "I like this place mostly because it is dirt cheap. SO and I were walking around the area and looking for a snack when this place popped up over Yelp and looked extremely promising. It's basically just your typical Chinese bakery -- as evidenced by the tongs and the lunch trays and the wax paper. BUT it somehow has maintained old school prices, it's fantastic. So I'm really giving this four stars for how cheap it is, not how good the food was. I just got a simple pineapple bun which was less than $1 I think. But... honestly it was a pineapple bun. I've definitely had better ones before... and this one didn't stand out at all. \n\ntldr; typical Chinese bakery, getting that fourth star from me because it is dirt cheap. food is decent", "author": "Jasmine X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "The reason I don't complain about getting up early and driving across town to go to the produce market = pineapple buns at this place. And they have so many different types from the standard (delicious) to more adventurous flavors.  They also have a killer bacon and egg bun that is a whole breakfast on a perfect roll. Prices are low, service is good and the place is clean. Also this place has unexpectedly good coffee Bonus!! You will see me Saturday mornings with the buns and coffee balanced on the hood of my car because you cannot eat a good pineapple bun in your car unless you go straight to the car wash/auto detail shop after.  Long live Pineapple King!!", "author": "Miss F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "Excellent food! I was in disbelief after having found this location. It is reasonably and fairly priced. Their bakery is excellent. I tried this one a week or so ago and went to the competing bakery down the street, only to find an overly busy, larger selection yet lesser quality food. I tried a few items and vowed to never go back again and stick with my original find, The Pineapple King Bakery is by far the best I have eber had and their products are consistently good. It was just as delocious if not better than last week's visit! Love their food.", "author": "Dominique P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "The pineapple bun with butter here is to dieeeee for! Your bun comes out warm with the thick slice of butter slowly melting onto it. You gotta eat this right away while its fresh. I know, the butter can be a lil too much so I limit myself to probably... one bun a week. Haha!\n\nOther than the pineapple bun, the paper wrapped spongecake is delicious as well. Comes in the regular flavor as well as green tea! I sometimes opt in for the spam and egg bun and the tea egg. Everything here looks delicious and its so hard to decide on what I want to get here in the morning. \n\nDo not hesitate to come grab a bun and milk tea to start your day! CASH ONLY!", "author": "Nancy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "Always a fave, especially when my go to place is closed for remodeling. Ventured out and tried their coffee bun, yam bun and Thai iced tea. The coffee bun and iced tea were actually really good. The yam bun filling was a little too much yam for my liking and a little too purple almost venturing into food coloring-ish territory which seemed super artificial. The pineapple bun is and will always be my go to bun and this is a great pinch hitter till my beloved bun place is up and running again.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "My addiction pineapple buns and milk tea lol... definitely my go to spot for pineapple buns plus cold milk tea is like rocket fuel ... if your in the area check it out the standard pineapple with butter is good,but I like the custard filled ones too", "author": "jonathan h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-08", "description": "Seemed to be your run of the mill Asian bakery with nothing really distinguishing itself from literally several other bakeries surrounding it.  I got a pineapple bun which they happened to bring out fresh and it was good, but nothing special.  This place deserves 4 stars as it's clean, has a decent amount of options, and overall is decent.  It's the type of place to definitely drop into if you want some Asian pastries but nothing you need to go out of your way to.", "author": "Alexander C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "One Saturday morning you lie in bed and Yelp bakeries and this place shows up as being a couple of miles away. That's when you say, \"Oh that's an easy walk.\" Suffice to say that easy walk is not easy when you have to drag a 42 lbs, 5 months old untrained puppy along, who thinks every street's got snausages, the best kind are the freshly made horse droppings. Dragging her through the GGP proved to be of a challenge, but we were not deterred. The real challenge turned out to be my lack of geographical senses. I had no idea, for instance, between 20 and 27th ave on Irving is filled with Chinese restaurants, bakeries and grocers. Truth be told, I'm not familiar with and completely intimated by the Avenues. I stopped at nearly every store and checked out everything. A less than 2 mile across the park became a 4 mile hike between Abby and my dawdling. At last, an hour and half later, we finally arrived at a mobbed small storefront next to a much bigger Sheng Kee bakery just a few doors down. \n\nImmediately attracted by McDonald's style happy meal style signage, I ordered B and C, with the distinct Hong Kong style efficiency and decisiveness, along with a bunch of other Cantonese pastries to take home. \n\nI'm a mixture of Southern and Northern Chinese, Han and Manchurian. On one hand, I am drawn to northern style food like sauerkraut, liverwurst, fermented beans and hand made noodles that are akin to Russian, German and Korean cuisines, ordering dishes with a nasal Pekingese accent; on the other hand, I'm completely smitten by anything that resemble Hong Kong and Macau bakeries, and often blurring out near-perfect Cantonese when confronted by the Avenues's Chinese Americans who are most often Cantonese in origin. This establishment evokes the youth in me, where custardy goodness coupled with pineapple crunchiness baked goods dominated my teenage years. Having moved with my family to the hustle and bustle Pearl Delta region boarding Macau, I remembered fondly stopping by those pastry shops like this one on my way to my high school.\n\nTake out trays were handed to me. For $3, aka depression era pricing,  you get 1 small pineapple bun filled with custard, 1 pineapple bun egg and ham sandwich, or 1 pineapple bun egg and spam sandwich (get this one, you must! it's nearly as good as Liholiho Yacht club without the triple digit price tag), and coffee or Hong Kong style milk tea. That's the kicker. Hong Kong style milk tea is delicious. All inclusive, with a price like $2.90 or $3. Less than McDonald. One tray is perfect for two complete sets. \n\nWe took our tray and headed back into the park. Once on the Richmond side, we found a bench and sat down and enjoyed our reward for a near 5 mile walk. As luck may have it, I promptly tipped my milk tea and it ended up on the ground. Abby, not missing a beat, immediately lathered it all up and then proceeded to kick the cup around until the last drop was spilled and consumed. \n\nShe'd do well in Hong Kong, my black furry Golden Saint.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-17", "description": "I don't like it, last week I went there and bought a chicken pie which has no chicken inside , only a little mushroom ! And I also bought a bag of wheat bread but I found out some slices it had already molded ! They told me I could exchange another bag but I saw most bags were also molded ! So I asked them refunded to me eventually! *_*", "author": "Bing L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "The pineapple buns are amaaazing, especially the ones filled with custard! And they are dirt cheap. They have other pastries too, but I wouldn't waste calories on those. It's called Pineapple King Bakery for a reason! I need to come back to try the matcha one. Love their hot milk tea too!\n\nCash only!", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "This is probably the best pineapple bun place in the area. It's really unique because they warm it up and then put a piece of butter in. The warm and cold contrast tastes really good and unique. The bun is also crispy and flakey. Not sure about the other stuff in the shop but the pineapple bun is worth going for.", "author": "Jane W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Great buns! Fresh, hot, toasty, soft, whatever you desire! Don't keep them for too long because they're SO MUCH MORE AMAZING FRESHHHH (but still good after a day or so); but why wait? You can always come back and order them fresh since they open pretty early and are pretty quick with the check-out. Walking into this bakery... all you smell is happiness :) the cream puffs are also super yum. Bring cash.", "author": "Emmeline L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "I think they put something in their bao dough to make their pastries so fluffy tasting. \n\nTheir hot dog baos are sooooo freaking good! My favorite!", "author": "Alice X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "Very solid for their signature Pineapple buns and other different varieties. I recommend their combo with HK Milk Tea! If you happen to get it when it comes out straight from the oven, it's pure heaven!", "author": "Aaron K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "Yummy \nBuns here are always fresh. Small batches and absolutely delicious. Small shop no seating. Cash only. Famous for their pineapple buns baked with a variety of meats and sweet fillings. \nFriendly staff and street parking only. Extremely inexpensive buns too. \nThere are several other bakeries close by but I love this place because of the spam and fried egg bun.", "author": "Frances L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-26", "description": "Ladies are nice, everything was fully stocked and ready to go. Self serve. Grab a tray and thongs and go crazy. They also sell cakes ($26 for an 8in strawberry short cake)\ncoffee and HK milk tea made with condensed milk.\n\nI purchased\nNapoleon cookie (the cream tasted like jet puff marshmallow, I'd pass next time)\nMini pineapple bun (for my daughter)\nCustard tart (daughter gobbled this up fast!)\nHK milk tea (not as good as victors bakery for this type of bakery)...", "author": "Liz N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Best pineapple bun ever had in states!! Nice service but small place, I'd love to stand outside and enjoy the amazing Hong Kong milk tea :P", "author": "Jingqian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-06", "description": "My friend was visiting SF from out of town and had expressed a craving for good Asian food. I knew I had to make sure he got the full California experience, so I made sure to pick up a few buns for a quick breakfast. To my delight, the buns had just come out fresh when I arrived in the morning. (Fresh bread is my weakness.) I immediately stuffed a bun in my mouth and fell in love, but I made myself wait until the next morning so I could try a cold bun and write a unbiased review.\n\nRating Breakdown:\n\n2/2 Stars for Taste --\nSince they are the Pineapple King, I knew I had to try their pineapple buns. I grew up eating pineapple buns, but I have never seen such variety in fillings before. They had taro, red bean, pineapple, and custard when I went. The taro pineapple bun was simply amazing. It was fresh out of the oven and the smooth, creamy taro filing was still warm when I bit into it. I tried a cold pineapple custard bun this morning and the bread was still delicious and chewy, with a crispy sweet crust on top. The bun was filled with real custard, not that cream cop-out. It reminded me of the puffs my mom used to make. \n\nUPDATE: Two days later, BBQ pork bun is still amazing. Perfect ratio of bread to meat filling, and the bread is really good by itself too. They use nice, fatty pieces of meat. Mmmm\n\n1/1 Stars for Value --\nSweet buns range from 80cents to $1.25 while savory buns are closer to $2. I purchased 4 buns for less than $5. The buns can get a bit sweet, so I usually eat half in one sitting. When I eat a whole one, I am stuffed! Good for a quick, cheap breakfast.\n\n1/1 Stars for Customer Service -- \nBuns come out fresh throughout the day. The description cards tell you what time specific buns are available (some aren't made in the afternoon), which I think is really helpful information to know. The ladies were very nice and spoke English.\n\nBonus star because I will definitely be back to try some of their other pineapple buns. I also want to try their bacon sandwich, because I saw some FAT slices of bacon with my name on them.", "author": "Abby W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-01", "description": "Molds or cigarette ashes?! This was not left at home for weeks .  Opened it 5 mins after I bought it. Feeling nauseous 30 mins after eating. It's definitely not the first time we found black specks in their pastries . Make sure you observe every bite before entering your mouth.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "I like this bakery because it's at least 10% cheaper than Sheng Kee nearby and their pastries are fresh and piping hot.  You grab a tray and self serve. There are some combos - look up the wall in back of the cashier. You can get 2 buns and a hot coffee or milk tea for $3-4. \n\nIf you buy a loaf of bread, you can also ask them to slice it for you, Free of charge", "author": "Jannie Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-26", "description": "I like how they have so many unique Pineapple buns. The bread isn't fresh which is a bit disappointing. I have bread that is fresh out of the oven like 85 degrees. Some times if you're unlucky you get mochi product that is super hard like it was leftover from the day before. \n\nI super love the salted egg Pineapple bun and the BBQ Pineapple. Purple yam was ok too if you like red bean than this is the bread for you. My sister said the Sesame flavor was bitter. The custard one was too water down. Egg tart don't bother. The crust is bland vs buttery and flaky. The mochi are super oily or super hard if they are the left over ones.\n\nCome back early during the day to try other flavors.", "author": "Miri L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-22", "description": "I'm a total sucker for sweets and when Pineapple King decided to emerge on Irving, I wasn't overly interested until I saw the reviews and saw people mention that they have a cross between a pineapple bun and a cream puff. Okay, I'm listening... \n\nPineapple King does deal a lot with pineapple buns. They can put cold butter in it, put ice cream, add cream in the middle, make a strawberry cream pineapple bun puff, and even put BBQ pork in it. It's ridiculous how much they can actually do with a pineapple bun. \n\nThe one thing I love about Chinese bakeries is that you can buy like 5 items for less than $5. It's insane how cheap their items are. And they're amazing, too! I don't wanna join the hype, but you really have to get their pineapple puffs when you're here. It's the bomb.  \n\nService isn't overly friendly but they are speedy and will get you in and out fast. \n\nParking is a bit of a hassle cos they're located on Irving St. and it's metered till 6pm so good luck!", "author": "Venus L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Delicious! We tried the famous warm pineapple bread with a slice of cold butter the first time. Unique and really tasty! The next night we tried a strawberry shortcake slice. This one was really, really tasty. Light, moist, and fresh. If you're looking for something sweet and small to complement a meal, we highly recommend Pineapple King!", "author": "Bryce B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "Better customer service comparing to Sheng Kee with a different bread selection in here. The bread sizes are smaller, cheaper but they're unique and worth the try!", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "I'm not exactly sure why, but I have grown to prefer Pineapple King over Sheng Kee.  Sheng Kee definitely has more variety, but I think Pineapple King might be fresher (or if not, they do a good job of maintaining that illusion with new trays being brought out every so often.) I think their bread is a little softer, which I love, and it's just a plus that their prices are a tad lower (think 5-10 cents.) I've had mini and regular pineapple buns (the minis stuffed with bbq pork or stuffed with cream and strawberries), chicken buns, hot dog buns, egg tarts, milk tea... The flavor of the milk tea was a little different but it seemed strong to me. Fairly sweet as well. Anyway, I'm sure to keep coming back for their soft bread!", "author": "Delia Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-27", "description": "I was skeptical that a Chinese bakery could compete with Sheng Kee a few steps away but Pineapple King lives up to its name and fills a boro-shaped gap in my heart/neighborhood. The boro you (pineapple bun with butter) here was way better than what I had in Taiwan, which was already ridiculously good. I'm telling you, there is nothing like a warm and sweet flaky boro bao paired with cold salted butter. It's a heavenly combination that I have yet to find elsewhere in the Bay Area. Granted, I still haven't had boro you in HK but I'd imagine they taste similarly! Overall, I like that Pineapple King isn't trying too hard by going all crazy and selling a million different kinds of pastries or drinks. Some of the breads here do look terrible but you want to come here for the boro--and for that, they're doing a splendid job.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-01", "description": "Came here a month ago.\nGot a bunch of buns and a meal.\nThey forgot my meal buns and only gave me a tea. I forgot to check because they put all the buns in a box. :( I was disappointed when my family was enjoying their buns while I looked for my hot-dog bun and small pineapple only to not see either of them.\nThe tea was really bitter, but that's okay. The cake was really good. Yummy fruit filling and almonds. My sister doesn't like Chinese cake but she even enjoyed it.\nOverall it was okay. :( still sad over that hot dog bun.", "author": "MaryAnn H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-21", "description": "First of all, I don't have too much experience with Chinese bakeries. I've only been to Sheng Kee and a former bakery on noriega street called lotus cafe. My favorite pastries are pork buns, and coconut buns.\nThis place is a small location that's open later than most places in the area. Btw, I went at 8pm and most other places were closed, but that's just how the sunset is I guess. I ordered a pork bun and a taro bun. I don't remember the price but it was very cheap, similar to sheng kees prices. The pork was pretty good, the taro bun was lacking (not enough taro).\nI would go back here later at night, but I'd rather go to sheng kee cause they have a larger selection and more locations. Overall I'd Eat here, meh", "author": "Jim D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-25", "description": "I feel a part of Hong Kong just landed in San Francisco.   The Pineapple King has the famous  pineapple bun with butter a warm pineapple bun and cold butter right in the middle of the bun. Right when you take your first bite you feel the richness of the melting butter with the warm and flaky bun.   It's not as good as the famous Tsui Wah cafe- Bo Law yau (pineapple bun with butter)  but still very satisfying when you get that craving to have a little bit of hong kong back in your life.", "author": "Belinda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "The only thing to get here is the freshly baked and filled pineapple custard buns!!! Such a great price and so good! The buns are hot and crispy on the top! Eat it fresh but be careful the custard oozes everywhere. They're also good to take home and just microwave for a few seconds. My mom tried a lot of their other breads and pastries but they were all just mediocre, nothing special.", "author": "Linz C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "Hidden gem of San Francisco..must have mango and chocolate mousse and strawberry and fruit cakes. As yummy as beautiful..", "author": "California G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-26", "description": "Pineapple King takes over the Honeyberry spot. cheap baked goods. tea too.\n\nbaked items in plastic display cases like most  bakeries these days.\neats: peanut cookie (1)\n-had some flavor, nice, s pieces\n-taro bun\nno taro flavor at all, just sweet & doughy\n- apple turnover(1.2)\nfew cubes of canned apple\ncrust not  flakey\n\ndrips:\n-sample of mango tea  (3.5)tasted very sweet\nwould skip.\n-stuff cheap but low quality\n-friendly, fast service.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-17", "description": "BOMB.com! I'm so glad that Irving St, is far enough from me that I wouldn't come here for a daily dose of Pineapple King! I tried out their ham and egg sandwich, regular pineapple bun, cocktail bun and Pineapple King with handmade custard. If you walk away with just one thing, make it the Pineapple King. It's served warm and the custard is ooey gooey deliciousness ready to burst in your mouth.\n\nI docked one star off because they seem to be a little unorganized. The layout of the store is awkward and the gal working the register is a little slow. But I'm giving them the benefit of a doubt that this is likely because they just opened.", "author": "Tiffany U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "I had a good experience my first time here, so I decided to come back. The place is a little small, but people go in and out so it's not a big deal. I ordered the pineapple puffs because that's one of the popular items here. The last time I had it, I didn't eat it fresh so I didn't really enjoy it. This time I ate it right away and it was so good! I got egg tarts again because they were pretty good last time too. They didn't have chicken cookies, which I wanted but hopefully they'll have it next time I come. I've walked around a bit, but nothing really caught my eye. I'll look more carefully next time. The Thai tea and milk tea that they have out is so tempting, but I wish they made it fresh instead of having it sit there already. The place is pretty clean and the workers are pretty nice. I'd still be coming back", "author": "Maggie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-04", "description": "When Aziz Ansari (comedian/actor) flew out to Hong Kong on the show, \"The Getaway\", to eat Pineapple bun with a stick o' buttah, I was DYING!  DYING of laughter, DYING to eat one.  What he did wrong was peel the bun apart with his hands, which broke away all the crunchy cookie top.  The owner, Mrs. Chan gave him a mini lecture, he basically got in trouble!  I was rolling on the floor when he got scolded.  She took away his bun, then came back with a fresh one.  You are supposed to open your mouth and bite into the bun, that way, you get the crunchy top, fluffy warm bun and cold butter taste in one big bite. But most importantly, you will not waste any of the cookie top.  Learn from Aziz, don't peel the bun apart but instead, bite into it!\n\nWith that being said, I was excited to try this place and relive Aziz's adventure of eating a Pineapple bun.  Every pineapple bun order came out fresh and hot with a cold stick of butter. I was expecting my world to turn upside down with this bun! But guess what, even though I followed Mrs. Chan's advise of taking a big bite into the bun, it was not as wonderful as I was expecting.  Yes, it a warm fluffy bun.  Yes, it had a cold stick of butter that melts in your mouth. HOWEVER, the cookie top was not crunchy or thick enough, in fact, it was a tad too soft.  It's a shame that this tiny bakery didn't have any seating so you can get instant enjoyment to your bun.  I actually bought it and went to TeaWay to buy a boba tea to drink with this bun.  By the time I made it to TeaWay, the warmth of the bun cooled down a bit.  The experience might had been different if I could had eaten it in it's hot stage. \n\nI ended up buying 3 of these buns.  1 I ate at TeaWay, 1 was given away, and the last one I took home and ate the next day.  I put the last Pineapple bun into the toaster oven for less than 5 minutes and baked it back to it's glorious hot state.  Guess what?!  The cookie top was crunchy, the bun was warm and the butter had melted nicely into the bun and it tasted good!!  Much much better, in fact.  But if I had to compare this bun to other pineapple buns I've eaten in Chinatown, this one falls behind because the cookie top was not as delicious as others.  Wish I could call this the KING of Pineapple buns but I'm sorry to say, I can't give it it's crown.  I can give it 3 solid stars...", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-11", "description": "Credits go to the employee, at the counter, for being knowledgeable about her recommendations when their on-screen menus were not operating.  \nThis place is inexpensive as I can get 3 buns for $2.75.  Ordered the mini pineapple buns w/egg custard filling (菠蘿王 - 2 for $1.50) and a pineapple bun with a slab of slightly melted butter (菠蘿油).  I understand the pineapple bun with slightly melted butter is a HK thing, and perhaps it's just me being ABC, but I'm not fond of enjoying bread with butter that's not spread out; nonetheless, it is worth the try.  The mini pineapple buns, though, are tasty and worth the money.  They've been opened for 2 weeks so I'd give them another try when kinks are worked out.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "wow I can't believe I'm saying this but pineapple bun with custard inside is bomb. I don't normally eat or try something decadent but dang. The bun is soft but crunchy from the crust\n\nThank god it's a mini size and just 2 for $1.50!\n\nWill be back again but maybe try their order pastries", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "Amazing. I grew up eating a pineapple bun for breakfast basically everyday. Eventually I grew tired of it and so ended my pineapple bun obsession. I hated that most of the time, the top part of the bun would leave me with crumbs everywhere and I'd be dancing to shake it all off. \n\nNOW... Pineapple King Bakery has rekindled my love for these buns. Over the years I've had one every so often but it was more of a \"I'm so hungry...\" thing than a craving or want. \n\nThey make these buns so moist and just flaky/crumbly enough. The fresh ones are to die for and even when left overnight they're still very soft and moist. I dropped by to grab one for breakfast for the next day and I got a pineapple bun with butter to eat on the spot.... I CAN'T DESCRIBE HOW HAPPY MY MOUTH AND TUMMY WERE. My fiance literally had to pry and guilt trip me for a bite. \n\nThere isn't a large selection of goodies here and I haven't really tried anything except for the pineapple buns... There's also not much to say about service since there's not much to interact about. They're pretty quick at the cashier though. \n\nGO FOR THE PINEAPPLE BUNS!!!  That's what my stars are for.", "author": "Bonnie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-27", "description": "Wow, what a wonderful and surprising discovery!\n\nMy family and I were wondering around Irving and saw this little shop. Being the carb queens that we are, we had to check it out.\n\nFirst off, the prices surprised us. It's very affordable and reasonable. I was so used to the pricey buns at all these other chain bakeries that it was refreshing to see the low prices here.\n\nHowever, just because it's cheap, doesn't mean the quality was lacking. The buns were fresh and soft, and crumbly on top... just like how pineapple buns should be!\n\nThe warm custard filled bun is pretty good. It looks like they inject two of their small buns with a custard filling (think fresh doughnut style) and it's really tasty when it's warm.\n\nI have a few concerns... I'm not a fan of the flow of traffic. When it gets busy (it doesn't take much to get crowded... the store is very small so if there are over 5 people in there) it can get chaotic. The trays are located in the middle of the shop, next to the cash register, so essentially the line to get trays will block the doorway. Also, you don't really get led to the other side of the bakery, so you have to cut through the long line to get to the other side. It causes confusion and delays the entire process, which creates frustration.\n\nAlso, I know they're new so I'll cut them some slack. The staff seemed panicky and helpless when it gets busy. When we ordered the custard filled buns, they asked us for a receipt. Ok... the only problem was, we didn't get one. Needless to say, that caused some major confusion. I think they need a better system (maybe of tickets or numbers) to keep track of the custard and butter bun orders.\n\nLike I said, I'll cut them some slack so they can work out some of their kinks. They definitely have potential to be awesome because they have a great product and the prices are reasonable, so I'll definitely be back to try some more next time!", "author": "Sara K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "I highly recommend their pineapple bun with matcha green tea filling! It's 2 mini buns for $1.50. When I got it, we had to order it in line, they didn't bring it out - which meant that it was so fresh and warm! The custard one is also very creamy, but not overly sweet. I'd love to go back and try their other items.. and get more of the matcha filling!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-17", "description": "Got their hot dog bun, taro pastry, and their egg pie.  I wasn't able to try the egg pie, but supposedly it was SUPER good!  The hot dog bun was fluffy and not chewy.  The taro pastry was flakey and had a moderate amount of taro filling.  Small place w/ great prices!", "author": "Ivy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "Pineapple King is an awesome new bakery that I will bring all my friends to! We popped in to see what they had and we tried their Pineapple bun straight from the oven. For those unfamiliar, there's no pineapple in this bun! It was delicious- we were in heaven. It's perfect for breakfast or a snack -- sweet but not too sweet. We got a few to take home. \nWe also had their boba tea, which was fresh and tasted like it had real ingredients rather than just syrups and pre-mixed stuff. I recommend trying this as well. \nAll in all, I'm kinda obsessed with this place and wish I lived next door because I want a Pineapple King right now!", "author": "Julie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-10", "description": "3.5 stars.\n\nGreat pineapple buns...especially when fresh! I opted for the special - match cream pineapple bun and it was delicious. I can't wait to try the one with a pat of butter at a later date.\n\nI'm docking off a star though for the rest of the pastries, which are mediocre at best. The custard cake was spongy but rather tasteless unfortunately. The location is quite small, so plan to grab-and-go!", "author": "Kate M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "What I ate: Pineapple roll.\nVisit date: March 8, 2015\nFirst time? Yes.\n\nI came in to peruse and breathe in the baked good aromas, and then I saw free samples of the pineapple roll. Um, yum! If they didn't have the samples out I would have walked out empty handed. Instead, I left with a few mini pineapple rolls. I went mini because they were a more appropriate bread dessert serving and because they were cuter than the normal sized rolls. \n\nThe pineapple roll is just slightly sweet with a thin glaze of sweet on top. When you bite into the bread the bread practically melts in your mouth. It's soft and fluffy, and it's easy to inhale the whole roll. I gave one to my fiancé when I got home and I've never seen him eat a piece of bread that fast before. \n\nI'm not in the area a lot but I will definitely make another visit if I ever find myself near. In the meantime, you should go try their rolls for yourself!", "author": "Erin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "Delicious pineapple buns! They came in the butter variety as well a filling variety (cream or chocolate).\n\nGet these and eat them on the spot! They are so crispy and yummy!  \nThese by far are the best I've had in the bay!\n\nParking is the biggest pain or I would come here more often.\n\nCash only but the prices are VERY reasonable.  Cute place, it would be nice if it were bigger for ppl to hang and take photos.  Then again...it is SF....", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "Called Pineapple King Bakery so must try their pineapple products. Reasonable prices.\n\nPineapple Puff:  2 for $1.50  Need to order at the counter and wait for the order.  Served warm with custard fillings inside. Just like a cream puff. Amazingly good. Be careful of making a mess.\n\nPineapple Bun with butter:  $1.25 Also need to order at the counter and wait.  It's good if you like the warm soft bun with butter. The cookie top on the bun is the best! I waited after a few mins drive and the butter melted completely. \n\nRed Bean filled pastry is flaky. Not too sweet which I like.\n\nWould come back again.", "author": "Kei C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-20", "description": "Yum! We woke up craving some pastries and headed here. It was a good sign when we saw a swarm of people inside. We got a green tea sponge cake, ham and egg bun, coconut bun, taro bun, BBQ pork bun, original pineapple bun and a milk tea for $10\n\nThe BBQ pork bun was right out of the oven so it was extra tasty! Generous meat portion too. \nThe milk tea was surprisingly strong! \n\nI suggest reorganizing the pastries though like putting all the pineapple buns in one area (there's mini, custard, green tea custard, pineapple filling but was distributed throughout the store), savory buns in another and cookies and muffins in another area.\n\nParking was not too bad considering it was a Saturday morning.\n\nTip: cash only", "author": "Elaine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-17", "description": "I've been to many Asian bakeries in my lifetime and Pineapple King is just okay. Kind of dry, not too flavorful. Had tried the butter cakes (both green tea and regular), a taro bun, and a pineapple and cream cheese bread. I did like the taro and pineapple and cream cheese but something was a little off (maybe too artificial tasting? candied pineapple? I don't know). Not my favorite place to go to but alright for some quick bites.", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-26", "description": "Grand opening yesterday. That morning, I tried the ham and egg bun. The ham and eggs were pan fried and it smelled really good. All buns were warm and fluffy, freshly baked from the kitchen. Unlike Sheng Kee (on the same block)....their buns and bread are delivered from south san Francisco and then reheated. The cashiers were very polite. \nThis morning, I wanted to get the curry beef bun (drool~) but I had to wait 10min for the next batch so I got the BBQ pork bun and ordered the pineapple puff (2 for $1.50). Everyone had a BBQ pork bun before. There's nothing new and exciting about it but when it's nice and warm and fluffy....Mmmmm....  I was hoping the pineapple puff would be something like Beard Papa's cream puff filling in a pineapple bun. (hahaha....) But it was really just Chinese style custard pineapple bun. Oh, ok. Still very yummy tho.", "author": "R C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "I'm in love with the boloo....i got it for the low low....\n\nyea this place is the best. get the custard and butter one each and eat them all so you can order some more then eat some more of that too.", "author": "Vince L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "I'm in the car as I write this (in the passenger seat, of course!) and I just inhaled my Portuguese egg tart and Cha siu bao (bbq pork bun). \n\nThe Portuguese egg tart crust was flakey, and the filling was the most creamy custard I have ever tried! \n\nThe barbecue pork bun was out of this world. The bun was soft and buttery with ample bbq meat filling!", "author": "Mina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-26", "description": "I have tried their spam and egg sandwich a few times as a snack and quick breakfast. It's a great value. I don't think it is too unhealthy to have half an egg and a serving of spam. :) I enjoy this sort of bread that makes you kind of think you aren't eating as many carbs. I  also like the scallion bun and the curry beef bun. Everything is very cheap.", "author": "Regina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-28", "description": "WTF is this amazing goodness that is a pineapple bun sandwiching a cold slice of butter. I was suspicious at first but knew I had to try it and my only regret is that I got only one and had to share it with the BF. It's a must try!\n\nI'm from out of town so I got almost one of everything to try and it is ALL good.", "author": "Cindy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "Just another bakery that is trying to take business from Sheng Kee Bakery Cafe. Their prices are not anyway cheaper and quality about the same. Just a lot smaller store in a very busy intersection.", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-11", "description": "The smell in the store is amazing when you first enter...fresh warm asian breads and butter...what's not to love?\n\nI've had a few different baked bread items (can't speak for any of the cakes/tarts) and have been all around pleased with the tastes and textures. From the pineapple buns to the savory green onion buns there is a nice balance of fluffy bread with just the right amount of crunch and crumble on the outside. If you get to have a warm bread fresh out of the oven...it's heavenly. :-) \n\nThe prices are great too, though they don't take credit card (but most small places like this don't, so you can't really blame them.) \n\nRegular size pineapple bun is $0.80 and with butter it's $1.25. \n\nI still love Sheng Kee bakery but this is definitely going to be added to my solid list of Asian bakery options in SF that's just a little more specialized than the wide array offered at Sheng Kee.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-25", "description": "Chicken cookies, what?\n\nSeriously, I've never had anything like it. Doesn't happen often when I'm just out and about hunting for pineapple buns and you discover cookies that taste like chicken! But even if it's not everyone's cup of tea, the thought of it is pretty darn interesting.\n\nAs far as pineapple buns go, I like what these guys got goin' for them! They got the technique on point: the sugar must always cover the entire bun. No excuses! I picked up a dozen and they were extra tasty.\n\nAre they really king? So far, all signs point to yes!\n\nI need to come back again in the morning to try them fresh baked. Because there's nothing more disappointing than a day-old pineapple bun.", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "Called them 3 minutes before closing and asked them to stay open for me so I can drop by and pick up a last minute cake. Very accommodating. Door was already locked by the time I got there, but they still helped me out and even offered to write \"happy birthday\" on the cake rather than just rushing me out because they wanted to leave.", "author": "Tabitha W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "TAKES CASH ONLY. Great prices for traditional and new Chinese pastries.  Came after dinner before closing so choices were more limited but still plenty to choose from.  Already had dinner but just had to get a Chinese chicken bun.  Prices were very affordable, bread on the bun bun was of good quality and the filling not too greasy.", "author": "Tj W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-07", "description": "New Chinese bakery in Sunset serving baked goods and bubble tea! The store was clean and brightly lit and definitely smaller than Sheng Kee, another nearby bakery. This also meant less choices but I have to say what they did have was delicious. I got a hot dog bun and custard bun, and the hot dog bun was much better than Sheng Kee's! The plump hot dog bits and a soft bread topped with some kind of kewpie mayonnaise and cheese mix were delicious and tasted like it was really made fresh. Since it's new, the cashier was pretty slow and couldn't remember the prices of stuff, but I'm definitely going to come back to this place!", "author": "Grace C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "Pineapple bun with butter is a definite must have. It is the closest I've found in the US to the HK pineapple buns with butter. The bun was soft and warm and the butter was creamy. I think when I come here again, I will try get there right when the pineapple buns come out of the oven (when I had mine it was warm but not hot anymore) and ask if they can do double butter.", "author": "Cynthia Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "**CASH ONLY**\n\nReally fresh tasting bread. I got the pineapple bun, and it was really good however I thought there would be custard in it, which I didn't know til I left.. so when I found out I walked back in to get one with custard. The custard was good! Not too sweet, it was a good amount. I was debating whether to get the pineapple buns at this bakery or the one a few stores away but I liked this one because it was more simple and seemed more like a mom and pop shop. The people were really nice. My bf got the hot dog buns, they were pretty good as well, just not the best. I would definitely come here again if I was in the area.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-21", "description": "Went there one weekend,, there is no customer service, cashier only talked to the coworker, they dont care if the customer has questions.  I will not go back there again!!!! I  rather pay more to go to other bakeries, like paris baguette. They should go learn what customer service is !!!!!", "author": "Moon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-28", "description": "Best Pineapple bun w/ butter!  Made to order at only $1.25, say what?!?  Bun was soft and warm, crust was all around and crumbly & the big thick piece of butter - YUM!!", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "Definitely pineapple bread kings!\n\nOrdered the pineapple buns with original and matcha filling.", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "This place is amazing. Simple, Delicious. They have best pineapple bun in state.  I can literally go to this place and easy walk out with a pink box of bread. Guaranteed that it would be finished within a day. Their \"pineapple bun with butter\" is the best and its taste is exact what I ate in Hong Kong. If you're ever in the area, this is winner.", "author": "Andre L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-19", "description": "Basically yelled in our faces \"CASH ONLY!!!\" when I whipped out my debit card to pay. Terrible attitude and seem to be in a pissy mood whenever handling customers; they don't even greet or make an effort to talk to you. Baked goods look OK but because of their rudeness I will NOT be coming back. Learn some social skills! And put up a sign warning customers of your \"cash only\" policy in plain sight.", "author": "Kaithlen P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-08", "description": "Pineapple King Bao are average. They are not exceptional great or bad. This review is about their lack of common sense service. I bought 7 baos and the lady stuffed them Into a paper bag. I asked if she can place them into a pastry box to avoid them smashing and  instead her response was I was 1 bao short of \"qualifying\" to get a box. Yes, I could have paid for 1 more bao but I didn't feel that I had to. I understand if I bought 2 baos and asked for a box but 7 baos stuffed into a paper bag is stupid. Bad business practice. I will never return.", "author": "Ellen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "This was my first time at P.K.B,and I found the customer  Sam service to quick and friendly,the items I ordered Fresh and delicious especially the Pineapple Bun with Butter ooh have mercy that was good.I would totally recommend visiting this place.Thumbs up and 5 stars.", "author": "Fred S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Delicious pineapple matcha puff! Make sure to eat them fresh, will try again\n\nThe lady is super nice too, if you don't know what to pick, just ask =)", "author": "Alex C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "Very good pineapple buns. There's many varieties: plain, custard, sesame filled, butter filled.", "author": "Sonny V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "Randomly saw this place one night walking by and could not wait to come in during open business hours. As you can imagine, for someone who LOVES pineapples, I was very disappointed when I realized that there was barely anything in there that was actually pineapple flavor. Broke my spirit and excitement for that day. Very misleading name. \n\nHowever, I did not hesitate and tried like 10 other different things. \nMy favorite on the list was the Half Moon Sponge Cakes (coffee flavored). Wold come back just for that one alone.", "author": "Maddie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "Best bo lo bao ever. My favorite place to go for it :)\nVery affordable too! I highly suggest this place if you love pineapple bun", "author": "Sandy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-17", "description": "I have mixed feelings about this place. Their pineapple bun was ok but I was definitely confused when I walked in. This place is extremely small. There are menus on the walls above the cash register area. You can also pick pastries up from the side onto a tray. (Trays are next to the register).\n\nPro:\n-Pineapple custard buns are good and affordable!!!! ($1.50 for two)\n-Other pastries were not bad.\n\nCons:\n-Cashiers doesn't speak English. It was a bit hard to communicate. \n-Extremely slow service. I was the only one in the store before others started coming in but my 1 order of pineapple custard buns still took about 5 mins. \n\nI have high hopes for this place. If they were faster and got more experience, I think this place will do ok!", "author": "Mai W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-09", "description": "When it comes to Chinese bakeries, they don't compare to some of the ones I've tried in Hong Kong.  I still dream about the coconut bun at a bakery at the ferry dock.\nSo, there are a couple of buns I compare from bakery to bakery to see which ones I like better.  The coconut bun here is OK, not as much coconut as I'd like and I definitely like the ones at the Sheng Kee Bakery down the block better.\nI didn't so much like the green onion/bacon bun here and don't really like it that much at Sheng Kee either.  My favorite bacon/onion bun is at the Sunset Bakery on 9th/Irving,\nPeople seem to like the bun with a slice of butter.  I might make a return trip just to try one of them. It is a much smaller storefront than Sheng Kee and they have a more limited inventory.  When I was there a couple of weeks ago, it was cash only.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "If you are in need for a quick super cheap place to eat in the area look no further. I've been three times and am officially a fan. \n\nThe pineapple bun with a cold slice of butter is fantastic but my favorite is their bun with custard filling. That or one of the breakfast buns runs you about $2 and is more than enough to fill me up. \n\nGood for a quick breakfast or snack, cash only but you literally only need $5 to fill you up.", "author": "Jethro P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "Ordered a BBQ pork pineapple bun and it was really really yummy. Probably one of the best pineapple bun I've had in the Bay Area and it was only 89 cents! Granted it a small bun...but packed full of BBQ pork and so worth it. Really want to come back and try the pineapple puffs you order at the cashier!", "author": "Bonnie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "This location is where the old Honeyberry store used to be (RIP Roti Buns, I miss you so much). And if you've been to Honeyberry, you know how small that storefront was. But it didn't stop me from squeezing in every corner to check out Pineapple King Bakery's pastries.\n\nThey have a wide variety of pastries - egg custard, cocktail buns, ham & egg rolls, pork buns, etc. They all look really fresh too, as I could tell when I pinched them with the tweezers to grab some of the pastries to put on my tray. \n\nIt's cash only. But the prices are fairly cheap! I had a total of 6 items and I paid less than $5 for all 6 ($4.95 to be exact). I know most bakeries don't charge too much for their buns, but if I bought the same amount at Shengkee Bakery down the street, I probably would have paid close to $10.\n\nDefinitely coming back here whenever I'm in the area. I love the cocktail bun! The bread was so soft and the filling wasn't too sweet. Mmmm. Perfection.", "author": "Liezel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-01", "description": "Matcha puff was nice and warm, tasted like custard bun. Highlight was chicken cookies. Otherwise, a typical HK bakery.", "author": "V L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-13", "description": "New Chinese bakery on Irving. I noticed this place when it was under construction. My mom brought home some pastries like beef curry bun and a lemon roll. I thought it was good.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-23", "description": "It's your typical Asian bakery, serving up your usual choice of pastries: hot dog buns, custard tarts, sesame balls, pork sung buns and what not. The buns were nice and warm and the workers try hard to keep fresh buns coming out of the back.", "author": "Brandon N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-05", "description": "The most disgusting pineapple bun I've ever ate. Freshly made pineapple bun with a thick block of butter in the middle. Extremely gross. It's a perfectly baked pineapple bun gone wrong. They put wayyyy too much butter in this thing. I would not recommend.", "author": "Baldwin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "The best pineapple bun and cocktail bun I've tried yet! And I've tried several. Come if you need a good snack or comfort food.", "author": "Kimberly C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-12", "description": "I just ordered a quarter sheet cake from pineapple king for son's 6th birthday.  I love their cakes and buns but this cake was a disappointment!! You will know what I mean if you see the picture! I did made some changes on the colors but this cake look ugly period.  It didn't look professional at all..... I think I can do a better job on the cream!!", "author": "Chu Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-07", "description": "I walked by the other day and I decided to give them a shot strictly because of their name as \"Pineapple King\".  If you grew up in Asia like me, you should have heard of \"Pineapple Bun with a thick slice of ice cold butter 菠蘿油\".\n\nWell, enough talk and let's cut into my review.  Pineapple bun is below average compared to other bakeries.  The crust on top of the bun was dry, not crunchy, and not sweet at all.  Moreover, their buns were a little chewy as well.  Something just wasn't quite right on their baked goodies.\n\nPlace is small, but clean and well organized.  Staffs are friendly.  However, they accept CASH ONLY, which is not quite convenient for some people.\n\nTip:\nThere are some better alternative bakeries if you walk further down the street.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "My favorite pineapple buns in San Francisco!  Not only are they decent sized and well-priced, but they have that awesome moist chewy texture that a lot of places fail to make. Pineapple King is a little cramped - it's a small place that you pop in and out of - but it's FULL of pineapple bun options. Regular, mini, taro filled (favorite!), sesame, red bean, pineapple and custard. The lotus bun is also really good.", "author": "Michelle Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-16", "description": "I was so excited to learn about this place before it was opened. Growing up in Hong Kong, pineapple buns are one of its delicacy that we grew up with so when I heard about this place, I was imagining how it would bring back a lot of childhood memories from my home place. This little shop is located in sunset so parking is not the easiest, but it was decent for a Sunday afternoon. I thought this place would serve more different types of pineapple bun, but it's really just another chinese bakery shop with maybe around 4 different types of pineapple bun (while I was there).\n\nYou would walk in, take a tray, wonder around the 3 display cases filled with bakery goods and choose whatever you like. You bring your tray over to the cashier counter when you're done to tally up your tab. Then they have their specialty, pineapple bun with custard or pineapple bun with butter that's listed on the menu where you have to order with the cashier (they also serve hong kong style milk tea, but my friend said it's not great). I ordered one of their pineapple bun with butter for $1.25 each. When it came out, the cashier told me to eat it while it's still hot. I grabbed it and it wasn't hot at all, it was luke warm, but not hot enough to melt that slice of butter they have wedge between the bun. It wasn't too bad, nor it brought me back to HK singing on top of the hills. It's soft bread with the crunchy top custard is decent, but the ones in HK just melts in your mouth, this one didn't do that. To sum it up, I think this is just another bakery with a little bit more pineapple bun to choose from.\n\nWill I visit again? I don't know, maybe if I'm in the area....", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "Very good customer service. The cashier is a very good sales person. The pineapple bun with butter is very good but it's also very heavy. I like that they have mini pineapple buns. I will come back.", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "This is my favorite bakery on Irving.  The girls behind the counter are always helpful and would warm up the buns if you ask them to.  The milk tea is decent as well.  If you catch them at the right time, the fresh out of the oven pineapple buns are soooooooooooooo good.", "author": "Katniss B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-05", "description": "I'm a sucker for breakfast pastries, especially asian baos, so I needed to give this place a try!\n\nI came here one morning as soon as they opened, and oh my goodness, the shop smelled great! All the baos were fresh out of the oven, and trying not to drool right then and there was one of the most difficult things I have ever done!\n\nI ordered a few pineapple buns, one with a custard filling, one with a taro filling, and one with a red bean filling. The baos were a little flat and no where near as puffy as other ones that I've had fresh. I personally did not like the filling to bao ratio. The baos were a little doughy for my liking. I thought the baos could have used a little more filling to better balance the baos. My favorite of the three was the red bean. The level of sweetness was perfect, and the red bean was really flavorful. The taro was good, but a bit too sweet for me. The custard was okay, but you could definitely find a better custard filled bao somewhere else.\n\nI also ordered a coffee bun and egg tarts. I didn't get a chance to try the coffee bun, but my friend said it was really good, and that it tasted even better than the pineapple buns. I was not expecting much from the egg tarts, but the tart was surprisingly flaky. However, there was way too much sugar in the custard, which made it taste a little off.\n\nI plan on coming back soon to try the pineapple ice cream bun and the pineapple puffs!", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "This new bakery opened up very recently to take over what used to be Honeyberry, and I'm glad it did! It's set up just like any other Asian bakery with the self-serving from the display cases. Although the space itself is very small, they do know how to bake! The custard bun and dried pork rolls are my favorite so far, but the pineapple taro and regular pineapple buns are pretty good too. I think everything is under $2, and I personally think it's much better than the Sheng Kee chains.\nUnfortunately, their selection varies quite a bit day-to-day (or I guess you can see that as a fun positive) so you can't come back with the guarantee they'll have what you want that time/day. Apparently one of the other reviewers claim that you can put in a request though and they'd have em ready for ya! I have yet to test this.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "Love this new start up bakery! Just opened a month ago and right across the street from tpumps. All the pastries are so cheap, for ex.  the pineapple bun for only 80 cents! The ladies are super kind and they provide samples too. All the pastries are made fresh every morning. They sell boba too, at around the same price as tpumps. Haven't tried it, but I guess we'll see how it competes with its competitor across the street.", "author": "Hannah C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-11", "description": "This is just a 'pineapple oil' wanna be. If you had tried Liddo's pineapple oil in Richmond, BC, Canada, you would say it's no competition at all. The pineapple bun here is not fluffy at all. Traditionally, the butter must be a slice of salted butter, but they just inserted a slice of regular butter.", "author": "J L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-01", "description": "Oh man...this place totally satisfied my bau craving! Not to mention my chinese birthday cake craving (strawberry shortcake slice). It had been a while since I had bau or anything chinese, so I was excited to walk around the neighborhood Saturday morning in search of some good bau. The price is right and the bau's are tasty. I especially liked the spam and egg bau....mmmm!\n\nCan't wait to go back! :) The fiancé liked the baus, too!", "author": "V M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-25", "description": "The pineapple bun here is super doughy and the crust is too loose for me. I much prefer the crust  from GGB and the pineapple buns at that one dim sum place on Geary that's always busy. I did not enjoy their products as much as I'd like but maybe others will.\n\nRoti buns were better quality overall. So sad that they had to go :(\n\nI recommend: \n* Pineapple bun with butter\n* BBQ pork pineapple bun (kind of salty though)\n\nPeople seem to really like the custard filled ones. They're alright. It seems that the custard is piped into the bun and not baked in. \n\nThe space is awkward to move around and it's always really busy. As that old Chinese dude in the store says: \"It's cheaper than Beard Papa.\" \n\n(Although they're not comparable!)", "author": "Margaret S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-09", "description": "Pineapple bun w/custard filling - Nice crunch, soft bun and silky smooth custard. Made to order. \n\nHK Milk Tea - Not Good!  They used the right kind of tea to achieve the flavor, but their people are not trained to make a proper cup milk tea. It tasted astringent and not velvety smooth.", "author": "Samantha E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "I'm a sucker for pineapple buns so I was thrilled to try this place. \n\nI just got the regular pineapple bun because I wasn't aware that you had to order the pineapple custard puffs at the registered until I left. Oh well (another reason to drop by another time). \n\nThe buns I got were from a new tray so it was freshly made. It nailed my expectations of a stellar pineapple bun. The top part was crumbly and the bread itself was soft yet a little doughy, just how I like it! \n\nDefinitely coming back to try the custard puffs.", "author": "Emily M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "They have Chicken Cookies, how many places can still make those things...5 stars for offering that....  Good alternative to Sheng Kee, mom and pop bakery that caters to HK peeps..  The pineapple bun is really good....", "author": "Good A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "The crack filled cocktail bun gets a 5-star rating. Bought it for 60 cents on a whim and went back for two more. No seating so plan on taking it with ya.", "author": "Heather M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "Such a small hole in the wall. Some of the best pastries inside!! Pineapple bun with butter was to die for!", "author": "Tia Marie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-27", "description": "This is only for the pineapple custard bun. Warm it up in the microwave for 20 seconds. Super yummy! A bun of goodness!", "author": "Karen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-01", "description": "an HK mimicker but not the same.  offers pineapple buns with butter, and some other pineapple bun contents inside like taro and sesame.  however sloppy baking and flavor of buns like bbq pork just ok", "author": "Rob C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-21", "description": "My impression of this place was pretty good after my first visit. However, my second visit was totally a disaster. So I ordered a cake by phone. It was the green tea cheesecake. I asked if they are able to replace the chocolate pieces with macaroons. They said SURRE they can. The lady on the phone also asked the other coworker if there will be an extra charge, she made sure if was a NO. So she confirmed with me that the cake will be 29$. So I came in today to pick up the cake, the cashier said it is impossible for the cake to be just 29$. Since you added macaroons your total will be 48$. Are you serious? Your coworker was the one who made the mistake though.", "author": "Annie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-27", "description": "Ask for a warm pineapple bun at the counter. All of the other pastries I've tried have been passable to decent, but the pineapple bun is delicious. Don't forget to bring cash.", "author": "Tina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-20", "description": "Had the mini pineapple bun, pineapple pastry, and cocktail bun.   Reasonable prices. Super fresh. Loved the flaky pineapple pastry!   So delish!!\n\nCash only.", "author": "A L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-20", "description": "01.16.16\n\nSame block as sheng kee \nLots of people inside even tho it's a small place - so has to check it out\n\nCashier was friendly and quick. \n\nGot a spam and egg bun and pineapple bun to try. \n\nThe spam and egg bun was not bad. Only 1/2 of an egg inside tho. \n\nPineapple buns were good.", "author": "Jay R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-13", "description": "This place is cheaper than Sheng Kee Bakery. Pineapple King Bakery's quality is not as good (compared to Sheng Kee). I thought the products I got lacked flavor. The egg tart was ok but it was nothing special. I don't know what the black specks in the half moon lemon sponge cake were but it made me wary about the freshness of the product. Also, I didn't like how some of the lemon cream in the sponge cake were dried and a little crusty at the edges. I think their customer service makes up for the quality.", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "Love their fresh make pineapple bum!\n\nThey are crispy outside and soft in side. I recommend you eat it right after you buy it, taste so good. Try that one with filling which is 2 for $1.50  , and the one with butter $ 1.25. \n\nPrice is very reasonable, people over there are very friendly!  5 star, no doubt!", "author": "Sina X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "Best Mango Mouse Cake I have ever tasted. Got one for my mom's birthday and all the guests love it.", "author": "Carlos S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "New bakery in the Sunset District. Best pineapple bun I ever had, nice crunchy top. Must try the savory cake rolls and mango mousse cups. So yummyThey also serve Hong Kong Milk Tea and iced Boba drinks.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "the buns with custard filling are over the top! SO GOOD! In fact I have sampled a lot of the\ndifferent baked goods and have enjoyed them all. While the place is very small the staff\nis very fast and very pleasant.", "author": "Peter F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-29", "description": "I got the Pineapple Taro bun, and it was pretty average.", "author": "Vivian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "There may be little in life better than a freshly baked hot pineapple bun with a thick slab of butter from the Pineapple King. Seriously. From the crowd picking up trays filled with pastries (compared to the empty ShengKee next door), clearly the other stuff ain't too bad either.", "author": "Andy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "Pineapple buns with butter are fantastic. If you ask, they will put a thinner slice of butter to help reduce the amount of guilt you feel while munching on it.", "author": "malhardes D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "I was very excited to see this place take over the old Honeyberry/Crave location. This location hasn't seen much luck for the last 3 iterations, however Pineapple King Bakery seems to have figured it out. Pineapple King is probably the next best thing after Sunset Bakery (my favorite place for pineapple buns) and is a huge improvement over Sheng Kee. Their baked goods have been fresh every time I've visited and they have a few offerings that I haven't seen at an asian bakery in SF before including winter melon cakes. The baked cakes in the fridge window seem to be so so, but what I would make sure to try here are the pineapple buns. I love how they also sell mini pineapple buns for anyone wanting just a small snack. Be sure to try the cream filled pineapple buns because they are a great treat! The floorplan is a little weird which makes it hard to navigate around the line to the cashier to gather up all the baked goods you want to try, but overall it's a small inconvenience. Service is friendly and tries to be quick. The bubble tea is a little sweet, but overall not bad. Boba is nice and chewy and seems to be fresh.", "author": "Alice H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "why did my cousin-in-law from Ohio introduce me to this place?!? lol!!! well i am glad she did, prices are so reasonable and the pineapple buns are delicious especially hot out of the oven! the pineapple bun with butter was too much for me but the one filled with custard is like the bomb dot com!", "author": "Rosa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Walking up Irving street hungry looking for some quick bites. Pineapple king caught my eye. You would not find any pineapples here though. Neither will u find anything Made with pineapples. It's a bakery with pineapple buns as the main pastry item. Again, not made with pineapple Grab the pineapple bun with butter. Eat it with an hour. Soft and buttery heaven .....I will come back for more", "author": "Lory M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-25", "description": "The pineapple bun, egg tart and chicken tail bun were great, however when you order the pineapple bun with butter that would take you to wait at least 15 minutes.", "author": "Willem L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-10", "description": "Ordered: Palmiers, cake roll, and a BBQ bun. Disappointed in all. Palmiers were not light, crispy and buttery at all. It was pretty heavy and stale tasting. I love cake rolls from asian bakeries because of sponginess and not being too sweet like most american bakeries. The cake roll here was so dry and dense. On to the BBQ buns it didn't have that sweet sticky gravy inside.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "Didn't think any bakery shop can survive near Shengkee but it does. Love the hot dog bun, luncheon meat bun, coffee buns (actually crunchy out of the oven),and greentea spongecake (kids love it).  Will definitely try the butter melted pineapple buns since it looks nice and fresh!", "author": "Annie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-02", "description": "Pineapple butter is kinda good. I came from Chinatown to sunset to buy pineapple butter but I later found out I ended up just a bun without the butter. I was mad", "author": "Judy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-15", "description": "this place is a ways away from anywhere i'd consider my stomping grounds but so worth the trip.  i went there as a plus one and a pineapple bun virgin.  there was some trepidation as i generally loathe pineapple (don't judge, pineapple lovers) but i was delightfully surprised that \"pineapple\" of the name refers to its crown of sugary/buttery crust.  inside is pure, fluffy, moist deliciousness...a party in your mouth.\n\nbeing a novice, i liked that everything was labelled and on display.  the prices were so amazing for sf (or for anywhere for that matter) that i wound up trying a lot of them (the pork bun is a perfect blend of savory and sweet) and took some home that were still great the next day. they're a perfect snack or light meal. i had one for breakfast with a cup of coffee...awesome.\n\nthe staff there were completely charming and helpful and were making everything fresh and they should collectively run for mayor, which added to the whole experience.  i'll definitely be back.", "author": "Jason Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-26", "description": "I walked in and asked for cocktail bun, the lady at the front said it's on the self serve display case, but she offered to check since she is not sure there's any left.  She put on the plastic gloves and open the case, I had to stopped her right before she grabbed the bao, \"miss, you can't use those gloves to grab the bun since you used it to open the display case\".  She paused and said, 'ok, you grab it yourself and handed me the bag'.  I don't mind the self serve, but I am done with this place.\n\n1. Pineapple Custard/puff -- custard flavor is good but it is way too doughy.  You probably get 1 teaspoon of custard per bun, I mean, seriously?\n\n2. Cocktail bun --dry and doughy\n\nWhat makes a bun/bao good, the fillings.", "author": "SF F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-05", "description": "Adding pat of butter to my fav bun? Brilliant idea right? I am greeted with a friendly face and asked if it's my first time visiting. I shyly say yes and order my bun. The lady taking my order is super nice and hands me a fresh warm bao and tells me to eat it right away while it's warm. There is nothing like the first bite. Slightly crispy, the topping quickly turns into crumbs and forms a mustache on my upper lip. Then the butter hits you. Awesome.", "author": "chi l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-25", "description": "Not my kind of pastry, but they make it only after order.  Price is cheap so worth a try it's it fits your palette.", "author": "daphne w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-05", "description": "Nothing special about the pastry here. The cashier didn't even know what items I have on my tray and how much to charge.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "This place is a good find.  I like the buns better than next door Sheng Kee.  The prices are better too.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "The kids are immediately hooked with the pineapple bun with custard after trying it!  They have become one of our favorite breakfast options.  And We like the smaller size ones, perfect for small afternoon snack and for the kids!  One of the best places in SF (the other one is in Inner Richmond so finally has a good one in Sunset) for pineapple buns!", "author": "KK C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "Ive noticed pineapple king bakery while heading to bank of america so i decided to pop in and see what they offered. Im not an expert on pineapple buns but god dammmmmm their pineapple buns are delish!! And prolly best in town. I ordered the pineapple bun with butter and also the pineapple buns with custard.. Both were awesome. The milk tea is not too shabby too, i will definitely go back to try other goods.", "author": "Molly M m."}
