{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "If you're craving pizza and are walking down fishermen's Warf , this is def the place to go to .\n\nI ordered cheese pizza, all slices are 3.99 and 50cents extra for each topping added.\n\nThe prices are fair , and the pizza was pretty good !\nThe crust/dough was just the right amount of crunch - it wasn't over cooked or undercooked.\n\nThe offer , SM, MED, LRG or X LRG pizzas  & plenty of toppings to choose from s\n\nInside is pretty roomy , but then again we came here around 10 at night , so I'm not sure how busy it gets in the day time .\n\nAll and all, I really liked this place and the gentleman working was really nice .", "author": "Melissa E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "I'm confused as to why people are saying a slice of pizza is $7 because the real price is $3.99 + $.50 per topping which is not bad at all considering the slices are very large and most places around these touristy areas can get pretty pricy\n\nMy experience here was very pleasant i was walking around the area and started to get a little hungry and since this place sells by the slice it caught my eye the service was friendly and my two slices of pepperoni came out quickly with no issues \n\nAs for the pizza i wasn't expecting it to be too great but it actually ended up being pretty good and it definitely hit the spot the slices are really big and there was a perfect amount of everything so as far as i'm concerned it was good pizza i mean it's not nyc pizza but it's definitely pretty good", "author": "Grace H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Great place for late pizza.  Thin crust and served by a nice little old man.  It was really slow when I went, but I think it should be busier.  This is definitely a hidden gem near the pier.  \n\nI'll be coming here again if I'm ever in the area!", "author": "Nathan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "This is my go-to pizza place when I'm in the city. Others might be better, but I've had no reason to try them. A great thin crust, nearly NY style pizza that holds a gold and has great flavor from the toppings (they dont scrimp) and the dough.", "author": "Chad P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "Ambiance falls short, but the quality of the pizza is pretty good for this tourist area. Sold by the slice as well as by the pie. \nFirst impressions the crust hold up to the New York Fold, allowing you to bit the first bite that holds its shape and not fall. Nice firm crisp crust with soft center cooked in authentic pizza oven. Service was fast and friendly.", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "Not a place for pizza snobs. But maybe it is! $4 for a good sized slice of pizza is a good deal. Tasty. Well-made. Handy if you're in need of a slice. Try it. You may like it. We did.", "author": "Frank L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-25", "description": "Walking around, we spotted Pizza Zone which was not too far from our hotel.\n\nIt was open late and we saw that they sell pizza by the slice. The employee was friendly and quick. Our cheese and pepperoni slices were wrapped and ready to go neatly. There is plenty of indoor and outdoor seating. They also offer whole pizzas, sandwiches, salads, garlic bread and buffalo wings. We enjoyed our pizza. I wouldn't say this is the best pizza out there but we were grateful that they were open late and the portions are very generous. \n\nIf you're in the area and looking for a quick bite to eat, this is a great option.", "author": "Kimberly J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "Loved it. Tasty and not too expensive. Huge slice and ice cold beer. Downside was the lady at the counter count not speak or understand English it made it really hard to order.  Nonetheless I'd go back and recommend it to my friends.", "author": "Cindi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "Amazing customer service. Beautiful food. Pizza so good and made fresh. We got to watch him roll out the dough and everything. AMAZING.", "author": "Renata S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-16", "description": "This place is just slightly off from the main parts of Fisherman's Wharf.  It's decently priced, but it did seem like it took awhile to get our 2 slices of pizza.  As far as the actual slice, it was pretty tasty, but it's hard to accurately know how good something is when you're feeling completely famished so you inhale the pizza.  Either way, this was an easy stop for food which worked for us.", "author": "Jamie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-03", "description": "Pizza by the slice or get a pizza to take home.  We stopped by for a single slice because my nephew wanted some pizza.  All of the pizza is pretty much premade cheese pizza that they add whatever toppings on top of then warm it in the oven.  While there is nothing wrong with this, it is just not my type of thing.  $5 for a single slice of pepperoni pizza seems a bit high but you are in SF and this location is within very close proximity to Fisherman's Wharf so the rent has got to be high.\n\nThere is indoor and outdoor seating and there are restrooms for use across the street.  If your looking for a quick slice and don't want to wait more than a few minutes, then stop in.", "author": "Angela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "We stopped by another pizza spot across the way before coming here. Their prices here are much more reasonable, we liked the hole-in-the-wall atmosphere, and the pizza looked and smelled good. \n\nWe ordered a small half cheese, half pepperoni and a large half pepperoni, half sausage. The service was nice and quick and the folks who worked there were really friendly. The ingredients were FRESH. We literally watched the man behind the counter peeling and slicing onions for the pizzas. \n\nThe pizzas did not disappoint. I don't know how to describe it except it was really good pizza and it tasted exactly the way it looks and smells.", "author": "Ronna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Delicious pizza slice and great service !!! Hot and quick and good! Open late too ! They also serve beer and ice cream", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-10", "description": "Pizza is great. Very big slices. Great prices too! I come here everytime I vacation in fishermans wharf. The man working there is very friendly if you start a conversation with him!", "author": "Monica P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-20", "description": "Its below average.   I think little crashes is better and that says a lot.   Went to have a snack after the haunted dungeon, opted for this place as opposed to other pizza place across street.   The crust is bland, sauce full or oregano, cheese has no flavor.  Our cheese slices were dried out, no grease from cheese, just rubbery, stretchy white gooe.\n\nThe 2 stars are first the extremely friendly man behind counter.", "author": "Robby W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "My son and I were in San Francisco for the evening. We stopped in the Pizza Zone and it looked and smelled great. I love east coast pizza and this was very good. We ordered the Cheese Pie with extra cheese and we ordered a pepperoni pizza. Both were great pizza's. The crust was cooked to perfection.", "author": "Tom W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-02", "description": "I have mixed feelings about this pizza spot.  My son wanted pizza and loves New York style pizza so we were looking on Yelp and came across this place.  Ordering was easy enough as they basically have cheese pizza and then add any topping you want to it and put it in the oven.  My son wanted pepperoni so this was simple.  Now, I understand this area is touristy but still, I have a hard time paying almost $5 for one slice of pizza.  At least they did put a good amount of pepperoni on the pizza did look decent.  My son really did enjoy it.  The service was fine, pretty much what you would expect.  There were no restrooms in the restaurant but there were some across the street and the gentlemen at the counter gave me the code needed to enter the restroom.  Overall the experience wasn't bad, just over priced.", "author": "Ashley E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-14", "description": "From what I have found, if you are craving pizza by the slice in Fisherman's Wharf, this is a pretty good spot to choose.\n\nI work across the street and I'm on my second tour of duty in this area.  Pizza Zone is a solid place to get a $4-5 slice of pizza depending upon the toppings.  They also do full pizzas, and I am not quite sure how those turn out, but I think based on the rest of the experience that if you wanted to grab a pie and take it back to your hotel room you would probably be more satisfied than some of the other options.  I have been happy getting my made to order slices done up right when I am craving a workday slice.\n\nWhy do I like it?  \n\n1.  Slices are not all sitting under a heat lamp.  Eat one is put in the oven and loaded with toppings to order.  The toppings are quite generous.  (See Photos)\n2.  I personally love the slices.  They have some heft and have a very crispy crust.  Some pizza aficionados would say that the crust is over cooked, but I feel like it works given the density and amount of toppings.\n3.  I'm a big hungry Viking, and I never leave feeling cheated.  \n4.  It's no-frills, but there is a certain amount of effort that has been made to make this a nice place to be.  It's got a good vibe.  Vibe is key.\n5.  I trust the staff.  They get the job done and seem invested.  You won't get someone's BS nephew slinging you garbage here.  (Heh...  I bet you've met that guy at a pizza parlor.)  Again, good vibe.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "We got a pizza here to eat at our hotel.  Visually the inside and outside of the restaurant is not very appealing.  The pizza tasted great and was ready about fifteen min. after ordering.", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Walked in after a long day of taking in the sights. Ordered a pizza and the man behind the counter said he would have it in 10 minutes. He got me the pizza and beat the time he promised. The flavor was good and I would definitely swing by again when in town.", "author": "Luis P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "I was here for a quick bite. It was night time, there was no pizza by slice. But the guy was really fast with making me a small cheese pizza and it was soooo good. Iam a cheese pizza fan and in fact just by talking about it brings water in my   mouth. The guy was also nice enough to tell me that if its during the day i can call order, park in front and run in to quicky get my pizza. I think thats pretty amazing. Just coz its sooo hard to find a quick to go food when you are driving and parking is atleast two blocks away.", "author": "Pritika M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-13", "description": "Friendly owner who greeted you at the door, he had pizza ready to go for us. The slices are very big, you add toppings and he heats it up for you. Convenient location and good to see small local looking shop amongst these big places along Fisherman's Wharf. Good price, hit the spot before going to get ice-cream. \n\nMinus one star: The people who came in after didn't have pizza available to them, we could have been them. He mentioned that I should not get 3 cos the pieces were big, I needed 3 though.", "author": "Charles Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-10", "description": "I raved about the specials here and how good the prices were. But they took away the special and now what used to cost $7 now costs $13. Almost double the price!! No way will I continue to buy my pizza here. Bad business to up the price so high. Sadly, they have lost my business.", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-02", "description": "I was in the City looking for a good pizza place and we decided to stop here. The place is small, but clean and pretty good prices. The cashier upset me a little because it's scorching hot outside and I wanted cups of water for my kids and myself. I know free water isn't mandatory, but he said he'd get us some AFTER he cooks the pizza. He kept insisting he'd do it after. So im just like okay whatever by then. The place had no AC on so we decided to eat outside. The pizza came quick and it was pretty good. Other than a couple homeless coming up to us and asking for money or food, it was okay. I may or may not return. The whole water thing just rubbed me the wrong way. P.S. I ended up buying a regular size bottle of water for 3xs the cost anywhere else.", "author": "Clarina N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-14", "description": "Stopped by here during Fleet Week.  As expected, everything is packed.  Was able to sit down here, have a slice of pizza and a beer and people watch.  Pizza was decent.  Price was lower the expected.", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-01", "description": "While walking down near Ghirardelli Square, my 8yr old son was in the mood for a slice of pizza, so of course, I whip out my phone and start searching for pizza.  We weren't looking for a full sit down place, just a spot where we could quickly get some pizza.  Thankfully, Pizza Zone popped up and we made our way there.   This place is exactly what we were looking for.  We popped in, the Asian man behind the counter took our order, and since there were four of us, we ordered a full pie, half cheese, half pepperoni.  There's a small amount of tables inside, which were all full, so we sat outside, as the temperature was mild.  When the pizza was ready, the man brought it out to us outside, along with plates & napkins.  The pizza was VERY hot, so I was worried the cheese would burn my kids' mouths, so we fanned it a bit and cooled it down.  To our surprise, the pizza was good and exactly what my son was in the mood for.  In terms of how I felt about it, we're from Long Island, which I consider the pizza mecca of the planet, so it's hard to compare, BUT, the pizza here did hit the spot after walking around the wharf area and visiting the aquarium.  My son was happy and that, after all, was the goal.", "author": "Herb D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "On a whim, we stopped in and are glad we did. We ordered the special. It was a slice of pizza, salad, and drink for $7.99.  The staff was friendly, food was excellent and the atmosphere was of a pizza shop you'd find in NYC. Definitely recommend!", "author": "Andy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-30", "description": "Last night in San Fran and we wanted something quick and yummy.  I am a native New Yorker so by nature I am a pizza snob and it is very difficult to satisfy me.\n\nFirst, there is nothing like NYC pizza so when I see a place, such as this that claims to be NY pizza, my doubt radar goes up.\n\nWe ordered a large pie, half cheese and half pepperoni onion.  It was ok--just not great.  It was a little doughy, and had too many onions.  As suspected it was not. Lose to NY pizza but it is ahead of most others that claim to be.\n\nGod spot for a quick bite, bit nothing special from a pizza standpoint.  Would have given it a 2.5 if I could.", "author": "Vinnie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-29", "description": "As a hungry vegan looking for a place to eat at 10pm Halloween weekend while dressed in my penguin costume. My girlfriend and I smashed a half and half pizza. \n\nMy girlfriend isn't vegan so her have had a cheese and marinara sauce base and mine was a marinara sauce base with all of the vegetables as my topping. \n\nOn top of the staff being extremely nice the pizza was incredible. They aren't shy on the toppings and the prices are fair. \n\nSo if you're ever looking for pizza spot in North Beach San Francisco come here it's awesome!", "author": "Michael J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "Was in San Francisco for a few days and came across this place while walking down the street. I was impressed with how crunchy my crust was. The taste was good and had descent flavor.  The asian gentleman serving offered exceptional customer service.  He was super friendly and eager to make my group happy!", "author": "Monica C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-30", "description": "This was literally garbage and I will not recommend this to no one at least for the shrimp and dry ass fries...", "author": "Johnetta J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-28", "description": "We were staying at the Courtyard across the street and looking for a late bite. Read the reviews and went to this place anyway. I decided to order a medium pizza instead of individual slices because I figured that it would have to be cooked fresh. I was right! A couple of people ahead of us ordered slices and I noticed the cashier pulled a large pizza box from behind the register from what looked like a bread box. The box had a large cheese pizza although some pieces had been removed. The guy took a few slices from the box and added toppings. By the way I didn't see the guy wash his hands or put on gloves after handling the register. I asked him to wash his hands before he started on our pizza. Oh, I ordered wings as well and they were awful. I'm only giving this place 2 stars because the pizza wasn't that bad. To be on the safe side, don't order a slice just get a small pizza that you know will be made fresh.", "author": "Angie's M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-14", "description": "Pizza isn't bad. Calzone was just a pizza the owner folded in half. I've worked at pizza shops, and there were many noticeable health code violations. Although, did not get sick, so that's a plus", "author": "Josh W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-11", "description": "The pizza here was pretty good, wings needed buffalo sauce but we're still good.\n\nSmall location, they sell beer :)", "author": "Jizzy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "After spending 50 hours on a train and having to eat from the same menu for several days we were ready to relax and get some carryout. The first place I started to go into was closing and the guy coming out said I did not miss much. I really did get lucky when I went across the street and found this place. They have by the slice pizza as well.", "author": "Virginia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "This spot is awesome. The guys behind the counter make you feel at home. Happy to great you and eager to put a smile on your face. \n\nMake the food taste 100-times better. \n\nSimple pizza but well worth the trip. I will definitely be stopping by on my next trip.", "author": "Manuel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-07", "description": "Yo, if you are not trying to be around a lot of people and still have good food & service this is the place. The owners are really nice & very on top of their stuff & it's cheap with good portions!", "author": "Luna V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-04", "description": "Average pizza but came out pipping hot.  Went there out of desperation and the staff was fine.  Only a few tables and notice most people order slices v whole pies. Simply put another average pizza place.", "author": "Robert C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Every time I'm in San Francisco this is a must stop place to go for pizza the crust is nice and crispy and the pizzas never soggy. I've never had a bad slice   so good!", "author": "Annie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-21", "description": "Pros:\n-Sells pizza by the (huge!) slice. \n-Nice staff\n-Conveniently located\n\nCons:\n-Doesn't offer chicken as a topping\n-Slices are not very fresh. They take cheese slices from a case on the counter, add the toppings requested and then heat it up in the oven with a bit of fresh cheese for a few minutes.\n\n--\nCheese Slice w/ Sausage (~$4/slice + $0.35/topping)\nI was bummed they didn't offer chicken as a topping and the freshness of the slices is questionable since you see them get microwaved after the toppings are added. I was hungry, so it was okay, but I'd recommend ordering a fresh pizza, even if you have to wait longer.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-26", "description": "Ewwww...the literally put a sliced lunch meat on a piece of pizza that had no cheese. Skip this place!\nOwner was screaming at someone the whole time in Chinese and the pizza tasted like cardboard.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-02", "description": "Delivery was within time-frame. Ordered a simple pepperoni and cheese pizza hoping it would be ok. The hotel we stayed at gave me their flyer when I asked for pizza delivery. Crust was burned around edges and it was barley warm when delivered. I wouldn't order again. Pizza itself was ok, nothing to rave about.", "author": "Brandy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "I fell in love with this place. Just a tiny little spot with hard working humans and good pizza. The gentleman working was unbelievably kind and the pizza was everything that I wanted. Best place to stop by for good energy and a great slice.", "author": "Shannon Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-19", "description": "We needed a reasonably priced restaurant for a family of six that wasn't going to be a long wait and was near our hotel. What we found matched all of our needs and pleasantly surprised us. The place wasn't busy but it was a Monday night and that was good news for us. That night, it was a one man show, and yet everything was made quick and tasted great. It isn't the best looking place but it's far better than any of the tourist traps around town.", "author": "Josh M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-20", "description": "Be aware when you pay with a credit card ... ask your receipt... We paid twice one the guy told us the credit card did not pass we pay cash and surprise the bank charged too....", "author": "Anne B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-22", "description": "We ordered a pizza to take out. The service was fine and price was fair. The pizza left much to be desired, it was soggy and not very tasty.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-16", "description": "I recently stopped into this place after a long day of riding public transit and walking around the wharf. They sell pizza by the slice, and also whole pizzas.\nIf you purchase pizza by the slice, it's made by a pre-made/pre-baked cheese slice that has been sitting around....kinda gross. It starts as a base, and they charge you per topping. The crust is really thin, but the pizza was extremely greasy, so greasy that it soaked through the plates onto the table. The thin crust, which I'm assuming is supposed to be crispy is limp and mushy. \nI also ordered a garden salad, which was super basic but the Italian dressing was decent. Sides of ranch are $0.50 each, American long neck beers are $3.75, bottled waters are $2.00 and drink refills are $1.00. \nThough it hit the spot, I don't think I'd return here, especially with so many other pizza options in north beach.", "author": "Marina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "Absolutely good place and pizza. Me and my wife enjoy our vegetarian pizza and recommended it. 15 minute and it was ready", "author": "Sharapudin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "One of the best pizzas I have had in San Francisco.  Can't wait to go back just for that delicious slice of pizza!!", "author": "Selene F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "Quick friendly service. Being originally from Massachusetts their price is twice what I'm used to. The cheese pizza is on point and had the palatable portions of cheese and sauce. My daughter had a garden salad which was of a portion bigger than I could handle. Today my family leaves happy and full.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "We got a custom combo pizza and cheese pizza.  Excellent price.  Friendly and prompt service.  Not really crowded.  We loved it!  Will definitely come back.", "author": "Rob I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-28", "description": "San Francisco is not blessed with too many over-the-counter pizza by the slice places like other cities. This realization came on Thanksgiving day 2014 when I was in the area and desperately in the need for food. In-n-out was closed, and the pizza place across the street only offered full pizzas.\n\nPizza Zone is a low-key sit-in with a few tables. A slice of pizza is about $6-$7 so not really inexpensive. Was it a New York pizza? No. Did it do the job? Yes, certainly. \n\nBasically how it works is you tell the guy what kinda pizza you want. He then decorates the slice, puts it into the oven, and 7 minutes you got your fresh pizza.\n\nGood for a quick bite. One of the very few pizza take-out options in Fishermen's Wharf, and open late.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "Good hot fresh with a lot of cheese. Crust is neither thick or thin..just in the middle. Very tasty 3.99/slice", "author": "Anna R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-30", "description": "The pizza here is delicious,  I think it's the cheese that makes it so good. \nWe ordered a regular pepperoni and cheese pizza. The prices are cheap considering The location. \nThey serve beer here but the second time we went we sat outside and took our own beer. \n(not sure if that's allowed or not but they didn't tell us anything) Definitely love this place, next time we visit SF we'll be coming back!", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-11", "description": "Pizza was not all fresh and tasted old. Overpriced and not very flavorful at all. Not enough sauce. They need to keep the pizza warm and ensure the toppings are fresh.", "author": "Vijay V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "Quick service, the gentlemen behind the counter was super nice and house combo pizza was yummy!", "author": "Julie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-13", "description": "I came here because this is where they filmed the \"Haus your sex laife?\" scene in The Room. I was not disappointed as the tables and chairs are still the same from 13 years ago! I asked the owner if this is indeed where Tommy shot the scene and he was happy to tell me that it was! He was friendly as he started showing me DVDs of trailers for The Room. He even made me coffee so I could re-enact the scene! As a New Yorker, the pizza wasn't a disappointment either. I usually hate places that claim \"NY Style\" pizza, but this was pretty good.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-01", "description": "Nice owner.  Pizza tastes old though.  Crispy bottom after heated.  Thin crust.  Can get pizza by the slice which is nice.  But Better pizza is only a block away.", "author": "Bart D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "I am not sure if the owner would see it this way (assuming the guy working there was the owner), or if the pieces I put together in my mind, to form the following vision, exist in reality. In any event, what I saw at Pizza Zone was one version of the \"American Dream.\" Forgive me that I cannot place the employees' country of origin, but they were East Asian. Let's just say, if you were greeted by either of them at a Chinese restaurant, any American who shares my same incompetence for assigning proper countries of origin, on-sight, would think nothing of it. To see the elder of the two tossing and stretching dough, to form the pizza I ordered was a spectacle...at least, at first. Then I realized that the only other employee there looked to be the son. I can't say it is the only place it could happen, but visions like this happen a lot in this country we share. A man can immigrate to the US, start a business he runs with his family, and together, they can make it work. An East Asian can make pizza, and delicious North End-style pizza.\n\nSo that this review isn't just about US patriotism, I'll say the ingredients were fresh, remarkably high in quality, my pizza was made to order by the same man who kneaded the dough, there was enough tasty sauce, and the crust was impossibly thin.\n\nMore than being courteous, and more than making and serving a superior product, Pizza Zone refreshed my need to pat this country on the back and say, \"You're doin' alright.\"", "author": "Zachary G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-08", "description": "Great flavors and fast service. First time I ordered a Hawaiian pizza and it was amazing. Second time I ordered, the pizza tasted watery and the middle of the pie was caving in. \n\nSeems like the dough wasn't given enough time to thaw before the pizza was made. \n\nOverall a great little place with ample sit down room. Be weary of watery pizza!!", "author": "Carmen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-24", "description": "Pizza was just okay. We ordered a chicken pesto pizza and is wasn't bad, but it wasn't great either. We also ordered buffalo wings. They pulled them out of a Foster Freeze bag that you buy from a grocery store. It was a little disappointing that they weren't \"made\" there if you know what I mean. Tieu put them in the pizza oven and I was a little hopeful that they might come out crispy. The skin was soggy just like you get when you make them at home in the oven. They didn't have blue cheese and a buffalo wing just isn't right unless you have the right dressing.", "author": "Grachia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-19", "description": "We stumbled into this place after another pizza joint in the area looked too busy for our time frame and I'm glad we did. The pizza was excellent and the man behind the counter (he was the cook/waiter/cashier) was friendly and our food was ready quicker than expected. Sometimes these places you find on accident are the best!", "author": "Brian D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-09", "description": "Was good, quick, easy & cheap!\nWouldn't say it was amazing pizza but it filled a hole for $5!! As opposed to paying$15 for other crappy food from Fishermans wharf!", "author": "Eliza K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-04", "description": "If you come in here without sky-high expectations, you won't be disappointed. If you're like I was -- hungry after a baseball game, staying at a nearby hotel, and not wanting to bother to go to someplace fancier -- then Pizza Zone will be more than adequate.\n\nPizza by the slice, or whole pies if you like. Didn't bother checking out what other varieties they offered, but at that hour, I wasn't going to bother. All I wanted was a cheap, quick slice before I lumbered back to our hotel, and Pizza Zone delivered.", "author": "Cee A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "Love this place!!!!! The staff is so friendly, the food was delicious and the prices were outstanding.  It's such an amazing little hidden gem in San Fran.  Definitely try the salami sandwich!", "author": "Chrystal C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-16", "description": "Pizza is great but DON'T GET A SALAD!\n\nI love the pizza & location is great but...\n\nThe person (a woman) that handles orders, money, answers phone, etc. also makes the salads WITHOUT WASHING HANDS between all these activities. So gross & unsanitary.\n\nI've seen pizza makers & even the delivery guy wash hands so that seems safe.\n\nMy advice after observing these practices? Unless you want food poisoning, avoid anything uncooked.\n\nPizza is made fresh, tastes good & is quick. Highly recommend any time of day. Open late hours, clutch.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-13", "description": "EEK-if this is considered good west coast pizza, I sincerely feel bad for the entirety of the west coast.  Being a Philly kid myself, I know good pizza.  And unfortunately this is not it.  \nMuch too greasy and Pizza Hut-esque for my taste.  And don't get me started on the wings.  I'm pretty sure they were raw.  \nI say that San Francisco should be left to what they do best, seafood!  Leave the pizza to the east coast.", "author": "Mallory D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-05", "description": "Kind of a small place but with seating.  Bottled soda only, no refillable fountain.\n\nPretty good slices. Crust tasty and crisp but not cracker-like. Not much cheese at first but more added after toppings. Generous with the toppings so well worth adding them at 35 cents each. Could have used a little more sauce though. \n\nGarlic bread with cheese was very good. A bit more Parmesan cheese would add do much since mozzarella is kind of bland.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-10", "description": "Its a 3.5 rate for me. The owner was really friendly, quick, and entertaining vs the well off establishments in the area. Pizza was good, not great, just plain good. Kinda disappointed it wasn't brick oven. Meat toppings were tasty and veggies were fresh, freshly cut. Ambience at daytime is a 3/10.", "author": "Omar M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-07", "description": "In the zone.\n\nIt's easy to dismiss Fisherman's Wharf restaurants, especially those with an uninspired exterior and average at best yelp reviews.\n\nBut this one holds surprises such as noticeable fresh and huge slices of cheese pizza and equally generous turkey sandwiches with freshly cut tomatoes.\n\nGentleman taking and filling orders couldn't have been nicer and more endearing. And that was before enthusiastically swapping mayo for pizza sauce on my sandwich.\n\nPair came to a more than reasonable $12. Planned to save half the sandwich for later in the day. Left with about a third remaining.\n\nSolidly in the four star zone.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "This place definitely deserves at least a 4 star average. Or maybe it was because we were starving? I don't think so, the pizza was excellent, fresh, and very reasonably priced for the location. A great option that was not far from the pier.", "author": "Eric T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-26", "description": "Amazing service and a great deal for \"one slice\" of pizza, it's really more like two slices.  Which was great because I was hungry.  And the guy working there was very nice to us and we didn't have to wait long for our freshly cooked pizza slices.  :D\n\nI'd definitely go back if I was there again and wanted pizza.", "author": "Michele S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "Got to give Pizza Zone 5 stars. The pizza is by far the best I've had in a very long time. It's ideal for a quick slice and cold beer. One of the best ventures we had while vacationing in San Francisco. We will be going back next time we're in town.", "author": "Audrey S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-24", "description": "A friend of mine has fond memories of this place so we had to grab dinner here.\n\nPros: Pizza is made to order and is reasonably priced.  Pizza has a thin crust and good greasy cheese topping. Tasty but average.  Bottled beer and soda available.\n\nCons:  Place could use a good clean.", "author": "Naomi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "I love eating here. The prices are fair the food is good there is a good selection of drinks. The man that is usually working has been there for 14 years and he is really nice.  You can get pizza by the slice or take a whole pizza I have done both. I recommend this place", "author": "Dustin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "Yelp is incorrect  regarding hours as they were closed at 1045PM last night. However I went there today and had a salad and Ham & Cheese sandwich.  Each was large and fresh. I don't like olives and dudn't know they came on the salad but I picked them all off. Others might be happy with the quantity.", "author": "Steve F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "We were looking for some good food in a hurry and decided on Pizza Zone. We ordered the BBQ Chicken Pizza and the Garlic Fries. Both were delicious. The service was fast, and they delivered right to our hotel. Overall, we're pleased with our selection and would choose this place again!", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-29", "description": "Pizza after a long night, why not? \n\nStumbled upon this place after leaving the Parlor. The choices we had for slices were pretty straight forward. We got a meat slice that came with sausages, pepperoni and mushrooms. The second slice was a veggie one that consisted of mushrooms, onions, bell peppers, and olives. I kind of wish we just got a simple cheese slice, because that's usually easier to eat late night. We had to wait a few minutes for the guy to toast up our pizza, but it totally did the trick. Not the best pizza slice I've ever had in SF, but it was better than having to purchase a whole pizza at the neighboring pizza spot. \n\nNice customer service. Prices are okay. I like that they heat up each slice to a good temperature and crispiness before serving it. The guy was really nice about cutting the slices in half so we could all share.", "author": "Vi L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-24", "description": "High prices - four bucks for a slice of plain cheese. No local discounts.  Nothing is made fresh, its all sitting out getting old. \n\nFor my single-slice purchases, I recommend these two, just up the street:\n\n\"Golden Boy\", for those of you who like thick-crust.\n\n\"Tony's Coal-Fired Pizza & Slice House\", for thin-crust napoletana.  \n\nBoth are close to some awesome bars.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-22", "description": "The service is sucks the pizza its dry and dosnt test good i order the shrimp and beef and mushrooms pizza it dry and barley has the topping on it ;(", "author": "Rasha Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "Awesome New York style pizza. Highly recommend. It is made fresh and the owner is very accommodating.", "author": "Michael P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-22", "description": "I was pleasantly surprised when I found this place like a block from my Hotel.  Knowing I had to slave in front of the laptop for the better part of the evening I decided this was good choice.  This pizza was pleasantly surprising.  You don't find may places who have thin crust pies like this anymore.  Once in a while you have to fold up a pizza to eat it...this was one of those nights.   Tasted great!", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-05", "description": "I spent a day at Fisherman's Wharf and represented San Francisco!  How you ask?  Well, I drank one of San Francisco's original beers, Anchor Steam.  Anchor Steam beer was one of the first breweries in San Francisco that started business during the Gold Rush.  That year 2 dozen other breweries opened, but Anchor Steam is the only one that survived!  So because of it's rich history, I feel like  I'm drinking history by drinking Anchor Steam.  it's the taste of San Francisco, and I drank another, and another, and another... fun fun fun!\n\n     So, by the end of the night after dinner, after beer, beer, and more beer, and after a carousel ride on a panda bear in high heals, and buying a yellow highlighter-colored pull-oversweater  that read, \"I Love SF\" in hot pink, which only tourist usually buy, I decided I was hungry again! By the way, Lover decided I shouldn't were a tank top in the cool of the night, hence the bright highlighter colored pull-over sweater!  Freakin Hilarious right??  Ao, we procceed to the end of Pier 39, passing the Anchorage shops, and we spot Pizza Zone.  A desperate need for liquid, and I mean liquid that actually hydrates, and a slice of yummy pizza couldn't of had smacked me in the face harder.  I asked the more than inviting pizzaman behind the counter for two slices of cheese pizza & a water.  but it really tasted like a slice of heaven and a tiny little cold waterfall in my mouth. \n\nAlthough my stumbled-steps took me there, my tastebuds remember that their pizza was some pretty good stuff.  It wasn't hella greasy, and the pizza dough was soft with a slight umph of crunch and to top it off (no pun intended), they had a shaker filled with oregano.  And that's my favorite herb, that's my word! I sprinkled it all over my heavenly piece of pizza, and it was an even better night.\n\nThe funny thing is that I just had to take pictures for my good friend Yelp, and I took a photo of a poster with pictures of cheese and pepperoni pizza, with the prices on them, next to the register, and the pizzaman said, \"Why are you taking a picture of that pizza, take a picture of your pizza\". So i did.  but I really liked that lil poster, it's like their \"easy to read menu\". It seems that people either want cheese or pepperoni =)\n\nCheers to Pizza Zone!!!", "author": "Amethyst Popkiss A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-27", "description": "This is a good pizza place when you're too tired to walk any further. Definitely not a place to go 'out of your way' for but if you need something quick to eat- this hits the spot.", "author": "Zira C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-30", "description": "Want some greasy pizza? I mean, really greasy pizza? Then this is the place for you!\n\nStopped in for lunch here and had the pepperoni and sausage with some cheesy garlic bread. The garlic bread was the bomb!\n\nThe pizza was good, but it was so greasy that my stomach hurt for a couple hours afterward.\n\nService was good. Of course it helped that we were the only ones in there :)", "author": "Jason J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-06", "description": "disgusting frozen pizza. he just slaps some extra cheese on your frozen slice and heats it a bit. Ive had microwave stuff that is better. This is for dumb tourist. Overpriced slices bad toppings and its pre frozen, he does it right in front of you. What a joke.", "author": "Mr B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-21", "description": "After a three-hour long trip on the cable cars (it's a long story saved for another day), my family and I were hungry and needed to eat dinner. So, we decided on this hole-in-the-wall pizza place for dinner since it was literally across the street from our hotel.\n\nThe first red flag that was raised to me was that when we walked in, Nickelback was playing on the radio. Yes, Nickelback. We order a pepperoni pizza and drinks and we sit down.\n\nSecond red flag - The waiter brings us our pizza, and its greasy. Way greasy. As I use a bunch of napkins to soak up the grease, I think about nope-ing the fudge out of this joint and taking my family to In-n-Out, even though we had In-n-Out a few days prior when we were in Reno.\n\nThen, I take a bite of my pizza, and it exceeds all expectations. It was a pretty good pizza. I had three slices of some of the best pizza I've ever had.\n\nDespite playing Nickelback, I think Yelp says it all - \"Yay! I'm a fan.\"", "author": "Name Redacted N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-02", "description": "Coming from Chicago this was a blessing in disguise to have a \"late night\" spot open past 10pm! \n\nPizza is delicious and it's cheap and fast service...great for that late night craving when everything is closed and you need eat something to soak up the alcohol!", "author": "Niti B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-11", "description": "Ordered a cheese for the kids and a ham and onion for adults.  Both pies were good.  Quality cheese with fresh toppings.  Onions we're cut huge as slices of white onions.  I was concerned by the other reviews on the dough but found it to be pretty firm and good.  I'd hit this again for a pie up to the hotel room.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-27", "description": "I had a hankering for pizza while in the super crazy Fisherman's Wharf area and this shop, located next to the spy shop, was a nice quiet place to stop in and eat a slice or two.  \n\nLoved the cheesy garlic bread and the pizza was thin and tasty - VERY GREASY though (had pepperoni & sausage).  I had to soak up a few napkins full before it was edible for me...my husband loved it as is!  \n\nAll in all, a good place. Cheap.  Tasty.  Quiet.  In Fisherman's Wharf, that is saying a lot!", "author": "Jessica J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-19", "description": "We were disappointed with the quality and taste of the pizza.  It was well below expectations and wouldn't go back.", "author": "Stephanie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "Went to fisherman's wharf today with my daughter and tried this place out fair prices food was good for the price it's not strong pizza very mild but has good flavor I would recommend it for somebody that's looking for a good deal the fellow behind the counter was pleasant to deal with.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-31", "description": "Pizza was good. Guy at the counter was very nice. It's a bit run down but not to the point I felt uncomfortable.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-09", "description": "Good food and great price. Large single slice pizza. We also had sandwiches. Veggie pizza and the veggie sandwich was very good.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-28", "description": "Pizza was freshly made when you placed your order. The crust was really good but a little too greasy. I ordered the meat combo and I liked it except the sausage pieces. It just didn't taste very good but everything else was. Would try again.", "author": "Mai T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-04", "description": "We needed a quick snack & it's located really close to our hotel (yay for convenience) so headed across the street.  $3.75 slice, fountain drinks $1.85, 16 oz (boo) and $1.00 refill (double boo). Veggie slices?  Awesome.  bell peppers, tomato, cheese & onions. the crust was perfect (i'm a crust girl) - slightly crispy but not burnt.  the owner (who helped us) seemed nice.", "author": "Christine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-17", "description": "While out searching for lunch at Fisherman's Wharf, the smell of pizza caught our attention and we wandered over to Pizza Zone.\n\nVery spacey, lots of seating and chairs and tables, we each ordered the vegetarian slice and a drink.  Our slices were made to order and came out of the oven piping hot.  They were also pretty quick on making and serving it to us.\n\nFor pizza by the slice, it's pretty damn good!  It was filled with toppings, cooked just right (the cheese was melted nicely, veggies were crisp instead of soggy, and the thin crust was just the right consistency).  The slice you get is pretty big too, more than enough for a lunch (unless you eat a lot of food in general).  There's some extra toppings you can add on top if you like (oregano, parmesan cheese and garlic salt yum yum!)  Other reviews indicated the pizza was really greasy, but I didn't notice this... it's quite possible that the veggie has far less grease than the meat-based slices. \n\nPrice is right on for what I'd expect and the guy behind the counter was very sweet and nice.  When he broke the lid while trying to open a bottle of pop for us, he told us to grab a replacement from the cooler, all while smiling away.  \n\nMy only single complaint is while they had some interesting pops in the cooler, the root beer only came in diet.  :(  I purchased it anyway, in the hopes it wouldn't taste like diet soda, but sadly I could definitely taste aspartame in it.  I'll stay away from it next time and go for a Snapple or fountain drink!", "author": "Cassandra J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-13", "description": "Nice seating outside. Less than impressive pizza but it gets the job done, especially if you enjoy soggy oily pizza.", "author": "Yuki M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-11", "description": "Went here only because of close proximity to our hotel. Bought a slice that was pre-made and sitting for a warmer for who knows how long. The pre-made slices are cheese and they add toppings and throw it back in the oven for a few minutes. Decent pizza, but not fantastic. Would be better if it was cheaper.", "author": "Eric D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-19", "description": "This place is disgusting, don't eat here if you  are a tourist. I live in SF and got caught at this place for a nearby TaskRabbit gig and couldn't have been more disappointed... 10 dollars for 2 slice of sub par pizza sucks too!", "author": "Yelper H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-19", "description": "This pizza's grease made 5 napkins tranluscent after I sopped up as much of the grease as I could.\n\nAfter ingesting the pizza I wanted to puke because it was gross.", "author": "Anthony K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "I'm gonna get a slice of cheesecake and a bottle of water. Oh hi Susan.", "author": "Jesse B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-30", "description": "They don't know how to add extra toppings awful and service is poor! I recommend to people do not go here! Go to blondies pizza by Powell St best!", "author": "Elsie Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-15", "description": "After a night of partying, there's always that greasy-food craving - that's how we ended up at this pizza joint. As my friends and I made our way of The Parlor, the only thing open and walking distance from where we were was Pizza Zone. Quickly, a line formed where we had our choice of plain cheese or pepperoni.\n\nIt was thin crust pizza, my preference, and served in huge slices right out of the oven. I couldn't even carry my pizza because it was PIPING HOT! Anyway, yea... not the healthiest thing to be eating at 2AM, but who cares! Not the best pizza, but it definitely hit the spot.\n\nSide note: I spotted Misa from the Nom Nom truck here the same night! They participated in the Great Food Truck Race featured on the Foodnetwork (and I heart everything food& Foodnetwork) and even though they didn't win the grand prize, they still kicked ass in every single challenge. They're planning to expand! Click here if you don't know who she is: http://nomnomtruck.com/\n\nAnd so... because of this sighting, I will remember Pizza Zone forever =P", "author": "Janis A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-13", "description": "Had just driven up from Monterey for our first visit to San Fran.  After dropping our bags at our place in North Beach, we took a stroll down to Fisherman's Wharf.  I was craving a slice and a beer, and this little place hit the spot.  Big piece of pepperoni for cheap and a bottle of Stella.  \n\nIf you have never driven up those San Fran hills before, you'll know why a beer hits the spot!  \n\nThere is another pizza place across the street, but we went here because I just wanted one slice, cheap.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "Great big tasty pizza slices open late at night, run by a friendly guy with a smile on his face - what more do you want.  Anyone giving this place less than a 5 is an asshole.", "author": "Karthik K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-14", "description": "Fairly quick service on a busy day at the Fishermans Wharf.  Pizza was pretty good, although pepperoni a bit greasier than most...  I would come here again though, it was the closest pizza by slice at the wharf and less of a wait than other fast food places nearby.", "author": "Paula A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-12", "description": "Excellent pizza and food. Great customer service. I highly recommend this place i come here every night!", "author": "Petey F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-17", "description": "Good place when it's late!  Pizza slices are $3.50, but be sure to ask for extra tomato sauce!  Otherwise, added toppings were pretty generous.", "author": "Rob R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-26", "description": "THE WORST PIZZA I HAVE EVERRR HAD.  It may have been because it was late at night.  For 3.75 a slice, it was a rip off.  Tthe guy took a piece of pizza that had been prepared earlier (not made fresh) threw some mozzarella and uncooked mushrooms on it, and finally just threw it into the pizza oven.  It was absolutely the worst meal so far on my family vacation.", "author": "Big J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-06", "description": "We just arrived at our hotel in the Fishermans wharf and we were tired and we were looking for a casual restaurant that we could just chill at.  We found one.  This place was fairly dead, but they had lots of tvs, so if there was a game on i am sure it would be quite popular.  The piza was cheap, hot, but  my only complaint was that it was so greasy, it was literally dripping.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-15", "description": "I didn't have such a good experience here. Me and my mom came here for lunch and it seemed like an okay place to eat. After we ordered, the table behind us got their pizza and immediately they started freaking out. The longest piece of hair came out of the cheese, i felt disgusted. When we got home to eat the pizza, my mom realized they charged her for a salad that she didn't get and the pizza taste like pure salt and grease. Not to mention, you can get the exact same wings at safeway but cheaper...", "author": "Nay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-19", "description": "Good down and dirty street pizza. No fu fu no frills, just good pizza.", "author": "Lori M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-01", "description": "Where's the love for Pizza Zone?  Seriously, these guys have monster slices, lots of cheese and a decent crust.  Sure you're not dining by candlelight and having the waiter kiss your ass for a tip, but pretty decent pizza by the slice.  \n\nIt may be pathetic but we have come out of our way to eat one of these slices late at night.  The other bonus is everytime we have been here, the place hasn't been that busy.  Some may call that a crap sign but I call it a little gem.  You know the saying, \"one man's trash is another's treasure.\"  Well this is my treasure man!!  \n\nThe rest of you, go to Golden Boy Pizza Co.", "author": "Bill P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-05", "description": "Been here twice. Crappy pizza but sometimes u gotta eat. I do like that they have garlic powder.", "author": "Daniel N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-25", "description": "Okay, not the best pizza on the world, but since I work at the Wharf, it satisfies my appetite!\n\nI'll place my order over the phone, take a 2 minute walk there, and BAM!! Pizza's ready!\n\nCheap, fast and delicious. Just that way I like things in life.\n\nSausage + Mushroom = *heart*", "author": "Nance W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-28", "description": "This is where you can get a slice of good pizza!  You can get more, but one BIG slice is good!  The place may not be busy, but a good quick slice of pizza all I want.", "author": "Manuel N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-04", "description": "Had a cheese slice for $2.99.  It is thin but it was very bland.  How do you describe why something is bland?  Maybe my taste buds were having an off day.  Good and friendly service.  Just needs more flavor.", "author": "Jeff J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-20", "description": "Damn the Chinaman makes a mean pie!!!  I've only had the slices but it was tasty.  Thin crust, bit sweet sauce, quality cheese and meats.  My true pizza test, is it a good left over and this place passes with flying colors!  They are open late on the weekends!", "author": "Todd O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-07", "description": "Nasty. Pizza had zero taste, and was super greasy. I added garlic, red peppers and parmesan cheese and literally felt like i ate nothing, but had an upset stomach. Used like four napkins degreasing it. My bf ordered wings and he saw them dump them out of a tyson bag. They heat them up in the pizza oven and add their own sauce, but it is tyson chicken.This place is a joke. Not worth paying for...buy tombstone pizza and tour own bag of tyson for a tastier cheaper meal.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-21", "description": "Every time we get over the hill to the City, we make it a point to go get a pie from Don at the Zone. You can go from the slice to the great big one. The extra large is HUGE. I don't even look for another pizza house when i get to the motel. No reason to.", "author": "M D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-06", "description": "Considering this place is in the tourist part of town, I was pretty impressed with what we got for about ten bucks.  My daughter and I each got a piece of pizza and a soda and were out the door for almost exactly $10.  The pizza isn't fabulous, but it's not bad either.  The slices are large and one piece is definitely enough for a meal.  I do tend to dab off the extra grease with my napkin before eating it, but all is all, not too bad.  This isn't a place I'd go out of my way to get to, but if we were in the area and looking for a quick and cheap bite to eat, I'd go back.", "author": "Lisa P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-26", "description": "Like everyone else, i was surprised that a chinese guy can make such good pizza.  It was about $7 for a slice of pizza, salad, and a drink.  a pretty good deal.", "author": "Kyle N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-23", "description": "Kick ass hole in the wall pizza place right behind hooters.\nJust a lil pricey, but its ok since the pizza here is damn good.\nNot just good but damn good, and it isnt like a typical pizza.\nSure it looks like one but once u bite into it you can definitely tell that it is one damn good pizza. The bottom of the pizza is crunchy and not moist like your typical pizza.", "author": "Storm S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-25", "description": "This was some of the WORST pizza I've ever had in my entire life... and I eat a LOT of pizza. The crust was reminiscent of cardboard, the cheese was scant and cheap, and the sauce tasted like ketchup with spices mixed in. NEVER AGAIN. 2 stars because the place was clean, and the owner was adorable and friendly, and it was still better than Little Caesar's.", "author": "Mindy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-21", "description": "Fast and relatively good pizza late night.  This 3-star place turns into 4-stars after a few drinks.", "author": "Vinay A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-17", "description": "Sure, the decor needs some work, and it feels a little depressing in there, but the pizza's not bad. Tried the pepperoni and it was pretty decent.\n\nJust a hole-in-the-wall, but I'd go back.", "author": "J K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-22", "description": "Perfect spot for that last call eatery.  Food was good, cheap and what more could you want from a late night pizza joint.  Worth the stumbling trip to grab a slice", "author": "Rich F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-03", "description": "Come on! Give me a piece of pizza! No! It's 1 minute after one! Forget this place.....go across the street to PIZZA ZONE!!! Outstanding customer service there.", "author": "David A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-13", "description": "Rather pricey for a piece of pizza, at least the slice was pretty big.  (I was actually shocked at how big the slices were.). As for quality it was decent pizza nothing amazing but more then serviceable to hit the spot.", "author": "Kris K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-20", "description": "Great service and personality make up for the average but good pizza, modest but oniony salad, and plain interior.  The order pad is a 8x10 lined paper spiral notebook! haha!!", "author": "Yuka K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-04", "description": "And on the eighth day, God created food like this that tasted good when you've been drinking...", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-07", "description": "I was visiting San Francisco this weekend and it was freezing cold so I was craving something warm like pizza. I didnt know of any places to eat pizza, but this place definately hit the spot. The gentleman who helped me who looked like the owner was really nice and provided great service.", "author": "Samira M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-30", "description": "I LOVE the Pizza Zone.  Being originally from Long Island, NY there aren't many Pizza joints in SF that are up to Par with my standards.  \n\nPizza Zone has delicious Pizza by the slice and is open late.  The prices are friendly to your wallet, the service is FAST and the staff is great!", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-16", "description": "Standard pizza, standard price, standard service.  Nothing great but makes a nice quick and cheap lunch.", "author": "Mack D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-22", "description": "Solid pizza.  And I love that they serve beer too.  I live nearby so it's good to have a weekend lunch spot that doesn't cost a small fortune (like the italian place across the street from Pizza Zone).", "author": "Alyssa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-10", "description": "my favorite part about pizza zone is that your slice of delicious pizza comes with a second, identical slice of pizza. so they won't be lonely in your stomach at 2AM.", "author": "Dustin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-21", "description": "Love,love,LOVE this place. Sometimes when you're at the wharf, you want more than sourdough or seafood. This place provides a welcome option. Their slices are HUGE and reasonably priced. Always go when I'm in town and get mine with extra cheese,mushrooms and sausage (I think their sausage tastes just great). Check it out. My favorite pizza place in either LA or San Fran!", "author": "Marina B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-18", "description": "Pizza is OK. Not that great. They serve beer. Nice location. The place look kinda weird. They really need to redo the place.", "author": "HD S."}
