{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Wonderful, delightful, beautiful, and tasty. That's what comes to mind when I think Playland. This perfectly placed pillar of powerful PM potions is a staple on the Polk Street corridor. \n\nWalking through the door means friends, family, and waves. Yes, a tidal wave of delicious cocktails, and friendly conversations. This is my goto place for a happy hour downstairs, or a private party upstairs. That's it baby, 'nuff said", "author": "Shawn R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "Honestly my favorite place on Polk street. This bar has two stories and let me tell you.. the second floor is always a good time. Although it may get crowded through the night, the music is always relevant and fun! It's pretty dead around 10pm but once it rolls around 11, this place gets so packed it's hard to move around. There's four bars total (I think). Two upstairs and two downstairs. Drinks are standard prices, there's no cover for girls but I think it's a $10 cover for guys (depending on time and day I think?), all restrooms are downstairs. There's a fairly large dance floor, music videos are playing along with the music, and the DJ takes requests! Line does get out the door sometimes but it moves quick. \n\nCome here if you love dancing! Great vibes and I love it!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "My silly friend lost his phone the other night. We saw on Find My iPhone that the location was sitting somewhere on Pine/Polk so we called Playland the next day to see if it could have been left there. Reuben picked up the phone (outside of business hours) to ensure us it was. Along with my bag of groceries (yellow dragonfruits + golden kiwis, ain't cheap yo). What a relief. Thank god for the honest crowds + team at Playland.\n\nI also ALWAYS have a great time at Playland. Definitely a spot I bring visitors to and they are never disappointed!\n\nLove ya P'land.", "author": "Chantel Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "Great for dancing and for watching weird old music videos.\n\nAs other reviews have mentioned, it can get a little grabby but luckily most people we encountered were fine.\n\nDefinitely should have pregamed more, but will be back!", "author": "Hannah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Great spot to grab after work drinks or any night out! Judith whips up some delish cocktails behind the bar and the service is top notch. Anywhere from the perfect old fashioned to creative twists on some classics. Great ambiance, great people and great music as well. Fun welcoming atmosphere with great vibes. This place has been a fun spot for years and will continue to be a go to for my friends and I!", "author": "Christel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-20", "description": "A bunch of us were visiting the city from LA and Las Vegas to celebrate our cousin's 21st Birthday and Playland was her bar of choice. We arrived at about 11:30 on a Saturday night and the line was wrapped around the corner. We waited in line for about 20 minutes or so, no problem. Once we finally reached the door, I was a bit surprised when the bouncers told us that the guys in our group had to pay a $10 cover fee. Also, if there was a dress code here, I didn't notice it and it wasn't enforced because god forbid, guys were wearing jeans with Converse and girls were wearing Stan Smith's. It was a very casual and laid back vibe from the start. \n\nOnce inside, a few of us ordered drinks from the cocktail menu on display. They were just okay, too sweet for my palette. The bartender making the cocktails didn't seem to be too familiar with the recipes as she kept having to turn around to refer to the list of ingredients on the wall.\n\nUpstairs was complete pandemonium. It was extremely packed and hard to maneuver your way around the dance floor. Cramped would be an understatement. Once you find your spot, you're there for the rest of the night! I'm almost positive the building occupancy exceeded the maximum capacity for fire code enforcement! Basically, don't come here if you're claustrophobic. If you go to the bar, have fun finding your way back. Luckily, there's a small bar closer to the dance floor, but come prepared because that particular bar accepts cash only. Drinks weren't too strong, but they were cheap (IMO) compared to what I'm used to in Vegas! \n\nI liked the music when we first arrived. The DJ was playing TLC, Ashanti, and that Oye Mi Canto throwback. The crowd was chanting the words to every song that blared through the speakers, which I guess says a lot about the age group here. As the night went on, the music got progressively worse. I love me some Cardi B, but one can only listen to Bodak Yellow so many times.\n\nOverall, I'd say we had a good time and enjoyed ourselves.", "author": "Jordan I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "Overall the place is good. \nDifferent kind of music on different days, sometimes it gets really crowded and the public is all mixed. \nDrinks are okay. Staff is nice most times. \nA friend got her bag stolen once in there, so you better take care of your stuff.", "author": "Diana F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-02", "description": "If you want to dance, Playland Bar is the place to go. The music is awesome and definitely gets you hyped. The DJ was open to song requests which made the night that much better as we sang along to our favorite songs. \n\nVisited Playland Bar as part of a pub crawl on Halloween night. As part of the crawl deal, certain drinks were $3 each which was awesome. The place was packed and the bartenders were overwhelmed with orders. Upstairs, there was only one bartender so it took a really long time to get our drinks. The place is kept clean. I saw the employees frequently walking around to grab empty cups.", "author": "Katie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-30", "description": "Be warned: You may get kicked out for dancing. Yes, that's right. The bouncers here are WAY too aggressive.\n\nThe bouncers walk up and down putting a flash light in your face and yelling at people.\n\nMy friends and I were jumping along to the music and the bouncer featured in the photo I've attached warned us that if we jumped again, we would be removed.\n\nWe weren't aggressively jumping on people - we were just putting our hands up and jumping to the music having fun. Shortly after, someone came up to us and said \"that bouncer is a jerk he tried to kick us out too.\"\n\nPer my previous place, this was my go to place on Polk. Never again.\n\nThe music is good and the people are fun. The bouncer though was absolutely terrible and I will avoid this place for now on.", "author": "Dylan R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-19", "description": "Horrible bouncer service. Too drunk to understand what is happening. Notice drink in hand. Horrible management. They cover for bouncers. Enforcing the law doesn't mean drink the confiscated shot. At least to my understanding.", "author": "Bored I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-26", "description": "Really sketchy place. Avoid at all costs.\n\nThis past (and last) time I was here, as I waited for my girlfriend to finish using the bathroom, I stopped by the basement bar to grab a bottled water. The barmaid continued to ignore me and serve other customers as I waited patiently right in front of her. Finally, I got my water for $2.41. I typically would tip here, but I was upset with the service, and put an \"X\" in the tip line. About a week later, I noticed that my credit card was charged $3.41. I guess she had forged a fake $1 tip. LAME.\n\nP.S. The service for table reservations is equally atrocious and the bathroom situation is a mess. On the bright side, the upstairs dance area is super fun if you're into overcrowded sausage fests!", "author": "Justin H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-01", "description": "Really crowded and wild. If you're looking for a place to just dance you can check out the upstairs area here. It's a younger crowd definitely. Drinks didn't seem very strong, but at least they were made fast. After about 30 minutes the scene gets pretty old.\n\nThere's a cover for guys but girls are free.", "author": "Courtney N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "Thank you Morgan for the great drinks, you were a pleasure to chat with and we were impressed by your friendly service. Huge fan of the Calypso Old Fashioned. We will definitely be back again!", "author": "Benny D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "Playland is the best. I don't even maintain friendships anymore I just show up here and hope for the best.\n\nAll the regular bartenders are tops. Shout out to Ali, Judith and Yuyulia in alphabetical order. Ina's being weird again. ;-)\n\nCome on the weekday evenings. Friday/Saturday there's really no d", "author": "Randy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "Perfect Monday Night spot to chill and meet people while you get some of those errands done that you missed because of Sunday Funday! Judith and Yulia  make you always feel welcome...and they have good taste in music!", "author": "Luis G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "FYI there's definitely a dress code. My guy friend got turned away for wearing shorts :(", "author": "Christine Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-30", "description": "Racist POS bar.  We walked over here 10 mins ago and they let three of our white girl friends in and then denied my friend who is black because they said he pulled his jeans up on the way over in the cross walk....his jeans are skinny and fitted....so he was denied entry.  We waited for our girlfriends to come back out as a group of Hispanics went to go in and they started charging $5 and they said the front guys jeans were too baggy. They weren't baggy, they fitted normally...and as he said he was chubby and skinny jeans weren't his style.  This place is beyond racist and has terrible management.  The security guards said they were taking their orders from their owner in the camera below the sign (see below for stupid camera). If I could I would give this place negative 1 million stars for their racist ways!!!", "author": "Marie E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-04", "description": "I was assaulted here on February 3rd. In the middle of the dance floor, a man grabbed my left breast. \n\nIf you are looking for a place to confirm your suspicions that San Francisco is THE WORST city to go out in, ever, I would recommend Playland. If you are on the fence about the state of humanity and you're looking for something to push you over to a more negative view, Playland is the place for you.\n\nIf you value your bodily autonomy, steer clear.", "author": "Kat C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-21", "description": "Make sure you wear a belt! They wouldn't let one in our party because his pants were 'sagging.' Bye!", "author": "Earlene C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-21", "description": "I went with a group of 30 people for my birthday and had an awful experience. It almost ruined my birthday. The staff was rude to my aunt upstairs when she inadvertently sat in the VIP section and harassed her to get up right away. Two of my friends paid but they did not let him, they had seen him smoking a blunt outside in a public space on the sidewalk. Seriously, do they care about their clients or more about making money. When my husband complained to the bouncer about not letting his friend in, the bouncer would not let him back in. Not impressed with Playland's ability to treat everyone with respect and possibly discriminating. We left after a half hour of crappy service and did not let them ruin my birthday.", "author": "Karen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-16", "description": "In my opinion, Playland is one of the better establishments on Polk St. I came around 11:30 on a Friday night and there was a short line, but it moved fast. It was free for girls and $10 cover for guys. At a first glance, I thought it was the smallest bar ever but then noticed there was another room off to the side and also an upstairs area. There was a line to go upstairs and I understand why - it was PACKED. We managed to order a few drinks at the bar but the dance floor was full so we ended up going back downstairs. The music was good though. I ended up in the smaller room off the side where theres a good amount of seating and a small bar. S/o to the female bartender (forgot her name) that was there at the time, you were super fun! Drinks are regularly priced as expected ($9 shots, etc.).\n\nI like how there's a few different areas that you can hangout in, and you can move from room to room. The only downside is the line to go upstairs and the bathrooms are inconveniently located. I did notice there was someone constantly cleaning the bathrooms though so at least they're being maintained. Overall, I had a great time here and will be back the next time I decide to go to Polk.", "author": "Cecille W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "Super fun place to grab a drink and dance with friends upstairs or chill and chat downstairs! Great selection of drinks, and the place has a really great ambiance.", "author": "Julia E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-07", "description": "***Warning***\n\n\nA group us of came to party, were having a great time, then were suddenly kicked out due to hat dress code at 1:00 am?\n\nSo you mean to tell me that not only did the doorman /  ID security forget to state the dress code at the door, but we also were enjoying the night for 3 hours (10 pm - 1 am) before they decide enforcing a new dress code rule during the last hour?!\n\nThere is nothing wrong with dress code enforced clubs / venues but it should be properly stated at the entrance, not after 3 hours of collecting our $$$ \n\nHad we known they can make up rules at the drop of a dime we would have chosen a  different venue.", "author": "Michael J. M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-15", "description": "I love Polk Street - always a good night to be had. Unless you end up at Playland.  Then you can expect really crappy and overpriced drinks, a crowded and unsafe second floor, generic shuffled music (Spotify on random would do better), and generally awful experiences.\n\nAnd, believe it or not, they even charged a cover!  That's the only reason we stayed more than 10 minutes - sunk cost fallacy.  \n\nWord of advice - don't bother with any drink more advanced than Redbull Vodka or Rum & Coke.", "author": "Greg B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "I love monday nights at playland! They have happy hour all night, board games and Julia makes the best cocktails! My favourite one is Mezcalino. Highly recommend this spot especially if your Monday is your \"friday\" just like mine:)", "author": "Jesus M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-02", "description": "I'm very aware playland doesn't give a fuck about the reviews for this place because they're still going to make money regardless of any circumstance. I just wanted to tell other people about my experience just in case they wanted go to this particular bar/club. \n\nI got there around 1215 and wanted to go inside to meet up with my friends. So my choice of ID to use when I go out is my passport because it's easier to use and harder to lose. I've been to this bar a couple times in the past so i know it works. I do look way different from my passport picture because I've become a makeup artist 3 years prior since acquiring my passport. \n\nTo tie it back around, the bald bouncer that's out in the front wouldn't let me in because I don't look like my passport picture. Im pretty upset because he wouldn't let me try to prove otherwise since it was \"to their discretion.\" I get he was trying to do his job but the thing that really pissed me off was him saying they would let me keep my passport only because it's a legal document. I wish the fuck he would have because then Id have a reason to sue him and the club for his ridiculousness. \n\nThat aside, I do recognize that he is a person just trying to do his job. And no matter how upset I am about the whole ordeal, he is still human and humans make mistakes.", "author": "Alyssa P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-25", "description": "This is the second time I go to this establishment and I get profiled. This time I went with some friends. So the bouncer said, and this is before even conducting a search or even checking, but he assumed me and my friends were \"sagging\" and since we were on camera \"sagging\" we are not entitled to have access to the club. Mind you, I made sure I had on fitted pants and my friends also had pants that fit. We had belts and they just denied us entry. I seen earlier another person sagging and they went into the club no problem. I feel like this is either a racial thing since it's only been me and my friends that cannot get in or they are prejudice for how we look. They said I cannot speak to a supervisor and threatened to call police for not allowing us to get a justifiable answer. This is a poor excuse for an establishment that is meant to be fun and so called inviting. Complete cowards and frauds", "author": "Giovanni C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Absolutely love this place for its specialty cocktails and excellent dance floor. This is my go to bar on polk st. when I want to get down and boogie to THE most current tracks out there.Shout out to bartender Judith for her attentive service and positive vibes throughout the entire night. The right staff really makes a business thrive and reach it's potential, so props to you.", "author": "Raj P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-28", "description": "Just had a very unpleasant experience at this bar with Judith, the bartender upstairs. We had our first round of drinks and she was totally fine. Upon our second round of drinks I felt the apprehension and rude remarks from her. We had originally ordered 3 shots of Rye and 3 Shocktop Beers. But we had changed our minds to 3 shots of Rye and 2 Shocktops instead. We thought she heard us because we saw her pour only 2 cups of beers from the draft, but note there was 1 cup set aside from her previous pour (we did not know how long it has been sitting there). Upon serving us our drinks she served us 3 shots and 3 beers. We kindly informed her that we thought she acknowledged the fact that she heard us change the order to 2 beers as she only poured 2 cups. She responded with, \"I can't even hear in here facing you guys you think I can hear you with my back turned to you? I mean I can't drink this beer because I'm working so I'll just have to throw it away?\" *So take note, the other cup was from her previous pour for another customer that was left behind the bar.* Her response was just uncalled for. We ended up just taking the cup of beer, a small plastic Bud Light cup .\n\n\nFinally the ticking point was her just being flat out rude to her next guests that were next to me. Judith claimed that her guest (who happened to be a tourist from another country) gave her a fake $100 bill. I saw the $100 bill with the yellow strike from her detection pen, and as someone who had worked in a bank, I know for sure what a real and a fake $100 bill looks like. After their altercation, I thought to have a conversation with Judith and inform her that a fake $100 bill would show a black color after using a detection pen. Judith had informed me that their bar received 8 different $100 bills last week that all showed a brighter yellow strike using the detection pen and all were fake. I responded by letting her know that there are other features on a $100 bill to determine whether or not it is so indeed counterfeit. I honestly was not trying to cause any trouble or call Judith out on any misconduct, (granted the fact that she should have confiscated the $100 bill that she analyzed as counterfeit per proper protocol), I was simply trying to provide assistance and knowledge. Judith coldly and harshly responded, \"Oh yeah? In that case you want to come work here?\" \n\nAfter hearing Judith's response to the situation, it was time for me to close out my bill and leave. I too am in the Beverage and Food business, having managed 3 highly rated establishments in the Bay Area, (Mortar & Pestle, Pink Elephant, AC Waterfront Lounge). I was appalled by Judith's lack of professionalism and idiotic sarcasm. After this experience, I definitely will not return. And as one last piece of advice, per ABC standard, follow your bar dress code and wear some non-slip shoes. You might fall and slip at your bar with your Vans. \n\nHappy Easter!", "author": "Kenneth K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-22", "description": "Wow.. its 12:19am on a Tuesday night. I came here to celebrate my coworkers going away. I ordered two coronas for my flself and my boss but your bartender said \"your friend is cut off therefore you are as well\" without any explanation...so hold on here...this was my 2nd drink of the night..I am not sure how my friend was cut off but cutting me off as well? Whoever was working on wed 22nd at 12:24am please have an explanation...bartender def ruined the night", "author": "Vic R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "I had a fun time here. I came here on NYE super early to avoid cover, which was so funny cause we thought it would be empty inside. And it was!!! for like 10 minutes. I was glad cause we were one of the first people let upstairs so my group kind of took over one area, so it was never crowded for us haha. The music was definitely good. I LOVE bars where I can dance, and this one did not disappoint. I remember being handed an amf by my friend but tbh i have no recollection of how it tasted, or if i even ended up drinking it, so I'm not gonna be able to talk about the drink tastes and prices hahah. \n\nWe ended up leaving when it got really crowded, which made me really happy cause there were way too many sweaty and handsy people. Be careful bringing valuables cause people were dropping drinks left and right! My suede heels got really messed up but that was totally my fault for wearing them out sigh )': \n\nThe reason for the -1 star: the bathrooms!!!!!!! omg wth literally worst location to have a bathroom. I get the reason for only having one, its tiny af inside, but seriously try to change the bathroom location if possible. It adds unnecessary traffic and stress inside.", "author": "Malvika T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Taylor at Playland bar makes the best mojitos and drinks! It's quick service and tastes awesome! Great atmosphere too!", "author": "Megan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "Wish I can give it a 0 Star....If your looking into getting bottle service here dont waste your money. My bf got bottle service this weekend and we were enjoying our night, until the owner of the bar decided to come into our VIP area with his friend and girls, keep in mind we had paid for the VIP. He was very disrespectful, rude and unprofessional. We have gotten VIP in a lot of places and I have never experienced something like this. Also the bathrooms are sooo dirty.", "author": "Jesly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Barbora ROCKS !!! Love the music here best way to speand your holiday with the amazing friends and drinks", "author": "Ariel K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Barbora make the best drink recommendation ever! She's the best bartender! Love her! She knows what drink you like! Like magic~", "author": "Lydia T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-07", "description": "The guys at the door are always rude, but tonight, they were beyond that point. A huge group of people literally walked away after they (bouncers) treated all the PAYING CUSTOMERS like crap. I won't be returning, unfortunately. Gotta do better guys :( .", "author": "Deondre J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Cool bar cool waitress and cool Patriots we had such a great time here not to mention they have three different rooms and upstairs becomes a nightclub and they play the best music we had such a good time because the drinks are very strong and it's free before 10:00pm so if you can get in the bar before 10:00pm after that you do have to pay to get in and it gets real packed they also have a VIP section upstairs that they blocked off if you got the money to pay for", "author": "Mona L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-09", "description": "Playland is a total sweatbox, dance floor mania. If you are looking to get down and dirty, and dance the night away on a cramped dance floor, Playland is your place. It is a pretty typical SF bar, pretty small quarters, with the bar downstairs, and the dance floor upstairs with an additional two bars. The drinks are a bit pricey. If you come here on a weekend there is a 10 dollar cover for guys, and there is really no place to sit down. Playland can be really fun, it just depends what type of night you are looking for", "author": "Ross S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "Definitely a place for young people seeking dancing! Upstairs,Playland has a dance floor with a club-like ambience with lights, booths and a DJ. Downstairs, there's seating by the bar and a few tables in the back for a more intimate setting. Decent drink menu and bartenders are flexible with drink orders. $5 cover fee for guys. Great area to bar-hop with tons of people out and about!", "author": "Tori Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-31", "description": "Racist Racist Racist!!!! From the shady owner watching from a camera down to the so called security who think they are in the secret service. Just because someone pulls there pants up who happens to be African American walking across the street means he he is sagging. First of all his pant were fitted and he just so happened to adjust as he was walking he poised a threat to the establishment. Funny enough as we were denied a Hispanic male and his friends came up looking to have a good time and he was denied because his pant were to baggy which there weren't and in his own words (Man I'm just a big guy). Pretty comical also how he tried to charge him out of the blue to enter when other people walked right in with no issue or charge. Happy I'm didn't spend a dime in this place and will definitely warn anyone I know not to step foot in this Racists Venue!", "author": "Dom D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-07", "description": "This place is lame. Door guy spent 5 full minutes going through my friend's bag. Then, I paid 14 bucks for a Manhattan in a plastic cup with a crack in it and a giant ice cube.  This place has no soul.  Notice most of the positive reviews for this place are from people not from SF.", "author": "Jk V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Playland bar is a great place to go!!! Awesome place to watch sports, big TVs and great customer service. The bartenders are very friendly and helpful when it comes to drinks.", "author": "Hayden R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "If you want to dance, this spot is great. The upstairs has a fun hip-hop/pop music vibe while a more traditional bar is downstairs. We got there a bit early on a Saturday but by 10:30 the place was starting to fill up. \n\nDress code gets enforced after 10:00 pm (no shorts guys). This place is popular so don't show up too late or you can expect a long line.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "One word: Catherine. \n\nBeautiful, tends bar masterfully, and will make you feel less lonely. At least until you leave. \n\nWas here during the day, mid-week, so it was quiet. \n\nWill be back to see what the nightlife is like.", "author": "Khoa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-18", "description": "Was here after all the hype.. I'm pretty impressed! Bars with 2 floors with dance floor on the 2nd level! Dj's pretty dope with all the best new mixes! \n\nTrust me guys ull love it here if u have a large group just get u single ass here! ull def never walk alone", "author": "P K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Playland bar is awesome. JUDITH the bartender rocks. She makes the greatest cocktails ever. OMG I love this place! Latin music dance party on Sunday night!", "author": "Mike M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "Great service and excellent drinks! Ali knows how to make the Persian gimlet like no other! Can't wait to have a few more of those! \nFor a monday night there was a Nice flow of customers in and out; a few regulars and some just visiting. TVs keep you entertained but the music is also a fun mix! Would come back for sure!", "author": "Ana F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "The drinks are solid for a place that specializes mostly in just getting people laid.", "author": "Doc C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-31", "description": "Did not let me in because. According to a bouncer, I was wearing sweatpants. I was not. I wear those to sleep, why the f*** would I wear that to go out", "author": "Clever P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "My first time here at Playland and I am greeted by Brenda! Her first night here and she was awesome! Shes so beautiful  See you again soon!", "author": "Ercan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "My husband and I were recommended this place by a few locals for a place to dance. We arrived early in the evening around 9:30 on Friday so it wasn't busy yet. The bouncer was awesome and gave us some great info when he heard it was our first time there. Around 10:00 the DJ started playing and around 11:00 it started getting packed. The music was good; mainly what is on the radio right now. The crowd was dancing and singing and everyone was laid back. There was people dressed up and people dressed casual which was nice. Around 11:30 it was chaos. The whole upstairs was jam packed and it got really hard to move, let alone actually dance. The music was good though and the DJ played the music videos on multiple screens throughout the upstairs. This place is definitely great if you want to dance all night long! We are happy we found this place and will be back!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Went there for a private event the other day (Warriors Watch Party). Drinks were great, the bartender made an awesome Dark & Stormy. She was doing awesome managing the upstairs bar by herself (she was attentive, remembered my name for the tab, etc). Definitely going back!", "author": "Chris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Came here during the St. Patrick's day bar crawl and it was a lot of fun. The mystery shots were surprisingly really good and the upstairs dance floor was poppin later at night.", "author": "Alka M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "Ali is the best bartender I've met! He definitely took care of us at Playland! Would recommend this place any day of the week!", "author": "Annamarie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "I've been coming here for quite some time now and although it does have its faults just like any other business establishment, it really makes up for it in that it creates a diverse environment for just about anybody to enjoy. The bar downstairs has a backroom where you can get away from the loud noises in the front and also has its own small bar. The bar upstairs turns into a dance lounge and they have different events on certain days of the week. The place does get crowded on the weekends, but normally during the week it's very chill and a great place to meetup for drinks with coworkers.", "author": "Brian P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-09", "description": "I was visiting SF for a weekend and decided to check this place out with some friends. A couple of us had been here before and they liked it, I had not so I was down to go in and have some drinks. However, the bouncer didn't even let us in - he took about 5 mins looking at my Washington driver's license before declaring it fake and confiscating it. This was ridiculous, I've never been accused of using a fake ID before, let alone ever even needing one. Also, was he even allowed to just confiscate it like that? I had to argue with him just so I can get my driver's license back, but was still not allowed in. We finally gave up and just went a block up the street to another bar.\n\nReading the recent reviews here, I'm pretty disappointed this happened. It's sad that a bouncer isn't able to tell fake IDs from real ones, this guy must either be new or maybe I'm just unlucky. 2 of us with non-California licenses got bounced. Although, one of our other (non-Asian) friends was allowed in just a few moments later, despite also having a Washington license. Regardless of why this happened, I will not be coming back the next time I visit SF. Thank god there's plenty of other choices on Polk St!", "author": "Josh L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "Don't let the three stars fool you. This MIGHT be a four even five star review if we came at a different time. We came on a Saturday night and was unbelievably packed! To the point where it was nothing but pushing and shoving at the dance floor. The music was decent, not really my cup of tea, but definitely had some good moments. More of a top 40 and popular \"hip hop\" sounds. \n\nThe bouncers are actually very on top of things. We saw them approach and address multiple people at times that it was needed. \n\nWould definitely come back at a time where it's not so crowded to hang out. The drinks were good and of course pricey just like everywhere else in this town.", "author": "Eddie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Awesome place for a spontaneous night :) super friendly and welcoming bartenders !! :) Barbora was especially wonderful! Will definitely come back when back in town!", "author": "Dorothy Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-26", "description": "I will never go to this place again which sucks because the dancing aspect here is actually really good. \n\nOk first off, you literally have to push people out of your way to walk anywhere! Its absurd. \n\nSecond, not sure if it was just the bar upstairs but my friends ordered 2 separate drinks, and they tasted like sewer water. (not even exaggerating) it was absolutely disgusting. \n\nI preferred the bar area on the bottom floor, hidden in the back from the first bar when you walk in. \n\nAlso, when going to the bathroom, me and my friends almost got sexually assaulted as a man tried to enter the single bathroom, and I had to literally push him out the door to prevent him from either trying to rape us in the bathroom, or something else. \n\nand although there were security there, there was definitely not enough for the amount of people in there. \n\nGuys were really disgusting there. \n\nAnd sloppy people everywhere. \n\nRegardless, whatever drink the bartender made it had something quite nasty in it.\n\nand zero stars for everything mentioned above.", "author": "Janessa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "I went to playland bar the first time with my friend. The staff was AMAZING, our bartender Cat was fantastic. She was so friendly and personable not to mention her drinks were delicious! The vibe was hella cool. Definitely will come back!", "author": "Victoria C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-20", "description": "Came here during SantaCon festivities, so I'll refrain from reviewing cover charge/security/overall vibe because it was a special event. \nFirst, the good: cheap drinks and an awesome view of Polk St from the upper level. We hung out by the windows because it got hotter than Africa in the main bar area, and it was super fun looking down at all the Santas parading (euphemism for \"stumbling\") below. The bartenders here do a great job noticing everyone at the bar and serving drinks quickly even with a huge crowd! It was also a fun crowd, which could be due to SantaCon, but not as dicey as some spots on Polk where you're clutching your purse under your arm the whole time and waiting for the next fight to break out. \nThe floorplan of this joint makes zero sense. There is one (1) (uno) restroom for every sardine packed in here, located on the first floor in a little hallway next to the stairs. This means that the massive line will inevitably block traffic to the stairs and the rest of the downstairs area. I felt so bad for the security guard who had to consistently usher crowds away from the line. The stairs also made me super nervous, because they were so congested and were legitimately shaking from the amount of people packed onto them. Security tries to control the flow of traffic, but people posted up on the stairs and started partying there, which isn't cool for everyone trying to get through", "author": "Delaynie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Legit. Bouncers were on top of anything stupid happening, the DJ was really good and the wait at the bar was super short. \n\nDefinitely recommend, and it's a pretty cool place to just watch a game if you go early", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-09", "description": "$20 minimum for credit cards.\nAbout $13 a shot for Hennessy and they give you very little chase\nDownstairs is more relaxed than the upstairs. \nCan get pretty packed.\nNo cover fees when I went -- might have been a little after 10p.", "author": "Amy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-16", "description": "The dance floor was crowded on Sunday Latin night, but I prefer that over an empty one. Oh most importantly it's too bad they have a rude bouncer (photo included) he came over to my group of 5 and said we were being too loud threatening to kick us out. I admit my cousins and I have high pitched laughs, but we don't fight, we buy many drinks,and when we were dancing it was with everyone. I say get rid of that bouncer!", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "Crowded and just a bunch of drunk kids that haven't ever gone to a bar before. Skip and somewhere else. Soda papinskis is just up the road.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-28", "description": "What a strange club. I don't know if it was a special night but holy moly. Packed like sardines. No windows or ventilation. So the sweat just condensated. Made the floors slippery. It was 98% guys. Nothing wrong with that I just thought it was really weird. Most were just standing around. Hard to dance because there were wayyy too  many people. I had to get out because I couldn't breathe. \n\nI definitely did not like that. Maybe I'll catch it on a better night but this place is super hyped up. It's kinda cool they play the music videos on the TV screens. I guess I also wasn't having it because I was very sober.", "author": "Lynn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Came to celebrate my boyfriend's 27th birthday a few weeks ago and had a GREAT time! Mae sure to come early because this place can fill up quick, especially the upstairs. One of the reasons why we had such a great time was because of one of the bartenders upstairs- Judith. She was super friendly and super quick with our drinks & always remembered what we ordered each time we went back. She had such a positive attitude, in spite of being super busy. We would definitely come back! Thank you Judith!!", "author": "H. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "The bartender B is the greatest. So sweet and so attentive!! I absolutely enjoyed my time here because of her", "author": "Jen T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-09", "description": "Ran into this bar while wandering (bar hopping) my way through the city. The space itself was small and lucky for us there was a free table near the entrance. We sat and I immediately saw the cucumber basil gimlet on their extremely large scroll like menu on the wall. So two cucumber gimlets. \n\nI eagerly approached the bar and made eye contact with the female bartender who was holding a conversation at the end of the bar, after waiting what seemed like an eternity, she finally strolled over and asked what I was having and asked for my ID as well as my companions' who was seated at the table. A bit reluctant because of the ultra slow and sort of rude service, we handed over our IDs and soon enough received our drinks.\n\n$10 a piece for the most syrupy, non alcoholic suppose to have alcohol beverage I've had that didn't come from a night club. Highly disappointing. Should have left when we had the chance.", "author": "Genoa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "I came on Sunday , salsa night the music was great but towards 1130 pm the club was packed and there was no room to dance, like people where about to fight each other because everyone was knocking into each other. But the dj had a great variety of Latin hits , salsa, cumbia, merengue, reggaeton, and tribal.", "author": "Monie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "My girls from Memphis were in town and staying right down the street from Playland so we all decided to give it a shot last night. I'm GLAD we did and I definitely will be back! The line to get in was longer than you would anticipate anywhere on a Thursday night in SF, but thankfully we were able to get in quickly. (Memphis girls aren't used to the lovely weather we have here in SF.) Drinks were reasonably priced, and considering how many people were there the quick service from the bartenders upstairs was appreciated. The music selection by the DJ was great! A good mixture of genres that kept everyone moving. \n\nAfter 11, the dance floor upstairs was packed. Like, sardines packed. I went outside for some fresh air and noticed that some crazy young girl was literally ALL up in the door guy's face demanding that he give her ID back. Intrigued, I sit back and watch the show. Not even two minutes later, this girl's MOTHER is at her side cussing and threatening the guy for her daughter's ID. To my (and everyone who was watching with me) surprise, he was brushing them off with more patience than we all expected. When they were done with him, they went straight to the manager who was waiting for them a few feet away. Ding Ding, let round two begin! Mom and daughter are now tag-teaming the manager. I'm thinking, \"This is it! This crazy, rude, and obnoxious mom and daughter duo are about to get it, and my girls are upstairs missing it!\" Wrong. He acknowledges their anger and frustration but somehow manages to stay calm and patient throughout their entire exchange. Finally realizing that they weren't getting a rise out of him or the ID back, they both walked away, defeated. Hat's off to both of those guys for remaining professional and courteous, when they really didn't have to considering how insanely rude that mom and daughter were to them. \n\nMy only complaint is that if you go downstairs to use the restroom (which are all located on the ground floor) or outside for some air, you will have to wait in line a few minutes to get back upstairs to the dance floor.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "downstairs was slow...went upstairs and the music was great. Stephanie was my bartender for the night -she's great!", "author": "Baldeep K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "Always a great time at Playland Bar.. bar in the front, lounge in the back, and a dance floor upstairs; there's something for everyone!", "author": "Mo S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-11", "description": "Decent bar. If u come on weekdays there's only one bartender hooking up her friends so that's annoying. Fruit flies galore. Weekends the lines can get long.", "author": "Nick Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "This is the best bar in SF with the best cocktails and prices. Gotta see Cat, she's the best! Weekends are fun here with DJs and dancing, but if you want a relaxing experience, come during the week. Try a Caribbean Treasure, it has diplomatic rum and egg white foam... so good!", "author": "Tokunbo E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "BEWARE: It gets really stuffy and crowded upstairs. You will be sweating and rubbing up against people when trying to make your way to the bar.\n\nWe couldn't stand to wait in the long line for Halloween this year, so my friend ended up getting two tables. Each table was $500 and came with 5 comps. The rest of our party got to skip the line, but had to pay cover ($10 for girls, $20 for guys). The main stage tables are the best because they rope them off, but they were taken. The staff ended up just pushing two bar tables together in the corner for us. It was pretty ghetto. \n\nStill, it ended up being okay because 1) we were in the corner with the glass windows so we stayed relatively cool, uncrowded, and got to people watch all the Halloween shenanigans going on downstairs on Polk street, and 2) we were very drunk.\n\nThis is a solid spot because it's usually always packed, and they play all the hip hop faves, none of that EDM bullshit. Check it out, and if you can manage to grab a table, even better!", "author": "Claudia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-23", "description": "I've been here a few times, well I've crawled here from Diva's after a buncha drinks blah ha.\nAManda rocks used too do karaoke here now she passed it on over to stella.\n\nMaybe it should be called wild Stella karaoke now.\n\nKaraoke here is every tuesday.\n\nThe beer prices aren't bad.\nThey have a groupon for a pub crawl that sometimes includes this place.\n\nTHis place is very roomy so you can bust some moves without bumping into people.\n\nThe ambiance is real nice.\nIt gets pretty wild here with the crowd that's fer sure.\n\nIts pretty easy to get the crowd going , that's fer sure.\n\nThere's some pretty good doughnut places around here too.", "author": "Luke S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "Came in on a Monday. Slowish, but ended up just shooting it with the bartender: Jessica. She was really funny/friendly, we talked craft cocktails and hockey (Go Preds). She made me a great Paper Plane cocktail off their menu and also told me about their Sunday Latin nights. I'll be back, check it out and have a good time.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-13", "description": "Worst experience at a sf bar, came here on a SLOW  Saturday night, got stereotyped after the fact I was in the bar PAYING for a drink.  The so called manager asked his so called security to come over to the bar where I was signed to tell me I was not welcomed while his Caesar's self walked by listening.  Without an explanation of why I can't sit here and enjoy the music and a drink I get told I have to leave.  The manager and the bouncers are racist stereotypical cowards and now I understand the reason why this place has so many bad ratings. Being an sf native there are many better places to go to the owner/manager should read threw the yelp reviews once in awhile to improve on the service.", "author": "Ada M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "This is a fun bar but always packed. Dance floor upstairs that's always full. Cover on most weekend nights. If you come around midnight the wait will be long.", "author": "SeungJin K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-24", "description": "Playland has a great upstairs and dance floor, however it can get super crowded and busy during the weekends. As a female I don't have to pay a cover charge, however my guy friends usually do. \nDrinks are good, great music, all and all a good time out with friends.", "author": "Ronni M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-07", "description": "My first impression was not good: Gender based cover charge, even though I was with 3 women. This is San Francisco, we're supposed to be above gender discrimination.\nThe bouncers were doing an okay job considering how insanely packed the place was, but it was borderline unsafe upstairs. My friend got stomped on multiple times by large men (she's short), even I'd get thrown around and I'm not small.\n\nThere's also two toilets for all genders at the entire establishment. Conveniently placed on the tiny hallway between the two parts of the bar. Unsurprisingly this ends up with a line blocking the whole place.", "author": "Kurt N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "I enjoy happy hour at Playland. Only $4 for a pint! And always a good convo with my bartender Julia", "author": "ziad a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-29", "description": "I was touched inappropriately by several guys in one night. I reported it to the management and they said, \"we have no control of the men that we let in here\". \nI will never return here again. No woman should be treated like this.", "author": "Madison C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "LOVE this place!!! Downstairs it's a bar with cocktails places to sit down and upstairs it's a dance floor with good dancing music! Every time I go there I have a blast and every friend I take there becomes a client :) the only thing that could be improved is the fact that they don't have a coat check! ‍", "author": "Renata F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-28", "description": "Lost my credit card and promised to call back in the morning - did not do that, had to wait 30 minutes on a Saturday night before they could tell me that they lost my credit card. \n\nCharged cover even though the door policy says that they don't charge until 10:30 pm.", "author": "David W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-20", "description": "Too hard to chat with your friends upstairs, although the DJ was good on a Friday night. The crowd is for 20-somethings with mid-drifts and short shorts. The vibe is a bit pretentious and the dance floor was too small. Only came here to meet my friends before ditching this place for McTeagues.", "author": "Moua L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "Fun place, especially when you're single. Always lots of beautiful people. Still a little bitter that they confiscated my flask and then I lost it forever... Loud, recent music. Fun on the weekends, even Sunday nights. I went on a Sunday when they had Latino music night, not sure if that's every week, but it was a blast.", "author": "Jackie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-18", "description": "I have been going to Playland every Friday,Yesterday I was there with my friends who were visiting from Turkey and someone stole my friends phone. We asked for help to find it and the only thing the employees told us was\" this happens every time , we can't find your phone \" I was really disappointed. We asked them to open the cameras bc we knew the exactly time when the phone was stolen and they start yelling at us and saying you have to get put of here. I'm never going back to a place when nothing is safe", "author": "Kristina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "This was my first time here at Playland, intriguing conversation with Julia and awesome drinks!", "author": "Caitlin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "I love Playland on Wednesday night! If you are looking for a cozy place with a delicious cocktails and a nice company of a smily bartender, Playland is a great place to spend your time. My favorite cocktail is Playland Mule! It is basically a Moscow Mule, but I think they have a special recipe for this drink. If you are here, Moscow Mule is a Must Try. I had an amazing experience and highly recommend this place!", "author": "Alena H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Went to Playland on Wednesday night! Loved the atmosphere there! I tried all the specials, my favorite is cucumber gimlet! Tastes like summer, very refreshing. The bartender's name was Lana if I remembered it right, she is a very lovely girl! If you are in the area, definitely go to Playland!", "author": "Ksenya U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "Bartender is so welcoming and nice. He does some great tasting unique cocktails. Awesome chill spot.", "author": "Gloribel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Best bartender was Ariel, beyond accommodating and understanding. Management should be grateful that they have people like Ariel on staff!!", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "It's been a while since I've gone out dancing. Imagine my surprise when we did an impromptu stop by Playland. It was Friday, May 1st around 12:30pm.\n\nI used to love going out just to dance in my 20s. Now in my 30s, I still like dancing, but I hate dealing with the crowds. At Playland, I honestly didn't mind since I was having so much fun!\n\nI don't believe we drank at all while we were here. We just hung out upstairs and danced the night away. The music was perfect as it was mostly top 40. Easy to dance to as I loved top 40 and hip hop back in the day.\n\nIt was fun reliving my 20s just a little. I do love dancing and Playland let me indulge in that. Out of the couple of stops we made along Polk, this was my favorite.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-22", "description": "Was in town visiting and all of the bars were cool until I got to this one. They are very rude in the upstairs portion especially the blonde bartender. You can't even call the bar to check if your tab was left open there. They redirect you to some \"corporate\" office. When I did make it to the bar to get my Credit Card finally, come to find out the bartender must have been putting everybody's drinks on my tab. They charged my for a big tab and all I had was 2 Coronas. Two thumbs down on this place", "author": "Keilan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-07", "description": "Walking along the lit up thoroughfare of the Polk Street nightlife, my friends and I were encouraged by the rumbling of fellow bar-goers that stumbled about. There are many good bars in the area, but one I had yet to visit had my eye, Playland Bar. A line around the corner, modern architecture, and beautiful black slate sign, I felt like I might meet a good time inside.\n\nAfter a 5-10 minute wait wait in line, I found myself face to face with a bouncer who assured me the $15 cover charge is worth it. We obliged out of semi-drunken curiosity, stamped ourselves in, and were ushered into a cool lower level bar where people mingled and met with arriving friends. I ventured around as my shoulders pressed back and forth between groups of people, and was quickly turned around as i unknowingly entered a private back room.\n\nNo matter, I wanted a drink, so I got one. Whiskey Sour ($12). As I waited for my drink, as did my friends, we found ourselves being pushed about by a drunken, self-entitled mess: \"the bathroom line\". Annoyed by the inadequate lack of space between different facets of the bar, I managed to get a drink in just a few minutes, and we headed toward the upper floor.\n\n\"Stop,\" A bouncer says to my friend. He asks my friend to remove his ball cap, as hats are apparently a form of gang symbol in the area. My friend was forced to hold his ball cap beside him the whole night.\n\nWe trudged upstairs in a flurry of people and came face to face with a medium-size dance floor style area with two small bars. We took toward the floor in a slow plod. Like air in a rubber balloon, as people began to enter though the middle of the dance floor, subsequent patrons were pushed outward. The sweat began to condense over the windows, flying elbows made drinks bob up and down like buoys in an ocean storm. When I came to a point of no further advancement, the dance floor seemed just out of reach, unattainable.\n\nWe decided to mingle elsewhere, and we found ourselves with a group of lovely young women who eyed us down with looks that seemingly spoke louder than words. Words have little effect here as the music on the upper level blares above most conversational volume; all the more reason to dance to keep things from getting awkward. After we shared some of our drinks with them, they began to advance on us in a way that ousted a knee-jerk reaction from my friend:  \"I'll buy shots!\"\n\nHe paid an ungodly amount of money for five or six shots, and the women quickly faded into the sweaty abyss of Playland like Jack Dawson into the Atlantic. With hope of finding our way back to the dance floor, we sought out the other upper level bar for more liquid encouragement, and hopefully some conversation. \n\nI bought another Whiskey Sour, because, well, it was a damn good drink. However, this time it cost me $15, which I tried to fix with the bartender, a woman who had little bereavement for the mistake. My friend was given the wrong amount of change as well, so it gave me the impression of someone capitalizing on drunken customers. (An impression, nothing more.) However, based on the quality of the second Whiskey Sour (piss poor), I'm convinced there was either some neglect by the staff, or they were testing out a new trainee.\n\nAfter speaking to some beautiful older women out on a bachelorette party, it took us till nearly 12:30-1PM until we could manage enough room for adequate dancing.  Before that, dancers are subject to the sweltering heat of the looming sweat-fog and the jabbing of butt shoves from men with confusingly hostile temperaments.\n\nWe left the bar in an Uber with little desire to return. Sweat rendered our shirts wet, and our satisfaction on the night was at a minimum, especially relative the lack of money in our pockets.", "author": "Shane M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-23", "description": "Worst place ever. -1000 stars. Don't ever open a tab and go use the restroom. They will actually force you to wait in line to go close your tab. Awful.", "author": "Michael O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Good day to everyone and hope San Francisco has treated you with love or will treat you with love when you do get here, Hehehe\n\nNot sure if I should say my name or what but what the heck, I'm Keiki and everyone knows me as ThePandaPhotographer from 646Studios.com and I'd travel most of my time as a photographer and when I am in a city, I like to take risk in a small way. That risk is just looking for a place for a good drink but I am very selective in that category but I wasn't planning to go out on a Wednesday night but yesterday evening, I've met one Canadian named Amanda and one Australian at the downtown hostel and we just click and decided to go bar hopping. So we just went around town looking for places and drink but there was one that stood out and we had to check Playland Bar out. I'd like the low light theme and as a photographer it was well lit. Now about Christian the bartender Wednesday night (last night). What an amazing guy and what he was doing at the bar was extremely cool with the hand skills and tricks but not only that, he made some nice and beautiful drinks. I'd like an IPA beer and my IPA was good and not flat like the last place we visit before Playland but my new hostel friends wanted mix drinks this time around. I had a very interested and fun time at playland. We were all upstair and didn't get a chance to visit the downstairs level to check it out. The lighting was excellent and I would love to take some photos of the place and that was the plan in a way from the next day but I can't, maybe next time. The space is good for groups or for a date if you are on one. There are two restrooms on the first level but I am not sure for the lower level but I'd have confident in Playland to have two more. This will be mine place to just hangout with I am not doing work and will just have a drink or two. I'm not a party person that much and just like to keep things smooth and relax. Maybe this is the place for you and maybe it's not and I am not   doing this for the place at all but doing this to share an experience with you and maybe you will decided on your own if this place is good or not. As I said before, it may not or maybe the place you are looking for. So the total time we were there was about 25-45 minutes talking and drinking and feeling good. So it was a very pleasant experiences  and hope you have one of the same.\n\nEnjoy", "author": "Keiki-Alexander D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-14", "description": "The door guys are hella extra. They swear it's Vegas or something. They didn't let us in because of baggy pants? Umm baggy is big ass pants that look 5 sizes big. I'm like 35 years old so no I don't own pair of baggy pants and sure as hell ain't wearing skinny jeans. Don't spend your money there just go to the other bars in the area. They will treat you a lot nicer. If I can give zero stars I would. To the douche bouncers treat everyone equal not just girls with big boobs and butts. You're probably not going to get none anyways!", "author": "Lex J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "Great service and a nice atmosphere.\n\nA couple friends and I went to Playland on Wednesday night. We loved the bar and the atmosphere. It was a slow night but it was still fun. Our server (I think her name was Lana) was very nice and energetic, which made up for the slow night. We were only visiting on business but I will definitely be coming back to this bar next time I stay in SF.", "author": "Seth B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-21", "description": "This place was cool except for the fact that some asshole grabbed a nice handful of (my) ass as I was ordering a drink at the bar. RUDE. It was so damn packed I couldn't identify him (or her??? lol jk it was def a guy) among the masses of people passing by. \n\nAnyway other than that, it's pretty poppin up in hurr. I got over it pretty quickly because I was already pretty drunk and my friend handed me a shot of jamie right after. So I was ok lol. But next time.... anonymous butt grabbers I will f*ck you up.\n\nI like that they have 2 floors - downstairs to chill and the upstairs to get cURAZY! Ok maybe not but there are bars both upstairs and downstairs, as well as a dance floor upstairs. It gets crackin up there! lol\n\nDranks are cool. My friend bought me a \"bye felicia\" lololol and that was pretty good. But after that it was shot shot shots shoshotssthsktshtksetef so I can't recommend anymore lol.\n\nIt's also good to get yourself a stamp in case you wanna return sometime during the night. But also don't be too drunk so they'll actually let you back in LOL - my idiot friend can tell you all about that.\n\nAnyway, cool spot! Watch out for ass grabbers!", "author": "Fran B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "Excellent service! Def get the paper plane drink. The whiskey selection is amazing with options from hibiki to Macllan.", "author": "Cuong T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-10", "description": "Santacon was the day when i first visited this bar and was surprised by the rude staff on duty. There was a young African-American security staff who was forcefully stopping by hand men and women alike instead of talking, when i complained that your staff cannot treat people like this and you cannot touch people to another senior staff member (Hispanic-Latino american), he just didn't take action on my complaint. It should be reported to police and this staff should be fired.", "author": "Adam U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Good drinks, friendly staff, great happy hour and an awesome night life. What more could you ask for? There's lots of bars on Polk street but we always end up here. We like that you can get a drink and talk downstairs and dance upstairs.", "author": "Laura M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "I like to dance the floor upstairs and I can not just sit down and lost in my phone. Everything good,but when 2 a.m.,red necktie man keep yelling at us even I waiting for Uber .I'm not drunk at that time.So I kinda feel bad when the guy yelling at me to go away.At least,just say 'please' or gentle talking.Anyway,I still going for some weekend and just out before 1 a.m.", "author": "Gorngamon K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-21", "description": "Shit people come here. They'll steal your iPhone. Don't trust people.", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "A great bar in Nob Hill. I brought my friend here who was visiting from out of town for a drink. \n\nWe loved the ambiance and friendliness of the bartenders when we came in to the place. We sat down at the bar, and the bartenders made some recommendations. \n\nWe order the Ginger Patch and Strawberry Basil. Both were divine. They they suggested that I get the Diplomatic Exclusive, which was delish and intriguing, definitely a try! \n\nWe came on a week night, and the place was just what we needed. I have stopped by on the weekend, and it is pack and hopping, totally different scene.\n\nIf you are looking for some great cocktails, infused with fresh fruit and herbs, during the week day,  say after work, this is the place to go! As for the weekend, if you are looking for happening, packed place with great drinks (but have to wait a bit for a drink), then I suggest this place too! \n\nSip, sip, sip on fellow Yelpers:)", "author": "Sonia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "Cat (the bartender) is amazing.  Drinks are awesome.. love my play land mule... love the ambiance...", "author": "Tu N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "This is the best bar I have ever been to! Barbora is the best bartender I've ever had. She knows her alcohol & comes up with the best drinks, she asks what what your favorite alcohol is and makes recommendations on what you'll like and does her best! We visited from LA & this experience up here has been amazing! If you want good drinks and good customer service, this place is the best! Tip her 25%! The experience is worth it!!", "author": "Nissa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "I went to Playland on a Monday night with some co workers while we were in town and we had a lovely night. The upstairs bar was closed (since it was Monday, I am guessing) so I can't comment on that atmosphere or crowd. Morgan was our bartender and was super helpful when we were indecisive on what to order. We tried the Gin Cucumber Gimlet and it was right on. She was really attentive and chatted with us for a bit. We are in town often and hope Morgan is there on Monday nights!", "author": "Birdie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-07", "description": "Ladies are free anytime (or at least Friday and Saturday nights when I've gone).  \nAnd ladies, if there's a long line to get in full of mostly gentleman, you walk right on up to the bouncer and in you go.  \n\nThe dance floor is upstairs with 2 or 3 bars, and it is always packed to the brim.  Like you can barely sway side to side sometimes, and it can get pretty annoying and frustrating actually with people constantly shoving their way through and spilling their drinks on you left and right (please try not to do that).  \n\nUsually we squeeze our way towards the back and to the side, where you get some breathing and elbow room.  They play Top 40s and songs that everyone knows; it's always fun when you and everyone else can sing along and dance to :) There are also less creepers compared to other SF clubs, as most are in their 20s.  \n\nIf you're not into that scene then you can chill in the lounge downstairs, where there are 2 bars.  Dress code here ranges from dressy to casual-but-not-grungy-or-sloppy-yet-put-in-some-effort.  \n\nOverall, always a fun time here and a great way to end the night!", "author": "Emmeline C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-16", "description": "I've been almost everywhere in SF and I definitely can tell - i got the worst experience in Playland! If you are looking for a good music - avoid that place (there is mostly old hip hop / rap), if you are looking for good sound - forget about that place (you can barely recognize a melody). The worst thing in there is security staff - without any reason they can kick you out from that place just cuz you were staying not in the right spot - a saw today how it happened at least 10 times - ppl were just dancing in front of a bar on (attention!) a dance floor and couldn't understand why, and after they tried to figure it out a security guy called another on an he send people out... Also don't expect any apologies from ppl who will be pushing you and stepping on your feet all night... In conclusion, I wish I could give that place something like  minus 100 stars, I would do it without any doubts. Avoid that place if you respect yourself.", "author": "Anton Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-10", "description": "Playland is an chill spot on polk your looking to boogie upstairs. Not gonna lie it crowded AF upstairs with bodies which makes it too hot. They have some AC but you better be under the damn thing always no point lol.\n\nDownstairs on the cooler side if your trying to mingle, chill or have a few drinks. Not excited paying $20 when i bring females but hey no gender discrimination right. \n\nAll in all security is cool and is fun place.", "author": "Azziz I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-26", "description": "Better than average party spot on Polk, not dirty or ghetto & there's an option between turning it up in the upstairs lounge/club with a live video DJ, or staying on the quieter, smaller bar downstairs. It's equivalent to Raven Bar, except that place has hella asians and out of town people. Playland is less pretentious and \"Azn.\"\n\nNever had any issues getting drinks upstairs, the bouncers are respectful, and drinks aren't severely overpriced. Decent craft beer selection on tap if you're trying to get your IPA on.\n\nBusy on Thursday nights through the weekend. On my most recent night, I think it was 80s night or something since I heard a ton of Michael Jackson, but that became hip hop and tiny bit of big room house throughout the night. Really depends on the DJ, that night it was Dj Chicken Scratch. Requests are pretty easy to put in if you so desire.\n\nChill.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-20", "description": "So, we went here the afternoon before the movies this past weekend and had a good time! We attended many hours ahead of our scheduled tickets for Iñárritu's \"Birdman\" film at the AMC, so there was still ample room for a smile here.\n\nPlenty of room, in fact -- we were the first to get seats that afternoon. Glad we arrived when we did, though, as the space was filled in about ten minutes! A bulldog, Homer Simpson, Betty Boop, and other character designs were professionally nailed into the bar surface, under the glass. More smiles generated...\n\nOnto the drinks! We enjoyed the following:\n-Apricot Diplomat (w Rum)\n-Lost in the Sauce (w Whiskey, smokey)\n-Strawberry Basil Martini & Fine As Wine (very lavendery) for other half\n-Gavroche for each\n\nMost were cocktails, but the Gavroches were delectable beers. Bartender was sweet and knew her stuff. Noticed there was a second floor here, so I see this place can satisfy many!", "author": "Garett T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "My first time at Playland and I'm definitely a fan. It was a great spot to catch a basketball playoff the other day because it's not too packed and they play the volume on games so that you can actually hear the commentary (instead of loud music during games). Happy hour deals are great here, $3 draft beers (including 321, deschutes, shock top, Stella) 4-7pm. Bartender service was spot on. They don't serve food here, but you can bring food in. Our bartender noticed a lot of people asking for food, so he found a couple large bags of chips and peanuts and started sharing it with the bar which was cool. There's a large back room which apparently is for dancing in the evening hours and is also available to rent. Variety of cocktails available as well. Solid choice in the crowded Polk-gulch corridor.", "author": "Will H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-19", "description": "Place is a great time, latin music was great and staff is very friendly.  Would recommend for a Sunday Funday!", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-14", "description": "Not the best looking place, but certainly has a personality. When my friends and I waltzed in early on a Friday night (9PM ish), we managed to get in for free. Downstairs was pretty populated but the upstairs area was nearly empty save for a few people floating by the bar or the couches along the wall. Typical dim lighting, sticky wooden floors, and an almost disused look to it. We took up camp on the stage at the back because there were couches available and we were fascinated by the R&B throwback music videos playing on the two TV screens. First impression? A random chill R&B lounge.\n\nAs the music transitioned into modern pop hits more people straggled in to join our awkward dancing. We were also kicked off the stage because it's apparently reserved for not-so-private parties, guarded by red ropes and bouncers. The bartenders were fun-loving and eager to dance while mixing our drinks, adding to the increasingly lively atmosphere. By about 11PM when the DJ phased into EDM, the top floor was essentially a dance club, with barely enough room for various staff to squeeze past the writhing bodies. Which they did REALLY often. \n\nAnyways, crowd is nice for the most part but prepare to stand your ground against a few aggressive dancers as usual.", "author": "Helen S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-01", "description": "If it were possible to give this place 0 stars, then I so would. My roommate and I went to this place with a couple of friends thinking it would be a great night but the bouncer who was there was beyond rude and condescending. First of all, Vlad Ruben asked a bunch of unnecessary questions about our ID's, assuming they were fakes, and because one of my friends jokingly said \"I'm drunk\" when asked why he got his zip code wrong, he decided not to let any of us in. We have never been accused of using fakes especially because ours are actually real. He stated that having us in the bar would be a liability. \nWhen my roommate proceeded to defend our friend and try to reason with the bouncer, he repeatedly referred to her in demeaning pet names like \"baby\" and \"sweetheart,\" even though she politely asked him to stop because her name was Olivia. Once she grew tired of it, she asked to please speak to the manager and he informed us that they had no manager on duty. \nAll in all, even he recognized he was being unnecessarily disrespectful to all of us yet made no attempts to stop his abusive behavior. In a time when I was trying to feel good and be surrounded with good vibes considering all that has been going on with our country, this one person made us feel unsafe and disrespected and put an end to tonight's attempted festivities.", "author": "Melanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "Was here for a drink before it got crazy packed. Place turns into a club. Not really my scene but if that's what you like then this is the place for you.", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-26", "description": "The upstairs has a great area to dance in, with fun music and interesting music videos showing! \n\nHowever, we ordered shots at the downstairs bar and upon ordering we were quoted $11, and after drinking the blonde bartender told us \"I accidentally gave you the discounted employee price, it's $16 each.\"", "author": "Pat C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-09", "description": "Came here on a Sunday to meet friends who were already inside. The first thing security asks me to do is to pull up my shirt. Which is weird I have never been asked that before. I pull up my shirt and he says I can't get in because I am sagging. Just because my pants weren't skin tight and were barely sitting below my waist they didn't let me in? I then proceed to slightly pull up my pants and tighten my belt. If I was intentionally sagging it would have been called out right away and they wouldn't have had to ask I felt profiled. The security guards told my friends who were inside that people have been getting there phones stolen so I guess they are profiling people in hopes of reducing this, because security said that is why they are being strict. If more than one person on yelp feels they have been profiled by this place it must be true. Then the security guard proceeds to tell me that the Manager is on duty and is watching the cameras and called me out and that if he wasn't there he would've let me in. In addition to this while I am pleading my case to go in I see a person come out of Playland sagging and with a hat on and soccer jersey and my friends who were inside later on tell me they saw people sagging and dressed way more casually than I was inside. Frustrating experience! Would not recommend unless you want to risk getting profiled and made to feel like you're some kind of thug.", "author": "Abraham G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "There's about a trillion people here on a Friday night. But if you're patient in line, the bouncer will let you upstairs and it gets pretty ratchet fun. The crowd is generally young and the music is awesome. You really know all the songs b/c it's a mix of top 40s and 90s pop. \n\nYou really end up dancing a storm with or without the influence of alcohol. From what I remember, everyone was super friendly and the drinks were ok priced (?). \n\nFinally girls get in free. Guys have a cover. But it's like $5 or 10", "author": "April Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-14", "description": "Great bar club with an upstairs and downstairs, but mostly upstairs for being able to dance!  \n\nI like the name to this place!\n\nIt's a fun play place to be at and music is mainstream for the most part! \n\nI super like how girls don't have to pay a cover on a Friday night!\n\nFun, fun, fun and play, play, play!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-21", "description": "Trying to get your groove on or are a post grad like me trying to go out like I did in college? Then this is the place.  \n\nYou have everything from no room, no AC, and the frat boys/frat boy wannabes there in their Hawaiian shirts...We all know that guy who goes to the club in those shirts in college. \n\nNot going to lie, I love that kind of vibe being in my young 20s just trying to have some fun.  If you love to dance and don't really care about your make up sweating off, then this is the place for you. NOTE: If you are dancing, skip the eye shadow. That thing is coming off when you dance here.\n\nThe dance floor is a small space that everyone crams into and there are only 2 fans located in the whole dance space, so if you are lucky to be dancing in it than a win for you.  If you aren't one of the lucky ones, then hopefully you are drunk enough to not even care.\n\nNow, I ordered a Mai Tai for a friend and the bartender gave me a \"What is a Mai Tai\" look which is what happened with our drink.  It was definitely not a Mai Tai and my friend could not drink it.  Thankfully, there was a lot of alcohol in it for whatever it was. Not sure if Mai Tais are not a common thing, but I would just think they would say sorry we don't have that here instead.\n\nAlso, there is a $20 min for using your cards :(", "author": "Alisa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "Playland is a cool spot with a great service. Delicious cocktails and fresh hiphop playlist!", "author": "Alex F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Great music, drinks are always good. The only bad thing is it gets very crowded very fast and there isn't enough seating", "author": "Asante B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-26", "description": "This is what make San Francisco the best!  \nGreat atmosphere \ngood drinks about $7-$12 each Must try the \"strawberry basil\" it taste similar to a mojito. \nclassy crowd \ngood dancing", "author": "Stephanie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "My girlfriend had her 23rd birthday here. The bouncers were the absolute best. The were so chill, attentive and just awesome. They danced with our group but also paid attention to every person who entered the VIP section. On top of that, they escorted my girlfriend to and from the dj booth every time she wanted to request a song.  All in all, if you want to spend some money and have a great night reserve a table at playland. Jermaine and Forrest  and the guys are awesome. Would recommend to a friend.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Best bar with dancing in the city! The service was great! The drinks were great! The multi rooms music was great. Lots of bathrooms. Great location.  Had a great time!", "author": "Rima D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "We came here on Cinco de Mayo.  Awesome happy hour drink specials! Our bartender Ali was super friendly and mixed great drinks. We ordered cucumber mint & strawberry margaritas \nWe used to come here for the dancing upstairs but they recently added a little whisky lounge in the back downstairs, I'll definitely be back check it out next time! Sundays are salsa night which we heard is fun so we might come back for that. \n\nOverall a great time with great drinks and atmosphere.", "author": "Kate S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-03", "description": "You have to pay cover for a way too crowded bar with barbacks doing their best Frank Gore impression and barreling into the crowd for yardage after contact.\n\nThe dance floor is packed in a way that goes beyond enjoyable, but some people like the crush of people. I'm not one of them.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "If I could rate in half stars, I would give this 3.5 stars, but I had a good experience at Playland despite its drawbacks, so why not bump my rating? It's easy to break down my feedback for this place in a few points:\n\n- LOVE the top 40s music and the fact that they showed music videos at the bar. Good dancing vibes.\n- Small place and crowded but well-ventilated so can't complain.\n- Bartenders were friendly and drinks were good. Nothing special.\n- I hate that there is literally only one bathroom for the whole place. It can cause some crowding on the bottom floor.\n\nAs long as you get here early, it's not a bad place to be. Nice and basic clubbing experience guaranteed!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-13", "description": "Most boring music I've ever heard. Couldn't even dance with the guy I met up with.... And music is key to having a good night out haha", "author": "Marianne G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-09", "description": "Need to cap out how many people come into the bar. Whats the point of going in if its way too packed that you cant even move? \n\nGot my phone stolen literally within 15 minutes of being there. I know that isn't really the bars fault, however, it should deter vacationers from going places that they will be robbed from. (Kinda hard to vacation; Uber, Lyft, Find reviews, know what time it is, take photos without a phone)\n\nHOT AS HELL.\n\nThe establishment was clan for the most part and had a good vibe. \n\nProbably wont come back because of the criminal demographic.", "author": "Maria Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "Love this place! There're two floors, the dance floor is on the second floor. It's really busy on Friday and Saturday, because it's (obviously) weekend and the music is cool! On Sunday they do Salsa Night  \nBartenders are fast and do good job! My favorite is Lana! \nAnd the cocktails!... Cocktails are A-MA-ZING!!! \n\nThe negative thing people usually complain about is that restrooms are only on the first floor. \n\nSo check it out;)", "author": "Tatiana P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-07", "description": "I decided along with a few friends that we would be starting our night with playland bar. First off, the line was pretty long although it did move relatively quickly. Upon entering we were submerged in a sea of others trying to get drinks, waiting for the bathroom, or waiting on line to get upstairs. It was very crowded and I could not count how many bodies I bumped. We decided to make our way upstairs to see what the hype was about and as we reached the upstairs bar we began to realize that we would be screaming to communicate. It was just as packed as the downstairs and much harder to get a drink from the bar. \nThis bar would be nice for younger college like students who don't mind grinding up on each other to make their way to a packed dance floor. For myself and my friends who have been out of college for a few years, this is not the scene for us.", "author": "Matthew H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-07", "description": "You guys need some AC ! \nor at least put it on MAX or something \n\ni loved the bartender here :)\nshe was so nice and i loved what she recommended. \nI have no idea what that was, but she made some amazing drinks !\nand it was only around $7 for a glass of cocktail (esp on friday night??) \ni do not remember her name \n.. but we were there around 10pm ? on Friday \nI would not mind going back just because the service was so nice", "author": "Yumi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "I left my ID in exchange for the copper cups. The cups were given to the upstairs bartender. I came back for my ID at 2:00AM and they said my ID is not there. Don't leave your ID with them.\n\nEdit: I called the General Manager and he called me back a few days later and said they found my ID. He stated that there were over 200 IDs left there over the last few weeks and apologized for the inconvenience. For my efforts, he gave me a bottle. I changed my rating from a one star to a four star because of the generosity.\n\nPlease come visit Livermore downtown and I'll be happy to reciprocate your generosity.", "author": "Christopher H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "A perfect place for everybody! Want to dance? Go upstairs! Want to get a drink? Go to any of the three bars! Want to find new friends? Just spend a minute without moving! \nWhat I really love about this place is the atmosphere. Music is awesome, everyone's into the moment, people are cool, what else you can ask for? \nAnd the thing I MUST mention is the cutest and the friendliest bartender Lana. Her cocktails were perfectly made and her attitude to what she's doing is literally inspiring! She loves being there! \nDon't. Even. Think. \nJust go to Playland bar and make yourself a perfect night!", "author": "Yaroslava K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "This place is fun and frankly hilarious. It doesn't really feel like a place where locals hang out, so it's an excellent place to people watch. I love the bartenders and bouncers here though. My friend and I were in our normal night out attire, while everyone else seemed to have teleported from a Vegas nightclub, and we weren't treated any differently. The music here is a lot of fun and I'll definitely be back.", "author": "Tatiana J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "I'm rating based on day drinking, when I stumbled into Playland after Bay to Breakers (I liked that Polk St. wasn't the place to be post-run). Wow - those drinks were fantastic. I wish I could recall the cocktails my friends and I ordered, but they're all captured in my photo so you can admire their beauty and imagine how they taste going down. It's small so I'm unsure what'd it be like on a weekend with their DJ, but with an upstairs (like other reviewers mention) it could work. Go thirsty!", "author": "Amanda V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-06", "description": "I've been coming to the Playland for over 2 years, it's usually a lot of fun. It's crowded, but there is a good ratio of girls / guys since there are no cover for girls and a $5 to $10 cover for guys.\nBut last night (03/05/16) 2 my friends got there phone stolen! One had left the purse on the side while dancing (ok not prudent but still..) the other had her phone in the back pocket most of the nigh. The thief did it a closing time. We realized that while leaving and the bouncer would not let us back in to check..\n\nYou cannot judge 100% based on looks, but there was pretty bad looking guys.. Who are you letting in Playland staff? I won't spend my money and energy at your place anymore!", "author": "Remi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "One of my favorite bars on Polk Street:) Ive been coming back here more and more oftenly now- particularly because of their paper board filled with creative special cocktails. love those. \nalways colorful crowd, fun to watch. \nsuper nice bartenders - I know at least too- sweet and very professional Judith and Svitlana who works night shift, -that girl makes great suggestions and mean drinks:) I drink quite a bit but never sure what I want - annoying, so solid bartender always helps.", "author": "Liza B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-06", "description": "Was in the bar on a Sunday night, watching football.  The bar transitioned from a casual crowd watching the game to their salsa night.  Douche Bag bald door security guy cards me while I have already been drinking (with a drink at the bar in front of me).  So since I'm 40 it's no problem for me to enjoy my adult beverage thank you!  He approaches me 3mins later to ask me to remove the beenie I've been wearing in there the last 90mins.  I say no, stand up, walk away from my nearly full drink, and walk out.  True Story, no exaggeration at all.  I have 4 friends coming into town this week, and guess what bar on Polk we'll skip!?     \"F!\"", "author": "Zabour W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-06", "description": "Love this place - all the times I've been here, I've never had to pay cover. Aside from that, drinks aren't cheap and the place can get packed. But if you're down for loud music and fun, make sure you check it out!", "author": "Erika D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "What bar can you go to for a fun night out on Polk Street with the best bartenders and happy hour?? \n\nPLAYLAND. \n\nThis craft cocktail bar has a variety of drinks on their menu ( try \"Karl the Fog\" and you won't be disappointed). I like going during karaoke night on Tuesday nights because it's always amusing watching drunk people belt out their best (or worst) version of \"Don't Stop Believing\" plus Cat is behind the bar and she makes awesome drinks and is always fun to talk to. I've also been here during weekend nights. It gets crowded so come early. The music and vibe is always great!", "author": "Ronald L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-14", "description": "The stamp they gave me when I got in rubbed off on my jacket, when I tried to get in again, the bouncers were giving me nothing but attitude and treating me like a child even though, the girls I was with had stamps too and he saw me come in. He continued to claim he never saw me while at the same time laughing at me. He eventually let me in but I honestly think he just enjoys giving drunk girls a hard time.", "author": "Anastasia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-31", "description": "Playland Bar is not a bad bar to hit up if you're trying to go for pretty good drinks and have some good music to dance to. \n\nDownstairs the bar is a lot less empty and less crowded if you are just looking for a place to drink and chill. Upstairs is where the music is blasting and people are dancing. Be warned that the bar on the side needs $20 minimum to use your card and the bar in the middle is cash only. \n\nThe bar accommodated our 20 guests very easily and somehow my party even got an entire section on the couch. It can get very crowded out on the dance floor, but if you are a type who doesn't like to get touched or gets annoyed being pushed accidentally, then you are obviously at the wrong place and might as well go to a smaller bar not on Polk Street.", "author": "Tina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "Playland has been one of my favorite spots in SF since their establishment back sometime in 2012.. Now I hear a lot of complaints about this place but you really have to try it more than once to appreciate it. And honestly come on an off night that isn't Fri/Sat night, when the crowds from all around the bay area know to hit up this hot nightlife spot! They have latin night Sundays, board game night on Mondays and my favorite ladies night Thursdays. One of the reasons this place is my favorite is that they make a variety of different craft cocktails that are O so very tasty! Seriously try one of their egg white drinks you won't be disappointed. With a big projection screen to watch all the big games now and even on Fri/Sat the downstairs lounge and back room are perfect to sit with your crew or get to know that special person you perhaps met on the dance floor;) The staff is all very friendly and if your around enough they will appreciate your face!", "author": "Gabriel V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-08", "description": "Overall Good music, good drinks, they OVERCHARGED me A LOT on my card!!! they added more to the tip I had wrote !!!! not right!!!!!!!!!!!! WATCH OUT", "author": "Lils A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-11", "description": "Came in with a group of friends, only to have the bouncer accuse my friend of having a fake ID. They need to understand not everyone from out of state has a fake ID. I am sorry but they really need to upgrade their scanner or hire bouncers who are confident enough to tell which the real from the fake IDs are. If you have an out of state ID, good luck trying to get in.", "author": "Elisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Absolutely lovely!my favorite spot for drinks in SF!I Really like the atmosphere there!Great music.Bartenders are so super friendly and knowledgeable!Drinks are truly awesome!!!Highly recommend !", "author": "Alena P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-21", "description": "I really liked Playland. The drinks were good and so was the dancing and dj. Definitely watch your purse though. My friend's phone and my phone were both stolen out of our purses. The security team and staff were super helpful in trying to find them, although unsuccessful.", "author": "Kristen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Christian was a great help in finding my lost debit card and very courteous.  He also gave me great advice on surrounding establishments.  I really appreciated his bar and customer service skills.  If you're looking for a bar in the area I highly recommend Playland.", "author": "Jackie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "I was surprised how awesome this bar was. \n\n1) Great music. Upbeat top 40s and house/dance, pretty much every single hit from the past year that played on the radio that you could dance to. \n\n2) Delicious drinks. BEST LONG ISLAND I'VE EVER HAD!!!!!! \n\n3) Cool corner window on the second floor which overlooks Pine & Polk St...a fun place for an Instagram pic. \n\n4) Dance floor. It was on the other side of the bar which was kind of annoying when it was so crowded, but how many bars have a dance floor?!  The best of both worlds!\n\nObviously this place isn't for you if you hate top 40s and dancing, but for everyone else this bar is a winner!", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "Since moving to the City not too long ago, this has been my 'go to' spot. You can always count on good service from all the staff. The music is always on point as well. The crowd is typically aged 21-30ish. It's also totally worth coughing up the extra money to get bottle service. Not only do you actually have space in the crowded upstairs area, but also the bouncers are super cool and Catalina (the hostess) is Vegas material (nice, helpful and super gorgeous). 10/10 bar/club.", "author": "Kyler K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "A group of 15 of us came here for a friends Bday party on a Saturday night. We gloriously took over the James Polk Room in the back of the bottom floor, where our lovely bartender, Yana, showed us her amazing bartending skills. \n\nShe makes the best bullet bourbon Manhattans and made my friend a really nice tequila old fashion, which I had for the first time. Exceptional. The lighting was dim and the music was chill, so it was a perfect environment for catching up with friends before beast mode. \n\nCome beast mode, we went upstairs and basically took over again, slowly forming our little dance circle that everyone eventually hates but wants to join. We couldn't help it, the DJ was on point with his mainstream/house playlist. Even I got down, and I usually don't get down because I'd rather eat Hot Cheetos.\n\nYou never know what to expect on Polk street in terms of quality women, but at Playland you can always expect to find cute and classy chicks that love to dance. I would attribute this to great DJ's, the quality drinks, the cover they charge men, and the seats they make available to people who don't care for VIP tables. \n\nAt the end of the night, we waited outside and gathered up all the wounded members and even the bouncers were chill and polite. This was impressive because if you've ever been to Ruby Sky, you'd agree with me then buy me a drink.  \n\nPlayland is a great spot if you are with a group and want solid cocktails at an affordable price in a sexy club scene. Otherwise you can go to Ruby Sky and get crappy cocktails at a ridiculous price and be overwhelmed by dudes and stuck up bouncers. \n\nI also recommend Topsy's bar on Kearny street which is under the same ownership.", "author": "Jesse W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "Good times over here! Tasty drinks, great service  big difference from day and night.", "author": "Beto Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-09", "description": "My friends and I came here Friday night because we wanted to go out somewhere near where we were staying. As soon as we got there, there was a long line, but it only took about 10 minutes to get in. When we did get in, there was another long line to just get upstairs, which we later found out was to the dance floor. We got drinks at the downstairs bar and then decided to go upstairs to see why there was a line for it. When we got up there, it was very packed. Oh... I forgot to add, it is disgustingly hot in there... The bar as a whole is very college-like, we're not really into this kind of bar, so can't say we enjoyed it, but if you're into that kind of scene, this is the bar for you!", "author": "Steven P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Not only is Cameron the cutest bartender at Playland, he's also the most capable. He created the house special, SF Sunset, with ease. He also was able create a delicious specialty cocktail on the spot. He provided the best customer service to us and all the patrons around us. I will surely come back for the great service.", "author": "Lori C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "Was in town for Bay to Breakers and ended up coming to this location after desperately looking for somewhere to party on a Sunday Night. \nArrived to bar around 10-ish and the place was soo dead, it was discouraging, but my group was in a mood to dance so we stayed and found our way upstairs. \nIt was SALSA night on Sunday and lemme tell you I danced the entire time! Dance floor was SUPER empty when we first got there, but as the bouncers advised around 11-1130 things began to get crackin!\nMusic was really good, well ventilated upstairs so even though it was crowded and I know I was dancing up a storm, I still looked presentable (even thou I was hella sweaty).\nThe only down fall would be drinks...a bit pricy considering the size. The bartender working that Sunday was super cute (  he owes me a dance btw HOLLA!) and hooked it up with a round, (must of been our groups awesome washing-machine spins).\nThe guys there were like vultures, but some had some serious dance moves. \nOverall had a GREAT time! People were relatively nice, easy to dance with, Bounce staff was super cool, and the music was great! If I ever go back to San Fran, will definitely go back to this place!", "author": "Kenia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "Playland has good music! And it was our first time here and our bartender Ali is the best! He took care of us and has a specialty cocktail it's amazing! Ask for it and he will whip it up for you. (; #teamali", "author": "Joanne C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-07", "description": "Playland was fun but just an FYI for anyone who plans on going  and any managers/owners.\n\nThe guys at the front door will try to short you your change for the cover charge. For attendees, count your change and call them out. Managers/owners, you should start counting the money you're receiving from the door charge -- you might not be getting all that you're due.\n\nSpecifically, the tall guy on Friday night (5/6/16) around 11pm.", "author": "J D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-03", "description": "This place is ridiculously crowded.  It is probably the biggest dancing bar on Polk St, but at the cost of cover and not being able to move.  First off, there is cover of $5 after a certain time (I believe somewhere between 10-11pm).  Don't forget this is for a bar/small dance floor.  The downstairs portion is not very big and can probably fit 50 people.  You usually have to wait in line to go upstairs, which could be a 1 or 5 minute wait.  Once you finally get upstairs, it's jam packed with people.  There is a 2nd bar upstairs and if you make your way to the dance floor, it will be very hard to move in there.  \n\nNot my favorite location when coming to Polk, but I will come here on occasions.", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "Worked with the manager, Reuben, to plan my 30th birthday party on the 2nd floor of the bar and the experience was great. The space was perfect for our event -- plenty of room to dance, great DJ, central location on Polk, and a dedicated bar. We did a 7-10pm buyout on a Saturday night and continued with bottle service afterwards; worked out really well. They let us bring in outside food, cupcakes and a few decorations which people loved. Generally, I'd highly recommend buying-out this space for a group of 50-60.", "author": "Carolyn B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-12", "description": "3.5 stars. This bar has multiple personalities - downstairs is a pretty small bar area with theme-parked themed drinks (think: cotton candy and other major sweetness). Upstairs is more clubby with a dance floor area, louder DJ, main bar area, and smaller cash-only bar near the dance floor.\n\nWe were here on a Friday night and cover was $5 for guys to get upstairs but free for the ladies. The crowd upstairs was dressed a bit clubbier than what I've usually seen on Polk (except for maybe at Mayes). The drinks were alright and they were able to transfer tabs between downstairs and upstairs (which I actually thought they might not be able to do). However, it took way too long to order drinks at the upstairs bar and, when their printer wasn't working, they just scrawled a random-looking amount on a blank piece of paper and had me sign it as my receipt. Hopefully things here are usually in better working order.", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Fun spot. Bartenders are super nice.  I had an old-fashioned drink which tasted delicious. One of the best I had in a while.  Worth checking out.", "author": "Nicholas R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "This place is cool because there's a normal bar downstairs and the upstairs has another bar and an area to dance. It can get pretty crowded on Fridays and Saturdays but they have good drinks and an upbeat vibe. The people working there are also very fun and helpful. I was actually in there last night and there was a really awesome bartender (I think her name was Olga) working the bar upstairs. She was super nice and made the extra effort to make sure everyone got their drinks in an orderly manner while keeping us entertained. I would definitely recommend this place to friends who want a lively night out in SF!", "author": "Kenan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-05", "description": "Came here on a weekend night with my friends. \n\nCoat check girl was sick which sucked because we had to carry our coats around. \n( We ended up just putting all our coats in a pile upstairs and no one touched them )\nThey have a bar upstairs and downstairs and plenty of seating everywhere. \n\nUpstairs has a dance floor and the most fantastic ac vent ever.  I literally just stood under it half the time I was there because it was so hot everywhere else. \nThe dj played a great mix of music ( hip hop, mashups, a little old school, edm , etc) \n\nDrinks are decently priced $10 for long island, $7 for a g&t. \nThe bartenders were great !!!! They dealed with the crowd so well ( it was nye ) and we were \nThe crowd was a great mix of 20s - 30s. \nThere is usually no cover but apparently, they sometimes charge a small cover for \nguys to go upstairs. \n\nDrinks are pretty strong :) great place to go to dance or even to start our your night.", "author": "Tiffany Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-02", "description": "BEST. SPOT. EVER. \n\nWhy, you may ask, why do I love this place so? Simple!!!\n\n1) FABULOUS MUSIC: I was dancing to Kanye West one minute to Deadmau5 the next! \n\n2) EASY TO GET IN: There's a bar downstairs, and then an upstairs level which is a simple staircase away. Get here early to avoid having a headache getting in! \n\n3) VENTILATION: No really. There are windows open on the top level, and air conditioning is blasting. I think this might be the most underrated aspect of this place! You can actually breathe while dancing! \n\n4) BARTENDERS: They spot you, they serve you! \n\n\n\nHaving my birthday party here so I will be leaving an updated review post event! :)", "author": "Raji R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-07", "description": "Here's the Story:\nI came here with a few friends for a meetup.com event and it was a social gathering.  The place is pretty spacious.  2 floors with a bar on each.  I'd say that it can fit about 200+ people total.  I can't speak to the alcohol, but the decor and ambiance was nice.  The dim lights made for a more classic and old feel to it.  I would come back next time as I'm sure it turns into a club or lounge setup on the weekends at night.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "I've been here a few times in the past few months (just to the bar--not to the club upstairs) and consistently enjoyed it. It is neither so trendy that it veers into d-bag hipster excess, nor is it a gimmicky tourist orgy like McTeague's down the street.\n\nThe bartenders (especially Yuliya) have all been perfect pros and the cocktails I've tried have been superb, and most of the other patrons have been agreeable and worth talking to. It doesn't draw too much of any one crowd to become tedious.", "author": "Nick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "Shout out to Ariel, dope bartender! Couldn't have a cooler bartender who talked to us and didn't just care about making drinks! Need more bartenders like her!", "author": "Carlos P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-03", "description": "Probably the worst lounge I've been to, granted I went on a Saturday night. $10 cover to go inside to possibly the most crowded dance floor I've ever seen. The sheer density of people... I was being puppeteered by the mass of bodies around me. Plus, the drinks were more expensive than they're worth. Lastly, the music wasn't even good.", "author": "Ruobin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-15", "description": "Mezcal lover. All day. Good music and service. Nice space for a small group.", "author": "Jonathan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-16", "description": "I finally had the opportunity to visit Playland last night.  I must say that this is very good place to go to on the weekends.  It doesn't get crowd like Maye's.  The staff are pretty cool and I like the fact that it's a 2 story building.  You can dance on the 2nd floor or just chill and relax on the 1st.\n\nI look forward to my next visit to Playland.  :-)", "author": "Alex W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-08", "description": "San Francisco is seldom over 70 degrees. When it is though? \nBUST OUT THE HOOCHIE CLOTHES. \n\nBeach apparel: shorts so short they're practically coochie cutters with butt cleavage hanging out, bikini top with a sheer blouse tossed over it.. Oh, I still have walk of shame hair from being a hot drunken mess last night? Toss on a Fedora hat. \n\nI headed off to the beach to get down to my skivvies and roast for a bit. I'm probably the tannest Chinese girl I know. I don't mean that spray tan fake bake shit either. \nDamn. I have to get going to GNO. No time to go home and change into slut gear for clubbing/bars/lounges. \n\n*shrugs* Susy Effing C doesn't give a eff!! \n\n\"No 5a5 or Jones for you. You ain't gettin in anywhere dressed like that!\"\n\nPshhh watch me. No dress code fosho! \n\nPlayland. No dress code. No cover. Room to dance. No cute guys.\n\nJust a token Asian girl dressed as a hipster beach bum...at least it didn't smell like poop inside like at Mcteagues.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "If you're looking for a night of bar dancing with a fun crowd of guys and girls, this is your spot!\n\nCame here on a Saturday night with a group of guy friends and had a blast. The night started off slow in the James Polk Room in the back of the ground floor, where we were treated to great drinks by the awesome bartenders. Then the action moved upstairs, where we danced till late. There were a couple of rude assholes (as is to be expected at a spot like this in SF), but for the most part, crowd was fun and gentle(wo)manly. \n\nAlso could see myself come here for a chill drink or two earlier in the night.", "author": "Balu C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-05", "description": "Steadily becoming one of my favorite go-to bars in the city both on weeknights and weekends.\n\nEnjoyed the crowded bar downstairs, the dance floor upstairs, and it's an excellent venue to rent out for a big party. No question, that was the best (thank you to the Flight Crew).  Good location and just a touch classier than the usual Polk spots which seems to draw higher caliber men and women.\n\nTwo Tips:\n\n(1) Just order regular mixed drinks. This isn't Rickhouse, Comstock, B&B, etc. They make strong but solid drinks, but they are usually packed. Ordering something that requires \"muddling\" might get you junk punched. (it's still Polk Street you know) :-)\n\n(2) Do not expect to make it to the bathroom. or even know that there is a huge line for the bathroom. Just go next door.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-30", "description": "STAY AWAY FROM HERE. I have had my cell phone stollen from out of my purse - while wearing it cross body! - on TWO separate occasions within this past year!!!!! \nOn both occasions, I had only been at the bar for about 45 minutes before it was stollen. (I was not drunk. I am very aware of my surroundings and overly cautious). \n\nFirst time... Ok, maybe it was bad luck. Second time... Something seems very sketchy. Especially when none of the employees or managers were surprised. I have only been to this bar 3 times- and I will never go back again! \n\nThe guards and manager did nothing to help at the time of the incident and were very nonchalant during the entire situation. The manager said \"Oh, yeah you are the 4th person so far tonight that has complained about a stollen phone...\" (It was only 10:30 at night and they already had 4 stollen phones...)\n\nI wish I could leave zero stars.", "author": "Evelyn S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-06", "description": "I almost gave this place 2 stars, but I decided to be nice. Only because I did end up meeting some pretty awesome, hilarious and entertaining people here the night we came here. BUT I will say that those people we magically found were in the minority since most people in this bar I definitely a) do not think wanted to be there since they still kept all of their jackets and scarves on and such; b) looked so uncomfortable with super closed bodies and just looking awkward; and c) they were definitely on the younger side overall. So would I come back here? probably not. \n\nBUT beers are $5 which is decent for SF and mixed drinks are $7 and they are decently strong. All female bartenders though, so you can tell who this place caters to ha ha  The other annoying thing was the bathroom was downstairs away from the music upstairs and you have to go through security sort of again too when you want to go back upstairs, and if you are a woman and pee as much as I do, you know how much that can suck. Oh and they have a crazy artic chill wind AC system. The second that bad boy turns on, it is like Playland is trying to film a music video or something since it is so incredibly strong and blows everyone's hair all around. So intense! There is really no need for that. \n\nLastly, no clue why this place is called playland other than the one creepy clown face that serves as a decoration on the bar. That is just scary.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "Playland is a great bar. The crowd is always good and there is an upstairs with another bar and dancing. Playland has a good. Playland is located in the heart of the Polk nightlife too. The bar tenders and staff are also great.", "author": "Brendan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "Great spot to grab an early midweek drink. Weekends get crowded, but understandable due to the cross section / Polk and Pine", "author": "Reza O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "While the cat's away, the mouse will PLAY at the newest HOTSPOT in sNob Hill: Playland! \n\nPLAY at the bar.\n\nPLAY with the cute and friendly suspender-wearing bartenders.\n\nPLAY with the DJ.\n\nPLAY on the dance floor. \n\nPLAY with the boys; all 31 flavors of them. Ummm, did I say boys? I meant girls. =X\n\nPLAYing has never been so fun!\n\nShhhh, please don't tell Mr. NSS though. He was asleep while I was at PLAY.\n\nYes, I'm a bad, bad girl.\n\nP.S. - One of these days, I swear my reviews will get me in trouble. \n\nOTHER NOTES: \n*No cover.\n*No dress-code.\n*Crackin' on a Saturday night. \n*Mixed crowd in their 20s-30s with mainly the Marina I Felta Thi frat boys (we were the token Asian girls).\n*Bar meets lounge meets small club with 2 levels, 2 bars, flat screen TVs (ehh ESPN playing?!?!?), retro burgundy leather couches, and a ventilated dance floor on the second level. \n*DJ spinning Top 40s & Dance music: Rihanna's \"Where Have You Been\", JLo's \"Dance Again\", Nicki Minaj's \"Starships\", Usher's \"Scream\", Havana Brown's \"We Run the Night\", David Guetta's \"Titanium\", and etc.\n*CHEAP DRINKS: $7-8/shot for top shelf liquor (we got two DOUBLE shots of Goose for $30).\n*$20 minimum for credit cards. \n*Long line for the restroom; just one stall for each sex (BOO!) \n*Parking sucks. No nearby parking lot. Cab it.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "Came to watch Game 6 of the World Series here! Great bar area, open space - great for groups, fast service, GREAT prices and the alcohol selection was on key! \n\nOnly reason the place gets 4 instead of 5 stars - THEY DON'T SERVE FOOD during the week, at least they didn't when I went to watch the game there. I had to go across the street to snag a slice of Pizza.", "author": "Amy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "Thursday night was good for our group since it was our first night together. I think we showed up around 10PM and expected to be at Playland for a little and bounce around Polk St but we ended up staying all night! The bar upstairs is usually packed but they move pretty quick.\n\nThere is a downstairs which feels more like a lounge and then an upstairs which is more like a club with some pretty great throwback music videos that play but it is pretty typical with sticky counters and dim lighting. We stayed upstairs in their \"VIP\" area since we were a large group and no one was there so we just danced around by ourselves until the place filled up which is did by about 11:30! Then we got our fair share of groups that wanted to congratulate the bride (since we were wearing bridesmaid headbands) and leave some single guys with us which isn't really my idea of a good time but they were definitely good sports. Somehow the DJ caught on that our group was from Miami and a lot of Pitbull and Enrique got played.....\n\nOverall, it was pretty great for us. We danced the night away and had plenty of drinks and was a better experience than I have had there in the past. Wish the line for the bathroom would go a little faster but that is my only gripe!", "author": "Irene S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-30", "description": "Grimy and sketchy with lots of interesting characters, but definitely fun. This is basically a club but not too clubby aka no need to get dressed up or anything, just a nice place to jump around after you've barhopped. I'd recommend ending the night here as my friends and I did and it was so much fun. They play some top 40 as well as old school hip hop/R&B with a good dose of Justin Timberlake. My kind of place.\n\nBe warned that upstairs (where you dance) gets pretty packed and it's not that easy to get a drink.", "author": "Lulu P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "I'd been meaning to check out this bar for the longest time and I'm glad I finally did this past weekend. The music was a nice mix of hip-hop, EDM and a few of the latest pop hits. The DJ did a great job of transitioning from track to track and the music was oh so danceable! The other awesome part was that ladies got in free on a Saturday night! And before I forget, there was a midnight special for $5 fireball shots. What's not to love?\n\nThe only downside is that the upstairs dance floor gets packed so it's hard to move around. But it was obvious everyone was having a good time. Definitely recommend this place if you're looking for a place to go dancing with your girlfriends.", "author": "Preethi S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-31", "description": "If you're looking for your basic clubby Saturday night experience this place is worth a shot. It has two levels, with the upstairs hosting a cramped dance floor playing modern pop hits. \n\nI showed up around 9:45, which is absurdly early apparently because I was greeted with a nearly empty club. All the bartenders upstairs were eager to take my drink order, and my friend and I sat at a table for about twenty minutes commenting on the lack of people, debating about whether or not we should leave and try another spot, and getting distracted by the big screen televisions playing music videos. \n\nWe eventually started talking to someone in our vicinity and the place suddenly filled to the brim with people. It was like a torrential flood of people came through the doors ready to down shots of Fireball and grind on random people on the dance floor. I decided to attempt to dance with my friend, but it was so packed we could barely move, and guys came at us from every angle trying to ask us questions which we couldn't hear over the excessively loud tunes. We decided to venture downstairs, which was significantly less packed but had a completely different vibe. We went back upstairs and decided to get another drink, which was shockingly easy and quick given there is only one bar upstairs and the place was packed. The bartenders actually remembered us, which I appreciated. Not the best experience but certainly not a bad night.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-18", "description": "Super fun! Been there both on weekends and weeknights. Divey-ish lax bar on the weeknights where it's not too loud to talk and not too crowded to find a seat at the bar, fun dance party on the weekends with strong drinks to enhance the night.\n\nIt's not a lounge. It's not a club. As long as your expectations are set right, this place is definitely high energy fun with low-key nights during the week. Drinks are delicious and rather creative for just another pac heights bar.", "author": "Alice Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-08", "description": "Walked in to have a drink with a friend on a Sunday afternoon. Female bartender asked for my ID, no problem. Asked for another ID and I tell her I don't have one. I mean, why of course should she need another one. Had to go through my Facebook to get her to leave me alone. Suffice it to say, I didn't order another drink.", "author": "Kaz K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-14", "description": "PLAYtime!\n\nPolk street has a wide selection of bars but I always enjoy coming here. The bar is located near the north section of polk street. \n\nThe bar has two levels and a back area that has a more speakeasy feel to it. The drinks are also great. Well crafted cocktails for polk street. \n\nThe upstairs is basically a dance floor where the play top hits, hip hop, and electronic music. I enjoy the crowd here and it caters to a good mix of age groups from early 20's to early 30's. \n\nThere's also three bar areas so it's quite easy to get a drink. Bartenders are also friendly.\n\nOverall the place is definitely worth checking out when your in polk next time.", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-10", "description": "I was impressed with the music selection but the place was tiny.  It would have been nice if they opened up the upstairs earlier in the night as we had to wait until 9:00 before being able to dance.", "author": "Allison A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "Small, clean, friendly staff, decent prices. Stopped in while walking by. Will seek out again when in the area.", "author": "Daniel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-14", "description": "Place was PACKED!! Just moved to San Francisco and this was my first time going out. The DJ was JAMMIN and the crowd was good. The bartenders were fast and attentive. I enjoyed the dance floor and music. Barely room to dance but it's ok because you're there for a good time with friends anyway.", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-26", "description": "I'm a fan of how lay back Playland is on a Sunday afternoon. Came here after Halloween costume shopping with a friend, Jasmin took care of us with just the right amount of attention. There are few TVs at the bar too, so there were people catching the game. Totally the best place to chill and rest after shopping.\n\nWeekend nights, however, are the polar opposite. The downstair bar is manageable, but there will be people jumping all over the 2nd floor... Hm, I'll stick with the afternoon crowd, thanks.", "author": "Lois W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-09", "description": "Friend dragged me in bc she used to work here.  Almost tripped on a pile of peasants.  Never again.", "author": "Anna D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-30", "description": "Are you looking for a bar with Jagermeister on tap? Well say hello to Playland. \n\nCame here for a beer run and I must commend the staff for being very accommodating to 20 or so runners flooding the bar at the same time; ordering waters with their beers. The bar is comfortable and definitely looks spiffier than Kimos before but at the same time, it also feels a little sterile in comparison. At least it's clean. \n\nNice selection of beers on tap, friendly bartenders, and ummm nice hardwood floors - one more watering hole to consider as you crawl up and down Polk Street.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "This review is for the reservable back room and bottle service. I reserved the back lounge on the first floor for my birthday night. It was very affordable - we had bottle service - and the area is very spacious and can sit about 10 to 15 people. \n\nThe customer service was exceptional. The manager was very friendly and answered all of my questions beforehand. They even checked up on us several times to make sure we were not running low on alcohol :) The best part of reserving the back space is that you have the option to use the beer pong table, so we had a lot of fun with that. I even received contact from the manager the day after my night out at Playland to make sure I had a good time! I highly recommend this back space for anyone who wants to reserve the space.\n\nThe rest of the bar and dance floor is insanely packed since it has gotten increasingly popular lately. I am not into rubbing shoulders with everyone and standing in line just to get to the dance floor, but we were able to get wrist bands to bypass the line because of the room we reserved, which was nice.", "author": "Corabel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-19", "description": "I always have fun partying on Polk St but last Friday was my first time at Playland. \n\nFUN. FUN. FUN\n\nPro:\nno cover\nsuper casual (my bff went in with a giants hat)\ncheap drinks\nthree bars (one downstairs & 2 upstairs)\nhuge dance floor upstairs\n\nCon:\nToo much guys\nkinda crowded but okay\n\nDefinitely had fun last weekend and wouldn't mind going back there again. I think its even better than Vertigo since the dance floor is much BIGGER!", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "Drinks? Yes. \nBartender? Awesome. \nAesthetic? Great. \nBoard game selection? Fun. \n\nDefinitely going to be back.", "author": "Marissa H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-07", "description": "Most incompetent bouncers I've ever seen in my LIFE. My friend had a computer bag, the bouncer called him gay, and wouldn't let him in with his fiancé. \n\nI mean, if you're bald and in you're mid40s (and eating M&Ms .... FYL), and this is what you have as a career, I guess that's cool. Slash, you're a bouncer. \n\nStop the real jerks on Polk street - not the professionals who keep your sorry ass bar alive.", "author": "Taylor L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-06", "description": "I am a bit new to the SF night scene, but I am still confused why a bar has a cover. I thought it was rather annoying to wait in line and pay a cover to get inside the bar. Seems to defeat the point of a bar. But I came here at 12:30am on a Friday night and the place was packed! I can't say that it has cool decor or anything too exciting, nor is the music too amazing. However, the bartender we had was awesome!!! She recommended a mint-cucumber-vodka and it hit the spot. I loved it. I don't know the girls name, but I'll post a photo of her, so if you find her, she is great!", "author": "Nikita K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "Such a fun place to go to! I had my friends meet me here for my birthday and we had a blast. Great music, great environment!", "author": "Daniella G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "Went here last night for the first time. Cool vibe. Downstairs was more of a lounge type settings and the upstairs is more of a night club. You get the best of both worlds. Bartenders seemed kinda clueless at times, but it was real busy. The bouncers were cool. Major props to them. Some jerk grabbed my ass and one of the bouncers was quick to grab the guy and kick him out. He even checked up on me later to see if everything was alright. It's a safe place. Had a great time. Definitely will come back. \n\nI would give it 5 stars, but it gets too crowded and steaming hot.", "author": "Camille Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-29", "description": "Thank you Taylor L. I was the \"man with the bag\" she referenced in her review. \nI will never go back here. The bouncer was completely sexist and intimidated by me because I was carrying a small computer bag after coming directly from work. I opened my bag and offered to have them check the contents, but they refused. I was told I was not allowed inside because I was \"a man with a bag\". I recommend any other men who work for a living avoid this bar until the management replace the door staff with more competent and accepting of others in this very diverse city of ours.", "author": "Jeremie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "Crowded but pretty good bar + dancing place in the midst of Polk Street.\n\nFour stars for the cover on Saturday night and shutting down at 1 AM.  But as good as you're probably going to get in SF.", "author": "Daniel Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-26", "description": "Went to playland bar a month ago on a friday night and it wasn't a good experience. Everyone at the bar is rude including the people standing outside and letting you in. One of them blamed my friend saying he didn't pay even though he did. Drinks are ok , upstairs section is too crowded, they keep directing you elsewhere. Not worth paying to get in ! Go to other bars in the neighborhood insted.", "author": "Priyanka P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-26", "description": "Maybe it was because it was 1:30am and there were crowds of young people pushing each other around, but I didn't have that great of a time at the Playland Bar. \n\nAmbiance (3 stars): The first floor is a bar where you can order some cocktails and hang out at the bar with some friends. If you go up to the second floor you will find a club like atmosphere with a DJ and about 2-3 bars. We were here on a Friday night and it was PACKED with people. People pouring drinks, laughing, jumping, and honestly, really having a great time. I was able to meet up with my friends and had a couple of shots with my boyfriend at the bar. Although I am being shoved left and right, I tried to enjoy the scenery and environment. A couple of strangers came up and tried to strike up a conversation, I played along to do the same.\n\n5 minutes into being on the second floor, my friend finds that her iphone has been stolen. After searching the floors we find out that another girl has had her phone stolen out of her purse. This place was so packed that there was nothing that we could do to find the phones again. Someone had obviously been going around nabbing phones from girls purpose. Not cool. \n\nI am not blaming the business itself for losing the phone, there was little that they could do. The place was so packed though that there was little space to move around. The place felt very much above capacity and it made it difficult even for people to stand around. \n\nThe employees could do little about it and then they started to move us out to the street. The bouncer moved us across the street by the end of the night. We were sober, one of us phoneless, and had been pushed around way too many times. \n\nJust a note: come here to drink. Protect your stuff. Bring a clutch with a zipper.", "author": "Ivy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "A perfect place to end a weekend in San Francisco! A friend and I enjoyed their special (A craft beer + shot of Jameson for $10) while watching football and everything about this bar left a perfect first impression. The music was good and at a perfect volume. The service received was fast and friendly enough to give us out of towners tips on places to go and things to see. The location itself is great as there are many surrounding restaurants and places to eat if you don't want bar food. I only have good things to say and without a doubt I'll be paying them another visit whenever I'm back in the area.", "author": "Denise V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-05", "description": "Free for women, $5 cover for men.\nWith a door charge like that, you can bet this place usually gets packed full of girls looking to have a good time, and men eager to make sure they get it. Wink, wink, nudge, nudge.\n\nI love Playland. It's sort of like a less rapey DNA Lounge. The dance floor usually gets pretty packed, the two different levels allow for varying experiences of drinking (more loungey downstairs, more party-hard upstairs), and the clientele are usually of the classier variety (though I suppose everyone looks the same when you're too hammered to notice or care).\n\nThis is one of my group of friends' go to spots over the weekend. There's always tons of new people to meet, I always seem to run into friends, and we always have a great time here. I like having the option to either lounge on one of the chairs by the windows, or to knock back a few drinks and dance like crazy with my buddies and girlfriends.\n\nIf you're looking for a place to meet cool people, there are *definitely* a few cute guys here. It gets pretty packed, but who says that's a bad thing, right?", "author": "Sherilynn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "Great mix of music. Love that they play house pretty regularly. Not too many creepers. Drinks aren't that expensive. Favorite place of Polk.\n\nUpstairs dance floor is pretty bomb.", "author": "Bianca D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-29", "description": "I came here with some friends on a Saturday Night. We were recommended Polk Street bars by some locals and we weren't disappointed.\n\nParking was all street and took a while but we managed to park a block away.  \n\nThe bottom bar was very laid back and not too busy.  The top bar and dance floor area was way more packed.  The music was fun and a mix of EDM/pop mash ups & hip hop.  The dance floor was really small but the air conditioning eased the discomfort of being squished around in the crowd.  There's lots of places to sit all around - AWESOME.  The crowd was a mix of young 20-30's.  Drinks weren't very strong though but it was still fun enough where that didn't matter! \n\nI would definitely return.", "author": "Tam N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-10", "description": "3.5 Stars\n\nThis place is a fun place to be on a thursday night or through out the weekend. It has two floors; first floor is strictly a bar, while 2nd floor has a dance floor + live DJ and another bar! \n\nFortunatly, I was early and the bar was not too crowded, so I did not have to pay for a cover charge... but 15 minutes after I got there, boom! Groups of people started showing up and the dance floor filled up! The DJ plays popular EDM songs or club remixes of top 40 songs... nothing too special about that. But hey, it music you can dance to so that is always good!\nThe club has its own photographer that walks around and ask groups for pictures! So if you go one night, your face might show up on their website!\n\nTheir bar is nice too; however, shots are a bit pricy. I was charged $7 for a mixed drink (woohoo! cheap!) but also $7 for just a shot of whiskey?? Oh well. Their bartenders will get to you pretty quick and they are super nice. However, when I gave them my credit card to pay for my drink, I expected them to give it back... but they just opened a tab without asking. Good thing I asked for it back after order number two because I would not have remembered about it as the night progressed. That being said, a lot of my friends forgot their credit cards there (but we called them the next day and they told us we can pick the cards up).\n\nLastly... this place closes at 1am! Definitely too early for a bar in SF...", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-04", "description": "Went there for dancing, not impressed. Bar downstairs was cool, old-fashioned and everything hardwood, barista was really cool. Upstairs the space was too small for dancing and squeezed between two walls of couches, felt kind of awkward dancing with people sitting there looking at me. Music was way too loud, there was karaoke which I didn't stick around to hear. Left at around 10:30 bc not impressed.", "author": "Anon Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-27", "description": "This place is so crowded on the weekend. It has good music but is too small upstairs where the dance floor is. You can't even get through without pushing everyone to the ground seriously. I wouldn't go back to this bar that often since is so hard to even get out or even go in.", "author": "Marian P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-02", "description": "This place is located right on Polk Street and is good for a night of dancing to theTop 40s and staples of the past couple decades.  The first floor is a pretty chill bar, and the second floor is crowded with DJ, dancing, and more drinks.  The drinks are affordable but taste watered down.  The top floor gets pretty gross by the end of the night, and the place had lights on and kicked us out before 1:30am on Halloween night!  Not cool.\n\nOverall, decent place for standard drinks and dancing.", "author": "Carrie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "Playland is one of my favorite bars to go to with friends! The dancing and music are awesome, and I have met some really great people there. The service is also fantastic, which is always a plus. One of the bartenders, Ariel, was so sweet and we had a great conversation about our experiences in Ireland and here in San Francisco! She also told me they had Guinness which I then ordered immediately, and it was amazing! Definitely a great bar, and I would recommend it to anyone.", "author": "Katy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-17", "description": "Well for starters it says I have multiple check ins here yet I can only remember coming here last night. I'd say that Playland is part of a good night.\n\nFrom what I remember of last night, this place was calm downstairs and bumping upstairs. Granted this place is a bit small and narrow, it does have a bar on both floors. The bartender downstairs is a super chill Russian lady. I mean she's SUPER chill, my friends were belligerent last night. Pretty sure one of my friends would call her \"my Love.\" For HOURS this poor bartender has this scrawny asian with his slick hair ordering Jameson shots and calling her a variety of flirtatious names.\n\nThe drinks here were good. The shots were strong (didn't feel like they were watered down or anything), and their mixed drinks here are BOMB. The Russian Bear was practically an alcoholic key lime pie in liquid form. THAT SHIT CRAY! \n\nAlright, I'm calm now...\n\nTo sum it all up, I came here with a group of 10. Spent countless dollars on shots and thoroughly enjoyed the night. Saw multiple friends black out thanks to the heavy pouring of Ina the Russian bartender.\n\n\nI will say that the bathroom was filthy. I can't blame the establishment, it was the people who happened to be here that night. Some girl trashed the bathroom by leaving their monthly wiping on the top of the toilet.... Like seriously... WHAT THE F#@K. That's just filthy. Vulgar. Offensive. Down right wrong. I don't care how drunk you are, who does that. Shameful.", "author": "Karma B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-15", "description": "The DJ played really good music last night and we got bottle service pretty fast. My complaint is when the upstairs venue got packed, it got super muggy and hot. Combined with the muggy atmosphere and no ventilation whats so ever plus the smell of BO, cigarettes and weed- ew. It was so hard to stay the whole time.  They need to open a window or have some sort of air flow.  Also, we had VIP but random people kept coming into our space which was a nuisance to keep telling them to leave.  The bathrooms were located on the bottom level & two different bouncers kept telling us different spots to stand for the bathroom. It was a bit of an hassle to get access to the bathrooms.", "author": "Robin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "I recently moved to SF and wanted to find a good local spot.  A friend of mine told me about Polk St. and somehow we ended up at Playland Bar.  It's a nice venue with a nice bar up front, a cool lounge on the first level, and a functional dance floor on the second level.", "author": "James H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "This is one of my favorite bars on Polk St for sure! I always come here first when bar hopping on Polk St. The drinks are priced well, the bartenders are nice and don't make you feel like they are about to have an anxiety attack if I don't order my drink faster, and also the music is pretty nice here Thurs-sat. One thing that sucks about this place is if you come after a certain hour they charge $5 cover at the door whether you are a female or not and also after you pay cover and go inside its like sardines in a can. But if you are partying in the Polk area I would definitely stop by and try this place out!", "author": "G O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-30", "description": "NOT BAG FRIENDLY!!!!! I repeat, NOT BAG FRIENDLY!!!! I came here last Friday evening to enjoy some COCKtails while dancing my face off! PS (they were filming the Real World that night) eeeeekkkkk!! So I walk up to the front with my friend Stevie B and his roommate (she asked to stay anonymous) looking fly as could be, but were turned away. The bouncer looks at my brand new Versace Bag and says,\" sorry buddy, but we don't allow bags.\" Side note, this bag carries everything for me from my wallet to my female condoms. This place is trash! The only people that go to Playland are chubby 25 year olds grabbing a drink after sitting in their cubicle for 8 hours. Needless to say, I will not be returning! Unless they change to becoming a BAG FRIENDLY BAR! \n\nSincerely, \nDick Johnson (ASAP Fam)", "author": "Richard J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-24", "description": "Went here on a Saturday at around 9:30-10pm. Free Cover(for me...not sure for guys). Downstairs is more chill than upstairs. Upstairs there's a dance floor with a pretty good DJ. The drinks were kinda small and weak(which is why this isn't 5 stars) but you can get a head buzz if you stay long enough. But all in all, this is a great place to START your night. It doesn't get crowded until about 11pm. The bouncers were really nice to me, but they were a little more strict with the guys. No harm to anyone tho :) \n\nI'd definitely come back. :)", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "This place is so much fun! Everyone in their 20's, super packed on weekends. It's a little on the small side, but there's an upstairs too, which helps a lot. There is only one bathroom for each gender, so you'll probably have to wait. The inside actually looks pretty nice with lots of neon lights everywhere.\n\nThe downstairs is more chill/loungey, while the upstairs has a dance floor. Both floors have their own bars. Some chairs/tables on both floors, but they are usually taken. The upstairs plays lots of EDM and Top 40 remixes.\n\nThe drinks are about $7, but a little small/weak, and beers are $5. No cover for girls, $5 cover for guys.", "author": "Cynthia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "I think I may have found my new go-to bar with a legitimate dance floor. Unlike many SF clubs, there are places to sit and chat, and unlike most SF bars, there is a big ol' bass-bumpin' dance-floor worthy of booty shaking. Get on your comfy cute clothes and head on over on a Saturday!\n\nPROS:\n- Top floor is mellow bar area/ top is the more fun dance floor\n- Flat screens ft. music video of the song playing \n- 4 bar areas, wait for drinks isn't terribly long\n- Groovy mix of 20-somethings, visiting from other countries or local\n\nCONS:\n- Drinks are somewhat weak", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "So happy playland has reopened. I didn't realize how much I had taken it for granted until I couldn't go there for a month. I love the fact that you can dance all night upstairs or choose just to post out and mingle downstairs. The employees are professional and the atmosphere is fun but not pretentious. The drinks are served up in a reasonable amount of time, even at peak hour. Finally, the remodel is great. It has always been a classy environment, but they really took it to the next level.", "author": "Yali C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-04", "description": "Busted by the ABC for employee drug dealing, and trying to pass it off as \"closed for remodeling\". Not a good look.\n\nhttp://sf.eater.com/2015/2/4/7982001/playland-bar-san-francisco-closed-suspended-cocaine-drugs", "author": "Boogee Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-17", "description": "It seems every pub crawl in town requires a stop through this top of Polk Gulch hotspot, so when St. Patrick's Day/Night (who can be certain?) came around, my crew and I clocked some hours on the dance floor. \n\nI was impressed with how well they handled crowd control by limiting access between the floors. Neither one seemed overcrowded (other than at the main bar on the second floor, but there's barely any room to walk there as it is) despite the Lepre-Con going on, and the DJ spun some remixed pop melodies. \n\nI could see this being a Saturday night go-to spot when I'm in the Gulch. If you haven't been yet, give it a whirl!", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "Tried play land bar after my friend recommended it, every body is nice bar tenders and the security. The manager (Ruben) does his work really well and cares about hos customers, the place is two stories the 2nd floor more load for dancing and the 1st floor is good if you wanna geab a drink a cill.", "author": "Ghenwa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-20", "description": "Yet another fantastic night at Playland! Downstairs was chill, upstairs was POPPIN, and dranks were flowin.\n\nHarry, you da best!!", "author": "Josie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "Classy style. Small front bar. Dance/lounge area. Poppy and dance music mostly.\n\nVariety of high quality liquors and beers from around the world, but limited taps and liquor bar. Liquors on tap. Also really cheap happy hour deals. Beautiful tenders. \n\nUnique place with a little of everything. Fancier crowd for lower nob. They have hammered copper and black ostrich themed interior. 3 tables 12 tall chairs, 10 bar stools, up front. Black leather couch seating around the dance floor.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Loved all the drinks and the place was so much fun.. the music was also bomb!! Went on a Saturday night, so whoever the DJ is then, would highly recommend checking him out.", "author": "Jessica X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-03", "description": "I guess this review will be a bit skewed since I came here on NYE and everything is just ridiculous that day. This place is located on Polk which is cool because you can go bar hopping. I wasnt able to experience it but it was coo. Supposedly on a regular day, girls get in for free and guys would have to pay a bit but that night everyone paid. They jacked up the prices as the night continued so I had to pay $40 to get in which is ridiculous. Happy new year indeed. I do not believe there is a guestlist so just show up and get in line. The crowd is mostly white which is totally different than the asian club scene. What a contrast indeed. What I did like was the music. It is totally different than the Raven I am used to with the old school hip hop and pop. This place played current music like Dont Tell Em and the stuff you would hear on the radio. I have to come back on a regular night and update this review and experience the Polk. There are two floors and the dance floor is quite small but doable. I didnt see any seats where people without a table could chill though. Also, there is no coat check.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-26", "description": "Cover- $5 for guys\nBeer- $5\nShots- $7\nReally watered down drinks- $7\n\nIts small alright place on Polk and it could be chill if it had less people or bigger but for insane prices and no room to move around on a Friday night, you're going to have to be drunk to have a good night.  Bartenders are nice, I actually didn't hate tipping them, but the jack & cokes were weak. Pregame before coming. This small place is cool but its trying to hard to be a club upstairs while keep the bar vibe downstairs. Its okay but if you're going to blow 50 bucks on a night with your friends there are probably better places in SF.", "author": "Jay N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-20", "description": "Came here because a friend's friend was having a birthday and had gotten a table and bottle. If there was no bottle service set up I would NEVER have stepped foot in this place. \n\nDance club/bar for college age kids that don't know any better. \n\nBouncers seem like total d-bags, although I didn't really deal with them since we were on the list. Way too packed. No character. Shitty top 40 music. Horrible gross guys rubbing on drunkin stupid girls. \n\nSo many awesome bars in SF will definitely never come back to this one.", "author": "Lina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-25", "description": "I had lots of fun here! The bartenders were friendly and standard pours were generous and not too overpriced. The music was fun to dance to, playing a good mix of modern with songs from the early 2000s and even 90's. Also a good mix of people, everyone from finance bros, hipsters, foreign visitors and anyone in between. Mostly young, yes, but some older folks too. Bouncers were a little rude.  Boys and girls they do not find attractive will have the cover fee. Decent place.", "author": "Queen B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-09", "description": "I would not recommend this place for ladies. This place is not safe for you! I went there with my girlfriend and we were rush to leave right away because this place is the one of the spots were shady guys go. It was crowded with dudes! And all the sucurity guards are dumb and they themselves have the hungry eyes looking around for drunk girls to take advante of!!!\n\n\nAlso, they were charging $5 from men and women are free, I guess they want more girls because the place is filled with dudes.", "author": "Oscar D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-12", "description": "So, I had to survey Playland a little over time in order to determine how I really felt about it. My first experience- liked the music, appreciated the space, and thought the bartender was awesome. I had a cucumber martini here that is the second best I've ever tasted. When I mentioned to my friend how the numero uno still haunts me, the bartender slid over and topped off my bevvy with a little St. Germain to taste like the best cucumber martini ever made. I thought that was sweet. \n\nThe second and third time I came, however, I was a little put off. Service has slipped. This last visit my friend and I waited quite a while for our drinks to be ordered, and I waited so long that I actually gave up and just sat down with friends to chat. The bartender was texting! And the bar-back was watching! To be fair, it may have been for business, but call me crazy, I love a good multitasking bartender/bar-back team. Then they were out of the beer my friend wanted, then they had no cold bottles of the second beer of request. Blah. \n\nThe third time... I am sorry to say, but men were getting served with far more charm and attention, and while I believe that every bar has to have a shtick, I was put off by the clear play for tips from dudes while the ladies of the bar were treated like children interrupting adult conversation. C'mon, this place isn't run by amateurs, I've seen better service here! \n\nI'm not saying I've crossed them off the list forever, because there is something about that huge Spanish Bull on the wall that makes me dream of Pamplona, but I hope the service improves next time.", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "Do you know what it's like to have your heart broken into a million pieces? Me neither, because Playland provides me the recipe for forgetting everything: drinking, attentive bartenders, and loud music. \n\nDownside: Dude, where's my car?\nUpside: Divas is around the corner. If you're into that stuff, of course. I always love watching the poor souls who don't know what they're getting themselves into.", "author": "Ben T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "Playland bar is one of my favorite bars to visit when I'm on Polk St. It appears small from the outside but when you walk in there are 3 rooms to go into, from the bar in the front, to the lounge in the back, and the dance floor upstairs! What a great atmosphere, plus everyone who works there is just fabulous.", "author": "Brittany P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "I am from the east coast traveling for work. Ali is the bomb bartender tinkering with the mescal drink and they have happy hour all night.  Great selection of tequila and vibes.  Will come back for sure.", "author": "Rodney G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-23", "description": "There's plenty of places on Polk Street to choose for a fun night out. So why should you choose Playland? It's got a dance floor upstairs with some bumping beats. It's got bars on both floors so you can get your alcohol fix pretty easily. Why shouldn't you choose Playland? Cover fee ($5) for what I consider a pretty unimpressive dance floor and a hefty idiot tax of 50%. That's right, if you have a good enough time that you end up forgetting to pick up your credit card, they charge you a 50% \"tip\". Definitely not a place to end the night.", "author": "Philip W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-17", "description": "01.10.13 || bookmarked 07.08.12\n\nSplit level.  Upstairs is the lounge, sometimes with live music (and cover).  Downstairs feels more like a small sports bar.\n\nSo, it's got something for everyone.\n\nI wish downstairs was slightly bigger, though.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-07", "description": "I have to admit I noticed I had not been to this place when I saw it on the Real World. Now I know how trumped up that series is so I had to come check it out for myself. I have been to a ton of clubs and had somehow missed this one. \n\nI have to get this out of the way first. I don't know if it was just the night we went but I felt like I was in the Castro. I want this to be clear to guys and girls that go here. First there was a majority gay males there when we went like two out of every three guys. And I truly don't have any issue with it but guys that are looking for a club spot might want to know that this is the clientele it attracts. On the other hand women may also want to know this for a couple reasons. \n\nFirst if you are looking to NOT get grinded on. To enjoy of fun night of dancing with your girls. Dance around some flamboyantly awesome gay guys then you are going to love playland and to be honest I get why girls would want this for a little bit after going through the meat markets of Vertigo and Mayes. But its just not as fun. No one is really dancing with each other and it kind of turns into a crowded standing fest. \n\nSecond if you ARE looking to get grinded on it didn't seem to be happening here. We left around midnight as it started to get packed and we saw several of the groups of women from playland at Mayes getting down later that night. \n\nAnd that kind of encapsulates this place. Its a safe fun starter night type establishment but if you want to have a real dance club experience you go somewhere else. Its good for a meeting up with four or five friends and some innocent dancing but don't we all want a little bit of regret in our night out? This is a little too safe and bland. \n\nI have to admit though. Maybe it was just the night we went but good god. The women were absolutely gorgeous. Like the best we have seen in this city. Probably they felt safer here than other establishments but as guys were felt like we have found the holy grail. It was glorious and then sad because they were stuck in this place. \n\nThey charge a five dollar cover for guys which I am cool with I get it and then having to pay ten later to go to Mayes is a bummer but some might stick it out all night. The downstairs was a regular bar setup with fewer people. Upstairs is where the party is with a couple of bars and great bartenders. The floor was big enough to get a good number of people dancing without feeling too crowded like Vertigo but not as fun as Mayes' floor. \n\nThe DJ was okay. If you are into EDM then this is your thing. A lot of mashups and safe music but no hip hop to be found. \n\nThere were a lot of bouncers there for such a small space so you should feel safe and sound when you head into play land. \n\nOverall for a danceclub/bar this place is right in the middle. If this sounds like your clientele you are going to have a blast. If you are on the fence at all there are much better places to check out on Polk that will guarantee a good time. \n\nI must say so long to all the gorgeous women at Play land for I am sure I will ever see you all again if you only go here but it was a blessed sight while it lasted. Enjoy this oasis of non leering and ogling until guys read this review and show up in droves.", "author": "Nick R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-09", "description": "While this place is fun, it will really only be fun if the attitude of the bouncers change. My friend got her phone stolen, out of her purse, while walking through the bar. It is clear the bouncers were in some way involved by their priceless reaction. Not to mention, multiple other people reported having their phone stolen the exact same night.  Then this article surfaced: http://sanfrancisco.cbslocal.com/2015/02/04/san-francisco-bars-liquor-license-suspended-after-employee-allegedly-caught-selling-cocaine-marijuana/. \n\nSad unfortunate bouncers have to make GREAT, FUN bar some place I never want to return. \n\nLastly, quite comical that they get their liquor license suspended and post on their website that they are \"remodeling\".", "author": "Katie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-02", "description": "WAY TOO PACKED. NOT COOL. WE LEFT AFTER 15 MINUTES. \n\nIt was a chilly Saturday night in February and we were out and about on Polk celebrating my girlfriend's bday. Poor choice on our part. Sure, the line moved quickly and we got in, but once inside, it was an absolute nightmare.\n\nPROS: not much. fast moving line?\n\nCONS: \n- Only one dancefloor upstairs\n- Dancefloor is small\n- SUPER loud. We were shouting into each others eardrums. \n- No order to the madness.\n\nNote to men: they charge $5 cover. \n\nLadies get in FREE!", "author": "Sharon G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-12", "description": "Not good for late 20s - early 30s. \n\nIf you're under 24 years old, this place might be awesome, and even 24 might be a little old.  \n\nI came here with a couple girlfriends on a Sat night. Although we had no trouble getting in (the line took about 7 min, and getting upstairs was free and easy)...once we got upstairs it was AWFUL...\n\nThink sweaty sardine can, full of screaming 22 yearolds, and the most annoying top 40 tunes playing on a terrible sound system. \n\nNeed I say more?! Wait I'll say one more thing, if you are late 20s - early 30s head elsewhere.", "author": "Monica G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-23", "description": "Great music, drinks and atmosphere !!! Security is awesome - modern & classy!", "author": "M D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "Note: Keep in mind that this was my first actual bar experience. \n\nDownstairs is tiny but upstairs is much better with better music (it was a lot of EDM type when I went). Crowd was cool; seemed kind of hipster (fine by me). The bouncer and bartenders are nice (especially even after my friend got too drunk and made a mess). I liked that there was a lot of space for my friends and me to just hang around wherever. Drinks weren't bad. Don't know if this will make a difference for the whiskey lovers but apparently they don't carry Seagram's Seven Crown.\n\nVerdict: I'll be back for more.\n\nPS. It's true, the AC is really strong especially by the bar upstairs....", "author": "Jolene L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "This is my favorite place in the city to go grab a beer, great for someone trying to meet new people. The atmosphere specially in karaoke nights is awesome. Just be patient in line.", "author": "Armand A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-06", "description": "I've been here a couple of times with colleagues.  Bartenders were very nice. I spilled a drink while drunkenly trying to have a conversation with a gentleman. The bartender  helped me clean up, poured another one, and didn't charge me.\n\nThere should be more bathrooms in this place. I've resulted to peeing in alleys a few times too many here. \n\nI lost my id and debit card here. That's how you know I had too much fun.\n\nThe time I went with friends was a lot more fun. I found myself dancing and singing to Justin Bieber and Miley Cyrus. Whatever. \n\nLadies, no cover- that's always good.", "author": "Nicolle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-15", "description": "A place in SF to dance that I actually like?! It's about freaking time.\n\nCame to Playland last Friday for a friend's birthday and had a great time. It got really crowded by the end of the night but that is bound to happen. Their wonderfully efficient ventilation system puts you in the middle of Chicago with high winds keeping the space nice and cool despite all the people.\n\nDrinks were normally priced, nothing fancy but I sure wasn't trying to be fancy that night. There was an awesomely diverse and young crowd which made for a good time. It was also a breeze getting in and going in and out of the bar. When things got a little crowded, I ducked into a bar next door for a quick drink and then got right back in. \n\nDefinitely recommend Playland!", "author": "Raina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "Security is very courteous, the bartenders are friendly and the drinks are amazing! Love the vibe. Not too crowded but not dead. My girls and I will for sure be back!", "author": "Anastasia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-21", "description": "Really not a whole lot to say. Fun times all around. Upstairs/downstairs depending on your preference for chill vs. dance. Staff isn't the MOST friendly but they do a good job of crowd control, managing the dance floor, etc. \n\nGood crowd. Fairly balanced and diverse.", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "This bar is very fun and I loved the atmosphere and local vibe. Really fantastic craft cocktails especially from bartender Yana. You might think it is small at first but there is an upstairs too so check that out as well.", "author": "Tara F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-16", "description": "Oh man, I love Playland.  Happy hour Mondays are my favorite days. Well, followed by the eclectic mix Tuesday that is.  Or maybe bourbon cocktail Wednesdays. Hmm, have to make up my mind. Well, you get the point, I live right near by. \n\nTo be honest, I was a bit skeptical when I first found out that Kimo's has changed ownership and no longer provides gritty entertainment that Polk street was famous for in its glory days. But like with everything else, times change and things change along with it.  \n\nI love the new decor, friendly and beautiful stuff and let me tell you,  turns out dive bars don't have to be dark and smelly. When you there, make sure to check the second floor loft, one of my favorite changes to the space. With the views of the downtown traffic, it is a pleasure to sip the cocktail and look at the madness of the city from the high up. \n\nJust like I said at the beginning, it has become one of my favorite spots, but don't listen to me and come check it out for yourself", "author": "Misha K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-11", "description": "I never came to this location when it was still Kimo's, and a few years later it's been transformed into this fun dance floor where apparently everyone I know goes to often.\n\nOn a given night, three different groups of friends went here separately, and I got to see them all. Awesome.\n\nThe upstairs is pretty packed but for good reason. The music is fun, people actually dance, and it's not impossible to get a drink and come back within a song or two.  drinks are very reasonably priced for an SF bar ($6 or $7 for well drinks).  Cover is free for girls, but boys had to pay $5.\n\nThe layout probably isn't the best, and the bathroom situation is awful, but overall this place is a good time and I am sure I will somehow end up there many more times in the future.", "author": "Naoko M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "We went here during the afternoon and it was a welcoming atmosphere. Clean place with good music playing. The bartender was very friendly and we were all exchanging laughs. The have bar games, which was fun, since it entertained us and everyone else at the bar. Good prices and specials too.", "author": "Jeffrey T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-16", "description": "I've always had a good time when I've come  here. Last time I was here I played beer pong in the back room. Today I'm celebrating the warriors championship.", "author": "Beni R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-09", "description": "Playland has definitely become one of my go-to bars on Polk street and it seems that it's quickly becoming pretty popular. \n\nI honestly couldn't tell you what was there before Playland, but I think they have done a good job with the space. Both floors have tables and seating so it's a good spot to bring friends. However, it can get packed pretty quickly, especially on weekends.\n\nThe upstairs is great for dancing and they play good music (usually top 40, hip hop, mashups, and dance). It does get packed pretty quickly and they charge cover for guys, ladies are free ;) It also gets pretty hot up there and there aren't any other fans except for one right in the middle of the dance floor (you'll find me there! who wants to be sweaty in a bar? NOT cute!)\n\nThe drinks are decently priced - I ordered a Greyhound, which ran be about $9. It's not the cheapest place on Polk but they make a good drink.\n\nThe crowd is pretty mixed - I'd say late 20's to early 30's. More of the Marina type crowd, at least from what I could tell. \n\nDefinitely a solid spot on Polk for bar-hopping but I wouldn't stay there all night.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-22", "description": "Love the strawberry basil martini.  They have pretty good service and I like that there's no cover for their dancefloor.\n\nBIG CON: 1 bathroom for each gender.. really?!  You've got 2 floors packed with people and only 1 bathroom? The girls line was ridiculously long and it just snaked around to the bar, causing major blockage to the hallway.  Isn't there some type of regulation about capacity and # of bathrooms offered?", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "Playland tries to cater to a wide range of customers. They have different events throughout the week, such as karaoke on Tuesdays, club nights on Friday and Saturday, as well as Salsa dancing on Sunday. The bar staff is friendly and professional. Drink prices are reasonable with the Polk street area. I recommend the Mezcalita, a smoky cocktail made with Vida mezcal. My only criticism is it can get very crowded upstairs, but could definitely be enjoyable if you like to dance and listen to music.", "author": "Joey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-04", "description": "I liked the vibe and the layout of this place. You enter on the ground floor and are greeted by a traditional long bar with trendy, dark-ish decor. But in my opinion, the real fun is upstairs. That's where the DJ is jamming to a great mix of \"current\" pop/top 40/EDM and a few throwbacks as well :) The dance floor is on the small side, but that also makes it less daunting when you actually have to cross it to, you know, order a drink. I also appreciated the seating available around the dance floor if you're in the mood to just chill, sip your drink, and people-watch.\n\nbest part: $7 shots. I literally did a double-take when the girl told me that my bill was only $14 for two shots haha", "author": "Leslie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-28", "description": "On Friday, it's free for women but $5 for guys for the upstairs portion, which was extremely crowded.  The dance floor is a joke and the low ceilings on the second floor makes this place kinda claustrophobic. It doesn't get that stuffy since they have an obnoxious ceiling fan by the bar may blow your hair all in your face since it's powerful.  They cram so many people in here, it doesn't make it conducive to hang out in a larger group.  It was a diverse crowd in age and race.  Bartenders were efficient and nice.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-08", "description": "Hell.  On.  Earth.\n\nBasically an oil-packed tuna can full of \"yolo\" girls and guys who wear polos.\nBartender couldn't be slower.  While you're at it, please add alcohol to my drink.\nSome guys punched my friend in the boobs, almost a legitimate scuffle.\nI had a Ludacris moment and just had to scream \"MOVE BITCH.\"  I really did.", "author": "Rachelle P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-10", "description": "It's like every frat boy ever decided to come to Playland instead of containing their testosterone within the confines of their frat house. Insufferable. It doesn't help that Playland packs you all in like a herd of cattle. \n\n\"Move along, now,\" I said to some steroided fratty who stopped the entire flow of cattle traffic to tell his bro that, like, Tina's not acting very cool tonight, bro.\n\n\"Relax!\" he snarled at me, then straight-up punched me in the tits, knocking the wind out of me.\n\n\"Oh, yeah, being punched in the chest is totally going to make me relax!\" I said, and since he decided things were ready to get physical, I pushed him aside so the throngs of innocent cattle could continue their pilgrimage to the overcrowded bar.\n\nRecommended if you like listening to the same songs that were played at your junior prom in 2004, bringing the Marina to Polk Street, being crushed in a throng of people, and not drinking alcohol. Otherwise, just go have a better time at Hemlock.", "author": "Jessie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "My favorite spot on Polk St. They have live music during the week which is awesome and it's a great venue to go to on the weekend for drinks and dancing. The upstairs has large windows that overlook Polk and a bar so you don't have to go back downstairs on a crowded weekend night. The staff is always friendly, courteous and attentive. They consistently make wonderful cocktails and have good beers on tap - And the recently remodeled the spot! Very nice!!", "author": "Forrest C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "Playland is my go-to bar for a good drink. My favorite is Apricot Diplomat - try it! The downstairs and small and intimate, a perfect place to catch a game or grab a drink after work. Great  ambiance, friendly patrons, top notch bartenders and amazing music. If you feel like hitting the dance floor, the upstairs always has a good crowd, its well ventilated and the music is fun.", "author": "Yelena K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-25", "description": "Uhhhhhhhhhhhhh.. what a swordfest.  Came here Saturday night (per my co-workers suggestion) and this place was packed (were talking like a sardine can) with dudes.   There were a few chicks, but yikes, definitely not my scene.  We waited 30 minutes to get in and even didn't mind paying the $5 cover to get up stairs but holy moses this place is packed, no matter if your up stairs or down stairs.  The drinks were stiff, but it took a while to get a drink.  I did like the view from the 2nd floor out to the streets, other than that, I wasn't impressed.  I'll stick to the marina!", "author": "Mike M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-12", "description": "I really like the split levels idea. The ground floor gives you an opportunity to be in a dive bar while the second floor has a dance floor and gives you a feeling of a night club  . I have been there 3 times and always had a blast - 5 star for that", "author": "George B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "Playland is an awesome bar. I've been here a few times since it recently opened. The bar is nicely located on the corner of Polk and Pine streets and is close to many restaurants. Good service. Couldn't be happier.", "author": "Frances V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "Came here last Saturday night, went in after 11:30 and the upstairs club was super super packed!! It was hard to dance since people were bumping up on you all the time.  The crowd was good looking which is something I always like when I go out, very young crowd unfortunately it was a lot of annoying 21 year old girls who probably were on their first night clubbing.  Music was Pop Top40, not my thing since I feel like I can just turn up the radio and dance  to it anytime I want to. But overall I liked this place and it was fun.  I still prefer much more House EDM clubs", "author": "Francisco B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-05", "description": "The owners of Playland put a lot of work into this space. But that goes to show that one can put a lot of work and end up with just an average place. The drinks are fine, the prices are not unreasonable, and the space is pretty nice. The other patrons, well, your mileage may very.\n\n[Kimo's used to be here]", "author": "Suo L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-23", "description": "Visited the bar on Zombie night and had fun time.  Half of the upstairs bar/dance floor were all dressed up.  Drinks weren't exorbitantly expensive, and the dj played top 40 forty music and popular mesh-ups.\n\nPros: Fun, no cover if you come early, sexy bartenders, great AC unit to cool you down on the dance floor\n\nCons: Gets crowded quickly and people start shoving you aside as the night wears on", "author": "Yorick J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-05", "description": "This is my first Yelp review ever but I felt I had to because I was upset with this place. I went on a Friday night with a big group of friends. Let me start off by sayin I'm no thug, or lowlife, I'm an upstanding citizen and when I got out I spend money at whatever establishment I go to. When we approached Playland Bar the doorman said I couldn't come in because of the dress code. I was wearing black pants a nice shirt and Timberlands. I looked inside and most people were in jeans and t shirts so I asked what he meant and he said my shoes weren't allowed it. Again I looked inside and most of the patrons were wearing tennis shoes, slip on vans, I even saw one guy in there with smiles face emojis all over his shoes. Not in a rude way, I went up o the door man, who by the way was wearing black and red Jordans (which he looked too old to be wearing anyway) and I asked him \"vans are allowed but not Timbs?\" To which he Rudely and confrontationally said \"are you wearing Timbs? They obviously we don't allow Timbs\". I don't want to sound like a snob, but I could have bought 5 pairs of Vans for the price my Timbs were. The door guy had a weird power trip over a bar and I took my business elsewhere. Too to anyone that has a similar encounter walk down to Vertigo. No dick on a power trip at the door and good music. I spent a lot of money there and because I was treated better", "author": "Armando M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-07", "description": "Unless I'm truly blown back in my seat I never like to 5-star a joint on my first visit so I would usually go with four until I've seen it on 3 or 4 different nights of the week. I'm going to make an exception because this spot is new and they need the publicity - plus the owners did a first-rate remodel.\n\nI'll start by saying this is definitely *not* the old Kimo's. Playland is its own experience and stands up nicely along side the other swanky ambiance bars on the Polk Gulch stretch (Lush Lounge, Royal Oak, Amelie, Zeki's). It is a split level bar, though the upstairs does't open until May 10th.\n\nPlayland is named after the old Ocean Beach amusement park ( http://goo.gl/lm4NP ) and will have loads of fun theme decorations when the owners finish it up.\n\nWhere a bar like Eve is trying very hard to convey a Victorian/Gothic feel, or to be a high end Harlot, Playland succeeds at an elegant down-tempo sort of Steampunk. Rosewood, copper accents, and wall to wall dark paneling (large rivets) give an Edison/Tesla sort of feel to the place, complete with vacuum tube lighting in the alcoves behind the liquor shelves.\n\nMy drink was well mixed, if a bit on the pricey side at around $8.60 for a Mandarin Cranberry (they only had Ketel Orange). The bar & door staff was friendly and the light Sunday evening crowd was diverse, as you might expect on an off-night in this part of town. I had a great chat about the changing neighborhood with a tattooed Mexican guy with a bright smile. I noted the standard Polk street crowd in the center of the bar, and a guy working on his laptop at a table by the window.\n\nI stopped by Playland for two reasons. For one, my brother's SEO Firm (Kickstart Search) had been contacted to do a very basic website for them so I was curious what kind of a venue they had put together. The other is that I was waiting on a large pizza at Victor's, half a block away, and had a puppy with me. I was looking in from outside, checking out the spot, and the bartender waved me in saying my small dog was ok.\n\nCheck, immediate star for a dog friendly bar.\n\nThey also have two gorgeous LED TVs in high definition at the downstairs bar and will have more upstairs. It looks like a great game spot.\n\nOnly time will tell what Playland becomes. They will be opening the upstairs this week, at which point the layout should feel like a smaller version of Raven Bar (1151 Folsom). As a result, this will be yet another venue packed to the gills with 20-somethings on Thursday, Friday and Saturday night. If that isn't your scene, then you probably aren't on Polk those nights anyhow.\n\nThe Bush & Polk Garage ($2/hr - closes at 10 on week nights, 2 on Fri/Sat, closed Sunday) is your closest workable parking location. Just be very aware of the hours of operation.\n\nAs for the rest of the week, if you don't mind the higher-end drink prices and feel like an alternative to the nearby Lush Lounge, Playland is a wonderful addition to the neighborhood.\n\n--\n\nUpdate: having toured the upstairs I now know that the a/v system is stellar. The floor to ceiling windows offer a beautiful view of the bustle on Polk street and it should be a particularly nice vantage point right around sunset. The stage area includes two 60\" LED televisions and the bar has several beers on tap from keg lines downstairs. There's really nothing else like this North of Market and the owners are making a real effort to avoid having it fall into a top-40 niche upstairs. They are even booking a burlesque accordion band to play there.\n\nAgain, it takes time for a venue to develop a personality (the reviewer behind me had a nice time trolling the clientele before the Grand Opening even occurred) but the ingredients are there for Playland to develop a fun one.\n\nAs for a hands-on approach, this was the first time I was personally contacted by a venue owner to thank me for the level of detail in a review. Say what you will about the style of the decor and the future band choices but the owners are a real class act.", "author": "Ian A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "I really love the decor at the place. Its got a nice modern classy decor and is really clean, maybe cause its relatively new. I've only been here during the early evening so I have no idea what the late evening scene is but I really enjoyed getting drinks here. They've also got a couple tv's to watch whatever sports games are happening at the moment.\n\nThe service is great and the staff friendly. They've also got a limited but well edited selection of beers both on tap and by the bottle and the prices are quite good for a Polk street bar. I'll definitely hit this place up again when I'm in the neighborhood for a quick drink with some buddies.", "author": "Will S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-09", "description": "It doesn't seem like a dive bar but it acts like one.\nThe bartenders are nice and generous but aren't creative.\nThe clientele is average but not responsible and yet interesting the type you think about sleeping with but recall you've been drinking and then slip  and slide away.\n\nIt's cool but will be cooler when the stage for bands opens.\n\nPolk Street is full of bars now and this one at this point is just average despite the cuteness of the bartender.", "author": "Alexander R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "My favorite bar by far! The owners are super nice ! The bartenders are very attentive and attractive ! It does get a bit crowded but that's only because it's the place to be at on a Friday night ! Overall, I always have a great time there ! I definitely recommend checking it out :)", "author": "Hazel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "This is a great bar on Polk for a night out with friends. Has a bar right at the entrance where you can sit and chat, a room that is more private with large leather couches and a small bar, and a medium sized dance area on the second floor with a full bar.", "author": "Joao P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "Great craft cocktails and happy hour.. Nightclub upstairs is fun for dancing and good music", "author": "Shaughni N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "It was hoppin at midnight. Lots of handsome guys and gorgeous bartenders. Great place to play", "author": "Claire M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-18", "description": "I rarely hop out to polk to go bar hopping but all the spots here are chill. Just a block away from another bar, playland is one of the nicer spots you can hit up. \n\nThey have a full sports bar with big screen tv's and a spacious upstairs that play top-40 for all those rachets. \n\ntheir drinks are REALLY STIFF. screwdriver? pineapple vodka? oh man hella stiff. Unless you ask for a premium vodka, they will drown that cup with alcohol and it will get you goon wasted. \n\nStaff here is awesome. Bouncer = awesome. Bathrooms = thumbs down. always a huge line for that damn bathroom", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-24", "description": "I went here on 12-23-14 9:30pm'sh.  My friend told me to go to this bar for karaoke, Amanda throwing the gig.  I had their lagunitas ipa, corona, lager?(forgot the name), and bought a heinenken for my friend,  all for $5 each, gingerale $2. Upstairs is roomy with good sound system.  There was a pub crawl, hence certain times this bar was packed.  Two unisex restrooms were located downstairs (I wish they would replenish the paper towels or get electric dryers). I asked the bartender how much was hard liquor, he said $10 for the Patron (noticed it was on tap) and Hennessey shots, $8 jameson, I ordered this one ipa(but I think it was contaminated, he was cool and gave me a stella on tap). Overall I do like this bar.", "author": "Jer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-04", "description": "I feel my review might be slightly slated, as this was the last stop on our Halloween bar crawl. We paid 15 fro a wrist band to get us 3 dollar drink specials at 6 or more different bars. The place was totally packed, we couldnt even barely walk in. We made our way though. I even found my self a stool so i would have to be a sardine amongst the people. I remember a few details, first the drinks were fresh and delicious. I also remeber the bartenders being really super sweet.", "author": "Desiree Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-15", "description": "Literally a hop away from my go-to Grub Steak, Playland offers me a very inviting and comfortable hang out to either sit and read, watch a game, or hang out with buddies.\n\nOn a recent visit I had the opportunity to visit and while there hang out with the bartender, Julia. What a spark of sunshine she adds to the place. Not only does she expertly mix concoctions, she is by far one of the most engaging hosts I have had the opportunity to meet.  \n\nPerhaps the hint of Eastern European charm, her naturally good looks, inviting personality, and most of all, attention to customers, makes her an absolute delight to hang out with. \n\nI'll be back for sure. To the management of Playland: a touch of genius adding Julia to the mix, no pun intended! \n\nRock on Playland!", "author": "Doc P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-07", "description": "Fun fun wanna come back soon and bring my girls. I didnt have a problem with anything besides the dancefloor they make the back a vip but its still connected to the dancefloor with a belt that separates it kinda weak because it gets crowded and everybody ends up back  there any ways and security is tryna regulate. But any ways I had a good time and everytime I go here someones always.buying me drink since people forget that theres a 20 dollar limit on the card so catch a dumb dumb at the bar hahaha. Gonna be coming back soon so catch me in motion", "author": "Gracelove C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-01", "description": "There were 20 minutes left for the pub to close (at 1:40 AM on a Saturday night). We were there to celebrate a birthday and it was extremely rude for the waiter to snatch the drink from the birthday girl and 4 other friends and ask us to get out 20 min before the bar closing time. We were quietly sitting at a table on level 1. Horrible experience!! Will never go back and hope the place closes down soon.", "author": "Ketan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "If you are thinking of a fabulous venue to host your next event I highly suggest Playland Bar! My friend hosted her fashion show here and what an incredible evening.... the atmosphere and the staff are spot on! I really love what they have done with this space, the theme and decor are whimsical and fun. My friend is having her baby shower here in January. I helped make arrangements and really want to give huge kudos to the manager Reuben for making setting this up so easy breezy!! Can't wait to indulge in strawberry basil martinis and play here soon! ~Cheers", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-19", "description": "This bar is definitely for a certain type of scenester. If you're looking for a dance club (rarity in SF) that is packed to the gills and walking through a schweaty mess -- this place is for you. It's a fun place to stop by at the end of the night if you're already in the zone. But if you're looking to get in the zone by coming here... you're probably better off going elsewhere.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-04", "description": "Good cocktail but with a surly bartender....absolutely atrocious music. Justin Beiber??? Seriously??? No me gusta.   I will not be back to play.  Polk is filled with good bars....keep walking.", "author": "Darby W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-18", "description": "I went to this bar back in the day when it was Kimos. Kimos had a lot of rich history, but it was looking kinda of washed up more recently.\n\nI went there on the opening day of the new Playland. My friend and I went in for an afternoon drink to settle our nerves. We weren't expecting much, but the decor improved drastically and the outfits the bartenders were very cute.\n\nNext thing you know, the bartender says, \"This gentleman is buying everyone in the bar a round of drinks!\"\n\nWoohoo. I can't complain about another Lagunitas. \n\nI talked to the gentleman, and apparently, we was a beer Anheuser-Busch distributer. We chatted for a bit and he was so impressed that I was drinking Lagunitas IPA. We were speaking about the many breweries in the bay.\n\nHe asks, \"Ready for another round?\" And he buys another round for everyone in the bar again.\n\nAlthough he was a distributer, he was still buying a ton of mixed drinks, etc. that weren't what he was selling. \n\nHe must have felt like the man when he left. We all cheered and applauded his exit.\n\nEveryone was really friendly. I talked to the bartender Jessica, a sound engineer, and a promoter on top of the distributer. \n\nMaybe because it was a new kegerator, but damn, those IPAs caught up so quickly and I wasn't able to drink after the three.\n\nI'm definitely going back. Hopefully someone pulls the same behavior!", "author": "Patty C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "Yana is amazing. You should come here and experience her. Ruben give this girl a raise! Yana I coming back, you're the best bartender I've ever seen at this place!", "author": "Sara Jo R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-25", "description": "If I could leave zero stars, I would. Do NOT go to this place if you have a nice smart phone you want to keep. I came here with a few friends after being up at Wreck Room for a friend's graduation party and my brand new iPhone 6s got stolen right out of my purse. Mind you, this is the SECOND time this has happened to me on almost two years and I've known 3 other people who have had the same thing happen to them. My purse was zipped and cross bodied and it was so insanely packed upstairs that you couldn't even notice that someone was stealing something right off your person. DO NOT GO HERE. These people need to fix how and who they let in to this bar. The music was mediocre, the drinks are watered down and too expensive & your stuff gets jacked. There's plenty of other places to go where you won't get things stolen or sweat on.", "author": "Jill M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-03", "description": "Such an upgrade from Kimo's!  A ground-up renovation has completely changed my perspective on this place. The two level concept with different ambiances is a genius idea.  Have a drink and a conversation with friends on the first floor, or go upstairs for some dancing.  The ventilation system was reconfigured to blow cool air directly on the dance floor and throughout the second level.  The floor to ceiling windows provide a loft feeling and strong drinks will enhance your mood. \n\nIt gets crowded on Friday and Saturday nights after 11pm.  Happy hour is all night long on Mondays.  Two large TVs over the lower bar create a great spot to watch a game.\n\nOverall, one of my new favorites in the area!", "author": "Vadim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "One of the top bars in the Pulp Gulch.  Fun atmosphere with a rowdy, yet reserved crowd that doesn't get out of hand.  Karaoke on Tuesday is a blast, and bonus points for the bartender Cameron for always serving up delicious original cocktails.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-27", "description": "I've been to this bar a number of times and the experience varies on the time of day you go and who serves you.  If you're looking for a speak easy type of bar, it's there for you during the week or during the weekend in the day. If you're looking for a club style environment with gorgeous girls, -and I'm from Miami so I'm critical on this factor, you can find it on friday and Saturday night.  Cocktails are good and there are a multitude of affable Bar tenders with some talent. They're all attractive people from different countries (once again I'm from Miami so this is important to us).  But there are a few that stand out. Inna, Fernanda and Julia are probably the most attractive capable Bar tenders of the group. Cameron is the only guy guy but probably one of the more knowledgeable mixologist that I've met.", "author": "Frank P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-08", "description": "Extremely busy on the usual nights, to the extent that it's difficult to navigate the downstairs, which is cramped enough when empty.\n\nUpstairs is less cramped, has the usual deafening music, but is slightly less cramped and even has a reasonable size dance floor.\n\nNo cover before late evening, but don't make the mistake of going downstairs then back up across the change of hour, because you'll get charged a cover. If you're male. You'll notice everyone here saying there's no cover is female.\n\nYes, Playland is illegally (Unruh) collecting a discriminatory cover charge for men only. I went in with a group of 10 women and I'm the only one charged $5. I guess that's what not being white and male must feel like to everyone else :) Quite educational.\n\nAs obnoxious as any other loud bar-kinda-club setup anywhere else, but with the advantage of not being in the middle of nowhere like most of the others.", "author": "John R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-15", "description": "The feel is a little bit snooty with a huge sash of hipster. I like the drinks a lot. It's strong and tasty giving you yhat nice warm buzz you need to get you out the door to walk to the next place. I'd bring friends here to catch up with them, over drinks of course.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-01", "description": "A friend of mine rented out the room in the back behind the bar downstairs for Halloween. Its the perfect size for about 40 people on a flow. Its right by the bathrooms, and you are able to do bottle service which worked out great for our group. The room itself is perfect for a party. It has a tv as well, so if you had a sports game you want to watch maybe they can play it on there? They had a movie on when we were there. \n\nMy only complaints - it was hotter than hades in the back room - like sweating through our costumes hot. Do they not have air conditioning? The back room has no windows so that didn't help. Also the bathroom is shared, like for everyone downstairs, which is crazy!\n\nLastly, we went upstairs to dance for a bit and it was so incredibly crowded you could barely get to the dance floor.  Maybe they should let in a few less people? They played top 40s music which is fine.", "author": "Natalie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-16", "description": "25 seat/stool bar in Russian Hill...\n\nApparently no bar food...\n\n2 tv's to watch games on tv...\n\nThe \"plus\"...Monday nights have 5 buck Jameson and Fernet after 9pm. Very worthwhile if those are any of your poisons! \"Industry night...lol\"\n\nNice blend of 80's music spinning loudly from the speakers...\n\nNice staff. Stiff drinks. Not bad for a nice decored hole in the wall...will be back after 9pm again!", "author": "Kyu L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "Came here last night and had a great time. The dance floor was packed and so hot but the music was great and kept us dancing for hours. If you want to avoid the creepy club scene but still want to dance, Playland is the perfect choice.", "author": "Sinead T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "Playland Bar is AWESOME!! They have it all! It's a great club on the weekend with live DJ's who play something for everyone and it's also a really chill spot to have a drink on a mellow night. Last Sunday afternoon was particularly cool because I got to watch the Giants game, have a great cocktail, and there were a bunch of people dancing and enjoying the long weekend. The bartender was friendly and fun and knew how to keep the place feeling as good as he was. I can't wait to come back here and enjoy this real, down home San Francisco establishment. Great job Playland!!", "author": "Mark U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-28", "description": "Came here on a Friday night and was pick pocketed for my iPhone while walking through the crowd upstairs. Went downstairs, which was fairly empty and the same thing happened to another girl. I guess this happens a lot and is a recurring theme at this bar specifically so just wanted to warn people!", "author": "Shaina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "Great neighborhood vibe, low key (at least on the 1st floor, we didn't go upstairs). Cocktail menu is solid and the people are friendly.", "author": "Amber M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-11", "description": "Came here on the Sunday before Labor Day to grab some drinks, but we didn't stay long.  Downstairs was pretty small with only a few tables and very cramped standing room, so luckily we got a table.  I'm told upstairs was a dance floor, but apparently there was some sort of event going on and they were charging cover to go upstairs that day.  \nPretty meh experience, but maybe if the upstairs area was open it would've been a lot more fun.", "author": "Keith C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-30", "description": "I've been here a few times, usually following the plans of friends. It's always usually an alright time. The downstairs area feels like a psuedo loungy type bar, with some tvs playing sports. Upstairs is usually where I hang and they have another bar, some seating and then a smallish dance floor.\n\nDrinks aren't too expensive. DJ is pretty good, plays a mix of house/hip-hop. Towards peak hours (12-1) it gets super packed and you often have to physically push people out of the way... There's also usually a moderate line at this time too. They also recently started charging $5 to go upstairs, however this seems to be only for guys and after a certain time. I guess they're trying to level out the gender ratios.\n\nOverall, I usually have an alright time here. I like the dancing. I think my main beef with the place though is the clientele. It's a bit \"bro\"-ish, however I guess that's just the area. I'm sure I'll be back though...", "author": "Mike C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-15", "description": "Loved my first Polk Street experience at Playland! \n\nAmbiance: I was a bit worried when I saw that the bottom floor was so small and crowded, but luckily as we walked up the stairs, we were welcomed with a much larger floor with a nice dance floor and another big bar. The ambiance of the bar was great! Kind of dark, interesting and fun mix of people, and fantastic music. Literally the only downside was this super awkward air that was blowing in our faces at different areas. When you get to a bar, you really shouldn't be COLD. But I guess it makes sense because every time we took a break from dancing, the air felt really nice. But the air should be on the dance floor...definitely not right next to the bar where people are talking and hanging out (and thus, probably not dancing/hot). Buttt sorry for that digression, amazing ambiance! Just crowded enough to not make you want to kill yourself but not so deserted that you think you're at the wrong place. \n\nDrinks: Decently priced and really sweet bartenders! There is a $20 minimum for credit cards though, so watch out if you don't have cash. Also I asked the lady to make my $17 total for two drinks into $20 to let me use my credit card...and she made it $20.89. Kind of annoying because I didn't ask her to make it higher than $20 but it's okay I was having a really good night :) \n\nBottle Service: A friend of a friend's got our group bottle service and it was amazing! We got the area in the front of the dance floor with couches, and enjoyed our night with handles of Grey Goose, orange juice and cranberry juice and tons of dancing :) Definitely pricey, but also easily made our night infinitely more enjoyable (and less crowded). \n\nVerdict: GO GO GO! It's also around a ton of other bars so a perfect place to bar hop and there's also good food in the area open super late (Bob's donuts or Mel's Diner, both good options) so it's a great place to be at night! Also no cover (not sure if this is only for girls) but yay! And the bouncers are all super nice, so you don't feel at all annoyed or weirded out.", "author": "Anu P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-03", "description": "Playland is great! its such a nice new addition to the Polk St. collection of bars.\n\nits super clean, and the crowds are fun.  the bartender Jessica was super nice and and wonderfully responsive.\n\ni def recommend this bar and day of the week!", "author": "Elliott A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-16", "description": "Bartender until 9 pm made the experience positive. But what a change when the new bartender arrived. She was more into socializing than taking care of customers.", "author": "Judi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-11", "description": "This seems to be the new trendy/hip place on Polk Street. \n\nI went on Friday after work for TGIF Happy Hour with friends. Downstairs is small and great for individual or smaller gathering (that is if you can snag a table) but we needed a bigger setting so we went upstairs and was able to have our own designated area with great upbeat music, courteous bartender, and scenic view overlooking Polk Street. There is a good selection of cocktail choices and I found my favorite..the Strawberry Basil Martini! A phenomenal cocktail ..very tasty and goes down smooth. We stayed longer when the place becomes party central after 10:30 pm. This is when everyone awakes from their nap after work or had their dinner and is now ready to party and burn off their calories! You won't be sitting at all since the DJ mixes all your favorite music from top 40/Hip Hop to Old School. Overall, this playground is definitely a great looking place. It's a more intimate feeling than other clubs downtown or SOMA. \n\nI highly recommend this place for happy hour, cocktails, and dancing. An improvement over the old dingy Kimo's. \n\nTo the party people\n\nPros:\n1) Great place to drink, talk, flirt, and be in pleasant company with friends and strangers\n2) Good crowd control, still packed but not to the point where it's unbearable\n3) No cover charge!\n\nCons:\nNone - negativity gives negative outcomes to oneself\n\nThey also have clear plasma TVs for sports and hope they have special gatherings for Super Bowl, World Series, Summer Olympics, and PPV boxing. Go Giants!", "author": "Vagabond C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-31", "description": "Worst bartender I've met yet! There were 3 off us in there on a Sunday afternoon drinking and watching the game. Two out-of-town floozy's walk in with their idiot guys and request music. The bartender has the nerve to shut the Giants game down and turn on hiphop so these girls can bounce around. I couldnt leave quick enough and was saved by a neighbor bar with real SF people", "author": "Heather W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-08", "description": "My favorite bar in the city.  It's just a very fun place with cool decor, top-notch bartenders, and awesome reasonably priced drinks!  I love that there are so many different parts of this place with different feels.  The downstairs bar is great for having conversations with friends, the backroom has couches and more of a \"lounge\" feel, and the upstairs has the dance floor with more of a \"club\" type atmosphere.  There's something here for everyone.", "author": "Chester S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-16", "description": "Dave and the group which hosts the band upstairs are great. Ask him about the open mike and if you can jam. They're a great group and good folks. Good jazz, r&b, and r&r. You'll like it.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-16", "description": "The music was good. It was wayyyy too crowded and hot. They let too many people in. Be careful because when I went a bunch of people had their phones and wallets stolen off of them because it was so crowded. The security was not helpful at all. I am never going back.", "author": "Amanda T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "Fun place, reasonably priced. Bottom floor gets uncomfortably packed but second floor (while still crowded) feels less claustrophobic; you may have to wait in a short line to go up.  You even have a chance finding a place to sit up there which can be nice", "author": "Ross I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-06", "description": "Nothing special, just a standard bar on Polk. On weekends at night they try to make it clubby, with DJs and music. It was so packed when we went on a weekend night that our entire group didn't stay longer than 5 minutes. It was a nightmare and the music wasn't good. Drinks are mehhh. But what can you expect when they pack the place. \n\nIf you are looking to get sloppy than you probably would enjoy this place.... Me, not so much.", "author": "Brittany S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-28", "description": "I was expecting more of a playground theme from this place...  Guess that's my fault.  We did get a bar fight, though!  I think this place might be better on like a Tuesday.  There were a LOT of people and not really much space to move around.  Or stand stationary.  Clubs are really not even my thing, so maybe take this review with a grain of salt.", "author": "Nora S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-06", "description": "I went here for the first time this past weekend and I loved it! The dance floor on the second floor is where it's at! It got crowded but the people weren't pricks and everyone was having a good time. The DJ was great and kept the music going with lots of energy and popular tracks. I do think it's a bit silly that if you go downstairs to use the restroom that you have to wait in a line to go back upstairs but I suppose that's just their means of crowd control. All in all, a fun place where I will definitely be back.", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-02", "description": "I've only been here to consume beverages.  In my opinion, this is one of the best places to go out on Polk.  It's very versatile - you can be downstairs at the bar in the entrance and have a lot of space and talk, or you can be upstairs listening to loud 90's music and dancing.  Last weekend, I did the", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-08", "description": "I've been to several private events at the upstairs bar and they always do a great job. The owners and bar manager are helpful in accomodating and the drinks are delicious- especially the strawberry basil cocktail. The bartenders are all professional and foxy (yeah, I'm superficial in this regard), and pleasant. I brought my nephew here for his 21st birthday and everyone in the bar made sure he was having a good time. The only down side is that it does get crowded later at night (the price of success) so I tend to get here early so I can enjoy it when it's still pretty chill.", "author": "Mishka L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "First time here last night.  Had so much fun! Definitely gonna go back! The place wasnt hella upscale but the prices were good and drinks were great!", "author": "Ektomi D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-04", "description": "Went here on a busy pre-Halloween weekend and had a great time. Friendly staff, fun crowd and pretty good service (it was a packed house--so you can't expect prompt drinks). I'd definitely come back again for some dancing and good times!", "author": "Althea D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "This is a great bar. Depending on your mood, you can get the best of both worlds. Go upstairs and enjoy drinks and dancing with your friends. If you're in a more calm mood, hang out downstairs and enjoy the drinks while watching a game. The location is great. This is likely the best bar/lounge on Polk street. And the bartenders take care of you - especially with their creativity when you're not sure what you want.", "author": "Cëma M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-05", "description": "It's ok. They almost charged my credit card too much until I brought it to their attention. At least they fixed it (I checked my account) Fun place though as a stop on a bar hop adventure on Polk street LOL", "author": "Vol T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-28", "description": "Everyone has to be careful!!!!!! Someone stole my phone in the playland. This is not a safe place. The guards and bartender have no idea how to do this.", "author": "Minmindy W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-15", "description": "Went here last night around 9 and went upstairs to dance. It was completely dead so being 3 of 5 people up there we sat down on the couch area with a small dinky table. Place started to fill up and around 11 this douchey tool that must have been dealing with the bottle service area came over to my friends and I and was completely rude to us and told us we need to move the table is reserved, and we happened to be sitting there the last two hours. I asked him where the sign was and he said someone must have taken it because he put it out at 8 when he got there. Funny bc we had been there since 9 and upstairs was empty I guess one of the other two people up there must have removed all the signs for the tables. I called him out on his lies and he was just so rude to us. He then proceeded to tell me I can take my business elsewhere if I am unhappy. So we did, we left immediately. The area didn't even look like a bottle service seating area it looked like a free for all seating. I'm sorry but play land is nothing special where you need a bottle service area it's a joke.Someone needs to teach this fool how to properly ask people to move, don't lie about it and don't be a dick.\n\n\nSo two stars because upstairs played good music and AC was on full blast upstairs which was nice when it started to get crowded and all the body heat.", "author": "Krista R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-31", "description": "It can get hot and stuffy in here. The bartenders make great drinks though. I once came for happy hour on a weekday and decided to go to the back room to sit down and have my drink, but the place was filled with fruit flies.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-28", "description": "The snobs invade mid-Polk \n\nTake a bunch of snobby, shallow 20-something white kids from Pac Heights and put them in a bar that could be in any urban setting.\n\nAlthough the owners spend some cash on making the place \"upscale\", it misses the mark because it doesn't feel authentically San Francisco. A quick walk in here and you could be in downtown Denver, Phoenix, or any other generic U.S. city. Why? Because the overly dressed snobs pose and gawk at people (even laughing at people) as they sip on silly cocktails in a futile attempt to look cool. \n\nPlenty of fake blonds and attitude here if that's your thing.\n\nNO THANKS!", "author": "Ted K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-03", "description": "If you're enjoying a night on Polk Street this is a good place to start your night at. It gets really packed as the night goes on- hence why it is a good place to start. I came with a friend on a Saturday; we had no problem walking right in. The downstairs is smaller, we didn't really get to experience it since we went straight upstairs. The bartenders really know what they're doing. I don't know what she made us but it was delicious! The upstairs has a smaller bar, plenty of seating, a dance floor and VIP area. They do regulate how many people they let upstairs once the crowd rolls in so beware of going back and forth. I can't say whether they charge a cover but do note there is only ONE UNISEX BATHROOM.", "author": "Clarissa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-19", "description": "I thought it was worth taking the time to give Playland a review. In SF, everyone is always looking for a new place to hang out and Playland is definitely one of these places. It also has the potential to turn into the \"usual\" hang out spot. I like the vibe it gives off...it is club like upstairs and yet has a great lounge atmosphere. The bar downstairs is my favorite though - it is simple and yet fun to sit at and chat with your friends or the bartenders, who are friendly and sociable. Another plus, is the drinks!  The cocktails are crafty and creative! \n\nThey recently added another bar in the back lounge, called the James Polk Room. It's laid back with plenty of room to sit and the bartenders back there whip up all sorts of different cocktails based on your favorite spirit!", "author": "Yana N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-18", "description": "Came here for the first time last weekend and had a great time! The only thing I didn't like was that the boys were charged $5.. might deter my group from going in the future since other places are free. But I loved how big this place was! When I went to the restroom, i noticed a WHOLE back area completely unused with couches and tables! We hung out upstairs where there were two additional bars to the one downstairs, so there was never much of a wait at all. Everyone was dancing and they were playing great music (current EDM music) and we had so much fun!", "author": "Alexandra W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-17", "description": "The staff here is awesome. I can't even begin to describe what people have to face here. I do have to say that to have a dress code on a Friday night is outrageous. That said, you guys need to get your shit together.", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-09", "description": "Playland is one of the few bars with a dance floor that isn't overly sleazy. Besides top 40, they also play lots of old-school hip-hop tunes (my favorite)! It's been pleasantly packed out both times I've been and the drinks are strong yet reasonably priced. But beware the occasional hordes of Jersey Shore-type men, ahhh!!", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "Nice cozy decor and ambiance for clubbing or hanging out. Free cover before 10 pm on a Saturday night that I went. Go straight to 2nd floor if you want to let loose on the dance floor. Get a little crowded after 11pm but that is when all the fun begins. The drinks are fine to me since I am not a heavy drinker. I would love to come back in the future.", "author": "Edmund F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-04", "description": "I love this place! This place reminds me of my favorite college bar back in the day.  If you are looking for a great, wild time on Friday or Saturday, this is where you need to go.  Some highlights include: 1) great music and good DJ, 2) fast bartenders, 3)  plenty of bouncers to keep stuff in check, 4) good looking people.  If you need a place to party on the weekend, come here.", "author": "Hanni S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-11", "description": "The bouncers were really nice, even though we were being a pain in the ass :) \nThanks for being awesome!", "author": "Himani A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "Prolly the best bar we went to last night on polk. I like the bartenders outfit.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-07", "description": "So my Friends and I went bar hopping on polk and this is by far one of best places we visited. There is an upstairs and downstairs and either way you go you can't go wrong. This is a good place to go if your looking to socialize and have a beer or a drink and just be in the city life but not go to crazy. The bartenders are all attractive so that's never a bad thing. I went around 10pm, no cover which was great and the bouncer was fun as we waited in line which made the wait feel shorter than it actually was. We went straight upstairs since everyone looked to get stuck downstairs. It became a bit challenging to get upstairs since everyone was right by the bar but just be a bit forceful you'll get through. The drinks are reasonable but there is a $20 minimum on credit cards which sucks because that's all I use. The shots looked pretty small from what I'm used to seeing but I didn't get one so it maybe the same amount I just didn't try it. They have tv's showing music videos of all modern music which is fun since you get to sing along when you know the song. It looked like there was a small dance floor towards the end if you want to dance a bit. Overall I liked this place if your looking to hang out, people watch, dance a bit and just have a drink and not end up to sloppy.", "author": "Kevin Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-01", "description": "It gets really crowded during weekends, but is definitely a hot spot if you're looking to meet people. There's a bar on the street level and another one upstairs, along with a dancing floor. Music really depends by the DJ, so you might have good nights and not so good ones. It's a very nice addition to what Polk St. has to offer.", "author": "Steve E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-15", "description": "I used to walk by Kimo's every day.  I think it is safe to say that daily I would say to myself \"It is unlikely that I EVER walk through those doors no matter what the situation is\".  \nWell, they took down the \"Kimo's\" sign, hung one that said \"Playland\", I would also imagine they sterilized the place too, maybe twice, and that was enough to get me to walk in to have a beer or 4.  \nI was given a tour of the new upstairs lounge, it wasn't done yet, but I can imagine it will be a great place to spend some time.  The stage is a good size, two big TV's in the back, one at the bar.  Most likely a great place to watch some football.  The sound system is great, bar has a lot to offer.  The best part is they installed windows upstairs so you can look down onto Polk Street.  It will no longer be what was most likely a dark.....scary place.\nBottom line, the beer was cold, bar tenders were attentive, that's all I can really ask.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-10", "description": "I spoke with Playland's Manager, Chris, today and appreciate his prompt follow-up to my complaint about the excessive amount of iPhone theft that happens here. His customer service almost makes up for the lack of it I received from everyone else working that night. Thanks for the response, Chris.", "author": "Tori W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-01", "description": "Just discovered this place a few weeks ago and just fell in love. First, I like how clean this place is. The bartenders are hot, and I mean really hot and friendly. The owners are on the floor, making sure that the things are fine and everyone is enjoying their evening. Great drinks and great music. I was sold.", "author": "Felix G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-24", "description": "Good music. Bar downstairs, dance floor upstairs. Great for casual nights with friends. It can get a bit crowded upstairs, but that's probably because so many people love this place.", "author": "Lina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-22", "description": "Another great addition to the neighborhood.  While I don't like how the old bars are disappearing, I do like it when improvements make the hood look better.  Clean, courteous, not overpriced and easy on the eyes.  Playland is a great new option on the Polk St. hike.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-09", "description": "get rid of your $20 credit card minimum.  No other bars do it.  i guarantee you're NOT saving money with this policy...only creating a hassle for customers and your bartenders that have to find the card when people leave it.  THINK about whats good for the customer!", "author": "Mike K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-11", "description": "If you have a iPhone and want to get it stolen...come here! The music is great and the night was fun but on two separate occasions both me and my friend got our phones stolen out of our purses...Along with about 10 other girls in the same night. You would think the bar would try to do something or have additional security to control the situation but when we spoke to the bouncers about it they just laughed. Maybe it's an inside job? Regardless, you choose to go here don't bring you iPhone or keep it really close to you at all times.", "author": "Sarika G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-15", "description": "New bar on Polk that was much needed on this street... it's very modern and the upstairs portion is \"loungey\". It's two levels but actually feels more like two seperate bars - downstairs is smaller and more of a regular bar feel, upstairs is much larger with another bar and several couches and tables. There's also a small stage with two huge screens upstairs. The \"Playland\" connection was played up... by looking at the decor I would never get the theme park vibe. Regardless, this is a really nice place and I definitely plan to go back on a Friday or Saturday, seems like there will be a good crowd.", "author": "Gina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "Awesome place))) the bartender is amazing!! The drink that Inna made is probably the best one I've ever had in my life))) will be back soon.. Really soon", "author": "Marina K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-19", "description": "This bar sucks. it's too crowded and it's too small and too many people are upstairs and on the dance floor.  I could hardly walk and get a drink at the bar when I was there. I won't be back anytime soon.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-06", "description": "Small little dive bar.  Not a bad spot to meet a friend and have a drink....but definitely can't stay here too long.", "author": "Rishi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "Great bar to go out to and dance! The bartender Julia was really awesome and took care of us. It got a little too crowded towards the end of night so we decided to leave. Overall, great experience!", "author": "Elaine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-07", "description": "Playland is amazing!! two floors, two bars, dance space up top, no cover... very chill, upbeat, and good atmosphere for a bar. Not a typical dive bar in the city in that area. They also have great cocktails such as the yummy Strawberry Basil Martini...!! to die for :)", "author": "Kamilla N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-22", "description": "Came here with Friends on a Friday night, we had been meaning to check it out for quite some time. Got in smoothly, looks pretty cool, started a tab, getting loose...so far so good right? WRONG.  We were upstairs, had a table with great location. My friend goes downstairs to use the bathroom (only on the first floor) and there is a massive line just to get upstairs (I assume capacity issues). He tries to come back up and the bouncer says \"back of the line buddy\", He is shocked. He said I went to the bathroom , I have a table and a tab upstairs I literally just came down. He goes ya that's the policy, if you want to use the bathroom you have to get back in the line to get upstairs. He said it would be around 10-15 minutes. AMATEUR HOUR. I have never been anywhere with such a ridiculous policy. There are many things that I love about San Francisco and the west coast but when it comes to nightlife it really has it's head so far up its ass, in what world does such a policy make any sense? and if so how do you not have a bathroom on the second floor? You can't even get the cash together to put in one of those pathetic singles that SF is known for? Get real. This place sucks don't ever go.", "author": "Ben K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-23", "description": "Its a bar that wants to be a club...but they don't have the proper space, sound, or lighting. So its crowded and expensive like a club, but there's none of the upside. Worst of both worlds. Also, terrible top 40/hip hop/house mash up garbage. But you'll like it, because you have bad taste in music and just want to hear songs you know.  And crowded to the point of being hazardous is the only measurement you have of judging a good \"club\".  Meh... Oh yea, and good luck actually getting a drink.", "author": "Yan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-10", "description": "Solid selection of scotch, creative cocktails and relatively decent priced drinks overall. SUPER CUTE, friendly and experienced bar tenders. The upstairs Dance floor, 2 full bars, dance floor satellite bar and big HD tvs kind of bring a unique twist to your everyday cocktail lounge/dance scene. Good music, too.", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "Good place on Polk to go dancing to pop/top 40/electro.  Upstairs is pretty crowded.  Cover is $5 for dudes.", "author": "Matthew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-17", "description": "Looove the second floor! It's a dance floor with good music, lit-up floor, and great views!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-02", "description": "Upstairs has a great view of Polk street with floor to ceiling windows.  They have good drinks and a nice staff.  Couple of nice tv's to watch the game on and your good!  Lots of room upstairs too.", "author": "Shane B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "Jason was really great. He let us know exactly where the restroom was, and how to get there safely and have a fun time. Jason gave us good recommendations and good dressing tips.", "author": "Cayla P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "The bar is back open and I am looking forward to a manhattan with my favorite bartender.  Playland is a chill bar on Sun - Wed.  Big windows!!  On Thurs - Sat, it's chill till about 9ish and then it gets packed especially because of the music and the dance floor upstairs.   So you can chill and then go out, or you can chill and then join the party.  Either way, it's the place to go.", "author": "Enrico S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-09", "description": "Everything about this place seemed like an awesome place to go to from the outside: busy, good looking people and a good bar downstairs. But once you go upstairs to where the dancing and DJ are, it just went downhill for me. I might just be too old for this place but it not my thing with these 20 somethings being obnoxious and bumping in to me. However, the upside I definitely like the mix of music from hip hop, dance, top 40 to alternative - it was a nice change up. But that's about it!", "author": "LuLu M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "I've recently stopped drinking (it sucks that as you get older it takes longer to recover - I've decided it's not worth the time) and have been drinking boring things like orange juice or coke or water when at bars.  Imagine my delight in finding Marie at Playland.  The woman is a true mixologist.  She made me three different non-alcoholic drinks last night which were AMAZING.  I'd tell her one thing I liked (raspberries was the first, I think) and she would whip something up.  She'd test it, then add a little of this or that until it was, in her words, 'perfect'.  It was really something to watch - and drink.  Even if you drink, I'd say have her whip something up for you that isn't on a menu, or a known drink - you won't be disappointed.  I can't wait to see what she comes up with in the future - looks like I may become a regular (at least on the nights she works).  And guess what?  When there's no alcohol in a drink it's just as tasty and much cheaper!", "author": "Shelly R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "Playland, a hip, new bar remains at a strong standing in my list of top 5 bars to visit when cruising around polk street. Not only did the atmosphere hold a fun and exciting vibe, it also was very inviting, I almost didn't want to leave! I would have to thank not only atmosphere, but also the bar tender Jessica, who took wonderful care of me while I was there. Jessica was attentive and \"on the ball\" when it came to the drinks. She was friendly and a blast to chat with, she really has mastered her craft! \n\nWell done Playland!\nYou will be sure to see me in the next coming week! \n\nMolly", "author": "molly c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-28", "description": "Probably my favorite Polk street bar.", "author": "Ally T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "I don't go out that often but I always enjoy my evenings at Playland. The bartenders are friendly and the cocktails are great. Definitely  check it out if you're in the neighborhood.", "author": "Rena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-17", "description": "Super fun place! All the staff is really nice, the drinks are yummy, the music is really good and the crowed is pretty (but not obnoxious). Will definitely come back!", "author": "Vita V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-05", "description": "This place has great beer @ great prices. The bartenders are women and very friendly. It's all about happy hour. LAGUNITAS IPA $3/pint happyhour.", "author": "colin b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-12", "description": "Playland is an awesome place specially because of the bartender Natasha. She takes really good care of all the customers and is very quick i getting your drinks. She experiments with new drinks and they come out fantastic.\nI've been here on days she's not working and honestly it's a bit dull on those days, but still a great place to hang out and grab a few drinks with friends.\nOverall a fantastic place. Cheers!!!", "author": "Harry S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-22", "description": "The space is really great, the drinks are even better and Natasha our bartender is as awesome as it gets, trust me.", "author": "Theodore S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-10", "description": "I just moved to the Nob Hill area and came across Playland. I tried it out for happy hour and loved it. Great venue with a happening vibe right on the corner of Polk and Pine. Had a great conversation with the bartender Natasha who was very friendly, courteous, and exhibited great  customer service. I will definitely be making this place one of my regular spots", "author": "Walter W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "I've been here about 5 times now and it's always been super fun.  I've been here on either Friday or Saturday nights and their DJ's are usually awesome.  The top floor gets a little too hot and all the windows are completely steamed up by 10:30ish but it's still super fun.  You can always go downstairs or outside to cool down.  I recommend you try this place if you enjoy dancing!", "author": "Eugenia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-05", "description": "Great place to hang out with friends and grab a few drinks. Jessica is a rockstar behind the bar. Service is awesome and everyone is genuine and friendly, and the music is great.", "author": "Mag L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-01", "description": "Great cocktails, stumbling distance from my place, beautiful and charming female bartenders (all 10s except Natasha, who is a 10.5)...what else is there to say?  Playland is not the only bar I frequent, but it is my favorite bar in SF.  Please do not go here so I can have it all to myself.", "author": "Chris A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-06", "description": "came here on New Years day...the cocktails were over priced and it was waaaaay to hot inside...i didn't go upstairs...stood at the bar finished my drink and left. Won't be coming here again. Tragic Kimo's is gone....", "author": "SASHA B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-07", "description": "I was fortunate to be touring the Polk Street night scene with a veteran who knew about Playland.   This place sits on Polk Street in the heart of the fooding and drinking district.  In contrast to the neighboring bars, Playland has huge panoramic windows that give it a nice transparent feel.   A nice change from drinking in a windowless dive - of which there are numerous establishments to do just that nearby.   The bartenders appear to have been handpicked for, among other things, having well-conditioned hair - aesthetics are definitely important to the management.  Which fits with the well-groomed and appointment contemporary interior.  The lighting was nicely dim and well-planned.  As the evening went on, this place transitioned from a cheery loud crowd to almost a nightclub level of noise and activity.  The bartenders were super attentive, which on a busy night was very much appreciated.   Despite all the craze, they were constantly checking in and making sure we were good.  Great work, Playland bartenders - for that alone 5 stars! :-)", "author": "Jaydee B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-03", "description": "Douchey, B&T crowd...uppity, indifferent bouncers and bartenders....ridiculous wait time to get in AND to get upstairs once you're inside. Totally not worth it. Please...do yourself a favor, walk a block down, and go to Kozy Kar.", "author": "Kat M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-29", "description": "To be honest... I don't remember what occurred at Playland, but what does come to mind is Polk st. and a nice upstairs area. We got prime parking right outside and decided to mosey on in because the name was so appealing! Haha. Anyways, went upstairs and I was really impressed they had such a spacious upstairs with plenty of natural sunlight due to a million windows. I don't know what the crowd was like but that's because we were the only people upstairs which was nice....it was like a private party. Haha. Anyways my friends and I thoroughly enjoyed ourselves and would probably come here again.", "author": "Jackie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-27", "description": "ex-kimos and much better. polk street which i love is spotted with a ton of dive bars which adds to its appeal. but this nice new little is a great addtion to add some diversity. i hate going to mayes and vertigo on the weekend bc lets face it....if i wanted to see the marina crowd i would go to the marina.... this crowd isnt as marina-ey but a nice little change. there is music on top which is a plus but it is also super packed. me and my friends ordered drinks at two different ends of the bar and ended up getting different prices for drinks...but then also different sizes....so who knows. i would dif like to make this a great pre-game spot but not stay too long as it gets really hot upstairs.", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-16", "description": "Jessica was great! I wasn't drinking this particular day and went in playland for a refreshment and Jessica made me a stawberry and blackberry mix with a hint of mint that was exquisite. Thxx Jessica and props on the fresh ingredients playland!", "author": "mark n."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-24", "description": "the classic basic-douche bistro combo. two stars only because the bartenders upstairs were super nice. unfortunately there were a shorter, and especially compared with san francisco standards quite fat woman among the security staff who arrogantly demanded to take off my hat, and threatened to kick us out if it won't happen in a timely manner, aka immediately. despite of all the vibrating super basicness of the place and the fact it became so packed you couldn't barely move your elbow without hitting someone's back, head and foot simultaneously, we could even have a good time there, if the arrogant control freak short fat pointy haired security micromanager woman is not yelling us vehemently about the no-hat policy multiple times. i don't see any chance to show up nor to recommend to this place to anyone, maybe only to people who has no sense of reality at all after an utterly failed lobotomy.", "author": "Tamas K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-22", "description": "Went to check this out on their soft opening and the place looked beautiful. Bar staff was very cool and distinctly remember them from some bar (I can't remember which) that i have been too on occasion. I suppose that means I drink a little too often... Oh well, place was still way worth checking out.", "author": "Matty R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "Natasha is a great bartender. Great spot to grab some good drinks. Will be going there again for sure.", "author": "Sparsha A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-27", "description": "i came here tonight while it was slow with not that many people and it was awesome. i meet Natasha and she makes some really good drinks! also very sweet and awesome person to talk to. very nice vibe and you cant go wrong. defiantly a good place to go and enjoy the night. the bouncer at the door definitely really cool to sit and have a chat with. i would recommend going here for sure!  its worth the time to go to if you haven't gone", "author": "Timothy R."}
