{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "I think it's so amazing that some of the non Latina employees can fluently speak Spanish in order to communicate better with customers! I have also never had a problem here compared with other Popeyes locations. The chicken is always fresh!", "author": "Cheyenne H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-16", "description": "I mean the line was okay and the food was sorta fast compared to the others. However my order number was 134, but the guy was CLEARLY yelling \"144\" multiple time. Obviously, that's not my number so I didn't go up. On the third/ fourth time, he finally said my order and was like \"next time I'm giving this to someone else\". So I jokingly said \"you said 144 the entire time\". And he rudely answers \"no I said 134 the entire time\". Yea. Then he comes back to me and was like \"here's another 4\" or whatever but I couldn't hear him. He then just gave up talking to me. Just don't bother coming here if you want decently nice people working. They're rude and lies on the spot to be right.", "author": "Yaying L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-19", "description": "Three strikes you're out! I travel between five states and occasionally like to partake in a little Popeyes fried chicken. This one is the worst! I will be brief, I've been here three times not once have I had warm or hot chicken at all. Order wrong, poor service with limited communication abilities. But the two things I just can't negotiate on our cleanliness and security. Cleanliness, just look around. It is filthy! They seem OK with it too. As for security, twice I've been approached while sitting in the restaurant by street baggers, one of which had quite an aroma that almost made me lose my lunch. This one is the one you want to stay away from since you won't be able to find parking anyway.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-10", "description": "Last time when I had Popeyes was over 2 years ago, \nBetter than I expected.\n\nMash potato good\nCajun Fries was ok \nBiscuits just right \nChicken not bad, crispy outside", "author": "Mack A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-31", "description": "I don't really like fast-food but if I'm going to eat chicken then I would come here and I like the spicy crispy I love their fries n their biscuits,they're quick at taking your order but they're slow at giving your food.", "author": "Lizzie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-09", "description": "Overly Crowed small area always squished minimum room to move stand still and sit mainly customers kids bumping into me always give me no room whatsoever weird crazy people, idiots annoying teenagers adults messing around dislike everything.", "author": "Lorrie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "Great Popeyes location! Convienent, cheap, and delicious. Located right near the major bus stations. Definitely better than KFC, for those of you who are indecisive about which one is better :).", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-31", "description": "This chicken was much, much more enjoyable than its KFC equivalent.  This stuff tasted fresher (while still under a heat lamp- see photo) and I appreciated the ability to order a few pieces spicy and the rest regular in my combo bucket. \n\nThe potatoes were also delicious in comparison and would do well on their own I suppose also.  They were in a smaller bowl and the gravy was in with the potatoes.  \n\nGo Wednesday in the early evening if you can- no lines.  However it sounds like Tuesday is the day to go for deals.\n\nVery glad I finally tried Popeye's- I think there's one in Dixon and KFC is a bit depressing nowadays.", "author": "David B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-31", "description": "I'd actually never had Popeyes fried chicken before.\n\nBut Shark Week had just started, so naturally I needed something salty. \n\nNo, not the annual Discovery Channel series Shark Week...\n\nShark Week is \"that time of the month.\"\n\nYes, gentlemen, during Shark Week we ladies need certain things...& stat.  All diets, calorie counting, & regular preferences go out the window.  It's not our faults.  It's chemical.  \n\nIt's when otherwise normally conservative & even dainty diners turn into the most fervent.  Salty & sweet foods turn into the equivalent of a slab of meat to a lion.  Once I went through 3 candy bars in one sitting.  A Reese's, an Almond Joy, & a Kit Kat.  I'd never done that before or since, but so exemplifies the power of Shark Week.\n\nSo...\nNow you understand how & why I needed fried chicken.  And being that I've already had KFC of course, I'd been curious about Popeyes.  I just remembered that scene in the movie, The Devil's Advocate, when Charlize Theron is painting their new apartment...she's eating takeout from Popeyes.  \n\nIf it's good enough for an Al Pacino movie...\n\nSo off my man went to pick up some Popeyes fried chicken. \n\nThe verdict?  It was crispy.  It was spicy.  But I wasn't impressed.  It took care of my craving, but ultimately was underwhelming.  \n\nI'm thinking next Shark Week I'll stick w The Front Porch...\nOr a bag of Lay's.\n\n2 & 1/2 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "I seem to keep going back for the way the batter taste with flavor and crispy all come together.  Between this and KFC it's edging forward on my go-to comfort food.\nThis location does it well.", "author": "Drew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "How cool are Asian people speaking Spanish I think that's totally awesome! Excellent customer service. They don't even trip when you asked for extra sauce... my family has been coming here for years and we really love this place. Except for on Tuesdays one whole city is up in this tiny place lol jk jk", "author": "Sasha M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-23", "description": "Service is fast that's why my review is 3 stars. However, the chicken is too oily for me. The biscuit is pretty good but should eat it immediately while it's still hot. Same with the fries.", "author": "Angela F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "This place always rock'n! IN LA my fav spot was church's chicken. Here in SF and Bay Area is all Popeyes! They both are  awesome and amazing! Chicken done right!", "author": "IHeartMambo S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-19", "description": "Worst cashier even... no customer service at all. I bought a whole combo chicken and ask for  just one ranch sause. She told me i have to pay 25 cents and I don't have cash anymore!!  Seriously... she talks really rude. I should just use my creditcard for the 25 cents.. I won't go  on this store again!!! Hopeful they shut down soon!!", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-09", "description": "I went to this location about a week ago with a friend. The Asian man taking the order was rude and has no type of customer service skills what so ever. There was weed on the ground near the register while I had my kids with me. We ask if we could possibly get fresh batches of chicken instead of what had been sitting there. He said with an attitude it is fresh. After receiving our food we ask for sauce and we also seen that they charge .25 cent for sauce. We had no problem paying. Any way we asked for sauce he then said I didn't charge you then started at us like he wanted us to get out. We asked again he said louder I didn't charge you. My friend then said I know they cost twenty five cents a piece can we get sauce. He said again I didn't charge you the first time. After my friend said I know I will pay for them. Then he decided to ask which ones did we want I was disgusted honestly terrible customer service is just so upsetting these days attitudes given when one was not given to that person is just poor training and on the trainees end he's obviously not a good listener I don't know why they hire people like that.", "author": "Chow E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-27", "description": "Came here with a friend, and she ordered before me (we decided to pay separately). This older Asian woman took her order, and handed my friend's food to her immediately after paying. When it was my turn to order, I decided to get the exact same thing my friend got, thinking I would get the same fast service! But NO, she had me wait 20 minutes for the SAME EXACT ORDER my friend got in less than a minute! Wtf... Don't expect no 5 star service here. Food was okay nonetheless.", "author": "Leetamz A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "This place is excellent and very well managed! Food came out fast and the establishment was clean! I would highly recommend this place to everyone!", "author": "Josephine W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "Place is a zoo with crazy outer mission people. But $1.99 Tuesdays pretty good. Expect alittle wait.\nIts good to bring home or to a party.\n\n16 pieces chicken only- $20.49\nNo grilled. Only fried original and spicy.\nThey do offer fried seafood too.", "author": "PJ T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-06", "description": "Haven't been to this place for 15 years. Looks like it has been remodel since the last time i was here. Luckily came at a time where there wasnt a lot of people so it made the service go quick. First time i came back was couple months ago. Order the 16 pieces family pack which cost 37.51 total. Kinda of expensive but had a lot of food. Did half mild and half spicy at the time but we didnt know how spicy it was at the time. Other then the 16 pieces chickens, you had the biscuits plus 3 more side orders which i got the cole shaw, fries, and mash potatoes.\n\nThen came back again yesterday but order 8 pieces family pack. Only difference from the 16 piece family pack is they give you one side other than the biscuits. Decided to get all spicy since the spicy had more flavor than the mild and it isnt that spicy from the time my family went here couple months ago. Service was quick since my family only order spicy. \n\nThe chicken here is good. Definitely come back whenever my family crave for their chicken again", "author": "Julie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-07", "description": "I had this for lunch today and besides the impending heart disease, it was sooooooo awesome. \n\nBut really you're charging me a quarter for your delectable sweet heat sauce when I just spent $10 bucks on chicken?\n\nAnyway Popeyes spicy is some of my favorite fried chicken of all time--including fancy restaurants that charge 4X the price. So I will pay the damn quarter for sweet heat.", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Best fast food place in my neighborhood. The whole family enjoys the food. This location is kinda small but the quality of food and service is great.", "author": "Hasan A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-16", "description": "Really!!! This is the most greedy Popeye's I have been at. Why you might ask?  They charge for a bag! If I was to say no and only carry what I could buy, you wouldn't make much in sales, because I can't carry a large order.", "author": "Alyce D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-11", "description": "Chicken, fish, red beans and rice, Cajun fries, mashed potatoes are all great. I can't complain about any of those things.\n\nPrices = moderate. \n\nService = NOT attentive. Or they just don't give a rat's ass. Fix your customer service. NOW. \n\nEvery time I order, I say I do NOT want the biscuit. Yes, I'll pay for it (dinner or combo, since I like the sides) so you can KEEP IT. They always give me the effin' biscuit, and I end up THROWING it out.  Listen to your PAYING customer. How hard is that??!  \n\nThis location has the worst biscuits. Discoloration on the bottom of the biscuit from the metal pan. I do not want that, ever! (No, it's not burnt.) Go AWAY.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-15", "description": "I have to pay to use the bathroom.... Are you freaking insane?!?\n\n\nThx for bringing me to the point of almost pissing in your corner. I'll be sure to do that next time I stop in.", "author": "Trevor B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "I love popeyes, the chicken is amazing, words cannot even describe how delish the mashed potatoes are!! Kai is the best server, he gets slammed with a line and whenever i have a huge order he always does his best to accommodate me, \nI love going here! even though parking is a HUGE PAIN IN THE TUSH.\nIts worth it to come eat the delishishness food! :) \nthank you kai and the geneva popeye team for making wonderful food,\nbtw if you are lucky to get the cherry pie u should DEFINITELY SWOOP ON THAT AS SOON AS POSSIBLE!!  u will NOT REGRET IT!", "author": "Emily J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-08", "description": "$1.69 for:\n-1 small mashed potatoes with cajun gravy\n-1 small french fries\n-1 medium coke\nThe total came out to be $5.07 before tax. With the $0.43 sales tax added in, the total is $5.50 which is not bad.\n\nI like the Cajun Spice in their mashed potatoes and fries. The boldness of this flavor brings out a delicious meal. Their fried chicken have the spicy flavor to it as well. The boldness of spice in their foods does get a bit intense at certain times. I like their original and spicy flavored fried chicken, french fries, mashed potatoes with cajun gravy, biscuit and chicken nuggets. These are some of the items I've had when I eat at Popeyes.\n\nThere are seats for only about 10-20 people.\n\n01/27/2015:\nThe Tuesday Leg & Thigh Special is a bargain, it's delicious and not greasy. Definitely one of the best restaurants for satisfying those fried chicken cravings.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-23", "description": "If I could give negative stars I would. The lack of professionalism and customer service is embarrassing. Employees telling customers they don't care how long they wait and throwing cups at them. This is a sad establishment.", "author": "Ron M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-10", "description": "The first time I came to this popeyes my boyfriend and I got halfway through the line before a man told us he didnt like the look of my boyfriend and started threatening us. We ignored him up til the point he announced he was going to get his gun, at that point I figured we should probably leave. Shitty experience, but hey, this is san francisco, harassment occurs everywhere. Yesterday I got a craving for popcorn shrimp so I went back to get some while my boyfriend was in walgreens. While I was in line three guys came up to me and started rubbing against me. I asked them to back off and they just laughed. The tallest one then kept trying to touch me and I didn't know what to do, my phone was dead and everyone was acting like it wasnt happening. The guys then told me the were going to cut me up and fuck me right in front of the cashiers, who refused to make eye contact with me. As soon as my boyfriend arrived, I just left without getting my food. \nI work in the tenderloin. I'm used to getting harassed by people. But that shit was ridiculous, there needs to be a security guard or something in there, there's no damned excuse for continuing to allow that type of thing to happen there. It's hard to judge a place on it's food when you can't even get through the goddamned line without having someone threaten to murder you.", "author": "Cate E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-25", "description": "I must say I like popeyes way more than KFC. Located on geneva and mission its usually quite busy making the wait a bit more than usual at times. \n\nSpicy chicken is usually really crispy and has a good amount of chicken meat rather than being filled with just batter. It tastes pretty well with their honey sauce.\n\nBiscuits are way better than KFC in that its less saltier and taste fresher and also goes well with a little bit of their honey sauce\n\nMy absolute favorite is their mac and cheese. It has a yummy cheesy taste to it that definitely beats KFC mac and cheese. This is a go to spot for a fast meal for on the go.", "author": "Joanne K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-03", "description": "$1.69 legs and thighs on Tuesday and line nearly out the door. Come early so the chicken is still fresh.  Service is just ok - don't expect to eat-in on Tuesdays. Sides (esp. Cajun fries) tend to be under seasoned and not fresh on Tuesdays. \n\nCame once when it isn't a Tuesday and the sides were still under seasoned.", "author": "Renee P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-10", "description": "Whenever I just want fried chicken, Popeyes is my go to. Maybe because it's so close to where I live. Forget the herbs and spices at KFC. The Louisiana spicy style is where it's at. Can't forget about that Cajun fries. Biscuit game could use some work.", "author": "David M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-10", "description": "Usually, employees at the Popeye's I've been to are typically nice, efficient, and welcoming . . . this location, not so much.\n\nTheir door was open prior to hours stated and an over-weight Asian man was eating chicken at a booth inside, I casually walked in and that person looks up and says in a rude tone, \"We're not open, leave!\"\n\nWhen I made a complaint with the Manager, Pablo, instead of listening to my constructive criticism, he talked over me, flipped the situation to make me look like the \"bad guy\" and then refused service after I asked for their corporate number to make a formal complaint.\n\nSo, I made a formal complaint with their corporate office, and they agreed that is not how you conduct operations; mind you, I am an operations manager for a major corporation.\n\nI can see why I don't usually eat at Popeye's, and it's unfortunate that this experience may have me never returning to one again.", "author": "Shane S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-20", "description": "Super wack, more than 10 mins until closing and they didn't want to cook more chicken and/or bad planning on cooking enough for the last batch. I understand workers gotta close up shop but don't advertise you're open until 10pm but have no product to sell to your loyal customers. Especially, when you got hella customers trying to buy it. Yea I understand they been working all day and are especially busy on a Tuesday but the company created that frenzy and the customers are not to blame. They got to understand that people will come even at the last minute before closing because they get off work late and are hungry. This is a working class neighborhood and many of them, similarly to me, walked to get there! So Weak! Don't get me wrong, DEFINITELY no knock on the workers because the work HARD! Bad management or bad policies and business practices on Corporate Popeyes is what it is!!!", "author": "Glenn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-26", "description": "This is your run of the mill Popeye's that is super busy since it is on the intersection of two busy streets (Mission and Geneva). It is NUTS on Tuesday so avoid it.  On Tuesday they have 2 pieces legs and thighs for 99c. There are very few tables so don't plan on eating there on Tuesdays.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-09", "description": "Can you say ghetto? I would not advise ordering your meal \"for here\". However, if you want take out, they have some damn good fried chicken here.\n\nThe Tuesday 2-pieces special is no longer $.99 cents. It's $1.29 now but it's still a good deal for a leg and a thigh (no limit per person). The line gets pretty long on Tuesdays (esp. after 6pm) but it does move faster than it looks.\n\nTheir fried apple pies are not bad. They have cinnamon sugar coated on the outside and are $.99 each but KFC's taste better and I believe it's a bit cheaper too. \n\nNot a fan of their cajun rice but love their mashed potato with cajun gravy (it's not as spicy as it sounds). The gravy has pieces of meat in it. Totally my kind of gravy.\n\nI will be back on Tuesdays for take out.", "author": "Andy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-28", "description": "One of the best fried chicken places in SF.\nI also love their side dishes options like red beans and rice, mashed potatoes and gravy, etc. better that KFC.\n\nFor those who don't know, Popeye's also sells frozen Cajun turkeys during the holidays (special order). I bought one some time ago for the Thanksgiving holiday and it came out moist and tasting great!", "author": "Luis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-07", "description": "Better fried chicken than KFC and it's cheaper too. I get my usual 10 piece mixed chicken and I'm all set. Best time to come here is around noon on Sundays because there is no line.\n\nI came here on a Tuesday once and never again will I wait in line for the two piece deal again. It was like waiting in line for a free movie screening. The two piece deal is a steal but it's not worth the wait.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-07", "description": "Hello I just went to popeyes, to get the deal on 11 piece for 13.99. Which seems like an OK deal, and I like popeyes. But I didn't know that they also had the 2 piece for 1.99 which brings way more customers then usual. I was skeptical in buying some because normally the chicken would be less than normal warm or not even Luke warm. The cashier that took my order was friendly hard to understand his English but I don't care as long as I got want I need, I'm ok. But as I told him my order a specifically said I want the chicken that is coming right out of the fryer,  I want freshly hot chicken and I'll wait for it and he said ok, I'll let them know. Bs, I get my order and go off my way, literally I was part almost right next to the store and when I open the box the chicken wasn't even hot not even warm. So I walked right back in there, I spoke to another cashier in Spanish too and explain to her that my chicken is warm. She calls her supervisor or who knows, but his the reason why I'm writing this, because how are you going to argue me down telling me that the chicken was extremely hot, I'm looking at him like really, touch the chicken I explained . How are you going to sell to me hot fries and hot mac n cheese but my chicken ain't even to the correct temperature of how hot the food should be severed and nope he argued me till he said you either take your chicken or get your money back, so I took my money back because I'm not paying for close to cold chicken . I kept the fries and the mac n cheese. And went up the street to Pollo supreme, which I got want I wanted hot chicken. No matter what kind of sale you have the food should be severed correctly ,", "author": "Cheryl B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-14", "description": "I got my favorites near home.  It's a good spot.  If I was on the bus it's even better.", "author": "Kev B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-26", "description": "Damn b*stards. Maybe the 6th time in my life where this location has given me an apple pie instead of the pie I ordered (strawberry/cherry/blueberry/etc). I am convinced it is a  scam on their end. Nobody orders the apple pies so they slip it in your order and pretend they made a mistake. Always check your pie before leaving!!", "author": "Mike J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-20", "description": "Two of my favorite things are Tuesdays and Fried Chicken.\n\nWhy?\n\nTuesdays are like my new Thursdays which makes Wednesdays a little like Fridays or as I like to call it fuzzy happy headache day.\nAs for the Fried Chicken, let's just say when made properly, it can conjure up some fond deep fried memories.\n\nNow combine the two and you have something special happening.\nSo what's so special about Tuesdays at Popeyes?\nA leg and thigh for 99 cents! ! !\n\nImagine all the crispy golden goodness you get for a mere $5.\n\nBe warned there maybe a line, but the highly trained professionals here have the crowd moving quickly.  Besides it's really worth the wait.\n\nOn a side note:\nWith no place to park, a two man team is a must: the driver circling the block while the other goes inside to grab the grub.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "It's depressing to say, but in the Excelsior outer mission area, this Popeye's is considered by many in the area and nearby surrounding areas as a 5-star restaurant for fried chicken/spicy soul food with the best prices - just note the long lines for the tuesday deals which includes every ethnicity in the area of asians, latinos, whites, in addition to blacks.  KFC on Silver Ave & Mission has had a reputation in the past (maybe better now since it seems to have improved in quality 2 days ago when I was there) as serving badly cooked raw or overcooked seemingly frozen old-tasting food for expensive prices and even their side dishes are much less quality-worthy than Popeye's, so there are longer lines for Popeye's than KFC even though they're both in high-traffic areas and both have Tuesday or other deals.  Other reviewers talk about how BIG the KFC chicken is, but how do they get that big??  Because of a super helping of antibiotics & hormones?? No thanks.   So the only reason I give it a 5-star is for those reasons. Popeye's is VERY tiny with very few tables so yes, I agree with another poster that you should get your food to go, especially during their deal days with fast but long lines and yes, parking is difficult in this high-traffic area.\n\nI would NOT go out my way to go here, but if you're in the area, this is the best/cheapest place to eat, especially for a large box of chicken & excellent sides(cajun rice, beans & rice, coleslaw, etc.) to feed a family or large number of people.", "author": "Frugal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "If it's not Tuesday, there isn't much of a wait for anything here. If you've had Popeye's before, it's pretty much the same here. I really don't like the shrimp here. There's just something about it that makes you feel like you're eating dog food. I don't recommend at all despite the price they always throw at your face on commercials.", "author": "George Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-31", "description": "The floors are sticky. The air feels greasy. The restaurant smells kind of funky inside...which is complemented by the sickly smell of urine outside. (What do you expect? It is San Francisco after all and it's right in front of a bus stop.) \n\nAll those factors aside, I will occasionally tolerate the grossness when I have a craving for my guilty pleasure/PMS combo of popcorn shrimp and Cajun fries. Everything tastes better slathered in tartar sauce. Their biscuits are so buttery, crumbly, and addictive. I could eat an obscene amount of those in one sitting. Their chicken is okay too. \n\nIf you come here, take your food to go. Sitting here to eat is depressing. The seats are dirty and the tables are sticky. Also, it's kind of weird eating right by the bright windows with people constantly walking by and looking at you. The corner where the tables are at is at a weird steep angle. I imagine it's like being in a human fishbowl with the huge clear slanted windows and the bright sunlight illuminating the heavily deep fried food, which will be clogging your arteries a mere milliseconds later. No regrets!", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-10", "description": "OMG SO GHETTTTTOOOOOOOOOOO!!!  Mix of the hood and mexico.\n\nBut it's fast food so what can you expect?  The cajun flavored mashed potatoes are so good and the chicken strips are decent.  I kinda wish the strips were thicker with more meat, since I felt like a few strips had so much batter on it I could barely make out any chicken.  \n\nDef take your friiieed chicken TO GO!", "author": "Liz W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-29", "description": "I've been to this location two or three times now. Service is always pretty quick, even when it's very crowded. Food comes out hot, tasty and never have had a mix up with the order. Minus one star though for horrible parking (or lack thereof). It's nearly impossible to find street parking within 3 blocks of this place or you have the option of illegally parking at the red curb out front (and possibly turning your Popeyes dinner into a $100+ meal), or come with someone who can hop out and order while you circle the area.", "author": "Amanda F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-20", "description": "1. Go on a Tuesday\n2. Wait in line\n3. Ignore homeless man asking for change.\n4. Get 3-8 orders of the Tuesday special.\n5. Eat delicious crispy chicken.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-10", "description": "If I could I would give this place a negative one I would, but considering popeyes has pretty good chicken and hot sauce it gets the one star. \n\nThis place is STRaIGHT up GHETTo!!! \nNo one cleans the tables which makes you feel like your eating in a pig stye.\n\nThere aren't that many places to sit and relax so it would be best to bring your food and go. It's location is right at the corner of Geneva and Mission in front of the 29bus stop... Therefore if I know this neighborhood you already know what I mean.. Ghetto hoodrat kids getting off the bus to get a cheap bite. \n\nNothing is filled such as the lids, straws, and napkins so you have to keep coming to the front to ask for things. \n\nI would much rather go to the Popeyes in San Bruno or the newest spot in Serramonte.", "author": "Maya W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-22", "description": "I ate here with a friend. It was the first time, he been to Popeyes. Let's me say, that this place does not that a drive-thru nor does it have much seating. It's seems like they block half of the store. The bathroom to the place seem to be block for some reason. It was really strange, anyways my friend was forced to use the bathroom across the street at the gas station because of this. The food we got were cheap, and it was pretty good. \n\nI got wicked chicken fingers with red beans and rice.", "author": "Ivy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-10", "description": "I would usually come here on a Tuesday because I would put Popeyes over KFC because it tastes better at Popeyes with the crunchy skin and they have spicy unlike KFC. I would not advise to eat in because you will get annoyed by people for change or the tables would be super dirty so I would just order to go. Minus one star because service here is pretty slow and the line is super slow.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-07", "description": "Fast food - love it and hate it. Love it because it's so delicious and cheap. Hate it because it makes me break out the next day. I'm not a big fan of food that sits under heat lamps all day long, but if I'm craving unhealthy food and near the neighborhood, Popeye's wins!\n\nI usually get an order of small fries for about $1.80, incl tax. I think the fries here are better than those at McDonald's (don't hate me if you disagree). They have that Cajun spice/seasoning added in for you, which gives Popeye's fries an extra oomph. I've also tried a Po'Boy with mild chicken. It was decent, but I'd prefer lettuce over cabbage, fresh moist bread over old dry stale bread, and possibly some sauce inside.\n\nSince this Popeye's is located on the corner of Mission and Geneva, be patient trying to squeeze into the crowd of people outside that are waiting for the MUNI. Also, sometimes it is so packed inside. Better get your meal to-go. You can smell the food across the street, but when you're close, you also smell urine from last night on the corners of the street. Eww.", "author": "Priscilla W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-06", "description": "I've always strayed away from this Popeye's because I thought it was a \"ghetto\" part of town. It's actually not too bad... at least I didn't think so since the sun was still up and shining.\n\nThe boyfriend and I had intentions to go to Battered Up right next door only to be disappointed in the end because Battered Up was closed due to a sell-out of food. EXTREME SAD FACE.\n\n\nI remember my friend telling me that Popeye's now had chicken nuggets for $1.99 so we settled with that. the chicken nuggets are TINY. I must say, the batter is crispy, but the pieces are almost half the size of a Mickey D's nugget. The rest of our 3-piece meal was satisfying (at least for me and my fried chicken craving). Can't really go wrong with Popeye's even with a heart set on corndogs.\n\n#1 nuggets still goes to McDonalds!!", "author": "Rosanne L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-08", "description": "I find it somewhat interesting that most of the Popeye's locations in the Sacramento region are located in ghetto spots of missed opportunities because one would have to drive to odd and remote locations to order their famous cajun style fried chicken.  That drive plus a bullet-proof vest.\r\n\r\nBut I am addicted to their soft, buttery, flaky and fluffy biscuits.  I usually pad it with artery clogging butter and drizzle a little honey before eating through 3 of them easily.\r\n\r\nMy sister usually orders the 12 piece, spicy, and have to confess, there have been times where the entire carload of people can't wait and a drumstick ends up devoured before we get home.  Popeye's is definitely not your local KFC.......the outer layer is crunchier and spicier, with more flavor.  \r\n\r\nDon't bother looking at the bottom of the box, because it will just depress you with the amount of congealed fat nodding at you in evil apprehension.", "author": "Miika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-15", "description": "this is the most delicious fried chicken spot i've ever been to.  I only go here for special occasions such as graduations, anniversaries, and child births.  I try not to go at night because there's this small-but aggressive man that insists i try new drugs.  once he gets control of your wrists, its hard to break free. \n\nthe jumbalaya is great, onion rings occasionally give me the runs, but the spicy chicken is awesome....coming in.. if you catch my drift... or smell it.", "author": "John A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-17", "description": "I love Popeyes. I am not overly fond of this location. Nothing against the staff or the food, just the location is on a very busy intersection.. alot of \"shady\" characters chill outside. This place makes a ton of money anyway tho, so it doesn't matter about who's around the area. Chicken is chicken! \n\nSo 4 stars for the spicy chicken strips, french fries, mashed potatoes and the YUMMY biscuits!", "author": "Alice E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-25", "description": "As a student at City College student, eating fried chicken at this Popeyes' is good choice. The Geneva area is rough and ghetto, I take-out. The spicy parts are more spicier than the Divisadero one. If you need a brick to break a window, the biscuit is not as good. \n\nPopeye's is a better than KFC by a landslide.\nPopeyes is from Louisiana,so support the Katrina victims and Popeyes in Louisiana.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-18", "description": "I would usually assume that when you order a chicken meal, it comes with gravy. But here it doesn't. So just heads up to order yours.\n\nI love the menu and their Tuesday specials of course. It's as cheap as it gets. The place is kinda tiny so I would prefer to get a to-go and just eat at home since we live close. The ambiance is not as good as other restaurants as it looks a little dirty for my liking.", "author": "Ira A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-12", "description": "When I get the urge for Popeyes Chicken, I drive to this location to buy some.  Parking is hard to find so I usually drop a friend off at the store and drive to Alemany Blvd. and park.  I never drive around to find a parking space.  My friend calls me on my cell phone and I pick her up.\n\nThe only criticism I might have about Popeyes is that the pieces are too small.  I've noticed that in comparison to KFC chicken, Popeyes chicken is smaller.  \n\nThat said, Popeyes Chicken is very popular with the people.  On Tuesdays, there is a line of people stretching from the front door down to the corner.  They are all waiting in line to get the 2 for $1.49 special.", "author": "Larry J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-30", "description": "This location is very bad... it's in the Corner Geneva Avenue and Mission. Right in front of the store is a bus stop, so the curb is painted red for those very long Muni Buses to stop. On top that, the stop light Geneva side turning right into mission no turn on Red light.  And no left turn except Muni buses... this is a very, very busy intersection. That is why this place is not ideal even for street parking. You would have to park and walk a block or two to get here.  The place is half the size of regular Popeye's I have been to.  I go here because it is the closest one for me. They do have Tuesday specials on chicken pieces and that is when there are so many people go there.  I like their chicken better than KFC (I'm closer to KFC than Popeye's) that is why I go here once every two or three months.", "author": "T D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-26", "description": "Leeme tell you that I live just a few blocks from KFC but I would rather drive my ass here than succumb to eat KF nasty/ taco bell blah.\n\nI come on their 2piece Tuesdays and buy a sh*t load of chicken. Leftovers baked in the oven for a couple minutes are just as good the next day.  Get some honey packets for the biscuits, the sweet and salty is yum. The sweet cane tea is pretty good- I don't like my teas overly sweet like the ones coming out of the soda machines.  Surprisingly their fish sandwich (catfish I think) is tasty.  And last but not least their mashed potatoes and gravy is good enough to rival the one my auntie makes for thanksgiving. Okok nothing rivals my autie's mash n gravy but popeye's is pretty darn good. \n\nFor a fast-food joint it deserves the 4 for feeding my family frugally with fabulously fried chicken.", "author": "Liz A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-23", "description": "I don't know..I rarely come here. The only time I eat here is when my sister or cousin buys chicken thighs and potatoe wedges and I leech off of them. The shop is really small and it's right in front of the bus stop. The location and store gives me this dirty feeling like the health inspector needs to come check this place out. \n\nBesides that, the potatoe wedges are great.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "Tends to always have a line. Good food but cashiers tend to have an attitude every time I go. Would still go back since it's the closest to me. As long as you don't mind the cashiers and a bit of a wait then head here!", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-10", "description": "Aww gyeah!  My whole office smells like fried chicken every Tuesday because we get the 2 pieces for .99 cent deal and bring it back to the office.  A few pieces of chicken and guaranteed you will want to take a nap.  There is always a line here on Tuesdays as that deal is too good to be true.  For a while I went to KFC on Tuesdays because they had the same deal, but KFC's extra crispy has nothing on Popeye's chicken.  \n\nThis gets four stars purely on the quality of the product.  The actual restaurant isn't especially clean and the service isn't as fantastic as their delicious chicken.  But I don't care... the chicken will have me coming back time and time again!", "author": "Herman L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-15", "description": "I love popeyes. I love mostly everything about popeyes. I love that it's fast food, and it's GOOD fast food. It's cheap, and amazing!\n\nI always get cajun fries when I come here. Doesn't matter what I'm getting, if I have control over whats being ordered, I'll have cajun fries. They're the best with ranch. You have to have them with ranch!! The nuggets are yummy too, sometimes the batter makes them sort of hard on the outside, but the chicken is decent for fast food. :)\n\nThe location of this popeyes is sort of ... ehh. I don't like it. I don't like coming here if I have to take the bus. Hell, I don't like coming here even by car. You know what though? Cravings are cravings. A plus, though, is that the workers here are SUPER friendly. They don't charge you extra for sauces. I remember that I was stuck on what I wanted to order quite a few times, and they were very patient with me!", "author": "Erica A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-19", "description": "Consistent good food. A little slow but worth the wait", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-18", "description": "Popeyes' chicken really speaks for itself.\n\nI just wanted to write a review because last night, I put sriracha sauce on Popeyes' chicken, and I think it's probably one of the best decisions I've ever made. \n\nI don't know why it never occurred to me before.\n\nThe way that the chili sauce seeped into the juicy, crispy skin...it's something else.", "author": "Julia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-13", "description": "just knock down a star due to the higher price ($1.29 now vs. 99 cent before) and smaller chicken on popeyes tuesday. overall it still a pretty good price for some fired chicken, also there haven't been much lines too. last time i was there was last tuesday i was in and out with under 5 minutes. your better off going over to kfc instead for $1.49 you get 2 pcs but the chicken is way bigger if you compare it but popeyes still taste better! im chinese...", "author": "JessePanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-15", "description": "been having sweet deals lately.\n\ngarlic shrimp box is gooood.\n\ncant go wrong with popeyes.", "author": "Vance T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-15", "description": "Popeyes Chicken & Biscuits should be awarded the Nobel Peace Prize.\nWhy you say? You will be surprised once you walk in and notice that their are customers of all races and age. They have the asians, the latinos, the blacks and the whites all for the common goal: Louisiana Fried Chicken. \n\nThe Tuesday Special 2 pieces legs and thighs for 99c has officially placed Popeyes over KFC. Their chicken is delicious. Skin is crunchy, meat is juicy and bill is cheap. Their fries are suspiciously good too. what ingredients do they use? I dont know. Maybe trans fat, maybe chipotle seasoning, maybe just salt and pepper. All I do know is they are a party in my mouth.\n\nThe only thing that might turn someone off to Popeyes is the fact that it is a little ghetto. But really ... Have you been to a Popeyes that is not ghetto? That being said, Popeyes deserve 5 star because The chicken taste great, sides are also great, its affordable to all, its close to the bus stop and of course last but not least, their asian employees speak fluent spanish. MUY BUENO!", "author": "Dorian T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-16", "description": "Come on...2 dollar Tuesdays is like my favorite day of the week after drag race Mondays!\n\nSometimes I tell my brain to look the other way while my stomach runs a muck. Get the spicy 2 piece because its 2 bucks and itstasty and way better than the K to the F to the C. Sorry but its true. Don't believe try driving down to Mission and Geneva and ask people what their in line for on a Tuesday. \n\nLittle know fact: There is a cashier at the restaurant that is Asian but knows fluent Spanish... amazing! Had a little heart to heart with him while I was waiting for my chicken. So that just tell its not just the Chicken its the people and partly the tasty chicken=)", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-23", "description": "I am 18 years old and today was my first day eating Popeyes. Don't laugh at me. I was deprived as a child.\n\nI came on a good day cause they had a promo. Two pieces (thigh and breast) of chicken for 99cents... what the heck?! Nice. My friend ordered the mild chicken instead of spicy. The mild tasted... like regular fried chicken. No heat factor. But I can't complain - it tasted a whole lot better than the fried chicken from KFC. Maybe it's all the oil and grease in the delicious skin.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-03", "description": "tuesday special. legs and thigh! \n\ncame here with my boyfriend during lunch hour on a tuesday afternoon. people are already forming lines including us. the line went by pretty quick and our legs and thigh came out fresh and yummy. \n\nseating wise is limited because this popeyes is compact, but all good in the neighborhood because our house was in a walking distance. \n\ncoolio!", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-17", "description": "My cats--Zoe and Little Guy--and I love Popeye's.  \n\nMy cat Zoe eats one breast mild (not spicy) without the skin every single day.  It keeps the flesh on her bones since she's a geriatric kitty (14-15 years). She runs up and down the hall, screaming for her chicken breast when I get home from work.  Woe to me if she doesn't get one.  Major meow-lashing.  So basically, she thinks she's Cleopatra and I peel her a chicken breast every day instead of a grape. OK, she wants more than that: Zoe wants it deboned, shredded, and on a plate--thank you very much.\n\nI live up the block from Popeye's so I'm there just about every single day ordering the breast, no biscuit.  We eat chicken from there too.\n\nSo far, Popeye's seems like the only fast food chicken place with real crispy skin that tastes good as opposed to that soggy spiced up garbage at KFC.  With KFC, it might as well have been sitting in the car on a hot day--it tastes that bad.\n\nWhen I was little and hardcore Chinese, I wondered why KFC--we called it Mustache Chicken on account of the Colonel having a mustache--was considered fried chicken.  My aunts bland fried chicken was better than theirs because at least the skin was crispy.  CRUNCH.\n\nPopeye's is consistently good.  The breast pieces are big. It doesn't taste greasy.  The sides are good.  I love the mash potatoes and gravy.  My husband loves the mac and cheese.  \n\nMy husband loves the little fried shrimps there.  He can eat three orders.\n\nI like Popeye's so much, I'm trying to work it into my South Beach diet.", "author": "Priscilla L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-27", "description": "I would sell my only daughter for Popeyes chicken. The biscuits are moist and flaky and every time I take a bite of Chicken in combo with mashed potatoes, I just about jizz in my pants.\n\nHowever, minus one star because I'd rather not get pistol whipped and robbed while ordering a 3-piece.", "author": "Alvin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-16", "description": "I love fried chicken....\n\nWhenever I need to fill my craving of Fried Chicken I come here..\n\nI eat about 5 pieces of chicken, 2 biscuits, and mashed potatoes.\n\nYea it sounds crazy...but I cant help it. My love for fried chicken is like Garfields love for lasagna.\n\nService is quick and somewhat friendly but I know when it gets busy they kind of change into a different mode whick makes the line move pretty quickly so I dont gotta wait forver for my food akakakaka...", "author": "phillip w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-25", "description": "He's Popeye the sailor man....\nHe lives in the garbage can....\nHe turned on the heater.....\nAnd burn-ed his wiener.....\nHe's Popeye the sailor maaaaaaan.\n\nThat song popped in my head every time someone mentions Popeye's Chicken...you see...as a kid, I was....DEPRIVED from fast food.  It was only a few years ago that I found out Popeye's has nothing to do with Spinach at all......it's all southern style fried chicken dooood!\n\nFreakin' SOUTHERN style fried chicken....with southern style mashed potatoes and gravy...with biscuits......thumbs up.\n\nAdd some Louisiana Hot Sauce....two thumbs up.  \n\nI love coming to his place cuz there once was a worker there that looks very close to a good friend of mine....same height, same ethnicity, same speech impairment.....but with a uni-brow!!!", "author": "Dave L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-13", "description": "Anyone who says that Popeye's is just OK has never had real fried chicken. To each his own. Peace and Love, but Popeye's is killer. One bite into a freshly fried crispy, but not overbreaded, Popeye's leg and beautiful steam rises out following by hot juices dripping gently over the edge that was left after the bite. KFC is more greazy chicken, which is right for certain occasions where you need to balance the alcohol poisoning with something else.\n\nThe red beans and rice could secretly replace any red bean and rice dish at a chic southern restaurant. I used to brave the serious, bullet proof glass ghetto Popeyes in Long Beach. Yes, folks, the Mutha F!@$in LBC. I love Popeye's. Now if they would only switch to non-trans fat oil, I would eat there every day!!", "author": "Claudia O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "LOVE their chicken!  It's always fresh, crisp, and never greasy.  I prefer Popeyes over KFC because their chicken isn't oily.  On the weekdays at 3 p.m. and 5 p.m. their lines are long.  Since this branch is small, expect to sit very close to other people when eating there.", "author": "Katrina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-07", "description": "I love Popeye's! It's friggin' fantastic! It really amazes me how diverse their employees are in that sense that all of them know Spanish. Seriously, my jaws practically dropped as after I order, two Asian girls behind the counter shout in Spanish. I am not even kidding you in the slightest bit. \n\nThey have the best biscuits and their sides are great. Usually, I end up eating only one or two pieces of chicken and destroying all of the sides, much to my family's chagrin -- oops. Their fried chicken is great too of course. I do hate how sometimes I'll get monster pieces and other times some weak pieces that are barely bigger than my fist. \n\nPopeye's beats KFC in the following in my opinion:\n1. Biscuits;\n2. Mashed potatoes with cajun gravy (although KFC's gravy kicks ass obviously);\n3. Fries.\n\nWatch out for the panhandlers and the annoying people waiting for the bus outside.", "author": "Rick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-31", "description": "You know you live in a ghetto when a Popeye moves into the neighborhood. All you have is folks begging for money outside, next to the smell of urine. \n\nInside isn't that clean, so if you actually do get some chicken, take it to go. The place isn't that big to sit around anyhow. The flavors are better than the usual KFC, a bit spicier.", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-16", "description": "if u don't like popeye's, it's cuz you can't handle popeye's. \n\n Hot, dark, spicy. bite down, batter cracks open, hot juices running down your chin and hand and onto your seat belt.  Hey whatchu looking at? ain't u ever seen someone suck a chicken leg before?  \n\nOK, watch the road, but wait, is that more skin on my thigh?  Crap, how'd I miss that.  I gotta remember to bring a towel in the car so I can eat.  Whoa, whoa, whoa, my hand is sliding all over the steering wheel.  oops. Sorry.  Eat another? Wait till home. oh oh um EAT!\n\nI tell you, it's worth the skitters, they're that good. possibly the best in the bay area (sorry all you serious restaurants, but, it's true).  Chicken Crack! Give me some!", "author": "Nini M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-21", "description": "Tuesdays - 2 pieces for 99 cents.\n\nLonggggggggggggg lines out the door!  I guess this is what happens when we are in a recession.  Every time I sit on the MUNI coming home from work, I can smell it... mmm...\n\nfried chicken and ketchup!", "author": "Elliot Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-29", "description": "I usually don't crave chicken of any sort, but I've been craving Popeyes every now and then for the past FEW MONTHS (and I STILL haven't had it!) I recall it being some GOOD chicken. But what I love is the SIDES! YUM! And I love sitting by the window seat on a somewhat sunny day, just looking outside. And I love how walking down with my friend from her house, she always tries to do this ARMLOCK thing with me so that we don't get \"robbed\". HAHA. Shes fckin hilarious! Parking super sucks ass here, so WALK if you're around the area. And its not likely you'll get robbed. Especially not during the day. Right???\n\nedit: 5/25 finally went to grab me a large cole slaw yesterday. It was yummy and crunchy. But I hate how their lids aren't as tight as KFC (paper vs. plastic). Now I'm craving their chicken..\n\nedit 5/31/08 Ok, so I came here and ordered the #11. Their chicken isn't THAT GREAT (but maybe cuz I'm not a fan of fried chicken anyway). But their BISCUITS.. almost out of this world. So yummy and buttery (no butter packets needed).", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-24", "description": "How come everytime I decide to come here, the containers for the sides (mash potatoes with gravy) keeps getting smaller?!\n\nGot the Bonafide Combo (5 piece of chicken, regular mash potatoes with gravy, biscuit, and drink) for $6.35, tax included. Had to wait about 10 minutes for it.\n\nThe only thing I loved was my mash potatoes with gravy - I will forever love the delicious taste of it.  All the others are no big deal.  The chicken pieces were smaller than I expected - think the size of McNuggets from McDonalds. Biscuit was good. I usually do not drink soda but I had to after eating the chicken since it was within reachable distance.\n\n2 stars for the ever-stomach-filling-mind-blowing mash potatoes with cajun gravy.", "author": "Joanna W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-19", "description": "Chicken and Biscuits... OH Yeah!!! Get it spicy add some honey.\n\nRed Beans and Rice...Oh Yeah!!!  Add some hot sauce.\n\nI don't what that mystery meat is in the gravy but gimme some.\n\nSorry Colonel they got you beat.\n\nWould get the big 5 stars but its fast food", "author": "Scotty B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-25", "description": "There's always a long line on Tuesday, i dropped by once for biscuit and fries when i was vegetarian, pretty good =) can be a sketchy area at night.", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-29", "description": "Tuesday's 2-piece chicken for 99 cents!!!\n\nCan't beat that with a bat.  I'm about to stock up for the week.", "author": "Ezduzit S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-19", "description": "I always get off from the MUNI right in front of this Popeyes.  Since they have some special going on every Tuesdays, the line easily spills out the door and around the corner to Mission St.  FYI:  This location is quite sketch (THE only reason for the minus one star); been harassed a number of times waiting for the bus in this immediate area, so as always, be aware of your surroundings!  \n\nTruthfully, in the 7 years I've lived around the area, I've probably been to it about 5-6 times.  I wish I could eat their chicken more often, but unfortunately due primarily to reason of not being so young anymore, I can't eat whatever the heck I want to whenever I wish.  How I miss them days. \n\nPopeyes Chicken is easily hands down, 10 times better than KFC's.  Seriously, it's not even worth arguing which is better; Popeyes is clearly the winner here.  Spicy chicken is OFF DA HOOK;)  Is it because they still use trans fat in their oil is why it's so good?  Whatever the reason is, this is the best fried chicken you can get your hands on, better than going to any fancy restaurant.\n\nMan, I wish I could go to Popeyes again soon, but due to aforementioned personal reasons, the next time I'll take a bite out of them juicy, spicy, hot, crunchy-battered fried chicken from Popeyes will be sometime towards the end of the year:(  Will be looking forward to that day. . .", "author": "Kahanalei M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-26", "description": "Oh man! I went on Tuesday for the Two Piece Tuesday and the line was so long that I didn't even get a leg nor a thigh and I even had exact change that would have been perfect!", "author": "Chrisp M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-04", "description": "Easily, the best of the best in the fast food chicken industry.  KFC and Churches have nothing on Popeye's.  Their side of Cajun Rice beats everything they got.  (Churches mac and cheese is WAY too GREASY & KFC doesn't even offer you rice!!) (I'M Asian!) \n\nTheir spicy fried chicken is simply awesome for a fast food joint.  Sure the price is just a bit more expensive then KFC but the quality surly makes up for the price.", "author": "Bernardo C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-08", "description": "Hands down better then the KFC.  Better outter crunchy layer, that is flaky not chunky lumpy as kfc, better seasonings, and inside is moist.  I think  KFC got their standard lower since I was little.  Their chicken is smaller and the seasoning is not as good as the Popeye.  This location's food taste better then the other ones.  \\. \nI have to confess I have completely abandon my kfc.  I was a loyal kfc-er since I was little but now that I have tasted Popeye.......", "author": "Mar H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-17", "description": "Went there one time when I was really hungry and came out disappointed...\n\nThe biscuits were too salty the the chicken was GREEEESSAYYY!!\n\nSmells good, but don't let that deceive you. \n\nHad this chicken before back in So-Cal and it sucked then just as it sucks now.\n\nTo tell you the truth I'm not even sure that even chicken at all??\n\nI don't know about you but I think I lost half-day of life just by eating this nasty stuff!\n\nGive me Pollo Loco any day!\n\nOh wait there is no Pollo Loco here in the City!\n\nDAMN!..........", "author": "Alberto L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-28", "description": "I definitely love Popeye's fried chicken, and this is probably the better of the SF locations. Still one drawback is that the entrance faces a busy bus stop which can draw less than stellar people. Last time I ate there someone came in asking for a dollar.", "author": "H K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-25", "description": "Extremely unhealthy, but my cravings lead me here sometimes. I try to avoid it!\n\nThey make pretty good fried chicken and these deep fried shrimp thingys and onion rings. Good BBQ sauce. This location is a bit small, rather dirty and right outside is a bus stop. This particular Popeyes is unpleasant to eat at because hobos love to make this their spot for the afternoon or the late night or whatever, and try to get you to give them money while you eat. But still, SOUL FOOOOD!", "author": "M J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-24", "description": "their $1 tuesdays are the bomb. \n\n(the fried chicken aint bad either)", "author": "Wendell M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-05", "description": "kiss my grits, popeyes freaking rocks. between a meal of spicy fried chicken and a biscuit from popeyes vs some foofoo, name only,bad service, pay out your ass joint, no contest. popeyes wins. \n\nive evolved my tastes over the years, but i wouldnt be able to live without popeyes.... seriously. just writing this got me all fiending. im leaving the office right now to get some.  you seee, little known secret....pssst though i grew up in sf, by birth, im a southern boy, born in kentucky. sshhh.\n\ndid you know the largest concentration of popeyes is in seoul, south korea? i believe theres over 270 locations in that ONE city. koreans the largest consumers of popeye. gyyeeahhh.", "author": "Euge L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-15", "description": "Sometimes I like to watch television and stuff my face with Popeye's spicy fried chicken. Then when the diet pill commercials come on, I laugh really hard, take another bite of the greasy goodness and spoon/spork mashed potatoes down my throat. Life is good and fattening. This particular Popeye's location is shaped funny and there are always rough people around no matter what time of day. Now stop making me feel guilty for eating fast food.", "author": "Evelyn B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-03", "description": "They lose a star for being a bit pricey for fast food, but that said, they ROCK.  Popeye's chicken is SOO durned crunchy and flavorful that I stop eating mid-chicken and think, \"Can it really be that good?\" Then I go back to eating.  The side options are much tastier than KFCs.  Just the fact that you can order rice is enough to make me a convert to the Cult of Popeye's.  Get your Popeye's on while waiting for the 43 Bus, really, it won't come while you're in line.", "author": "brenda b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-01", "description": "Good chicken, yummy and just enough grease.  I only had a drumstick today, but it was GOOD, crispy and fried on the outside, juicy and tender on the inside.  Could eat that stuff all day long.  The seasoned fries that my BF had were also, good, as were his spicy chicken strips.  I normally am not a big fan of spicy but this time it was good.  Parking there is a difficult and some of the people hanging out are sketchy but well worth the minor obstacles.  All in all, I enjoyed my food, though it isn't any better for me than KFC.  Sorry to those that swear by this place.  Maybe next time I'll like it better!!", "author": "Denise B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-15", "description": "our day seemed a bit rushed, and the lashing rain was delaying things even more. we had to be at the opera for 8pm, and my girlfriend was coming over to do my hair and makeup because she said she wanted me to look nice for my birthday date that my boyfriend was taking me to. i told her to bring her boyfriend and that we'd have dinner for them. it was nearing 5pm and i drove into the parking lot of lucky's, and asked my boyfriend if he really wanted to make his lamb chop and fish dinner spread. the thoughts of rushing and knowing that the dishes would be left until the morning didn't sound too appealing. i asked him what day it was, and he replied tuesday. i remembered driving by popeye's and seeing the thigh and leg deal sign for $0.99 on tuesdays, and suggested it to him. soon enough we were headed to the popeye's near our house. \n\nwe waited nearly half an hour to order and get our food. people do not take this deal lightly and queue up to get that hot chicken. we also got the mashed potatoes with cajun gravy, coleslaw, biscuits, and rice and beans. our couple friends were not disappointed when we told them we weren't cooking dinner and had bought popeyes instead. they actually drove by that popeyes and started to crave their chicken, so it was a win win situation. \n\ni don't think i will ever come on a tuesday. although the chicken is tasty, i don't have the patience to brace the line for cheap chicken.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-05", "description": "The only time I came here was a few months ago for the Tuesday special which is $.99 for 2 pieces of chicken (leg and a thigh). The line was pretty long but when I got to the front everything was fine. I gave the lady my card and she swiped it but reciept came out of her register. After that, she finds out there was no reciept paper so she puts a new one in and swipes my card again. I told her that she charged me twice and she said to check my bank account later on if she did. I went straight to my computer when i got home and found out that she did. I seriously came back and went to the front even though the line was long. Luckily, that sweet lady that was working next to her remembered me earlier and told her manager to give me a refund. He did and I was happy because I wasn't gonna go through with my bank just to get my money back. Hopefully they learn their lesson to check if they have receipt paper before swiping people's card.", "author": "Janice V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-12", "description": "This is one of the smaller Popeye's locations and maybe why it seems like the busiest.  There are like 20 major bus-lines that run through the intersection where this Popeye's is located (Mission & Geneva) so I really wouldn't recommend coming here during commute times.  I love the ambiance of this location with the great view of urban life (pigeons, pigeon droppings, humans, human droppings, etc.)  The quality of the chicken is pretty much consistent with the other locations.", "author": "Warren W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-09", "description": "Popeyes, you only deserve a three because you are a fast food joint, but your mashed potatoes sure taste good. I think it's the best store-bought mashed potato I have ever tasted! The spicy bonafide chicken is bonafide good in my book. :)", "author": "Helen Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-29", "description": "All of the KFC's by where I live have recently closed down so I decided that when I crave fried chicken I would go to popeye's.  I think their batter, while less flavorful, enhances the chicken flavor.  You also can't beat their Tuesday specials!  2 pieces of chicken for 0.99 cents!  I'd give four stars, but the last time I went I waited half an hour for the chicken because they said they ran out of the spicy kind.  Ultimately the forgot about my order and so I waited.  Pretty messed up if you ask me.  Also the crowd at this location is a little seedy if you know what i mean.", "author": "Jonathan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-04", "description": ".99 Tuesdays! What better way to get the week going but to have 2 pieces of delicious greasy chicken for .99. Tuesdays are crazy busy at any Popeyes location. Line will be out the door. First time I had the Tuesday special i got 8 pieces and a subsequent sore throat the next day. Haha! But you cant beat the price... I'm a sucker for deals!", "author": "jeff y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-15", "description": "CHICKEN! Just a place to get chicken. Nothing special but hey i love their french fries. Very friendly place, they allow you to trade for the family feasts. I always ask if i get trade drumsticks for wings or thighs and they never refused. I wouldn't eat there personally due to the less fortunate passing their stench.", "author": "Jonathan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-24", "description": "Way better than KFC.  I love their mashed potato and gravy with mystery bits in it.  The seasoning is also better then KFC's \"11 herbs and spices\", and has more of a kick.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-06", "description": "i love popeyes chicken, biscuits, red beans & rice, and their po' boys...but damn, parking near here is a bitch! and be careful whenever you try to drop someone off in front...it's a bus stop/red zone, and i've seen plenty of people get ticketed here...\n\noh and p.s. - get their ready to cook turkeys near thanksgiving...hella good!", "author": "Ray R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-22", "description": "mmm fried chicken... i like kfc and have only had church's once and it was good too :)\n\nwhen i lived out in that part of town, i'd stop by here on my way home from school and get some tasty chicken.\nit's a pretty shady location though... lots of goofy people hanging around", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-25", "description": "At times Popeyes can be alot better than KFC but being at popeye's can be very uncomfortable because of the patrons there.  I took the bus from the bus stop right in front of it and an onion came in from the window and nearly hit me in the face.  I had peices of onion over me next thing I know there is almost a gang fight cause i guess people that were supposed to be hit by the onion ran out of the bus to chase the thrower", "author": "Stevezee C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-22", "description": "Hate the location! The chicken tends to be on the salty and oily side! But what piece of fired chicken isn't???!! One star for their canjun rice and the mystery meat in it.  :0", "author": "La C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-24", "description": "If you ever go to KFC again (despite reasons of laziness which are completely understandable), after going to this place I'm not sure that we can be friends, or at least can never eat fried chicken together... Popeye's makes my mouth water when I say it, and the biscuits make sure to get a couple of biscuits, because they are better than any biscuit I've ever made!", "author": "Cassie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-31", "description": "I really like the chicken a lot. I always try to avoid this place on tuesdays (unless I'm super broke), because the place is always mad busy because of the 99 cent deal. I usually go for the chicken tenders combo with mashed potatoes and a biscuit. The chicken is just spicy enough; it's not that kind of spicy where all you can taste is the fact that it's hot. The chicken is juicy and never seems to be that mushy franken-chicken you get at other fast food places. The potatoes are good too; they aren't real salty and never have too much or too little gravy. The service here is usually pretty decent . I usually get the same cashier, who is very polite and never tries to rush you even though there might be people behind you in line.  I know it's out of the way for some, but, for me in the Excelsior, it's just perfect! I'll go back for some tasty chicken for sure, in fact I might get some right now!", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-18", "description": "I love this place for their spicy chicken and biscuts. I don't care for the cole slaw.Well, their corn on a stick is good too. I won't go out of my way for this place tho.", "author": "bob k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-07", "description": "good food good flavor many specials good flavor, tuesday good deal reminded me of new orleans", "author": "Leigh McInnis Lee G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-14", "description": "dirty and ghetto as hell, but i doubt you're paying attention to the decor as you clog your arteries with the best chain-restaurant-chicken available", "author": "Charles C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-30", "description": "yummy as always. they have the good hot sauce here, unlike some of the locations that dont have it.", "author": "Beach L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-06", "description": "It's two blocks away from my house XD lol I don't go here often, though. I'm not a very big fan of fast food, but their chicken is pretty good ^_^", "author": "Cindy W."}
