{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "I absolutely love the people working here...very personable, kind and helpful. I stop by at least once a week to get my freeze addiction satisfied.\n\nSome freezes are better than others... I recommend the chocolate and coconut flavors. \n\nIf you have any questions, they are always willing to give you samples!\n\nJuices are decent too....just stay clear of the apple ginger one unless you really, really like ginger!", "author": "Kristy O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-01", "description": "Since it was Friday, my office decided to do shots. Not the usual alcohol ones (though I wish it was the usual happy hour drinks), but juice shots. A coworker ran over to Pressed Juicery on October 19th around 1:30pm.\n\nAlmost everyone did a wellness shot, but since I was tired AF, I decided to do a Kona Espresso Shot: kona espresso, filtered water. Now I like my coffee strong and typically hot, so I found this rather weak. The chilled factor didn't help as it made it taste a little watery. Still, it was easy to drink and did the job. It kept me awake.\n\nI've never been big on juice, but their shots are okay. Not sure how effective juicing is in the long run, but once in a while I don't mind doing a shot. Balanced out with the usual HH one of course!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "After being treated like shit at the first street location by the non helpful guy, I walked to the Westfield mall location to see if I'd have better luck picking up juices as an active member. \n\nNelly is so helpful, nice and knowledgeable. I always look for her when coming each week because she is so great. I love pressed juices and Pressed Juicery has great taste and great pricing! \n\nThanks nelly for turning around my experience with Pressed Juicery", "author": "Marilyn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Love the greens 3. Just the right amount of sweet. Tried the ginger lemon cayenne drink for the first time. So good! Y'all are making magic in your juicers.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-21", "description": "9/20/18\n\nFirst time at this location \n\nLOCATED - At the food court in Westfield Mall. \n\nPROMOTION - At the time of this review, 4 for $24 for non members. For Pressed Juicery members, it is 4 for $20... I don't know why it's 4 for $20 when Pressed Juicery members already get 1 bottle for $5!\n\nORDER - I order my usual Greens, Citrus, and Almond since I'm a Pressed Juicery member. I ordered my first Greens and the guy at the counter says he only has 2 bottles of the Greens 1. I originally wanted 4 bottles for my cleanse, but I said 2 of the Greens 1 is fine for now. Next drink, Greens 2 and he tells me they are completely out of it. Really? Greens 1 is gone because I have taken the last 2 bottles and now Greens 2? He suggested another Greens, but I didn't want that one. \n\nI believe there is only 2 mini fridges at this Pressed Juicery. Why is the stock limited and not stocked up like the other Pressed Juicery's? This should be one of the busiest locations because this mall was packed for a Thursday afternoon. Well, I said to the guy no thanks and left. \n\n1 Star for this small location and their stock of juices. \n\nIf this is the closest Pressed to you then give them a call ahead of time to see what they have in stock and place an order for pick up. I won't be coming back to this one anytime soon since I was just visiting the area.", "author": "Norm L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "We don't have Joe and the juice in OC... so yay pretty cool! Very enjoyable and also love the high ceiling. \nI ordered green shield. Lovely color combo of the green juice and the pink logo sticker. :)", "author": "Anna K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-07", "description": "I'll be honest, I'm pretty new to juicing and the only reason why I tried this place is because of my best friend who's super into health. I like the fact that for someone who is not as familiar to juicing as myself, this place tends to make you feel comfortable in a way. The person working there asked me what favors I like and let me try their popular ones as well as favors that I didn't think will be good. I must have sampled half of the menu before getting to the favor I like. What I like about the experience was that they allowed you to sample all of it rather than buying each one and seeing if you like it. Considering how much a bottle cost, $5 dollars for members and $6.50 for non-members, it is great that they let you sample all of it before you buy a bottle. Would I continue to pay $5 dollars a bottle? Probably not, but I will definitely get into juicing myself after having tried it. Definitely a must try for someone who isn't into eating veggies and fruits like me (I know they are good for me but meat is so much better!)", "author": "Chenny O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "Love this Pressed Juicery for the personable service. They're very knowledgeable, honest, and helpful if you don't know what to order. My friend was very curious about juice cleanses and the cashier was honest and said she'd done two, but wasn't a fan because she just gained the water weight back later.\n\nGreat juice (it is pricey) and also their soft serves. Good for walking around the mall or for getting after a workout class.", "author": "Lizzie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "I needed something cold to drink with no added sugar.\nI got the chocolate almond drink at Pressed Juicery in Westfield Mall (bottom floor)\n\nIngredients:\n\n1. filtered water (I really like that it's filtered)\n2. almonds\n3. dates\n4. cacao (cocoa, cacao, what?)\n5. sea salt\n\n\nI don't buy drinks with 'spring water' because that means nothing as far as water quality. Filtered water is preferable over spring water.\n\nI thought it would be blended right then but it was pre-bottled. \nShe said they're made fresh every day, and it did taste fresh.\nIt was very good. I'd get another. \nIt's hard to find something healthy in the mall so i was pretty happy.", "author": "Lame Lake Meese Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-24", "description": "Had a rose lemonade and strawberry Apple lime... Wife selection of unique flavors.  But I can't say I really enjoyed it.  Maybe I'm too simple and I'm not the target market.  Couldn't find the value there... I'd prefer bubble tea.", "author": "William L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "First Pressed Juicery I've been to! I was in NY when they had the $5 anniversary promo going on but I didn take advantage of it because I was stuffed from NY foods. \n\nSo the first day back from my trip, I was hungry and walking around the mall when I saw Pressed Juicery! I was so excited. \n\nI head over and was glad to see they still had their promo going on. They offered me samples of each flavor but I only wanted to try the matcha. I like how everything here is an healthier alternative. They also told me about the promo going on. \n\nI got a matcha freeze with honey and almonds. I loved it! Since the freezes are vegan, it was perfect for my lactose self. It was good and I didn't feel guilty eating it at all! \n\nI will be back again to try their juices!", "author": "Yi Xian R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "It was frssha and nice and I liked the juice you have to get the froyo it is so good and it's my fave", "author": "Britney C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-12", "description": "Honestly, the chocolate freeze is so amazing. The reason 4/5 is because the workers are always so clueless and unhelpful. The pressed juice membership is also so stingy and snobby. We are already here buying the overpriced freeze and juice, you wanna charge an extra $1 every time we want a topping now too? Too bad it tastes so dang good.", "author": "Mariam P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "I have done many of my own juice cleanses before but I really wanted to try pre-made juices. I heard some good things about Pressed and decided to give it a try today.\n\nIt is honestly refreshing to see a juice bar in the middle of a mall food court. The line was super long and it was clear many return customers were there. The long line of loyal returnees was being managed by CJ. Who was both running the register, preparing freezes, and giving great customer service the entire time. \n\nBy the time it was my turn CJ apologized for my long wait and quickly got my cleanse kit together. I will return to this location because of the great service I received.\n\nI am starting the cleanse tomorrow so I will do update on the juice flavors.", "author": "Enjoli N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-20", "description": "Great juices I love to use of natural fresh fruit. Azing place to go and relax after a hard Day's work.", "author": "Delvin D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "Everytime I come to this location they barely have anything in stock and the employees always act so clueless when I ask them questions. Plus they never ask if I'm a member.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "I have always loved this location ever since i started college in San Francisco. If you have any questions the employees are warm and welcome questions!\n\nThat being said, if you are visiting during a rush hour say like lunch time then it might not be the best time to get your questions answered as they like to be fast and efficient. \n\nI love it! I grab one before i go into the bart station.", "author": "Nathalie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-10", "description": "I've been to other Pressed locations before and loved my experience but something about being in the basement of a mall food court took away from the experience.\n\nThe $10+ pre-bottled beverages sitting in a fridge in plain view with clear separation wasn't the most tempting but I was intrigued by their fruit freeze (all fruit fro-yo, basically) options. I wanted the large green freeze but when I tried to order from the empty counter the girl told me it's a watery flavor and doesn't come out well but she could give it a try to check on the consistency.\n\nShe didn't have much optimism and to be honest, paying $7 for a thing that seems like has a kamikaze style consistency didn't sound that great but that was the only flavor that really sounded appealing to me. \n\nThe girl at the counter gave the freeze swirl a try and quickly turned around with a rather disgusted face stating it was still pretty leaky and watery. I was ready to walk away when she asked if I wanted to try their strawberry version, that she noted as being more popular.\n\nThe strawberry version sounded kind of boring to me but there was nothing else at the food court I was in the mood for so I tested it, it wasn't great but also wasn't terrible, and asked for a small with no toppings. The girl then turned around and asked if I wanted a small (my new size request) AND a large (my old size request), which seemed either very strange or the worst attempt ever at an upsell to a single person. \n\nIt was fine but not memorable or anything I'd crave again/go out of my way for... at least not in the basement of an indoor mall, but I could see myself being drawn to this again at a different more scenic outdoor location on a nice day.", "author": "Candice G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-01", "description": "You'll notice I don't give one star reviews,  but I thought this one deserved it.  My first beef was they wanted to sell me a membership. Huh?  Otherwise the smallish bottle of pressed green stuff would cost me $6.50 instead of $5. I ask what I got for my membership and then the attitude started from the counter guy.  Lot's of attitude and a rude comment.  Last strike was the juice tasted old and wasn't very good. Here is a tip: walk over to Walgreens on Powell St and you can get twice the amount of fresh juice made to order for $5.", "author": "Mark E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-02", "description": "I would say don't try their almond butter strawberry ice-cream. The almond butter and strawberry were blended together. The ice-cream had a strawberry look but not a berry-like taste. I would say the whole thing tasted like pinky almond butter as a whole. Also, the big strawberry chunks on the menu did not occur. What I got are tiny cubes of them.\n\nI spent $5!\n\nDon't waste your time there. Move on to the 2nd floor to Yopi or somewhere else. $5 deserves better.", "author": "HP C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-05", "description": "I've been to a few Pressed Juiceries and found that this is the most expensive out of the ones I've bought something from. At over $6 for a juice, and at a mall kiosk no less, you could really be getting better and bigger cold pressed bottles from indie juiceries. \n\nTheir flavors are standard. I prefer the ones off of the Citrus menu, and my go-to is Citrus 2, which has pineapple, lemon, apple, and mint. The mint was especially strong this time, which was a nice, cool contrast to the otherwise apple-dominant drink.\n\nLast weekend, they were offering samples of the new pink and blue Vogue juices. The juice sample cups they have are waaaaay too small. You're not going to get a good taste of all of the ingredients in the terrifyingly neon juices, which wasn't a good incentive to buy the full size.\n\nWhen I stopped by, the service was pretty eh. To be fair, the only worker at the kiosk was also helping out someone who had ordered over two dozen juices for her office. That must be fairly common considering its location in Westfield and near so many offices, so I wonder why they didn't have some back-up.", "author": "Gwen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "I loveee raw cold pressed juices! Since I don't drink soda or coffee, every now and then I crave a healthy pick me up. Juicing is just not practical for my very busy life otherwise I'd say you can easily do this at home. \n\nStopped by on a whim for the first time and I was excited to try out their new freezes. They are made without preservatives! If you are new to Pressed Juicery, there are several types: Roots, fruits, greens, and some special blends that come bottled for on the go. They do juice cleanses as well!\n\nMy favorite is the Citrus 1 (pineapple, coconut water, aloe Vera, cucumber, and lemon) this drink is refreshing and hydrating...easy on the tastebuds. If you're looking for something more \"green\" the Greens 3 (Apple, celery, cucumber, ginger, kale, lemon, parsley, romaine, spinach) is drinkable enough for me with all the good stuff. I love this for when I need to get these nutrients in my diet for the day! The juices here are not cheap but for the health factor and convenience I would totally subscribe to getting these drinks delivered to me if the price wasn't so high. \n\nMinus one star for the hit and miss service because when I walked up the staff were not paying attention to me and about three other people who were standing at the counter waiting to be helped. The lady that did end up helping me was eccentric and happy to be there! \n\nI hope that Pressed Juicery will expand their business to more cities.", "author": "Heena W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "CJ (the manager) was super nice and helpful, a few of the selections I wanted were sold out, so he offered me great substitutes at a deal. Trust me, I didn't know I'd write a Yelp review for a juice bar either ¯\\_(ツ)_/¯.", "author": "Thomas S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-18", "description": "I've heard about pressed juice a while ago and decided to look up places within the city that had some. But since I was always busy with school, I never really found time to actually go out and look. So one day when I saw the stand at Westfield one day, I was stoked to try it out.\n\nPros:\n- They provide many different concoctions of pressed juices, each with different ingredients that are meant to provide your body with different health benefits apparently. \n- They have juices that are green-based, fruit-based, and a mix of both.\n- Surprisingly, the prices at this kiosk were decent in comparison to other places I've heard some range from $9-$12, but this place priced their drinks at $6.50\n- It's in the mall, so if you find yourself wanting something that doesn't have the added ingredients, then this place is the place for you.\n- They categorize the drinks, which i find pretty neat but yeah.\n\nCons:\n- The service is a hit or miss. There were two workers working that day and while one was attentive and helpful. the other one was in their own world doing something else. \n- While the price is decent, the ingredients are pretty simple.. so simple that I could probably just make my own pressed juice at home for half the price.\n- The drink had some weird thick consistency, but i put it off as it being part of the fruits in the drink.\n\nI opted for two fruity drinks, which both had pineapple. I enjoyed the pineapple, mint, ginger, and pear one since i'm an avid fan of ginger. The other drink had similar ingredients, except it also had lemon and apple in substitution for ginger and pear. That drink had a weird consistency to it. \n\nIn conclusion, it's nice to try, but I don't think I'd come often.", "author": "Jerianne G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-20", "description": "Unprofessional outta ingredients most of the time. They should train in Noe Valley. Seriously, put these girls to work. The one girl with the glasses is rude never going back to this location", "author": "Sasha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-30", "description": "Came here yesterday for my Pressed Juicery fixed. I lived in Santa Monica and went to their Santa Monica and Westwood location.\nProblem about this location is the location. It's located in Westfield mall. I wasn't planning to come to the mall so I went out of my way to find parking and make my way to the bottom floor of the mall to get my juice. Wish this location was located off a main street.", "author": "Jewelyn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-16", "description": "There's several Pressed Juiceries in the city...maybe 5. I decided to try a juice here today finally. I love juice. I am juice fanatic. If there's any sweet juice or juicy soda on the shelf at Safeway or 7-11 Whole Foods Trader Joe's, I've probably had 80% of what's out there. I do not always feel like indulging in juice from juice bars because it's an expensive habit. From Jan. 1-Jan. 16(today), Pressed Juicery offered their drinks for $5 a pop. That is a good deal. They should just sell them at $5. Might fly off the shelves better. I had the apple lemon ginger cayenne and it wasn't very good. It had too much ginger-ness. I would try other flavors sometime..unless they were all too weird..I just want my old fashioned ice tea or lemonade...Well I'm glad they had a $5 sale, but these drinks are too expensive to form a habit. I'd rather go to Walgreen's to get a sweet drink fix.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-27", "description": "Was doing a liquid only diet for the week and found this place.  Was as advertised, Juice.  I thought they would be made while I wait but they were already premade.  Tasted fine a little expensive for my taste.  They kept fine and I drank them the next day.", "author": "CJ A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "One of my favorite juice places!! Definitely pricey, but I love the juices here - especially the ones with ginger and lemon in them. Really gives you a good kick and makes you feel good:) \n\nMy favorites are the specialty blends (coconut, brazil nut, and almond ones are all good) and Roots 1!", "author": "Caley Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Usually there is no line, but for some reason at he time I wanted to get it (like 4 pm on a Thursday) there was a line. The wait took FOREVER because there was one lady working there and she had trouble getting the chocolate sauce out. \n\nThe soft serve, however, is a must get! The chocolate and vanilla are the best by far. Simple ingredients and a great taste.", "author": "Emily X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-27", "description": "I tried to like these juices. I really did. In act, I tried the 3-day juice cleanse after extensive research and talks with some of the staff at this kiosk in the mall. Let's just say I could barely get through the first day. I knew these were earthy drinks, but this took earthy to a new level. I've had other fresh, pressed juices that had better quality and taste than these drinks.\n\nThe earthy taste started to change my taste buds, then really make me hate juice in general and want a nice, juicy salad (or maybe that was the start of starvation). Either way, there's no beating the taste of these drinks. I think I still have memories of the taste in my mouth...and I try to suppress those memories. But I digress...\n\nLikes:\n-good intention??? I really cannot stomach the taste of these drinks\n\nDislikes:\n-the taste\n-pricey for the quality", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-26", "description": "My friend asked about the ice-cream and was treated condescending by Alexis who rudely said its not yogurt which is dairy, its non-dairy ice cream. He tried the chocolate ice cream almond milk sample and would have bought more but the salty service ruined his taste buds.", "author": "CJ C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-30", "description": "I love pressed juicery but Pooja ruined my experience. Stingey with soft serve  and she's rude and unfriendly.", "author": "Jenna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "Love the expanded location now that Pressed has moved from the Nordstrom side to the Bloomingdale's food court. Love the prices too...I'm a juice fiend but $11 for juice from some of the other shops makes me totally cray. I'm addicted to Citrus 2 (Apple, Lemon, Pineapple, Mint) but they have plenty of green juices too. \n\nExtra props for the gal who always seems to be there during the day. She's super friendly, efficient, and generally just makes my day (sorry, I don't know your name but you were there yesterday at 3 and you rock!).\n\nDon't forget to sign up for the loyalty program!", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "So it's late and I went into my fridge after waking up since I felt thirsty. I forgot that I had a few drink that I bought earlier at the Pressed Juicery in the mall. Then I remembered the poor guy who seems to always be by himself. However, he never ever seems down, upset, or rushed about it. His name is Isaac and he always serves me (always a coincidence but I'm ok with it). Every time I go to the mall to get my Pressed fix, he's always there. No matter if it's madly busy or very slow, he always greets me with a smile and a positive mood that comes off as genuine. That makes me feel more at home and at ease with being in a hectic place like the mall. I say all these good things about his service in particular because I used to serve in retail and I know how SUPER stressful it can be. Yet, he is always very kind and very genuine about making sure that we (the customers) are all taken care of (which was something he actually told me). \n\nNot only is his service great, but the juices (especially Citrus 2 and the rose lemonade) are super yummy. A bit pricy but what can you do? Besides, they taste great. So definitely worth the money. Their Freezes are okay too, but I'm always here for the juices and the always great service I get. I know I'm going on and on. Maybe it's just because it's late and my mind feels like talking. \n\nRegardless, if you're in Westfield Mall and see Pressed Juicery, don't pass by it. Stop in. The line might be crazy and a little unorganized, but with the tasty flavors they have from both the drinks and fro-yo's it's definitely worth the wait. Just be sure to have Isaac serve you. He's super nice and part of the reason as to why I come back to this one and not the other ones around SF.", "author": "Ericka R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-29", "description": "For $6.50 a bottle, I was expecting something a little more life-changing. Pressed has been all the rage lately, especially on Tumblr. Of course, I bought into the hype and shelled out a pretty penny for some ick-colored juice. I got the Greens 3, which is supposed to be one of their most popular flavors. \n\nIt tasted very vegetable-infused, with an extra kick added by the ginger. I think it's time for me to retire from these drinks. If you look at the nutrition label, there's a hefty amount of sugar in them, and mine tasted kind of watered down. The people behind the counter know these juices inside and out, but that doesn't make up for the lackluster taste. This is probably the equivalent of blasphemy to some, but I think I'd rather spend those six dollars on a Jamba Juice.", "author": "Sophie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-23", "description": "The freezes here are always super runny and watery. They taste more like slush vs a creamy yogurt like at the other locations. I think you guys should look into adjusting your machines or training the staff on how to get the consistency right.", "author": "Lindsay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-01", "description": "I had wonderful service tonight at Pressed.  The employees at Pressed are always friendly but tonight was my first time at this location and, upon approaching the counter, one female employee was helping another customer and the other male employee was doing something else, but seemed busy.  When he noticed me in his peripheral, he quickly stopped what he was doing and came to help me.  He was so friendly, quick and efficient.  I didn't have to tell him I have a membership, he asked.  He even reached past my pile of hot mess (my jacket, backpack chaos in my sweaty, hurried, work-to-class transition) and grabbed my little sample cup to dispose of it.  I didn't get his name but he was working this evening (Tuesday) when I stopped by around 5:45 and he was super awesome. \n\nOh and if you haven't had the apple ginger lemon cayenne juice at Pressed, it will knock out anything you might be catching.  I have had so many juices and wellness shots, I mean I work in the FiDi for crying out loud, there's practically cold pressed juice coming out of the faucets, but THIS one is the ticket - I promise.\n\nAlso, I have noticed a few reviewers balking at the $6.50 price tag.  Um HELLO?  Have you ever paid $14 for a juice?  I do it like almost every time.  Where are y'all getting juices for less than $6.50?", "author": "Emma H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-03", "description": "Love pressed juice freeze. My favorite treat to get but Alexis (one of their employees) couldn't have been ruder to me and my mother. 0 customer service. Made our freezes especially small and honestly was bafflingly rude. Management should think twice.", "author": "Nikki R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "Giving them five stars for the overall service that the store manager CJ gave me. I was highly curious on starting a three day juice cleanse for the new year. I had a lot of questions and CJ was able to help answer all of them and didn't make me feel rushed or bothered. He gave valid suggestions on flavors and even convinced me I should give it try! I left without any juices to do more research and compare other cleanses. The next day I called the store, he remembered me and had the juiced packed and ready for my pick up later on that day! As this was my first juice cleanse he helped tremendously with what to expect.  I also go to this location often as it is the most convenient for me. Thank you Cj for your help! I will be doing more juice cleanses in the future, but for now I just choose and buy my favorite juices as all the flavors are pretty awesome!", "author": "Andria B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "I've been coming to this location for a while and as it's the New Year, time to do a juice cleanse.  It's $39.50 for 6 juices of your choice of they have recommendations depending on it it's your first time, detox, or experienced.  If it's your first time you will get juices that have more calories and less calories for experienced.  Some of my favorites are the Greens or Beets.", "author": "James H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-27", "description": "What a horrible place to put a pressed juicery! Knowing that each customer will sample a few juices, it'll be chaotic especially in an already busy Westfield.\n\nI waited for service while others were being helped. When it was my turn, Valerie seemed very careless about her service. Also she decided to service some other gentlemen at the same time but actually spent her time over there. Not once did she come back after giving me one sample. As an eager pressed fanatic, it was very disappointing to the point where I just left. Valerie should really learn some customer service skills.\n\nOther than the horrible service I received, I do actually like their variety of juices. Typically all their employees are wonderful to talk to. I guess I will just go to my local Pressed next time.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "I finally feel that I have strong reason to write a full review after doing a day cleanse with their juices. Now many people do juice cleanses for different reasons whether it's to detox, jumpstart clean eating again, etc. I personally decided to try a one day cleanse during the week leading up to my half marathon. I made sure I picked a day where I wouldn't be training or any crazy physical activity since I knew my energy would be lower than usual. Their day cleanse currently is $40 which includes 6 bottles plus two waters, which I found to be a great deal\n\nI was assisted by a very helpful worker, Michael, who seemed to enjoy helping me customize my 6 bottles. I told him I was looking for what would help me re-energize, detox and hydrate the most. I chose 1 citrus, 2 greens, 2 roots, and the chocolate almond for the signature blend which is meant to be taken as the last bottle. \n\nThis was my first cleanse every so I was a little worried of how much I'd have withdrawls of actually chewing food or if I'd get hungry. It was definitely tough (esp being on IG and scrolling through people's delicious looking lunches), but the juices actually kept me content throughout the day. I didn't feel any fatigue, I think the chlorophyll h2o helped with that. My favorites were the citrus and greens. The roots has a more earthy taste to it and I don't recommend the one with cayenne and carrots, the taste was too strong for my liking. The chocolate almond at the end of the day was certainly a treat! I downed that one easily, it tasted just like a protein shake\n\nDo expect making trips to the bathroom more frequently than usual. The most I went was probably 3 times within an hour haha and it's also important to be drinking regular water throughout the day to help with the hydration and for me it was just good to wash everything down.\n\nNow for the real review of when I started feeling the benefits of it! I didn't wake up feeling all brolic and able to do 20 burpees or anything crazy. I did feel energized and awake first thing in the morning. I was back to solids but made sure my meals were clean for the day. I had egg cups with turkey, tomato, spinach and cheese for breakfast and tilapia with steamed veggies for lunch and at least 64 ounces of water throughout the day. When I went for my run after work, I felt amazing! I felt like I was gliding through my 5 miles, which usually takes me longer to get in the groove. There was no gross foods or any toxins in my body weighing me down, therefore I was able to pace myself easily.\n\nI'm glad I chose to do a day cleanse...3 days may be a little tough for me but I definitely recommend their juices here.", "author": "Georgina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-08", "description": "Fresh juice in the middle one of the busiest shopping centers in San Francisco - now that's good. Is it the best juice you've ever had? No, probably not; but its good and super convenient. And, they have a wide variety of juices that feature both fruit, veggie and combination flavors. The one draw-back, Pressed Juicery is bit on the pricey side and will easily set you back $10+ for a juice and a non-descript high fiber gluten-free bar thing. To make it a worthwhile financial visit - get the juice and they go back street side and step into the CVS for a bag of cashews and you've got a great (and less expensive) lunch or late afternoon \"help-me-make-it-to-my-late-night-dinner\" meeting.", "author": "Wayne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "The service here was really nice. The lady who served me (Michelle) was really nice and answered all of the questions I had. She was patient and very well informed and left me feeling a lot smarter than when I came in. She even let me try their ice cream which is super yummy just like the Pressed I have back home! Thank you Pressed Juicery!", "author": "Jasmine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-21", "description": "There are many juice and smoothie places popping up, but Pressed is some of the best stuff I've had so far.  Really good combinations of fruit and veggie juices...seriously natural lift without processed sugar or caffeine.\n\nI'm a big fan of green juices and smoothies, Pressed has 5 different versions, each with slightly different ingredients and flavor profiles.  We also tried one of the \"roots\" combos, wow blown away with this juice that combined beets, mint, ginger and apple.  The ginger made it tangy spicy, almost exciting to drink!", "author": "Tom S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "If you've given up dairy or desserts and are craving something sweet with a healthy slant then swing on by the mall to Pressed Juicery. Keep walking past the hypnotic smells of giant hot sugar topped pretzels and other aromatic lures - to reach Pressed Juicery's modest counter - conveniently located by BART.\n\nPressed Juicery's nuts milks are rich and decadent. The helpful staff at Pressed Juicery are also generous with free samples - if you're interested in trying them before you buy them. I recommend their classic Vanilla Almond milk which is sweetened with dates and has fresh vanilla bean in it - or their Brazil Nut drink which is unique - but oh so luxuriously what's up. It even has kale, romaine, and spinach in it.\n\nMy only advice in regards to Pressed Juicery's divine nut milks - is to not drink them in excess. Their Brazil Nut drink packs a heavy selenium punch and like the other almond drinks it is high in natural fats and calories. And though they're all naturally sweetened with dates - it never hurts to moderate your sugar intake.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-30", "description": "When I think of the words \"Burger\" and \"King\",\nI think of hamburgers and some dude in a crown.\nSure enough, Burger King on Powell has both.\n\nWhen I think of the words \"Chicken\" and \"Waffles\",\nI think of what cluck-clucks and what waff-waffs.\nWell, Gussie's Chicken & Waffles by Fillmore has 'em.\n\nWhen I think of the words \"Breaking\" and \"Bad\",\nI think of a bald dude x sidekick and yellow suits.\nWhaddya know - Jesse, we need to cook.\n\nWhen we get to the words \"Pressed\" and \"Juicery\",\nimagine fruits & veggies being crushed into liquid.\nIn the present tense. Right in front of you. Now.\n\nBut it's not. It's all pre-bottled and refrigerated.\nI'm not hating - I get that the kiosk lacks space.\nMust be part of why it's called PressED Juicery\nand not PressING or GONNAPress Juicery.\n\nLet me know when my minion #despicableme\n#beedobeedobeedo and I can throw the tarp over\nthe kiosk and make our OWN batch. #vamonospest", "author": "Dan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-15", "description": "The juice here is pretty good but service is horrible. I always order their \"Green 2\" juice and today they messed up the order and gave me Green 3. I'm not a fan of ginger which was in Green 3, so the minute I taste it I knew it was the wrong bottle. I asked them to exchange it since they gave me the wrong order but apparently it's open so it cannot be replace (the bottle is still full). Girl, YOU messed up my order.", "author": "Diana H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-16", "description": "I love the juice but the service here is not good the people that work there not friendly and can't be bothered . In the other location the employees we great always helpful and friendly", "author": "Richard W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-08", "description": "Something changed about this place. It use to be much better with customer service and supply of juices. Did they change a manager?  When I went today, most of the juices were sold out and the manager looking person was just sitting their playing on her phone. It was never like this before. Prior visits, I was always greeted promptly and all the juices were always available. I know they won't sell out that easily since it was only middle of the day and hardly any customer was there. They might as well be closed.", "author": "Erica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Their juices are tasty! It's in the Westfield mall center on the bottom floor- took a while to figure out!", "author": "Angie H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-26", "description": "Product - they're juice without the froth. Taste? Depends on your tastebuds, but they're pretty good (the greens 1 and 3 are, bleh, I don't consume a lot of greens like I'd like to). Fresh? We can never be too sure. My favorite of course is the fattening one and serves the opposite purpose of juicing, Vanilla Almond!!! It's amazing. Did not know you could juice almonds.\n\nService - The guys here are pretty friendly. The gentleman with the glasses was very engaging .However, there was a girl who I asked for the day 3 cleanse pack. The bottles have labels on them, the little pamphlets have the drinks labeled for which drink would be in which day cleanse (there were 3 of them, this was during a special deal). For some reason, I knew the girl would mess up and give me the wrong drink(s). Lo and behold, I was right - I got the Chocolate Almond instead of Vanilla Almond, and Chocolate Almond was disgusting. \n\nYou had one job, one job!!!!!!\nAnd you guys barely get people here!!!\n\n\nGetting my juice that I can see get juiced in front of me eyes from Jamba Juice...", "author": "Jae T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "Visiting from D.C.  So many choices. As a health nut I only want to put the best in my body. I watched the many customers that came by to help me decide. I ended up with a five pack.  All I can say is love love love all my veggie/fruit elixirs.", "author": "Nicole E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-20", "description": "I was walking at Westfield with Dave Chapelle and I motioned him over to Pressed Juicery for a bottle of that juice cleanse good good. Dave gave me a quizzical look and asked\n\n\"Whaaat? Homie WTF Is Juice? I want that grape drink.\"\n\nC'mon Dave. There ain't no vitamin in that stuff. This be juice, man. The real thing. No concentrate. Hella vitamins everywhere.\n\n\"But WTF Is Juice?!\"\n\nDave. Dave. Listen to me. They gather a bunch of organic fruits and vegetables and they squeeze the juice out of them and put them in a bottle. It's like eating pounds of fruits and veggies, but you don't even have to eat 'em. Here, the nice employee even offered you a sample.\n\n\"I ain't want no juice, I got my grape drink right here. Mmmm, it's purple.\"\n\nCONCLUSION\nFor $7 I got my bottle of Pressed Juicery with all its wonder and vitamins. For $6.50, Dave got himself a 12-pack of that Capri-Sun grape drink.\n\nTo each their own.", "author": "Ringo M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-10", "description": "The girl behind the counter didn't seem so happy to be there, but oh well I guess. When I made my decision, she seemed irritated I wanted to order. I asked for the Matcha Hemp Blend, which was on the menu displayed, but she said it was discontinued. I said that was a bummer, and she just stood there, and then walked away. I didn't end up getting anything.", "author": "Christopher T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-16", "description": "This is my second time coming here and both experiences have been amazing. I purchased two of their green veggie drinks and one of their citrus drinks-- all of them were bomb!\n\nOn top of that, the nice gentleman behind the counter spent at least 10 min telling me about all of the different juices, educating me accordingly :) he was also nice enough to let me try four different samples all while having a huge smile on his face! \n\nThe customer service here is great. The juices are great tasting and full of nutrients. The prices aren't bad, either. I'll be back soon!", "author": "Sylvia O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "It's not quite 100% organic or squeezed on location, but most juices are only $6.50 vs. the $9-$12 price point of most of the area's cold-pressed juices.\n\nEmployees are typically on their phone until approached, but with a deep corner location on the ground floor of the mall, what else do you expect them to do with their time when no one's around? They don't actually make juice to order here so their job responsibilities are pretty narrow. When I asked them about various blends, they were knowledgeable and plenty friendly.\n\nSo far, Greens 2 and Greens 5 are my favorites in the greens category (there's 6 total to choose from) and when it comes to the sweeter blends, I really enjoyed the Apple Strawberry Coconut and the dessert-like Coconut Cinnamon and the Vanilla Almond.\n\nGood stuff!", "author": "Jelena Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-28", "description": "Absolutely terrible experience. The cashier lied to us and said we would get 25% off our order. When she told us the final price , I pointed out that the total wasn't with 25% off. She said oh sorry I couldn't take it off. I told her not to ring me up then but since she already had my credit card, she ran it through anyway and then grabbed the receipt and threw it out instead of handing it to me and said have a good day!  The manager was incredibly rude and didn't understand why I would have a problem being lied to and then charged when I no longer wanted the product. We were all excited when a pressed juicery was opening in the mall, after this experience, we will take the trek down to the ferry building for a well managed pressed juicery.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-07", "description": "The Pressed Juicery kiosk in Westfield Mall is certainly convenient but still not one of my favorite juice dispensaries. I attend classes at the San Francisco State Downtown Campus so after emerging from a grotty BART ride, I like to grab a couple to tide me over. The good news is that the juices are always fresh, stored with utmost care (so the juice is chilled and palatable), and made quality produce. Bad news is that the staff I've come across are anti social to a fault and some of the elixirs don't warrant a $6 price tag for 16 oz.\n\nIf a sense of renewed vitality is the goal, I go for the Citrus 4, Greens 5, and Roots 1. I really like the marriage of aloe vera, cucumber, and pineapple in the Citrus 4. The Greens 5 is a bit different than your average sludge because the addition of fennel and orange give it a nice pop. The Roots 1 is a very earthy and robust combination of beets, carrots, and greens. If I'm looking for a sweet juice, I opt for the pineapple, pear, ginger, and mint. Definitely their best tasting combination I've tried thus far. Some of the other concoctions I've purchased were easy to drink in terms of consistency but hard to want to drink because of their overall flavor and after taste. \n\nMy main dig is that the customer service has been a downer every time I've made it to this Pressed Juicery location. First off, these employees look miserable. Upon my first visit, I asked for specific suggestions. The girl at the cash register basically grunted that the green 4 was popular and set down a menu on the counter in front me. Another time, a guy who rang me up never said a word. He acknowledged my presence with a nod, retrieved the juices I wanted, set them down, rang me up, and then just stood there. Not even letting me know how much I owed. Just staring off into space, totally mute, waiting for me to fork over some cash. The whole exchange was so awkward that I ended up going to Jamba Juice the next week to palette cleanse. \n\nIf you are close to Westfield Mall and wanting health conscious juice made with all natural ingredients, Pressed Juicery is the way to go but if you're hoping for service with a smile and clear answers to any questions you may have, you're likely to be disappointed.", "author": "Ruby G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "Super convenient Pressed counter location at Westfield Mall. Look for the counter on the first floor side entrance. I did the three-day cleanse (first timer). Each day includes 6 juices plus recommended 2 fortified waters. I found 6 juices to be a lot for one day. I usually got through 4-5 bottles at the most. Lost 3 lbs by the 3rd day...I'll take that!\n\nI like that you can pick your own mix of juices within the general guidelines they give you for the cleanse. Also like that you can pick the sweetness level of your juices (1 for low sugar content)...all the way up to 5 for more sugar). I'm a fan of the vanilla almond, beets 3, brazil nut, and rose water.\n\nCan be a bit pricey if doing a multi-day cleanse but I did feel refreshed afterwards. They do run a special for the one day cleanse ($45 for 6 juices). Have found they sometimes run out of popular flavors end of day at this location so I try to go earlier in the day if possible.", "author": "Michelle E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-01", "description": "This little kiosk is located right behind the Starbucks at the Powell mall entrance (next to Abercrombie & Fitch on the lower floor). \n\nI was never into the whole juice craze thing mainly bc juice is loaded with sugar, and lack fiber and protein. But I have been trying to get back into my regular healthy eating after eating out for consecutive celebrations, hang outs, vacation, etc. So I thought I'd try a 1 day \"cleanse\". \n\nWHAT I GOT:\n- Greens 1: Refreshing, light, definitely taste the celery (ok, recommend for morning)\n- Greens 3: Similar to Greens 1 but with an extra spicy ginger kick (meh)\n- Greens 5: My favorite one probably bc it's the sweetest one from the pineapple/orange and it's not celery/cucumber based (yum!)\n- Citrus 1: Tad sweet and citrusy, definitely taste the cucumber, pineapple helps a lot (not bad)\n- Roots 3: Damn, this one packs a punch. Really spicy and gingery. I had to chug this baby down. (recommend if you need a wake-me-up)\n\nYAYS:\n+ You do feel mentally healthier from drinking these. I can also say my GI system cleared up a bit.\n+ They have a bundle sale 5/$30 which saves you some pocket change. And if you sign up for their rewards program, you get 25% off your first purchase. \n+ Service was friendly. They know which items are more popular/good for beginners, so ask questions!\n\nNAYS:\n- These juices were rather bland. I was expecting a \"grass\" taste as opposed to the cucumber/celery taste that many of them carried.\n- Kiosk runs out of flavors easily and NO SAMPLES :((\n- Not organic\n\nTIPS:\n- Don't do a cleanse if you're feeling even a tad under the weather. Your body needs nutritious substance to fight off the infection. (I learned this the hard way.)\n- Be aware that each bottle only ranges 60-200 kcal (except the nut-based ones), so you will be starving your body - hence you may feel a little groggier than usual. \n\nTO CONCLUDE:\nNot sure if I'd drink these again even though they are more affordable than the other juice shops (ie Project Juice, Living Greens). Many of them include cucumber, celery or ginger, which I don't particularly like. However, I do want to try the nut-based drinks or the coffee drinks.", "author": "Ashley L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "The people who work here went above and beyond - which at 8:30 p.m. right before closing is notable indeed. Thanks! :D These stars are for you.\n\nThey were super nice in regards to helping me pick out juices, and letting me know about off-the-menu items, such as the activated charcoal / lemon / lavender blend, which I purchased - yay for detoxing the late-night msg I had last night (also worth it, in a different way).\n\nI generally stick to the hardworking non-sugary (even if it's fruit) drinks: Greens 1, Greens 1.5, Greens 4 (w/out apple) and once in awhile indulge in the Brazil Nut because it's just so good. \n\nVery easy location - right off of Powell BART / MUNI. Works.", "author": "Maria A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-29", "description": "As much as I enjoy the Greens 3 (containing kale, spinach, ginger, lemon, among other items), it's hard to justify paying $6.50 for a smallish bottle of non-organic juice that isn't made on-site.  I know $6.50 isn't much in the juicing world, but I'd rather pay a couple of dollars more to ensure that every veggie in there is organic.  \n\nAnd the less than friendly staff at this mall kiosk really aren't helping to change my opinion.", "author": "Joanne G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-09", "description": "Don't get me wrong, I love pressed juicery. The tagline says my scarlet letter is a starbucks gold card, but I tried the juices from the noe valley location once and I fell in love.  It's frightening to know that the drink I crave now is 4x more expensive that what it used to be. Oh well, San Francisco livin', right?\n\nOn to the review of this location, to echo the comments of my fellow reviewers, the employees here are not quite as friendly as the ones at the noe valley location. To be fair though, given the location, I get it. However, no points to the employees here for giving you death stares when asking to sample a new flavor, nor for the lack of knowledge of the different juices.\n\nThis rating, however, is specifically for the chocolate almond I purchased here that I assume had been toppled over sitting in their refrigerator for a bit too long.  I didn't notice this at first, but when I was done with the drink and miles away from the mall, I realized that the drink had settled, and formed a weird leathery, plastic-y thing on the side of the bottle.  Now, I get it. It's almond milk, it's pressed juice, it settles. But usually when I see this, you can just shake it and the separation goes away.  No chance here, this build up was solid.  Besides it just being a little gross, I have to wonder, is that where all the nutrients are? Did I really just pay $8 to not have all the nutrients this beverage claims to deliver? \n\nHowever, I looked pass the incident, as I realized maybe it was just an oversight on the staff's part.  I came back here again and purchased the same drink.  (The drink's good, what can I say.) Initially, I didn't see any thing awry with the drink, so I happily paid and continued with my shopping.  After a couple of sips though,  I noticed the same thing, but this time the built up sediment was floating around the drink.\n\nEven if it is natural, it's a bit disappointing to have chucks of something floating around what should be a smooth drink.  I have never experienced the same thing at the noe valley location, so it makes me feel that this is an indicator that products here just don't move as quickly. Not ideal.\n\nRegardless, I can't say I won't come back.  Like I mentioned at the beginning of my review, this place is my new addiction.  What I will say though, is that I will make every effort to avoid this location if I can.", "author": "Patricia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-22", "description": "Love Pressed Juicery, especially the convenience of it being located inside the mall. Perfect for when you need a boost of energy after some gruesome holiday shopping! My favorites are their Citrus 1 & 2, Vanilla Almond & Chocolate Almond!", "author": "Debra T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-16", "description": "Was kind of skeptical about going here after reading so many mixed reviews. But I had time to kill & really wanted to try some juices. I figured, if the employees were rude based off first impression, I'd probably just walk away. \n\nCame here on a Thursday afternoon, told one of the employees that I hadn't been to a Pressed Juicery before. She excitedly told me an overview of juices & asked what health benefits I was looking to get out of my experience. \n\nShe recommended a few juices that matches what I was looking for & gave me samples. Super satisfied with my overall experience & her recommendations. I ended up getting Greens 3 & Apple, strawberry, coconut. Greens 3 has a nice kick of ginger & is refreshing, and the Apple strawberry coconut juice is yummy for all you sweet tooth fans :)", "author": "Chelsea R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "I'm so glad I saw this place while strolling around Westfield. The girls here are so helpful and fun to chat with about the products. They offer samples and helpful advice on starting your first cleanse. Great customer service and juices are delicious! Some of my favor goes are greens 1-2 and the chocolate almond milk!", "author": "Lorraine S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-29", "description": "The price is a little high. Seven dollars for a juice. It tastes okay but I regret paying so much. It is healthy and I guess that is the price you have to pay. But there shop is adorable.", "author": "Micah L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-01", "description": "Love that there's a new juice spot in the mall, but wish the people working there were a little more knowledgable and helpful when it comes to picking a juice. I felt a little lost but in the end ordered what my gut instinct told me to and it was super yum. I work nearby and I think I'll be back before work or on my way home.", "author": "Chelsea P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-11", "description": "So, a few months later, I finally gave Pressed another shot. I decided to try something a bit sweeter, as the cucumber was overpowering on my last visit. I went for a Fruit one, the pineapple-pear-ginger-mint. \n\nTasty? Yes. Healthy? Questionable, as this one is pretty much all sugar (44 grams of it, to be precise). If you are health conscious, a green drink is the better bet, or at least one with less fruit and more veggies. I was really going for taste, and this one was pretty good. I loved the ginger kick. \n\nI still can't give this particular location a four, as the service is not very kind. There is no sincerity here. I had a free juice card, and as soon as the cashier saw it, he got really cold. I know that you aren't making a sale at that moment, but if you show a little kindness, maybe you would get repeat business. \n\nI am still not completely sold on this juice company, but I might visit their Ferry Building location and see if the service is better. At the end of the day, I am a sucker for organics, and I would rather pay the extra bucks for something USDA certified with that trusty stamp of approval.", "author": "Brandi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "I pass by this location enough that my interest was peaked\n\nthere has been some oddities like certain juices being discontinued but than that wasn't reflected on the menu on large and only the smaller one that they have on the counter..not knowing this because I was just ordering the same Juices I had about two weeks ago..the girl smartly told me that it wasn't available because that isn't the updated menu..okkkkkk\n\nI've brought the green 2 and apple/strawberrry/coconut; the green2 and the chocolate almond, the green 3 and chocolate almond and today when I was purchasing the green 2 the guy told me I'm halfway through my punch card (theirs is virtual by giving phone numbers)\n\nwhaaaa?\n\nisn't it buy 9 get 1 free?\n\nohhh\n\nbecause two of my purchases didn't get punched in or retained in the system even though I've given it every single time, and every single time I've declined a receipt to be more green.\n\nugh. \n\nnot really going to bother, there's other juice companies ++ options \n\nthe juice is good but not wow good, and definite not with the lackluster folks\n\nETA, thank you for the response", "author": "Whitne Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-25", "description": "Bad news: It may have \"coffee\" in the name, but the almond milk coffee tastes like nothing of the sort.\nGood news: The brazil nut milk may be green, but is really just a refreshing dairy-free vanilla milkshake in disguise.\n\nI was prepared to be unimpressed with these pricy drinks based on the financial investment alone, but the kale and spinach-infused brazil nut milk really is a delicious sweet treat. \n\nThe supposed health benefits make me feel like I've made a smart purchase for my long term health, but unfortunately in the short term, it seems to effect my energy levels much the same as a regular milkshake might. After powering up on a creamy blend, I hopped on the BART to hit the farmers market one stop away. (Yes, I could have walked, but I was already being so healthy with this drink choice so get off my back.) Suddenly I woke up an found myself at the airport. \n\nTrue story (mostly.)", "author": "Hannah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-21", "description": "This particular location is my first time trying the famed Pressed Juicery and I was definitely not let-down.\n\nI had just got off BART and needed a quick pick-me-up after being stuck in such a stuffy environment for forty minutes. I walked into Westfield and right at the front was the Pressed Juicery counter. The employees were super amicable and let me try as many samples as I wanted.\n\nI ended up choosing Greens 3 which I loved! It was super fresh and just what I needed, but if you're not into kale and spinach juices as I am, then you might be better off going with the Greens 5 (which is what my friend got). The juice was energizing and cleansing - perfect for a day out in the city right after getting off BART. The prices are quite reasonable too, so you won't break the bank trying to enjoy quality juices!", "author": "Trisha V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-07", "description": "This company has the best juice I have ever had. And they will let you taste any one of their juices. I bought one of their cleanses and they threw in an additional juice for me. Great business sense this company has.", "author": "Judy A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-27", "description": "So, why the bipolar reviews for the same company? Giving a 5 star review for their Palo Alto location and a 1.5 stars for this one? The service. Coming here a few times, I will probably never come here again. I go to school in Union Square and find it convenient that I can come get my juices after/between class. No. I'd rather drive farther to the Palo Alto location than deal with this. \n\n1) First time going, I was on the 2nd day of my juice cleanse and needed to buy the last 2 days. Stopped by. Homegirl working there had the most horrrrrrrrible attitude. Didn't know what she was talking about when I asked for certain benefits and what juices were good. Gave me crap for wanting to buy more than one juice as one full day is already 8 juices which means I had to choose 16 juices. Everytime I was trying to separate the juices I picked for each day into different rows to keep track, she kept mixing them up. excuse me, stop touching my juice. and worst part, when I got home, she put in almost 1/4 of them the wrong flavors. I asked for half of them to be greens 1.5 and she gave me all greens 1. \n\n2) A lot of the juices were out of stock. \n\n3) 3rd time I went, it was around 3-4 in the afternoon. No one was even working. I stood there for a few minutes looking at the menu/waiting for someone to help me. Nope. Not a single person was at the counter. It was completely empty. So I left and vowed to never come back. lol\n\n1.5/5 - 1 points for the juices being delicious. I still love Pressed Juicery, but I hate this branch. This is the only PJ I've been to that was like this. 0.5 for the girl labeling my juices. even though they were in the wrong order..... -_- ugh", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-06", "description": "Try my first cleansing because of a good promotional price. Get 1 day cleanse for only $39. It is a good deal,but the promotion will end on Jan 10.\n\nFor the service, like other yelpers said, it is not that good. I expect they have more knowledgable and experienced staff working there. It will be better if they assist me to choose what I want for the cleanse rather than letting me circle the cleanse I want on the paper. I took pretty much time to read and choose the flavors on the paper. The staff seem to be impatient. Besides, I registered my information when I came there last time. However, the staff said they can't find any record. But I am sure I registered last time with my phone number. Also, some flavors are out. \n\nThe stars are given to the great deal of the price.", "author": "Cynthia P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-17", "description": "Agree with the other less than five star reviews that the service here could use a revamp. I suspect since the kiosk is located right by one of the BART entrances in and out of the mall, the staff get a colorful assortment of foot traffic and plenty of crazies, so when the actual paying/interested customer comes by, they're kind of over it. Thankfully my coworkers picked up a pamphlet of the juice menu offerings and we pretty much know what we want, so as not to inundate the reps with questions. The menu is helpful in that the ingredients in every drink are listed, and there are options for single, 3-day, and 7-day juice cleanses as well as pricing for all. \n\nI think the location of the kiosk could be placed in a more centralized and brightly lit area of the mall. Where they are now is kind of easy to miss unless you enter or exit near that spot. However, they seem to be doing pretty decent business cause they frequently run out of stock (either that, or their replenishment is not too good).\n\nPricey - on average, one bottle of juice runs $6.50, but sometimes they have promotions like buy one get one free.", "author": "Elaine W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "I feel a hell of a lot more healthy now that I've jumped on the pressed juice kick! Yum.  Quality costs", "author": "Kyle H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-15", "description": "I still love the juices, even thought a few of my favorites are not longer being offered because they are not in season...even though I can buy blueberries at the grocery and farmers market...I also have seen no revision to their loyalty program, and yesterday was not rewarded two points after buying two separate juices. I have spent a total of $450 and still no free juice yet...I think they should adjust their \"loyalty program\" and give you 10% off of the juice cleanse one day program, or offer a real loyalty program.", "author": "K M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "Today was our first visit to pressed juicery ever and it must've been obvious. Frantz was the employee that helped us. I wanted to give him a shot out for his incredible customer service and patience. He was knowledgeable about the products and really was the main reason why I decided to get something after all. Great customer service goes a long way and he proves to be a great asset to the company. I ended up getting the vanilla almond coffee which was delicious even though it had a bit of a gritty finish going down. I can't wait to try the vanilla almond that we brought home with us. I would definitely come back again to explore some more.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-09", "description": "5 stars for the juice and convenient location inside the mall!\n\nService, on the hand, was lacking. There was one guy manning the counter on a Sunday afternoon. I approached him and asked him about the samples he was offering. He had no idea what they were. Then I asked for his opinion on which drink to get. Again, had no idea and just told me to pick whatever I wanted. He sure knows how to sell the product..... *rolls eyes* If I hadn't already heard about this company I would've walked away bc I was so turned off by the incompetent employee. The guy couldn't answer any of my questions and made me feel like I was bothering him.\n\nI much prefer the kiosk at the Ferry Building. They're much more friendly and knowledgeable.", "author": "Jane C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-08", "description": "I don't think I could ever really justify spending $6.50 on a bottle of juice but the girl working at the kiosk was super sweet and friendly. She offered us samples and suggested her favorite juices. Convenient location too.", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-14", "description": "Gabriella was a total sweetheart and walked me and my friends through so many options. She was very knowledgeable about the product and gave frank advice. It doesn't get 5 stars for the same reason others have mentioned - not pressed on site/price.\nWill definitely be back though!", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "Christian is awesome!!! I would suggest him to everyone! Helped me choose which cleanse is the best for me and even helped me to carry them to market street! I'm soo exited about my cleanse and definitely will come back!!!", "author": "Missy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-07", "description": "I originally gave Pressed Juice four stars because I really like juice, especially in the health food desert of the mall.  On further consideration, I've reduced the rating to 3 stars.  The juice at Cafe Bellini a few yards away is much better.\n\nPressed Juice is the most ubiquitous juice chain in SF, and also the worst.  All the juice tastes not-fresh.  It doesn't taste rotten or super awful, but it doesn't have that fresh flavor you expect (and get) with fresh pressed juice.  This is probably because the juice is made in LA and shipped to SF.  The \"Evolution\" brand juice in the refrigerator case at the supermarket tastes fresher.  \n\nORIGINAL REVIEW:\n\nThis is not a very exciting juice place at all, I have had far better.  \nFirst, none of the juice is made to order, so you are stuck with premade mixtures.  Second none of these are what I would ever choose myself.  Third a lot of them taste unappealing / bad.\n\nOn the upside they offer samples, so you can try the flavors before buying, and the prices are a lot less than the similar Project Juice in the nearby Crocker Galleria.   At Project Juice, I liked almost all the flavors, but I did not like most of them at Pressed Juice. I'm not really sure what the difference is, perhaps quality of produce, or proportions in the mixes.  \n\nBoth of these places really annoy me by not having a plain kale with cucumber, apple, or pineapple juice.  This is a very standard juice mix that is nearly always available at juice places, with possible additions like mint or ginger.  I do not want chard or spinach in my juice due to high oxalate content.  These veggies are better consumed cooked.   \n\nI would also like to see collards and sunflower and pea sprouts offered in juices.  Sadly these are not yet common anywhere.  \n\nIn any case, if you are dying in the wasteland of the mall, grab some bottled pressed juice here, or across the way at Cafe Bellini, where the juice is made fresh to order in a centrifugal juicer.  You can get the coveted kale juice mix over there, but I settled for a cucumber juice mix at Pressed Juice after numerous samples.\n\nI agree with the reviewer who brought up organics - it's an issue.  If you like juice you probably like organic juice, so Pressed Juice should really try to label organics and use them when available.  I was wondering in particular where the aloe and coconut in my drink came from, so more food source transparency would be nice.", "author": "N T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "I've been to this place a lot and I think the people writing some of these reviews are nuts!\nGood juice...check!\nSmiling faces...check!\nSmart a** people in front of me giving the girls a hard time...check!\nI'm pretty sure the people mentioned above are the people writing the bad reviews. \nCandace, and Jessica were the ones I saw more recently and they were pleasant! Yummy juice!!\n10 stars!", "author": "Tim M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "Really delicious juices! Honestly, I hate that I'm addicted, the juices are kind of expensive but honestly all of these fancy juices are and I think they might be the cheapest. The juices are filling and tasty. The staff is super sweet and don't mind letting you try juice after juice until you find the right one. Go here!", "author": "Anna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-05", "description": "I have been here twice now and haven't been disappointed. Some juices I like more than others, but this has nothing to do with quality, just taste preferences. Staff is super friendly and I love that it's right next door to soul cycle. So convenient after a great workout! Juice is fresh and genuine. You can taste the quality. Love it!!", "author": "Alex R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "Slowly but surely I'm trying to include some healthy juicing options into my diet, so I figured I would start here at Pressed Juicery. So far, I have tried 2 of the green juices, 1 citrus, and 1 fruit. My taste buds needed to adapt, and are still growing to the greens. Both of the citrus and fruit ones were amazing! Give them a shot!", "author": "Kyle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "Candace and Chloe are great! I like the selection and they let you taste. Pretty reasonable and less expensive than online.", "author": "Vanessa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "I felt compelled to write a review based on not only the juice, but the wonderful service I received from Chloe. I have done juice cleanses before, but it had been a while and Chloe helped me choose the right juices, the sequence for drinking them and the duration of the cleanse that was right for me. I LOVED all of her recommendations and came back once my cleanse was done to get a few of my faves to ease me back into eating solids. I was pleasantly greeted by Chloe once again, who showed me the same enthusiasm as the first time I visited. She is really outstanding and if anyone is interested in doing a cleanse and wants to talk to someone who knows a lot about the juices, go see Chloe!", "author": "A S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-01", "description": "I love the sweet juices like strawberry apple lime. I can see the more veggie based juices appealing to others. This is a great idea for a business. Specifically the kiosk at the Westfield mall. I was there and Jamie helped me. 127% customer service. She's so positive it made me want to buy more. Well done Jamie.", "author": "Shane L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-19", "description": "Just stopped by the stand in the late afternoon to hear some great things about Pressed Juice because I've heard about Pressed Juice by friends. I walked up to the stand and said oh hey you guys are from LA and a guy responded with a mhm and ended the conversation there.. Customer service not that great.. LA attitude.. Hello you're in San Francisco be friendly.. So rude...!", "author": "Carmen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "the juice was great, as always. they have some really cool combinations that have all different kinds of health benefits. the staff was super friendly at the location though. really enjoyed it!", "author": "Suzanne R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-27", "description": "I have been praying for this place to open an SF location.  This has been a must stop on my trips to LA since they opened a few years ago.  EVERYTHING they have is amazing.  And, their 3 day cleanses are not only the best in the city, they are best priced as well!  Shhhhh - don't tell anyone.  In a city where there are more juice bars (I hate the word Juicery) than real bars, this place is above all others without the pretentiousness that bleeds from Union Street.", "author": "D G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "I have to counter the reviews below- the gal that helped me yesterday was great! Let me try 3 juices, all of which I ended up purchasing. Thanks for the help!", "author": "Brittany P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "I'm excited to have a place like this in the mall. I just tried Pressed Juicery for the first time today. The girls working were very helpful and after asking for a recommendation from them I ended up with 'Greens 3'.  Super yummy! I'll be back for sure to try the others.", "author": "Casey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "The 5 stars is for Maya (I hope thats her name), of helpful and friendly customer service!  \n\n****As for the juice, I am CONCERNED ABOUT WHAT PERCENTAGE OF THIER JUICE IS CERTIFIED ORGANIC???  Usually companies will list which ingredients are organic and which  or not:  organic kale, organic celery, ginger, lemon, organic lime etc.... So while the staff insists that it is primarily organic, it is hardly convincing.  I will probably switch to a brand who that is willing to clarify their ingredients in writing on the bottle.", "author": "shirin r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "I stopped going to the Ferry building location, wasn't happy with the service there anymore. But now that they have the new location at the Westfield Centre, I can go there and buy my favorite juices!", "author": "Min L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "expensive, but worthed when you are in hurry and couldn't eat.", "author": "Bryan T."}
