{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Primo Pizza is the definition of a family pizzeria.  I have known the family for years and have always loved the food and hospitality.\n\nPlus it the only place where you will find Ray and his \"pizza art!\"  Take a look at the pic on here and you'll know when you see one of his works of art \n\nFor all the latest and greatest pizza art creations and to request your own work of art follow Ray on Instagram @raydiopizza \n\nRay", "author": "Raymond C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-30", "description": "2 slices of 2 toppings with a drink for $8.  Definitely a good choice for how expensive it can be in SF.  \n\nPrimo is close to my work so when I have to stay late it is usually my first choice for dinner.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "I love Primo Pizza. I personally met the owner and he's very nice. Nelson, one of the workers, is a hard working employee. He's a good guy.\n\nTheir pizzas are pretty tasty. Sometimes, they make my pizza extra special despite not requesting anything special. Lol!", "author": "Dan Mark D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-30", "description": "pizza taste like crap. total rip off especially for the wait.", "author": "Gianni M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-17", "description": "I have never experienced a pizza with cheese whiz on it. We ordered the 3 cheese pizza (added sausage and mushrooms) and I have to say it is the worst pizza I have ever had, it literally has cheese whiz on it. I would never order from this place again and their pictures very much differ from what it looks like. You would be better off getting a grocery store pizza.", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "A little pricey, but for being close by and SF prices, it's definitely on my go-to restaurants in the neighborhood.  I like how they have single slices for $4, but instead of being hot and ready, they actually cook your slice on the spot.  You'll have to wait around 5 minutes, but for a fresh slice, it's definitely worth it.", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-23", "description": "Waited for 1.5 hrs for pizza to be delivered. Their excuse was that the driver was delayed. Would not order delivery from here ever again.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-07", "description": "I walked in this Thursday night to pick up a package, and I thought I would get a sandwich. I waited at the register for 5 minutes before anyone turned around to greet me. I think it had something to do with the fact it took two grown men to slice a pizza. \n\nI order my sandwich, which took an absurd amount of time (which still came out wrong), and then I ask for my package. They futz around for about 5 minutes and then bring my neighbor's package. \n\nFast forward 10 minutes... still waiting for my sandwich. Mind you, there were 2 other customers that had come in and three people working. They were not busy. \n\nI waited 20 minutes for a mediocre (incorrect) sandwich and my package. \n\nAs someone with 10 years of restaurant experience (back of the house), this glacial pace is grounds for dismissal. I would be incredibly disappointed if I knew this as a business owner.  Maybe the term, \"if you've got time to lean, you've got time to clean\" doesn't apply anymore, or they were trying to get out of cleaning the place because I was filthy.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-26", "description": "I have eaten at the restaurant and delivery but mostly delivery. When I ordered at the restaurant I only ordered one slice of pizza. The slice was thick and over flowing with toppings. When I order a whole pizza for delivery there is a lot less toppings but still a good price. The wings aren't worth the price, good flavor but portions are tiny. I order from here 1-2 times a month and today my delivery guy shoved my food into my arms and slammed my receipt onto my pizza box causing me to almost drop it.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-02", "description": "I went to Primo Pizza for a late night slice and was frankly disappointed and told all my friends about it.  The way they treated me and my significant other was not okay. The blonde women that works there is extremely rude!!!", "author": "Alexia F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-04", "description": "I stopped in here at lunchtime from work it around the corner from my job I ordered a pizza and it was great but they got my wings wrong but the wings were OK also the vegetarian pizza - really good and they make their crust nice and crispy when you order a thin crust", "author": "Jro B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-17", "description": "Placed a delivery order online, waited an hour after it was supposed to be there in 45 minutes. Called and they said the driver hasn't shown up for work yet (I live literally two blocks away) so she said I could come pick it up. Walk over there and there's no customers and two older employees just hanging around. Paid for my pizza then she said it'll be another five or ten minutes and I realized they haven't even started cooking it yet, so I asked for my money back and she tells the guy to not start on the pizza, confirming they had not yet even started making it after I placed the order an hour ago. Won't be going back. There's little star, Sr pizza or fly bar in the neighborhood. Don't know how good pizza is at primo but it can't possibly be good enough for that kind of service.", "author": "Jim M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "This pizza was exactly what you'd expect. Decent late night food that hits the spot after a night out. I would definitely recommend this as a spot to grab a late night snack. Delicious drunk food.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-29", "description": "I understand why this place averages three stars...long wait times on food orders and non-existent customer service. Consider taking your business elsewhere.", "author": "Jason V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-01", "description": "Mediocre fat pizza. I order over the phone and when I came to pick it up I got a very tiny with no many ingredient pizza.\nFor the price, I would go and spend it in something else , since is pricy!", "author": "Sergio R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-10", "description": "Before shedding light on the horrible service that they are so great at, I would like to say that I have lived in the neighborhood for nearly ten years and I was very much a fan when they opened a few years back. The staff was friendly and the food was good, everything you'd expect from a neighborhood pizza joint and since I'm an advocate for supporting neighborhood/local businesses you could find me there weekly. It was when the evening staff had changed a while back that I started to notice some serious changes in service. Not sure if that was the reason, I can only assume. If you care to learn the dirty little details read on. Short if it is horrible service and mediocre food. The long narrative is in hopes that the owners will read this and do something about it.\n\nThey market that they're open late, midnight on the weekdays and 3am on weekends (according to friends and neighbors, this is likely the only reason they're still in business at all). At exactly 11:12pm I ordered a pizza and milkshake (don't judge). The man who answered the phone said that the milkshake machine was \"down\". This wasn't surprising as for the past year or so, anytime I ordered a shake later in the evening it was either \"down\" or they \"ran out of ice cream\" or some silly excuse covering the fact that they shut it down early and weren't going to clean it again. Fine, pizza it is. He then tells me that they're not delivering this late either. I said that I've ordered there plenty of times this same time of night and it's never been a problem before, to which he has a long winded excuse as to why they just couldn't tonight ending with \"sorry, you'll have to pick it up\". Fine, it's a block away, I'll come pick it up. He calls me back at 11:36pm to tell me that I need to come and pick up my pizza now cause they're going to close in five minutes. Now, I'm a 40yr self employed professional and having orders barked at me has never been easy to swallow, not to mention I'm very aware that they're open till midnight. I asked if their hours have changed and he confirmed they hadn't. I told him I was on my way and would be there in a minute. Before I get my second shoe on, another call from Primo; a younger more aggressive person telling me I need to come and get my food now. When asked for his manager, the original man who called before gets back on the phone and just confirmed that he would cancel my order if I wasn't there soon. I then asked for the name of the store manager and/or owner, to which I got some very muffled responses and only after repeatedly asking for the name did I get an official \"Dave\"! When I asked for his name I got some more muffled responses and after asking three times he barks \"Tommy\" (due to his strong Indian accent, I highly doubt this was his name). I asked for the name of the young man who passed the phone to him and he hands the phone over to someone (assuming the younger guy) and I hear \"he wants your name\" right before the phone hangs up! Service at it's finest, right? \n\nAs a business owner I pride myself on stellar customer service and also expect it from businesses that I support. I don't have high standards for a neighborhood pizza joint but they took a minimal expectation, and stomped it out with the hanging up of their phone. To the owners of the SF location of Primo Pizza, you might want to cross reference any drops in revenue/sales with the hire dates of your employees; I'm sure there'd be a connection. As for me, no need to send me any coupons. I won't be returning.", "author": "Ryan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-14", "description": "As pizzas go this place is not top of the line. It's ok. But wouldn't come back. Would rather get a good pizza from Extreme or Northbeach for the same prize I paid for this pizza.\n\nPretty generic.", "author": "Cherry C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "Bam! I love primo pizza.  It's not the best pizza I the world, but it's solid.  It doesn't take forever, it's reasonably priced, and it's 100 yards from my front door.  The latter bit may bias me, but if you find yourself near divis and Turk in a hungry state.... you have nothing to worry about.", "author": "Nick A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-01", "description": "This place is over an hour late on delivery for a end of the year party and it's the closest place near us. DONT ORDER FROM PRIMO!", "author": "Nikan R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-11", "description": "F*** THIS PLACE\n\nordered at 7 pm. A veggie sandwich and a soda - nothing that even needed to be cooked. At 8:50 - 30 minutes past the delivery time GrubHub gave me - i called to check on the status of my order. The guy who answered the phone gave me some line about how they had lots of orders but the driver should be here any minute and he promised my food would be \"hot and delicious\". So i waited until 10 pm - over an hour after my first call - and called back, by now starving. The guy gives me some sob story about how the driver is acting up and he's going to talk to the owner about him. I tell the guy i dont give a damn about his problems running the business, my only concern as a customer is whether i am getting the food i paid for. So basically the guy tells me im out of luck and now its too late in the evening to order from anywhere else AND my last $25 that i spent on this order wont be back in my bank account for 3-5 days - assuming they actually refund it which i cant count on - so i cant afford to order from elsewhere anyway. So i just get to go to bed hungry and angry and probably paid $25 i'll never see again for the privilege of doing so.\n\nSo in short. F*** THIS PLACE AND DO NOT EVER ORDER FROM HERE", "author": "Ian G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-25", "description": "Half-assed. I ordered the meatball pizza. The only meatball pizza on the EAT24 menu describes: meatball, pepperoni, mushrooms and bell peppers. This pizza I opened was just cheese and meatball. \n\nThe worst part is they burnt the mozz sticks. In total, a really disappointing order. \n\nUsually the food is decent here but this is ridiculous.", "author": "Shelby J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-24", "description": "The sandwich I had to make myself after ordering from here was delicious. Ordered through Grubhub, when the ONE PIZZA was 25 minutes passed delivery time I called them. Driver was \"headed to the wrong address\". 40 minutes pass, Grubhub calls me (after I chatted them twice), says the restaurant never received the order. They'll send it over (3 hours after I ordered) but they're out of the 1 topping I ordered for the pizza (bell pepper). After reading the reviews I guess I'm glad I didn't have to eat this.", "author": "Rosalee S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-26", "description": "20 mins and counting for two slices of pizza. And we even asked which ones would be the quickest. No repeater.", "author": "Will H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "My family came up here from Southern California. This is a really small cute pizza place. The owner was here and was very friendly. The workers treated us like kings. But most of all the pizza was so thick juicy cheesy and great. I posted some pictures so you could see how good it really is", "author": "Twy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-11", "description": "Yas, this pizza is legit! Not sure why the ratings are so low, other than that it took quite a while for the food to be ready. Not too bread-y, pretty large slices, a fair amount of toppings, and perfectly cheesy.", "author": "Shendi X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-13", "description": "Good basic pizza. What more do you want? Nothing fancy but they come correct. It's a certain style not too thin, not too thick, not too greasy, but definitely not health food by any means. Delivery usually shows up in a timely manner and they are always friendly over the phone. May not be the \"best pizza in SF\" but no complaints here!", "author": "Peter B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-30", "description": "I seriously wanted to like this place.  The prices are low and it'd be great to have a by-the-slice place around for quick bites.\nBut seriously, this is the worst pizza I've ever had in the city.  I gave it 2 tries too.  It's about Little Ceasars quality.   Tons of sugar must be added to the doughy crust.  \nOh well.", "author": "Troy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-14", "description": "Mediocre two topping pizza inexplicably cost a couple dollars more than the price shown, including tax.", "author": "B T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-24", "description": "Their health score is nowhere to be found which is EXTRA troubling when you find BLACK SPECKS in the ice cubes in your sprite along with AN ACTUAL STAPLE at the bottom of your cup!! Food wasnt good.", "author": "Sadie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "Wow, excellent pizza (great for kids!), chicken tenders (delivered hot!), salad and delivery!  We will definitely order again! we ordered through slice.com, so that might have made the difference.  Others have complained about grubhub, etc, but our delivery was faster than expected.  My only complaint is that I wish the greek salad was with greek olives and not black olives, but the pizza makes up for it.", "author": "kathleen A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-04", "description": "The worst pizza I have had in the city. The driver some how ended up at a completely different location which made the total delivery time around an hour and 45 minutes. Food was ice cold. Milkshake was luke warm. Mozzarella sticks were soggy and cheese was a solid block. I couldn't drown the pizza in enough ranch to make it edible and ended up throwing it all away.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-16", "description": "If I could give this place a zero, I'd give them negative 5.\n\nOrdered a medium veggie pizza and a salad precisely 3 hours ago, which is 10pm. That is pretty adequate time for a delivery that says it should take 30-45 minutes to arrive at my doorstep. But no... it is currently 1am in the morning, 3 college students sitting around studying for finals at this very moment, hangry hangry hangry. This place closes at 12am we've been calling every 10 minutes since 11pm to make sure our food will get here on time, it never made it to the door. If you read other reviews talking about how their pizza arrived cold... well we didn't even receive our food at all. Primos supposedly means top quality... ha. not quite.", "author": "Nikki S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "Holy damn.  Best pizza in the city award goes to the orgasmic Chicken Gourmet.  And don't get me started on those cream cheese filled Jalapeno Poppers.  Why did we only order 5?  And why have I only discovered them now, 26 years into life?\n\nA small pizza is pretty tiny, but if you're not too hungry a small with an appetizer can feed 2 people.\n\nIf hungrier, it's a better value to get 2 small pizzas (10\") $10.99 each vs. 1 large (14\") $20.99 each (I did the math. Pi R Squared.).", "author": "Cat C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "For the price, this pie is pretty damn good. Only issue is when ordering through the yelp/eat24 app there's usually some mix up with the order. Last 2 times I ordered I asked for thin crust with roasted chicken, sausage, pepperoni, and white sauce. What I received was regular crust (too much bread for me) with the correct toppings but red sauce. The delivery drivers ALWAYS seem to go to the wrong address, yet they always expect to keep the change. At times they're assholes about it...makes me not want to tip anything with that kind of attitude. Not sure if these guys read the tickets they get, but I always expect to wait to get a call from the delivery guy saying he's out front only to find he's somewhere else lol. All in all I still enjoy this place hence the 4 star, but the method of delivery could vastly improve...better service=better tip, but still a good pie for the price.", "author": "Bryan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "Primo Pizza is a little off the beaten path of the main drag on Divis, but, it's worth going the extra few blocks. I've been going to Stelladoro for years because it's, uh, there and it's alright, but, I think Primo Pizza will be my new go to place for slices. You can tell that their dough is fresh and the slices taste great. Their current $5.99 two slice one soda special is good deal if you bring a pal because their slices are quite big. In addition to regular cans/bottles of soda they also have Jarritos and Mexican Coca Cola (which aren't part of the slice/soda special). \n\nI have yet to order a whole pizza or other items of the menu, but, I look forward to trying more from them. \n\nAlso, the people working there are friendly. Yay for good slices in the hood!", "author": "Paige C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-17", "description": "Situation \n- Dinner during the middle of the week\n- Ordered a couple of Hawaiian slices\n\nPros \n- Good service\n- Cheap prices ($5.99 for 2 slices and a soft drink)\n- They deliver\n\nCons\n- The pizza is decent, but not great (it's good of you just want a quick slice)", "author": "Dipesh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-31", "description": "Ordered for Delivery.. Chicken wings and a Medium Create Your Own Pizza.\n\n10 Pc Chicken Wings, comes with Ranch, [only one, so ask for an extra if you like more ranch]..  comes with small pieces of celery and carrot sticks.... They're small pieces of chicken that fit in the palm of my hand, haha .. for some that might just be one bite... order a 20 pc ($15.99) if you're hungry. lol..\n\nThe pizza reminded me a little of Pizza Hut's pizza.. O.o lol.. I like that the crust was soft .. and a little thick. it was good :) a little too much garlic salt (I think it's what was on it..) got everywhere. haha =] \n\nbut it's a good pizza for a quick and cheap lunch, definantly cheaper than when I ordered at Go Getters, I ordered just about the same thing, a Medium pizza, two can sodas, and 10pc chicken wings.. there was almost $45.. At Primo's Pizza I only spent $28.48  :)   We were all happy with the food.. we'll be ordering again. and delivery took about 35 minutes to wait :)", "author": "Mariana O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "For $7 this place will do! Pizza is yummy, not too soft and has a nice crunch! I got the $7 special. 2 slices of 2 different toppings of your choice plus a small soda. Great place to stop by for a quick lunch. Bathrooms are pretty clean.", "author": "Yesenia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-01", "description": "I want to like this place because they are 1 block away from work.  It should be an easy, go grab a slice, in and out thing.  BUT IT NEVER IS!  My own fault for going back but the last 3 times I went= 45 minutes wait for 3 slices, 35 minute wait for 5 slices, and 40 minute wait for 3 sandwiches (2 of which were veggie).  Come on.  I will never go back. Also, the staff is not friendly.  They never apologize for the wait. Never smile. The Worst.", "author": "Jess J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-03", "description": "Waited 2 hours, yes 2 hours! For cold mediocre pizza, and soggy chicken tenders. I would have been better off making frozen pizza. Oh, and they forgot my condiments. I have nothing positive to say about this place. 2 thumbs down.", "author": "Judy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "Pizza is awesome !!.  Fresh! Great menu with wide selection of choices and different style pizza.  , even for a family to come in and enjoy great tasting Pizza for dinner.  I like the bar set up , nice touch to it being along side of window kinda look out check the city life front of you ..  But yes 5 star all  way..", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-05", "description": "Was late and needed to get something to eat. Showed up as they were closing and the let me order 2 slices before they closed. Family owned and super nice. Swing by if your in the neighborhood!", "author": "Steven L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-23", "description": "Good quality, but much pricier than national chains.  It is a plus that they are open till 3am Friday & Saturday overnight.", "author": "Wendel T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-16", "description": "Showed up around 2am and the employees had no idea what was going on. We were the only ones in the restaurant but they couldn't remember our orders to save their lives. I had to go up to the cash register and remind them at least 4 times what we got and even then, they forgot one of our slices. Eventually, they just printed out all of the receipts so they could look at them and physically check off each slice that was ordered. Pretty pathetic. Was pleasantly surprised how large/filling the slices were, but they better be considering the price of the slices \n\nPros: open late night, large hearty slices\nCons: very unsuitable employees, $5/slice", "author": "Christy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-05", "description": "Definitely skimped on pepperoni, when ordering a pepp. Black ol. Pizza. Good crust, good cheese , that's about it.", "author": "C W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-12", "description": "When you actually get what you ordered, the food is pretty decent - but more than half of the times we have ordered from them an item was either missing from the pizza and/or they straight up gave us the wrong pizza (which has happened 3 times now), even when we ordered through eat24 we ended up with a missing item on one pizza AND a completely wrong pizza.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "My family stopped in to try this place out for the first time. We all ordered the 2 slice deals, which is 2 slices, 2 toppings & a drink for 6.99. The slices were HUGE & delicious, topped with a lot of cheese and toppings. I ended up taking leftovers, and my son who usually finishes every bite had half a piece left!", "author": "Danielle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-05", "description": "I want to give these guys higher marks, and yet I had to force myself not to give a 2-star review.\n\nI was so excited when this place opened. The pizza is your standard pizza fare, but the dough, sauce and freshness of the ingredients deserve to be singled out. To put it better, it's the best of the classic style neighborhood pizza delivery places, in terms of quality.\n\nMy first pizzas arrived quick and hot! I now had an old school pizza place to provide contrast with all the artisanal places.\n\nBut about a month or two later, the pizzas started arriving super slow, like everyone is saying. It is absolutely cold, guaranteed, and you will have to heat it up first. I live 4 blocks away! The pizza arriving cold is a bummer, and as a result, walking to Little Star for takeout is now more appealing, because my dinner will be warm. If it's taking 70-90 minutes to get my pizza 4 blocks away, I can't imagine how long it takes if you're further than I.\n\nIf they want to be the old school pizzeria, they must get the pizza out the door hot and fast. I feel like maybe the ownership isn't supervising the employees at the SF store. Or maybe they are having staffing trouble, too, because the last guy to deliver had an apron on like he was the cook, and he tried to give me a free 2-liter coke as apology for the delay. Maybe they need to buy some sleeves or ovens for the drivers, I don't know.\n\nIt takes someone in the restaurant really giving a damn about keeping customers happy to make a pizza place work. I speak from my young years, working in a pizza restaurant. I hope that changes. The pizza is delicious, but nobody wants to wait all night for cold pizza!\n\nUpdate 3/7. The pizza came in 45 minutes and was slightly warm last time. Maybe things are looking up!\n\nUpdate 3/31. The pizza is still showing up not warm enough, but in less than 40 minutes. So I'm bumping up to 4 stars. I just warm it up in the toaster oven.", "author": "Gregory F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-04", "description": "Horrible service, rude unsanitary, worst place ever to have ups delivery. If it's one thing there's another. Who hires people to work in s location and doesn't train their workers to process the shipment. I've waited two days for my packaging & im still waiting, mind you I received an email telling me it's there. The cashier Wayne handles money and the food. He went back and fourth from the kitchen to the register not once did he wash his hands. Eww disgusting right?", "author": "King DJane M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "Great Pizza, I enjoyed the slices and I am a fan of how affordable slices are. Only 3.50 for a cheese slice and only 0.50 cents for a topping! The whole pizzas are freshly made. Great location. Keep this restaurant! The guy in the front has great customer service skills! Friendly and kind! I give it 5stars!", "author": "Kevin R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-07", "description": "Judy ok. IR maybe less. They Work Hard so i can not give them 2 stars. But you do not come to SF for pizza.", "author": "Bob D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-15", "description": "As a college student, restaurants that deliver decent food during late hours for affordable prices are one of the greatest little things in life to appreciate. When I found Primo Pizza on Eat24, I was pleasantly surprised by the amount of options this place had, and for good prices! I ordered chicken strips, a slice of cheesecake, and a chocolate milkshake for my friend. \n\nFast forward two hours, when the food finally decided to arrive. Yes, it took them 2 hours to deliver my order. I didn't order anything complicated, not to mention the fact that I live 3 miles away from Primo. \n\nThe chicken strips were overcooked, the cheesecake was pre-packaged (yes, in a plastic sleeve....imagine if Hostess made cheesecake), and the milkshake was melted and thin. \n\nI would rather spend double the amount of money than to ever order from this place again. They took forever, and the food was nowhere near being worth the wait.", "author": "Lily K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-18", "description": "Live in the area and had to try delivery since I got the flyer and I was feeling too lazy to go out or make my own food.  \n\nOrdered the great-sounding Joe's special $15.99 for 2-topping XL pizza.\n\nI received it within the hour but it must have been sitting in the delivery car with the windows down without a sleeve warmer because it was pretty cold.  They're only 6 blocks away too!\n\nHard, bland, but edible dough.  Toppings were okay.  Mushroom and pepperoni.  Can't go wrong really.\n\nFilled my empty belly but had that ashamed feeling like I cheated on myself.\n\nYou have to be totally hammered to say this pizza is good.", "author": "John M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-27", "description": "The sandwich was actually okay the roast beef and the turkey were homemade but the roll was stale. The problem was that it took 35 minutes to get the food. They have no concept of time. It was lunch hour and there was nobody there that should give them a clue. I get that it is a mom and pop but if they want to stay in business they have to do the basics. One person needs to take the orders and work the cash register and let the cook make the sandwiches and the cook can't wander off halfway through making it. There was a third person working there but they came out of the back and just left during the time I was there. It doesn't matter how good the food is if you can't serve it in a timely fashion.", "author": "Lewis Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-28", "description": "I spent $30 on a pepperoni pizza and wings. 2 hours later I get a cheese pizza and small soggy wings instead. I do not recommend this pizza parlor! Save your time and MONEY!", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-04", "description": "I ordered a BBQ pizza from them off of Eat24. Tomato paste is the only thing in the food pyramid that I will not touch with a 10 foot pole. I have a bad history with tomato paste and get BBQ pizza specifically because they use BBQ sauce instead of tomato paste. There was no tomato paste in the ingredients list. I have never ordered a BBQ pizza from somewhere where they put tomato paste AND BBQ sauce on a pizza at the same time. Not only is that a ridiculous combination but it literally ruined my entire night because Eat24 usually makes me really happy. That is all. \n\nThe worst thing is this pizza also is not cheap. I would have given it another star if maybe the pizza was less expensive/made better. I wish I had a Dominos that would deliver because their automated pizza making process is sooo much tastier and much cheaper. I would gladly pay extra for good pizza if it meant the workers are paid more. But this is just sad. Ugh.", "author": "Polina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "Nom nom nom\n\nOrdered a pepperoni pizza and some chicken tenders. And a chocolate shake. \n- chocolate shake was cold and fresh \n- chicken was not overly breaded and fried, very tasty. \n- pizza was AWESOME. Good pepperoni, and deliciously fluffy and sort of sweet crust. \n\nI'm so happy I went out on a limb and tried this place. Will be ordering more soon!", "author": "Sunny D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-08", "description": "Somehow there has to be an art to throwing cheese and toppings on top of crust. I got a slice of Hawaiian and it was probably overpriced by $2...and it lacked the art of pizza-making. This is on Divizadero.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "They are open late, their delivery guy was polite and fast, and they deliver milkshakes - what's not to like?\n\nI haven't tried their pizza yet but the sandwich was tasty and affordable. They also bring ranch sauce and marinara with the jalapeño poppers.", "author": "Vanessa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "Awesome time hanging out with friends talking and having fun!!!\n\nMilkshakes, Pizza and Floats all around!!!", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-27", "description": "Solid pizza, quick delivery, very nice salad.  We ordered a custom pizza and it came out great.  A bit on the pricey side though.", "author": "Larry H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "Good go to. Sure there are classier places in the hood but come on. Solid pizza for a fair price. Thanks for coming into the hood for the rest of us who don't work at Google.", "author": "Raylan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-10", "description": "Pizza is good.  \n\nService seems off-- I ordered delivery 2 weeks ago and tried to order again today, but they've stopped delivering to my \"area.\" I live 4 blocks away. :/", "author": "Lavinia F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-15", "description": "Being super hunger, my friends and I decided to eat nearby before heading out. We ordered the XL  pizza, half chicken primo and primo special (thin crust). For me, I actually enjoyed the chicken primo because the pesto sauce was yummy and the sauce was pretty good. The Primo special was basically your usual combination pizza with pepperoni, sausages, etc.\n\nOverall, not a bad place. Pizza was around $30.", "author": "Nhung T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-13", "description": "If there's a hell, I'm pretty sure it resembles Primo's Pizza. I had such high hopes for the new neighborhood slice joint. In fact,  I've been holding off reviewing this place because I actually wanted to see them succeed when they opened. Unfortunately,  this place has devolved into an EPIC FAIL and a complete AFFRONT to pizza lovers everywhere. I'll break down the utter tragedy that is Primos Pizza in two digestible (unlike their ungodly pizza) parts and I won't even charge them my consulting fees for the analysis of their pathetic excuse for a customer reliant business.\n\n\nTHE STAFF: Are A) RUDE to locals when THEY are the newcomers to OUR neighborhood. B) So glacially slow you wonder if every one of them is severely mentally challenged. Hint: food service is about speed, quality, and precision. C) So unprofessional they do things like smoke in front of the restaurant with the door wide open and smoke wafting inside, taking a phone order while in the middle of a face to face order with the customer in front of your face holding cash. D) INCAPABLE of displaying basic human communication skills  like saying \"Hello.\" or \"welcome!\" or \"Thank You for your business!\" Or \"Please come again!\" They're often just plain cold, unresponsive, and mean. Their attitude says \"FU for interrupting my Judge Judy session!\" And that's not a stretch because the TV isn't mounted on the east or south wall where customers could most likely enjoy it. No, it's mounted high on the NORTH wall so the employees can sit around and mindlessly watch it like a bunch of useless convalescents and ignore their most important responsibility- the CUSTOMERS.\n\nThe Pizza: You guys DO know that you're competing against an Little Star which is a neighborhood INSTITUTION and one of if not THE BEST pizza in San Francisco right? You can't be THAT clueless! I know Primo's is not in the same lane, hell, Primo's is not even on the same planet! If pizza was represented in our solar system, Little Star would be the sun and Primo's would be a piece of space garbage.  The pizza dough HAS SO. MUCH. YEAST! Their slice would literally kill an elephant with celiacs disease it's so doughy, AND it's often UNDERCOOKED. The ingredients are cheap. The sauce is bland, the amount of cheese piled on is just excessive. It's basically horrible mixerMozzarella cheese bread. If you like this place you have no idea what a good pizza tastes like or what good customer experience should feel like.\n\nI really wanted to love you Primo's. I was the only person on our street sticking up for you when all of my neighbors said you were garbage. I was like a battered wife that kept going back for more anytime I was too lazy to get some real food or so hammered that you were my food booty call, because that's all you're good for. But! My last experience was just that and I'm not coming back for your abuse ever again. I wouldn't pee on you if you were on fire, I'd use your flame to light my pre roll and celebrate your demise with my neighbors. I hope that you had the basic curiosity to research why the businesses before you failed. I doubt you did since NONE of your staff seems to posses ANY sort of basic work skills the only thing about them that's basic is THEM. Here's the answer to why the businesses in that same space before you inevitably failed and why you will too: They alienated their customers thereby alienating their own community. Exactly what you guys have managed to do. Great work.", "author": "SF M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "I like it this is my spot to come here 2-3times a week. It's very good. There was a miss understanding about a slice but was all resolved with much respect. The best deal for a two slice two topping pizza with a soda. It's pretty big inside and there is plenty of room to site.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-22", "description": "staff member Eric short changes you deliberately.\n\ngot 2 slices for 6.50, paid with a $20. Eric hands back 4 ones and 50 cents. I didnt notice there was no ten dollar bill in the change until getting home.\n\nshady operators :\\", "author": "Sal L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-09", "description": "I swear to god they do the most basic of things wrong how do you not know how to cut a god damn pizza it's either not cut deep enough or the all together forget it's a pizza and cut it into squares either fire that person or teach them how to tell the difference between a square and a triangle. all I want is a normally cut normal tasting pizza.", "author": "Mitzi D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-31", "description": "Supporting role.\n\nChicken breast sandwich was awesome. Bit expensive at $9 but it was arguably one and a half meals. Doused with marinara sauce and veggies it ended up just being one.\n\nBut it took almost twenty minutes to arrive.\n\nPizza slice was very heavy on the cheese, very large in size and very reasonable with a $3.25 price. Enjoyed this one more than planned.\n\nBut it took almost ten minutes to arrive.\n\nDefinition of primo is a leading part (http://dictionary.reference.com/browse/primo), but despite the good food and friendly but seemingly short staff can only recommend as a second option.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-06", "description": "Slowest service ever. How long does it take to make a slice? More then 15 min. The associates are busy smoking outside and chatting with their friends  then taking care of customers. Pizza was tasty. The crust is on the thicker side.", "author": "Zita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "Pizza is phenomenal. The woman who you our order was super nice and patient as we were trying to figure out whether we wanted slices or a small... definitely recommned.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-28", "description": "Primo Pizza was exactly what I needed as a Saturday late night snack!! The pizza is made to order, fresh, and hot. The crust is thicker, but super crispy and crunchy. :)\n\nAnd the service could not be beat! Will definitely come back!", "author": "Ashlie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-04", "description": "I love the Fog City Special. Good pizza, but they take FOREVER to deliver. I am currently waiting for an order I placed 90 minutes ago. Yes, it's Friday night, but they should plan for that and have enough drivers available.", "author": "Gina H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-05", "description": "They got great deals and promos for their coupons. Like free size upgrade if you do pick up. Delivery is free, on eat 24 app there is a coupon on for either a free 2 liter, free cheese bread, free Caesar salad or house  salad. Surprisingly the pizza when ordering thick crust was really good. But the devastating thing about this experience was that i was quoted by 45-60 minute wait time. I called a hour and half after ordering, the sound of the person who answered was the most unenthusiastic passive aggressive person ever. I called the person answered and i ask \" yeah hi, i was wondering\" only to be cut off by \"its on its way.\" (He knew what order i was i guess by paying attention to caller Id). I was starving, pizza was cold, i thought the pizza was still good but I could be wrong based on how hungry i was. So when ordering from this place give yourself a good two hours, because it took this long when it was not even prime time or pick up.", "author": "Jetty S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-21", "description": "Miserable, long wait over 70 minutes for a pizza and some chicken tenders. And when the driver finally arrived the chicken tenders were missing, so he had to go back to fetch them, which took another 15 minutes. Food was ok, but luke-warm and overpriced!!", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-25", "description": "BEWARE ! These ppl are horrifically RUDE AND INCOMPETENT ! The women who work here Linda and Yazmine or Jazmine are the complete worst ! I've tried with them a few times because the pizza isn't HORRIBLE and I love extremely close (so I wanted them to work out)I've had better but I've had worse so I tried not ordering any time I seen them inside (which makes the business lose money) but after I tried to call and give the owner my complaint they passed the phone around as if it was a hot potato . It seemed no one cared to hear how horrible the food and service was ! Needless to say I WILL NEVER GIVE THESE PPL MY MONEY EVER AGAIN (this place has had 3 different businesses over the past few years I won't be sad to see them go). \nI get wanting to hire family (if that's why there still there) but those ppl are bad for business ! \n\nOverall pizza is okay can be to thick and greasy , the wings aren't so great either \n SERVICE IS HORRIBLE \nOh and it takes them forever !!!! Even when you call ahead of time", "author": "Diva R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-03", "description": "I was hungry taking a break from Lyft and decided to use the rest room and then get a slice of pizza. Bathroom was clean, pizza hit the spot but the service wasn't too hot. Didn't really acknowledge me for a long time even though I was obviously in line ready to order. Would probably get pizza again from here, it his the spot. Nothing too crazy but still decent.", "author": "Jamie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-03", "description": "I've been meaning to write this rave review. These people rock!!!!!  The pizza I will never get enough of it's so wonderful!!!  The dough is truly homemade with love and the sauce and cheese sheer perfection. Let me put it this way, I have ordered from this place more than 10x and consistently i have only ordered the cheese pizza , I have yet to try anything else! My only suggestion and hope is that there milkshakes get better, sometimes they are thick and then other times they are milky/liquidity.  On the high note, that cookie pizza is one to kill for , YES.", "author": "Jalisa B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-20", "description": "I considered giving two stars because the people running the place are nice but the pizza is too bad. Why is it so hard to get a decent pizza slice in SF? I live around the corner so I've been a half dozen times late night when options are slim. It's just not good and it's not cheap! If you're going to make crappy pizza at least make it cheaper than everywhere else.\n\nAlso, they add toppings to already cooked cheese slices when you order a combo/topping. And then add a ton more cheese on top. You end up with overcooked pizza with undercooked toppings and cheese. It's gross. \n\nAgain, why is it so hard to make a decent pizza slice in SF? There are a lot of good pizza restaurants...but places to get a good slice in this city are few and far between. This place is on the lower end of that scale which is pretty bad.\n\nIf you are tempted late night, just go to the corner store and pick up a frozen pizza. It pains me to say it since I was hoping this place would be good but frozen pizza is a  better option.", "author": "Tom S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Perfect spot for a late night slice if you're in the neighborhood. They're open late, quick, and reasonably priced. Plus, extremely friendly staff!", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-23", "description": "Anyone....ANYONE that gives this places more than 2 stars has absolutely NO IDEA what good pizza is. The crust, the cheese, all of it is crap. And nearly $4 for a plain slice?!?! My goodness gracious!!!!\n\nMessage to Primo: Quit. Just stop. SF has way too many crappy pizza places and you are absolutely horrible. Go to NYC for a few weeks and you'll learn a) your crust has waaaay too much yeast; b) your sauce is waaaaay bland and c) you've got waaaay too much cheese on your pie. \n\nThis place will undoubtedly live off ignorant college kids, tourists, and bridge n tunnellers for a while (hence the positive reviews). But to the folks that live in the area, get your pizza delivered by Village on Clement. That is what good pizza tastes like. \n\nUgh....", "author": "Byrne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "This place seems interesting; it's my first time here, but the people are cool and I'm chilling with friends", "author": "Gabe R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-15", "description": "Despite being only a 5 min drive from my house delivery took close to two hours! Food was soggy and undercooked when it arrived and my milkshake was completely melted. Overall pretty gross.", "author": "Joshua K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-10", "description": "I think the problem here is that some people are rating this pizza based on whether or not it's the best pizza they've ever had and others are rating it based on things like price, convenience, and the fact that they've never been to NY.  \n\nSo, it's not the pizza I grew up with in NY but nothing is out here.  Neither is Little Star and they charge twice as much.  If I were to rate every piece of pizza and bagel against NY forever I'd be insufferable*.\n\nIt's unpretentious fast food pizza.  You can get a large pie for under $20.  It's pretty good.  \n\n\n*I've been accused of this by people who care and I'm trying to calm down and adjust my expectations.  It's a process.", "author": "HR P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "So I asked for them to make sure that the meat didn't touch one side of the pizza and they were so awesome and listened and did it perfectly. Great customer service and an awesome staff. I liked the pizza. Wasn't the greatest but was better than regular pizza. I would have given them more if the pizza had more sauce. But I do love them overall and will order again!", "author": "Antonio S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "Rating this pizza for what it is: fast food local delivery pizza it's actually not bad! I would never compare it to the New York style (giorgios or gaspare's), Chicago style (little star, paxtis) or other fancy pizza places in the city (delfina, etc). But for delivery it's quite good it tastes exactly like Papa John's in my opinion! And $30 for the two topping 20\" monster size pizza was a pretty good deal. If you live in the neighborhood or in the delivery range it's worth a try!", "author": "Jennifer R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "Finally some good pizza at a reasonable price in my hood. I brought a few pies to a potluck and they disappeared so quickly that I almost didn't get a slice. The salads are generous and tasty and the owner and people working there are all friendly.  If you're in or near the Divisadero corridor, stop on by for a slice or a whole pie.", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-27", "description": "Just get the cheese! its pretty classic. I like the doughy crust. I got the supreme one time and they dude just added an intense amount of toppings and it was not edible.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-09", "description": "Totally just acceptable-kind-of-ok for 1am pizza delivery. But in a good way.", "author": "Shaina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-10", "description": "Before I start with my review, it's important to note that I have only gotten carry out from this place. It's small, it's new and the employees there, I can count with one hand. What that means is that on any given day, you may have 1-2 employees tops handling deliveries, which goes along with the negative reviews that the food takes forever to be delivered.\n\nThat being said, I literally live down the street from this place and have never had to get my food delivered, so I only have great things to say about Primo Pizza.\nI've always been a big fan of pizza, especially when they offer them by the slice; what's even better is the fact that since this place open they offer two slices of pizza with 2 toppings and a fountain drink, all for $6.50. Add to that the fact that they have a HUGE selection of toppings and you can pretty much create any kind of pizza you want. \n\nIn terms of what I usually order, it's pretty straightforward; I usually get pepperoni and sausage, BBQ chicken or Hawaiian (pineapple and Canadian bacon) and so far, I haven't been disappointed. The slices are above average in size, the amount of toppings you get and quite sizable and I've never had to wait longer than 10-15 mins for my order to be ready. \n\nI don't really venture out too much, I go to pizza joints for pizza so I haven't tried anything else on the menu, but if you're close by and you're looking for good, cheap pizza with a bunch of varied toppings to put on it, you are definitely going to enjoy Primo Pizza!", "author": "Jonathan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-10", "description": "Good pizza in a no-frills, unpretentious place in a neighborhood that's rapidly becoming another Valencia Street, which, come to ponder it, is basically any other neighborhood located on a major thoroughfare in San Francisco, not already named Valencia, Fillmore, or Irving. One is probably not going to take a prospective girlfriend/boyfriend to Primo on a first-time date with her/him; its fare and ambience are quite prosaic, but in realm of food establishments, this is a good thing with the preponderance of restaurants in San Francisco more than willing to sell you, say a hamburger with a slice of blood orange topped upon it, for $30. There is a clear need for food establishments like Primo whose basic goal is to provide a meal or a late-night snack cheaply and efficiently, and in my opinion, Primo does this well. My most recent visit to Primo saw me enjoying a small (10 in.), thin-crust pizza topped with pineapple. It was prepared rapidly on-demand and I found it to make for a wholly satisfying dinner, with its leftovers making for a good cold breakfast the next morning. Less than $12 for the pizza, not counting tip given.", "author": "Randall S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-20", "description": "The lunch special is SUPER cheap and delicious. 2 slices of pizza with any 2 toppings you want and a can of soda for like $7. Can't beat that anywhere around here. The pizza is what I would call traditional style with the cornmeal type crust. I'm a big fan. And it's served hot out of the oven. It's not like it's been sitting in a warmer all day. Great lunch spot on Divis for sure.", "author": "John H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-23", "description": "This place has AWESOME pizza.  My only beef with them is that every time, without fail, they leave something out of our order or mess up a side item on our order.  They are usually pretty good about giving us a credit or refunding it, but it's sort of frustrating to always have to call them after the food gets here to complain about something.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-14", "description": "Not a bad pie generally speaking. It's not NY style, seems to be a corn meal style crust, which immediately reminds me of big chain pizzas, generous amount of cheese but the sauce could be a bit more tangy.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-06", "description": "Fighting food poisoning after eating here. Would not recommend you eat anything from this restaurant unless you want to gamble with your health.", "author": "t p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-24", "description": "This place is awesome. They have bar windows facing the street. And cheap tasty pizza.  Its also not as pretentious as the other pizza places in the area serving a great no frills pizza by the slice", "author": "michael d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-14", "description": "Fantastic! Good pizza, and 2 slices and a can of soda for 6 bucks?! yes please.", "author": "K P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-02", "description": "i showed up at around 4pm. there were two kids eating pizza. no one else. i ordered a chi ken breast sandwich to go. the order went in and so I sat down to wait... I'm a people watcher so I began watching the cook. he began walking around the back looking for ingredients. I was surprised in the bad way. the cook didn't seem to know where all the ingredients were. about 10 minutes went by before the cook finally grabbed the soft roll. periodically the cook would disappear to the back for a few minutes. 15 minutes into the order he finally put the cheese on the bread and began constructing the sammich. in walked in a gentleman who ordered two slices. so the cook froze on my sammich and began putting together the slices. so my sammich just sat there. in walked in 2 other gentleman. one guy was an obvious employer and another guy was either a delivery driver or maybe an IT guy because they both picked up a phone and all began looking at it. the two new guys and the cook began looking at the phone together. the slices were in the oven. sammich still sitting there half made. 20 minutes into it the cook finally got my order in the oven. so now i sat sitting watching the cook and two guys continue looking at the phone. looked like they were not agreeing on whatever was on that screen. the girl behind the counter had only taken my sammich order and the 2 slice order. the pizza was ready and she walked over to the big old fat guy and said, \"did you order the sammich or the slices?\" as if they were slammed with orders. long story short. the cook was too busy trying to figure out whatever was on that phone that he forgot about my sammich. 40 minutes into it the cashier girl pulled my sammich out and wrapped it up. I later enjoyed the sammich. it was a tasty one. the pepperoncini peppers and the jalapenos gave it a zing. the soft roll was crispy on the out and just soggy enoigh on the inside. the cheddar cheese was sharp. the last 1/4 of the sammich ran out of chicken. but besides that. a 4 out of 5 stars on it. if your are looking for a quick sammich. not the place. this place is a pizza joint. (and they make a spectacular pizza) it looked like my order really threw them off track.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "Great Pizza. Loving having something so close to the house and there pizza is nice and hardy and feeling.  Best prices around!!!!!! Plus,  the service is quick and friendly! !!!!!!", "author": "Taressa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-04", "description": "Hands down do not ever go to this place.  45 min late on a delivery.  When the pizza finally arrived, it was cold and tasted very average.  This pizza tasted better microwaved and dipped in ranch.  I will not be ordering from them again", "author": "Tanmaya H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-25", "description": "Opened up my sandwich at home and it was full of ants!!! Probably the most disgusting thing I have ever found in a sandwich.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-02", "description": "Been here twice. Waited for a slice 15-20 minutes each time. Pizza is OK but service is deplorable. Order takeout or go elsewhere. Set up for delivery. Eating in an afterthought and once you've paid... Prepare to wait.", "author": "Visit T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "I really like it. Not sure if its because twas almost dawn and I was starving from dancing all night. Good stuuf though- give it a try!", "author": "DeesQue N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-28", "description": "This place sucks. Even Domino's is better.  What's the market for bad pizza? When they put up all the cheesy lights and signs, I thought that maybe, since its right next to the hood, it would just be super cheap blah food, but outside of their 2-slices-and-a-soda deal, it's not even that cheap. Definitely not worth it, no matter the price. I'm sad that the space wasn't turned into something cooler. Please close your business and let someone else make our neighborhood a better place.", "author": "Andy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-03", "description": "divisadero location.....i thought i had found the best place to grab a slice on the run...the ist time that slice was awsome, perfect crisp crust, good tomato and perfect cheese.........the 2nd time soggy crust, the 3rd average ok, the 4th was the worst, thick chewy crust, hardly any tomato, too much cheese....the lack of predictability in the product stops me from going back and there does not seem to be a \"standard\" to their pizza making......however, the staff is really friendly and the pizza, freshly cooked and hot....", "author": "Marie D."}
