{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Such amazing flavors!! Every single thing was so flavorful and tasty. I've never had Guamanian food before. I have been here a few times and always get their tasting menu. Each dish is not very big (duh, it's a tasting menu), but it's the perfect amount to leave me satisfied and full. Super interesting (but limited) wine selection as well.\n\nThe service and ambiance are great too. Never once did I have to ask for water, we got great explanations of the dishes, and it's a fun lively vibe inside.\n\nTHEY'RE CLOSING THOUGH :( Stupid SF raised the rent on them. My BF & I have joined their email list to see where they end up next, if they do pop ups, etc. Fingers crossed they come back soon!", "author": "Betty M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-03", "description": "Disappointed!! I came with a friend who had visited Prubechu previously, and had such a phenomenal experience, that she wanted to return once more, before their closing at the end of September.  I was really excited, since she had  such a wonderful dine here previously.  Sadly, our visit this time, was one big disappointment.  \n\nI surmise that our extreme lackluster experience may be due to their anticipated closing at the end of this month.  When my friend came here earlier this year, she was served good, generous portions of food.  Not at all the case this time.  Frankly, I think knowing they're closing altered their overall execution.  It is surprising though, given the fact that the waiter mentioned that the hope to relocate at a later date.  If that is indeed the case, I would think they would've made an effort to sustain the level of quality that earned them a good Yelp ratings to begin with.  Such a shame.   \n\nWe both ordered the Chef's tasting menu, for $65.  How they can justify the amount of food they serve for $65.00 is way beyond me. Very very small portions for mediocre food, which with taxes and tip, will cost you over $80.00.  Not at all justified for what we were served!  Bread, a couple of small appetizer size dishes, and the so-called \"main\" entree was a rice porridge dish with just a few diced pieces of meat, something better suited as a luncheon entree.  I was so dismayed when the waiter announced that that the so-called main entree was going to be our last savory dish, before the dessert.  Unbelievable, I thought, and I was right, as about three hours later, I was thinking we should have had a burrito at La Taqueria down the street instead.  I ended up snacking that night on some super delicious homemade soup given to me by wonderful friends, which saved me that night from going to bed hungry!  The highlight was the dessert, but that was literally a two bite item.  \n\nThis was my introduction to Guamanian cuisine, and probably my last, based on my experience here.  I'm wondering now if there's a reason why we don't see an influx of Guamanian restaurants all over the culturally cuisine diverse Bay Area.  I'm sure there's a mom or grandmother out there from Guam that makes delicious Guamanian food that I would just love, but she definitely wasn't in the kitchen at Prubechu!  \n\nSetting was pretty loud, not exactly what I would describe as conducive to conversation.  It was also somewhat unpleasantly warm inside, probably because of the small size of the restaurant, and the open kitchen with the gas stoves and flames burning like crazy.  \n\nPerhaps ordering a la carte entrees may have been the better way to go.  I was just so turned off by the whole experience, that I won't be giving them a second chance, even if they end up relocating.", "author": "Lori N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-30", "description": "The place is really cute and had plenty of open seats when we showed up so we probably didn't even need a reservation.\n\nBecause we had 8 people, we could only get the 6 course tasting menu for $65 each. They didn't have a menu of the items because they're seasonal so they just explained each dish as it came out.\n\nI've never had Guamian cuisine before so I was pretty excited to try this place. After all 6 dishes, I have to say my favorite was the dessert - coconut salted caramel ice cream. The ice cream had a lot of shredded coconut in it, which was a really interesting texture. The taste was extremely rich and probably the best salted caramel ice cream I've ever had in terms of flavor.\n\nHowever the other dishes didn't really impress me. I found them lacking in terms of flavor complexity. They tasted overwhelmingly salty or acidic to me. My second favorite part of this meal was probably the lightly breaded egg in the porridge. \n\nI'm really glad that I tried the place, especially since I hear that it's closing soon. I am down to try more Guamian food but for now I have to say Prubechu looked better than it tasted.", "author": "Lily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Alright I have too finish this review because it is unfortunately closing at it's current location.   And I'm hoping that it will open up somewhere else.  I've been here twice.   I've been holding back doing the review because I wanted to post the pictures with it but I might as well do it now.  \n\nI have been there for a birthday and another time with old high school classmates and it might as well be a birthday since we treated the other people.  \n\nBut all times for a Guam person it is familiar food but made different and taken up a notch.  If anything it's always worth a try.  Both times we always did the Pres Fixe menu so I could try out different things and all the time it's always been really good. \n\nI do hope they come back.  \n\nI did see that somebody was complaining about a dish and the price but I'm basically thinking that.  That's SF and again one of the reason's why it's closing its doors because the rent has finally gotten too much.", "author": "Homer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Unpretentious, welcoming, and delightfully tasty.\n\nPrubechu had me dreaming of taking a vacation to a beach where the water is clear and blue. Prubechu is living proof that trying new things definitely pays off.\n\nTo start off, the service was great. Everyone was friendly and everyone seemed to genuinely be proud of the food that was being served. You can tell these people really care. \n\nWe did the tasting menu, so I'll just highlight a couple of the things we liked the most! For sure, my ultimate favorite was the corn soup. It was creamy, lots of sweet corn, spam, and crunchy onion bits. It also came at the perfect temperature--I like my soup barely cool enough to not scald my mouth. The last course: wild boar porridge with the fried egg was also amazing. We also liked the coconut candy ice cream that everyone seems to talk about. It had sooo many textures (in a good way).", "author": "Claire C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Similar to historic San Francisco, this charming place in the Mission districts holds much history to the little island of Guam. Inside you will find many cultural decor, books and artifacts paying homage to the island. \n\nMy husband and I share many fond memories here and are very sad to see that they will no longer be around. We came here last Friday to have a final date night to ourselves and enjoy some great food, chill music and wonderful hospitality. Every visit here we had tried something different. A few of my all time favorites include:\n\n1. Chamorro Empanada: Crispy on the outside, ooey gooey in the inside. Gotta have it with the Dinanche Aoli \n\n2. Shrimp Kelaguen with Tatiyas: Cause I cant find any other Chamorro restaurant that makes seafood kelaguen (this dish is usually made with chicken)\n\n3. Shrimp Pancake: It was our first time having it this weekend and its very similar to Chamorro shrimp patties. Fluffy, tons of shrimp/peas/corn baked inside drizzed with the dinanche aoli on top and arugula. great to share between 2-3 people. \n\n4. Lastly, their Roasted Pig: In the past we've attended one of their roasted pig events and it was amazing! Hands down was the best lechon i've ever had in my entire existence. If only lechon was a regular menu item i would request for it every single time. \n\nThank you to the wonderful staff of Prubechu for serving us. We wish you the very best on your next journey.", "author": "Rhea T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-06", "description": "I understand restaurant business is hard in San Francisco. \n\nBut charging $19 for a beef dish with this little beef is outrageous. It is an insult to the customer's intelligence. It should call it a noodle instead of beef. \n\nI sincerely question how many ratings on Yelp for this restaurant is legitimate.", "author": "Mimi Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "Very stylish place and friendly cooks and service workers\n\nWe had lunch and enjoyed it very much\n\nCarmelized potato soup with spinach and fried onions \n\nTinaktak\nMushrooms green beans ground beef noodles \n\nLearned about a bird native to Guam........ ko'ko'", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Yuuuuuuum. Me and my husband had the pickled vegetables, the kelaguan gamson (octopus ceviche), tinaktok (noodles) and the shrimp pancake. Everything was amazing, but you have to get the kelaguan octopus - it's bomb and it comes with fresh tortillas.The service was also amazing!", "author": "Arika B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "Per my review a year ago, I said I wanted to bring my bf. Last friday, I took my bf, now husband, and he loved it! I was able to book a same day reservation via yelp. Another wahoo!\n\nWe both got the $65 tasting menu and we were just blown away by the flavors and quality of the dishes. His favorite was the chicken sausage wrapped in banana leaf and my favorite was the homemade spam dish. I got the tasting menu last time I was there so I thought I would be disappointed, but I was even more impressed that I loved all the dishes I was served. I also very much love impressing my foodie husband because man, he can be picky sometimes!! He loved their beer selection too, especially the ones from Modern Times (brewery in San Diego) which he said he has never tried before. \n\nThe service was outstanding. I am pregnant so they hard boiled my egg versus leaving it runny in the spam porridge dish. Very accommodating and they do ask if you have any allergies or issues prior to serving the tasting menu of 5 dishes + bread. The bread starter was yummy and the last course, a salted ice cream dessert was super tasty. A lot of tasting menus (much more expensive ones too) I've had before don't start or end this well. \n\nThis place is truly a gem of San Francisco and I just found out that it is the only Bay Area eatery that serves Chamorro (island) food. Yay!!!! It's not the cheapest of dinners BUT it is very affordable for the quality of food you get! Get the tasting menu too!! You won't be sorry. One more yay for Prubechu!!", "author": "Cicely T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-19", "description": "I really wanted to like this place.  But, most dishes were way too acidic for me.  It definitely triggered my acid reflux problem.  The tinaktak and the barbecue pork ribs were unbearably acidic.  But, the wonderful spices and how the meat and noodles were prepared showed great potentials of the talents in the kitchen.  Too bad the extremely high acid just killed it for me.\n\nThe service was very friendly and efficient.  Not sure whether we'll go back again.", "author": "TopCat W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "Loved my experience at Prubechu! Getting to try Guamanian food was so fun -- this is not a cuisine you run into every day in the Bay Area!\n\nI did the tasting menu with a group of 6. The experience was fantastic! As other reviews have mentioned, is true that an assemblage of a la carte items shared family style might be more affordable if cost is a concern, but I enjoyed the experience of trying the chef's selections. I also thought it was a great value at $65, since we were served 6 generously portioned courses. \n\nEverything we tried was flavorful and delicious. We had 5 savory courses and 1 dessert: the rolls served at the beginning were outstanding, as was the soup, rice porridge with perfectly cooked egg (breaded and crispy on the outside, soft boiled on the inside... So good!), and pork rib. Everything was comforting and satisfying. We were all stuffed at the end!\n\nI loved the ambience of the restaurant as well; it's very cozy and casual, with an open kitchen where you can see the chef at work. \n\nThe service was also excellent. Our servers were attentive, and did a great job explaining the courses to us and pacing the meal. They also called the day of to confirm if anyone in our party had dietary restrictions that should be accounted for in our tasting menu, which I thought was great. \n\nThe wine and beer list was also great and reasonable, with most wines by the glass priced around $10. \n\nI'll definitely come back to do the tasting menu again or try the a la carte options.", "author": "Christine G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "We loved loved loved everything about our dinin experience. The restaurant is owned and run by wonderful people from Guam, proud Chomorros and their heart, pride and humility is reflected in the  food. Simple ingredients, put together beautifully creating culinary alchemy. \nWe didn't even know where Guam was on a map when we walked in and left learning so much about the country, it's history and its people thanks to one of the owners of the restaurant who was also serving us. \nThe food isn't cheap but it never is in SF but truly worth it for the entire experience. Highly recommend trying it once.", "author": "Ashima S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-20", "description": "Wanted to like this more than I did. After vacillating about doing the tasting menu or a la carte, we were persuaded into the former since it was our first foray into Guamanian. (Note: they count the bread as one of the 6 courses, which is a little irksome. Just call it a 5- course menu!) \n\nThe courses were as follows:\n-Bread and butter: good but basic\n-Fried shrimp: served with aioli and escabeche-esque vegetables. The flavors were good, but I was disappointed at how soggy the shrimp batter was. No crunch. \n-Chicken sausage: cooked in a banana leaf and served with a cream sauce and fried onions. Again, this was good, but not anything memorable. \n-Rice porridge: with coconut milk, mushrooms, spam, and a whole egg fried Scotch-egg style. This was the standout dish. Really great flavor, and that egg was deliciously crispy and yolky. I didn't love the mushrooms as I don't think they melded well with the rest of it, but I still ate my bowl clean. \n-Poached cod: with broccolini and potato. Fine but not very memorable. \n-Coconut candy ice cream: wayyy too sweet for my liking, but has a slightly burnt taste at the end. I thought it was interesting but just not my thing. \n\nIn addition, we got the red rice with smoked meats. I felt that all the meat (pork shoulder and belly) was pretty tough. The rice was good though!\n\nAnd I would say overall the service was great. It's clear the owner cares about the food and his customers. I would almost bump to 4, but spending $90 each for a so-so meal makes me hesitant to really recommend this one.", "author": "Gwen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "San Francisco, especially the Mission district, is known for great restaurants, but this place is over the top. I can't believe they are closing because of their landlord. I will follow them wherever they go and you should too", "author": "Rosalie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-16", "description": "Never had Guamanian food before so wasn't sure what to expect, but everything we ordered was tasty!\n\nEmpanada - Filled with veggies in what tastes me me like a veggie samosa.  Crust was good and crispy.  Aioli was delicious. \n\nBBQ Pork Ribs - came with 2 small ribs.  Good smoky flavor, but it wasn't fall off the bones and not super easy to eat.  \n\nGollai Hagon Suni - It was pretty much squash and spinach in a coconut curry sauce.  It had good flavor, but it's definitely not enough as an entree.  There's no carbs or anything filling in this dish. \n\nKelaguen Manok (chicken ceviche) - this was probably my favorite.  Chicken is bbq'd dry and was flavorful with lemon zest, which offered a more refreshing taste.  I liked making my own little wraps with the coconut flatbread and spicy aioli.  I kinda wish there were some veggies in here as that would have balanced out my wrap better. \n\nTinaktak - Imagine beef stroganoff...but sour.  That's what it tasted like to me.  It was interesting...I wasn't sure if I liked it or indifferent, but definitely didn't dislike it!\n\nWe also got sticky rice wrapped in a banana leaf with kiwi and some sort of cream sauce.  It was good because it wasn't too sweet.  \n\nOverall, it was a really good meal.  Got to try something I haven't tried before and enjoy good company.  Service was also great.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "Went here a couple weeks ago.   I remember the food being good, but none of the courses really stood out.    I'd go back.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Went here with some friends for dinner and came back today for lunch. Very casual, intimate vibe both times. The staff are laid back but attentive. It was my first time trying Guamanian food and I was not let down. The flavors were really savory, but not overtly so. I ordered the tinaktak and my friends got the kelaguen manok. Both were superb. I did wish the portions were a bit bigger, but with dessert I definitely left feeling full. I love that this place doesn't seem to get too busy -- it keeps the atmosphere feeling island-y... or maybe that's just the music? Also love how close to BART it is. Super convenient.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-24", "description": "As a local of Guam, I needed to check out Prubechu while I was in SF, and I was not disappointed! Experiencing an elevated take on Chamorro food was definitely refreshing and unexpected. \n\nI didn't do the tasting menu, but recommend that if you are new to Chamorro food and want to try a bit of everything. \n\nI started with the potato soup, which was probably my favorite thing on the menu. It is so unassuming but DELISH with the coconut milk. You only need one to share though - it's large! \n\nNext, I got the tinaktak, which is served (untraditionally) with ramen noodles and I didn't hate it ...might start using noodles instead of rice when I go back to Guam. \n\nI also got the local fish (flown from Guam) and the shrimp keleguen, which was pretty spicy!\n\nNeedless to say, I ended up taking home leftovers, but it was so worth it! I only wish I lived closer, so I could go more often.", "author": "Sirena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "Soooo Goooood!\nI am Guamanian and everything we ordered was delicious!\nThey have all the traditional dishes and some with new twists.\nIt is Island Style so please keep in mind, good food takes time. Don't come here if you are in a rush.\nWe ordered:\n-To start, Empanada (Get 1 per guest. You're not gonna want to share)\n-Red Rice (platter) comes with meat and veggies\n-BBQ Pork Ribs\n-Kelaguen Manok (chicken ceviche) eat it with the tortillas\n-Tinaktak (twist) they serve it with noodles instead of rice...aaaand I'm gonna make it like that at home now!\n-Coconut Candy Ice Cream for dessert\nThere was 3 of us and we had plenty to eat with a good amount of food to take home...and yesss you are going to want to take some home. \n\nDefinitely coming back! \nI am going to order the Chef's Tasting Menu next time.\n\nKeep it island!", "author": "Dee S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "came on a night when they roasted the pig. i've had plenty of roasted whole pig at chinese restaurants, and so not surprisingly i was not thrilled by prubechu's roast pig that night. i guess i was expecting more of an island version wrapped in banana leaf or something, but what i found was something i could've gotten at any chinese restaurant. \n\nwhat i found delicious though was the rice and all the other sides they served along with the pig. im convinced i will be back for their fixed menu or al la carte, but probably not the roast pig. \n\nthe service was quite friendly and the owner/host was very engageable.", "author": "Long C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Where else could you find Guamanian food other than San Francisco! Very good service and very good and interesting food!", "author": "Kirk P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "What a treat! Once you enter the unassuming storefront on Mission Street, get ready to be taken on a journey of deliciousness. It smells incredible as soon as you walk in (partially because, as I found out later, the ventilation in this space is extremely poor).\n\nMy friends and I went for the tasting menu - it came with a bread course, 5 savory courses, and a dessert for $65. The price is quite reasonable for the quality and quantity of food; however, if you are looking for an even better value, go for the a la carte options on the menu.\n\nI would've loved to get a printout of the tasting menu; without it, I will try my best to describe what we had:\n\n1) Bread - It had a soft texture and sweet flavor like Hawaiian bread, only even better.\n2) Tostada thing with seafood ceviche - The slices of celery were incredibly refreshing\n3) Spam fried rice with lightly fried soft boiled egg - OMG, this was so good. The egg had a somewhat runny yoke and the rice was incredibly tasty.\n4) Chicken and something sausage concoction wrapped in a leaf - This was good but it didn't stand out as much as the other dishes.\n5) Porridge like \"stew\" with wild mushrooms - Yes! Give me more\n6) Halibut with fingerling potatoes - Eh, my least favorite dish. It was alright.\n7) Coconut ice cream - So freaking good!\n\nWe shared a bottle of True Myth Cabernet, which was excellent tasting and easy on the wallet.\n\nIt's not easy to find Chamorro food and this meal made me want to go visit Guam.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "Have you seen Ratatouille? You know that moment when Remy takes a bite of the cheese, then takes a bite of the strawberry, then shoves both in his mouth and fireworks appear? That's how I felt when I was at Prubechu. I was intrigued by how familiar Chamorro food is to the palate (heavy American influence), and was pleasantly surprised by the warm service and cozy design. Above all though, what I feel Prubechu does best is producing what Remy feels that moment he has both the strawberry and cheese in his mouth, FIREWORKS. Prubechu knows what ingredients work with what, and how to elevate flavors to the next level, all whilst doing it in an incredibly unique and new way! Absolutely loved it.\n\n(If you have no idea what I'm mentioning above, see here: https://www.youtube.com/watch?v=Yyah49_Oz78)\n\nNow let's dive into each dish. We did the tasting menu with a side order of flatbreads, which my boyfriend loved, paired with their special house butter:\n\n-Bread & Butter: Can we just talk about how soft and moist the bread is? Piping hot straight from the oven. Great start to the meal.\n\n-\"Chicken Pot Pie\" as I like to say: Creamy chicken with peas, crispy chicken skin, and pea sprouts. LOVED IT. Tasted like a lighter version of the inside of a chicken pot pie. The peas were very fresh and sweet and added such a lightness to the heavier chicken cream dish. The crispy chicken skin reminded me of the outside of a chicken pot pie, crispy and salty, love! \n\n-Spam & Eggs: PHENOMENAL. My favorite dish! Perfectly cooked soft boiled egg, crispy spam with a soy sauce like sauce drizzled overtop, paired with asparagus and avocado puree. WOW. This is where I really got that Remy feeling, those fireworks. The avocado puree added such creaminess yet freshness to the dish, emphasized by the asparagus. Egg was perfect and whatever sauce they used tied it all together. PERFECT.\n\n-Beef Egg Roll: Again, phenomenal use of flavors. Fresh light tartness from the cucumer salad on top, creamy sweet spinach below, and spicy meaty filling in the egg roll. Exquisite!\n\n-Porridge with Wild Mushrooms and Black Truffle Caviar (additional $10): incredibly flavorful again to no surprise! I found this dish a bit too heavy for me, and couldn't finish it all (which is when the bf hopped in). Lots of creaminess from the mushrooms and porridge and a nice hint of brininess with the caviar. Beautifully paired.\n\n-Pork Belly: And I thought the meal was over until we were served this! Crispy pork belly with carrots and swiss chard. That pork belly was GOOD, super crispy, juicy, flavorful and paired with the two sauces, carrot, and swiss chard...again, FIREWORKS.\n\n-Roasted Banana Ice Cream: I usually hate banana ice cream because I hate the fake banana taste, but since this was made from scratch from real bananas, it tasted real good! Loved the chocolate drizzle over top and they sprinkle some sea salt to really enhance the sweetness. Unfortunately mine had a bit too much salt but hey, can't go wrong with dessert!\n\nAll in all, I'll def be back! Looking forward to trying separate items on their menu like their fish imported straight from Guam. Impeccable food and service! Best kept secret in SF!", "author": "Cynthia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Small and romantic place with the benefit of serving food fare that you don't usually come across. We went for my husband's birthday. This restaurant serves Chamorro traditional food, so you may not recognize the things on the menu, but they translate to comfort foods with a tropical flare. I would highly recommend the potato soup, the short ribs, and the banana donuts. As a side note, their beer selection is excellent.", "author": "Taryn W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-24", "description": "I was intrigued when I read \"Guamanian\" as I was scrolling through random restaurants on yelp, then I clicked it and looked at the photos and saw the SPAM which unfortunately is not on their menu. I'm not sure if it's something you have to ask for but we decided to stick to the menu instead. After having dinner here I then realized that I am not really a fan of this type of cuisine, although we did only order 3 things off of the menu so I can't really tell based off of what we had. \n\nWe were waiting a little longer than usual for our food but I can understand because it was a Friday night and the place was full. Their staff was friendly and the service was good, they refilled our glasses with water every time we took a sip. \n\nThe empanadas were my favorite out of the 3 items, it was served hot and fresh. The Tinaktak was alright, it kind of reminded me of beef stroganoff but with an asian twist because they used coconut milk to cook it. I didn't really enjoy the chicken ceviche wrap, but to be fair I don't like ceviche in general and this wasn't my choice I just had a taste of it.\n\nI would still recommend this place though, if you want to try something different or maybe you're curious about what food from Guam tastes like then you should definitely try it out!!", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "asbor/flavour: 9/10 - Servicio/Service: 9/10  Sabe como se ve/tastes how it looks: igual/same - Precio/price: $$$. The food here was absolutely amazing! I had never tried food from Guam and i thought it was great! Definitely try the Tinatak", "author": "Maria O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-27", "description": "Good food and great service.  However, I wouldn't recommend the tasting menu.  All of the food on the tasting menu is good, but it will not wow you for the price point.  I'd recommend picking a few things off of the menu and splitting them with friends!", "author": "Max G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-18", "description": "Fantastic Chamorro food though not traditional.\n \nInstead of the usual fiesta plates, this place provides a fine dining culinary experience by improvising on authentic recipes to take it to a whole another level. They experiment with traditional recipes, add a twist to it and make it their own. It works and thats all i care about.\n\nService is excellent. Crew is all Chamorro who grew up in Guam and they tell the story and tradition behind each dish. Even the chef stops by to check on you. I was there with my Chamorro friend and he quite liked the flavors as well.\n\nWe tried the Tasting Menu that comes with a 5 course meal and you are surprised with a 6th course. Tasting menu changes everyday based on chef's choice. So go with an open mind, you wont be disappointed. Empanadas were on point with complex flavors served with a coconut sauce.  House-made spam was just delicious. It was juicy with a lightly breaded crust served with greens and avocado sauce.\n\nTo finish off the dinner, we had their bunelos aga (banana donut). Yummilicious!\n\nThey cook all of their food on electric induction stoves which is pretty amazing.\n\nI will go there for sure next time i'm in SF and highly recommend this place.", "author": "Sujeesha V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "What a hidden gem. GEM, I tell you. \n\nWe came for our 9th anniversary on a Wednesday night -- just half a block from the 24th street BART, but inside an oasis of calm clean lines and a quietly efficient open kitchen. \n\nThe menu had a lot of fascinating items -- chicken ceviche? Coconut flatbread?! But we opted for the 6 course tasting menu, which had nothing from the alacarte menu and changes, apparently, very often. \n\nIt started with mini rolls -- a sort of cross between Parker house rolls and Hawaiian sweet rolls, served with tuba butter. (Tuba, we are told, is coconut sap, which is made into wine). The rolls arrive tiny and hot, with big flakes of salt and black sesame on top. They are soft, moist and pillowy, but substantive. \n\nNext came an heirloom tomato salad, with bitter melon, anchovy salsa, and house made shrimp chips! The shrimp chips weren't as puffy as the kind you buy at the store, the ones that stick to your tongue when you put them in your mouth... you know what I'm talking about. But they did taste exactly like shrimp chips, and I was super impressed that they even thought of making them -- it's like trying to make your own pringles or something, seemingly impossible to achieve with human hands. The bitter melon is an acquired taste, one that I am only now starting to develop after a lifetime of being Chinese (American) but there are just a few pieces so it's a low key way to taste it without being overwhelmed. (It's hella good for you so it's worth trying to like it.)\n\nThe next dish brought another housemade version of junk food: spam! This was my favorite dish of the night -- a corn soup, enriched with coconut milk, redolent of  corn but accented by squares of pork shoulder that were dubbed spam. Much better than the canned variety, this version was smoky and salty, a perfect counterpoint to the sweet corn and crisp onions. \n\nBut wait! I think this next dish was my fave. A bowl of rice porridge that was thick and creamy, the grains of rice blended to be indistinguishable yet retaining a slight bite of texture, tinted orange from achote, and unexpectedly exploding with umami. Topped with maitake mushrooms, a crispy fried soft boiled egg (runny yolk!), and that topped with black truffle tapioca (a $10 add on that made this dish unforgettable) this was somehow comfort food that you've never had before but wish you could eat every Sunday. \n\nI really was stuffed at this point but the waiter-who-is-also-an-owner brought out a dish of fried cod on a bed of baby bok choy with microgreens. He poured on an amazing broth made from the bones of the cod which was rich and layered with so much complexity. My husband deemed it his favorite of the night. The fish was a tad overfried but still was thoroughly enjoyable. At this point I had to take it to go, because I was unable to go on. It made a lovely snack the next day.\n\nOf course I still had dessert stomach ... which our waiter-owner brought out with a candle to commemorate our anniversary. Very sweet. It was apigigi- cassava and coconut wrapped in banana leaves like a tamale, topped with strawberries. It sounds humble but it's one of those things you just don't want to stop eating until suddenly it's gone. \n\nThe service was friendly, well paced, and attentive without hovering. We were one of just a couple of tables, which makes no sense: great food, flavor profiles that you can't get anywhere else, open kitchen, vegetable forward -- everything that's in demand right now. So I kind of want this place to blow up, because the one Gaumanian (Chamorro) restaurant in the city really should get the chance to thrive, but I don't want it to get so trendy it becomes impossible to get a reservation. Right now it's calm enough to bring your parents out have a good long chat with a long lost friend, and unusual enough to feel like an adventure. We will be back to try the regular menu or to beg for more porridge.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "Pricey but worth it!\nI've never had Gaum food before but the pork rib was really good; sauce on the pork rib makes it melt in the mouth", "author": "Sammie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-18", "description": "Do NOT do the Tasting Course. It's an absolute SCAM. Seriously, WTF.\n\nHow do you force people to do the tasting course just because your over 4 guests? We were at 5 guests for a low key birthday dinner.\n\nAnyways we hesitantly accepted to do the tasting course since their regular menu is bomb. But why not, give it a shot.... \n\nThought it started decent with some delicious bread rolls then it went down hill from there. Basically the rest of the course was basically a squash soup, 1 sausage that was just ok, and 1 shrimp, and some sad porridge rice dish where the base was the earlier squash soup but turned into a thicker sauce. Oh and some bland coconut dessert that we left alone.\n\n$65 for that garbage of a set up per person.\n\nI don't mind paying x amount if the food is amazing. Food has no price if its good. This was a rip. Shit food courses that left you starving. We had to order their Fish at the end. Left there reeking of fried oil because dinner service took more than 3 hours. Unbelievable really. \n\nHow can their regular menu be amazing, and their pre fix tasting the total opposite? Very unfortunate as I would of easily been a regular here. But the feeling of that night's experience and being ripped off will leave me bitter to never return.\n\nTo the chef/ owner. Stick to your regular menu and expand on having the dishes more sharing style. Drop your poor excuse of an attempt of a wannabe Michelin pretentious pre-fix coursing. Its Guamanian food for F sakes.", "author": "Charles L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Had their tasting menu back in February. My mouth experienced a huge range of tastes here. Super cheap for a tasting menu 65$! Very interesting place and the feeling was very intimate.", "author": "Kimberly J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "Great food overall. I am giving four stars because after dining here 2 times I found a couple inconsistencies and was slightly disappointed after my second visit because I was raving about what I experienced the 1st time and brought someone to try the restaurant for their first time and when I ordered a couple same dishes it wasn't exactly the presentation as what I experienced. I really love the restaurant and it is very delicious food And I will definitely return again.  I just wanted to point out that for instance I ordered the Red Rice dish which has smoked meats and the first time I had it it was a mix of pork belly that was seared perfectly with sliced pork but also had a sample of ribs. The same ribs that we experienced as an appetizer before we had this as a main course. See my picture posted. Not sure if that was just something that was given to us special? but the second time I ordered it there were no ribs on this dish which is why I didn't order the ribs as an appetizer for my guest to try on their first experience eating here because I assumed they were going to be a couple on the red rice platter. Also the pork belly was not seared (or roasted more crisp?) the same and seemed very fatty nor had a nice crisp bite to it which with pork belly it's a hit or miss because then it can taste like a piece of fat you want to spit out. It was cooked excellent the first time. The red rice dish is served  broccolini which I love but first time there was also some micro greens garnish too? The salad we tried the second time was delicious with fresh beets and avocado, fresh vinaigrette. I appreciate the fact that the server presented the food and explained in detail what we were about to try which is a nice touch. Definitely love the Tinaktak - handmade noodles mushrooms, braised beef and sauce that has a nice hint of citrus served with green beans. The chicken ceviche is a winner - Kelaguen. Try it it's wonderful served with an aoli that has slight spicy kick and warm titiyas - coconut type a flat bread that you fill with the chicken and fresh coconut.  Overall I really enjoyed the food at this restaurant and it is worth visiting and to try a new experience in SF which truly sets this restaurant apart from the dozens of Japanese Mexican, Korean, Italian etc restaurants we have as many options to enjoy.  Prubechu is worth visiting if you've never had \"Chamorro food\" and curious about Guam style native cuisine.", "author": "Noey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-27", "description": "Really good food and excellent customer service. Hole in the wall location and parking is a pain but well worth the effort. The restaurant is clean and well kept. This place must have been a bar prior as there is no built in stoves or oven. The chefs use several electric stoves on countertops. The pricing on their menu for the most part is fair however imo avoid red rice, fish entree and dessert. Reason being it's well over priced for their size. I just can't justify 3\"x3\" piece of fish, $28 bowl of rice not $10 sliver of coconut rice. ALL their food items taste great and they've said their tasting menu is one of a kind.", "author": "Cee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Pleasant surprise. No familiarity with chamorro cuisine. Clean, sleek interior with some personality. Interesting beer list. We had the pickles - exceptional.  Red beans, octopus ceviche, and the coconut lemon beef noodles. Everything was well plated, cooked beautifully, and interesting. The pork belly had a fine level of smoke that balanced the acidity in the companion sauce. The pinot by the pinot by the glass was solid.\n\nDessert was a smoked tapioca base done on a banana leaf with creme anglaise and strawberries.\n\nUnpretentious, thoughtful, interesting food in a chill spot. Highly recommended.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "The empanada, chicken \"ceviche\", ribs, and banana fritters were amazing. May be my favorite place in SF. May take a trip to Guam now.", "author": "Kartik S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "We love this place!  The food is always great and the staff is always warm and welcoming.  Good vibes!  If you ever have an opportunity to attend one of their events you won't regret it.  I'd recommend this place to anyone. \n\nChamorro food is very accessible so give these guys a try sometime!", "author": "Ian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "For two, we ordered: the pickles, tinaktak and red rice. \n\nLoved each dish but I think my favorite was the tinaktak. The ingredients alone were simple enough...but together?! Oh my lanta. Ground beef, mushroom, peas and noodles, with a coconut sauce that was OUT OF THIS WORLD. First time I've ever experienced a dish like that. \n\nFinished the night off with the coconut candy ice cream...topped with black sesame and sea salt. \n\nNext time I come, I'll go with a larger group because I plan on ordering the exact same items - in addition to new plates. \n\nThanks for a great experience, Prubechu!", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Great spot with interesting food! Had their special which was a halibut head in a wonderful marinade/sauce.  Shared the red rice,ribs and a couple of other dishes. The service was professional", "author": "Kathleen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "Hella good food! Sad that it's closing due to rent increase. I'm hoping for a relocation near me and even if not I will drive the distance to eat with these folks again. Great people, great service, great chef work, authentic tasting Guamanian food and absolutely delicious!!", "author": "Unhappy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "I've never had tried food from Guam before so I can't speak as to authenticity but the food was tasty! We tried the coconut braised beef, which looked a lot like beef stroganoff. It had a nice coconut milk flavor to it but the portion of noodles was smaller than other plates so the sauce to noodle ratio was off. The red rice with pork belly was a pretty large portion of tasty, mostly tender pork chunks and red rice. We also got the black cod fish collar and tail. It was steamed in a banana leaf which my friends like but I think would have preferred those cuts grilled. The one thing we did not care for was the shrimp ceviche and bread. The term ceviche is a little misleading because the shrimp tasted over cooked. It may have tasted better if the bread was toasted or fried like a tortilla. Apparently this is one of their signature items and there were many raves on yelp so maybe it was an off day. \n\nThis place is pretty small and they don't have a real kitchen so don't be surprised if it takes awhile to get your food. Luckily we weren't too hungry when we arrived but don't come with a group bigger than 4. The people working here are really friendly though so I hope they are able to expand the kitchen a bit. Prices are also pretty reasonable for the portions.", "author": "Lainy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Never had Guamanian food before so was interested to try this place. Super cute restaurant with extremely friendly staff. And of course the food was delicious. The caramelized potato soup was like a comfort food but elevated. The red rice is a must, i wanted to take a whole tub of that home with me. The ribs were fall off the bone yummy!  And if you like spice you have to try their homemade hot sauce, it's has a huge kick!  I would definitely go back again and again!", "author": "Gina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "So good! My Mom was born and raised in Guam. We ended up spending the night in the city and had to come check this place out! So glad we did! Everything was amazing! My favorite was the coconut candy ice cream and the shrimp kelaguen with the coconut titiyas!! And the Chamorro ribs and empanadas!! We will definitely be back! Thank you!!", "author": "Andrea F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Great food. Cozy atmosphere, and we were pleasantly surprised with a live band that was excellent!!", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "This place was amazing. I was very impressed with the testing menu at such a good price of $65 The restaurant has a fun and relaxed vibe. The food was fantastic, great introduction to Guamanian food. It was new to me, loved the favor. Met Chef Shawn naputi and manager Shawn Camacho, they both are very friendly. Highly recommended", "author": "Katie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Another awesome meal at Prubechu and met Sean for the first time. Super hospitable and prix fixe rocked. Thanks guys.", "author": "Bob K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "This place is such a treasure!!!! I tried the Pork Belly Empanada, the Chicken Ceviche & the Beef Tinaktak. Every dish was super delicious, clearly made w love and served by warm friendly staff who were attentive to all our needs even on a busy Saturday night. I loved that the Ceviche was different than what I know a Ceviche to be...very well marinated, cut into tiny pieces and mixed w finely grated coconut pieces which made the flavor so rich & heavenly. The Tinaktak was paired w peas & mushroom made with creamy coconut milk over pasta. Not overly rich like regular cream can make you feel. \n\nFinally the dessert we had was the coconut candy ice cream which tasted like salted caramel ice cream but so much better because it had coconut chunks inside and was served w black sesame & special sea salt that I won't try to pronounce. \n\nOne of the best meals I've ever had!", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "We celebrated Mothers Day diner early on Saturday. We both had the Chefs Tasting. It was a delicious 5 course meal. The fresh ingredients showed in the flavor of each dish. My girlfriend is from Guam and this was a nostalgia trip.", "author": "David F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "They made super extra moves to cater my dads funeral.  My dad is from Saipan and good quality and quantity is super important.  They came through with the best island bbq.  They came in early to make t happen and I appreciate them.  They helped me honor my dad properly the guest were super islander and they loved it!!", "author": "Angela B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "Love this place. Sweet and mellow. Every bite is an inspiration. My brother ordered the potato soup, I thought why? But it was amazing. Rich, complex, delicious. And big bowl for us to share. The wine list is short and every glass amazing. They pick the best. Every dish is delicious.", "author": "A F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-27", "description": "'Bechu never had Guamanian before. The verdict? GUAM food is da BOMB food! I must return again for chaMORro'f the good stuff -- namely, ISLE be back to try out their Chef's Tasting Menu.\n\n4   S T A R S\n\n* NO RARER FARE IN THE BAY-AIR\nProbechu's Michelin-recommended Guamanian/Chamorro cuisine consists of savory meats/seafood, coconut and tropical roots/vegetables, and some Filipino/Spanish influences. Their rare fare is well worth the bridge toll, probably worth a quarter-tank of gas, and possibly even worth the price of SF Mission parking.\n\n* CHOMPING AT THE BITes\n:::: Tinaktak, $19 -- BOOM-SHACKA-LACK! Pasta and ground beef baptized in a dee-luscious coconut sauce.\n:::: Red Rice, $28 -- OINK PARADISE. Home-cooked lovin' stirred into the achuete-red fried rice, and featuring grilled bittermelon and pork belly. The pork, although quite dry, is superbly smoked in cherry wood and even more flavorful with the vinegar dressing added.\n:::: Kelaguen Shrimp, $18 -- FOODYEAR BLIMP! Deelish shrimp ceviche with a sparkle of lime, topped with pleasantly yummy shredded coconut -- but I disliked the thick Titiyas flatbread underneath.\n:::: Chamorro Empanada, $7 -- GO TELL YA MADA! 'Bechu she'd like it to!\n:::: Kelaguen Chicken, $16 -- WASN'T KICKIN. Decent chicken flavor, but didn't dig the Titiyas flatbread.\n\n* TRUE BEER-LIEVER\nGreat beer menu leans towards light to medium bodied brews. The following summery dranks paired well with the grub.\n:::: Sofie by Goose Island -- YUMPLEXITY. Crisp Belgian complexity with a clean, citrusy ending.\n:::: Grapefruit Sculpin IPA -- BUBBLY LUBBLY .. Balanced depth, hint of tart, finishing with mild hops.\n\n* BOMBANIAN DESSERTS, $9.50 each\n:::: Coconut Ice Cream -- A BUST-A-NUT-TWICE DREAM! Salty-sweet, tongue-curling foodgasm!\n:::: Apigige -- MADE-AH-ME-GAY! A tender patty of tapioca and cassava is gently imbued with banana leaf essence, bathed in sweet coconut milk, and topped with strawberries.\n\n\n1   M I N U S \n\n-(1/2) CHOKIN' ON BIG OL' TITIYAS\nThe Shrimp & Chicken Kelaguen were both served on dense, mouth-dryingly unpleasant flour tortillas called Titiyas -- which I left on the plate. If the Titiyas were half, or a third as thick then maybe they'd work, but as served they were a cotton-mouthed FAIL for the price.\n\n-(1/2) NOT A FAN OF THE FANS\nPrubechu's air is warm and stuffy because its converted, kitchen-less space doesn't feature a real ventilation system. Instead, whirring FLOOR FANS blast warm, marinated air through the dining area, and scent your clothes with smoke. I 'Bechu the stuffiness is even worse when the place is packed. If I'm paying San Francisco prices, then this distracting lack of proper ventilation shouldn't be part of the experience.", "author": "Art S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "A great twist on traditional Chamorro food! I've wanted to try this place for a few years and finally made it out. My girlfriend and I were very happy with their ingredients and presentations. The tasting menu does not disappoint. They also have a great beer selection but even more fun was the Tuba (coconut palm wine). You can't get that every day.\n\nIf you want try a new style of cuisine I highly recommend this place. Chamorro food isn't widely represented and there's nothing quite like it. What this place does is elevate the style, it's a winner!", "author": "Jared P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "So delicious! We had the empanada and tinaktak noodles. Had no idea what to expect of food from Guam but were very pleasantly surprised. Noodles were so good we ordered a second serving.", "author": "Marilynne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Prubechu had such a refreshing take on food that while you may or may not be familiar with they cook with a unique pairing of flavors - from coconut and lemon vinegrette and Asian with Island influences. It was absolutely delightful experience and so reasonably priced. Without drinks its was $35 a person and we ordered almost everything on the menu to share. The market salad was perfect, pickles included strawberries and bitter melon, empanada had this lovely heat/spice to it, the ceviche with flat bread are a must ( total comfort food/lots of flavor), red rice was pork cooked to melt in your mouth and my favorite the tinatak such a surprise - noodles in coconut sauce with a tart finish. \n\nThey have great wine and beer selection and the service was excellent. Warm, attentive and relaxed. \n\nThis place is focused on food and service, nothing hipster, nothing too cool. Just great overall experience.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-04", "description": "I went to this place a couple of years ago. My friend and I enjoyed it very much. This week, I took a group of 6 there. They insisted on a prix fixe menu during reservation, which was fine. They were also accommodating of a friend who is allergic to gluten. But, we were not impressed with the food. I don't think anyone in the group would visit again. The most disappointing part was the quantity of food served. A friend commented (I was also thinking the same) that she might need to go find a snack after as she was still hungry. We had 1 beer each, and with the 20% tip already included in the bill, it was $95 per person. I expect to be at the last fed well for that money. And the ambience was that of an $30 dinner per person restaurant. So, overall it gets 2 stars.", "author": "Arun R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "I'd highly recommend Prubechu for their food, uniqueness, and the friendly, good vibes. If you haven't tried Chamoru food before, I'd describe the taste profile as similar to the sweetness of Thai, the variety of flavors of Indian, with some twists that could be tart or savory, perhaps with the delightful surprises of coconut or fish. Meat eaters AND vegetarians will not be disappointed. \n\nPrubechu is a dear place to me. Having grown up on Guam, my favorite cuisine is better than I remember at Prubechu. It feels like I get to have the grown up version with beautiful ingredients and a twist on the Chamoru classics. \n\nAlso check out their special pig roast events!", "author": "Min Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Very unique and delicious flavors. Recommend the pre fixe if you're in the mood for something different.", "author": "Marcello B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "I went here for a birthday dinner and we had reservations at 9:00pm, but we weren't seated until 9:20pm. We ordered the six course tasting menu. The food was delicious and I highly recommend this place to anyone that has never tried Chamorro food. The best dish of the night was rice porridge topped with homemade spam, soft boiled egg, and caviar truffle. Kudos to all the staff for providing excellent customer service.", "author": "Billy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-22", "description": "First time having Guamanian food. It was delicious. Highlights were:\n\nFood: we did one chef's tasting and 3 dishes off the menu. It was waaayyyy to much food. The chef's tasting has 5 savory dishes and 1 dessert course and the portions are fairly large. It's also hearty food so we were extremely full by the end of the meal. The potato soup, shrimp ceviche, egg dish, pork belly and short rib dishes were delicious. Not a huge fan of the sausage and the dessert. \n\nDrinks: their beer selection is great\n\nService: Sean was great. Knowledgeable, friendly and attentive. \n\nHighly recommended!", "author": "Laura D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Staff is incredibly friendly.  Food is delicious and unique.  Reasonable prices.  We particularly enjoyed the Tinaktak and the potato soup.  We can't wait to come back and try the chef's special course.  Seems like the place can get crowded so reservations are recommended.  Luckily the staff squeezed us in at the community table.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "As my first experience with Guamanian food and I was pleasantly surprised. Came here for a business meeting and were required to get the Chef's tasting. Normally I don't appreciate when a restaurant tells me what I will be eating instead of letting me pick my own meal, but considering I didn't know what most items were, and since everything they brought was delicious anyways, I didn't mind. The course was 5 dishes, which started with delicious sweet bread that comes with a vinegar coconut butter cream sauce. So good! Next was a shrimp donut, which was probably my favorite course. Perfectly fluffy, not crunchy and not overbearing in the shrimp flavor. Next was the Chicken sausage in a banana leaf. Yummy, but nothing amazing. Next was a Fried Egg in a soup type of porridge that had mushrooms and spam in it. I was hesitant to try this dish at first because I don't like mushrooms or spam, and before I knew it I cleared the entire dish. Next was a cod dish, which was okay, but I would of rather had more of that shrimp donut!", "author": "Run.It.Off V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "So late on this review... Island time I guess. \nI was so excited when my sister found this place near my house. The food/experience was awesome! We now have a place to go to whenever we want authentic Chamorro food and I don't have to cook it. We started with the Empanada it tasted just like how grandma made it. For dinner we had Kelaguen Manok, Melaguen Uhang, & Tinaktak. The Red rice was BOMB!!! Ended the night with bunelos aga (banana donuts!) Everything we ate awe amazing. \nThe atmosphere was chill & inviting. Service was outstanding we cant wait to go back and try the tasting menu! Si Yu'os Ma ase!!!", "author": "Lei S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "This place crushed it tonight. Came to Prubechu to celebrate my boyfriend's(he's from Guam btw) birthday. Best choice we could've made. Go with the tasting menu. Won't be disappointed. Tuba butter, corn soup with homemade spam, denanche mayo, chalaquiles, and coconut candy ice cream not only gave him the feels of home sweet Guam but blew me away at every nuanced n balanced but exciting bite!!! These guys are killing it here. To give y'all insight into these guys..They are pushing out amazing dishes n meals with no conventional fires of a traditional kitchen. Just go in and see. Thank you Prubechu for the welcoming island vibes n exceptional hospitality. We will be back;)", "author": "Kristi S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-27", "description": "This review is only for the pre fix menu. We came tonight for my brothers bday, there was 5 of us. Had we known that if your party is 5+ people and you had to only order from the pre fix menu, then we wouldn't have gone. We decided to try the pre fix menu bc how bad could it be? I would say my whole family was very disappointed. ESP for my brother who has already been there before and tried the regular menu. Nothing was amazing about each dish. Hawaiian rolls? Soup (this was actually ok), the porridge??? This one sausage thing and one shrimp thing. We had to add the big fish on our order after not being satisfied. And yes! The fish is good! Sauce was amazing! But I realized that this place is really meant for small groups. Ideally 2-4. So please come here with 2-4 people. Def worth it. But not for larger parties. What was nice was that they took off some of the cheaper drinks we had off the bill bc they felt bad. So I appreciated that. Just make sure you have a lot to talk about with the people you come with, cause be prepared to wait in between each dish! \n\nTo clarify again: regular menu- yes! 2-4 people- yes! Pre fix menu ? No! 5+ people? No!", "author": "Celine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "Food and service are amazing! Chefs are super attentive to dietary needs and restrictions. I was extremely excited to try this place out being my first Chamorro fusion experience. I ordered the tasting menu due to the fact that I couldn't make up my mind! Moments into my first bites, I felt at home! Each bite had me reminiscing and reminded me of my childhood. This place is a gem and such a treat! This restaurant is a MUST  if you're in San Francisco and searching for a unique dining experience. \n\nThe only downfall is it's busy streets in the Mission so parking is literally a hit or miss. I recommend uber!", "author": "Alyssa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Excellent service, excellent food and drinks. It is awesome that you can make reservations as well. I tried the beef and the ceviche both were very good. The deserts are worth it as well. The prices are reasonable considering the quality of the food. Will definitely go back!", "author": "Sara-Fleur S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "Came here a week ago and still thinking about how delicious the corn coconut spam soup was! I had the tasting menu since I've never had Chamorro food and it did not disappoint! Both of my waiters were very friendly and I look forward to returning. I only wish that soup was on the actual menu, but I guess the exclusivity is what makes it extra special!", "author": "Erica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-29", "description": "We were invited to this eatery by a friend.A very different kind of cousin.This is my first exposure to this Guam cousin.They use lots of vinegar,the pickle that we order consisted of sour hard boiled egg slices,bitter melon,daikon,strawberries,etc.But my 3 years old grandson likes their caramel I rd potato soup and red rice.The salad was delicious they use creamy sesame ginger dressing.If you are interested in food adventure,you may want to try it.", "author": "Heemay J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Never have had Guam cuisine before and we were very impressed. Went in there without a clue what to order and just told them to bring us out whatever they thought we should try and it worked out wonderfully! The pork belly was crispy and delicious. Had no complaints with anything we were given!", "author": "Makenna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Amazing food and really great service. This is one of the few restaurants that have truly impressed me in San Francisco.", "author": "Ohnmar K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-19", "description": "Went here for my girlfriend's birthday which happens to be on Valentine's day. We were looking forwards to something a little different but it ended up being a little too out there for us. We didn't realise that the only option that day was the set / tasting menu (it would have been nice if they had mentioned it either of the two items they called to confirm the reservation) which was a lot of food. Staff and service were excellent and the ambience was nice (in that sort of modern American sense). We probably won't be back.", "author": "Sunil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "I love this place! It makes my heart glad to see Chamorro food done up and given a fancy make over. I love good quality food and I love comfort food (which for me is the Chamorro food my Grandma made growing up), this is the best of both worlds. We have gone for dinner where we did the Chef's tasting menu plus a few extras and we have gone for their roast pig feast. Everything has always been outstanding from the food to the friendly staff. You feel very welcome coming to this place. Which reminds me, I need to go back.", "author": "Lelonnie E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-16", "description": "Read carefully, for 5 people you are forced into tasting menu@$90pp for 6 course tasting menu where bread is considered a course. The flavors are interesting but the hefty price tag doesnt commensurate the ingredients, the ambience, or the service or the fact that bread is considered a course. At $500 plus gratuity for 5 people with a beer each, its hard to give the stars. I appreciate the attempt to make something unique but it feels like a shakedown vs a tasting menu experience in great culinary delights:(. It feels like the restaurant is hemorrhaging money which I empathize with, but its hard to justify the price for what you recieve in return.", "author": "Nora B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-23", "description": "Dinner review.\n\nToo many dishes to list out. This place is amazing. Authentic Guam food that is delicious and presented well.\n\nFive course tasting option is all off menu and is a great experience.\n\nFriendly and welcoming service from Guam locals.\n\nOverall, for Guam style dishes in the city this is undoubtedly \"as good as it gets.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-21", "description": "This review is for the 6 course tasting menu, currently priced at $65.\n\nWhile the tasting menu was mostly good, it was wayyy over priced. The best dishes (forgive my poor memory) were the egg in rice porridge and the tomato soup. One of the dishes was just a pickled radish (?) with a tiny strawberry, so it's tough to call this a \"6 course tasting menu\". The amount of food was way off - This was the first time I felt hungry post-tasting menu. The meat dishes (swordfish and pork belly) were decent, but nothing crazy.\n\nAl's Place nearby has a similar priced menu, is michelin starred, and left me feeling extremely satisfied. Come here to order a la carte - Don't get the tasting menu.", "author": "Tim M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "I first came here to meet friends for dinner, knowing nothing about Chamorro food.  We had the tasting menu then. When they served our first dish, I immediately got hooked. However, what I like most about this place, other than the food, is the hospitality and service. Staff is very helpful, as they explain the dishes they serve and tie the history behind each one.\n\nSince that first time, I've come here 4 diffident times, bringing new set of friends each time. My favorite dish here is definitely the Tinaktak.\n\nThis place has definitely made a fan.  Kudos to both Shawns for putting a twist to their native, and bringing them here to SF.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "First off, I'm from Guam and grew up surrounded by people cooking Chamorro food, so I have a pretty good palate for Chamorro cuisine. Off the bat, I didn't have too high a standard for Prubechu and was expecting something akin to Jamaican Grill (if you're from Guam, you know the reference), something commercial, something quick, something splattered on your plate in large quantities with little thought. \n\nDon't expect a traditionalist approach to Chamorro food that you'd find from your nånan biha or at fiestas. And It's not a touristy restaurant that you'd find back on-island that presents \"authentic\" Chamorro food. Think refined culinary practices meet Chamorro cuisine. \n\nI ordered the Shrimp Kelaguen and Red Rice plate (pork belly, tinala) and apigigi' for dessert. Every element of my dish was carefully constructed. Everything from the finadeni (soy sauce based dipping) to the seasoned vegetables on my plate were given a lot of attention to the tee. The finadeni was a small example of fine culinary practice that I immediately noticed even before tasting a single item of my dish. The finadeni, the staple gold dipping sauce to everything Chamorro, was perfectly balanced and had onion chunks that were finely cubed and consistent - such attention to minute details like this is something easily overlooked even in the Marianas and was an indicator of the type of quality gastronomy I was about to experience. Their pork belly was well-rendered with a fantastic bark that had so much depth and nicely cut the richness of the pork belly. It had all you would expect from a traditional Chamorro pork belly but the treatment of such a simple dish was of such a high degree. I would never expect to find that pork belly at a fiesta table. The tinala, a dish that is often easily dried out and left hard and chewy, was moist and tender. You could taste the smoke penetrated flavors in the meat. Their shrimp kelaguen was refreshing and surprisingly incredibly fresh! For dessert was apigigi' but never had I eaten apigigi' adorned with anything except its banana leaf wrapping. My apigigi' was accompanied with strawberry compote slices and a cream mixture atop a traditional banana leaf. Definitely not your night market apigigi'. It was amazingly well complemented. It felt like an orchestra of flavors were playing in my mouth. Apigigi' had never been played with any other instrument till I had Prubechu's. In all, I didn't feel like there was anything on my plate that was simply thrown on as simple garnishing. Every element of my meal was well thought out, intentional and executed superbly. (They have seasonal tasting courses that I will definitely be back for!)\n\nPrubechu treats Chamorro cuisine, as I have few times seen it treated in the restaurant, as a serious culinary cuisine. If you're looking for a replication of fiesta food, you'll find some of that, however, if you're looking to expand your idea of Chamorro cuisine, they push the envelope.", "author": "Leonardo O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "Lovely low key but bustling spot on Mission.\nVery interesting and tasty food.\nExcellent service to round everything out.\nI give 5 stars to places I would return to.", "author": "lisa s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "Wanted to get a decent meal after late meetings in the city. Found parking nearby and decided to give Prubechu a go. Food is Guam inspired with subtle non-regional American influences. Tried the chef's tasting menu... every bite was intriguing and delicious. I highly recommend this place if you're in the area!", "author": "Corey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "We stumbled across Prubechu while walking down the street. Our host/waiter very friendly and he did a great job managing all the tables at the restaurant that night. If you're like me, and you're not a fan of coconut, don't despair! Although most of the options on the menu include coconut, the host was kind enough to explain which items could be prepared without coconut. I really appreciated that. Prubechu has a really comfortable and welcoming atmosphere/vibe. And now I can say I've eaten Guamanian food!", "author": "Norita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "My boyfriend brought me here as a surprise for our anniversary last June (yes, I'm that late in writing this review), and it was *amazing*. I'd consider myself a bit of a foodie, and every now and then we splurge on a meal, but I rarely find myself going \"WOW\" after a dish, even at SF's best restaurants (e.g. State Bird, Frances). That said, I was super pleasantly surprised when numerous dishes we had that night had that \"WOW\" factor, including the soup and the coconut ice cream. Also loved that the service was so great, and that they let you order 1 person prie fixe and 1 person a la carte if you so choose. Thanks, Prubechu, for an amazing night out! Will definitely be back!", "author": "Diana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "Recently went to dinner here with a friend and was happily surprised at how good the food was and so was the service.  Never had food from Guam before but now I am a fan!  Food was so good.  \n\nThe owner and her husband were there and the wife actually served us.  Really lovely people and love to see people follow their passion.  Great place.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Food: 5 stars\nService: 5 stars\nAmbiance: 4 stars\nFinal: 5 stars\n\nFood from Guam to a whole new level. I'm no expert in this cuisine, but if this is my first introduction, then I'm hooked. Fresh local ingredients, cooked with sophisticated techniques, and seasoned to perfection. \n\nWe went for a holiday party. Lots of options for the meat eaters (of course), but they made special accommodations for the vegetarians and those with special dietary needs. And those dishes were not after thoughts, but well made and well executed dishes. \n\nLocated on Mission in a relatively nondescript location, but when you walk in, you feel like you're in someone's living room. Service is impeccable, and makes you feel like family. \n\nGuam food, Guam hospitality, all in the heart of San Francisco. The trip will be worth it.", "author": "Quy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "The food is SO fresh. Best ribs I've ever had in my life. Tracy and Shawn are friendly, kind hosts - we ordered what they recommended and I am so glad that we did. Please eat the coconut candy ice cream! I didn't know ice cream could have 4 flavors. My palette will never be the same after Prubechu has spoiled it with me heir delightfully sensational food!", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "This place was soooo amazing. What an array of flavor. I was very impressed with the tasting menu at such a good price of $65. I cannot remember what everything was called but it was one surprise after another. If you are open minded and love food then this is the spot. Way underpriced for the quality. I will be back as soon as I can. Keep up the good work.", "author": "Aj M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-16", "description": "I really don't enjoy writing negative reviews, but I figure I owe it to other Yelp readers to share my experience at Prubechu last night, so that maybe we can slow down the hype around this restaurant. \n\nThings I LIKED about the restaurant: \n1). The wait staff was kind and friendly\n2). Pretty much everything tasted good \n\nThings that could be much better: \n1). There is basically no ventilation in this restaurant, other than them having the front door open all night and having floor fans blasting. Because the kitchen is right next to the dining area (without a wall) the air is very thick, and I ended up coming home with my clothes smelling like fried fish. Not exactly the sort of clean, comfortable ambience that you'd want on a date. \n\n2). Their Tasting Menu for $65 is a rip off, in my opinion. They like to surprise you with what you'll be served, so it was an even bigger disappointment to see such mediocre courses served: \nFirst course -- three small bread rolls. This should be a free side, not part of the tasting menu. \nSecond course -- corn soup with homemade spam -- excellent! \nThird course -- some sort of flat bread with some veggies on top. The size was small, and it tasted OK. But again, the main ingredient here is flour. \nFourth course -- 2 or 3 small pieces of pork belly, and a few small potatoes. Is this was supposed to be the \"wow\" part of the meal, it certainly was underwhelming \nFifth course -- coconut ice cream -- tasted good, but I'm not sure why I had to wait 30 minutes after the last course to get this. \nMy understanding is that a tasting menu is supposed to be the highlights of what a restaurant has to offer. It was very unsatisfying -- and even more at this price. \n\n3). I ordered the fried fish head for $32. At the time, I thought I was getting a whole fried fish, head included. But instead, I got a bed of veggies, and a fried fish head. Yes, my wife and I were able to dig out about 4 forkfuls of meat, but this absolutely should not count as a main course. It might have made sense as a side, for $18. \n\nI told our server that I thought the fishhead was a ripoff. He apologized, and eventually gave my wife and me complimentary glasses of wine. This was very nice on his part, but did not really undo the fact that I think this restaurant represents the worst of the food scene in SF -- overpriced, overhyped new restaurants. We spent $180 for dinner (including a bottle of wine) whereas for that money we could have gone to nearly Lolinda and eaten great. Or more satisfying would have been the nearby Taqueria -- simple food, but good amounts of meat, great flavors, and non-crazy prices.", "author": "Jim M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "After walking by this restaurant a dozen times, I finally stopped by for dinner...and now I only wish I had come sooner.  The restaurant has a fun and relaxed vibe where the music creates an atmosphere but doesn't dominate your conversations.  The dishes I tried had expertly balanced flavors and textures while also staying true to authentic Guamanian cuisine.  I started off with the empanada.  Perfectly cooked so it was crunchy without any hint of oiliness.  It was balanced with a small salad that added freshness.  The flavors in the salad were so impressive that I'd order it as a stand-alone course.  I had the red rice as a main course.  It had a medley of smoked pork that was crispy and tender.  The amount of smoke in the meat was flavorful without overpowering the other flavors in the meat.  It came with a medley of grilled vegetables, pickles and a soy/vinegar sauce that perfectly offset the fat from the pork.  The side of flavorful red rice was the appropriate starch to complimented the pork.  I'll definitely be coming back soon and will be bringing friends.", "author": "Craig S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-20", "description": "What a surprise in the Mission. This would be only my second time having Chamorro food, but I have to say this is an elevated take on it. Everything came out fresh and delicious, my only gripe and the reason to bring it down a star would be for the pace of the prix fixe, don't get me wrong we both tend to eat really quickly, but there were times where we really felt like we were waiting for too long and in their defense they were getting busy so it's really not the end of the world. Other than that a really great arrangement of beers to choose from and friendly/informational service. I will say that I did leave full, but the dessert didn't quite feel fulfilling enough, it was almost more of an amuse bouche, but hey it was truly delicious and fun to eat. The flavors were literally all over the map, which was a great experience. I highly recommend this restaurant if you're in the mood for something a little off the beaten path. It truly was a culinary adventure and we appreciated it. Thank you for the special night, we'll be back to try a la carte items next time!", "author": "Guisela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "This place is AMAZING! 6 course tasting is the way to go. Everything came out to perfection, completely blown away by the presentation and wide variety of tastes. I am infidelity coming back here, not only was the food great but the services was even better.", "author": "Adriana A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Had a truly delicious, one of a kind tasting menu at Prubecho last night with my family. Everyone loved the food. Each dish was unique. From the fresh corn soup to the caviar and \"fried-chicken\" skin egg, we loved every bite. Aside from the incredible meal, the staff and ambiance are great. Highly recommend this place on date night or with big family like mine.", "author": "Lulu S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "The best part of living in San Francisco: FOOD. Have you ever had Guamanian food? Me neither. Do yourself a favor and EAT HERE. Like yesterday. Let me tell you: to DIE FOR. Guam style flatbread with tuba butter. Butternut squash soup with ginger, garlic, fried Brussels sprouts, persimmon, macadamia. Fried egg with black truffle caviar, white beans, avocado, homemade Spam. Homemade chicken sausage with coconut milk soaked spinach, fried chicken skin, boonie pepper paste. Guam style rice porridge with fried onion, black sesame, spinach. Pork tenderloin in a sweet beet paste with carrot, potatoes, island herbs and beet sprouts. And finally sugared coconut ice cream with sea salt and black sesame. Service: 10 stars, food: 1,000 stars. You can really tell the check enjoys cooking and enjoys sharing it with others.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "Delicious. Welcoming. Great service. A true neighborhood gem. Save room for dessert though, you won't regret it!", "author": "Cal B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "We had a fantastic meal at Prubechu!  Loved absolutely everything.  The food, the wine, the service.  We had the soup (plenty for 2), the empanadas and the Tinaktak.  All the ingredients were so fresh and the flavors so unique.  I have a new appreciation for Guamanian food.  The restaurant is small and cozy as well. And the staff is beyond welcoming.  I have since come to realize that we were partly taken care of by Sean, the owner.  It was incredibly affordable as well.  We plan on making this a regular stop.", "author": "Kari G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Been meaning to finally get out here and try one of the only few Chamorro food restaurants in the Bay. Friends of mine had the red rice plate and that was a hit. I can tell a lot of care went into the dishes we ate. The finadeni is done nicely, I like mine with a bit more heat though. I went with the tasting menu and it exceeded my expectations. It was a lot of food so 2 people could share this easily. All the dishes were very different in flavor and texture and the last main dish of the chicken sausage with herbs was absolutely fantastic! We had great service from Shaun and I purposely did not get the kelaguin and other classic dishes so I can go back and try it soon one day!!! Do yourself a favor and give this spot a try and you will be satisfied!!!", "author": "Leo C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "Prubechu is a food experience gold mine.  They serve Chamorro food with a twist.  You will be amazed by all the wonderful flavors that are incorporated into each dish.  The base of the dish is traditional but the chef has added an element or two to evelate it to something that is both  surprising and game changing.  We had the tasting menu and every course was delicious.  We had six coruses and were delighted wirh each one.  The coconut candy ice cream for desert was mind blowing - creamy and coconutty with crunchy surprises mixed in. Yum!  If you have not had a taste of Guam you must visit Prubechu.  It's definitely not Nana's cooking but let me tell you she taught her Grandsons well. \n\nBiba Prubechu!", "author": "Laura E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-02", "description": "Love this place. Haven't ever tried the tasting menu, but their main menu is really reliable and delicious. Personally, I think the soup that they call caramelized onion soup has achieved soup perfection. The fish has always been fresh and wonderfully seasoned and delicious.", "author": "Janet S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-31", "description": "We heard this place was fantastic....we are \"foodies\" (gasp) that horrible class of folk who proclaim to LOVE great food....and will scale small mountains to try \"great\" food.  We are also originally from Guam, the lovely, gorgeous Island that the food from Prubechu gets its kick start and its impetus. \nThe menu is a nice combination of culinary finesse and island style meets sang-froid. Very cool.\nIf you want delightful, satisfying flavor combinations at every turn, go here. \nDon't let the menu fool you. You don't need to order the tasting menu to experience their wonderful flavors. You can experiment with individual items off the menu.\n\nGreat customer service, lounge like surroundings.. Very intimate and comfy. \n\nWe will be back multiple times.", "author": "Kelley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "I've been wanting to try this place for a while now. My cousin and I took our moms here for their birthdays. I wasn't sure if I'd like a twist on Chamorro food given it is amazing as is but the food here was better than I could have ever imagined! I had a little bit of everything. My cousin had their tasting menu which I sampled from...delicious. Every. Single. Dish. I had one of my favorite dishes ever, Tinaktak, and it did not disappoint. I was also looking forward to ordering their empanada, which until now I haven't find anybody who made it as good my grandma! Also, the corn soup and chicken keleguin was booomb!", "author": "Katrina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "While visiting the Bay Area, I've eaten at my share of restaurants, most of which met my expectations. \n  However, I was amazed to see the staff of the Prebechu establishment can not only give exceptional service, but can do so with a small amount of employees. As someone who works as a server himself, I can assure you that this is no easy task.\n  The presentation of each dish was complemented with a simple yet enticing summary from the server. We were well taken care of throughout our dining experience.\n  As for the cuisine? It was obvious each dish was beautifully and skillfully prepared. I was thoroughly pleased to encounter dishes that incorporate flavors from the pacific, in the city by the bay . Prebechu restaurant will always have a customer whenever I am visiting San Francisco .", "author": "Kenneth P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "Traci and Shawn were so attentive to all their customers. The food was delicious and so was the wine. The restaurant was able to make a special menu for them as we all tried the tasting menu.", "author": "Samuel K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-30", "description": "I applaud the novelty and uniqueness of opening a Guam cuisine restaurant in San Francisco. I definitely tried a lot of new tastes here and had a pleasant experience but just don't think it's likely I'll return.\n\nThe set menu was $65/person for 5 course which wasn't a good deal. Portions were hefty for a tasting menu and I definitely left full, but it didn't have the elegance of a meal of that price. They didn't change out the utensils between courses so you often had some tastes mixing together. They did clear out and replace dishes at nice intervals and the staff was very friendly.\n\nThe food itself was a progression starting with a nice flat bread starter which wasn't part of the 5-courses and ended with a desert that also didn't count (so they do try to exceed expectations). So you are getting a 7 course meal in some ways. There was some interesting flavors ranging from the home made spam to the short rib in broth. Overall though there wasn't anything that I felt I absolutely had to have more of. There is no overlap of the tasting menu with the regular menu unfortunately.\n\nIf the menu was at the previous prices, I'd think it was a steal and be more forgiving. At these prices, I expect a lot more (even if it was less courses). Trestle in Financial District offers less courses (3 total) but for $35 with a more impressive atmosphere/setting. This place felt like a neighborhood Mission joint but trying to charge a lot for some nicely plated Guam food but without any killer dish or refined service.\n\nOverall, I don't regret trying it, if only to see what Guam food is like and I can see the potential. I think they just overshot the mark on price and the expectations it set.", "author": "Victor W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-28", "description": "2 STARS for food/value, 4 STARS for service.\n\nIf you look closely at the review of Prubechu, most Yelpers will agree on each dish being pretty disappointing. While $40 for a 5-course sounds like great value, esp given their predecesors (Roxy, Mr. Pollo) had done something similar you would think they wouldn't fall too far from the tree. Everything tasted and felt cheap, but at least now I can say I've had Guam food?\n\nMy only hesitation in writing this review is that the owners/managers were so amazing, and the wine was good and so reasonably priced! Well onto the reviews of each item we ordered:\n\n* Complimentary Somerset Oyster (5 STARS): Delicious dressing, flavorful and fresh oyster. What an amazing way to start the meal unfortunately it was mostly downhill from here.\n\n* Ahi Tuna Sashimi w/Egg (2 STARS): The tuna was shockingly low grade tasting, and I could probably make a better seasoned egg. A nice attempt at an upscale dish but not executed well and ingredients sub-par.\n\n* Ceviche Style Chicken (1.5 STARS): An interesting dish which may originate from Guam? Not something I've ever had. The chicken is shredded and cooked ceviche style (with citrus juice). However, the end result is a dry tuna-like shredded chicken taco.\n\n* Shrimp dish (1 STAR): I forget what this was called exactly but it comes in a small ceramic dish baked in a thick yellow sauce. I couldn't help but think how much it reminded me of United Airlines food on international flights.\n\n* Rice, Pork, Potato Soup (3 STARS): This is good but tastes like the soup my mom makes when there is leftover rice which she rehydrates with extra pork soup.\n\n* Porridge (5 STARS): I don't know exactly what was in this porridge, and I never though porridge could be this amazing, but it was really flavorful, savory, and delicious. I had to resist licking my bowl clean.\n\n* Coconut Ice Cream with Candied Nuts (4.5 STARS): This was so delicious, especially with the candied nuts - I could eat it all day and would buy it to take home if I could! It was an amazing way to end the meal.\n\nThere were low lights and highlights, mostly low lights. A unique Guam meal, but the value wasn't there for me. Sorry guys!", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-11", "description": "It's so hard to find this place (please put something more than the small printout with your restaurant's name up front!), but so worth it once you do!\n\nThe food's pretty good - 3.5 stars overall, all very interesting. But the service just blew me away. Our server was really friendly, seemed to be there whenever we needed him, & didn't charge us for two of our four beers (we tipped generously in response). They're very accommodating: any one person can get the 5-Course Tasting Menu (none of that everyone-at-the-table-must-order nonsense), which has TWO additional FREE courses. Our last course, the free one, normally comes with one scoop of ice cream but they gave us three (one for each of us!) so we could share it. Every dish that came out came with some unique backstory or ingredient & the chef who brought them out was very knowledgeable (though a different, much less articulate chef brought out one course & we could barely hear what he was saying. He seemed nervous & stumbled through his words quite a bit). \n\nSmall complaint: it was a chilly SF summer night & despite sitting in the very back, I was really cold. I asked our server if he could close the door & he promised that he would in a couple minutes (they don't have a vent & need to air the kitchen out through the front door), but never ended up doing it. \n\nMUST-HAVES: Tinaktak (a la carte), the tasting menu (wish for the Chalakilis & Coconut Ice Cream).\n\nA LA CARTE: http://www.yelp.com/biz_photos/prubechu-san-francisco?select=nE3dhWC14EmjZ6sb6DjgLQ#nE3dhWC14EmjZ6sb6DjgLQ\n* Pickles (seasonal vegetables. $5) - 3.5 stars\npic: http://www.yelp.com/biz_photos/prubechu-san-francisco?select=nE3dhWC14EmjZ6sb6DjgLQ#5QMErbIJIYD06avwvhZeBA\nMy friend ordered this. I'm not a huge fan of pickles & didn't love this. This was the only dish that went unfinished at our table.\n\n* Tinaktak (coconut braised beef, hand made pasta. $16) - 4.5 stars\npic: http://www.yelp.com/biz_photos/prubechu-san-francisco?select=nE3dhWC14EmjZ6sb6DjgLQ#mEUfPFG7OF4tLjpdOukdDQ\nFantastic. The pasta is very fresh & soft, the meat mixed into a thick creamy (but not too heavy!) sauce.\n\n* Red Rice (achiote, brocollini, pork belly, tininu katne, fina'denne'. $18) - 3 stars\npic: http://www.yelp.com/biz_photos/prubechu-san-francisco?select=nE3dhWC14EmjZ6sb6DjgLQ#YiG5x-QSJdoV-43fAv3zsQ\nThe rice has a slightly sticky texture & with its seasoning is good enough to on its own. However, we were disappointed with the meat: it was hard & dry. The \"pork belly\" was a few small, thin pieces of bacon that had zero texture & very little flavor.\n\n5-COURSE TASTING (with free 1st & last courses)\n* Oyster - 4.5 stars\npic: http://www.yelp.com/biz_photos/prubechu-san-francisco?select=nE3dhWC14EmjZ6sb6DjgLQ#lW6mhPGjFVdSGCr8M0LsfA\nI forgot what topped this oyster (which was very fresh), but it was very exotic, unique, & delicious.\n\n* Asparagus, salmon, fried nori - 4 stars\npic: http://www.yelp.com/biz_photos/prubechu-san-francisco?select=nE3dhWC14EmjZ6sb6DjgLQ#hDswws_Pt7IwN84TobTjhQ\nSalmon never really impresses me but it actually did here! Very, very soft tender meat, both the rare part & the seared edges. The crunchy nori was absolutely fantastic.\n\n* Shrimp, white corn patty - 3.5 stars\npic: http://www.yelp.com/biz_photos/prubechu-san-francisco?select=nE3dhWC14EmjZ6sb6DjgLQ#kGD65eQR57LZasbXZHzcdw\ncross-section: http://www.yelp.com/biz_photos/prubechu-san-francisco?select=nE3dhWC14EmjZ6sb6DjgLQ#sut3l9j-ASIEfb7a9v9bYw\nNice but not an overly impressive dish. The patty is soft & the crunch from the white corn & the shrimp inside is nice.\n\n* Escabeche - 4 stars\npic: http://www.yelp.com/biz_photos/prubechu-san-francisco?select=nE3dhWC14EmjZ6sb6DjgLQ#55V43ZLjIjUa6i177TUq5Q\nA very interesting dish, & one with a story (Spanish-influenced & found in its own version everywhere the Spanish have conquered). Pickled items just aren't my thing, but the fried fish was really great, intense with flavor, & actually paired well with the pickled veggies!\n\n* Chalakilis - 4.5 stars\npic: http://www.yelp.com/biz_photos/prubechu-san-francisco?select=nE3dhWC14EmjZ6sb6DjgLQ#iAR7Ri_6k0OeD-F0Pe21_g\nWe were amazed that this was only the 4th course! We were already getting stuffed. This had a nice thick grainy texture, though was a little lacking in flavor.\n\n* Fish in coconut milk soup - 4 stars\npic: http://www.yelp.com/biz_photos/prubechu-san-francisco?select=nE3dhWC14EmjZ6sb6DjgLQ#F2uP5wqRgVOQE3tkP4yhiQ\nLoved the vermicelli noodle pieces, & the charred veggies were amazing. The soup was a bit watery to me, & the single piece of fish seemed out of place though its charred skin was nice. Watch out for bones!\n\n* Coconut ice cream - 5 stars\npic: http://www.yelp.com/biz_photos/prubechu-san-francisco?select=nE3dhWC14EmjZ6sb6DjgLQ#o5KboxIAyMQlhh6AfIgfoQ\nLoved this! The most authentic coconut ice cream I've had, with tons of real coconut chunks. The cassava cake on the bottom was soft, thick, & chewy, & it paired incredibly well with the ice cream.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-05", "description": "4.5 STARS\n\nFirst times tend to be awkward and frankly not very good. \n\nThink about your first kiss...the first time you boinked.... \n\nAre you getting a mental picture yet?\n\nUmmm yah, I think the only memorable moment was being able to brag to your friends about how \"awesome\" it was to pop your cherry. More like awesomely awkward and disappointing especially if the dude's headgear cuts your lip but hey, no one has to know that. Shhhh...\n\nLast night was the first time I tried Guam cuisine and it was anything but awkward or disappointing. Grand opening on Tuesday, Prubechu took over old Roxy's location. The executive chef previously worked with Chef Manny at Mr. Pollo and the GM previously worked at The Palace so it was no surprise to see a similar concept. Balling on a budget as I would call it. For just $40, you get a five course tasting menu plus two amuse bouches and a dessert which is a fantastic deal. There's also an a la carte menu available. Beer & wine only. CC's accepted. \n\nPrubechu is SF's first Guam restaurant so expect to see Spanish and Filipino influenced cuisine with a refined Californian twist. The chef shops daily for his ingredients so the menu may change on a daily basis depending on what's seasonally available. \n\nFIVE COURSE TASTING MENU - $40: http://bit.ly/1eXPm1d\n*Amuse bouche: Oyster w/ coconut vinegar & kiwi: http://bit.ly/1lCMG1G\n(1) 9 Minute Egg w/ avocado & caramelized soy: http://bit.ly/LBD1Ys\n(2) Chicken Keleguan w/ coconut, scallion & titiyas & amuse bouche of pickled veggies: http://bit.ly/1btHZh6\n(3) Shrimp Patty w/ corn & peppers: http://bit.ly/1iwq9i2\n(4) Chalakilis w/ porridge, smoked pork belly,  achiote & quail egg: http://bit.ly/1g5Nsxm\n(5) Kadu w/ short ribs, rice, peas, potato, mung bean sprouts: http://bit.ly/1fVXTEW\n*Complimentary Housemade Coconut & Tahitian Vanilla Ice Cream: http://bit.ly/1iwqKjy\n\nA freshly shucked oyster with a tropical twist nicely started our dinner. For the first course, I would have preferred a more runny egg but the creamy avocado and the savory pungent caramelized soy added another dimension that more than made up for it. Like a flatbread, the Chicken Keleguan was very satisfying especially with the kewpie and chili peppers for a creamy, fiery bite. The shrimp patty was presented as a \"soufflé\" but the texture was more like scrambled eggs. This was my least favorite of the tasting menu. \n\nMoving on to the more stick to your ribs courses, the Chalakilis was like a rendition of pork and grits. Slightly caramelized around the edges, the tender pork belly had a nice smokiness to it and was heightened when dipped into the runny quail egg. My favorite dish of the night was the Kadu. Comfort in a bowl, the chunk of English cut short rib was incredibly tender and totally hit a soft spot with the slightly sticky rice. \n\nThe tasting menu ended with a complimentary dessert of Housemade Coconut & Tahitian Vanilla Ice Cream that was enjoyably rich and not too sweet. Loved the sprinkling of pie crust (?) for that textural contrast. \n\nService was professional, knowledgeable, and attentive. Since Guam cuisine is new to many people, the staff was more than happy to explain it to us. Food service was timely. Expect to spend about 2 hours for the tasting menu. \n\nOn the intimate side, Prubechu makes for a great date place. There's just six 2-tops, two 4-tops, one 6-top, and several counter seats overlooking the open kitchen  so do make reservations as I expect this place to get busy once the word gets out about this place. \n\nOverall, Prubechu's food is a solid 4 stars (there's always room for improvement right?) while service was 5 stars. 4.5 stars and rounding up for having the balls to open a restaurant with a cuisine that's unbeknownst to most. Especially to someone who thought Guam cuisine was Filipino cuisine. And, I'm part Filipina... =X", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "CHAMORROS KNOW HOW TO FEED PEOPLE!!!\n(5 stars)\n\nThis is the first Guam/Chamorro restaurant in SF. Serving authentic home-cooked meals and elevate it to another level of art with elegance and extraordinary taste to give your palette an experience. \n\n- FOOD, so delicious and very filling (see my pictures)\n- PRICES, fair\n- SERVICE, the best, very professional\n- AMBIANCE, simple - i like it\n\nThank you Chef Shaun and other Shaun for keeping me company and educating me on the art of Chamorro cooking. I have alot of Chamorro friends in WA and these two guys are now my first in SF. They just opened so their menu is limited for the moment. They have a 5 tasting course ($40 - and well worth it, those portions were mini meals) OR you can do an Ala Carte with two dishes. I chose the 5 tasting course to be able to consume multiple dishes in one sitting. Also, I was given other dishes to sample that were not on that tasting menu. \n\nISLANDER GENEROSITY.\n\nTasting #1: MIYAGI w/ VINEGAR, COCONUT, AND KIWI DRESSING - I love fresh shucked oysters on its own with very minimal dressing because dressings usually mask the flavor of a raw oyster. The vinegar, coconut, and kiwi was a perfect light combination to compliment the miyagi oyster. the flavors were subtle. Light hints of coconut and kiwi were a hit for this dish. Also, I learned that the vinegar comes from the coconut tree. Very interesting information.\n\nTasting #2: EGG w/ AVOCADO AND CARAMELIZED SOY - this was not your typical boiled egg. The egg was soft boiled and very delicate. It was split in half and sitting on a fluff of creamy avocado puree, divided by the caramelized soy and drizzled with chickweed (the green stuff), and sprinkled lightly with Iranajan salt (that's a village in Guam - some lady takes the water from where the ocean and the river meet and goes through a process of fermentation to get the salt). Again, very interesting information. For me this dish had a play between salty and sweet, my palette loves salty and sweet combinations so I really enjoyed this dish. \n\nTasting #3: CHICKEN KELEGUAN - served on flat bread made from coconut milk instead of water and topped with fennel sprouts. The flatbread was had a nice soft crunch on the edges and it is a little more dense then other flatbreads but it has a different flavor as it was made with coconut milk. the chicken keleguan was really good and and made with quality. It was topped with fennel sprouts which gave it color and some herbal flavor. TITIYAS!\n\nTasting #4: PICKLED VEGGIES - pickled cauliflower, pickled green daikon, pickled regular daikon, and pickled watermelon red radish. Everything pickled. My favorite was the pickled watermelon red radish.\n\nTasting #5: SHRIMP PATTY - shrimp patty and shaved Jerusalem artichokes & cucumbers. Usually shrimp patties are fried, their presentation was more of a souffle style. I'm use to the heavy shrimp patties and more oily but this one wasn't like that and had a \"healthier\" approach to it. The jerusalem artichokes and cucumbers were a nice palette refresher when eating something like a shrimp patty.\n\nTasting #6: CHALAKILIS - it's Guam's version of rice porridge. Served with rice, pork belly and braised smoked meat with tiny quail egg and flavors of tumeric. THIS WAS ONE OF MY FAVORITE DISHES OF THE EVENING. I love Chalakilis and this was SO BOMB. Very filling, it literally was a mini meal on its own. The porriadge was this deep tan color and it had an incredible flavor, the pork belly and smoked meat just put everything together. The boiled quail egg wasn't overly cooked, when I popped the quail egg in my mouth the yolk squirted out. YUM.\n\nTasting #7: KADU - shortrib, rice, peas, potato, mung bean sprouts, savory/rich soup base, and a dabble of finadene on top. This reminds me very much of a Filipno soup dish but a different twist to it. The shortrib was perfectly prepared and the soup base was very savory and rich, I can just eat the soup and rice by itself and be happy. THIS WAS MY OTHER FAVORITE DISH OF THE EVENING. I was so full after Tasting #6, I took a few bites of Tasting #7 and pack the rest up. \n\nTasting #8: ICECREAM - dessert, \"manha\" (young coconut), Tahitian vanilla, cookie crumbles, and sweet pansies (flowers). HOUSEMADE. The icecream was the perfect way to end a very savory #7 course tasting meal. I love icecream so I know when to judge icecream. The young coconut flavor could be tasted and the after-taste of Tahitian vanilla. The cookie crumbles provided texture and enjoyed it. Who would have ever thought of eating flowers with your icecream, THEY DID. \n\nI left slightly bent over and can barely walk. THAT'S HOW GOOD THIS PLACE IS.\n\nWill I be back? YOU DON'T HAVE TO ASK ME TWICE.\n\nJABA APPROVED. Until the next review...", "author": "Jane A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Unexpected delicious place. We took the Prix fixe menu and it was fantastic. Run by 4 amazing persons from Guam.", "author": "Pierre F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "This is my current favorite restaurant, which is great since I live blocks away. I had never heard / had food from Guam before, even though I've flown through their airport a few times criss-crossing the pacific on the way to other islands. Even if I had, I'm not sure it would have held up--these folks are wizards in the kitchen!\n\nThey definitely know their audience--young, more affluent, hip, and on the hunt for interesting, fun food. The range of flavors is great, their tasting menu is generous and inexpensive (compared to places of similar caliber of food), and the folks working there are passionate about what they're doing.\n\nThey've got a great selection of funky sour beers, which pair wonderfully with their foods, and the waitstaff have never led me astray.\n\nI'll definitely be coming back on the reg.", "author": "Josh H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-10", "description": "A nice addition to the Mission and the Bay Area. I think it is the only Guamanian restaurant.  Due to this and my heritage to Hawaii, I was excited to try the Chamorroan food.  My friends and I decided on the $40 5 course tasting menu.\n\nThe course began with a amuse buche of an oyster with a citrus seasoning from Guam. I couldn't taste the citrus, only the oyster.  \n\nThe first course was a boiled egg with caviar. It was a little salty, but not bad. \n\nThe second course was the chicken kelegun which was a shredded chicken, spices, and served on a flat bread. This reminded me of chicken salad and not to my liking for texture and taste.\n\nThe third course was supposed to be the shrimp omelet, but they ran out of it.  They were saving it for the chefs friends table whom we saw were served the dish, though they were seated after us by 20 minutes. We were served with a a shoyu picked eggplant, vegetable variety dish. I thought it was tasty, as shoyu and picked is always good. But it was a slight heavy on the shoyu.\n\nThe fourth course was the one that I enjoyed the most. It was a braised pork stew served with rice porridge.  The dish was smoky and the taste was prominent throughout the entire dish and bite.  A really good dish.\n\nThe fifth course was a clear broth soup with beef (I think) and rice.  This course irritated me the most. Only because the execution of the dish was off. We had to ask for spoons, rather than the staff set spoons down before serving the dish. They realized the mistake, but still this small execution bothered me. The dish wasn't bad, as the flavors were nice due to the additional sauce you can pour it. It was a shoyu pickled base sauce which really brought out the flavors of the beef and the broth.  \n\nDessert was coconut ice cream.  Sweet and with a good flavor of coconut, it ended the course well. \n\nI think if they continue to improve on the execution of the service this restaurant will do well.   It is still young, so if people could help support it as the lone Guamanian restaurant in the city they will improve in both food and service.", "author": "Marck N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Go here!\n\nThis is an overlooked gem serving delicious Guamanian cuisine. We ordered almost one of everything on the menu between our group of four and liked every dish. We finished with a round of desserts that left us wishing we had room for more. Combined with the refreshing tuba (coconut wine) and passion fruit beer cocktail and extensive beer and wine list, Prubechu is a good value for the high level of execution and quality ingredients. It's a great mix of Asian and international influences with a distinctive flavor that I haven't found anywhere else. Definitely going on my regular rotation.", "author": "Navi O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "Flawless meal. Did the the 6-course tasting and it was perfection. Coupled with the wonderful service-you couldn't ask for a better date night spot. Definitely plan on a repeat performance.", "author": "Ajita M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-08", "description": "One star is not even worth for this restaurant. Well, maybe one star for decent service.\nWe had shrimp ceviche, potato soup and Spring vegetables. \n\nPotato soup ($9) was quite blend. \n\nShrimp ceviche ($18) was just okay. It had pita type of breads on the bottom, which was not fresh at all. It tasted like the breads were sitting in the freezer for long time. \n\nSpring veges($17) comes with seasonal veges and coconut sauce. It was a best dish that we had in the restaurant but It's hard to mess up with coconut sauce. It was nothing special for the price. \n\nI wouldn't come here again :(", "author": "Erin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "Prubechu is off the hook!!\n\nBeen wanting to come here since they converted from being Roxy's, and finally decided to take my work team for dinner here.\n\nInside still looks like the old Roxy's space, small, simple and no major kitchen - all induction burners and open kitchen style.  But this doesn't affect anything, the food is absolutely fantastic!\n\nThe duo of front of house Shawn and chef Shawn hold it down.  The whole squad is from Guam, and they are representing proper.\n\nHad the 5 course tasting menu - but with the starter and dessert it was 7 awesome courses.  \n\nStarted with a flatbread with some insanely tasty coconut butter, and a daikon pickle thing.  Then was a fried, soft boiled egg with various delicious add ons, followed by a chicken sausage type thing in a banana leaf with an dope but scorching hot sauce. Then a fried red rice type of dish with a quail egg and house made spam (!!!!!).  Followed by a porridge dish with pork and finally a short rib dish.  Finished with a coconut candy ice cream.  \n\nThe food was amazing, and broke any cliches about Guamanian bbq and other simple island cliches.  It was homey flavors plated in a super refined elegant way, served in a casual, cozy environment.  Service was friendly and white table cloth level care, without being fussy.\n\nCan't recommend this place enough.  It might be the best $55 tasting menu in SF!", "author": "Arthur Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "This was one of the BEST meals I've had in a very long time. I had the shrimp kelaguin which was packed with amazing flavors & served on top of a homemade titiya. The red rice is just like grandma use to make. The banana donuts with coconut creme are the perfect finish. The service is top notch real Chamorro hospitality. Can't wait to come back.", "author": "Rene P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-24", "description": "First time trying Guam food. I quite liked it... Tasted like Hawaiian food but less sweet and less ghetto lol", "author": "Betty T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "Delicious food and service. My favorite was the pork dish (cant remember the name) with pickled veggies. It tasted like jerky, so delicious. The red rice is also a must. \n\nShoutout the the live entertainment! The guitar player is super talented. \n\nWill definitely return.", "author": "Susana M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-19", "description": "We have been in here twice now, did the tasting both times. The food is excellent, and the service is very friendly. This is a great spot.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "I came into this establishment last night after walking around mission street looking for something interesting to cure my hunger. My friend and I stumbled into this small yet intimate Guam restaurant. We had never tried Guam food, so we thought... Why not?! Let's give it a try. Our expectations were beyond exceeded. We ordered just about everything on the menu including the to die for red wine and banana bunuelo desert! Every plate was brought to us in a course style, which we enjoyed so much! Our waiter was extremely friendly and took the time to describe every dish to us. You could definitely sense his Iove for the food. I'm so glad we discovered this place. We will definitely be coming back the next time we are in SF.", "author": "Miranda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "I took my mother to eat here because this is one of the few restaurants in California that we know of that serves island inspired food specific to the Marianas. We were the first ones in the restaurant and arrived almost when it opened. When we left a 6 man party was being sat. Who were the only customers our whole visit.\n\nFood:\n\nPros: Taste, presentation, serving size, and the overall rarity of the menu selection.\n\nFrom when my party ordered, to when the food arrived was about average among restaurants.\n\nCons: Price for food is a little high, but I believe since this is the only restaurant in the city with this specific menu than its almost understood.\n\nCustomer Service:\n\nPros: Workers are all friendly, Greeting as soon as you walk in the door, constant attention to the table, and genuine connections instead of generic responses. The man who waited my table somewhat remembered me coming in from before, and the last time I was here was over 8months ago!\n\nCons: None that I can think of.\n\nAtmosphere: \n\nPros: Real relaxing, soft to upbeat island music, smell of the food being cooked really made it feel like you're waiting in the comfort of your home. \n\nIsland themed decorations, informational books on the island, and home style in use wear (Lemon powder can) to deliver receipt.\n\nCons: If you're not used to an island style home, you might not understand the overall feel of the restaurant. If you choose to dine here, remember that to islanders, we try to treat everyone like family, and give you all the best welcome to our home as possible.\n\nOther notes:\nI suggest the Tinaktak for a good sized meal, or the red rice if you're a little more hungry. I tried all of the desserts and my favorite is the coconut candy Ice cream with Inarajan sea salt. I personally hate coconut in most of its forms but the combination of ingredients helped me find a new love for it. If you're looking to try something new to drink, inquire about the sweet tuba, it's really good. All in all great job guys! Keep up the good work.", "author": "Brandon I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-28", "description": "Great service, nice waiters, but the worst food i have ever had. We got the tasting menu and it was so bad we actually left after only half of it , though we were still charged (and paid) the full bill.\nIf you like spam and eggs, this is the place for you. Or, you could save 100 bucks and buy spam and eggs and safeway and make it at home\n\nI want to stress the wait staff was nice and cool but the food was horrific. I am not sure the protocol for ordering tasting menu and then eating 40% of it and leaving before it all comes out, but we were charged for it all. \nVery very very disappointing.", "author": "ryan s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "We absolutely loved our first Guam food experience of SF. We recently moved close by and are so happy we did. The food choices in the Mission are amazing. The service was warm, friendly, and we enjoyed the explanations of the food. We had the flatbread with butter and added hot sauce for the meal, potato soup, chicken and shrimp ceviche (Kelaguen), whole parrot fish with rice added, and the dessert was called Apigige. One of the waiters suggested the dessert as she used to have her mom freeze dry it in Guam and she would bring it back. We were sold! It was that delicious. Try a new culture, you might love it! ;)", "author": "Kelsey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "This place is 10 out of 10! Incredible taste.  Every dish cooked to perfection.  If you come here there is no way you leave disappointed.  Chefs special is the way to go. My 2017 dinner of the year!!", "author": "Bob S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Went last night for the six-dish tasting menu. Super unique and tasty food (and they made modifications based on food preferences at the table), exceptional and warm service, and nice environment. Will definitely return.", "author": "Inna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Where do I begin...? The boo and I did the Chef's Special 7 course meal, and loved it all!! I don't want to share too much because I want to be able to get a table here in the future, but damn, this is freaking amazing food.", "author": "Mari G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "The tasting menu may have been one of the best meals I've had in SF. I hope to get back there soon to try some of the menu options. It's a little hard to spot and isn't high profile, but it's definitely a hidden gem of the Mission. Great low-key place to impress a date. \n\nAnother review had issues with the spam and egg dish. I thought it was one of the highlights of the meal. It seemed to be a house-made ham patty, with a perfectly cooked soft-boiled egg, breaded, fried, topped with sesame and served with greens and avocado puree.", "author": "Mike O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-08", "description": "Prubechu is a restaurant in San Francisco that serves delicious Chamorro food, providing a very satisfying dining experience for both newcomers who have never tried food from Guam and the CNMI, and for veterans who will appreciate the unique take on Chamorro Cuisine that Prubechu offers here.\n\nAs someone who grew up on Guam, I was excited to hear from my friends about a Chamorro restaurant opening right here in San Francisco, and visiting Prubechu was one of my first experiences in San Francisco after moving here.\n\nThe restaurant itself is very small, and is located a short walk away from the BART station on Mission St, between 24th and 25th streets. Inside can be a bit crowded at times, especially for events such as the screening of \"Talent Town\" in San Francisco by the Muña Bros., so I would recommend making a reservation in advance if you want to be guaranteed a seat.\n\nIf you are a veteran to consuming Chamorro food, please leave your expectations of cheap fiesta-style platters, with large servings of food, and a buffet-style presentation at the door. Prubechu demonstrates a focus on quality and service, and has an atmosphere reminiscent of the Islands. You can tell that Shawn and Shawn (both owners and one the head chef) do their best to serve delicious Chamorro food to the Bay area, and as a Chamorro diaspora Prubechu does an outstanding job. You almost feel like you are back on Guam or the CNMI when you eat here, they even play classic Chamorro music here! Then... you feel the cold outside and remember that this is Chamorro cuisine being served in San Francisco!\n\nIf you are new to consuming Chamorro food, Prubechu is a fantastic introduction into the cuisine commonly consumed in Guam and the CNMI, and in its own right is a fine dining establishment. Appreciate the cuisine it for what it is (Chamorro food), rather than thinking about it as a variation or knock off of something you may have tried before (Mexican, Asian, Filipino, etc.), and you'll likely enjoy this food! \n\nI usually order from the ala carte menu when I dine here since I come often by myself, mostly the empanada (Chamorro style), kelaguen månnok (chicken kelaguan), tinaktak (beef with coconut milk and, here at Prubechu, served with egg noodles), and hineksa' agå'ga (red rice). \n\nAfter eating here regularly for several months, I have yet to find anything that I do not like, and I look forward to Prubechu's evolution into the place for Chamorro food here in the Bay area.\n\nBiba Prubechu! Bei bisita sesso' i fañochuyan este!", "author": "Alexander S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "Best tasting menu in SF. Worth every penny. These guys are the real deal. Perfect date spot.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "All of the small cuisines on the Chef's tasting Menu was delicious! I would definitely recommended this place to go on a date or catch up with a couple of friends. Luckily, my boyfriend and I were able to get seated right way because it was getting really pack so I recommend on making a reservation beforehand.", "author": "Wednesday D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-18", "description": "This place was really impressive. The food is very original (if you are not accustomed to Guam's cuisine) and really tasty. From the outside, it is unassuming, but you walk in and have a great experience. \n\nI would highly recommend the reasonably priced tasting menu. Other reviewers mention $40, but I think they raised it to $50, which is still well worth it for the 6 course meal. Interestingly, *none* of the dishes on the tasting menu are on the regular menu, so order the tasting menu, sit back, relax, and get ready for an adventure.\n\nOur tasting (sounds like it varies every night; what came out was a surprise even to the waiter!):\nChalakilis toasted rice porridge - favorite dish\nMotsiyas chicken sausage - tasty, nice spicy sauce on side to give it a kick\nFrittata cappellini\nSmoked pork jerky - cool dish\nLocal dungeness crab - close second favorite\nGuam ice cream - tastiest dessert I have had in a while!\n\nThe owners and waiters are genuinely Guamanian, and specifically Chamorros (be sure to read the wikipedia page on Guam before you go).", "author": "Mike G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "Food was incredible and unlike anything I've had before. Had the tasting menu, and they adjusted it to vegetarian (vegan would also be easy to do). \n\nServer was absolutely lovely. Will be back again hopefully soon.", "author": "Annabelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "This place was awesome with great tasting food and amazing staff. I was greeted with a warm smile and immediately offered a table for my group. Our group had the Tasting Menu and the staff was very helpful in explaining each selection. Each plate was very unique and fresh with an incredible taste. The space is definitely very intimate, warm, inviting, and in a perfect for location in The Mission District. Absolutely coming back!", "author": "Jose M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-20", "description": "It was indeed a very good experience to finally get to try this much lauded place, and the tasting menu was quite an experience. Unusual ingredients used in imaginative ways, great presentation, and friendly service all made this memorable. Unfortunately the timing of the dishes was not ideal, with long waits between some of the courses. \n\nAnd with the price of the tasting menu creeping up from $40 to $50 and now $65 (!!), and a very small selection on the regular menu, I'm afraid I've been priced out of coming again. Frankly I couldn't afford it to begin with. Perhaps it's a supply and demand thing, but I fear these guys will not endure the divergence between the humble neighborhood and rootsy background of the food  and the super highbrow prices. Still, glad to have had the experience.", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "I was thoroughly surprised how excellent and delicious the food was. I believe this is one of the best restaurants in the Bay Area, the tastes are phenomenal! Beef tinaktak was sublimely and uniquely delicious. The potato soup, the pork belly with smoked pork and charred veggies were also excellent. Can't wait to try other dishes here and do the tasting menu. This is a \"must go\" restaurant.", "author": "Dave N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-15", "description": "Aaaaamazing food. We had a six course meal here and every dish was incredible. The flavors were totally different, innovative, complex, just incredible. I docked one star for the ambiance because it feels a lot cheaper than the price of the food would suggest. The ceiling was stained and had cobwebs and the chairs looked like they were taken from Dunder Miffelin, but holy moly does the food ever make up for it all. Once these guys really get going and they do some minor renovations this place will be perfection.", "author": "Nat V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Delicious food, great service, solid beer selection, and killer a Island vibe. I Love this place! And to think, I've been passing it all this time on my way to La Taqueria. \n\nParking sucks though, so be prepared to circle or walk. Also, could be pretty hard to find unless you're really looking. Would really benefit from a sign of some sort IMO, but whatever, Ill be back... Lots.", "author": "John V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-18", "description": "Went here last night to meet an old friend in town for business. The casual environment inside had me concerned at first, but my fears were allayed with excellent service - and food.  Not knowing much about Guamian (I think that is the adjective for food from Guam), we elected to do the tasting menu ($65). 5 savory and one sweet dish, one after the other after the other, we thought we were done but alas the shortrib one was excellent, as was the encrusted egg, as well as the soup come to think of it. My friend's second wine selection wasn't upto snuff, and they happily replaced it with another choice.  Definitely a gem.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "Hard to find Chamorro restaurants in the Bay Area so I was excited to try this place when a friend told me about it. Not only was the food delicious, but the service was excellent. I personally think my mom's cooking is by far the best Chamorro food I've ever tasted, but this place comes pretty close. I look forward to my next visit and recommend you try it if you've never had Chamorro food before.", "author": "J S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "have you ever been intimidated by a restaurant? Perhaps from seeing nothing but rave reviews and the fact that your good friend has been anticipating all year to go to this place, feelings of \"woah...this place must be something\"? that is what happened to this cat as he found himself stepping into this unique restaurant, and not being sure what to expect.\n\ntwo friends and myself decided to try their tasting menu as it had 5 courses of different unique dishes to try. this ended up being one of the most amazing dining experiences of my life. \n\none by one, our servers brought out these unique dishes and proceeded to explain in great detail exactly what each dish was, and how it was prepared. What I loved was that it seemed that each server truly knew what went into the preparation of the food and description, and they weren't just reciting a memorized list of things. definitely could tell the servers had just as much love for the food as the chef. \n\nevery item we sampled was truly unique and filled with flavors I had never tasted before. it was really a refreshing twist to the kinds of places I usually step paw into. Yes prices are a bit on the high side, but this is so worth it to try a new kind of food that is expertly crafted, and a wonderful experience with the staff. \n\nI'll always remember my trip here! \n\n*chirp!*", "author": "Jei C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "We liked this place. Given the crazy inconvenience of trying to park in this part of the Mission, not sure if we'll ever make it back here any time soon. But yeah, the food was definitely memorable and pretty good value.\n\nWe had the tasting menu... pretty ingenious that the chefs here can pull this type of menu off without having access to either a stove or an oven (they use induction hot plates to do everything). But not having either means that they also don't have a vent so the restaurant was crazy hot. And not having either means that ironically a lot of the food is cooked ahead and then re-heated and therefore not that hot.\n\nThat said, each course of the menu was better than the last. It started off kinda shaky with a warm oyster, but kept getting better and better until it finished with that wonderful coconut ice cream (still thinking about it). We were impressed by the unfamiliar taste profiles and the creativity of a lot of the dishes.\n\nIf we come again we'll try some of the entrees which also looked quite good. The service was a bit uneven and the pace of service a bit off, but I'm confident that these guys will work out the kinks and make this restaurant into a local favorite. That might involve getting rid of the tasting menu (probably more suited to a different kind of restaurant) and just focusing on entrees. So if you're into a taste adventures you better try this place before this option disappears.", "author": "Art C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-28", "description": "Hmmm I really hate giving less than 4 star recommendations to new restaurants trying to make it in this cut throat foodie city, but I'd hate myself if I wasn't fair and objective in my review. \n\nThus, I think Prubechu earns a solid 3 stars. However, with a few tweaks and changes, it definitely has a lot of potential to warrant 4 or even 5 stars. \n\nPrubechu was our choice for a Valentine's dinner this year. We were looking for something low-key, intimate and adventurous in the Mission so voila! The restaurant is very casual yet still manages to maintain an air of classiness - it's quite small so I'm sure once the word gets out, it'll start to get quite busy. The waiter was definitely very friendly and answered all of our questions about Guam-cuisine. \n\nHowever, my two peeves were 1) the slow service and 2) the actual food itself\n\nThe restaurant only has a prix fix menu - 5 courses for $40. It's definitely a steal price-wise as there are several amuse bouches not accounted for in the 5 courses. However, we had very mixed feelings about the courses. \n\nThe first course (Egg with avocado, caramelized soy and salmon): delicious! The texture, flavor and presentation were all flawless \n\nThe second course (chicken keleguan with coconuts, scallions and titiyas): the dressing was a bit intense and the flavor, although abundantly apparent, was just a bit too overwhelming and confusing \n\nThe third course (shrimp patty with corn and peppers): solid. However, nothing to write home about. I've had similar shrimp patties in mediocre seafood restaurants\n\nThe fourth course (Chalakilis with porridge, anchovy, quail egg and pork): so I loved individual elements of this dish. The pork is well made. The quail egg was delicious. The porridge texture was great. The anchovy was raw and could have been good on its own. However, when combined, it was a very confusing mix with so many implosions of different flavors. \n\nThe fifth course (kadu with shortrib, rice, potatoes, bean sprouts and peas): yum. This was definitely one of the highlights, second to the opener. The shortrib was well cooked and the texture was perfect. \n\nI think the slow service could be attributed to the fact that they had just recently opened a month before we went and were understaffed for Vday. As for the food, there were too many flavors floating around - they just need to be refined in a consumable manner. \n\nHowever, for $40, it's definitely worth checking out. And I see a lot of potential. \n\nHappy Eating, Yelpers!", "author": "Priya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "We tried this place on Saturday night after reading the yelp reviews. My boyfriend and I are \"foodies\" and doubted this restaurant could live up to all of the hype. We ordered the 5 course tasting option. OMG !!!! Every single dish was a new delight, it was FANTASTIC. One of the dishes had \"spam\" in it. I thought ick I hate spam. I've never been so glad to be so wrong. They make their own and it is delicious. If my boyfriend didn't eat faster than I do I would have eaten all of it :-) \n\nWe live in Cupertino and wander around the city 3-4 times a month. We have had really good food in several restaurants. But this place is hands down one of the best in the city. The kitchen is open and we walked by and THANKED the chefs for the great meal before we left. The staff is very friendly & welcoming. We cannot wait to go back.", "author": "Lori D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-26", "description": "We've been here 6x now and love it.  Opened in Feb by two friends, Shawn & Shawn, who's dream was to start a restaurant serving their native food.  Both guys were friendly, attentive, and very happy to answer all our questions about Chamarro food.  \n\nThis Tasting Menu is always amazing. They experiment with different ingredients and flavors so the dishes are either completely different or modified for a twist on the last time. \n\nMy fave: the porridge with quail egg and pork -- interesting flavors (a hint of sourness like Kim Chi + a brief, spicy kick) and I really liked the texture (almost like oatmeal).  Reminded me of rice porridge my dad used to make when I got sick as a kid.\n\nGreat vibe and fun atmosphere on a Saturday night.  We ate from 8-10pm and had an awesome time.  Walked home full and happy!\n\nTip: they also have a big table which is great for parties. We hosted a birthday with 20 people and it was perfect. You can walk to Urban Putt afterwards!", "author": "Anh D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "This is a great restaurant! It definitely lived up to the hype, and I hope it opens back up soon. \n\nI went in November on a last-minute date night.  I ordered the whole parrotfish, which was on the pricey side but very fresh, tender and flaky. Plus it had a bright blue beak! If you're not ready to plunk down ~$30 for a fish dish, there are many other great things on the menu. The real stars of the show were the appetizers and sides--empanadas, red rice, potato soup. Everything was delicious and well-portioned for two.\n\nI'm not a stickler for service, and overall, I felt the service was on par with other high quality restaurants in the area. Our waiter told us a bunch of stuff about Guam and the history of the food we were eating. He got very excited and enthusiastic which was endearing. I left full and happy.", "author": "Lucy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "Amazing tasting menu. Super unique take on South Pacific Cuisine (Chamorran, aka the people/culture of Guam). Great service as well. Honestly, it's such a straightforward, simple, experience with complex flavors and dishes, not much else to say. Pricey but this is one of those places you get what you pay for. Great for special occasions. Hafa Adai bra!", "author": "J D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-22", "description": "Great service, good food, poor air quality. \n\nAfter seeing all the glowing reviews, I decided to bring 7 of my friends here visiting from out of town. The restaurant is pretty narrow and had two long tables set up for large parties and 4 small single top tables. For large parties, it's mandatory that everyone gets the $40 five course prefix menu. \n\nNone of us had ever had Chamorro food so it was awesome when our server was very knowledgable and detailed in the explanation of each dish. I enjoyed 4 out of the 5 on the tasting menu. \n\nWorst dish - fried sardines on eggplant \nBest dish - coconut ice cream with pieces of these delicious chewy pieces described as tapioca patties roasted in banana leaf. I could've eaten 5 courses of this dish alone. \n\nThe open kitchen did not seem like a real kitchen. There was a line of table top hot plates and no vent to suck out the fumes. At one point, some spicy peppers were being cooked and everyone at our table started coughing. I would not recommend coming here if you have plans after dinner because you will smell.", "author": "Lisa Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-26", "description": "Prubechu continues to deliver again and again. We've been probably once every other month or so, introducing our friends to this fantastic restaurant. The food is delicious, Shawn is incredibly friendly and helpful, and the ambiance is cozy and unpretentious. \n\nTheir tasting menu goes through a regular rotation, so every time we come there are at least two or three new additions or changes. I can't recommend Prubechu highly enough.", "author": "Andy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "This may be one of the most underrated restaurants in SF. The food is delicious and perfectly paced. I've only ever had the tasting menu, and I can only recommend it to anyone. Also, the wine menu is short, but a great selection. \n\nLast time, we had: \n\nCoconut tortilla amuse buche\nCorn soup with padron pepper \nSort-of-scotch egg (which was perfect with guacamole and salad)\nBeef tendon salad (maybe the most controversial of the bunch. Yummy though. I'd eat it again)\nSmoked pork dish that I can't quite describe but which had an amazing purée associated with it\nRock cod with eggplants and potatoes and baby kale (like really baby not what you get elsewhere) and garlic flowers. This was amazing. \nThat's when the dessert came. Strawberry with a wonderful flower and some vanilla cream. The memory gets somewhat blurry because of the large quantities of excellent wine we had. \n\nMust go now. Digest. Yummy.", "author": "Martin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "The food was so amazing and the staff (who own the restaurant with the chef) were also the nicest! Everyone owes it to herself to go!", "author": "Jason C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "Hafa adai! This spot was the business!\n\nThe restaurant opened up a couple days before I ate there, and my boyfriend, who spent his high school years on Guam wanted to go for our anniversary and a half.\n\nThe owners and chef Shawn and Shawn, and other chef Samir were so attentive and nice and friendly and you could tell they were so passionate and in love with what they were doing. \n\nThe meal itself has honestly been one of my favorites in all of San Francisco! Everything was delicious and so well prepared. Plus, it was so unique! I've never had the dishes that my boyfriend often reminisced about (Chicken Keleguan, Red Rice, etc) and finally got to try them all with this new, fusion-y, San Francisco feel about it.\n\nWe got one tasting menu (Egg, Chicken Keleguan, Shrimp Patty, Chalakilis, and Kada) and an order of the a-la-carte Red Rice and Pork (Belly) and the Tinaktak (ground beef) Over Capellini. Everything was so flavorful and great!\n\nWill definitely be coming back here and it's so awesome to see Guam food coming to the city! They're also playing the best island jams here so come hungry and leave happy!\n\nBuen Prubechu!", "author": "Vickie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-08", "description": "I had no idea what guamanian food might be when i read inside scoop (sfgate.com) about new restaurant prubechu, I did recognize the chef owner as a protege of manny ramirez of palace fame and samir as the sous chef for the same accomplished former owner of roxie's on mission, which prubechu has taken over.\n\nSo i made a reservation via text message, and you should too because the restaurant is crowded with well wishers, friends and relatives clamoring to taste the upscale island cuisine. We opted for the 5 course tasting menu for $40, figuring this would provide a foodie short course on what was on offer.\n\nA miyagi oyster with aged coconut vinegar (!) was the first amuse bouche, and a fine start. Much better than a traditional mignionette, the vinegar enhanced the briny succulence of the oyster without overpowering the seaside flavor. Really excellent in quality and composition.\n\nNext followed an 8-minute egg sliced in half and flavored with carmelized soy and an avocado puree. Outstanding! I am now in love with carmelized soy and will be using it to enhance my eggs, meats, vegetables and whatever else i can concoct. The soy avocado combo would be a vast improvement on the typical mexican dip, watch out guacamole you're going guamanian in my house!\n\nPrubechu does serve beer and wine, pbr, lagunitis and anchor steam for you beer drinkers. I knew the Justin cabernet on offer and chose that in favor of the pinot, chardonnay and savignon blanc. Wine choices were solid, i talked to the waiter, former employee of olivier's butchery in the dogpatch, about the choices and he was well versed. In fact, when questioned, he knew every ingredient and how it was prepared in every item we ate that night. Kudos for excellence in service.\n\nChicken keleguan was shredded chicken and scallions, shredded coconut and spices atop a coconut flatbread. A sort of guamanian tostada. I liked it, would make a great light lunch, especially with fruit.\n\nA traditional guam style shrimp cake was elevated in another course featuring shrimp, corn and peppers served souffle style in tiny tart cups. Light yet savory, a few perfect bites.\n\nPork belly played a starring role, crispy and smoked, in chalakilis, a rice porridge with quail egg and achiote. This would be an excellent breakfast dish.\n\nNext to last, and certain to top off your tank, was the kadu, a luscious shortrib stew with peas, potato, glass noodles and mung bean sprouts. Almost a halo halo stew, thankfully not sweet. Perfect for a cold, rainy night.\n\nDessert was a lovely, refined green coconut/tahitian vanilla ice cream. Flecks of vanilla floating through the creamy concoction.\n\nI really enjoyed the culinary tour of guam and even more so, all of the fellow diners who added to the evening with explanations of guam and much shared camaraderie. Definitely make your way to prubechu and enjoy the social as well as the gustatory aspects of this fine new debut.\n\nThe interior of prubechu is warm and stylish, an amazing feat considering the surely skimpy budget of a start up restaurant. We really loved the whole experience, prices are outstanding for the quality, and staff is happy to share details about the food even while bustling for the growing crowd.\n\nBest wishes to all!", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "Very unique experience. We were a group of 6 and we had two vegetarians. The restaurant was able to make a special menu for them as we all tried the tasting menu. Each course was interesting. There was a spam and eggs, coconut soup with ham, chicken sausage, a beef dish, and a coconut rice dessert. The only con would be the price. It was $65 for the tasting menu and the drink menu wasn't that impressive. \n\nIt was a first in terms of cuisine--food from Guam!", "author": "Sri C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "Shawn^2, you guys are awesome!\n\nMy gf and I fell in love with Roxie's Cafe last year after stumbling onto it via a Groupon deal. We had our hearts broken when we discovered that the place had closed after only being able to visit it once.... but luckily, I stumbled upon some food blog that mentioned that the place was being reincarnated as a Guamanian joint!\n\nI had a couple friends in college that were straight off of Guam, but I've never really experienced their cuisine, so I didn't really know what to expect. Shawn (one of two) told us that their cuisine has influences from Spain, US, Japan, and a slight bit of Pilipino. That odd combination of cultures sure did not disappoint when it came to the flavor palate.\n\nThe $40 tasting menu was totally worth it. 5 courses, an amuse bouche, and a dessert. The sous vide egg with asparagus and homemade rice crackers were amazing -- almost Californian, with a perfectly soft-boiled egg, and a nice texture contrast with the rice crackers. Their porridge -- oh my god, it was amazing at Roxie's and it's still amazing now -- they use 3 different \"grinds\" of toasted rice using a coffee grinder, and use all sorts of unique ingredients to taste the most amazing porridge I've ever had. Their beef short rib with noodles and a soy coconut broth -- I literally licked the bowl clean! Don't forget about their coconut ice cream -- I actually HATE coconut, but I couldn't get enough of this ice cream. Buttery and sweet, with toasted hazelnuts... the other Shawn said that it was their play on the Bi-Rite salted caramel. I think it's better than Bi-Rite!\n\nNeedless to say, I love the chill vibe of the place, the friendly staff, and most importantly, the amazing food. You should all try it!\n\n\ntl;dr - GO AND GET THEIR TASTING MENU\n\n\nSidenote: Apparently, SF Chronicle's Michael Bauer just released a review of this place today, and he seems to think that it has a lot of potential -- http://www.sfgate.com/restaurants/diningout/article/Review-Prubechu-Flavors-of-Guam-with-a-loving-5397122.php (a food rating of 2.5 stars by Bauer is actually very very comendable)", "author": "Kazu O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "I'm so glad that I came here during my visit to SF! The owners are super welcoming and incredibly nice -- we spent about 15 minutes talking about the history of Guam and what brought them to San Francisco. \n\nI would highly recommend the Chef's Tasting Menu! You get a story and explanation with every dish, and the courses are all very different and well made. It's very apparent that they put a lot of love and pride onto their food. We had everything from oysters and fried calamari to homemade spam and pork belly to coconut ice cream. I had never tried Guam food before but after eating here, I definitely want to try more!", "author": "Tracey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-08", "description": "Cute place, food was good.   I have not had food from Guam so it was a little unusual.  Staff friendly & nice.  However, I found it a little odd a credit card was required for a reservation.  We were literally the only diners in the restaurant.  I normally pass on restaurants which require a credit card reservation. Seems this place could use all the business It can get (& deserves).  I would change this policy if I were them", "author": "Ed F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-01", "description": "I seldom write reviews but I would like to first say that what Prubechu has done and what it offers is a unique and fantastic opportunity to experience a delicious, although obscure, cultural cuisine. \n\nI did the tasting menu and I ordered the red rice for the table to try as a nod to my festive Chamorro roots. This was a good amount of food, and although I am no culinary auteur, I did think that each dish in the tasting menu were unique and tasty and a breath of fresh air from all the American contemporary I've been accommodating lately. Hilights include the chicken kelaguen (their flatbread was delicious--I wanted a complete order of that alone lol), the succulent meat atop the porridge, the donni and finedene, and of course the Kadu. \n\nAs a Chamorro, I see this restaurant as an achievement. You will rarely see a Chamorro cuisine anywhere outside of Guam, and certainly not presented with a gourmet flair. And so to me it is a fantastic way to share our cultural foods and what they represent. When I ate here I could not help but feel so proud as flavors of certain meats transported me back to barbecues at my uncle's house, and the slurp of soups reminded me of my younger brother's favorite dish at home. Proud to have my friends visit this place and experience something that matters more and more to me as I get older. \n\nWhy the four stars? Only because I believe they can do even more and I look forward to the restaurant's evolution and growth. \n\nSide story:\nSix years ago I was rocking my Guam shirt at Bruno's right around the corner and a guy stops me and asks if I was from Guam. We get to talking and i remember him wearing a baseball cap in the club, that he was a student at the culinary academy in the city, and that his name might have been Shawn. \n\nMy coworker tells me about Prubechu and we immediately make plans to eat here a few days later and I walk in to see a sou chef, the host, and the head chef...rocking a baseball cap. It was Shawn. He had actually opened a Chamorro restaurant in San Francisco. How amazing to see things like that come full circle and be a part of it.", "author": "Edward K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-10", "description": "The minute you walk through the doors, the smell of smoked pork will greet you. It'll start making you hungry.\n\nWe opted to do the tasting menu. \n\nFirst was an amuse bouche of raw oyster shooter. Very refreshing. \n\n1st course was a cooked egg with some fixings. Not bad but a little salty. \n\n2nd course was the chicken kelegeun which was shredded chicken with spices on a flatbred. That was good. It would be good for light lunch or snack. \n\nFor our 3rd course, we were supposed to have a shrimp patty soufflé but for some reason we didn't get it and they substituted some other vegetarian dish.  That was not to my liking. It had pickled cucumbers, some other vegetables and a dollop of crème fraiche. That was way too salty. I could have passed on that. \n\nI don't remember the names here on out, but 4th course was this smoked pork dish on some pureed starch. That was my favorite. The pork was very flavorful and savory. I could have eaten a large bowl of that for a meal. \n\n5th course was a dish of meat, rice, and vegetables served in a broth. That tasted like some comfort food that you would eat at home.\n\nLast course was homemade ice cream and coconut shavings. That was really good. I enjoyed that.\n\nBe sure to ask about the wine prices before ordering. It's not listed on the menu and we found out a bottle cost more than the price of the 1 pre-fixe tasting menu.  \n\nService here was very friendly. Our server and the owner and the chef came over to our table. They were very personable and gave us explanations on the dishes.", "author": "Kenson K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-28", "description": "I wanted to like Prubechu - I really did. \n\nVisited the joint with my SO and tried the tasting menu. Most of the dishes were both tasty and unique, but neither of us founded the majority of what we ate to be anything more than pretty good. The problem for us was that the dishes didn't seem to compliment each other or show any kind of subtly -- almost every dish was super flavorable and very much the opposite of subtle. \n\nThen we got the bill, and I couldn't help but feel I'd had dozens of more delicious and cheaper, or at least equally priced, dinners (+drinks).", "author": "Ben G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "First time having Guamanian food, I'd never even heard of this place when a friend suggested it while we were out in the mission. What a find!\n\nI love spam and eggs, but it'll never be the same for me after I've had their version. It was so good, I didn't even look for rice!\n\nI just wish they had the option for a 3 or full course tasting menu, because while I scarfed everything down, I was way too full for the last course.\n\nThanks to the staff for a wonderful experience!", "author": "Michelle Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "We moved in up the street and were taken here by some new neighbors. We have since been back and bring people here when visiting. It is great. \n\nThe food is tasty, the atmosphere relaxed and the owners/staff are passionate about the food.", "author": "Neil A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "I'm not familiar with Chamorro food so I had a great time learning about and trying the cuisine of Guam. We went with the tasting menu (very affordable!) for a casual sampling of dishes. I liked the shrimp patty with corn, the escabeche, and even all the coconut (which I usually don't) in the various dishes. I wasn't too fond of the porridge though, but maybe that's because I don't like it to begin with. Our server was really fantastic and took the time to explain each dish and answer any questions. He was also very informative and not at all condescending, which was really appreciated.\n\nAll in all, it's a great experience and for me, a chance to try a new cuisine. Would I return here all the time? Probably not. It's more a place I would go to every now and then and a place to take adventurous foodies.", "author": "Allison S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "Guamanian food? Who knew it was so Damn delicious! \nWent in on a whim, trying something totally new and we were definitely impressed with the warm and friendly service (thank you for the history lesson of Guam, so great to get an education while eating tasty food!)\n\nWe tried the pickles (oh so good!!!), the soup, ceviche and the red rice plate...everything was fantastic. \nPrices are very reasonable and the ambiance is comfortable and warm. \nIt felt like a mini vacation. \n\nGreat experience.", "author": "Nilu r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "I have no idea what the people who gave this place less than 5 stars were thinking!!  I brought several very critical international foodies to this spot last night and the food was amazing!  The presentation, the flavors, and the owners were all amazing.  This is a 10 for me in San Francisco!  \n\nI was really hesitant on a tasting menu since I and another at the table had some food restrictions, but the way they worked around them was fantastic.  you really should give this place a try, you won't regret it!  I will say the 5 courses, each one is relatively small, but the food adds up and by the end you are totally satisfied.", "author": "Josh R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-04", "description": "Sorry to leave such a poor review on a small establishment...I've been very hesitant to review...but...here it goes:\n\n:::POOR VALUE:::\n:::FLAVORS ARE NOT BALANCED:::\n:::MORE PRESENTATION THAN TASTE:::\n\nTheir pre fix menu style dining of dining at $55 is seemed kinda cheap...but then again, I realized why...\n\nSome of the plates I remember being served:\n1. Flat bread with butter and yogurt sauce - size of my fingernail thumb.  ARE you serious?  It was about the 1/4 size of a triscuit!  It's just flatbread.  it tasted good.  But why give each person 1/4 size of something and put it on an individual plate and call it one of the courses.  This is how our meal started......I was thinking okay...palate cleanser...but no....\n\n2. Rice porridge with boiled egg with runny yolk...or at least some of us had runny yolk.  This was a much larger portion.  But rice is also cheap.  My biggest gripe with this course was the temperature.  The porridge wasn't hot...it was kinda luke warm....ALMOST warm.  it'd be nice to have it served hot and not have it congeal in front of me as I tried to eat it.\n\n3. Some broth with A mussel and house cured pork...SWEET?  doesn't work.  This is where i confirmed that they don't know how to balance flavors.  Way to sweet.  Again, this dish wasn't hot nor cold.  At this point I felt like I was being served cafeteria food...\n\n4. Some food with green sauce on the plate that tasted like crab but there was no crab in it.  Piece of over dried pork, again cured in house.  Tasted like eating a corner piece of meat that was sitting out on the counter for 2 days.  *Sigh*\n\n5. Dessert, the finisher, my boyfriend said this was the worst part of the meal.  TWO TINY pieces of tapioca that was dry, with a hint of sweetness, that summed up to the size of my pinky finger.\n\nOur table had 3 bottles of wine and that still left us critical about the meal.  My friend asked if we could go to Dr Teeth down the street because they have good chicken wings...\n\nAfter $90/pp, I felt bad for picking the place and felt like I wasted a nice dinning experience with friends.  Could've gone accross the street to Rosamunde for a beer and weiner.  \n\nSorry Purbechu...you royaly sucked.", "author": "Janet L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-08", "description": "Wow. This place has got to be the city's best kept secret. At least for now. Everyone at our table got the $40 tasting menu...and we sounded like we were having an orgy. \"Mmmm ahhh ooohhh so good mmmm oh myyy godddd....\" After. Every. Dish. Didn't someone smart and profound say something about how good food is like good sex?\n\nNeedless to say, we were blown away by the quality of the ingredients (Dirty Girl Produce and shipped directly from Guam), the visual appeal and preparation of each dish, and the perfectly in-sync flavors. \n\nNow, let's talk about the flavors you may encounter. First, there is spicy...the Chamorros don't kid around with the hot stuff. They have their own kickass hot sauce that is very spicy (you've been warned). Then there is sour...as in tangy coconut vinegar liquor. I didn't even know this existed! And then there is creamy coconut to whisk you away to a white-sand beach on a deserted island...well at least in your mind. Spicy, tangy, creamy, with a bit of soy umami, and some smokiness too....definitely a sexy party.\n\n$40 seems like an incredible deal for what we got: 6 dishes (including a dessert) + an raw oyster amuse. We also ordered the pickles and keleguan. Though they were good, they paled in comparison to the tasting menu dishes. This review is already too long, so I'll just mention a few highlights from our tasting dishes: sous-vide quail egg, achiote porridge, smoked pork belly, pork jerky, soy-coconut broth, perfect spring peas, okra, eggplant, morels, COCONUT CANDY ICE CREAM.\n\nOur meal took almost 3 hours, so don't be in a rush. This place is easy to miss...look for the faded Roxy's Cafe sign. Credit cards accepted (via Square). Counter area overlooking the open kitchen area for walk-ins. Tables can be combined for large parties. Can get loud (see first paragraph).", "author": "Carolyn F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "One of my favorite restaurants in all of SF. Delicious fresh food that tastes unlike anything else in the city. Highly recommend the chicken dish (I can't spell anything lol) and the veggie curry dish. Red rice is also a must. Also, stellar beer list. We'll for sure be back.", "author": "Matthew Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "We are probably going to make this spot our regular dineling spot. Their Chef's choice Tasting menu is super awesome!!!  It's dishes that's not on the menu and it''s an opportunity to explore a variety of dishes all at once if you can't make a decision on anything on the menu.  A no brainer prefixed meal.", "author": "Anna F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Had the tasting menu and man was it an amazing life changing experience! This was my first time having a 7 course meal and it's incredible! Although the price is a bit steep, I think maybe $50 is a bit more reasonable. But still very good!", "author": "Ciara A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "This place is incredible!. The food is amazing and creative.  The hospitality is so warm and intimate.  Love the island style with gourmet quality.", "author": "Who K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "Food was fine, pretty different, but definitely not 4.5 stars.  Had high expectations and it did not meet them. Found it to be pretty affordable though.", "author": "Rob S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-24", "description": "POST REVIEW FOLLOW UP:  AFTER READING OTHER REVIEWS, I REALIZED THAT AS SOMEONE ELSE POINTED OUT, ALL OF THE GREAT REVIEWS ARE LIKELY FAKED AND PAID FOR.  READER BEWARE...  GIVEN HOW AWFUL THE FOOD WAS (AND INCOMPETENT THE SERVICE WAS) I FELT LIKE I HAD GONE TO A COMPLETELY DIFFERENT RESTAURANT THAN REVIEWS AND REALIZE THAT IS THE CASE...\n\nI really looked forward to trying this unique place.  Sounds very exotic and interesting.  And, they really try hard, bless their little hearts.  \nBut, the food was not only really bad but most sincerely very bad.  They tried to foist the tasting menu on us, but we resisted and ordered a la carte.  We tried a half dozen dishes.  They ranged from bland (green goddess romaine salad) to inedible (weird beef pasta).  Many dishes were not finished.  On top of it, we got the fish special which meant for $40 you got a tiny boiled whole fish with scales still all over it.  Really unappetizing.  \nLuckily, by avoiding the tasting menu, we got out early enough to go down the street for a delicious post dinner quesadilla at that faithful cheap but cheerful standby El Farolito 2 mins away at Mission/24th.  You might keep that in mind...", "author": "Trecker J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "Yet another Mission neighborhood hidden gem. A friend brought me here recently and I had no idea what to expect walking in. The ambiance is calm, intimate and welcoming. All of the employees greet you with a smile and you can tell they are truly happy to have you as their guest. \n\nThe menu is very small, offering a tasting menu for $55 or simply ordering a few dishes. It is a little bit on the pricey side especially because the portions are small. But completely worth it because it is so delicious! I have never had food from Guam before, but each dish we had exploded with flavor. The combinations of ingredients in each plate are incredibly refined, I was thoroughly impressed. \n\nWe started off by sharing the empanada and then split two dishes. One of the dishes was all vegetables (I cannot recall the name) and the other by our servers suggestion was the Tinaktak beef with house made cappellini noodles, coconut milk and vegetables. Almost all of their dishes had a coconut infusion but they blended a lot of citrus flavors into it as well. I've just never had food like this before and was so amazing how much I loved it! Every single plate we had was so yummy!\n\nThe other thing I really loved about the experience was that with each dish that came out, someone from the kitchen came and described the dish in detail and how it was prepared. There's nothing I love more than dining at a place that is passionate about their food! I will definitely be back here many more times, I want to try the tasting menu next!", "author": "Mandy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "I was absolutely crushed last winter when I heard that Roxy's cafe was closing.  Someone we had tried to recommend the restaurant to, tried to make a reservation and they were told that they were closed.  The next time we went out for drinks in that neighborhood we stopped by to take a look, and were delighted to see Shawn with a new restaurant Prubechu that highlighted Guamanian food.  Now what can bet better than Shawn X 2.  This as been on our must eat list for quite a while and we finally got around to trying it.\n\nMy favorite dish from Roxy's was the porridge, which to me was the classic comfort food.  So naturally we had to order the tasting menu as the porridge isn't available a la cart.  The $40 tasting menu featured an amuse bouche (oyster), salmon crude, asparagus with as sous vided egg, a dish that is a take on sweet and sour topped with fish, porridge with smoked pork and a quail egg, short ribs in a soy and coconut broth, and coconut ice cream topped with toasted hazelnut for dessert.  My all time favorite is the porridge.  Typically Chinese porridge has a different grain, whereas this one is very fine almost like polenta.  Shawn explained that they use roasted rice at different grinds to give it a unique texture.  This dish is the ultimate comfort food, especially with the perfectly poached quail egg on top.  My other favorite was the short rib was the soy and coconut broth and noodles.  Also a very homey dish.  Just when you thought things wouldn't get much better, they surprised us with complementary ice cream.  The ice cream had a perfect texture contrast with the coconut in the ice cream, the roasted hazelnut, and the ice cream itself.  \n\nAlso the service is amazing.  Really it's like going to Cheer's where everyone knows your name.  Although I was heart broken to know that Roxy's had closed, I'm so glad to have Prubechu in the neighborhood.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "Good service, fantastic food, and fun atmosphere. I feel like I walked into my Aunt's kitchen and she's making me a family dinner. I will definitely be coming back to try their other dishes. The red rice was made to perfection! I'm so glad to have found this restaurant. Hafa adai!", "author": "Jinnie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "Back again for business but could not resist coming back for a lil taste of home.  Tasting menu was amazing as the last time - however, if ur craving the usual fiesta-ish grub - I would opt for the ala carte options as our coursed meal did not have red rice! Awesome grub tho and I'm psyched these guys are doing well in such a competitive foodie city. Prubechu was still \"cherry\" nai. Still cherry... Be back soon.", "author": "Lor B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-27", "description": "I went to eat dinner at this place with a friend who spent significant part of his life in Guam. He absolutely adored the food. I too loved the food and the friendly service. Since there were four or us, we ordered one of everything on the menu and four drinks. It came to 37$ per person, so I guess it could have been teeny bit cheaper, but hey the food is great. \n\nMy favorites are turmeric pickled daikon, potato soup, Golai hagan suni and tinaktak. Golai hagan suni is eggplant cooked in coconut milk and other veggies and it is absolutely fabulous. The salad is adequate and I did not care for the pulled chicken titiyas and the dried grilled pork...meh. The only dessert they had on the menu is coconut candy icecream. OMG absolutely fabulous. \n\nConsidering everything, it is worth trying a few times. It also seems like a good place to take a date to.", "author": "Balu V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-30", "description": "$70 for Palaksi (parrot fish)!!!\nI was extremely excited to eat at Prubechu.  I am Chamorro and was thrilled at the fact that there is such a restaurant.  Sadly, my family and I were very disappointed.  $70 for palaksi (parrot fish)?!?  Really?  At $4.99/per pound at the Asian market, they are not embarrassed to charge $70 for our parrot fish that was no more than 2 pounds.  I've never had a problem paying market price for seafood, which is usually no more than $35-$40 so we didn't even ask what the price for the parrot fish was.   Lesson learned...we will start asking now so we don't ever get ripped off again.\n\nWe also had the tinaktak which is ground beef with green beans in coconut milk.  I grew up eating tinaktak and often cook it myself.  We've always eaten it over rice. At Prubechu, tinaktak is served with pasta.  Okay, I get that they are somewhat a \"fusion\" type of restaurant but when I asked if I could have rice instead of pasta, the answer was no.  Another disappointment.  I am a paying customer and wanted a taste of home, not some fancied up non-traditional taste of home.  Especially when you are so far away from home and crave true Chamorro food.\n\nThe shrimp keleguin was good but the portion was very small for the price. \n\nOur bill was $163.00 not including the tip and we were not even full.  We were still hungry and ended up going to get tacos & burritos at another restaurant.\n\nI truly hope that Prubechu can stick to a more traditional Chamorro menu so that Chamorros who crave that taste of home (but are too busy at times to cook) can enjoy Chamorro food...and also, so that people of different ethnic backgrounds can truly taste and know just what Chamorro food is and just how delicious it is.  Being that there is only one Chamorro restaurant in San Francisco, there is no need to fancy it up and make it a \"fusion\" restaurant when our food is scrumptious all on its own...something to be proud of.", "author": "Kala C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-02", "description": "Fancy food in an unexpected setting. I'm not familiar with Guam cuisine so the experience was entirely new for me. The tasting menu offered some excellent dishes--poached egg porridge was quite tasty. Creamy and full of flavor. Most dishes had a lot of dimensionality with textures and flavors. There was one or two off the preset menu that weren't so impressive such as the clams which were just too salty and lacking anything special. Also the smoked pork was too tough, almost like eating beef jerky. My main complaint is that the portion is quite small. 5 courses later and I'm still hungry...our entire table still had a healthy appetite for more food.", "author": "Royce L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-22", "description": "Before dining at Prubechu, I really didn't know what to expect. Being that my girlfriend is from Guam, the only Guamanian cuisine that I've had was from her cooking. Thus, when I realized that Prubechu opened up this year and was the first and only Guamanian restaurant in NorCal, we couldn't pass up a chance to go. No only was our own hype there, the amazing Yelp reviews further solidified the anticipation.\n\nPrubechu is located on Mission between 24th and 25th. What I despise about the Mission is that it is incredibly hard to find parking here on the weekends. Luckily, within 5 minutes, I managed to magically find a spot around the block from the restaurant. When walking towards Prubechu, you might actually miss it because the sign is so incognito. As a frame of reference, it's next door to Quickly, which you absolutely won't miss. Upon stepping inside, you'll notice that Prubechu isn't a large restaurant by any means, but it sure is popular. Make sure to make a reservation beforehand, because I don't really see how you can snag a table otherwise.\n\nOnce we got seated, Shawn and his staff took care of us for our whole stay. For dinner, we decided to order:\n\n- Pickles (seasonal vegetables): $5\n- Chamorro Empanada: $7\n- Kelaguen Manok: $12\n- Tinaktak: $16\n- Red Rice: $18\n- Fried Fish: $22\n\nDessert: \n- Coconut Candy Ice Cream with Appigigi \n\nFor starters, the picked vegetables served as a good opening. They included: mango, papaya, radish, kimchee, and more. There was a nice spicy tang to each vegetable, and had that fresh homemade touch to it. Next up were the Chamorro empanadas. These are incredibly different from the empanadas that you're usually used to. Inside these bad boys was rice, achote, and mana. The empanadas were so taste that we ordered 2 additional to go. \n\nIf you're looking for some fresh tasting food, then the kelaguen is your dish of choice. This is Guamanian chicken ceviche with scallions and coconut, served on top of what resembles as a tortilla. Boy was this tasty. The chicken was juicy and combined with the citrus, it definitely made me want to order another round. If you're a coconut fan, then the tinaktak is for you. It comes served with homemade pasta. For my palate, it was a little on the thicker side, but I did enjoy the heavy coconut flavor that was associated with this dish.\n\nNext up were the red rice and fried fish. Paired with these dishes was finedine, a vinegar based condiment. The red rice was paired with their homemade bacon, which was literally thick slab of pork. It was loaded with flavor, and the rice itself was moist. When combined with the fried fish, you have a winning entree. To finish off our dinner, we had their coconut candy ice cream with appigigi. The ice cream had a nice sea salt sprinkled on top, and when combined with the pieces of tapioca, it balanced the dish out, leaving me incredibly satisfied with my meal.\n\nThroughout our meal, the service was attentive, the staff was incredibly nice, and of course the food was amazing. For Guamanian cuisine, there really isn't anywhere else you can go to in NorCal. Prubechu does the island a service by offering authentic tasting dishes to us Californians. Will I be back? You can bet on it.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Really amazing food and wonderful service! All the courses in the tasting menu are phenomenal. Amazing flavors. Great experience. I was new to Guamanian food but it has a wonderful fusion of flavors that works really, really well in California! Will be back and often.", "author": "Tom H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-28", "description": "I was traveling alone for work so I had the tasting menu aaaalll byyyyyy myyssseeelf, like Celine. It was unique and delicious, but the waiter had to coach me through my meal towards the end because it was so much food and I don't know the etiquette of quitting halfway through a tasting menu. With his support, I made it through all the courses without puking and left a very happy camper. The service was also exceptional.", "author": "Olga R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "Great and different food. The service and hospitality was outstanding. The host took time to explain to us the history of Guam. We arrived a bit late and could not do the tasting menu (9:45pm). So go early! The a la carte though was great. The Ceviche was fresh and different and tasty :)", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "This was such a great experience! First, the people there are so nice and knowledgeable, and were really helpful as we picked out our food and drinks. You can tell that everyone there puts their heart into what they're creating, and it's evident in everything they serve. It was my first experience with Guamanian food, and I will definitely be returning. For this meal, I got the red rice as my entree and the pickles and empanadas as appetizers. I'll probably go for the tasting menu next time so I can try even more! Only downside is that I was too full for dessert:)", "author": "Audrey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "Hidden gem in full view from Mission St. Incredible and authentic tasting menu, and friendly staff happy to talk about each dish and Guam's history in general. Coconut soup with Dungeness crab and Chicken Sausage in Banana leaf were our favorites.", "author": "Ken S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "Went here on a date and recommend splitting the tasting menu as we did. It was a nice way of getting a mix of 'adventurous' (and interesting) dishes. I loved their homemade spam and corn and shallot soup. Will have to come back to try their ceviche!", "author": "Hanah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "Always unique, tremendous attention to detail and delicious. I have no clue why more people don't flock to here. Maybe it is better that way because we can still get in easily.", "author": "susie w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "Very unique and delicious food. Somewhat latin, somewhat Hawaiian and somewhat Asian. \n\nI can't remember the name of the main dishes but we enjoyed all of it. Out of stuff I can describe, we really enjoyed the ceviche, the special cocktails, and most importantly, the very at tentative service. \n\nWe did the a la carte thing but we will definitely be back for the tasting menu", "author": "Arjuna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Excellent service, even better food, homey atmosphere! What else could you ask for! Every dish was lick the plate good!!! Must try this place!!", "author": "Gerri G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "Absolutely exceeded our expectations.  Don't let the modest decor fool you - this place is serving some spectacular food.  Well-thought out courses with presentations that will rival much more expensive peer restaurants.\n\nOne of the best meals I've had in SF in a while, to say nothing of the value (with our 5+ course meal costing just $55).\n\nWill definitely return.  Hopefully soon.", "author": "Lance R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-26", "description": "If you're looking for styrofoam fiesta plates, you came to the wrong place. \n\nPrubechu serves GOURMET Chamorro delicacies with flavors that are perfect, and it has an ambience of pride and the Hafa Adai spirit!\nThe tasting menu and a la carte menu are both phenomenal. \nTasting menu - they like to switch it up, but each course is always better than the last.\nA la carte - the empanadas, chicken kelaguen, and red rice dish were all on point.\nEverything was served in a timely manner, and the owners and staff are super welcoming, chill, and Guam natives. Ask them anything :)", "author": "Dominique F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "superb, fascinating cuisine.  Chamorro food (from guam) is really interesting and fairly different than other South Pacific cuisines like Filipino, Hawaiian, etc..", "author": "Matt K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-09", "description": "Stunning. This is what I call an Exquisite Dining Experience.\n\nPrubechu is tucked unassumingly on bustling Mission St between 24th and 25th streets. Blink and you'll miss it. Its facade blends in with all the neighboring stores and restaurants. It looks even a little rundown, faded awning and letters peeling. It's not \"fancy\"; there's no modern decor or anything remotely close to stuffiness. It's homey and down-to-earth and welcoming. \n\nAnd the food will blow your mind.\n\nI came here with my BF after trying to find something more unique than the standardly nice \"Contemporary\" or \"New American\" restaurants that seem to be popping up all over the place these days. Don't get me wrong, all the hip new places are lovely, but I was looking for something that would take my taste buds on journeys they've never been on. Prubechu did that and so much more.\n\nWe opted for the 5 course tasting menu (really 7 courses with amuse bouche + dessert). It was one of the best meals I have ever had. All of the flavors combinations were inventive and fresh, novel uses of familiar ingredients and novel uses of novel ingredients (juvenile goatfish?! cilantro flowers?!). Coconut was incorporated in almost every dish, savory and sweet. There was spice, and tartness, interesting textures and creative use of garnishing. I'm unfamiliar with Chamorro cuisine but the staff took time to explain every dish in detail, and the cultural importance of the ingredients. They get most of their ingredients directly from Guam and it is clear that they really are trying to share a piece of their home with their diners. Everything was incredible, I mmmmmm'd and aaaaaah'd and pretty much licked every plate clean. I will be back again and again for sure.\n\nThe atmosphere is so laid back. There was no rush, each course came out at a reasonable but very leisurely pace. Servers were attentive and friendly and always down to chat, but otherwise let you hang out for as long as you want. My BF and I had a wonderful time. It was intimate and relaxed, but the food was beautiful and top notch. \n\nI hope Prubechu and the lovely people who own and work here all do exceedingly well! For now though, it's a bit of a hidden gem, and I intend to take advantage of that to the fullest.", "author": "Carol C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "Great little spot! This was my first time and first time having Guam food. Food is so good! Went here for my Birthday dinner and everything was great. I had the chef tasting menu and it was really good. I will definitely be back.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "This is not a place where you will get large portions (ie. burrito); This is a place for a sophisticated palate or well-developed palate. You should have a good appreciation of flavors. \n\nBoth Shawns were awesome! Personable friendly and very informative. Can't wait to come back. Food was so on point - Flavorful, Great Balance, and Presentation. Definitely Michelin Star quality! \n\nMore pork shoulder please! What am i saying? More of everything please...", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "A hidden gem (who knows for how long, though) in the Mission! I've not previously had the pleasure of dining upon cuisine from Guam, but if this restaurant is any indication, the country must be an island of earthly delights. Sean and the staff have taken a rather plain/dingy place and transformed it into a space that is cozy and friendly. The hospitality and the food are top notch -- we had the chef's tasting menu (a bargain for the price) and really enjoyed the spam and eggs, oxtail with with soy broth and calamari with melon and cucumber. There were other small courses as well -- they were all delicious. \n\nLooking forward to coming back to try the à la carte stuff!", "author": "Chris O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-09", "description": "This place is phenomenal and one of SF's best kept secrets! I hesitate to write this review because I don't want the restaurant spoiled by legions of eager diners in line before me, but the chef is so kind and funny and hard-working, and the food is so damned delicious and beautiful, that I can't bear the thought of not sharing the good news. \n\nWe three each got the tasting menu, which is--as my father would say--a bargain at twice the price. $45 for at least six courses. One of us eats no poultry at all and the other is lactose intolerant. The chef didn't blink at all and served us several delicious dishes, each to the right person with thoughtful substitutions. Everything looked so good I was tempted to invent a dietary restriction of my own to try something else the next time!\n\nNo need for dishonesty, though. It seems that the menu is constantly changing and there's always fresh food and preparations. Do not be put off by the unassuming front window; this place is a gem! Personal service, relaxed and casual atmosphere, five-star food and presentation, and a price point that'll make you think you're still in Kansas. What's not to love?", "author": "Athame E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "hey All You Guamanians in the Bay Area Hiding Among the Many Filipinos Out There, it's time to rise as food from your culture has made it's way out of the comforts of your homes and into the mouths of anybody willing to give it a try! hooray, right? right! \n\nwalking into the space that is Prubechu, you wouldn't think the quality or creativity in the dishes could be anything more than simple home cooking. the three counter top burners, ice cream freezer and portable deep fryers don't seem like they are capable of putting out five course meals for tables full of people but somehow they do. and it's not just sloppily thrown at you in a rushed fury or hurriedness. the dishes are thoughtfully prepared and executed. the service was relaxed, informative and enthusiastic. whether it was the cook or the host/server/probably part owner, there was a passion when speaking about the next course we were to indulge in. \n\nthe food's base is Chamorro or in recognizable words, Guamanian comfort food. but then they take it to another level by using quality seasonal ingredients chosen on a daily basis at the farmers market and amp it up even more by making it pretty. the five course dinner is accompanied by an amuse (ours was a fancy pants oyster) and a dessert (ours was a coconut with rock salt ice cream with a tapioca/coconut concoction that was incredible) and costs a very reasonable $45. while the rest of the menu sounds great and I'll definitely be back to try it, I recommend the tasting menu upon your first experience. \n\nI thoroughly enjoyed my meal at prubechu!", "author": "Regina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-13", "description": "Amazing!\n\nSmall place with a big heart. Shawn and Shawn know what they're doing and it shows.\n\nGo Now. Go Often.", "author": "David A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "We had the tasting menu and it was a disappointment after reading all the reviews here on Yelp. Bland tastes, boring textures, cheap ingredients. Nothing special at all really. Service ok but a bit slow for a place with this reputation.", "author": "Per L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "Brought some friends here to experience Chamorro cooking. The dishes were amazing! The tinaktak, BBQ meats and kelaguens were delicious. We also had the coconut dessert and loved it. Really enjoyed our visit and will definitely be going back!", "author": "Al T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "I took my husband here. I think it's important to note that he's Italian and Chamorro.  A man who is use to some good cooking!\n\nHe had the Chief's tasting menu and I tried every dish.  Every time he tried the dishes, his eyes said it all-yum! I highly recommend this place, it was all very delicious. Next time we go, I'll be getting my own Chief's tasting!\n\nI hope they get a bigger place in the future, we wouldn't be able to fit our big family.  And wear something light, it's warm inside.\n\nSee you again soon! \n\nHafa Adai!", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "It was our second time here and we were not disappointed. I celebrated my birthday here a few months ago with 25 of my closest friends. I can say that the food and service are excellent for both. \n\nMy husband and I shared the tasting menu and ordered items from the a la carte menu for our two boys and us to share. We ordered the shrimp kelaguen, chicken kelaguen, soft shell crab with veggies with coconut milk, red rice plate with smoked beef and pork belly, empanada and the beef tinaktak pasta. Our 12 year old ate everything except for the shrimp. We let them know ahead of time that he had a shellfish allergy. \n\nThe tasting menu was different than when we were here in June and just had to order. My husband was blown away by the deep fried 6 minute egg (with a little Panko) with aioli over a sliced tomato and okra and chili pepper and house made spam. Didn't get to try the house made spam as our 12 year old snatched it right up. \n\nOverall, the dishes have its roots from Guam but have been elevated to a whole other level. \n\nMake sure to make a reservation. The space is cozy and it may be difficult to accommodate walk-ins.  We sat right in front of the prep area and were amazed at how they make the small space work. \n\nThe music definitely reminded me of home. \n\nLooking forward to next time.", "author": "Joie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "Tasting menu is exceptionally good. Excellent service. Great overall experience, especially for the price.", "author": "Globey I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "So much more sophisticated and refined than what I remember from visiting to Guam and micronesia years ago-- From that visit I mostly remember Spam and ramen with hot sauce...\n\nThe tasting menu is terrific and the venue and staff is very accommodating... On making a reservation for our party of 6, we were advised that parties larger than 5 had to have the $45 tasting menu.  Who knew our group had so many dietary restrictions?!  Out of our party of 6 we had:  1 gluten-free, 1 vegan (but eggs ok), 1 no meat but chicken & fish ok but allergic to lobster, 1 vegetarian, and only 2 w. no restrictions....  Chef Shawn and the waitstaff, including co-owner Shawn C handled all the varied requirements flawlessly and deliciously! Inventive and interesting mix of tasting plates and flavors for all despite our mix of dining restrictions... Everyone enjoyed the experience!", "author": "Leslie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-14", "description": "I grew up on Guam in the 60's and 70's and enjoyed not only the native food, but also the strong influence of Japanese, Filipino and Vietnamese food, not to mention the usual mainstream American dishes.\n\nGuamanian food, by virtue of being a small island and limited indigenous edible local plants, is simple. However, being colonized by the Spanish for over 400 years, that influence pervades the cooking style.\n\nSo going to Prebechu, I had expectations of Guamanian or Chamorro, (the indigenous people of the Marianas Islands), the way I knew it. While I must admit that Prebechu's style isn't the most traditional, it certainly paves the way of updating and modernizing the traditional tastes and advances it to gourmet classification. The fresh approach remains true to the original tastes and yet, gives you a sense that something else had been heightened.\n\n- First of all, their presentation is spectacular using Asian style plates with playful variety to match the fare.\n\n- Second, the laid back island hospitality is something you can't duplicate and everyone that works there has roots going back to Guam.\n\n- Third, for those uninitiated with Guam food, you wouldn't have a  point of reference to compare, but for one who does know, it is an exalted version of the ubiquitous fiesta food.\n\nIt's a tad pricey if you ask me, but it's a hell of a lot cheaper than the $1800 plane ticket to Guam to taste the unique dishes of the western Pacific islands.\n\nPlease support these folks for they've added another dimension to the gastronomic choices of cultural diversity in San Francisco. Give it a try and for one meal, get transported to the U.S. Territory of Guam, Where America's Day Begins.", "author": "Arvey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-21", "description": "San Francisco needs more restaurants like Prubechu. \n\nStart with dishes that are authentic to the cuisine or the culture. Make the food accessible without betraying its culinary roots. Throw out pretentious trappings and attitudes. Present everything with genuine service and reasonable prices. Don't leave patrons hungry. \n\nPrubechu accomplished all of the above. I highly recommend a visit.", "author": "Keith K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "Food is solid, and definitely worth the trip. Support local! Si Yu' us ma asi to the staff, it's definitely a little something to remind us of home in the Oakland/Bay area.", "author": "Steven R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "Absolutely fabulous! One of the best prix fixe menus we have had in SF. The food was clever, delicious, beautifully presented. Everyone working there was beyond lovely, and made us feel that we were at home during our meal. We feel so lucky to have found this incredible restaurant.", "author": "Jessi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "This place rocked. Off the beaten path and cute inside, the food was DELICIOUS and DIFFERENT. The owner/waiter was incredibly accommodating to my Paleo-esque ways. I really enjoyed it a ton. A+.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "Really great food, great friendly service.  Shawn and Tracy are charming, professional and delightful.  The mix of flavors is very different than most of the restaurants you've been to.  I highly recommend it.  One half block from the 24th/Mission BART station, on Mission boulevard.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-14", "description": "Nutshell Appraisal - High cost, low value establishment operated by well-intentioned but delusional proprietors, this spot, without a major shift toward improvement of customer experience, has absolutely no chance of being in business twelve months from now. Plethora of favorable Yelp reviews by so-called Elites within five days' time suspiciously points to platform gaming that smells of pay to play. \n\nAs a fairly adventurous diner who lives in the neighborhood, I thought I would give Prubechu a try. As the server rattled off tropical and Spanish influences, cuisines of the Philippines and Malaysia came to mind. Alas, the memorable and distinguishable ingredients and flavors that define these cultures' gastronomical identities and make them so appealing are not exhibited here.\n\nBecause my dining experience was so far removed from the stellar reviews consistently detailed by the first batch of Yelp reviews, I felt compelled to correct the record here.\n\nThe first thing you notice upon locating the property is that they've gone for the wink-nod move of retaining the badly-drawn marquee of the former downscale eatery that it has replaced. This is something of a gamble in that it sets the diner up for an expectation that the place is going to make up for this affront and seeming inattention to detail by wowing us with the dining experience itself. The expectation that you're about to bag yet another filling and cheap ethnic eats spot is looming large as you walk south down the still ungentrified block of the Mission shared with BART and McDonalds. A near-certainty reinforced once again upon actually finding the front door and seeing the interior's lack of décor or thought to table settings.\n\nThe first major shock, however, comes when the server steers you toward the signature prix fixe menu, offered at $40. Now, there's some considerable risk involved in diving into such a sizable investment with an unknown proprietor delivering relatively obscure cuisine. Even in high-cost San Francisco, $40 can still go a long way. Take the high-end, white gloved Basque-cuisine Piperade that offers impeccable prix fixe menus for under $40 on the edge of the financial district. \n\nAt this price point one expects a minimum quality of service. And as someone who spent a bit of time in the industry, I've always been a bit sensitive to lazy server moves such as auctioning off entrees when the dishes are presented to the table. When this happens with a party of just two, however, it's rather unforgivable as the server is clearly playing entrée roulette. There were similarly awkward gaffs that cumulatively made for an unacceptable level of service.\n\nThe $8 bowl of potato soup was quite good. As was the $2 PBR we paired it with (declining not to risk the $12 glass of house red or white on offer). My best advice is to avoid coming too hungry or with anyone who's picky about dining out, and to stick to these two menu items. My $14 entrée was smallish and had a bit of a \"what the cupboard has\" sensibility to it. Rather bland, it consisted of spaghetti topped by ground beef a la stroganoff with a sauce that appeared to be cream of mushroom soup and coconut milk along with diced asparagus added for good measure. Overall, we left hungry, poorer and wondering WTF, as we ambled up the way to backfill our still empty stomachs with empanadas and mezcal.", "author": "JayBee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "Delicious, informed, and a great experience. I brought my father here and to be totally honest he was a little hesitant. However we went in and were treated to an exceptional meal. I had the chefs tasting menu for $55, and it was delicious. Each dish came out beautifully presented with some history on the Guam dish and why it is like that. The service was great, our waiter was friendly, attentive, and knowledgeable.", "author": "monica t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "5 course tasting menu was delicious! Everything was bought fresh this morning from the market. Excellent, attentive service and warm, cozy ambience. I found the portions of each dish to be generous and was very full by the end of the meal. I will definitely be back. Great food with dynamic flavors!", "author": "Jordan Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-17", "description": "The service was impeccable.  We wanted for nothing.  Also, I mentioned that I was coled (because I'm wimpy and I get cold easily) and the manager told me he would close it for me, but would have to re-open in from time to time to keep the kitchen from getting too stuffy (this place is small.  He remembered to open and close the door a couple of times during the course of our meal, so I was really impressed with his thoughtfulness.\n\nAlso, this was my first experience with Chamorro food and it was really, really good.  We had chicken keleguan and shrimp keleguan, both of which were really light a fresh.  The tortilla thing underneath gave a really nice chewy contrast to the tender topping.  We had the pork with red rice and that red rice was insane.  So flavorful and smoky!  And we also had the empanadas which were light and super crispy and so tasty I didn't care that I scalded my mouth. \n\nI would LOVE to make it back to this place the next time I'm in SF.  Maybe I'll even make a special trip up there just for the food here.", "author": "Christina Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-26", "description": "Send your taste buds on a trip to Guam with the prix fixe at Prubechu.  Although every course was tasty and interesting there were definitely favorites.  Since the menu is seasonal it might be a tease to call out the greatest hits but the the asparagus appetizer, the smelt escabeche, the rice porridge and the dessert course of coconut ice cream, shortbread, and sweet mochi like bite sprinkled with sea salt were \"please sir, I want some more\" tasty. \n\nThe service was warm and what stood out was how knowledgeable the servers were about each dish including the ingredients and technique, cultural context, and the chef's intent.  Ideally this should always be the case but so often it's disappointingly or frustratingly not the case.  \n\nEnjoy Pebechu for the delicious food and the warm service.  If you are looking for a restaurant with elegant décor and a well-curated Pandora station you might want to go elsewhere.", "author": "MJ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-02", "description": "Chamorro cuisine in the city?! It's about time!\n\nA friend of mine had informed me that a new Chamorro restaurant was opening up in the Mission and at first, I thought he was totally kidding, but it turns out that he was absolutely right! \n\nPrubechu is a hidden little gem that does an amazing job of taking on traditional flavors and ingredients and creating a fresh, fun spin-off of classic Chamorro staples. Being part Chamorro myself, I, like many others swear that my (insert name of \"famed cook\" in the family here) makes the best chicken kelaguen, red rice, shrimp patties, etc, etc. But I must commend Shawn and Shawn for their thoughtfulness in creating such a simple, yet very tasty and satisfying menu. \n\nI was originally going to go with a few a la carte items, but ultimately chose to do the 5-course chef's tasting menu, which changes daily. Each course that came out was beautifully plated and explained to us in detail from both Shawn's. I truly cannot decide which dish was my favorite amongst them because everything was delicious in it's own way. Maybe it was the fabulous opening oyster with the kiwi mignonette.. or the slow cooked asparagus with the quail egg on top.. or the coconut milk monkfish kadu.. I can't decide; everything was amazing! \n\nThey also offer a nice little selection of beer and wine (including the hipster classic PBR), accepts credit cards via square and even takes reservations. Quick tip: I inquired about lunch service in the near future and they're currently working on getting more staff on hand to make lunch offerings a reality.. chicken kelaguen tacos, maybe?! \n\nIf you've ever wanted to dabble into Chamorro food, I recommend giving Prubechu a try the next time you're galavanting around the Mission. I'm super stoked that the city FINALLY has some authentic guamanian food on the grid and I wish these guys nothing but the best success! I'll be back very very soon... like tomorrow night.", "author": "Cara C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-08", "description": "Buen prubechu!\n\nI've never been to Guam.  As we approached Prebechu, I'm wondering, hmm, fish? breadfruit? taro? pork? tropical fruit?   Forget any preconceptions... Prubechu is an unexpected treat for the uninitiated!\n\nThe prix fixe tasting menu is an all-savory tour of the Island's food.  Our next table guest Norma was Guamanian and she said she cooks most of the dishes at home.  Legit!\n\nThe prix fixe has been really well reviewed so no taste-by-taste here.   Ingredient quality - super high.  Preparation - everything to-order and perfectly presented.  Flavor profile is a patois a bit like the Chamorro language - part Pacific, part Spanish.  Coconut in a variety of presentations and toastednesses complements pork, chicken, beef, corn, rice, noodles, mung beans, snap peas, carrots... a long list.  A different take on soy - YUM.  \n\nThe shrimp cake was deconstructed from fried to souffle... I would really like to get a chance to try both approaches side-by-side.  I would really also like to be able to take home a pint of Prebechu's coconut vanilla ice cream.  About as close to heaven as you can get this side of the bright light.  \n\nDon't forget to ask for the hot pepper sauce (if you can handle it!).  From a Guamanian pepper, it is one of the purest hot complements I've ever tasted.  I would like to have it in my kitchen!\n\nDefinitely will go back. Looking forward to trying Guam classic tinaktak.  Warm, friendly, satisfying.  Prebechu deserves a place on your \"surprise-me\" list.", "author": "Bob K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "Price: average\nFood: delicious, great for culturally curious foodies\nPresentation: beautiful\nGreat for a laid back, BYOB date night or fun dinner with friends.\n\nWhat a wonderful experience all around! The decor is very reminiscent of authentic island laid-back style, totally unassuming in a way that makes you feel like you've found the local hot spot on the island. The service was great, with beautiful presentation and description of each item being placed, understanding that most visitors know nothing of Guam or its cuisine. Its also currently BYOB which is almost impossible to find with this quality of food. Onto the food...\n\nI came with 4 large hungry men and they all ordered the set menu for $40. It looked like too much food for me so I ordered the kelaguen. Each dish was unreal, and the men had trouble finishing all their food because it honestly is a lot of food for $40. I'm used to NYC set menus that tend to leave you hungry and curious as to whether you're just fatter and hungrier than the normal crowd. Not the case here. My kelaguen was delicious, a fairly healthy choice of minced chicken flavored with coconut and island spices, supposedly a very traditional Guamanian dish. I appreciate their great efforts in making a cuisine that most people are completely unfamiliar with and from a fairly laid back island culture into a series of beautifully and professionally presented small plates. Its no small feat to turn home-style island cooking into an elegant affair.\n\nI'd definitely recommend this place, particularly to people who are curious about other cultures and enjoy learning about different cultures via food. I'll definitely be coming back and bringing the whole family. I wish the owners much success! They've clearly worked very hard to bring their dreams to fruition in this cozy spot and I hope they're here to stay!", "author": "Elena F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "I was with a group of lovey ladies who just had an excellent tasting menu dinner at Prubechu! Wonderful atmosphere, delicious, creative and artistic food. It was so fun to watch the chefs and interact with them - telling stories and history of Guam. It was easy to make reservations and the chefs where more than happy to adjust to a few gluten free/dairy free requests. I would highly recommend this restaurant - marvelous experience!", "author": "Chelsea Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-09", "description": "When I read the recent review of this restaurant, I knew immediately I had to try it. I went with a friend and my 17 year old son.  We ordered nearly everything on the menu.  Without exception, everything was exceptional. The presentations were beautiful. Clearly a lot of work went into everything. The flavors were unique yet not strange. In fact, some were so extraordinary, I had to shut my eyes to all else around me so I could really enjoy them. \n\nThe potato soup was simply to die for. Don't miss it. The shrimp keleguen...I could have eaten twice as many. The portions were generous yet I ate enough to share with one other person.\n\nWhat heightened the experience was meeting both owners, hearing their stories about Guam, and feeling the pride they have for their country. We could have talked for hours. Their love for food, creative adaptations of traditional dishes, and pure enjoyment of making sure we knew what we were eating and how everything was prepared turned what we thought would be a \"quick bite to eat\" into a 2 hour dining experience. \n\nEven my teenage son was interested in how things were made and came home to tell several friends and family about it.\n\nNeedless to say, the service was like being in someone's home. Both Shawns were exceptionally gracious and made us feel totally special. The place is adorable, has a very warm feeling and quickly transports you away from the local street color. \n\nThis place will now be on my favorites list, and when we have a large family gathering at the end of the month, we are going to have lunch here.  It is simply unforgettable.", "author": "Marla Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-06", "description": "This place is fusion type of chamorro food. Now if your from Guam fusion is it usual but I get what this place is trying to put out. It's a mix of different islands but on an upscale level. They are located on the mission the place is like an old sushi place so to big inside. Customer service was ok. The food can't be explained but flavor was bursting & different.\n\nBeing chamorro I can relate to some of the flavors but some are quit different that really don't need adjusting but tasted good. I think I just have to get use to fusion but completely not traditional so don't expect it if your coming here.", "author": "Mark T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-24", "description": "A creative gourmet twist on traditional Chamorro food.  Either ala carte entrees or the tasting menu will have your taste buds dancing.  Ate here with my gf and good friend who is a foodie and after tasting each dish, she wanted to hurt the chef cuz it was so dam good. LOL\nCome here if you want to experience unique gourmet Chamorro food!", "author": "Marlon L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-26", "description": "I'm Chamorro and I wouldn't recommend this place. Food had no flavor, dry meat and no taste with red rice.  Not my island experience.", "author": "Shelly W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "Had a great time here with a few friends on a sat night.  We went with the tasting menu and we're definitely educated on some new flavor combinations and dishes from Guam.  This is definitely a hidden gem at a reasonable price point (for now at least) that brings something fresh to this strip of mission.  \n\nWe will definitely be back to try some other dishes.  One note is that you better like coconut since it's in each dish in some form or another pretty much.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-04", "description": "Newish when I went a month or so ago - incredible food and service, very fair prices and a friendly crowd too! Highly recommended, and will return soon! Guam rules!", "author": "Jeff K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-10", "description": "Good but not great especially considering the price. The staff is extremely nice but a bit slow. The food was all Spanish inspired but didn't execute that well. We especially didn't like the red rice dish or the ceviches. Would recommend the desserts though, especially the ice cream", "author": "Lisa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-01", "description": "We went for the tasting menu and got the following: \n\n1) Miyagi with the kiwi was really good. Didn't know they would complement each other so well. The oyster was very fresh too. \n\n2) Egg with avocado and carmaelized soy - egg had a creamy center. It needed more of that avocado mousse. Also, after a while it started to taste like a '1000 yr old egg'. I still enjoyed it a lot.\n\n3) Chicken keleguan - This was really good. It tasted like a very healthy chicken salad with some coconut dressing. \n\n4) Shrimp Patty - like everyone said, texture is more souffle than an actual patty. But i liked it. The corn mixed inside made it sweet. \n\n5) Chalakilis - very flavorful porridge, I got some big pieces of pork belly. So by this time I'm pretty full. Pork belly was really good, it was hot, crispy, and fatty. But not so much that I felt greasy afterwards. Then there was the quail egg, I don't know how they did it, but the yolk was still runny when I popped it in my mouth. \n\n6) Kadu - there was rice, some clear noodles, sprouts, potatoes, carrots, and short ribs. Then they top it over some soup and you can mix it with the vinegar they give you. It was delicious! It reminded me of korean kalbi soup. \n\n7) Homemade ice cream - Ice cream had a very natural coconut flavor. This was complemented with the cookie crumble and a torched meringue. Everything went very well together. \n\nOverall, food was good. I enjoyed the whole experience and each bite, but I don't think it's enough to make me dream about it. Also, I walked out of the place with a full belly but I still don't know what Guam food is. I felt like I had a fusion of Mediterranean, Chinese, Vietnamese, and Korean. I like all 4, so i'm overruling the technical aspects in this review.", "author": "Irene C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "Passionated owners come together and create food with pride and style. I wish more restaurants in SF had the same ethics. Pricy but you pay for a flawless experience", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "Great service, excellent food. Incredible value for the money. Most restaurants of this quality cost WAY more.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-05", "description": "Great spot and great attentive service. We had the chef's tasting menu and I highly recommend it. Like many reviewers I had no idea what to expect but I saw the good reviews and thought it would be a great place to try out.  $45 was the price for the Chef's Tasting menu per person.  Look forward to returning sometime in the future.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "We had a delicious meal!  5 courses but really 7 with amuse bouche and dessert.  We were stuffed and loved 6/7 dishes!  The short rib was the best I've ever had, amazing soup, and really fresh, interesting flavors.  It was a hot night so we were a bit warm, but no real complains.", "author": "EK G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-30", "description": "The food was ok, but I literally saw a rat / mouse scurry under my dining partner's legs when I ate here on a weekday night. Definitely not coming back because of that.", "author": "Andy A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-15", "description": "After seeing such stellar reviews, I was strikingly underwhelmed by this experience. The emphasis seems to be highly on things that are considered excellent in Guam, without, in my opinion, much consideration for overall value or flavor.\n\nTried the ceviche, beer, wine, fermented coconut juice, red rice (their \"best seller\"- really? Rice?), and the market fish. Ceviche was nice but mild- relatively more bland than the average Latin ceviche, and less citrus-forward. The rice was entirely unremarkable. Perhaps the side portion is prepared differently than the entree (though we asked about this before ordering, and were told it is not), but it had hardly anything in it that wasn't... rice. The fish was the part of the meal that was really frustrating. For $38 (more than 1.5x the price of the next most expensive menu item, price not listed), we were served a small (~10oz bone in & head on), steamed reef fish. It was fine, but far too bland for my taste. We left feeling entirely unfulfillled to get ice cream down the street.\n\nOverall, this would perhaps be a very fine restaurant in Guam... but I would encourage prospective diners to consider that Guam is a tiny island in the deep Pacific, and not known for its cuisine. At San Francisco prices, you can do much, much better on this side of the ocean.", "author": "Jesse O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-24", "description": "I've been wanting to try Prubechu since I read about it and when we made it to the Bay Area this weekend, we no doubtedly had to come try it out!  It's not your typical Chamorro BBQ joint. This is the kind of place that foodies like.  Guam dishes presented in a culinary style like no other.   Shawn Camacho, Shawn Naputi and their island boys took us on a unique culinary journey with an interesting twist on our home grown dishes we already loved.  Chorizos español, kelaguen, shrimp patty, eggplant, chalikis, kadu, apigigi.  We have to come back next time we are in town.  Congrats to our local boys doing it island style their way!", "author": "Michele M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-15", "description": "Had such a great dinner! Probably one of the best in San Francisco. These guys not only cook with great flavor but plate with such great fineness! Service was spot on too! I recommend the chefs tasting menu for sure!", "author": "Alicia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "Have the tasting menu. I've dined here at least 7 or 8 times, and love it. The food here is a bit different from the usual \"modern American\" fare since it is heavily influenced with Guamanian ingredients and flavors, which makes it interesting and in many ways more complex. A plus, is the warmth and friendliness of chef Shawn and his business partner Shawn. They really make you feel welcome and appreciated. Awesome.", "author": "Connie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "this is the taste of home elevated to foodie status. chamorros, don't expect your grandma's tinaktak or an l&l style bbq plate. this is indeed elevated island cuisine and it couldn't be better. i never thought i'd be able to enjoy red wine with chamorro food in the mission. great place and great people.\n\np.s. the manha ice cream is the stuff dreams are made of. move over bi-rite.", "author": "Jackie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-26", "description": "My wife and two sons thoroughly enjoyed our meal at Prubechu.  We all had the tasting menu and were completely blown away from the presentation to the flavors...all done incredibly well. Our favorites (if we had to choose, because they were all so good) were the chalakilis (a rice porridge dish), kelaguen (grated coconut and chicken) and kadun katne (beef short ribs soup)...all dishes staying true to Chamorro roots with a slight slash of contemporary flair.\n\nThe Shawn's (the two owners, one a host and the other the chef) are very gracious and welcoming...we wish them the best of luck and can't wait to come back!", "author": "Island B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-15", "description": "What a fun dining experience! Went here the other night with a group of 4, and we all ordered the chef tasting menu, which as others have mentioned, is a really fantastic deal. We appreciated that they asked about food allergies/dietary restrictions (we didn't) when we ordered. I always take that as a sign that a chef is creative and flexible, and the staff is interested in pleasing every customer from the beginning.\n\nEach course was excellent and beautifully prepared. I wish I had written down a description of each item, but overall it was a wonderful mix of flavor, texture, spice, smoke, seafood, pork, and fresh produce. Each course was unique and provided a new flavor--no filler courses here! The candied coconut ice cream was a perfect dessert for the 90-degree weather that day. One of the highlights of our experience was seeing the passion that the chef, co-owner, and servers had for the food and cuisine. They went into detail about history, sources, and cooking methods for each dish, answered all of our questions with enthusiasm, and were happy to share their story and backgrounds. It's so inspiring to see good, talented people pursue their dream, and do it well.  Anyone looking for a unique, delicious dining experience needs to get to Prubechu, stat.", "author": "Alison S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "I love Prubechu! We had the tasting menu twice and both times the food was phenomenal! The dining experience is very interesting - the food is Guamanian, all prepared by Guamanians on hot plates! That's right, hot plates! There is no stove! Yet, somehow, they manage to cook each dish perfectly! I'm impressed!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-13", "description": "I went because I've never tried food from Guam and for the ridiculous high reviews.  I'm glad I didn't cancel because between the making the reservation and the res date,  (and always the pessimist )I'd convinced myself those reviews were fake.   Glad to say that it was a enjoyable experience.\n\nAs part of group of 8, we had to participate in the tasting menu.\n\nThe deep fried 6 min egg wowed everyone.  If you've read the egg description it seems like they started at 8 min eggs and perfected this at 6 mins.  Texture and flavor was really good. This item is the one thing that everyone at the table would return for.\n\nMy personal favorite was the house cured/smoked bacon w/ deep fried maitakes which tasted like meat ,which was awesome. Some in the group didn't like the dryness but I loved it.\n\nBraised oxtails -winner.\n\nThere was a leaf wrapped fish \"sausage\" thingy in coconut milk sauce that was kinda bland since I didn't use spicy sauce on the side.   It was too spicy for me to try twice. My Filipino  friend liked this dish. \n\nAlso a deep fried fish dish which was ok.  \n \nWe received complimentary ice cream and amuse buche oyster.  Over all food was nicely presented (if you care about that kind of detail) and tasty and service was good so I'll return.", "author": "chio s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "Try the tasting menu. Just do it, it's delicious. A little pricey, but so damn good. I had the tasting menu around the time they first opened (March I think), which was delicious. Had it again just the other night and it was almost entirely different yet still damn delicious. And they have dishes in the trading menu that you can't get a la carte.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "Got the tasting menu and I think it's a steal! It's a small, relatively okay looking place but the service and the food are outstanding. The waitstaff explained each course, and were very attentive to our needs. The food was plated beautifully, and it tasted as good as it looked. My favorites are the oyster (like butter), egg course (balanced taste), and the coconut ice cream dessert.", "author": "Rae C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "Truly thoughtful dishes, that will surprise and satisfy you!\n\nCame here on a date night for the tasting menu last night and it's such an delightful experience. Great service, decent ambiance, and the quality/presentation of the food is on the same level as to State Bird and Provisions.\n\nThe highlights were Chalakilis (juicy crispy and savory pork belly almost made me cry) and oxtail soup (wholesome, taste like home).", "author": "Jessica Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-28", "description": "I had the vegetarian dish with side of rice and wine. Absolutely loved my meal!! The texture of veggies were crisp and lively- just right.  The best part of the meal is that the flavor was perfect.  I hail from Asia and I find that almost all Asian food in this city tries too hard by over-salting, over-spicing... Not so at Prubechu, flavors are very well balanced! I will definitely come back to try other items.\nOh, and the house red was good!", "author": "S H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "It's like taking a vacation without leaving the City. The tasting menu was absolutely amazing. An explanation of every plate, from ingredients used to how may have been served in Guam. Service was incredibly friendly and personable. We felt more like we were at a friend's home than a restaurant. \n\nGo there to experience the food, the culture and to support people who are adding something really special to San Francisco's food scene.", "author": "Bridget M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "these guys are dedicated to their craft. they try to bring awesome, home cook meals to another level and succeed. the chefs menu is fantastic and worth the money. i had so many different things ive never tried, all which were phenomenal.", "author": "Jonathan Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "The food and the staff are first class. Highlights: pork belly & fried egg, farmers market salad, corn and coconut soup, Viognier.", "author": "Susan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "Food presentation was delicious and the food was yummy!\nService was wonderful!\nGreat place to meet up with family and friends from Guam...", "author": "Catherine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "I Ordered the Chef's Choice Tasting Menu (5 tasty dishes specially prepared by the chefs) & everything was fresh, delicious with spectacular flavors with a Chamorro base! I can't remember all the fresh ingredients in each of the dishes but they were all outstanding! The service was excellent, too!  I'll be going back in September when I'm back in San Francisco!", "author": "Elaine B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-24", "description": "We finally get to make it to this place then for some reason the restaurant is closed! Frustrating because I'm in crutches; waking there after finally parking only to find out this place is closed! On a Saturday night! No sign or anything, lights off, even after calling to make reservations! Yelp says it's open, all the other sites say it's open. Ugh! The least they an do is update their Facebook page!", "author": "Shirlene M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "This place was totally unexpectedly amazing. It's got the vibe of a fun diner, totally casual, with a nice energy, but the food that came out of that kitchen was nothing short of spectacular. I think I gasped every time a dish came out! I like to consider myself fairly well versed in world cuisine, but Chamorro cuisine from Guam is unlike anything I'd ever tasted before. Everything hit the right note, with the right amount of sweet, salty, sour, and textural contrast, not to mention the food was beautifully presented. The service was great, Shawn was super nice and we enjoyed some awesome craft beer and a great Riesling with our meal. The tasting menu was seriously good value too, I've never had a $40 tasting menu that was even close to that good. I've already been back and will be back a lot more!", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-31", "description": "Chamorro food with an upscale twist. \n\nI was very satisfied with the food at Prubechu. The chef knows how to take classic Chamorro dishes and infuse them with a culinary touch, while staying true to the heart and soul of the dish. There were 4 of us so we ordered one (sometimes two) of everything and ate it family style. My favorites were the Golai Hagan Suni, Tinaktak and red rice/pork. Request the donne dinanche (housemade pepper paste) to add a spicy kick to any of the dishes, and don't pass up the coconut candy ice cream for dessert - soooo good.\n\nFew critiques: They should offer a full pint glass when you order a beer versus a mini mason jar. Chicken keleguen could have used a splash more lemon juice. \n\nOther than that - the food was delicious, service was excellent, and I can't wait to go back.", "author": "Brooks H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-17", "description": "Not the food your grandma makes, but something that will definitely remind you of it. Food is beautifully presented and owners are welcoming. If you haven't had food from Guam, do it, and do it here. See Joie G's review for a more detailed review. I was part of her large party. They are very flexible about food interlorances and allergies so just let them know. We did the tasting menu. Meal has been awhile but I remember enjoying my dishes. Coconut soups, achote grits, makerel, and the dessert of pigigy (sticky coconut rice) with ice cream is what sticks out in my head the most! One cool thing that my brother ordered that sounded interesting was their homemade pasta with tinaktak (coconut milk, vegetables, and meat). I had no more room left to try it, but that was just to give you an example of what they are trying to do with Chamorro (Guamanian) food.", "author": "Hazel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "Can't say enough good things about this place.. We eat out at all the Bay Area hotspots and have to say this ranks right up at the top !", "author": "Jorinne J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "I had never tried Guamese(?) food before and it really blew my mind when I least expected it. We ordered the Chef's Tasting Menu for $55 and it was 7 courses of amazing food. My favorite was the rice porridge with a 6 minute egg with truffle on top. We ordered Mt. Beautiful wine that was really smooth and went well with all the food. Service was great and it was nice to talk to the owner. A real gem in the heart of the Mission.", "author": "Selen U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-24", "description": "Wtf. It's Saturday night and this place closed. Dragged my 2 toddlers and sister in law on crutches and the place is closed. I think it closed down.", "author": "Fe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "Go now before Mission foodies discover Prubechu! \n\nI expected various varieties of spam - or at least that's what I heard about food in Guam, instead I got an innovative, delicious and gourmet dinner for a portion of the price that dishes of this caliber would be priced at other establishments.\n\nWe had the 5 course savory tasting menu and added flat bread and pickles. At the end of the meal the chef snuck in dessert too. Food was a gourmet journey, what a treat!", "author": "Yana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "This has got to be the newest, must-try restaurant in SF! Hurry before reservations become impossible to get! Their basic menu is the tasting menu with various add-ons. It was absolutely delicious with every bite, filling, and satisfying. I had never tried Guamanian food... and thank God I love coconut because it was in almost every dish! I thought it was cute that they serve many different types of beer, including Pabst (for $2!). The service and ambiance is genuine and no-frills. I felt like I was being served by a bunch of my close friends with their non-stuffy, friendly, caring attitude.", "author": "Elizabeth K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "Great customer service! You can best describe their menu as bomb comfort food. It's unique food genre and Chamorro culture gives the best hospitality I've experienced in San Francisco! Highly recommend this spot!!", "author": "Tony P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Ordered the tasting menu.  1 amuse Bouche 4 courses and 1 delicate dessert. All really really delicious. The food was great. Our server was lovely and kind and it felt like a comfortable down home type of place.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "MOUTH-GASIM awaits you -just go! hella bomb food with a crew that is as sweet as the coconut henny IceCream they make! Authentic food from Americas best kept secret, Guam! I personally love the chicken ceviche sprinkled with coconut and spicy goodness! Reggae beats and delicious treats you can't go wrong! Gracias for my happy belly!", "author": "Alexa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-20", "description": "Love this place. I moved to SF from Guam and this place makes me feel like I'm at home. It's a more sophisticated take on Chamorro food, but the red rice is just like I remember. Everyone I came with loved their dishes, too.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "this is one of the mission's true gems. a down to earth, local place with fantastic food and great value. beautiful atmosphere without mission attitude, small and intimate but still fun & lively.", "author": "steve r."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-24", "description": "Nothing special. The pasta dish didn't have any flavor and wasn't even properly seasoned. The overpriced red rice dish is just average tasting pork belly. The service was good.", "author": "Serguei B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "We had the tasting menu last night and it was totally unexpected in a great way. We weren't expecting much when we walked into the restaurant. The place looked tidy but very straightforward. You would probably never remember the look of the place but you will totally remember the food. We had 5 courses and all of them had really interesting flavors and ingredients. There was a crusted fried egg with asparagus, a rice porridge like dish with mushrooms and sardines, and a great braised short rib in broth. We would definitely come back!", "author": "Q L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "Came here based on a recommendation from someone who grew up in Guam. What is Guamanian food?? I'm always down to try new things, and seeing as how this is the first and only Guamanian restaurant I've heard of, I was intrigued. For groups of 5 or more, everyone has to be on board for the tasting menu. $45 gets you five courses, not including the amuse bouche and dessert. Fortunately, they allowed my friend to opt out of the tasting menu, and to just order a la carte because of her strong aversion to coconut (90% of their dishes have coconut). We didn't know what we were getting until each course came out because they didn't have a printed menu of the tasting menu. With the exception of one course (ground up chicken in banana leaf), we all thoroughly enjoyed the food! It was very flavorful and while coconut was in everything, it wasn't overwhelming and all that pronounced in some dishes (and I only like coconut in some foods). \n\nOverall, the service was good. However, it did take a really long time for the dessert course, around 30-40 minutes. When they forgot to sub my oxtail for fish, our server Shawn apologized and comped our bottle of wine. He really didn't have to do that, but we definitely appreciated it :) So even after eating Guamanian/Chamorro food, my friends and I still can't clearly define what it is. Some words that were thrown out to describe it: Latin, Asian, island, Spanish, Filipino, spam, coconut, and lastly, delicious!!", "author": "Kat E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-15", "description": "I didn't even know Guamanian food was a thing, but now I do.   And I like it.  Very unique flavors and plates (all well prepared).\n\nStaff was really friendly and helpful.  I'll be returning.", "author": "Joe H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "My wife and I were in San Francisco from Toronto for the weekend and wanted to eat somewhere interesting, and Prubechu certainly fit that bill. We highly recommend the tasting menu for first timer's like ourselves. Both of us agreed that this was one of the best meals we've had together. The flavors were so unique and so artfully put together. We really appreciated the attention to detail and the mindfulness of the servers. The shaved coconut salted ice cream desert that we ordered was to die for! This restaurant makes us want to visit Guam ourselves, it was that good.", "author": "Nadeem M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "This place is awesome. The food is great and everyone is really friendly. Went with the tasting menu and it was an amazing  course dinner. Flavors are really unique and a great experience.", "author": "Nehal M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-07", "description": "A real find. Not only is the food delicious, the people who run the place do everything to make you feel welcome and well-fed. Head chef Sean (sp?) used to cook at Incanto and his serious cooking chops show. Meanwhile, everyone at the restaurant feels like family. Hope they last a good long time.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "We were served the tasting menu and it definitely was a memorable experience! Food was exquisite both in terms of taste and presentation without being pretentious. Staff was genuinely warm and knowledgeable about their dishes. We saw one of the chefs inventing a dish on the spot, probably for a dietary restriction.\n\nCongratulations on a job well done!", "author": "Simona N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-21", "description": "We just had an outstanding dinner at Prebechu! Go for the tasting menu and you will get plate after plate of AMAZING food brought to your table. The pacing was perfect as were the portions. The servers were friendly, knowledgable and clearly passionate about the food. Such a great find!", "author": "E B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "inventive recipes and fantastic service. a bit pricy but only way to survive mission gentrification...it's a cycle, no one is immune...keep up the good work!", "author": "Xiu L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "I am obsessed with this place. Every dish is both beautifully prepared and presented, the food is flavorful and filling but not heavy, and every time I get the tasting menu there is something new I have never tried. Also, the chefs are awesome and friendly. Go here!!", "author": "Zoelle E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "Delicious and unique dining experience! We each ordered the tasting menu and were delighted with every course. We will definitely be back!", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "Wow, creative dishes, superb taste, excellent presentation, and friendly staff. One of my top 10 food experiences in SF!", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "A friend who knows his stuff picked this place and it kind of blew our minds. It's a nondescript and fairly plain room in an otherwise great location, but the service and food was full of enthusiasm and authenticity and was one of the better meals I've had this year. First off a $45 7 course tasting menu is almost ludicrously cheap for this quality - it'd be a great deal at double the price.\n\nAs for the meal, it started off with an oyster amuse bouche - pretty standard but with the coconut vinegar it had a hint of Southeast Asia that set the tone for the rest of the night. Following was a cold smoked potato soup with more coconut coming through the creamy base. Next up was a Guamanian ceviche with some house made spicy chips and an oily ash base that grounded (literally!) the flavours. After that we had a house made chicken sausage that usually comes stuffed inside a chicken neck but for North American tastes was altered to be stuffed inside a banana leaf. Paired with a house made sriracha like sauce that gave the lightly seasoned protein bit of bite and we really started to realize this was going to be an unexpectedly memorable dinner. The fifth course was easily my favorite; a panko breaded soft boiled egg resting on top of house made \"spam\". Vaguely reminiscent of Wyly Dufresnes famous deconstructed eggs Benedict it was the simplest but tastiest dish of the night. But not by much...the penultimate course was a braised short rib on top of glass noodles surprisingly finished with a light broth. At this point I need to mention our server (who may also have been one of the co-owners). His dish descriptions were filled with phrases like \"my grandma's recipe\" and \"back home we eat it like this\", etc. It's clear these kids are cooking and running the front of house with a ton of passion and genuine love for Guamanian food. But it ain't over yet! Dessert was a coconut ice cream with some kind of fired tapioca that turned it into almost a biscuit or shortbread. Rad. \n\nAll in all a stellar meal. Probechu - get some before it blows up!", "author": "Andy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "Just awesome.  Get the tasting menu.  Accept the wine recommendations.  Go, now!   Visiting SF from Boston, wildly impressed.   You'll be glad you went.", "author": "Eric Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-08", "description": "Quite the fresh new Mission addition. First time here and  our party was surprised beyond belief. It's too good to be true Prubechu. Coming back for the atmosphere, innovative dishes and generous peeps. I did have a \"Barcelona\" moment before entering. Deja vu.", "author": "DS K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-10", "description": "Last night was our first time at Prubechu. The food was amazing, service was personal and made you feel like a guest in their home. Definitely try the chefs menu and let their culinary talent lead the way.", "author": "Paula W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "As a Chamorro and SF native, I've been waiting for someone to serve up our culture with pride and love, and now it's here.  Prubechu takes authentic, family recipes to the next level by putting their own gourmet, palate exploding spin on them.  The ideas are amazing, the ingredients fresh, staff truly Island welcoming(Prubechu) and the result is a dining experience to be remembered.  The Shawn's have set the bar on the new \"go to\" restaurant and if you're looking to explore something completely unexpected and rare...my friend, you've found it.  Run run run down to 24th and Mission, grab a seat and be prepared to be amazed.  This is the city's newest gem.  All of your senses will be taken to new and unexpected heights.  Si yu'us ma'ase Prubechu!", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "Wow. Huge flavors. Tasting menu is a must, and the ice cream will change your life. Service impeccable also. 8/10 will come back.", "author": "Jarrett S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-21", "description": "Food was delicious and really unique... The owners are wonderful with true passion for their work...", "author": "Bill R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-05", "description": "Awesome food, the chefs tasting menu was delicious and the variety is amazing. I've never had Guamanian good before but this place taught me all about it and then I lived everything! Would totally go back! Keep it up! Thanks for your hospitality!", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-10", "description": "I'm not from Guam, nor have I ever been there. But my ex is Chamorro and a lot of my friends are from Guam, so I've eaten homemade Chamorro on a number of occasions (i.e. Red Rice, Shrimp Patties, Keleguen, Tinaktak, etc.). No where I have eaten food like this. It's like amped up Guam food taking all the classics and making them exceptional. I love that the place is in the Mission, just a block away from Bart. You need to be aware of the address as the signage is not up yet, but I love that cause it makes it under the radar. I went for a going way dinner on a Wednesday night and we all did the tasting menu, which was amazing and to die for. I loved every single dish, so much so that I lost track of taking pictures and that's pretty bad for me since I'm #AsiansTakingPicturesOfFood. My highlights were the chilled corn soup with deep fried nori, Kadu with carrots and squash, Chicken Keleguen with shredded coconut and the Coconut Candy Ice cream was heaven. I devoured that Coconut ice cream after thinking I could no longer stuff anything else in me. Note that the Chef Tasting Menu changes based upon produce and recipe changes, but that's the best since you can always come back and enjoy another experience. Just sit back and let all these amazing dishes come to you.\n\nTips:\nOrder Chef's Tasting Menu ($45 -you will not regret it- very creative and super tasty)\nTake the Bart - get off at Mission and 24th (unless you want to fight for parking)\nTake notice of the address- no sign up yet\nCausal but Intimate scene", "author": "Jennifer Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-18", "description": "The staff was very friendly, but I wasn't super excited about the food or the price. The chicken keleguen was good but not as good as I was expecting. You also get pretty small portions for the prices. The ambiance was also not great - very loud music.", "author": "amanda m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-03", "description": "This was an exceptional dining experience.  The food was delicious, the service was extremely attentive, and the attitude of the staff was phenomenal!!!\n\nWe had the tasting menu, and it was worth every penny.  5 courses, and all were great!  Several waiters/waitresses served us, and each one gave us a detailed description of the dish and its ingredients, and even some background on the dish!\n\nThey take a lot of pride in what they serve, and are more than happy to tell you about the food, its ingredients, and its preparation.\n\nThey were all extremely friendly and good natured!\n\nAn extra thank you to Tracy, who was our main waitress!  She was awesome!\n\nI will definitely go back.  Highly recommended!!!", "author": "Elie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "Great job and wonderful tasting menus, friendly and flexible staff. Highly recommended!", "author": "Athena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "Fantastic meal.  Tasting menu was 5 excellent courses that got increasingly more substantial, with an amuse bouche and dessert to boot.  It's the perfect balance of comfort food and elevated--nothing feels out of place or unnecessary.  The yam fritter and homemade coconut ice cream were the secret stars, but all of the dishes shined.  Can't recommend it enough and couldn't be happier for the Shawns and the new place.", "author": "Chris J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "My wife is Guamanian and her parents are restauranteurs so it takes a lot to impress me- but i was very impressed. The food was absurdly good, the service was personal and the ambiance was relaxed. The pride that the cooks and host have in the island and their food is clearly evident. I'm looking forward to my next meal there.", "author": "Greg R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-17", "description": "An excellent tasting menu of coconut, fish and pork -inflected Chamorro food. Plenty of pickled vegetables, and a fun coconut liquor. Prubechu may be the most careful and detailed food I have ever eaten, at that price point. The server Sean was gracious and attentive. The space could have used a bit more ventilation.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-18", "description": "nothing like it in the city!  Did the tasting menu with a group of 5.  Really creative and flavorful dishes - each course was better than the last.  This place is a huge find. Looking forward to going back again soon!", "author": "meaghan r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "we went with a big group and all did the tasting menu. i thought every dish was good, some were delicious. the two all-stars were the breaded soft boiled egg and the sea salt ice cream. those two dishes were so amazingly unique and tasty and i'd love to have them again, but the price doesn't seem worth it. staff was friendly and informative. the male server was trying to be very cautious of the people with food allergies at our table, yet somehow the other servers kept serving them the exact dishes they weren't supposed to receive. even though they were apologetic about it, it's not something i find acceptable that they made the same mistake for several courses. in general, it was a nice dining experience but i probably won't be rushing back", "author": "Anjelica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-08", "description": "My fiancée and I had the chefs tasting and supplemented it with the pickles, soup, and salad. What a wonderful meal. Service was also wonderful. Favorite dishes: porridge, oxtail stew and the candied ice cream. A tremendous value.", "author": "Ish H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "Most welcoming and friendly service in SF.  Sean and his staff are great and really make you feel like family.  The Chamorro menu is great and a unique addition to the culinary scene.  Do not miss the coconut ice cream dessert.  I will definitely go back sometime soon for the full tasting menu.", "author": "Stan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "Awesome tasting menu in a very family atmosphere. If you are not Guamanian you will be made to feel like you are.", "author": "Derek S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "I was once an ignorant person. I had never had Guam (Guamese? Guamish?)  cuisine before. Now, since this is my ONLY time trying this cuisine, I can't speak to its authenticity or whatever, I just know it is pretty dang tasty. As unusual as this may sound, it felt like a cross between American southern barbeque (just a bit, a lot of smoky flavors) and a more restrained Thai cuisine (a lot of coconut used but less sweet). Oh mama, that's a good combo.\n\nI, like many others, got the prix fixe five course option. It's not extremely filling, but you get to try a lot of different things, and they were all pretty great. My companion and I split that and we also got the red rice plate, which is a big plate of food, in stark contrast to the tasting menu. So, get the prix fixe for variety, order another plate if you want a big hearty meal. \n\nI should also mention the service, which was uncommonly personable and warm. And for a fairly nice restaurant, it was refreshingly lacking in pretense. Great experience, an underrated restaurant in the Mission that I suspect will become overcrowded sometime in the future.", "author": "Dustin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "This restaurant  is not of this planet... the food was beyond amazing and the atmosphere equally impressive.  The kelaguen Uhang(shrimp ceviche) was ridiculous, delicious doesn't even begin to describe how good it was.....I am so impressed by this restaurant and you would be stupid not to eat here", "author": "Alexander B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-28", "description": "The Tasting Menu blew my mind!! Most amazing courses I have had in a long time!! And the coconut ice cream was the best way to end the meal!  Great job guys!", "author": "Ernie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-22", "description": "4.5 stars\nTop-drawer experience. Went in on 3/20 at about 8:03 pm w/ a pal.  Pal had regular tasting menu - I had the pescetarian tasting menu. Each item was tasty and unique in flavor. The server, Sean, explained each dish in a polite, enthusiastic manner. The pacing between courses was perfect.  We had time to appreciate and savor each concoction that Chef Sean made.  And $40 for a tasting menu in SF - what a deal - just right portions - zippy flavor. Impeccable service - everyone was just super nice and passionate.  Will def go back as Chef Sean uses seasonal ingredients -- will want to see how he mixes things up. Stand-out dishes for me were the amuse buche oyster with a coconut vinegar - the porridge w/anchovy and cauliflower - and the soft boiled egg w/ roe and house-cured salmon. So good - all paired with a smooth Riesling. A very welcome addition to SF.", "author": "Carson R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "Prix fixe was phenomenal. So many diverse flavors and the presentation on every meal was superb.", "author": "Rick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "absolutely an amazing dining experience.  the ambiance is solid - great music, calm and relaxing service - the entire team is from Guam and the food is authentic.  delicious and fresh.  Highly recommend the chef's tasting menu!", "author": "Cindy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-01", "description": "Quite the gem. Had the tasting menu and it was delicious. Also extremely affordable for a tasting menu.  The only downside is as the restaurant got busier, our food came out slower.", "author": "Quang N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-18", "description": "This was a disappointment! The food is NOT traditional or authentic Chamorro food? What is Fusion? They don't have that in Guam is it something they made up? Being from Guam , 100 % Guamanian / Chamorita everyone knows we make our food from our grandmas & moms recipes, we cook our food to represent our culture \"the CHAMORRO People\"so to make this little bit of food when Chamorros are known to have big parties or fiesta this was a disgrace. We had the chef's choice spend over $200 for 2 people that was a rip off! Also never spent that much money & still was hungry & got food right after , we left at Chevys across from the W. I'm not sure how they are making it ? but I wouldn't pay another penny to eat at this place if it was the last thing on earth. The place is small doesn't feel like Guam hospitality more like a Japanese sushi house right on the mission. Not sure where they got their recipes but definitely NOT representing our culture ! The reviews must be by NON-Chamorro customers & friends of owners because there is no way they represent GUAM. What is fusion anyways?", "author": "Lani A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-10", "description": "Food was perfectly flavorful, authentic, and cooked with love. We felt well taken care of by the friendly and warm staff.  Loved the quaint/unpretentious vibe, and enjoyed chatting with the chef in the open kitchen. Such a treat!!", "author": "Anastasia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "Went here on the recommendation of a friend, and were we glad we did. We ordered the tasting menu and were not disappointed. Food was delicious and well presented. The service was warm and friendly, with each course accompanied by information about the dish and its provenance. Nice, bright place that is not too loud, and has a relaxed, comfortable vibe. Highly recommended!", "author": "Avinash K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "My favorite restaurant in SF! We usually share the tasting menu plus a main. It's all fabulous so you can't go wrong. This Friday there was awesome live music.", "author": "Laura V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "Never been to a Guamanian restaurant. Is Guamanian even a word? Anyhow, Prubechu was a cool experience. I was really looking forward to trying something new. I had the tasting menu and was really impressed. I wish I could remember the names of the dishes, but I predict it won't be long until this cuisine becomes mainstream and we all know the names of dishes from Guam. I had some kind of coconut chicken and a porridge that had quail eggs. They were delicious. Apparently the menu changes every now and then. Great idea! I will have to come back to see what's new in a few weeks.", "author": "Eduardo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "We've been to Prubechu twice and were blown away both times by the unique and exquisite flavors. We ate vegetarian both times and found the food to be similar to our experience eating Burmese in SF in that the flavors were unexpected, sometimes complex, and unlike any other food we've had the pleasure of stuffing in our faces. Impressive food, Friendly people, Cozy environment. Go Here! Yum!", "author": "Suki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-10", "description": "A chefs energy flows from his hands and what Shaun Naputi is doing here is a great example of elevating a modest cuisine to refinement without loosing its soul. Course by course my party of six was delighted by the unique yet familiar flavors that reminded us of growing up in Guam, every dish teased our palates and left us excited for the next course. Our 6 course tasting was flawless. Great Job Shaun and Shaun!", "author": "Riko M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "Had a great meal here!\nThank you Shawn & Shawn for this fantastic new addition to the SF food scene.", "author": "Agnes B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-03", "description": "What a nice change of pace! The Shawns are super nice and friendly and the food is delicious with enough selection that a vegetarian can eat here easily. Lots of coconut flavor in what I had and it was not really like any other cuisine I've had. Super friendly hosts, too!\n\nCheck it out, wish the Shawns the best - hope this place sticks around!", "author": "Ara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-07", "description": "I must admit, I was a little hesitant when I stepped into this place at 7:30pm (on a Tuesday) and there was only one other couple there. It looked more like a cafe, there was no sign outside, the menu was just a little card with a few items on it. I whipped out my phone to double-check the Yelp reviews and that convinced me to try the place out and overlook the ambiance. And I'm glad I did. So thanks everyone! We got the 5 course tasting menu, which I think actually ended up being 8 courses or so. And everything was perfect! The service was amazing, and the place definitely looked cuter at night with the candlelight. I'm surprised this place isn't busier, but then again, they just opened up a couple months ago! Go check it out while there's no line-up!", "author": "Salimah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "Absolutely amazing food. A breath of new tastes for the city. The tasting menu is of amazing value. Can't go wrong. They take reservations over email or the phone so just call them up.", "author": "Diego D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "Authentic, enjoyable, and great amazing atmosphere. Very classy but still has a close family vibe to it. We love it and will be back!!!", "author": "Auna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "Majority of foods I've eaten before tonight are no longer worthy to be on my palette. Coconut ice cream....amazing.", "author": "Brittany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Tracy was a wonderful host and added to the experience of eating at Prubechu.  My wife is from the Philippines and I am from Hawaii but this was a very new dining experience for us.  The food was very unique and different.  But this was a good different.  We went for the Chef's selection which meant we didn't know what was coming but trusted that we would be happy.  As it  turned out the food was very good.  We were served 7 carefully prepared entrees.  The dishes are designed to be savored, internalized and then discussed.  That was part of the charm and allure.  Of course if it didn't taste good than then what would be the point?  I really liked the corn chowder?/soup and the home made Spam with eggs salad (guys from  Hawaii this is not your mother's Spam and egg). Fresh ingredients/creative taste combos. Tracy and her hard working husband/Chef, Shawn, has a good thing going here.  My wife and I will be back for their other entrees soon.", "author": "Dwight S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-15", "description": "After posting this review I got a call the next day from them given me a reservation even without my credit card!!! Why couldn't they do this before? So I upgraded them to 3 stars. At least they read the Yelp reviews. I didn't go since I already had a reservation to another restaurant in the mission district.", "author": "Benjamin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-26", "description": "Whether you're looking for something new or want to reconnect with a cuisine that you really just can't find anywhere else around here, this place is a home run in almost every way. It has a bit of a \"permanent pop-up\" feel, which in my mind means chefs and restauranteurs doing what they love the way they want to do it. I'm not a chef, but it seems like a good way to connect with your passion and shed the restrictions placed on creativity by larger establishments. Whether that's the case here or it's just a display of irrepressible talent, the result is fantastic. The food and service are top notch and it's the kind of experience that you won't mind paying a little bit of a premium to have. Many many places charge far more for far less.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-20", "description": "I am sorry to say it but I have just eaten there and it is seriously overpriced. Everybody was nice and friendly, I have to give them that, but $50 chef's menu was just a little steep. The food was good, especially the egg with porridge and the coconut dessert... the other 3 courses were not that memorable... At the end of the night our bill including the tip was over $160 and I we just had a couple of glasses of wine and a beer... It was a little excessive for this cute, down to earth place.  I kind of wished we had spent this kind of money somewhere else... It was my birthday dinner and it was a tad disappointing but it was my choice and I made my own bed... Oh, well, there is always next year...  :(", "author": "ania w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Definitely eat here. ..What I especially loved about my experience at Prubechu was the warm ambiance and the service. The food and beer were great too. The ambiance was slightly island like (not over the top) which in SF = JOY. The restaurant temperature was pleasantly cozy (not hot) - which I find rare in SF... I'm usually sitting in any SF restaurant freezing. But they closed the front door I could take off my jacket and I amazingly felt so comfortable. (As a girl in SF so often you go out and your whole outfit is just covered up by the coat you have to wear in order not to freeze!) The other warm thing they do is play this lovely fun music that puts you completely at ease. The service is perfect, friendly, efficient, relaxed. I'd recommend the Tinaktak (coconut braised beef, hand made pasta), or the tasting menu which looked amazing (hope to try it next time.) Also they have a delightful beer selection! And the plants and flower arrangements throughout the restaurant are also so cool. Thanks Prubechu!!", "author": "Cassia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "I consider myself an expert when it comes to chamorro cuisine, why you ask...well more than likely because I am a chamorro, born in Vallejo, CA but raised on the island of Guam since I was 7 months old and since then I have had the pleasure of tasting, serving, cooking and of course eating our island cuisine.  By no small feat are many of the dishes simplistic, in fact preparation for much of what we eat is time consuming.  Prubechu has taken what is already great food and made it GRAND!  The succulent flavors from each dish burst out and compel you to want more.  As if the 5 course tasting menu was enough, NO!!!!.....we had to venture further into their simple but seductive and enticing menu and order more.  Then they top it off with ice cream and not Blue Bunny, Hagen Das or Bryers but their own, homemade....coconut candy and melon ice cream lightly sprinkled with salt that was made on Guam.  The sweet and salty totally blended well and made for the perfect end to the perfect dinner!  Btw....their service was pretty amazing too!", "author": "Edyth B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "Last night I had the pleasure of sampling the tasting menu.  I truly enjoyed each and every course.  I was amazed that one of the owners recognized me from a brief stop in about 6 months ago.  Such a great meal and a very knowledgeable informative staff.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "This was hands down one of the best meals I've ever had in SF. So many unique and scrumptious flavors, incredibly attentive and personable service. My partner and I got one tasting menu and then an arepa and the shrimp ceviche dish, plus some tuba drinks which were very refreshing. I know embarrassingly little about Guam, but after meeting the team at the restaurant and tasting their amazing food, I am going to put it towards the top of my dream vacation list. I can't speak highly enough of this place!!", "author": "Justine M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-21", "description": "went here for a friend's birthday. excited about the set courses. place is nice and quaint, owners are friendly and serve your tables personally.  \n\nThe first course was a soup that was beyond bland. corn undercooked and fish was dry. the next course was an egg I believe which was by far the best thing on the menu. it was covered in a kind of mayo/uni type sauce which definitely made it.  the rest of the food was highly forgettable. nothing stuck out. and the price for the tasting was not worth the flavors. \n\nI hate to be a hater, but the food just wasn't good. bland and boring. I will not be recommending this to any of my friends in the future. \n\nthe owners though were incredibly nice and highly accommodating.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-24", "description": "My husband is Chamorro but I'm not. I've had homemade Chamorro food while on Guam and while I can tell you that the food at Prubechu is delicious I don't know how it rates with his grandma's cooking.  He was impressed...like teary-eyed he was so happy to be eating this food.  The menu is short so we ordered one of everything and loved every bite.  Friends have been e-mailing us articles from all over the country about this place and I genuinely cannot wait to take them all to dinner here. Delicious, authentic & beautifully presented.  Can't wait to go back!", "author": "Ann B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "I hesitate to write this review because this place is surprisingly fairly empty and you can get a seat last minute. We got the tasting menu and it was really really good. It was 5 or 6 dishes that were a total surprise-- they won't tell you she's of time what you'll get but they ask for any allergies or aversions. Our tasting was comprised of a flat bread, shrimp ceviche soup, chicken sausage and red rice, fried egg on a bed of housemate spam (this was so good-- it had a soy sauce and sesame glaze that was perfectly crystalized), braised beef and a tapioca coconut dessert. Oh and pretty much every dish has coconut as an ingredient, so if you don't like coconuts this isn't the place to go. The service was also great-- our waiter was really nice and patient as we asked a bunch of questions-- none of us knew anything about Guam cuisine. One downside is they only have beer and wine (don't think they have a liquor license?) so if you'll looking for a cocktail might need to go elsewhere. Also the food is on the pricier side for southeast Asian cuisine. An entree ranges from like 17 to 26.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "Modest, small, restaurant with little in the way of frills in the Mission that executes an excellent culinary experience! We did the tasting menu, which was 5 (+1) courses of beautifully prepared, innovative dishes with complex flavors and techniques that made it so fun to eat and experience! Each dish engages all 5 of your senses. The menu changes frequently, and you kind of need to go in to see what they will be serving that day. There is also an a la carte menu, but the tastng menu will have completely different set of dishes. My only disappointment was the wine list -- but not going to knock the place for that since wine isn't a Guamian staple, and the food really does speak for itself.", "author": "Ana J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-02", "description": "Extremely satisfied. In the heart of the mission with a comfortable atmosphere. It's not too fancy and not too casual for a dinner. It's warm and inviting with decorations from the island. My boyfriend and I had the chefs tasting menu and enjoyed every dish. The price was very reasonable for 5 courses. The chefs did a great job of explaining every dish and the portions were perfect (especially for island food). Sitting at the bar, we had a chance to view a lot of other dishes and will be coming back to try it all. I recommend ordering a portion for each person of their dessert with coconut ice cream (made in house). I cannot wait for them to package that ice cream for retail! Glad to see this is a restaurant that's highlighting the best of Chamorro food.", "author": "J P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-05", "description": "I had a priceless experience at this truly unique restaurant!  The flavors delight the palate with layers of surprises.  We had an entertaining evening as well as an eating adventure -- scrumptious textures and exotic pairings.  Great attention to presentation elevated the simple flavors to a really artistic level.  I highly recommend this wonderful restaurant for a memorable dining experience.", "author": "Julie F."}
