{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "Wow! This place is amazing! It's my first time having Russian/Ukranian food and my friend introduced me to this place. The dumplings are phenomenal with sour cream (who knew? this combo works very well). Coming from a Chinese background, I originally thought it was sacrilegious to add sour cream?! Now I'm completely sold on it. I liked the lamb the most, but the beef is very good as well.\n\nThe borsch is also very solid. Definitely come check this place out, its in a little food court so make sure to go down the stairs.", "author": "Taylor Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "I've never been down into this food court because you know why? There hasn't been anything reallly that highly reviewed until Pushkin. \n\nPushkin is the \"push\" I needed to enter the food court at the basement of the intersection of Bush/Kearney. \n\nWhat is a Pelmeni's to me essentially it was like a Chinese dumpling, which I've had more than a few.  \n\nI went with Beef AND Lamb Pelmenis. These come in a container with a lid and broth inside of them. Be forewarned however that these will leak (not watertight).  You can also get some sauce to go which I would have overlooked had I not seen a regular loading up. \n\nThe pirojki's were just meh to me. I got the spinach one so maybe I need something with some protein in it to satisfy my palette. \n\nFor the price/value I think it's a classic 3 star venue for me. I'd have it again and would return but I'm not super enthusiastic about it. \n\n\nIf you like my reviews, consider \"following\" my profile for reviews all across the SF Bay Area . Why \"follow\" someone?  It causes the person you follow's reviews to tier to top when you pull up a business. I find this very handy when researching venues. \n\nRod's Review grading scale explained. Essentially I personally base it on the likelihood of a return visit and I try to be stingy with 5 star reviews since they should be \"special\" in my eyes. Price/Value also play a role obviously but there are $ and $$$$ littered across my grading scale. \n\n5 stars - \"I'll go out of my way\" (approx 6 % of my reviews)  4 stars- \"If I was in the area I'd go here and would recommend\", (approx 38% of my reviews)  3 stars \"Maybe if was nearby\", (approx 37% of my reviews) 2 stars -\"Would likely not return, Only if you want to go\", (approx 16% of my reviews)  1 star -\"No thanks, even if I was hungry\", (approx. 3 % of my reviews)", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "I don't know how many times I've eaten here for lunch, but I don't think I'll ever get sick of it. Not sure why I've not yet written a review, but credit where credit is due!\n\nThe beef and lamb pelmeni are my favorite. Every bite filled with savory filling- nothing can beat that homey taste. The food does not feel heavy at all but still seems so satisfying and definitely keeps you feeling full throughout the day.\n\nThe pirojki is also amazing. The sausage and cheese is yummy- I've yet to try the beef/onion and the mushroom. But if you've got a sweet tooth, you must try the apple pirojki! It's like an apple pie in a soft bun. Mmmm\n\nStaff is super friendly and accommodating. Prices don't suck. A must try if you haven't already", "author": "Meghan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "I was out looking for something to eat for lunch and knew about the International Food Court and decided to wander down to see what I wanted to eat.  I decided to try Pushkin, since they have Pirojki's, that I've been wanting to try for some time.  I mean what a great combination, bread and meat.  \n\nI ordered the Sausage and Apple Pirojki's, since I wasn't really all that hungry.  The bread was very soft and I noticed they aren't shy with their fillings.  The sausage had a good flavor and the meat was really tender and seasoned just right.  The apple had the right amount of cinnamon and was very good.  I was surprised how filling these were, since I assumed I'd still have room for something else to eat.  \n\nThe International Food Court is downstairs, but has quite a few tables and can get really crowded at times.  If you don't mind sitting next to other people, then just enjoy the food and make some new friends.", "author": "Lon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "My new favorite spot in SF, which I learned about through my colleagues and am so very thankful. It's located downstairs in the International Food Court. \n\nAt the moment, my go-to dishes are the Potato Vareniki and the Chicken Pelmeni. Both are cooked al dente, arrive piping hot, and with the perfect dumpling skin. The Potato Vareniki is sautéed lightly in oil with carmelized onions and is so incredibly melt in your mouth flavorful (think...comfort food). The Chicken Pelmeni comes in a bright broth and reminds me of Won Ton, however, the skin is thicker. \n\nIf you're not in the mood for dumplings, you can try one of their yummy Pirojkis (buns with fillings) and be just as satisfied. \n\nThe portion sizes are generous, so you will definitely be full afterwards. The service is great and super quick, so if you're in a rush, this is your place!", "author": "Lori C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Yum!! Pushkin is a great, unique lunch spot. My coworker recommended it to me and I already can't wait to come back again. \n\nWe had 3 kinds of dumplings. Two Pelmeni (beef, lamb), and the Potato Mushroom Vareniki. They were all delicious, but I think the favorite was the potato, followed by the beef then lamb. We each tried the borsh as well. I had never had the dish before but enjoyed it a lot. The others who have had it before loved it. \n\nThe portion sizes may seem small at first but in my opinion, the food is much more filling than expected. We had two large and one small portion of dumplings to share for four, plus a small soup for each. This ended up being plenty food.  \n\nDefinitely come try Pushkin for a delicious lunch that's such a nice change from the typical FiDi options.", "author": "Jessie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Great new place located inside the International Food Court.  Ordered the Chicken Dumplings (Large-$10) and a Chicken & Mushroom Pirojki ($3.50). I normally love dumplings so I really wanted to try the chicken dumplings here.  I ordered the large and it contained more than a dozen deliciously seasoned cheesy chicken dumplings! I will have to go back to try the other dumplings.  Their pirojki flavors change daily/weekly, they didn't have the Pepperoni today, so I got the chicken & mushrool pirojki instead. These are a pretty good size, one of these are pretty filling.  I will have to try the pepperoni next time. I will be back!\n  \nUpdate on 9/4/2018:  Since they opened in 2017, I've been visiting at least 4-5 times a month.  I am so pleased by their rotating menu's and consistent quality.\n\nUpdate for MealPal:  Today's option was beef pelmeni.  I love their pelmeni's and the broth.  The container looks really small, I counted 9 beef pelmeni's and I was satisfied but not overly stuffed, it is a nice portion especially after you finish the broth.  I will be looking out for their other MealPal offerings.  \n                          \nMealPal tip, dont wait in line, just make eye contact with the cashier and tell them you are picking up for MealPal. :)", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "Awesome food. We got literally got about half of the items in the menu. Highlights for me were the borsch, potato dumplings, and lamb dumplings.", "author": "Joe J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "Their pelmeni are the best! I hadn't have such a good dumplings for a long time. Try the borshch or pirojki if you are adventurous! Come early to grab the lunch as the lines tend to get lengthy some minutes past noon.\n\nI usually get their beef dumplings, although I had their salmon dumplings quite a few times as well. Equally delicious! Staff is very friendly and works hard to delivery fresh home-mage Eastern European experience!", "author": "Jakub S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "My new fav lunch place. Fresh and delicious. Good size portion and reasonable price. Very flavorful dumplings and broth.", "author": "Gloria T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "This place is part of the international food court. The lines are pretty long during lunch hour. I tried the Potato Vareniki and mushroom Vareniki. They were delicious. The caramelized onions added on top really adds great taste to the dish. 6 dumplings in a plate.", "author": "Sushma R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Has quickly become my favorite lunch spot! Mind you, I'd never had any Russian or Ukrainian food before, but once I did, it was love at first bite.\n\nI've gone multiple times in the past couple of weeks and tried all the PIROJKI with Beef being my fav, and Apple coming in second. \nMushroom is a good option if you're a vegetarian.\n\nBORSH is amazing! Make sure to add the garlic from the condiments if you love garlic like I do.\n\nI also love all of the PELMENI with Chicken and Lamb being my go tos. They are the biggest dumplings I've had, so keep in mind they are surprisingly filling.\n\nThe chicken cutlet bowl is delicious and definitely worth the try. Love the flavor combinations with the pickle and sauce.\n\nTried the spinach soup the other day and its alright, but it didnt wow me.\n\nQuick service, probably the fastest from the entire food court so you'll never wait too long even during the lunch rush.\n\nCheck it out!", "author": "Jaye P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "I came maybe a year ago seeking piroshki, but what I discovered was the pelmeni (dumplings).  Love them.  I probably go for lunch once a week.  Lamb are my favorite, but all flavors are delicious.  The specials and soups are also tasty if you are in the mood.  \n\nSadly, the pirojki are their weakest menu items in my humble opinion.  I came to know piroshki in Seattle, where I feel their piroshki game is stronger.", "author": "Margo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "I've been a few times for lunch and have really enjoyed everything I've tried. I've tried an assortment of dumpling flavors - salmon, chicken, beef, as well as the piroshkis. The soup that comes with the dumplings is very light and satisfying and has a hint of cilantro flavoring as well. They give you some kind of cream cheese to eat with your dumpling.. although I'm not entirely certain how to best pair with the meal. \n\nSadly they close at 2pm so you can't come for a late lunch or mid-afternoon snack. They also accept credit cards via Square.", "author": "Jeanette S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-27", "description": "Pushkin is the eatery that we need but we don't deserve.\n\nThe food is fantastic. I love love love pirojkis. It's a combination of my two favorite things: baked goods and well-seasoned meat. I'm used to fried, greasy pirojkis, but I prefer them baked like these. I wish I could give Pushkin 5-stars, but the food court where it's located reminds me of a set to a Chris Nolan Batman movie -- dark and dingy. \n\nI order food from Pushkin via MealPal. This is such a bargain! Pushkin gives good size portions, so I'm always full after a meal. I've gotten lunch at least 3 times already, and it's been fantastic every time. \n\nThe borsch is also delicious--heartier than I expected! This is a great comfort soup. \n\nI really need to try the dumplings. My co-worker loves them. \n\nI wish there was a Pushkin on every block, and I could get pirojkis any time of the day.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "This authentic food gem is located in the corner of the International court. I always find it hard to find good Eastern European food in SF, but Pushkin has it all. Delicious and good size pelmeni (dumplings) and hearty pirozhki taste just like home! Borshch is rich and flavorful just like my mum's. I wish they were open for dinner sometimes or expand to other part of SF (Mission please). You can never get wrong with Pushkin!", "author": "Alexander A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-08", "description": "I have come three times this week to get meat filled piroshki and by 1pm they are sold out! Too bad.", "author": "Andrea S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-27", "description": "My only complaint here is the price. It is in that shitty little underground market on Kearny.  This stall was far cleaner than the underground market would suggest.\n\nI think you could get a better value if you went with a few people and ordered the Large sizes of a few things to split.\n\nI went with one gal and we split the small size of 3 things: the potato pierogi, the small size of the chicken dumplings in broth (with dill) and the polish sausage roll.  We loved all of it.  They offer as much sour cream on the side as you want. (it was about $25 total for 2)\n\nI will be back to try other offering on a cold rainy day.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "A rare sight in SF downtown, I always want to try unique food that is not common in SF and I found this hidden gem. There was no line for this place since the line was long for the Korean bibimbap. I heard the lamb dumplings were good, so I decided to try it out! Quick service, no wait. I got my small warm bowl of lamb dumplings in less than 5 minutes. I believe the cost was around $7-8. \n\nI slurp on the soup first to absorb the taste and it was really hearty. I took one bite of the dumpling and I instantly can taste the strong lamb flavor. The bite was really juicy and savory and I dunk it into the soup to get more of the flavor.  I don't recall how much dumplings were in the small bowl, but I was content in the end.\n\nOverall, this is the place to go if you want to hold a hearty warmness bowl in your hand on a cold afternoon.", "author": "Judy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "Hidden down some stairs in the international food court basement youll find possibly the best Russian food in the city. Not knowing portion sizes I ordered both a large order of lamb pelemi dumplings and a cup of borscht. The pelemi had tons of tender lamb meatballs wrapped in pink noodles soaking in a hot cup of chicken broth. The borscht was thick and hearty and had tons of beef and potatoes. The broth was tasty but not as intense as others iv had. Service was quick and friendly, food tasty and large portions, and prices cheap. Whats not to love?", "author": "Sean G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "This is my favorite Russian-Ukrainian place in the city. I always go there for Borsch and Potato Vareniki. The vareniki taste almost the same like my grandmother's.    ! It's good to have some fresh cooked good quality Russian food in Downtown.", "author": "Oxana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "What a gem!  I came here for lunch because of a recommendation from my coworkers, and I have been back time and time again. \n\nThe food is GREAT!  I HIGHLY suggest the Pelmeni, you will want a large. Add the sour cream, and enjoy!!!  Perfect size for a nice warm lunch. \n\nThe service is wonderful too.  Ask them any questions you can think of, and be greeted with a pleasant and informative response. \n\nDoesn't get much better than this!!", "author": "Jesse K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Favorite lunch spot. The line can get long but it moves fast and what isn't to love about Ukrainian food? Personal favorite is the chicken pelmeni, they're light and doughy and taste like a chicken noodle soup bomb. I always order the borscht too, a sprinkle of cinnamon takes it to the next level Eastern Promises style. I wash it all down with Kvass which states like coffee made into a soda. to finish it off I'll order honey cake which is super sweet and worth every glucose spike. Also the price is super reasonable for the quality. Spasibo!", "author": "Sabrina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "Pushkin is the lone bright spot in a slightly-grimy underground food court filled with mediocre Thai, Japanese, and pho joints. \n\nReally solid pelmeni--the prices are probably a dollar or two higher than you'd expect given the location and the cost of ingredients, but everything is piping hot and always filling.\n\nService in general isn't particularly warm, but this is a food court spot at the end of the day. (I did see the cashier's face brighten up whenever he encountered customers who were able to converse with him in Russian; although this made me feel a little bit like an outsider, I have to admit it does give Pushkin some street cred.)\n\nGood, fast-casual Russian comfort food isn't a particularly easy to find in San Francisco, but this place does it very well.", "author": "N L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "Pushkin is relatively new addition to the International Food Court (or the dungeon as it is referred to by my colleagues) that I happened to spot a couple of days ago. The menu is simple, consisting of Pelmeni (dumplings), Pirojki (stuffed buns) and Borsh (soup). I decided to get a small order of the beef Pelmeni in broth ($7) and a beef Pirojki ($3.9) to-go.\n\nI was not sure if this would be enough but it turned out that it was. The dumplings were great and the broth was light yet flavorful. The Pirojki was soft and fresh unlike ones that I've had before which were dry from sitting in the heated case. The only complaint that I had was that both the dumplings and the stuffed buns could have used a little more seasoning, but I guess that's more of a personal choice. Overall this was a pretty satisfying meal.\n\nPrice wise it was around the $12 mark which is in-line with what you will pay for a typical soup plus salad type of meal in FiDi. As there are too many Russian\\Ukrainian places around Pushkin is a welcome addition to the food court that I plan to keep coming back to periodically.", "author": "Ahmad J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-22", "description": "Popped in here for lunch the day before Thanksgiving. Thankfully, they were open (some of the shops were closed) at the International Market, or known to some as \"the dungeon.\" \nOrdering was quick, and they got me my vareniki and soup dumplings asap. Both were very yummy, especially on a cold day! I ordered the chicken dumplings that come in a basil dough with parmesan, and a simple bright broth. \nThe vareniki were full of potato-y goodness and delicious with a little bit of sour cream! \nI'll definitely be back to try out the pirojki! Which looked super yummy.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-05", "description": "I am so stoked that an Eastern European lunch place opened up in the FiDi.  It's a strange state of affairs when you can easily get a paneer burrito or bulgogi tacos, but struggle to find pierogies.  Limited menu, but what they do offer, they do well.\n\nBorsh: I really liked this soup.  It had a light broth filled with tons of tender beet chunks; a nice departure from more stew-like versions.  Also, the generous portions of tender brisket added a nice meatiness to the background of beets.\n\nPotato Vareniki: Had a mixed experience with these.  Some were the perfect mix of fluffy potato filling and supple dough wrapper.  Others had that left-out-too-longer rubbery dough texture.  Probably because these are picked out of a catering container rather than boiled to order.  When loaded with sour cream and raw garlic (spicy, but pepper spicy), they were fine.\n\nChicken Pirojki: Seemed liked these were freshly baked before the lunch rush.  Nicely spiced minced meat, still a tad warm.  Fluffy bun exterior.  Definitely a highlight here.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-03", "description": "3.5/5 stars\n$3.90 for all piroshkies\n\nI like that it's a flat and affordable price for piroshkies which are savory pastries. I opted for salmon flavor hoping for a replay of the amazing piroshkies in Seattle. Unfortunately it did not hit the spot. The pastry itself was a little too soft and bready rather than crispy. The salmon filling was average. Overall it makes for a reasonably priced snack but I wouldn't call it special or best in class.", "author": "Tammy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "The food was excellent.  I had the beef pirojki, which was my favourite - very flavourful, I'm not sure what spices they used but I really liked them.  The pelmeni were also very good, though I liked the pirojki better - I had the lamb pelmeni.  It's a huge amount of food.  A small bowl of pelmeni and a pirojki made for a very filling meal for me (not only are the portions large, but it's fairly heavy).  \n\nThere was a long line but it moved fast and the food was made very quickly.", "author": "Sanae R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "My company just had food catered from Pushkin and everything was delicious and they were a pleasure to work with. Food was delivered right on time and hot. I highly recommend using them for catering!\n\nWe got:\nFresh Salad\ncabbage, cucumber, carrot, bell pepper, dressing: olive oil, balsamic vinegar\nOlivier salad (Russian Style Potato Salad)\npotato, eggs, chicken meat , sweet peas, carrot, pickled cucumber, dressing: mayonnaise and mustard\nChicken Cutlets (we asked for one tray of mashed potato)\none tray of chicken patties (20 pieces), two trays of buckwheat (kasha), side of creamy mushroom sauce and pickles\nAnd all the  Pelmeni and PIROJKI", "author": "Susan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-26", "description": "It was okay. I'm so in love with the Russian bakery on Geary that it's hard to top\n\nI tried the  vareniki  which had potatoes and mushroom.  It tasted liked super creamy mashed potatoes inside the dough\n\nThe beef piroski has a generous amount of ground beef\n\nThey didn't have mushroom piroshki and I wasn't sure about the cabbage substitute \n\nLine was long at 12:30 but went fast", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-06", "description": "Good Russian food, it gives a real alternative choice to regular Mexican/Asian offer. It also provide new tastes and spices. My only regret is the amount of food for the price. I took the Chicken Cutlet (really good) and I could have ate a bit more..\nI will go back there, to see if they are a little bit more generous ;)", "author": "Leo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Very clean place with authentic food. I was surprised how good it tasted and how fresh was it! I think this is the most filling i have ever got in a traditional Pirozhki.", "author": "Tatiana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "Although we live in one of the most diverse cities in the world, we certainly do not have many options for Eastern European cuisine. So I have to say that I was pretty excited to see Pushkin pop up on Yelp. \n\nPushkin did a great job of mixing some traditional Russian dishes with some more integrated ones. The pilmeni are pretty good (not quite my mother's), but I will tell you Russians never put seafood in them. The piroshki are very good, and are nice and filling. \n\nThis is a quick stop for your lunch needs in downtown SF.", "author": "Nikita K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "I really enjoy the pelmeni here. I've had both the beef and chicken, both are good, but I slightly prefer the beef with all its dill goodness. There's a long line, but it moves decently fast and the counter man is pretty friendly.", "author": "Max P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "The pelmeni are spot on. It's great to have such quality and value. Best I've had since I left Chicago (lots of Eastern Europeans there)", "author": "Willnero P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Great place for a quick Russian lunch! Surprisingly delicious, quick and good costumer service.", "author": "Pavel K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "This place was pleasantly surprising. They mostly sell dumplings in soup and various pastries. The food looks a little weird, but it is surprisingly good. I would recommend getting a small soup with dumplings and a pastry.", "author": "Wyatt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "Very good!\n\nGot the small chicken pelmeni and the mushroom pirojki [~$11-$12].\nBoth the chicken broth and dumplings (that together form the pelmeni) were really good.\nThe mushroom in the pirojki could have been salted some more, but thats just my personal preference.", "author": "Subrat M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "Wooo. The food here is so good that I felt compelled to give a review. I got the sausage pirojki and lamb dumplings. I think the lamb dumplings aren't even on the website menu yet, but when I went yesterday, they had them on the menu at the restaurant. \n\nWhile the sausage pirojki didn't really impress (I was sausage bits within some sort of saucy innards, the dumplings certainly got my attention. The sausage pirojki was basically like a hotdog, but completely wrapped with this really soft, and nice bread (seriously, the bread is good). The dumplings are sorta like chinese wontons (馄饨), with lots of dill over it (dill is awesome, btw). Seriously amazing in dreary, chilly SF weather!\n\nOne thing to keep in mind is that this place is inside somewhere called the International Food Court, which is below street level. Another thing to note is that while all individual items are under $10, most people probably will probably order two items, which might bring the price up to $$...\n\nInstagram photos:\nhttps://www.instagram.com/p/BYytag1hFGN (Sausage pirojki)\nhttps://www.instagram.com/p/BYyuPfOhfQq (Lamb dumplings)", "author": "Ed W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "This was my first time having Russian food in over 6 years, and it was delicious! You get a lot of food for what you pay for. I got a small beef pelmeni (the cup looks small, but they pack a lot in it!) and a mushroom pirojki. The mushrooms were very flavorful, and the bun itself was great as well. The only thing that I wish were different is the amount of fennel that was in the pelmeni, as I'm not a huge fan of it. Nonetheless, I'm super glad to have found a Russian spot and definitely recommend this place!", "author": "Sharon W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-17", "description": "Pushkin was great! It was tasty and cheap. Perfect for a quick lunch. My only feedback is that my food was a little on the oily side. It's as if they meant to pan fry it but didn't pan fry it long enough and therefore had excess oil. However, I didn't have that \"I just ate too much oily food\" feeling afterward. The good news is you can't really go wrong with your order because everything on the menu is good!", "author": "Andrew R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-02", "description": "While I do like the food, the guy at this place is mean.  Be prepared to be belittled as I was just received.  I went to pick up my Mealpal.  He was annoyed that I could not respond fast enough.  Interesting...how am I to respond when there were two of his customers standing in front of me and blocking my view.  This is not the first time.  I am not sure if it is because I am a woman and therefore the treatment is as such.  I may be thought of being sensitive.  I can assure you I am not. My friend was in line to purchase and she had to tell him how could I respond when the two of his customers were still standing there. Education for all.", "author": "Perry H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "Mmm this new pelmeni place is so yummy! I stumbled upon this place while going to the International Food Court for lunch and just had to try it! The dumplings are served warm and juicy with tons of soup in the bowl too! I ordered the large beef pelmini and I think it came with at least 10. Think I just found my new go-to place for lunch!", "author": "Victoria T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-16", "description": "Great spot in a secret underground international food court! The line was long, but quick, and I could see why. I ordered a small size Chicken Pelmini and it was the perfect size for me. It was about 8 dumplings in broth, and I added the scoop of sour cream in top. ( I count macros so it was the day I needed) All the textures and flavors went together perfectly and the quality of the broth tasted fresh! You could see the cooks making everything in the back which I valued. The service was friendly and the food was ready in 5 minutes. For my first Russian food experience, it was a great one.", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Pushkin might be my new favorite lunch spot in FiDi.  Located in the International Food Court, Pushkin is an excellent option for lunch on weekdays.\n\nI tried a few different options this week: chicken, beef, and lentil pirojki and chicken pelmeni.\n\nThe pirojki was all excellent, if a little dry. I wish there was an accompanying dipping sauce or something of that sort. All three options were very flavorful.\n\nThe pelmeni comes in a soup container and has some of the broth that they use to cook the dumplings. They're basically a cross between a dumpling and a ravioli.  I was a HUGE fan on these.  Looking forward to coming back in the near future!", "author": "Nick D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "I love Pushkin! I love their chicken pelmeni. The broth is so flavorful and not too heavy. It's not just any dumpling; it has its own flavor. It's the perfect comfort food on a windy day. Add the sour cream too, and savor layers of flavor until your bowl is empty. If you get large, you'll be very stuffed by then. I suggest small for light eaters  and a nap afterwards.", "author": "Liz H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-11", "description": "It's located in an underground food court called International Food Court, not the best place to be on a sunny day. The person taking the order was not super helpful. I've had Russian food several times but when I ask you what's good I want to know your specialty, everything can't be the best. But, I know Russians' style, so was not bothered.\nI got Borsh, Chicken Pelmeni and Beef Pirojki. They serve the Borsh hot, it's quite chunky and flavorful. Beef Pirojki's bun was crunchy on the outside and soft as you bit into the center filled with minced beef. It was not as oily as the ones you get from Anda Piroshki. But the winner was Chicken Pelemi, with perfect texture, rich flavorful filling and light delicious soup. I'll come back for those!\nDetailed review:\nhttps://medium.com/@wander_to_eat/dumplings-at-pushkin-9908037b27de", "author": "Kritika K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-04", "description": "I came here today to try the borsch, unfortunately by 2pm (when I finally made it here) they were sold out of it.\n\nWe tried:\n- pelmeni beef\n- pelmeni chicken \n- beer salad\n- beef pirojok\n- potato pirojok\n\nI enjoyed all but the mashed potato pirojok. The stuffing was not mashed using a masher, but rather tasted like potatoes were mashed with submerged hand blender, so it made it gooey and more starchy. Not fluffy like my mom used to make. \n\nFor 2 people and 20% tip it was $35, which is a great deal in my opinion for all that food that we got. I now satisfied my Russian food cravings for a while and ready to go back to the Netherlands and not to plan to open my own Russian restaurant in Amsterdam :)", "author": "Anelya S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-01", "description": "Mediocre food served extremely slowly at a high price. Avoid during lunch time. I waited 15 minutes for a small borsh that I ordered.  Rude staff to boot.", "author": "Derek n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "New addition to the International Food Court. Never really had Russian food before and this place was good. Friendly service and super fast. \n\nBeef Pelmeni-beef, onion / in broth-Super good and filling. For a small size there is so much. \n\nChicken Pelmeni-chicken, basil, Parmesan / in broth-I'm glad the chicken and beef are seasoned differently. Just as good, but a bit weird w/ the Parmesan on top. That needs to go. \n\nMushroom and onion Pirojki-lots of filing and their bread is nice and fluffy.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Pushkin is delicious and a rare find!  My favorites are Borcht and Pelmeni, but everything else is amazing and fresh as well.  Highly recommended and great prices.  Trust me I am originally from Moscow, Russia and a tough Russian food critic.  Some items are even better than Mari Vanna Restaurant in New York and DC.   If you haven't tired it yet.  Go ASAP!\n\nSERGEY, can you guys add yourselves to Uber Eats and Postmates so I can order lunch to the Marina area? That would be awesome.  \n\nThanks!", "author": "Christina Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "Pretty darn good!!!  Wish the mushroom hadn't sold out before I got there. I'll have to go back and try.", "author": "Ola P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "The pelmeni are outstanding, albeit pricey. Get them to go -- this isn't a nice place to sit and eat.", "author": "Carl B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-03", "description": "Very disappointing!!! I had mushroom piroshki, rubbery and tasteless. This stand is trying to pass as a Russian food but it's hardly that. Maybe Ukrainian? Pushkin", "author": "Heda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Good dumplings, and fast service. This place is great if you are in the area!  I would def. be coming back to this spot for some good soup and dumplings.\n\nThanks for making me a happy jew!", "author": "David F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "I just arrived in San Francisco, and I was searching for some dishes my mom and grandma were cooking for me (I am Ukrainian). Pelmeni is my number one dish in our cuisine, and believe me - I know how to make good pelmeni and how it should taste. This place has absolutely fantastic pelmeni! Highly recommended! (try it with sour cream, and add a bit of pepper - yummy)​", "author": "Dmytro Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Super delicious! I had the potato and mushroom Vareniki and wow!!!! The dumplings were amazing- pan fried but not overdone, wonderful flavor and very filling. I also tried the sausage Parojki and it was equally delicious. Fast service for how busy the food court was which was great. Can't wait to go back again when I'm in the city!", "author": "Amber H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Holy crap this place is good. New favorite lunch spot in the area, by a WIDE margin.\n\nI'm not super familiar with Russian/Ukrainian food but i'm pretty well acquainted with Polish food, which is closely related. For a long time i've had a little empty place in my soul that i used to fill with pierogi and borscht from the mom-and-pop Polish joints in Brooklyn (which one assumes are now searingly hip bulgolgirrito spots, or craft pickle juice bars with the best poke tots in the 5 boroughs, or whatever. but i digress). This spot not only fills my hole [rephrase before publishing], indeed my hole now overfloweth [seriously, don't forget to rephrase].\n\nPossibly the best borscht i've ever had. chunks/strands of tender beef, super flavorful, i think the cabbage in it is sauerkraut but don't quote me on that. My other favorite is the potato vareniki (same as the Polish pierogi), topped with lightly caramelized onions and sour cream if you want it (you want it). [edit: sadly they have replaced this with potato and mushroom, and mushrooms are obviously gross. sadness ensues.] The pirojki that i've had have all been good too.\n\nWhenever i have this at work people follow their nose to my lunch like oOoOo what's that? and i basically turn into an enthusiastic commercial for Pushkin. \n\nListen, i love this place so much i didn't take off a star for closing at TWO IN THE AFTERNOON. I mean the SF food situation, especially around FiDi, is basically a competition to see who can spend the most hours closed, but literally nothing should close at 2pm. But again, this business is surrounded by others that are closed more than they're open, so i grudgingly accept that this is just the way of The City. Sigh.\n\nEat here. Early and often. And pray that someday you can also eat here slightly later and often. I honestly think i could eat this every day. Dammit, i really want some now but they're (say it with me) currently closed.\n\nBut seriously this place is the truth.", "author": "Taco P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "2  adjectives to describe- yummy and friendly!  A Perfect spot to have a quick lunch, enjoy the world famous Eastern European dishes ( borsch, dumplings and piroshki) and NOT to get well-known Eastern European mean and rude service . The stuff was  polite and courteous and  served me  enthusiastically though they were closed   ( I came at 3p.m.) . I don't have any complaints about food - borscht was nourishing and light at he same time, and not short on meet ( no extra charge for extra sour cream :) ),baked ( not fried !!) chicken  pirojek was soft and juicy  ! Next time i'll try dumplings with salmon! I wish they had solyanka(((((", "author": "Vadzim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "No criticism comes to mind, neither constructive nor negative. Of the dishes I've tried, every component has shone. And service has always been efficient and friendly, notwithstanding difficulties with the crowded space. I can't say the same of most, if any, of the places I frequent or recommend.\n\nI'm a little surprised it's lasted this long as the proprietors' skills are top-notch. I have no doubt they could open a traditional restaurant and garner rave reviews. OTOH, I suppose part of that skill is recognizing that such food is most profitable (if it's profitable at all outside the local Eastern European communities) as a convenient, quick lunch.", "author": "William A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "This place is absolutely delicious! The food is authentic Radion handmade by I believe Russian/Ukrainian people who are extraordinarily nice and helpful. Complementary sour cream is also for offer. The Porsche is incredible I have tried the piroshki and the vareniki.  I myself am Russian and grew up with these foods and I am extremely impressed with the quality and taste from us! It is located in an international food court and I would absolutely recommend this place to anybody who wants the wonderful experience of this culturesCuisine! Must try", "author": "Karina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "This is the quintessential hidden gem of the Financial District. Amazing polish food prepared everyday. Particularly great to have the dumplings in broth on foggy days in SF. \n\nI'm a huge fan of the salmon dumplings in broth. Friendly staff, good price, and very fast.", "author": "Marcel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "Good, simple, comfort food. I've tried several of the pirojkis and have yet to find one that wasn't delicious. My favorite menu item though? Lamb pelmeni. They're little dumplings filled with lamb, floating in a light chicken broth. The dumplings aren't salty, they're well-seasoned. The bowl of pelmeni is then finished off with a sprinkling of fresh dill and parsley. So good. Bonus: you can order frozen pelmeni to go!", "author": "George K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "Took me back to when I was in Moscow. You kind of get the Russian treatment too... -- the worker doesn't smile nor really conversate with you just like my observations over there. It's pretty normal. -- I enjoyed the food. Hit that craving I needed. Now, back to spicy foods!", "author": "Anna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "Everything is so fresh and delicious. I have been going there for almost a year and never been disappointed. The lamb pelmeni are to die for. Also the vareniki, and all kinds of pirojki are worth trying. My favorite flavor is the cottage cheese and apricots. Sometimes they have a special pirojki with cabbage and carrots, soo yummy. Their customer service is outstanding, and cleanliness is the best I have seen in FiDi.", "author": "Gergana N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "Delicious food, I would definitely recommend getting the pelmeni from here!", "author": "Aaron P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Great lunch spot in fidi. Fast, quick, and definitely a good alternative to the sandwich shops in the area. There were a number of Russians / Ukranians in line so imagine this was pretty authentic", "author": "Kenzan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "Stumbled across this place for lunch when headed to the international food court. The kind gentleman behind the counter suggested a few things from their limited menu and I ended up with beef dumplings and a potato and bacon pastry. I won't even try to correctly spell the names of each of these because I will only embarrass myself :) The food was excellent. The dumplings were very tasty, although the broth they were served in was somewhat bland, despite plenty of dill seasoning floating around. The pastry was excellent. I added plenty of sour cream and mustard to it and it was great. I'll be back here to try more of their menu!", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "Delicious and quick Russian food! With quality a notch above many of the other IFC vendors. It all looked so good coming out of the kitchen i ordered three things: borscht, mushroom piroshki and chicken pilmeni. Way too much food for an individual lunch, but I ate it all anyway. The mushroom piroshki was packed tight with very savory mushroom filling; the chicken pilmeni came in a light broth, but lots of dumplings even in the small size; and the borscht was surprisingly rich, with shredded beets and little chunks of beef. They even have sour cream you can add yourself to the borscht. There was a line, but the staff moved it along very quickly, and there was almost no wait -- even though they warmed up my piroshki in the oven. Great stop for a winter lunch.", "author": "Rob K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-20", "description": "not great!\n\ni had the beef dumplings which were subpar and not very flavorful. the bacon and potato piroshky didn't taste great together and the flavor felt off. \n\nperhaps try something else when you come here!", "author": "Cathy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "Never really tried Russian food before, but this place did not disappoint. I ordered the beef dumplings and Mushroom Pirojki. The dumpling is flavorful and was of decent size. The Pirojki was really delicious. They did not skimp on the filling and it was full of sauteed mushroom and onion in every bite. I was worried the veggie Pirojki was not going to be bland, but it was seasoned very well. I would come back and try the other flavors.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "The people that work here are super nice and it gives you a nice feeling to support local businesses. They are probably the owners and do all the work themselves. They run a super clean shop! There are no meals, here. Everything is a la carte.\n\nIt was my first exposure to Russian food. I didn't like most of the stuff I tried, but to me that is dangerous. The thing is, he has these small sour cream containers as a condiment and when I didn't like the flavor of something, I would take sour cream in each bite. Well, I'm not used to it, and I ate lunch, yesterday, but it is early morning, the next day and my heart still feels funny.\n\nThe single dollar sign might be inaccurate, since you buy so many individual items to make a meal that you end up spending $15 on lunch without giving it much thought. I'm not sure of YELPs price points and cutoffs.\n\nThe sour cream is good quality! I really liked the spinach Pirojki, but the other pirojkis were okay. They cleaned the spinach perfectly, there was no sand or pebbles in it.  Also, be careful of their very limited hours if you are coming from far away. It is easy to get excited about this little restaurant and its exotic cuisine, but it is best to keep balanced.\n\nIt's not their fault. They are very generous with the sour cream. They work really hard! If you are overweight or have a heart condition, maybe limit yourself to one dish at a time, if you intend to use sour cream. By all means, I recommend the restaurant and I hope to return there. Actually, the food court is dirty and run down, but Puskin is a spotlessly clean oasis. in the middle of it all.", "author": "Louis M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-17", "description": "A low risk option to try everyday Russian food. Go with a friend to sample across the menu!\n\nFOOD: Solid, filling staples with good flavor.  I appreciated the sour cream and garlic on the side :). I would have liked a sauerkraut option to punctuate the richness of the food with a bite of vinegar. \n\nPotato vareneki - reminiscent of a pan fried pierogi. The texture was nice and crisp on the fried side and the potato filling was smooth. That said, be sure to eat with the caramelized onions on top, as it is a bit bland without. \nMushroom pirojki - while the bun was delightfully fluffy, the mushrooms tasted one dimensional. I think some meat or a strong/sharp cheese added (hope this isn't heresy) would have added nice contrast. \nChicken pelmeni - while but bland compared to the beef and texturally uninteresting compared to the potato, I would have been happy enough had I not tried the others. I could not taste the cheese in this. The broth was flavorful and a lovely finish to the dish. \nBeef pelmeni - according to my Russian colleague, these are the most authentic item there (though we did not try the bleach). I enjoyed this a great deal! In completely non-Russian terms, it had the wrap of a pierogi and the inner flavor of an excellent burger. I mean this as a compliment! Would have been great to get some of that onion action on the beef too. \n\nSERVICE: it's a pay and go stand, as are all restaurants in the International food court. Our cashier was friendly :).\n\nAMBIANCE: the International food court can be overwhelming, especially on a hot day. While it wins no points for decor (separated, tiled rooms with plasticky seats), it is clean enough thanks to the staff and bright enough with friends. On a nice day, you can take your food outside to a patio or the nearby Crocker Galleria to enjoy it.", "author": "Helen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "Small menu, but everything I've tried so far is delicious. Judging from the photos and what was available there the couple of times I went, what's available changes though it looks like there are some staple items.\n\nBorsch has great flavor, a bit of acidity, and braised beef with great texture and flavor reminiscent of the beef in Asian beef noodle soup.\n\nVareniki is delectable, but it's hard to imagine how anyone would dislike a dumpling filled w/ potatoes that is fried and served w/ caramelized onions.\n\nPelmeni... I confess that I'm a huge dumpling addict, but I'm also very picky.  I only had the beef pelmeni, but will definitely trek back to get more.  Reminded me of a great version of Tibetan momos, but served with savory broth.  Spiced nicely with great beef flavor.\n\nAlso had some delicious beet salad that also made me feel good just eating it.\n\nCan't wait to go back to see what else they serve up.", "author": "S T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "Tried Pushkin for the first time today. Loved the food and service, so 4 stars.\n\nTook one star out because my $9.50 lunch was not enough for lunch.\nI got one Chicken mushroom savory bun and one small \"Fresh\" salad. \nThe salad was like cole slaw, not something I expected. Was hoping it will be like a salad with veggie chunks instead of grated veggies. May be consider renaming it apporpriately?", "author": "Parminder Nayyar C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "I stopped by today, since I've been looking for Russian food near by for a while and this place has been on my radar.  I ordered lamb pelmeni and apple piroshki.  Both were delicious.  The pelmeni came in light broth and a cup of sour cream.  They were hot and super fresh.  I'll go back to try more stuff on their menu, but so far I love it.", "author": "Maria P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "Great pirojki, very tasty borsh. Pelmeni are ok.\nLimited selection of beverages and desserts.", "author": "Anton B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Pretty delicious.  Kind people, too.  Only issue is they were out of a few Pirojki flavors.\nI had salmon Pirojki, Spinach Pirojki (the best), and Potato Vareniki.  All were delicious!", "author": "Idris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "I come here about once a week. Food is delicious. Seriously the best dumplings I've ever had.", "author": "Brian R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "This place is fantastic! The dumplings are made fresh right in front of you, cooked to order, and are incredible, don't forget the sour cream! If you are craving Polish style pierogi the vereniki totally fills the craving. Also first time trying borsh and it was delicious. Awesome new addition to the food court.", "author": "John A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "I am so happy that finally there is a great place to have tasty Russian food in FiDi. It's delicious, quick, affordable and topped with friendly service. I've been here several times already. Beef dumplings and borsch soup must have. So good and tastes just like back home:) all my coworkers absolutely love it!", "author": "Anastasia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "It's  decent Russian food. I had lunch there couple of times. My fav would be mushroom pirojki and my hubby calls them Russian empanadas.  It's a great dish to try from Russian cuisine and not too weird. To me personally it seems a little overpriced but what wouldn't you do just not to cook!  I definitely will pay an extra $ rather than bake myself so I'll be back for more!", "author": "Katerina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "Good addition to the International Food Court! \n\nI really enjoyed their borscht, and my Russian colleague vouched for its legitimacy. (Whatever ... the fact that it is delicious is all I care about.)", "author": "Todd H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "These Pirojki (baked buns) are sooo amazing!!!  I have been there three times since this place was opened! I am hooked on these Pirojki!!!  They are my new miniPizza ! Pelmeni (ravioli) with beef and mushrooms/potatoes are absolutely authentic and so juicy! Yummy!  I eat them with sour cream. Guys, you should sell pelmeni frozen as well!  I grew up eating European food and I'm not a fun of Indian and Asian spices, that's why It was such a problem for me to eat out in downtown. Thank you, thank you, Pushkin, that you are in FiDi now!", "author": "Albina J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Took borsch and pirojki. They're awesome! Borsch is much better than I even expected! Next time would try out dumplings.\nFinally found a good comfort food in FiDi that I'm used to.\nLooking forward to see more items on menu list.", "author": "Anton M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-05", "description": "This place is super cute and the employees were very kind, so I can't bring myself to give them less than 3 stars.  However, I could barely eat the traditional soup (borscht)....it was almost all beets & onions and a tiny bit of beef, with no flavor.  Maybe that's how it's supposed to taste?  We split some beef dumplings in broth, which were good.  They also sell buns to go.  Portions are generous and prices reasonable for SF.  I won't go back, but it wasn't a bad experience - just not to my taste.", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-13", "description": "Soooo sad they got rid of the squash dumplings. They were my favorite.  Highly recommend if they bring them back.", "author": "Natasha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "It's super tasty Russian food in Financial district. These guys certainly know what they are doing. They serve borsh, pelmeny and pirozhki and everything taste great. My best tip come for lunch as early as you can as they are usually sold out of pirozhki before 1:30 pm.", "author": "Marianna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "Stumbled upon this spot today, lunch hours. \nUsually I go for asian food/ramen/pho so International Food Court is my destination. \nPushkin, though, is a new spot.\nTried there baked pirozhki. Primo dough! delicious mushrooms inside. (just delicious, no magic). \nPrices are cheap too - $6 for a decent portion of vareniki with potato. \nCame with Siracha+Mayo sauce, yum.", "author": "Zhenya V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "I was surprised how delicious the dumplings, I tried everything. My favorite dumplings with chicken. The best food!", "author": "Nataliia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-16", "description": "The only options are soup, dumplings, or baked buns. Kind of a random combination. \n\nI opted for the beef dumplings as it seemed more filling for lunch. The large came with 15 rather large sized dumplings. The dumplings were a bit lacking in flavor. It seemed like something was missing, maybe some more salt or a little spice? Same with the broth. It was a bit under flavored. There was so much oil sitting at the top of the soup. Could be a good sign because it might be real, homemade beef stock? But it was so oily that a greasy film was left on my lips when drinking straight from the bowl. \n\nI would return to try their buns (they looked so tasty). But will not be indulging in their dumplings again.", "author": "S. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "Delicious piroshki!! Just like back in Moscow! Unfortunately I had already had lunch when accidentally found this place, but I couldn't resist and bought couple mushroom/potato piroshkis to go. So yummy!! Definitely will have go back to try more of their stuff. Highly recommend!!!", "author": "Lena G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "Love this place. Fairly priced, very high quality food. You can tell the effort and love that goes into it. The perogies are homemade, topped with lots of onions, and there's a ton of sour cream if you want it.", "author": "Tyler G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "First I never would have found this underground market if not for yelp. The market has Thai, Vegan, Vietnamese,and Russian counters. Pushkin is awesome! They have these meat filled dumplings my wife had that were light but filling. Great flavors. I had the pastry slightly larger than your fist. It was filled with spiced hamburger meat...perfect flavor. Also had one with ground polish sausage. The pastry is light and not overbearing. Go try this place out you will not be hungry after and will be very satisfied. BTW kudos to all who work there very friendly and patient.", "author": "Christopher D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "Thank you for pleasant memories from childhood!!! So awesome tasty traditional Borsh, dumplings and pirojki !!!", "author": "Lilia O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "delicious and very authentic. Brought my Ukrainian nephew here for lunch. We had the beef pelmeni and a pirojki. Both were very good and filling and, according to my nephew, just like what he used to have back home.", "author": "Candace H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Hot New Biz! Get the borsh, really good. Small size is plenty. Good pirojki selection too, super fresh!", "author": "Dejana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Finally. Simple delicious Russian food in downtown SF!!\nThe couple working there (might be owners) speak perfect Russia and English.\nWe had beef and chicken pelmeni (dumplings) - you can ask for a mix (as I couldn't decide), borsch, piroshki with beef and with mushrooms. The salmon ones are also supposedly good (but is with cheese, and I don't eat it).\nAs a Russian, can vouch for authenticity. And am glad to finally have a normal Russian restaurant for lunch, that's reasonably priced, within walking distance from work! \nHope they make it work and stay open :-)", "author": "Stasia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Now that Pushkin has settled in and has a month or so of operations, I'm proud to report that the kinks are gone, the menu is expanded (more types of pelmeni and pirojki, beef and onion crepes, and some other stuff), and everything is still delicious.  There's something appealing about the homey nature of the outfit -- Sergei's infectious enthusiasm at the counter, is partner (I don't know her name), moving fluidly (and on her own) in the open kitchen cranking out large quantities of dumplings -- that adds to its charm.\n\nIf you find yourself in the Food Court, definitely check out Pushkin!", "author": "Eric G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "After trying the food for the very frist time... I have became addicted and it's simply A.M.A.Z.I.N.G!!!! :) it's a weekly visit for me now to this place :) Very friendly and quick service to get your food and get out and taste & smell those awesome aroma of garlic and basil in chicken Pelmeni!!! :)", "author": "Andy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "Best perogies I had since being out in the Bay Area. Too bad only open for 3 hrs during business hours. Wished they were open on weekends as well. Get the potato perogies.", "author": "Jake W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "I'm a huge fan of Borsch soup so I had to come when I saw there was Russian food in the heart of FiDi! I got an order of Borsch, chicken Pelmeni, and a beef pirojki. I devoured every last bit of deliciousness and am about to be slammed into a food comma. It's so good I'll definitely be coming back for lunch again!!!", "author": "N C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "I love this place. Right near my work. My new go to! Service was friendly too!", "author": "Elisa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "These dumplings are definitely the bests ones I've ever tried. Also, the prices are great. I always try to come to this place every time I'm working in a nearby place to get the lamb dumplings and the beef pirojki.\n\nFive stars for the customer service too, as the owner is always very polite and taking care of his customers very well.", "author": "Diego O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "Best piroshki I've ever had. Lots of variety but my fave is the mushroom. Since they're in this food court, it's a quick fix when I crave them.", "author": "Melinda V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "Super delicious for a small fast joint! Love it and an often go to place for quick lunch!", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "I had the pleasure of trying this place today and I am very pleased with how good the food was. I am Russian so I am quite the critic, especially because my mother always cooked hearty and delicious Russian food for me growing up. So my standards were very high. When I saw the ad for this place on Yelp I was very excited to try it out. I got the beef piroshki and the potato vareniki. I am a diehard piroshki and vareniki/pelmeni fan and could honestly eat those items everyday of my life without getting tired. The beef piroshki was delicious and the vareniki were outstanding as well. They boil and fry their vareniki and they were absolutely delicious. I ate my meal in under 25 minutes. The guy behind the counter was also very kind and welcoming and gave great service. I am excited to now have a Russian/Ukrainian spot so close to work for a taste of home. Great job guys!", "author": "Beth G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "I must have arrived at the worst timing! The line was long and moved really slowly, about 3-5 minutes per customer (just to take orders), so maybe that's one area they can work on especially to handle the lunch rush hour. That aside, i did enjoy the beef dumplings I got (flavorful!!)The chicken piroshki was a little dry and tasted just OK but i liked that it had a generous amount of filling. Overall, good lunch spot but I would not wait 30minutes again for this. Hopefully it was just a bad day and the line goes faster next time!", "author": "Claire S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "This is my favorite place! Piroshki is so tasty!! And frouzen  dumpling to go the best choice for weekend!!!", "author": "Mila K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "Great food, reasonable prices... I wish you guys were open weekends! Add Kvas to your menu;-) I'll definitely be back!!!", "author": "Kat Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "I don't usually frequent the international food spot  cuz I have a weird thing about dining in basements, I feel closterphobic.  Anyway, I saw the sign for Russian food, which I don't see very often so I had to drop in.  The guy behind the counter was super sweet and gave be a description of their entire menu.  Small menu but they're new and it looks like they change their items often.  He let me sample the borsh which I've never had and it was amazing.  I ordered the chicken piroshky and pelmeni.  Warm comforting food and the piroshky is the best I've had so far  because the dough was fresh and the mushrooms were flavorful.  I'll be back Pushkin.  Cant wait to try more items.  Good Luck!!!!", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "Went there for lunch today.  This time, had chicken pelmeni, salmon pirojki.  Damn!  Damn!  Too  great!  Two reasons this place doesn't get five stars:\n\n(1) the borscht from last time wasn't five-star\n(2) the location is ... well, sheesh, that food court isn't the greatest.  Crowded, too noisy, no garbage cans.  Did I mention crowded?  And it's not that there are a ton-ton of people.  It's just too small.  I guess I shouldn't complain -- the food was still great.\n\nMy second time there, and my clairvoyance sees lots more in the future.", "author": "Chet M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "Food is absolutely stunning! Piroshki are very fresh and delicious. Will definitely come back!", "author": "Max K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "Great weekdays lunch spot. The location is usually overcrowded and it may be difficult to find some seats, but the cuisine is really authentic and well made and the owners are kind. I would strongly recommend to try their borsh with shredded garlic and a sour cream - it's outstanding. Wish their business to prosper.", "author": "Konstantin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "My ethnic background is Chinese, so I don't know much about pelmeni or Russian food generally, but I have eaten a lot of dumplings in my life, and the beef pelmeni at Pushkin are solid.  The meat is nicely salted and not overcooked, and the dumplings skins are thick and chewy without being doughy -- exactly how I like them.  The \"fresh salad\" was fine, nothing particularly special and not worth the $5, but I'd come back anytime for more pelmeni.  I have no idea if they're authentic, but they are certainly tasty.", "author": "Matt Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-27", "description": "I liked the food! I had the borscht and the chicken pelmeni. The pelmeni (dumplings) were delicious - filling, flavorful and not a bad portion for the price. I liked the borscht but it was a bit expensive considering it was really mainly shredded veggies and not a lot of meat. Not a huge like and quite fast to get our food, i look forward to going back.", "author": "Anne M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "Listen. I've eaten a lot of Borsh in my life. Coming from an overbearing Russian tiger mom, I became a borsh expert. But I have to say there is no borsh like Pushkin's. It's not only light in flavor but filling as well. It's better than my mom's. And the pirojki are beyond excellent.", "author": "Tanya B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Love this place! Authentic Russian food. Employees are speaking both Russian and English and very friendly. Coming here almost every time for lunch when I'm in SF.", "author": "Aleksandr R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "A new place in the International Food court. I had the piroshki (probably spelling it wrong) one potato that had bacon and onions and one beef with onions. Both were really good with the filling to bread ratio perfect. They were filling and decently price for FiDi. I Plan on going back for dumplings!", "author": "Bianca F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-02", "description": "8.50 for two bland pirojki (potato, spinach) seems excessive. The person at the counter wasn't polite, and made me feel like I was wasting his time. No thank you.", "author": "Xavier C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "I tried red botch and pelemeni and both tasted pretty good. I m Russian and my mom is great cook, so I believe my standards are high:)", "author": "Pauline P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "Incredibly delicious and very authentic. As close as it gets to home cooking, and my Non-Russian colleagues, who have nothing for comparison love it as well! The beef pelmeni are my favorite and remind me of home, and the beef pirogki hit the spot every time. The menu is very simple and the owners are very welcoming. I rarely write reviews but this was a must!", "author": "Izabell B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "That super fresh parsley made my beef pelmeni all the more delicious! Yum. Will definitely be back.", "author": "Kinga L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "I went for a lunch to check out this place today. I ordered small Borsh, pelmeni and mushroom pirozok. Everything is fresh and tasty!", "author": "Olga T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "Finally authentic Russian Food for lunch! Fresh and delishious!", "author": "Lizzz K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "Only tried the dumplings so far.  Very fresh and tasty. I ordered a small serving. You get 7-8 and you can ask for a combination of beef and chicken. They were surprisingly filling. They come in a clear broth and sprinkled with fresh dill. There is sour cream available on the side.", "author": "Priscilla C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "Delicious and fresh food. This place is great. The underground food court ambience isn't the best, but it's gotten a lot better than it used to be.", "author": "Christine B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Borsch and chicken pelmeni are delicious. The dining area in this food court is dodgy, but it's worth a trip down the stairs to get to this gem. Their food is all packaged well for take-out and super yummy. Don't forget the sour cream!", "author": "LISA K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Tried this hidden gem for the first time yesterday. Pirogi with meat and pelmeni with beef was delicious and fresh, just like my mom makes! Great and friendly service. Will be back for sure to try other flavors!", "author": "Alla S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Holy beans I got a mix of the beef and chicken dumplings so good and the broth was great made me feel whole lots better.", "author": "Ryan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "I fell in love with Pelmeni (dumplings) when I studied in St Petersburg. My heart skipped a beat when I saw the sign for this tiny Russian lunch spot.  Pelmeni in a hurry....game on!  So yummy.", "author": "Erika J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Excited to have this downtown. The plov (Uzbeki pilaf with meat) was very solid and I'm looking forward to trying the borscht, pelmeni and perogis. If you've never tried any of these things, you are missing out, give it a shot!", "author": "Jason M."}
